{
    "id": "141dqte",
    "score": 1522,
    "title": "Street Fighter 6 has hit 1 million players in its first three days",
    "author": "NeoStark",
    "date": 1685969875.0,
    "url": "https://www.reddit.com/r/Games/comments/141dqte",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "The difference between SFV at launch and SF6 at launch is night and day. SFV was practically rushed out the door, with promises of a story mode and arcade modes being added in the future. Then you have SF6, which has an entire fucking city in what feels like a love letter mishmash between Yakuza and Street Fighter.\n\nCapcom’s new gimmick is that they make great games now, and I love it.",
            "score": 803,
            "author": "Tenno_Scoom",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm not much of a fighting game player but even I'm eyeballing 6. Looks fun, looks gorgeous, and i like the idea of making my own fighter.\n\n\nMost importantly with everything Capcom's doing lately; hopefully Dragon's Dogma 2 is an absolute slam dunk",
                    "score": 262,
                    "author": "neonsaber",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The fun part about Street Fighter 6 is that they introduce modern controls that help people who are new to fighting games to get into it. With the recent success of the Resident Evil franchise and also Monster Hunter, I'm confident that Capcom is gonna nail it with Dragon's Dogma 2 as well.",
                            "score": 128,
                            "author": "SlamMasterJ",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As someone not really into fighting games what exactly is different from a control perspective?",
                                    "score": 25,
                                    "author": "justhereforhides",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Modern controls offer simple autocombos, one button specials/supers, and a simpler overall set of options. This comes at the cost of not having access to all of your normals and a damage reduction on the easy input moves (you can still do the input to get full damage).",
                                            "score": 50,
                                            "author": "Alteffor",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh very interesting thanks!",
                                                    "score": 7,
                                                    "author": "justhereforhides",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It’s a lot easier to combo, throw out special moves. I play classic but i have seen plenty of Modern control players online and their pretty decent",
                                                            "score": 13,
                                                            "author": "EnterTheWuTang47",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I've been playing with modern since I'm new and there's plenty of combo opportunities outside of the Autos. Some of the combo trials for modern controls can be pretty hard.",
                                                                    "score": 2,
                                                                    "author": "CaptainMcAnus"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "How much is the damage input reduction?",
                                                    "score": 3,
                                                    "author": "MGPythagoras",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "20% reduction on easy input specials",
                                                            "score": 10,
                                                            "author": "Alteffor"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Woah you can still do classic combos when you're playing Modern? That's super cool! Man I never really played a fighting game but that SF6 is really looking awesome.",
                                                    "score": 2,
                                                    "author": "Fastela",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "With modern controls, instead of doing motion inputs, you can do special moves via a direction + the special move button, sorta like in Smash Bros. You also have access to different autocombos by mashing the light, medium, or heavy attack buttons. There's also a button you can hold down while hitting those autocombos to enhance them with super moves if you have super meter available.",
                                            "score": 12,
                                            "author": "dale-is-trash"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Introduced well *and* being actually good Modern controls. Even for vets, it's a good change of pace to use it for World Tour mode.",
                                    "score": 68,
                                    "author": "Nanayadez",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm absolute dog trash at charge characters and I think modern controls may help make them fun for me!",
                                            "score": 29,
                                            "author": "IHadACatOnce",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Try and learn Guile. Probably the easiest charge character to learn. Only two special moves with simple inputs and both are essential for controlling a fight. You'd probably be surprised at how far mastering flash kick and sonic boom can get you. Learning anti-air and zone control (which are what flash kick and sonic boom are used for) can probably get you to silver on their own.",
                                                    "score": 19,
                                                    "author": "DeadCellsTop5",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Any tips for Zangief? That's the big block for me, I've played fighting games every chance I get since SF2 but I can't do that motion to save my life",
                                                            "score": 7,
                                                            "author": "SamandSyl",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I remember playing Zangief as a kid and figuring out the way to do his 360 input moves was to start the input while your character was locked into another action, just before it completed. I particularly liked hopping forward with an attack and going for a spinning piledriver grab as I landed. I feel like that hop attack into 360 input was my most consistent way to use it.",
                                                                    "score": 6,
                                                                    "author": "Jenkins_rockport"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "There are some motion shortcuts around iirc\n\nassuming your direction are as they are on the numpad\n\nYou know how some commands are like 6 3 2 1 4 ? You can just do 6 214 for those.\n\nAnd for the full round commands (63214789) you can just do 63214 9 instead, you don't need to do the full round. If you buffer it into other moves you can also avoid jumping.\n\nRecommend having a look at this\n\nhttps://www.youtube.com/watch?v=t61jfWxWHII",
                                                                    "score": 8,
                                                                    "author": "OFCOURSEIMHUMAN-BEEP",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Zangief my fav since 2, try jumping then the 360 as you land for spinning pile driver, eventually you can do the 360 while blocking.",
                                                                    "score": 3,
                                                                    "author": "yoghurtorgan"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Another tip is you don't have to do the whole 360 spin. If you do halfcircle + the next diagonal, that's enough for his grabs. This lets you just whip out the move without having to jump or put something else in front of it.\n\nAs for actually playing him more generally? You are a glacier slowly walking your opponent into the corner and crushing them. Play patient in the knowledge that if you keep walking them back because they fear your huge attacks and grabs, eventually they will have to try something risky to get out, and that's when the fun begins.",
                                                                    "score": 3,
                                                                    "author": "Wccnyc"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Nah, he's a character I'm not familiar with.",
                                                                    "score": 2,
                                                                    "author": "DeadCellsTop5"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Definitely DD2 is going to be a masterpiece. 👌",
                                    "score": 3,
                                    "author": "drembose"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You can make your own fighter?! Okay, that has even me interested, and I have no interest in Street Fighter.\n\nHow does movesets work? Do you just copy the movesets of existing characters?",
                            "score": 9,
                            "author": "MrManicMarty",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "you pick the general style of one of your masters, for example you kick and punch like Ken, and pick and choose from a pool of special moves and super arts.\n\nRight now im playing as a ken that uses Cammy's drill kicks to rush at enemies",
                                    "score": 14,
                                    "author": "mimilured"
                                },
                                {
                                    "level": 3,
                                    "comment": "Not only can you mix and match your moves, you can customize limb length to an insane degree and it affects hitboxes and hurtboxes. My Freak Fighter's got T-Rex arms so anything that uses fists has like zero range.",
                                    "score": 7,
                                    "author": "Puffy_The_Puff"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If it helps with making your own fighter, that creation system is one of if not the most detailed systems I've ever seen. You can truly make a monstrosity, my guy currently is incredibly thick with a neck like a tree and a body like a stack of paper.",
                            "score": 7,
                            "author": "SamandSyl"
                        },
                        {
                            "level": 2,
                            "comment": "I’ve also heard it’s a lot more accessible.",
                            "score": 5,
                            "author": "jotaechalo"
                        },
                        {
                            "level": 2,
                            "comment": "I've been waiting a decade for DD2, even if it's not a hit I'm buying that day 1 (and I'm an avid supporter of not preordering games, I just love that game so much)",
                            "score": 2,
                            "author": "Some-Token-Black-Guy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Tbf, I feel like Day 1 purchase for a game you’re excited for is way more justified than pre-orders because you have reviews and gameplay juuuust in case something went horribly wrong in production",
                                    "score": 3,
                                    "author": "JayZsAdoptedSon"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I've always been a hard NRS fighter and I've been _hard_ considering SF6.",
                            "score": 1,
                            "author": "frauddogg"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Capcom is my number one dev currently, everything they’ve put out since MHW has been fun and refreshing in an era where so many other franchises feel stuck and stale.",
                    "score": 35,
                    "author": "Racoonir",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Resident Evil 6, DmC and SFV is the best thing that happened to Capcom. RE6 and DmC made Capcom realize that them deviating from what made their franchises great is a completely bad idea. And SFV made them realize that brand recognition alone is not a good excuse for them to release a unfinished product.",
                    "score": 71,
                    "author": "jexdiel321",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;RE6 and DmC made Capcom realize that them deviating from what made their franchises great is a completely bad idea.\n\nI'll give you DmC, but to be fair, RE6 went on to become one of Capcom's highest-selling games of all time. The poor critical response absolutely informed the shift in perspective for RE7, but it wasn't like DmC where franchise sales completely cratered. After the success of RE5, it wasn't unreasonable for Capcom to keep pushing the series into an action-heavy direction.",
                            "score": 14,
                            "author": "GomaN1717"
                        },
                        {
                            "level": 2,
                            "comment": "Then they released games like MHW which took the world by storm after being an IP not many knew about but had its ardent fans.",
                            "score": 39,
                            "author": "messem10",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not true. Monster Hunter was already Capcom's 2nd or 3rd best-selling franchise prior to World. Many people knew it back then, and even more know it now.",
                                    "score": 30,
                                    "author": "Zekka23",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In Japan, sure, but the series was still pretty niche in the west before World.",
                                            "score": 68,
                                            "author": "Total-Tortilla",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Also almost exclusively on mobile consoles. There's no promise an audience like that will translate to the mainstream.",
                                                    "score": 15,
                                                    "author": "Hexcraft-nyc"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yea Japan did the heavy lifting for pre-World MH. \n\nMH Portable 3rd, a **Japanese-only title**, is the [3rd best-selling](https://en.m.wikipedia.org/wiki/List_of_best-selling_PSP_video_games#List) PSP game of all time only below 2 GTAs which are sold worldwide\n\nEDIT: it was also the best selling MH game prior to World which proves your point even further.",
                                                    "score": 3,
                                                    "author": "Ordinal43NotFound"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "yeah but the sales compared to pre world and post world are still pretty huge. They went from 4 mil to 21 mil for the base game alone. Sure the game was already Japan's Call of Duty, but it was almost unheard of elsewhere in the world until, well uh, World. \n\nMH never hit the same lows that some of their other franchises did, but their new strategy clearly still paid off bigtime.",
                                            "score": 19,
                                            "author": "BlazeDrag",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They are, but it's misleading to call it a series that \"not many people know\", many did which is why it already sold dozens of millions of copies. Shifting from a focus on one handheld to consoles + PC significantly boosted sales. The console fans were always there because MH started on a console.",
                                                    "score": -5,
                                                    "author": "Zekka23"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "DmC was still a really great game, though. I liked it as much or more than DMC4 (and obviously 2, but we don't talk about that game).",
                            "score": 5,
                            "author": "DeadCellsTop5"
                        },
                        {
                            "level": 2,
                            "comment": "damn, really sounds like lessons learned in a board meeting",
                            "score": 1,
                            "author": "Sumnescire"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I feel like they assumed that \"new Street Fighter\" would generate all the hype they needed with 5. And to a certain extent, they weren't wrong, for some people that's an immediate pre-order. But now it feels like the higher ups at Capcom have real respect for the value of putting out a great package.",
                    "score": 21,
                    "author": "Angrybagel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hadn't played a Street Fighter game since SF2 on the SNES. I don't play fitting games very often, but when I do it's mostly Mortal Kombat. I've been hyped for months about the release of SF6 and I've already put almost 30 hours into World Tour mode. I'm loving this game!",
                            "score": 5,
                            "author": "Zjoee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "World Tour has been way more fun than I thought it would be.  I've barely gone online so far but last night I checked how much time I have in world tour mode and it's already over 20 hours!",
                                    "score": 2,
                                    "author": "DrunkeNinja"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They're in this unique position where they can just pour as much money into making the best games possible and know that they'll sell like crazy. As much as we like to believe that quality equals sales, it doesn't always happen.",
                    "score": 7,
                    "author": "PBFT"
                },
                {
                    "level": 1,
                    "comment": "And for context, hitting this many players took SF5 1 and a half months, so SF6 doing it in 3 days is huge.",
                    "score": 12,
                    "author": "BLACKOUT-MK2"
                },
                {
                    "level": 1,
                    "comment": "We’re in a new golden age of Capcom and it has been amazing",
                    "score": 5,
                    "author": "dan0314"
                },
                {
                    "level": 1,
                    "comment": "Capcom have been making great games since the 1980s. They're the company that made Mega Man 2.\n\nThey just rested for a while but now they're back.",
                    "score": 4,
                    "author": "Minus1000Karma"
                },
                {
                    "level": 1,
                    "comment": "I hope world tour and modern controls come back in 7. Really make the game much more enjoyable for me. I played online last night (never even bother in fighting games) and was nervous as fuck but went 2-2.",
                    "score": 2,
                    "author": "MGPythagoras"
                },
                {
                    "level": 1,
                    "comment": "Not saying they're not making great games now but which other ones are you referring to?",
                    "score": 2,
                    "author": "workster",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "SFV was a train wreck. Good to see a series that learnt from their mistakes and are being rewarded for it",
                    "score": 1,
                    "author": "EnterTheWuTang47"
                },
                {
                    "level": 1,
                    "comment": "It's insane how good capcom is in the present when companies like square enix, bethesda, blizzard, EA, and Ubisoft have all dropped in quality *hard*.",
                    "score": 1,
                    "author": "HanzoXHanzo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Whoever came up with creating Yakuza lite open world hubs with minigames and fun activities (world tour) at Capcom really needs a raise. It's not as polished as other parts of the game but for their first try it's really fun and I hope they keep improving it.\n\n(I copy pasted from the last thread since it's removed)",
            "score": 325,
            "author": "Acrobatic_Internal_2",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think addition of modern controls is another big thing. I know the combos with modern do less dmg but there are even workarounds to that and you get instant reaction to certain things so there are benefits as well.",
                    "score": 106,
                    "author": "characterulio",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wonder If this will increase longevity of the game. The consensus is that modern controls kinda carry you up to a certain rank (like platinum) but then you have to actually invest more time into the deeper concepts of the game like mixups, conditioning, footsies, spacing etc.\n\nA \"casual\" Player might get to platinum now, but instead of being gatekept by combo execution they will probably Hit a wall when they have to actually work on higher gameplay concepts and mental Stack.\n\nSo instead of losing the casual players after a Few weeks in bronce, you now will Lose them after a Few weeks in platinum. At least thats what im afraid of. Its a cool System to get more people to play, but so far its basically Just a crutch to get a little bit of a higher rank, its Not a Tool that actually helps you get better at fighting games",
                            "score": 40,
                            "author": "PleaseSendCatPic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think/hope that moving the gate though will do a lot. The goal of most casuals isn't to climb the ranks, but instead to just have fun for the couple hours they boot up SF each week. With motion inputs and the like, the \"floor\" for having fun is high up enough to where you can't even have fun at Bronze, so then you just stop playing. If you're able to have fun right out of the gate though, it encourages you to stick with the game just for the sake of playing for fun",
                                    "score": 86,
                                    "author": "Galaxy40k",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This just isn't true though. It's not like Street Fighter is an anime fighter with a ton of combos that take 80% of your health and complicated ass inputs. Street fighter is a game where if you can pick Ken and do MP &gt; HP &gt; Shoryu and MK &gt; Fireball you're good enough to have fun against similarly ranked players. If you're so incapable that you can't take 10 minutes to learn how to do a fireball and a dragon punch, why should you be allowed to beat people who did take those 10 minutes?",
                                            "score": -47,
                                            "author": "AlexB_SSBM",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The thing is that casual players don't really want to deal with the deeper concepts either, imo the whole grind of getting actually good with no real progression systems means that fighting games won't really become less niche with simpler execution. The drop off imo is inevitable, but if you can make the experience more fun at the start you can attract more people.",
                                    "score": 27,
                                    "author": "DP9A"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; but so far its basically Just a crutch to get a little bit of a higher rank\n\nI'm going to guess the majority of people who are lured in by modern control do not care about getting high rank haha. At least myself, I don't expect to have anything but a terrible rank regardless of control scheme. It isn't about rank, it's about making the game more approachable and fun to just *play*. Some people find complicated inputs like half circles and stuff just inherently unfun as a gaming experience. I'm not going to play a game that has me doing those all day no matter what my rank is.",
                                    "score": 14,
                                    "author": "shibboleth2005"
                                },
                                {
                                    "level": 3,
                                    "comment": "One thing that give me (as someone on the new player side of things) hope that it will last longer ever after that Platinum barrier, is that there's a huge difference in investment between hitting a wall in Bronze vs Platinum. \n\nFor example, I always hated the idea of labbing. It's just not fun to do. But the main reason why I think that's the case for so many new players like me is that they haven't had a chance to have fun yet. When you're a lot more invested in a game, spending some time practicing is a lot easier of an ask. Having your *first* hour in a game being spent in a practice room is just going to be much more boring than spending your 100th hour in a game in a practice room. And I experienced this myself when I unlocked my 5th special move slot in World Tour, (Which requires you to start doing classic inputs) and after flubbing the input for a bit I was like \"Man I wish WT had some kind of practice room to try out this input more\"",
                                    "score": 18,
                                    "author": "BlazeDrag",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Modern is not even close to a big enough advantage to carry an undeserving player to platinum.\n\nPeople are really overestimating the execution aspect of fighting games lol.\n\nModern will help new playersa little bit, but nobody is going from iron to platinum because of modern; not unless they have a good understanding of fighting games and how to play them well.\n\nAt that point, they deserve to be plat so modern didn't carry them there.",
                                            "score": 26,
                                            "author": "InsanelySpicyCrab",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "lol I was mostly just going off of what the other guy said but my point still stands. With Modern Controls and imo even more importantly World Tour, a new player is far more likely to spend a lot longer playing SF6 than any other fighting game. I know that's true for me already and we're only a couple days into it (and yes that includes smash).\n\nThe lack of a well-thought-out single player mode and the high difficulty wall of execution meant that most players were struggling before they were even inside the door. So they couldn't even really test themselves on whether they could even comprehend the fundamentals let alone more advanced fg concepts. \n\nAnd that's the thing, while there are a lot of fighting game concepts that are super hard to wrap your mind around, a lot of them really aren't. It doesn't take a genius to understand concepts like Whiff Punishing or that you can bypass a throw with a block. A lot of these concepts could probably be learned very naturally through gameplay. The problem was that new players weren't playing the game, they were fighting the controls; and the in-game resources to get better were awful. \n\nSo I feel like you can still give pretty significant credit to Modern because it's the difference between a player giving up on their first play session and just never playing again, and a player actually playing enough to win a few matches and feel the drive to get better.",
                                                    "score": 3,
                                                    "author": "BlazeDrag",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Definitely. I am an oldhead classic player myself but I was able to get my long time die hard anti-fighting game buddy into SF6 and he's grinding ranked and actually grinded out of low iron placements to mid-bronze already.  Pretty awesome!\n\nI love modern controls even though I think they may present some issues for high level play.",
                                                            "score": 3,
                                                            "author": "InsanelySpicyCrab",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "it's also important to recognize not everyone cares about high level play. Sure maybe Modern Controls make it impossible to progress past a certain point, like say Plat for the sake of example, But even a player that loves SF and plays all the time and just has a blast with it, they might never even reach that level of play, and that's fine as long as they're still having fun. Not everyone is gonna be shooting for the top.",
                                                                    "score": 0,
                                                                    "author": "BlazeDrag"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I think it’ll definitely help people that plan to stick with fighting games in general get their foot in the door. Playing with modern will get you to that wall but once you’re there you should have a good understanding of the characters you’re fighting *against* and that’s half the battle when improving",
                                    "score": 4,
                                    "author": "Racoonir"
                                },
                                {
                                    "level": 3,
                                    "comment": "No freaking WAY modern can carry you to platinum lol. Platinum players are generally pretty good.\n\nModern is slightly helpful, especially for beginners but it's the same game with the same strategy space and 90% of fighting games are mental and modern doesn't help with any of the functional mental skill/knowledge of playing fighting games.\n\nDiamond classic zangief here and I can promise you modern isn't carrying anyone to anything except maybe the auto combos will help iron modern players get to bronze lol.\n\nModern does get some objective advantages that may affect high level play but they are counterbalanced by some penalties as well.",
                                    "score": 22,
                                    "author": "InsanelySpicyCrab",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That player is probably pretty good to do that.  I don't think modern grapplers are OP at all and certainly not because of 'easy grabs' the 360 motion is very easy in SF6.",
                                                    "score": -2,
                                                    "author": "InsanelySpicyCrab",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I mean the guy said himself that without modern He wasnt able to climb, so?",
                                                            "score": 3,
                                                            "author": "PleaseSendCatPic",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Sure, and there's a ton of people that can't climb on modern too.\n\nNeeding a little help with execution but basically being a good player that understands the game is not the same as getting \"carried to plat by modern\"\n\nMost people absolutely cannot just switch to modern and get free wins up to plat against classic players. Not even close, probably not even up to high silver.\n\nThe difference between any plat player and a silver is pretty obvious and modern is NOT gonna make up that difference.",
                                                                    "score": 1,
                                                                    "author": "InsanelySpicyCrab",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 2,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "And there are literally thousands of modern players hard stuck in iron and bronze. Why aren't they getting carried by modern into plat?\n\nYour point seems to be \"one guy did better on modern than classic\"\n\nAlright well I would do WORSE on modern than classic. Am I carried to diamond by classic? By your logic that should be the inevitable conclusion.\n\nYour evidence isn't evidence.\n\nLots of people will do better on modern than classic. Lots will do better on classic than modern.\n\nModern will not get anyone to high rank unless they are already good at the game in the many many ways that matter besides special move execution which is actually only a tiny component of fighting game skill.",
                                                                                    "score": 1,
                                                                                    "author": "InsanelySpicyCrab",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Smash is an incredibly successful game and the vast majority of players don’t even know what a tilt is. I think casual players will stay casual, it’s just a small percentage of them will like it enough to go in deeper (which is how it works with all things anyway).",
                                    "score": 5,
                                    "author": "jotaechalo"
                                },
                                {
                                    "level": 3,
                                    "comment": "As others have said, drop-off is inevitable in fighting games.  There are casual players who will never put in more effort than just turning on the game and messing around with Modern controls.  That said, I think the long term goal of Modern controls is to get people to buy-in long enough to care to learn the other aspects of the game.  That choice is still going to 100% be up to the player to care to do that. The longer they had fun jacking with Modern controls in lower ranks, the higher chance they might care to put in more effort.  Will everyone do that?  Not even close.  But, it'll be a higher % than if they didn't have Modern controls imo.",
                                    "score": 2,
                                    "author": "Razzorn"
                                },
                                {
                                    "level": 3,
                                    "comment": "I really fucking hate this idea of \"gatekept by combo execution\". It's asinine. Giving people who don't want to ever learn the ability to hang with people who actually put in a lot of effort into learning the game is a terrible idea. And I'm not being elitist by saying this.\n\nPlus, people who make the argument \"just get better, it's not at top level\" are dumb. Think about it like this. Imagine if there was an option in Counterstrike where you could make the gun auto aim if you are kinda close, but it does half damage. Yeah, CS pros wouldn't ever use it. Yes, you can say \"well just get better and it's not an issue, or just use it yourself!!!!\". But that doesn't change the fact that you are taking the main skill of the game, the main part that people find fun, and allowing an option that lets other people just skip over it. All to appeal to people who won't play the game in a month.",
                                    "score": -16,
                                    "author": "AlexB_SSBM",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Combo execution is not the main skill of Street Fighter.  Modern controls just allow you to get to the part quickly where you're making decisions in neutral, because you don't have to think too hard about how to make your moves come out.  If those people aren't playing in a month, at least they enjoyed that month, and that's great.",
                                            "score": 22,
                                            "author": "gamelord12",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don't think they were talking about \"combo\" execution. They were talking about input execution. Mostly execution in general. \n\n&amp;#x200B;\n\nAnd input execution absolutely informs your neutral game. I'm tired of Modern Control proponents acting as if execution and neutral game aren't inextricably linked and execution is just some ancillary aspects that doesn't inform the gameplay whatsoever. I'm not as hard on Modern as the other guy, but I don't think it's the worst argument that it's letting people skip a large part of the game.",
                                                    "score": 7,
                                                    "author": "ManonManegeDore",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Here's another thing to think about: many people coming in due to Modern controls are really, really bad. Like inherently shit at fighting games bad. This is me. Modern controls don't let me skip anything because I still find it hard to consistently execute *even in modern controls*. Classic was basically impossible. You're bringing in players who were so inherently bad that fighting games as genre were basically 'not for them'. So don't assume some modern control player you're fighting in Bronze is just getting free moves, they're making mistakes and missing stuff even still.",
                                                            "score": 1,
                                                            "author": "shibboleth2005"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "On the streetfighter sub theres a post from a guy who said he was never able to climb out of bronze in any fighting game, but modern control catapulted them to plat. So it seems execution is definitely one big \"main skill\" considering that they jumped multiple skill devisions the second they no longer had to think about execution.\n\nBut thats what i mean. Theres a skill ceiling with modern controls. But BEFORE modern controls existed, casual players would never even come close to any skill ceiling because they were gatekept by execution from the start.\n\n\nBut come on, theres a giant influx of players getting higher ranks than they have ever gotten simply because they use modern. So it definitely seems like an important skill.",
                                                    "score": 9,
                                                    "author": "PleaseSendCatPic",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "But is that combo execution or motion input execution?",
                                                            "score": -3,
                                                            "author": "gamelord12",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Both? If you drop your combo in the middle because you werent able to input a special, or even something as basic as drive rushing, then a single dropped motion input destroys your entire combo",
                                                                    "score": 9,
                                                                    "author": "PleaseSendCatPic",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The combos that modern controls give you for free are the same combos that you could learn in a few minutes on classic and never drop; at least the ones I'm familiar with.  Those people who got to a higher rank than they ever have are finally playing the fighting game for the first time rather than just struggling with the inputs, and I only see that as a good thing.  I do wish there was a more elegant bridge between those controls and classic, but if they want to keep climbing after that point, they know what they have to do.",
                                                                            "score": -4,
                                                                            "author": "gamelord12"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "To give you a better argument than the other person.\n\nThat specific post was about a grappler. Grapplers have command grabs. Which are moves that grab an opponent for big damage.\n\nThe inputs are classically a full circle. It’s not just an input complexity thing. You want big damage moves to be balanced around fitting an actual physical movement in.\n\nModern controls make that move one button. Forget classic or modern being better or worse. Knowing someone has a one button command grab changes how you play neutral.\n\nSo it’s not about thinking it’s unfair to lose to modern control players (it’s not). It’s that it changes the game. Personally I fully support fighting games making accessible control schemes. I hope everyone tries out modern. But making certain moves a single input with only a damage nerf isn’t good enough balance to me\n\n\nTLDR: one button supers, command grabs, and punishes change neutral. Changing the rules of neutral rubs people the wrong way.",
                                                                    "score": 5,
                                                                    "author": "Dr_StevenScuba",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I'm aware.  I play Zangief on classic controls.  I also just tested it, and Zangief only ever gets heavy SPD, which is the one with the worst range.  Even if you do the motion input for it, you still have an 80% damage penalty.  It will still change how you play neutral sometimes, sure, but if you're that close to Zangief, SPD is already an enormous threat at any time.",
                                                                            "score": 4,
                                                                            "author": "gamelord12",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It's a skill that's obviously important. Going back to my example - you can say that the main skills of Counterstrike are positioning, getting good looks, predicting where they will be, having a cohesive strategy, and so on. But that doesn't change the fact that even with the best map awareness, correct purchasing decisions, best team cohesion, you still have to aim. And people find getting better at aiming fun, that's why they play shooters. If you allowed people to skip that step, you are telling people who have put in all of that time into something they enjoy that their skills aren't appreciated. You are telling people that a part of the game they loved doing doesn't matter as much because people who don't want to try should get to win too.\n\nStreet Fighter is not a game solely decided by the decisions you make in neutral. It shouldn't be. If I wanted to play a game that was just about out deciding the opponent I would play rock paper scissors.",
                                                    "score": 7,
                                                    "author": "AlexB_SSBM",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Spacing, predicting where your opponent will be, and having a cohesive strategy are all also parts of Street Fighter that don't go away with modern controls.  There's still combo execution in modern controls besides the small ones they hand to you, and more combos beyond that are locked out unless they want to move up to classic.  The difference between Street Fighter and rock, paper, scissors is not \"combos\".  Quite frankly, if you love combos, Street Fighter is the wrong fighting game for you.\n\nAnd we used to have more multiplayer shooters where aiming was far less emphasized, like Doom and Goldeneye, and I hope we get more of those some day, because a game primarily about positioning, prediction, and strategy without much emphasis on aiming can still be incredibly fun.  To plenty of people, even preferable.",
                                                            "score": 6,
                                                            "author": "gamelord12",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt; And we used to have more multiplayer shooters where aiming was far less emphasized,\n\nOverwatch as well, which melee characters or Winston.",
                                                                    "score": 8,
                                                                    "author": "Mr_Ivysaur"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt;And we used to have more multiplayer shooters where aiming was far less emphasized, like Doom and Goldeneye\n\nSimilarly, Street Fighter is a game where combos are less emphasized. But you still gotta fucking aim. And you still gotta do combos.\n\nIt's really just especially bad when you get to grapplers who already are not really about combos. There's no reason Zangief should be able to grab me without doing a 360.",
                                                                    "score": 7,
                                                                    "author": "AlexB_SSBM",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Hey, I'm currently stuck in high silver specifically because I keep whiffing 360s and ending up with jumping punches instead.  But the counterplay to Zangief is almost exactly the same whether they're playing modern controls or classic controls.",
                                                                            "score": 1,
                                                                            "author": "gamelord12",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "The real protip is that gief doesn't really need a full 360 to get a 360. 270 is usually enough in Capcom games but I havent sat down with 6 yet. But 632147 P will get you where you want to go and if your timing is correct you'll throw the spd instead of jumping. You can also do 412369",
                                                                                    "score": 3,
                                                                                    "author": "Guyrealname",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "On the flip side, should a character like Zangief be completely unplayable without hours of practice?  \n  \nI use classic controls because I like feeling in control of every one of my moves and combos, and I dabble in other fighting games and don't want to practice with a control scheme that doesn't apply to other games. But I can't SPD to save my life. The idea of having to double SPD to super? Would be impossible for me. As a result, I will never play Zangief. Lily seemed interesting but as soon as I saw an SPD input I knew it was gonna be a bust. I gave it the ol' college try and couldn't get a single SPD motion in 60 seconds.  \n  \nIt would take me a long time to manage to SPD consistently in training mode. And even more training mode practice to consistently SPD in a match. Is that what you want to ask of people? I don't really enjoy practicing execution. It's boring and with my attention span it's hard to practice for more than 5 to 10 minutes at a time. I honestly cannot blame someone for not wanting to deal with that and opting for modern controls. If that means somebody who I'd absolutely wash if they were playing Zangief with classic controls stands a way better shot playing with modern controls, so be it.",
                                                                            "score": 1,
                                                                            "author": "Klotternaut",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "&gt;I gave it the ol' college try and couldn't get a single SPD motion in 60 seconds.\n\nYou tried to SPD for 60 seconds and immediately concluded that it's an impossible task? It's not like there's some fighting game gene that makes some people able to do SPD and some people unable to do SPD. It's hard at first. It should be hard. It does 1/3rd of your health bar, of course it should be hard + take time to do + require you to move your stick in places you might not want it to be.\n\nIf you don't really enjoy practicing execution, that's fine. There are plenty of characters that exist for people who don't enjoy that. If they don't want to deal with that, demanding they get to play no execution Zangief against other players is silly.",
                                                                                    "score": 5,
                                                                                    "author": "AlexB_SSBM",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "No but it is still a relatively difficult skill. Guitar playing isn’t the main skill of writing a good song but hey it’s pretty hard still.",
                                                    "score": 3,
                                                    "author": "RadJames"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;But that doesn't change the fact that you are taking the main skill of the game, the main part that people find fun, and allowing an option that lets other people just skip over it.\n\nSorry but this is such a ridiculous take. The auto combos on most characters are very simple strings into supers that even newcomers could learn to pull off reliably in classic in like ~10-15 mins. They aren't even optimal!\n\nOf course you're still rewarded for \"learning the game\". A good Classic user will destroy a bad Modern user because they have no idea how spacing works, how to use their Drive bar, how to properly punish, etc. \n\nIronically the only meaningful change that Modern has brought is at higher levels of play - not because of auto combo (which is useless) but because of one button/instant specials.",
                                            "score": 9,
                                            "author": "finderfolk",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; A good Classic user will destroy a bad Modern user because they have no idea how spacing works, how to use their Drive bar, how to properly punish, etc.\n\nWhy are you assuming modern players won't know how to do all of these things? The game is not just a mental game.\n\nA good counterstrike player in my hypothetical would still beat a half damage auto aimer. But you cannot *ONLY* look at high level when deciding if a mechanic is good. At the level most people play at, modern ends up being better than classic and the skills of being good at fighting games (or in my example, the skill of knowing how to aim) ends up not mattering nearly as much as it should. And I don't find that very fun.",
                                                    "score": -2,
                                                    "author": "AlexB_SSBM",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;Why are you assuming modern players won't know how to do all of these things?\n\nI'm not - my point is that if they have learned to use these tools better than you have then you should be losing to them anyway. Auto combos aren't strong enough to carry Modern users, as your last comment seemed to suggest.",
                                                            "score": 8,
                                                            "author": "finderfolk",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Honestly I think modern controls in street fighter 6 are by far the best execution of the \"you have regular and simplified controls\" in a fighting game I've seen.  I think there are still some issues with it, although some of those are kind of inevitable (basically some of them come from the fact that they need classic controls to still exist and be competitive, which kind of forces them to put some limitations on modern controls that I really dislike).  But they still do a great job letting people who don't want to deal with the execution barrier or learning curve of classic controls e competitive without feeling like switching to classic eventually, while still having tradeoffs that make classic controls feel rewarding for people who use them.\n\nHonestly the only real big issue with modern is just the way they kind of try to force them on you at times, most notably with the lack of an obvious \"please just always default me to classic controls in all contexts\" setting.  It is kind of annoying for people who know they want to use classic controls that there are control settings in a bunch of different places that all default to modern so it's easy to think you've gotten them all and then try a new mode or character and find yourself in modern controls again.",
                            "score": 11,
                            "author": "Quazifuji",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You can press y on char select and apply classic controls to all characters that way.",
                                    "score": 9,
                                    "author": "InsanelySpicyCrab",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Good to know.  That's why I said \"obvious\" because I think that's easy to mix and I've seen a lot of streamers end up accidentally in modern controls one way or another.",
                                            "score": 3,
                                            "author": "Quazifuji",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Removed comment due to Reddit's treatment of Apollo. Removed with https://github.com/j0be/PowerDeleteSuite/ https://old.reddit.com/r/PowerDeleteSuite",
                    "score": 7,
                    "author": "PhoAuf"
                },
                {
                    "level": 1,
                    "comment": "As someone who literally never plays this genre and who's last fighting game was some Tekken on the PS1 25 odd years ago; the demo of this impressed the hell out of me and yeah Yakuza-Lite is exactly what it felt like.\n\nI'm not a competitive/online gamer at all but am considering picking this up just for the campaign mode, depending on how long it lasts (heard some reports say up to 50hrs! :O)\n\nSuch a good idea to offer multiple game modes for various gaming tastes.",
                    "score": 3,
                    "author": "Stoibs"
                },
                {
                    "level": 1,
                    "comment": "Should watch this one, he says it was his idea and there lots of sneak peaks as well. \n\nhttps://youtu.be/M6hf4Ll_WkE",
                    "score": 6,
                    "author": "upvoting_department"
                },
                {
                    "level": 1,
                    "comment": "That mode does some really cool stuff for a fighting game, but it needs a lot more than just polish.",
                    "score": 6,
                    "author": "gamelord12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, it's a great idea but it's got pretty huge execution issues.  So much pointless backtracking and fetch quests, a lot of characters whose moves you don't get until really late, tons of grinding to actually unlock all of a character's moves, limitations on what you can equip making it impossible to equip some characters' entire movesets at once, the battles against multiple enemies being pretty janky, some areas that just spam way too many enemies at you...\n\nIt's got a great concept and it's a fun thing to do if you buy the game, but it's also got huge issues and I think would be a pretty bad game in a vacuum if not attached to a great multiplayer game (i.e. I would absolutely not recommend Street Fighter 6 to someone who is only interested in world tour mode with no interest in multiplayer).",
                            "score": 0,
                            "author": "Quazifuji"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Just wish World Tour ran better",
                    "score": 2,
                    "author": "rioting_mime"
                },
                {
                    "level": 1,
                    "comment": "The multiplayer hub is awesome, fighting games often have a lonely feeling due to being purely 1v1, but seeing people queue up for a cab to play someone is so cool",
                    "score": 3,
                    "author": "magicbeanboi"
                },
                {
                    "level": 1,
                    "comment": "I played the demo portion of it, which was a bit uninteresting; but I’ll gladly blame demo structure for that more than the game itself.\n\nDo they actually set up any kind of fun mini-stories in the world, or is most of the dialog around fighting mechanics?",
                    "score": 1,
                    "author": "Katana314",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not sure how far I'm into it but it's similar to say the original Yakuza 1 and 2 on PS2. There's less \"missions\" in the sense of going to specific Story Only location and doing a load of fights etc like, say, in GTA.\n\nIt's more like an elaborate Street Fighter tutorial with lots of References, getting to know the main 18 Fighters and Story/Cutscenes/Dialogue.\n\nThere's some minigames that help train you with Street Fighter's mechanics where you unlock difficulty levels.\n\nThere's little side missions which, like Yakuza, is mostly - go here, talk to guy, go here and fight these 2 dudes, read dialogue.\n\nYou are also incentivized to use different fighting styles to unlock dialogue, Story, artwork from each Master. So you get to know  them better and they teach you new moves.\n\nIt's kind of casual fun. But if you're not interested in learning about the Street Fighter lore and characters I'm not sure it will be that compelling.\n\nKind of the same way Yakuza 1, without the story, would just be a few fights.",
                            "score": 13,
                            "author": "aphidman"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I just hope this translates to a good audience sticking around for the multiplayer. At the end of the day this is a a fighting game. If everyone plays that mode and fucks off then it’s kind of a moot point.",
                    "score": 1,
                    "author": "ElDuderino2112",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "From Capcom's perspective I don't know that money from someone that only plays the single player side and someone who plays online makes any difference.",
                            "score": 3,
                            "author": "abbzug",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean, with the amount of skins they pump out they’d definitely prefer you stick around and buy a swimsuit or something.",
                                    "score": 1,
                                    "author": "ElDuderino2112"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The World Tour mode is a pretty great casual/chill experience that the series has needed for a long time, and the new Modern controls seem viable at decently high levels for many characters.  I guess Modern controls being viable is good/bad depending on who you ask, but I think it's fine.\n\nOne thing that makes me a little concerned for new players is the amount of them that do not want to play ranked.  There's been pictures of new people posting their lose streaks on r/streetfighter, not out of frustration but more as a display of tenacity/solidarity, but then you see all their matches have been in Casual/Battlehub.  \n\nI'm pretty bad, but ranked has been good at placing me in an appropriate spot for even matches, and it's even per character so I don't feel bad/punished for trying new characters.  It's been a really fun multiplayer experience for me, especially compared to SF4/SF5.",
            "score": 135,
            "author": "destroyglasscastles",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 64,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is it confirmed that casual doesn't have any skill-based matchmaking? I feel like all of my casual matches have put me with roughly evenly-skilled opponents, but maybe I've just been lucky.",
                            "score": 22,
                            "author": "vgman20",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 8,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "yeah i have no idea how casual matches work, but its clearly putting me against even opponents regardless of what character I pick. I was just dunking on people for the first two days, but now everyone is around mid gold",
                                    "score": 4,
                                    "author": "rafikiknowsdeway1"
                                },
                                {
                                    "level": 3,
                                    "comment": "Casual matchmaking does seem to use your rank. But it uses your literal rank, not like a hidden MMR system. So I have no idea how it works if you play casual matches without doing your ranked placement matches. It's possible it's queues you with other unranked people AKA people of totally random skill levels.",
                                    "score": 3,
                                    "author": "impostingonline"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "While playing World Tour I keep thinking back to this old YouTube video (I want to say the channel was Extra Credits?) Where he discusses how fighting games desperately need a good single player component to make new players learn mechanics and fundamentals in a fun and engaging way. World Tour does exactly that and I think that's fucking awesome.",
                    "score": 8,
                    "author": "ThorAxe911"
                },
                {
                    "level": 1,
                    "comment": "Modern controls and this game's fluid online experience is really making me interested in practicing and getting better. Not to mention World Tour does a wonderful job at introducing me to the fundamentals. Fighting games have also felt like this massive wall to me, but SF6 has given me the tools to climb the wall at a reasonable pace while also giving me plenty of points to just take a breath.\n\nIt's really remarkable how well Capcom has made a fighting game for people who don't play fighters as well as fighting enthusiasts",
                    "score": 22,
                    "author": "CaptainMcAnus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i'm curious how far someone can make it off modern controls in ranked though. not that 99% of players will even want to climb high enough to find out, but I am curious where it becomes a problem",
                            "score": 6,
                            "author": "rafikiknowsdeway1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You can make it wherever you want with modern controls in ranked.  For most characters, it's like playing a lower tier version of that character, and SF is the type of game where you can totally be an online monster with low-tier characters.\n\nFor some characters it might even be like playing a higher tier version of that character - for characters with supers that are dangerous in neutral, like Zangief's level 3, the simplified input means that they can threaten 30% or more of your life gauge in a bunch of situations that a classic player can't.",
                                    "score": 9,
                                    "author": "venicello",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Most fighters you can get pretty far with basic combos.\n\nPeople really underestimate how much of an impact fundamentals make.\n\nLike yeah don't have access to a full suite of moves and do lower damage but who cares if you are able to land more hits and can focus on actually playing the game vs execution.",
                                    "score": 17,
                                    "author": "AdministrationWaste7",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;People really underestimate how much of an impact fundamentals make.   \n\nI was into Tekken for some time and I distinctly remember finding a few videos of top players coming across others in match making who spent time learning crazy combos, but would get their ass beat by simple blocks and punishes. Like, they'd start toying with them just chipping off health with the most fundamental jabs and responses.",
                                            "score": 18,
                                            "author": "EccentricFox",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yep. Lots of players started backwards including myself.\n\nLike learning the proper distance for throws is a much bigger deal than combos.",
                                                    "score": 9,
                                                    "author": "AdministrationWaste7",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm quite the opposite; I got an decent grasp of the fundamentals and found learning large combos to be very boring and cumbersome. My friends were on the verge of physical pain watching me not fully utilize openings I made for myself lol.",
                                                            "score": 3,
                                                            "author": "EccentricFox",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Tbh if you're making openings, you've already won half the battle. Learn a few simple combos that deal decent damage and I guarantee you'll become a pain in their asses really quickly lol",
                                                                    "score": 2,
                                                                    "author": "_vrmln_"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "From what I’ve heard since the open beta started, modern is quite viable - to the point that some high level players were considering switching. \n\nThe damage reduction can be a problem (giving the opponent an extra chance to come back off something that may have otherwise killed), but the benefit of instant specials/supers is real. It’s much scarier to poke someone when you know they can smack you with shin shoryuken the moment you whiff.",
                                    "score": 6,
                                    "author": "Flibbety",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The biggest issue is being unable to access some normal attacks I feel. You can bypass the special damage reduction by manually inputting the special instead.",
                                            "score": 8,
                                            "author": "bigfatstinkypoo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Missing a few normals/specials is the only actual disadvantage of modern.",
                                                    "score": 10,
                                                    "author": "InsanelySpicyCrab",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That can be massive depending on the character. It's really a YMMV on overall effectiveness per character.",
                                                            "score": 2,
                                                            "author": "Razzorn"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "There are already diamond modern players.\n\nThey can do quite well but only if they're actually good.",
                                    "score": 6,
                                    "author": "InsanelySpicyCrab"
                                },
                                {
                                    "level": 3,
                                    "comment": "Atleast up to Diamond. It already happend. A lot of people talk about modern controles without knowing much about them like saying \"20% damage reduction\" without knowing that manually inputting the special with the classic command is possible with modern controles, which gives you the normal damage. Yes some moves will get cut, but not all characters are hurt equally by that. I would argue that at like Iron-Platinum modern controles are actually better because you dont mess up your inptus, combos and anti airs as much like newer players would with classic controles. \n\nOn top of that there are extremly big advantages to using modern controles even in a professional play, like faster DP´s and on button supers, which allow you to punish stuff way easier and harder",
                                    "score": 5,
                                    "author": "Zoko732"
                                },
                                {
                                    "level": 3,
                                    "comment": "People will be able to get to Master with Modern at some point. They just need to be willing to sit down and grind it. But most people willing seem to just want to use Classic atm.",
                                    "score": 5,
                                    "author": "aphidman"
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm sure if someone wants to climb the ranked ladder they'll probably move on to classic controls at some point to have access to its advantages. As it stands for me though, I'm more interested in getting the basics down and doing well enough so I don't feel incompetent.",
                                    "score": 2,
                                    "author": "CaptainMcAnus"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "When you sell a million in 3 days you can still have tons and tons of people in casual as you still have plenty playing ranked. My main takeaway right now is that everyone seems happy with the game.",
                    "score": 9,
                    "author": "MogwaiInjustice"
                },
                {
                    "level": 1,
                    "comment": "Removed comment due to Reddit's treatment of Apollo. Removed with https://github.com/j0be/PowerDeleteSuite/ https://old.reddit.com/r/PowerDeleteSuite",
                    "score": 3,
                    "author": "PhoAuf"
                },
                {
                    "level": 1,
                    "comment": "I've been playing SF since the Sega Genesis days and I don't play ranked or much online at all. Love fighting games (esp SF) but I have 0 desire to play any 1v1 game against randos. I specifically play to beat on my IRL friends in person.",
                    "score": 3,
                    "author": "Benchimus"
                },
                {
                    "level": 1,
                    "comment": "Modern is largely fine but I think on the grapple focused characters that 20% nerf should be higher\n\nIt lets Zangeif and Manon press two buttons to get to higher ranks which is a bit wild and losing a few normals is no big deal to them\n\nOtherwise it's fine",
                    "score": 12,
                    "author": "8-Brit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Eh, I don't think it's necessary. Even if it lets the grapplers have such easy access to those devastating moves you eventually get to the level where that doesn't give you any sort of advantage and you have to learn a lot. I mean THAT'S the goal of modern controls, to take away the hurdle of execution and to the point where you're learning the rest of what makes fighting games great.",
                            "score": 9,
                            "author": "MogwaiInjustice",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The trouble is it's shit for the other player who might also be new, and modern controls might remove tools from characters to deal with it\n\nEven as a comparative experienced player on Classic controls it's not always easy to avoid Gief on modern controls pushing ons button and taking 40%",
                                    "score": 11,
                                    "author": "8-Brit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I guess what I'm saying is that if a bronze level player makes it to silver playing Gief is that a problem? They have a tool that's hard to deal with until you start getting better players but eventually they'll get to a spot where people CAN deal with someone exploiting that tool and they'll have to get better.",
                                            "score": 5,
                                            "author": "MogwaiInjustice",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah I don't see why anybody would actually care so long as there is a point where realistically you need to transition over to modern controls.\n\nIf we see a bunch of modern control Zangiefs in like the top 64 at EVO, that might be a cause for concern - but if I personally lose some ranked matches to a player who I could have beaten if they were on Classic?\n\nWhatever, it's in the game - not having a trillion dumb 'oh you need to adhere to this more honorable ruleset' conditions is part of the appeal of traditional 2d fighters. \n\nThey're allowed to do the shit that's in the game, on us to figure out how to beat it lol.",
                                                    "score": 7,
                                                    "author": "lizard_behind",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well that's a person and who's to say when the barrier of execution and having solid punish options/combos is removed they didn't have the rest click.",
                                                            "score": 1,
                                                            "author": "MogwaiInjustice"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Grapple players will always be a problem for new players though, I don't think they should do anything to them unless top 64 on EVO is drowning on modern Giefs.",
                            "score": 1,
                            "author": "DP9A",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": -8,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "At least in fighting games, in my experience the opposite is true. Casual players often call for nerfs for characters they have a hard time dealing with, which results in archetypes like grapplers sometimes getting nerfs when they're already barely viable. Games like Overwatch are a different story because you have access to all of a character's tools at all skill levels, in fighting games low and even mid level play may as well be different games because players just don't know how to properly use the kit of the characters (which is why some characters like grapplers often seem incredibly strong while others like zoners or glass cannons seem really weak at low levels, but at high levels the opposite is true).\n\nIf anything, the sanding down of interesting parts in the genre have come from wanting to please casual audiences, not because they were trying to appeal to pros. Case in point, SFV being an incredibly uninteresting game competitively at the start because they removed so much stuff in an attempt to make it easier.",
                                            "score": 3,
                                            "author": "DP9A",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This wouldnt be balancing around the \"top 0.0001%\". Grapplers are ALWAYS a problem for new players because they do not understand how the game works yet, and the way that grapplers work is very effective against the playstyle that most newbies adopt. Nerfing grapplers at the start of a games lifespan is a tale as old as time, and usually ends with them being crap for most of its run.",
                                            "score": 1,
                                            "author": "Nofunzoner"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "20% damage reduction on grabs is a HUGE penalty and the one button throws are not much of an advantage.\n\nZangiefs one button spd is the strong version which has almost no range and is actually pretty bad to have on a single button.\n\nIf you're losing to modern grapplers they're probably just better than you think or you're making fundamental errors.",
                            "score": 0,
                            "author": "InsanelySpicyCrab"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yea its a wierd thing where ranked is seen as this big intimidating hardcore only club so a lot of newcomers will gravitate toward player matches...when really the best way to get matched against similar skill levels is to play ranked.",
                    "score": 4,
                    "author": "EvenOne6567"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The World Tour is almost exactly what I've been saying fighting games needed for a singleplayer for years. Something engaging and worth doing in its own right, while slowly introducing the players to more and more concepts. Stuff like the minigame that teaches you how long to hold for charge inputs are cheeky as hell and I love that.\n\nI've got a few gripes here and there, I'm not sure why it needed me to make some new capcom ID on an external website, then use my world tour character name as my profile name. And I personally prefer Guilty Gear style cancels to SF Links, but again, that's a very personal hangup.\n\nI think they've done a pretty good job with this one. Way better than SF5 launch.",
            "score": 34,
            "author": "PlasmaLink",
            "replies": [
                {
                    "level": 1,
                    "comment": "The mode has existed in plenty of other fighting games before this though. The mortal kombat games on ps2 had konquest mode, which is essentially the same thing.",
                    "score": 1,
                    "author": "septicdeath",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, but Konquest mode was ass",
                            "score": 11,
                            "author": "ChronoDave"
                        },
                        {
                            "level": 2,
                            "comment": "Can you name another? I'm genuinely curious because outside of konquest mode I can't think of another but I haven't played every fighting game.",
                            "score": 4,
                            "author": "Sirromnad",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm absolutely shite at fighting games but always loved Street Fighter since the SNES days. Honestly tempted to give this a go given how accessible it sounds for fighting game ludites like me.",
            "score": 42,
            "author": "Nyushi",
            "replies": [
                {
                    "level": 1,
                    "comment": "There's a lot of stuff already mentioned that's great for the more casual or newer fighting game player like the single player world, the great tutorials, the multiple control types, etc. \n\nOne other thing that's really great for those casual/new players is the ranking placement system.  You choose your fighting game experience level and play a few placement matches, then it seems to do a pretty good job of putting you on the ranked ladder at a skill appropriate level right off the bat.  This does a great job of letting everyone find opponents of similar skill level to get fair matches. \n\n This type of system has been in other competitive video games before, but I haven't really seen it used in fighting games this well before, and I think it will alleviate lot of people's worries about going online and being stomped by experienced players right away.",
                    "score": 16,
                    "author": "Emience",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "One thing to note is that a large percentage of the playerbase is in the bottom rank (Rookie). In SFV over 60% of players were in the bottom two ranks, so don't think that Silver is average and be discouraged when you get placed into Rookie.",
                            "score": 6,
                            "author": "RogueCarpet"
                        },
                        {
                            "level": 2,
                            "comment": "That sounds absolutely fantastic. I'll definitely have to give this a go.",
                            "score": 4,
                            "author": "Nyushi"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Its so much fun, just getting into fighting games (only ones ive played are st and 3s) and im having a blast",
                    "score": 22,
                    "author": "kippythecaterpillar"
                },
                {
                    "level": 1,
                    "comment": "I've already put in over  20 hours on world tour mode alone.  On chapter 10 of 15(I think it has 15 total?), unlocked 6 alt outfits so far, and still have 3 masters to find.  I'm surprised by how much fun I've been having in world tour.  I've barely touched the online battle hub.",
                    "score": 3,
                    "author": "DrunkeNinja"
                },
                {
                    "level": 1,
                    "comment": "There is a demo, so you can try it out.\n\nThis game oozes quality. It looks good, it sounds good, it feels good. Sadly, it made me realize though that I’m not really into fighting games anymore. This game would’ve been a wet dream for me from 10-15 years ago.",
                    "score": 4,
                    "author": "shapookya"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Would this be a worthwhile purchase as a person who doesn’t play fighting games typically? I don’t dislike fighting games necessarily, but I just don’t really play them.",
            "score": 29,
            "author": "tarheel343",
            "replies": [
                {
                    "level": 1,
                    "comment": "Check the demo if is still available",
                    "score": 44,
                    "author": "PaltaRecords",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Will do! I also forgot, didn’t Steam just change their demo format so that people aren’t refunding so many games after 2 hours as a makeshift demo? If that’s up and running already, I will definitely make use of it.",
                            "score": 3,
                            "author": "tarheel343",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That was so far only limited to the Dead Space remake, and available for a limited time window. SF6 has a traditional demo, in which you get 2 characters, Ryu and Luke, and you can either play in local multiplayer or against CPU. There are no online features in the SF6 demo.",
                                    "score": 16,
                                    "author": "deffik",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’d get my ass kicked online anyway, so that’s a-okay with me",
                                            "score": 2,
                                            "author": "tarheel343"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Removed comment due to Reddit's treatment of Apollo. Removed with https://github.com/j0be/PowerDeleteSuite/ https://old.reddit.com/r/PowerDeleteSuite",
                    "score": 10,
                    "author": "PhoAuf",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I'm like you and bought it on a whim since GreenManGaming has it for $50.\n\nI've been doing nothing but tutorials since I have never played a SF and really only 'fighting' game I've played is some casual MK and Super Smash Bros. Tutorials have been great and easy to follow with plently of training tutorials to help you get accustomed",
                    "score": 7,
                    "author": "ayeeflo51"
                },
                {
                    "level": 1,
                    "comment": "I'm in the same boat as you and I pumped 25 hours into World Tour alone already *and* the game is effectively making me more interested in fighting games. Just play with modern controls and the game will feel much more fluid if you're unfamiliar with classic controls.",
                    "score": 4,
                    "author": "CaptainMcAnus"
                },
                {
                    "level": 1,
                    "comment": "There's a good 10 hour story mode in there, there's some bonus modes and the online is fun. As someone who has never played a fighting game, I have already spent hours sitting in the training area trying to learn Chun-Li's moves, only to spend even more hours online getting absolutely demolished and slowly getting better.\n\nJust know that the online part might not be for everyone because you really need to invest time to stand a chance at even the bottom level.",
                    "score": 2,
                    "author": "Phimb"
                },
                {
                    "level": 1,
                    "comment": "Besides Smash, this is probably the most accessible fighting game that's ever been made.",
                    "score": 2,
                    "author": "SpaceGoatShaman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The last time I was this obsessed with a fighter was SF4 years ago.\n\nSF6 has been an absolute joy so far. EVERYTHING about the package screams quality. Amazing graphics, music, the art style is so sick, and it's fun af.\n\nBuy this shit.",
            "score": 5,
            "author": "HighEyeMJeff"
        },
        {
            "level": 0,
            "comment": "It’s a minor thing but the fact that the game was sold at $80 CDN instead of the new standard $90 made me way more willing to buy it day one. They could’ve so easily charged the new gen price, even at least just for the next gen consoles but they didn’t. \n\nThey made an incredibly smart choice with the pricing and I wish more companies used the same tactic. Keep the base edition at the typical $60 USD and then have a deluxe edition which guarantees DLC content at a slightly higher price which is what the hardcore fans will get. Capcom has consistently been making really smart choices especially with SF6",
            "score": 43,
            "author": "Pineali",
            "replies": [
                {
                    "level": 1,
                    "comment": "it's probably because they're expecting to make bank through microtransactions, dlc sales and premium monthly battle passes. the price is lower which is great but the monetization is quite aggressive even for Capcom standards",
                    "score": 25,
                    "author": "demondrivers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is maybe the only thing that I'm not completely thrilled by when it comes to this game's reception because I really don't hear too many people talking about this.  In a way it almost feels like the audience at large has finally given up at this point and are waving the white flag, or are willing to when it's a really good game that has them.\n\nI'm not going to claim to know exactly how they did Street Fighter V because I've never played it, but it has 5 seasons.  I assume they sold a pass for each season... so like, once again, a single season pass is not enough anymore and there's 5.  It had virtual currency that you could buy, because of course it does.  I'm sure it had cosmetics you could buy, because of course it does.  I'm going to assume 6 has all of this... and more, now that you can create a character and customize/cloth them.  Does 6 not have 2 virtual currencies now in Drive Tickets and Fighter Coins?  I think it has a premium battle pass too?  Like I'm legitimately not able to keep up with this shit anymore... and I'm not really hearing people complaining like they used to years ago.  I'm almost kind of shocked that people are walking into a really nice room full of luxurious decorations and everything's set up real nice, and they're pretending like they don't see the big pile of steaming elephant shit sitting right in the middle of the room.",
                            "score": 5,
                            "author": "hyperforms9988",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "5 had one character pass for every year, a few RNG stuff and **a lot** of paid alternative skins. Biggest difference is how the in game currency worked, because we were able to purchase DLC characters and other contents by simply playing the game and getting enough fighting money. Worth saying that they stopped to do multiple editions of the same game because of the DLC system, so it's kinda of a net positive for the community since everyone played the same game at the latest balance update without being separated by constant re-releases \n\nBut yeah, game is good and people like the developer so a lot of things that they do get a pass. Capcom added microtransactions to the Resident Evil 4 Remake weeks after launch and they barely got any criticism for it. What would be a PR nightmare for a company like Activision or EA is simply nothing for a studio like Capcom.",
                                    "score": 8,
                                    "author": "demondrivers",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "ehhh, I think it's a little different for Capcom.\n\nRE4Make added microtransactions, but it was only stuff you could already unlock somewhat easily in game. Activision and EA seem to often hinder the enjoyability of its games to force players in mtx.\n\nAnd to play the Devils advocate, there's a reason mtx and stuff like increased game prices exist - it just costs much more to make games nowadays.\n\nAnd Capcom has been making excellent fucking games for the the past few years. So you could take it a donation or tip, rather than a anti-consumer practice that most gaming studios have nowadays.",
                                            "score": 5,
                                            "author": "SkyRipLLD",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This is precisely what I'm talking about. Shitty business practice in Activision games is devilish anti consumer crap, shitty business practice in Capcom title is seen as a fucking donation or a tip just because they make good games lol.",
                                                    "score": 3,
                                                    "author": "demondrivers",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "All the content in the RE4 Remake besides the costumes are unlockable without paying a dime so yes it is different",
                                                            "score": 3,
                                                            "author": "Trem45",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "it's not. how can you unlock the thing that shows you where all items of the map are? and funnily the sentinel nine, one of the best guns of the game, is a paid weapon as well, you can't buy it from the merchant",
                                                                    "score": 2,
                                                                    "author": "demondrivers",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Damn, here in Australia it's the opposite; 100AUD when ~80AUD is about our norm.\n\nKind of sucks, will have to look for it on key sites I guess :/",
                    "score": 3,
                    "author": "Stoibs"
                },
                {
                    "level": 1,
                    "comment": "So, I skipped past SF V, but I felt SF IV was honest pricing and I'd like to see that again.\n\n* Launch game $60\n* Ignore the fucking DLC\n* Rerelease with the DLC $40\n* Ignore the fucking DLC\n* Rerelease with the DLC $15 upgrade, entire package for $40, and $30 on PC\n\nAdd $10 for inflation, and you've got a SF VI customer.\n\nIt basically said \"We can have both\". We can make our microtransaction profits from people who want things early, but if you want a traditional everything in the box videogame you just have to be patient and the price will be lower to reflect that patience.",
                    "score": -8,
                    "author": "hombregato",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "SF IV selling you a yearly large patch every year for 3-4 years is a good pricing model? That is some NFL/Fifa level koolaid.",
                            "score": 18,
                            "author": "StaneNC",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I despise MTX being in videogames at all, but this is something that happened to the entire fighting game genre, and not every series bundled everything they sold on the side into a new base game product for an affordable upgrade or well discounted re-release.\n\nCompare that to SF2, SSF2, SF2T, and SSF2T. \n\nIn the 1990s, we weren't buying expanded rosters and gameplay tweaks for $15 upgrades or 2/3 or 1/2 price new version releases. They were expensive full priced games.\n\nAnd these SF IV games were deeply discounted after their initial releases, so in my case, I got everything I wanted at a Best Buy for twenty dollars.",
                                    "score": -3,
                                    "author": "hombregato"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Legit amazing game, one of the most important games of of the year considering what it's doing for the genre and how complete of a package it is. Honestly I think the world tour mode should be given tons more credit, a lot of what I've seen is similar to \"it's good for a first attempt\", but look at any other fighting games and nothing comes close to the level of effort thats gone into this single mode. This is an amazing fighting game that also has a fun and well made third-person open world campaign mode with side quests, skill trees, customization, and hilarious interactions.",
            "score": 11,
            "author": "Funky_Pigeon911"
        },
        {
            "level": 0,
            "comment": "I am just enjoying World Tour mode for now. I got bodied in some avatar battles because mine was under leveled and underpowered. Lol. I won some online matches, lost some. Its a pretty positive influence as I didn't play SF since Third Impact.",
            "score": 4,
            "author": "gutsxcasca"
        },
        {
            "level": 0,
            "comment": "Bought the game and have just tried some training mode to test the fighters.\n\nIs there both that open world story mode and the classic arcade modes with character endings? Or are they one and the same?",
            "score": 2,
            "author": "maaseru",
            "replies": [
                {
                    "level": 1,
                    "comment": "There's an Arcade Mode for a quick tidbit of lore for your chosen character if you look in the Fighting Grounds menu, then you can also meet characters with your custom avatar in the World Tour mode and apprentice under them to learn their moves.",
                    "score": 2,
                    "author": "DanielTeague"
                }
            ]
        },
        {
            "level": 0,
            "comment": "ngl I bought it after the Cammy original costume was revealed, but I’m actually having fun with the game. Sex sells but you get past that and you stay for the game.",
            "score": 4,
            "author": "xenoz2020",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you spend 60 dollars on a video game because you saw video of a sexy lady in it, instead of just looking at more images and videos of the lady for free? I’m glad you’re enjoying the game I’m just confused as to why you would buy a game for just that.",
                    "score": 11,
                    "author": "CEO_of_goobledotcom",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah it is kinda mental, isn’t it? I don’t really have any excuse. Although I was intrigued by the game, I just wasn’t sure if I wanted to get it since I’m not really into fighting games, but I am into sexy ladies. Somehow it just worked.",
                            "score": 7,
                            "author": "xenoz2020",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A man of culture",
                    "score": 0,
                    "author": "SC2BOOTY"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can't get the free stuff from SFV for SF6 can someone help?",
            "score": 1,
            "author": "Mizerous",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are you talking [about the Runback Campaign?](https://game.capcom.com/cfn/sfv/sf6_campaign/) You scroll down to the bottom and link your account with Capcom ID then click on \"Enter Now\" a bit below that.",
                    "score": 3,
                    "author": "DanielTeague"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have had issues with getting a match started, lots of connection failures. But generally in match was without issues. I can see why starting a match wasn't always smooth now.",
            "score": 0,
            "author": "ShadowBlah"
        }
    ]
}