{
    "id": "1439vy0",
    "score": 190,
    "title": "The Making Of: Croc, 3D Platforming's Unsung Hero",
    "author": "Tokyono",
    "date": 1686135101.0,
    "url": "https://www.reddit.com/r/Games/comments/1439vy0",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Pretty cool article. Longer than I expected. Croc remains a guilty pleasure, and something I do wish one day gets some sort of remaster, even if it's an unrealistic hope.",
            "score": 50,
            "author": "DireKrow",
            "replies": [
                {
                    "level": 1,
                    "comment": "There's the [fan made Definitive Edition](https://community.pcgamingwiki.com/files/file/1833-croc-legend-of-the-gobbos-definitive-edition/), which boils down to the same thing. It's great!",
                    "score": 28,
                    "author": "Spamieliboy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Did not know that was a thing, thank you for bringing it to my attention.",
                            "score": 8,
                            "author": "unholyswordsman"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There was a tweet today with [rumors regarding a remaster/remake of sorts](https://twitter.com/aerobatic/status/1666119518949715969?s=20) (according to Jez San, founder of Argonaut). Take it with a grain of salt, but you never know",
                    "score": 10,
                    "author": "ogto",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Jez still owns the rights. \n\n[I will buy day 1.](https://i.imgur.com/XcMCJYw.jpg)",
                            "score": 11,
                            "author": "JoshFlashGordon10"
                        },
                        {
                            "level": 2,
                            "comment": "Don't give me hope...",
                            "score": 2,
                            "author": "eddmario"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Funny, I was watching a random tiktok of “only true gamers know these sounds” and one was randomly the Croc theme music and I instantly, yet reluctantly, blurted out THATS CROC!! And then I saw I was right and was like holy shit, kinda crazy after not hearing that for 20+ years that such a small, insignificant tune can occupy your brain",
            "score": 10,
            "author": "Shwalz"
        },
        {
            "level": 0,
            "comment": "I never shared the following weird info with anyone, but I need to get it out of my chest:\n\nI played the PC version, but for some weird issue, the ENTIRE game had so music at all, just sound effects.\n\nSo the entire game was kind creepy yet immersive. I saw some gameplay with music, and it feels just sooo wrong. I recall the bonus stages on the desert world where you need to outrun a ghost in a dark area and that shit was SO SPOOKY, especially because after collecting everything on an already hard stage, you had one chance only for the bonus stage (because if the ghost collects the key it does not respawn even after you die). It was peak stress in my childwood.",
            "score": 34,
            "author": "Mr_Ivysaur",
            "replies": [
                {
                    "level": 1,
                    "comment": "I had the same issue with Earthworm Jim 3D on PC, sound effects played, but no background music.\n\nThen one day the graphics corrupted and Jim's face always loaded the wrong texture.",
                    "score": 5,
                    "author": "metalflygon08"
                },
                {
                    "level": 1,
                    "comment": "I had the same experience with Croc, as well as several old side-scrolling platformers for PC.  The first time I ever heard the music for the Commander Keen games was when I played them as part of the 3D Realms Anthology.",
                    "score": 5,
                    "author": "drizzt_do-urden_86",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Commander Keen was in an era where I didn't even own speakers for a PC, let alone the hardware to play music. I wasn't aware that they had anything above internal PC speaker sound until a decade later.",
                            "score": 2,
                            "author": "I_upvote_downvotes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Man I know that feeling.  I remember playing Duke Nukem 2 on my uncle's computer, with the \"Soundblaster\" sound and music enabled, such a difference from the PC sound we were stuck with at home.",
                                    "score": 2,
                                    "author": "drizzt_do-urden_86"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I never had an N64/PS1 growing up, but did have a family computer so this and its sequel were some of my first platformers as a young kid. They hold a special place in my heart for that reason. Cool article!",
            "score": 7,
            "author": "Sturminator94"
        },
        {
            "level": 0,
            "comment": "I loved this game as a child. Too young to beat it tho",
            "score": 14,
            "author": "FallingStarIV"
        },
        {
            "level": 0,
            "comment": "Real question: Did people pronounce it \"Gob-oo\", \"Gob-oh\", or \"goo-boo\"? Personally I think it's obviously \"gob-oh\" but I've had people disagree with me.",
            "score": 12,
            "author": "Intelligent_Genitals",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've always said goh-boh",
                    "score": 16,
                    "author": "JaxMed",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same.\n\nFun game, one of the few I had on the PS1 that really supported that analog controller Sony came up with before the dual shock.",
                            "score": 3,
                            "author": "Just-Scallion-6699"
                        },
                        {
                            "level": 2,
                            "comment": "Legend of the GoBots",
                            "score": 1,
                            "author": "samus12345"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Given how popular Steve Irwin 'the crocodile hunter' was back then, I always assumed Gobbo is meant to have an Aussie twang. So 100% gob-oh for me. I guess if someone looked hard enough you might be able to find a developer on camera saying the name. I'd be shocked if it wasn't just gob-oh though.",
                    "score": 7,
                    "author": "APiousCultist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As an Aussie, I never considered there even could be a different way to pronounce Gobbo.",
                            "score": 3,
                            "author": "evelution"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "gob-oh-goo",
                    "score": 1,
                    "author": "gorocz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I never played Mario or Sonic as a kid but Croc was there for me. The catchy music still routinely gets stuck in my head to this day. I think I only beat Baron Dante like 1 time, the castle levels were pretty hard (or maybe I just sucked?).",
            "score": 2,
            "author": "loves_grapefruit",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; The catchy music still routinely gets stuck in my head to this day.\n\n[Sim Gretina made an awesome remix of the theme a while ago](https://m.youtube.com/watch?v=bNFoPqxaEwg&amp;pp=ygUQc2ltIGdyZXRpbmEgY3JpYw%3D%3D). Highly recommend.",
                    "score": 2,
                    "author": "eddmario"
                }
            ]
        }
    ]
}