{
    "id": "143sqoi",
    "score": 59,
    "title": "The best mech game no one played - Slave Zero (1999) Retrospective",
    "author": "megaapple",
    "date": 1686180815.0,
    "url": "https://www.reddit.com/r/Games/comments/143sqoi",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "JFC, if there's one thing I can't stand is how Youtubers talk about a game that was played quite a bit by people who owned the Dreamcast is labed as a game that \"no one played.\"",
            "score": 47,
            "author": "shinbreaker",
            "replies": [
                {
                    "level": 1,
                    "comment": "To be kinda fair, the dreamcast was quite the under-performer of its generation. While most folks who had one might have played this game, not every gamer had a dreamcast. I certainly didn't.\n\nEdit: clearly, I didn't know there was a PC version.... which I also missed. I'll blame Shojo for that lol",
                    "score": 18,
                    "author": "RedRiot0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But it was released on PC at the same time. Hell it's still available on Steam. \n\nThe real reason why a ton of people didn't play SlaveZero was that it was just an alright game.",
                            "score": 24,
                            "author": "shinbreaker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As a person who played Slave Zero on both PC and Dreamcast back in the day (still have my PC cd-rom of it somewhere), you couldn't be more correct, haha. It was good for it's time, I guess. A solid 70% game. Nothing special.",
                                    "score": 13,
                                    "author": "UnderHero5",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It was totally mediocre and not even the best mech game on Dreamcast (Virtual On was). The only thing I appreciated at the time was the sense of scale they achieved in some levels. The tiny cars and highways made you feel big.",
                                            "score": 12,
                                            "author": "monstercoo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; It was totally mediocre and not even the best mech game on Dreamcast (Virtual On was)\n\nFunny way to spell Bangai-O &gt;!jk I love Virtua On too. Gundam Side Story was fun as well, and way better than Slave Zero!&lt;",
                                                    "score": 6,
                                                    "author": "Ordinaryundone"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This was a PC game that came out on PC only in 1999.  It was ported the next year, in 2000 for Dreamcast.   It wasnt played by many people because it was a smaller budget game of mediocre quality in a time where PC was putting out legendary game after legendary game.  Nobody had time for something like this in a year where stuff like Quake 3, Unreal Tournament or Age of Empires 2 were coming out.\n\nVideos like this work for actual quality games that for some reason didnt get good sales at launch or are forgotten as a whole today. Like Sacrifice, Giants Kabuto or Undying.  Not shovelware like Slave Zero",
                            "score": 5,
                            "author": "-Sniper-_"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yep. I remember reading about this in Gamepro and EGM.",
                    "score": 1,
                    "author": "Lorddon1234"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And we're getting a new game in the same universe soon!\n\nSlave Zero X but it's a 2D side scrolling character action game. Looks dope.\n\nhttps://store.steampowered.com/app/1903910/Slave_Zero_X/",
            "score": 9,
            "author": "Hyroero",
            "replies": [
                {
                    "level": 1,
                    "comment": "I dunno. It looks like a game that could've been called anything.",
                    "score": 2,
                    "author": "yixisi5665",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sure. It's a prequel and leans into the biopunk setting. I'm personally thrilled and found the demo very fun.",
                            "score": 2,
                            "author": "Hyroero",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I had a blast playing the demo, one of my most anticipated game probably.",
                                    "score": 3,
                                    "author": "pm_me_pants_off"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's certainly a take considering I doubt this person has played Young's Modulus or any of the other actually \"you had to be there\" games like Avara.\n\nEdit: Or my *actual* favorite that I basically guarantee this person hasn't played - Shattered Steel.",
            "score": 18,
            "author": "Ishmanian",
            "replies": [
                {
                    "level": 1,
                    "comment": "damn first time ive heard someone bring up youngs in like 10 years",
                    "score": 2,
                    "author": "zazzersmel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Some good times, miss those old passion projects that died with niche internet forums.",
                            "score": 1,
                            "author": "Ishmanian",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "x-plane is still around... not sure how popular it is these days",
                                    "score": 1,
                                    "author": "zazzersmel"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ultrabots back in the day",
                    "score": 1,
                    "author": "Peepeepoopoobutttoot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "it was panned on release, and it was nowhere near that good. Shogo: Mobile Armor Division is a better choice for great game no one played. Developed by Monolith Productions, the Fear and Condemned: Criminal Origin guys.",
            "score": 6,
            "author": "bearvert222",
            "replies": [
                {
                    "level": 1,
                    "comment": "Shogo was fucking awesome. The transition between human stages and mech stages is really what made the mechs feel big and powerful. Very fun game. I used to play multiplayer on LAN with my brothers. One annoying thing I recall is explosions from cars would hurt you so you'd always get this annoying splash damage when trying to blow shit up.\n\nThey also had a Claw cat toy weapon which was a reference to Monolith's earlier awesome sidescroller Claw, which was very good and very challenging.",
                    "score": 1,
                    "author": "NamesTheGame"
                },
                {
                    "level": 1,
                    "comment": "This.  It got shit on when it released.  It's not a hidden gem.",
                    "score": 1,
                    "author": "moal09"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love Slave Zero ever after playing the pc version back in 2001 or 2002. Maybe we'll see a proper Nightdive remaster after Armored Core comes out and everyone and their dogs will want a piece of the mech shooter genre.",
            "score": 2,
            "author": "Death-Priest"
        },
        {
            "level": 0,
            "comment": "I played the PC version, and it was unwinnable on hard difficulty - there wasn't enough ammo in the final boss fight.  There was a workaround, but you had to know to pick up the Tier-3 missile launcher instead of sticking with Tier-4. \n\nAlso, when I see a mech game, I usually expect to be able to configure the mech (due to being influenced by Mechwarrior 3), something which is minimal with Slave Zero. \n\nIn comparison, *Shattered Steel* feels like there's slightly more configuration, in that the player can change weapons or equipment, and adjust power settings within the mech.",
            "score": 2,
            "author": "Sigma7",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Also, when I see a mech game, I usually expect to be able to configure the mech (due to being influenced by Mechwarrior 3), something which is minimal with Slave Zero.\n\nOne of the core differences between mecha and mech games, the latter has extensive customization and the former does not.",
                    "score": 2,
                    "author": "ColinStyles"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love this game! Play a LOT of it back on the Dreamcast but it was difficult with a  controller and I could never beat it. I'll have to go back sometime and actually complete the game on my PC.",
            "score": 2,
            "author": "Tric4rboN8"
        }
    ]
}