{
    "id": "143zvt8",
    "score": 237,
    "title": "Remnant 2 - Introduction to the World of Remnant",
    "author": "Korten12",
    "date": 1686200593.0,
    "url": "https://www.reddit.com/r/Games/comments/143zvt8",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "This is a really solid trailer, and has shown off a bunch of new stuff that makes me way more interested in digging into this game; I was already pretty sold (that first game is a very solid foundation) but the marketing prior to this felt a lot like a re-tread... with a dog. And yes, the dog does solve one of my biggest quibbles from the first game (the rough single-player experience) but it wasn't exactly a reason to dive in. All these new enemies, powers, locations and weapons are much more enticing.",
            "score": 30,
            "author": "Reasonabledwarf",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;  re-tread... with a dog. \n\nThe first game also had a dog (as one of the in-game weapon mods). It was incredibly overpowered for mobbing, you could just run around the map and the dog would run ahead of you and kill everything by itself. And if you're wearing some Cultist gear that regens your mod power, the dog essentially has 100% uptime. It's not very useful on single target bosses, but for lots of small enemies it was a gamechanger.",
                    "score": 15,
                    "author": "CaspianRoach",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Couple the dog mod with the little round goblin dudes you can get pretty early on and you have 3 summons just blasting through the maps for you.",
                            "score": 1,
                            "author": "Valtieri"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The dog was also in the first game. My biggest gripe with the first one is how short it was, even with the DLC.\n\nPlayed it with friends, gameplay was pretty good but it felt like it was still ramping up through the whole experience. When we felt it was finally gonna hit its stride, the credits rolled. No closure on almost any of the questions presented in the game!",
                    "score": 4,
                    "author": "Bellurker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The game was made to be replayable, so re running the campaign or zones you get new enemies placements/events/bosses.\n\nFor the story, I feel most questions are answered if you search a bit(well, it's hidden in texts in some zones so easyly missable), and while the dlc add some more closure than the end of the base game, I agree that the storytelling was not as great as it could be.\n\nHope it get better on the second game, but I'm in either way. :)",
                            "score": 8,
                            "author": "bellius",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The world wad great. The storytelling was bad",
                                    "score": 1,
                                    "author": "MrAbodi"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just a very VERY minor thing but I hope they keep the playable character's voice for when combats over.",
            "score": 9,
            "author": "Irememberedmypw",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oof. This is one of my biggest gripes with the first time. I absolutely hated how every time combat ended my character just went \"Whoa, that was rough.\" or \"finally, it's over.\" Like who would say stupid quippy lines like that in this situation? Who talks like that ever? No one. Get rid of them, I say!",
                    "score": 3,
                    "author": "funkmasta_kazper",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree with the concept of an audio cue to inform players *\"that's it, combat is over!\"*  But I also agree the dialogue could be a tad more natural there.\n\n\"Looks like we got 'em all\" or something has better ring to it.",
                            "score": 2,
                            "author": "Valtieri"
                        },
                        {
                            "level": 2,
                            "comment": "Oh... I guess I'll leave.",
                            "score": 1,
                            "author": "DHTGK"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The monster shown at around 2:10 had me burst out laughing. The way those bodies just float about in the air just looks so goofy to me.\n\nSuper excited for this title though, the first game (technically speaking the second) was amazing!",
            "score": 6,
            "author": "Cleverbird",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why was it technically the second?",
                    "score": 1,
                    "author": "Kinky_Muffin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://store.steampowered.com/app/967390/Chronos_Before_the_Ashes/\n\nTechnically a prequel",
                            "score": 3,
                            "author": "TheRedditEric"
                        },
                        {
                            "level": 2,
                            "comment": "Chronos, an VR game Gunfire Games developed, is the prequel to Remnant: From the Ashes. \n\n&gt; Chronos: Before the Ashes is the prequel to 2019 hit game, Remnant: From the Ashes.  Originally released exclusively on the Oculus Rift\n\n[Source](http://gunfiregames.com/chronos-bta)\n\nFun fact: &gt;!you literally fight the main character from Chronos as the final boss in Remnant.!&lt; Chronos story spoilers, just in case.",
                            "score": 9,
                            "author": "Cleverbird"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really loved the first game.  It was a VERY good AA game that did some really interesting things to make each experience unique.  Every play-through, you'll only encounter only half of the total bosses in the game, and it's random which ones you get, so it encourages multiple play-throughs.  The gameplay was really fast and frenetic, and the locations were all really varied and unique.  Really great design aesthetic.  The only problem was that the gunplay could feel a little \"floaty\" or low-impact at times.  But this looks like a solid improvement on the first game, so this is something I'm definitely keeping my eye on.",
            "score": 3,
            "author": "Maelstrom52",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seconding this.  I bought it on sale on a whim with some friends and ended up putting over 60 hours into it.  Very solid and fun mechanics, lots of customizability.  It says a lot about a game when the gameplay is good enough and the customization is deep enough that I actually *want* to do some dungeon runs and grinding gameplay after I've finished it.  The Rogue-like addition in the DLC was an excellent touch.\n\nVery hyped for this sequel.  I always felt like Remnant 1 was a bit slept on so I have high hopes for this one.",
                    "score": 0,
                    "author": "Valtieri"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Remnant was one of the most underappreciated games of the last few years, and has a great coop experience which is also rare these days. I hope the sequel gets more attention.",
            "score": 4,
            "author": "Tifntirjeheusjfn"
        },
        {
            "level": 0,
            "comment": "Looking forward to this.  I hope the multiplayer user experience is better this time around, but having tried the game for free on epic has definitely made me a buyer for when remnant 2 comes out.",
            "score": 2,
            "author": "Khalku"
        }
    ]
}