{
    "id": "144ilzy",
    "score": 193,
    "title": "Remnant 2 - Co-Op Gameplay Trailer",
    "author": "Turbostrider27",
    "date": 1686252641.0,
    "url": "https://www.reddit.com/r/Games/comments/144ilzy",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Not sure how to feel about the Gunslinger being an pre-order early access deal... That feels a little icky.",
            "score": 41,
            "author": "Cleverbird",
            "replies": [
                {
                    "level": 1,
                    "comment": "That is weird… wonder for how long or maybe it’s “early access” in sense you can start the game as a gunslinger and you don’t need to unlock it",
                    "score": 10,
                    "author": "yahikodrg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Have they made any mention that we'll be able to swap classes around? I was under the impression you picked one at the start of the game and that was it? Which is exactly why I feel icky about this, because I was planning on picking the Gunslinger.",
                            "score": 1,
                            "author": "Cleverbird",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No- they said you can fully swap your Main and Sub classes.",
                                    "score": 6,
                                    "author": "Korten12"
                                },
                                {
                                    "level": 3,
                                    "comment": "All of the trailers for the archetypes have shown the same 5 figures circling one of the large red stones from the first game. They've only revealed what 3 of them are: Gunslinger, Handler, and Challenger. The other 2 look like long rifle build (big rifle on shoulder, mask w/ hood) and possibly a mid-range build (smaller melee gear/club thing and maybe an SMG). My guess is we're getting 3-4 initially, then 1-2 are unlocks only. They've already said we will unlock archetypes by playing/finding events in-game. Gunslinger was the first trailer so I don't think they're holding it back as DLC, just a quick unlock. You'll be able to switch your archetypes like equipment. So regardless of when you get Gunslinger, you can switch it in immediately. Having it early just means you can work to unlock its special trait sooner, which you can then use independently of the 2 archetypes you equip as primary/secondary.",
                                    "score": 4,
                                    "author": "Aerundel",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah in that case it's sort of a pointless bonus unless you really want it early.",
                                            "score": 1,
                                            "author": "TminusTech"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You can still get them in the game..Pre-Ordering gets you to unlock them Early on. Nothing is exclusive to any bundles..even armor sets. You just get to unlock them Early on",
                    "score": 7,
                    "author": "Lonely_Charlie"
                },
                {
                    "level": 1,
                    "comment": "Yeah, Remnant was a good game, but its not a game people preorder.",
                    "score": 2,
                    "author": "RedditFilthy"
                },
                {
                    "level": 1,
                    "comment": "We call it cracking dlcs",
                    "score": 1,
                    "author": "QuickbuyingGf"
                },
                {
                    "level": 1,
                    "comment": "I'm always pretty sure how to feel about that crap.",
                    "score": 1,
                    "author": "MumrikDK"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Have they said anything at all about this game being cross play? I ended up playing the first one on PC via the Microsoft store along with my friend on Xbox and I've been searching constantly if that was possible in this game, but haven't seen any news.\n\nEven just knowing the answer is no would be more helpful than nothing at all, I'll need to know what platform I can buy this game on.",
            "score": 6,
            "author": "CReaper210"
        },
        {
            "level": 0,
            "comment": "Release date is July 25th",
            "score": 7,
            "author": "Turbostrider27",
            "replies": [
                {
                    "level": 1,
                    "comment": "Have yet to set up a YouTube account. Website?",
                    "score": -4,
                    "author": "RoosterCogburn_1983",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't. Use NewPipe on Android and invidious in the browser.",
                            "score": -6,
                            "author": "meneo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://store.steampowered.com/app/1282100/Remnant_II/\n\nThe steam page has been updated with pricing, release date, and preorder/higher edition details.",
            "score": 2,
            "author": "RincerOfWind"
        }
    ]
}