{
    "id": "1467a85",
    "score": 261,
    "title": "Pacific Drive Developer Presentation Trailer - Future Games Show Summer Showcase 2023",
    "author": "Turbostrider27",
    "date": 1686421400.0,
    "url": "https://www.reddit.com/r/Games/comments/1467a85",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Looks like a pretty interesting idea for a game, the focus on the car is a good choice. Looks to be quite a bit of customization for it!",
            "score": 41,
            "author": "TheVoidDragon",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've always liked media that revolves around the concept of maintaining a vehicle in a hostile environment, or \"safe zones\" between spooky places. Expeditionary gameplay scratches a deep itch of mine.",
                    "score": 8,
                    "author": "MASTODON_ROCKS"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This could be incredibly cool. I'm keeping an eye on it. I was more excited for the less fantasy based dangers and started to lose interest a bit when I saw the green gloop blops that would damage the car. Maybe that's closer to the end of the game.",
            "score": 11,
            "author": "leap3"
        },
        {
            "level": 0,
            "comment": "I really like the art style, and the concept seems really cool. Taking care of a car and having that be your key to survival is a lot more interesting than babying food and water or clunk combat.",
            "score": 10,
            "author": "TminusTech"
        },
        {
            "level": 0,
            "comment": "It can be a very good game, it all depends on the quality of execution. I hope for an interesting adventure lasting 6-8 hours.",
            "score": 12,
            "author": "Recklessavatar"
        },
        {
            "level": 0,
            "comment": "I'm really looking forward to this. It seems like a more cohesive and fleshed out, but far less creepy version of Beware.",
            "score": 1,
            "author": "Marcus_Brody"
        }
    ]
}