{
    "id": "146jvt4",
    "score": 0,
    "title": "Indie Sunday Hub - June 11, 2023",
    "author": "rGamesMods",
    "date": 1686456054.0,
    "url": "https://www.reddit.com/r/Games/comments/146jvt4",
    "media_urls": [],
    "other_urls": [
        "https://redd.it/14759zv)",
        "https://redd.it/1474yvx)",
        "https://redd.it/1473sm8)",
        "https://redd.it/1470yql)",
        "https://redd.it/146zbwr)",
        "https://redd.it/146z8mr)",
        "https://redd.it/146y2u7)",
        "https://redd.it/146xjvm)",
        "https://redd.it/146wqrg)",
        "https://redd.it/146w1t9)",
        "https://redd.it/146w0rp)",
        "https://redd.it/146uz1o)",
        "https://redd.it/146u1sh)",
        "https://redd.it/146t2xo)",
        "https://redd.it/146tce3)",
        "https://redd.it/146t5t3)",
        "https://redd.it/146raj7)",
        "https://redd.it/146okqu)",
        "https://redd.it/146ouq1)",
        "https://www.reddit.com/r/Games/search?q="
    ],
    "postText": "Welcome to another Indie Sunday! **This event starts at 12 AM EST and will run for 24 hours.**\n\nPlease read the below guidelines carefully before participating. If you have any questions please don't hesitate to send us a modmail. \n\nA reminder that Rule 8 is not enforced during this event for submissions which follow the participation guidelines. \n\n# Submission Restrictions\n\n* Games may be unreleased or finished\n\n* You must provide video footage of the game in action. This can be a prototype, alpha, beta, etc. Images and concept art are nice but you must include a trailer or video of gameplay footage of the game. \n\n* No key/game giveaways\n\n* Only developers may make submissions for their games - if you would like to highlight a game on your own, please do so in this hub thread\n\n* The same game/developer can not be shared more than once every 30 days. \n\n\n# Submission Format\n\n* Submission must be a self-post (No direct links)\n* **Title**: Game Name - Company (or individual) Name - Short description (for example: \"classic turn based RPG\" or \"platformer inspired by Metroidvanias\")\n* **Flair**: Indie Sunday\n* **Body**: Any links to trailers/footage, a description of the game, plans for release (platform, target date, etc), any additional information you'd like to add. \n\n# Weekly Spotlight \n\n\n* [Learn Japanese RPG: Hiragana Forbidden Speech - Study Bunny Games - Learn Japanese through \"mild immersion\" in an RPG](https://redd.it/14759zv)\n* [Deep Alchemy Dungeon - Spectre17 - RPG inspired by Diablo, Baldur's Gate, and Vaporum](https://redd.it/1474yvx)\n* [Sky Base Venus - Rara Avis Interactive, LLC - Colony sim set in the skies of Venus](https://redd.it/1473sm8)\n* [Soulknight - survivor/roguelite game with leveling, mining, crafting and more](https://redd.it/1470yql)\n* [Among Ashes - Rat Cliff Games - A horror game about a haunted horror game](https://redd.it/146zbwr)\n* [Mathness - Win or Learn - Adventure puzzle game with vast world to explore; Gaming with benefits](https://redd.it/146z8mr)\n* [Brewpub Simulator - Movie Games S.A. - De-ruin your grandpa's brewpub and be serious about it or go crazy!](https://redd.it/146y2u7)\n* [Doodle Dice Monsters - Mighty Jungle Games - Turn Based Fighter Where You Draw Your Team](https://redd.it/146xjvm)\n* [KardVenture - RunAroundGames - DarkFantasy Stacklands with Deeper Gameplay.](https://redd.it/146wqrg)\n* [Escape From Mystwood Mansion - Lost Sock Studio - First-person escape-room puzzler set in a mysterious mansion](https://redd.it/146w1t9)\n* [Pneumata - Deadbolt Interactive - investigate Murders at a Rural Apartment Complex in this Lovecraftian Survival Horror](https://redd.it/146w0rp)\n* [Breach Wanderers - Baronnerie Games - A Constructed Roguelike Deckbuilder where you build your own pool of card rewards. It just came out of Early Access!](https://redd.it/146uz1o)\n* [Interlopers - Lost Anomaly - Retro FPS with modern stylized visuals, created by a solo developer](https://redd.it/146u1sh)\n* [The Perfect Pencil – Studio Cima - A hand-drawn narrative metroidvania about overcoming fear and anxiety](https://redd.it/146t2xo)\n* [Mearcair/System Pulse - Flux-Soul - Bullet Heaven/Rhythmic Fusion Like Vampire Survivors + Crypt of the Necrodancer](https://redd.it/146tce3)\n* [Sunrise's Order - Misstic Studio - Farm Game With A Delivery Service - Demo available!](https://redd.it/146t5t3)\n* [Skylords Reborn - SR Team - Warcraft III-like fantasy RTS, with a co-op campaign (BattleForge Revival)](https://redd.it/146raj7)\n* [Landnama – Sonderland – Roguelite Survival Settlement Builder](https://redd.it/146okqu)\n* [Crash Course Builder - Wombat Brawler - Crash your kart through crazy obstacle courses in our upcoming quick twitch rhythm racer](https://redd.it/146ouq1)\n\n------\n**[Previous Indie Sunday](https://www.reddit.com/r/Games/search?q=\"indie+sunday+hub\"&amp;restrict_sr=on&amp;sort=new)**\n\n# Feedback \n\nFeel free to ask any questions in the comments below, or send us a modmail if it is urgent. \n\n# Discussion\n\n* Any of these games catch your eye?\n\n* Any games you want to personally highlight that haven't been shared yet?\n\n* Any projects that have had interesting development journeys?\n\n* What indie game recommendations do you have?",
    "comments": []
}