{
    "id": "146wqrg",
    "score": 0,
    "title": "KardVenture - RunAroundGames - DarkFantasy Stacklands with Deeper Gameplay.",
    "author": "ceaRshaf",
    "date": 1686497179.0,
    "url": "https://www.reddit.com/r/Games/comments/146wqrg",
    "media_urls": [],
    "other_urls": [
        "https://store.steampowered.com/app/2442590/KardVenture/)!",
        "https://www.youtube.com/watch?v=ZwPNB4Qdy0k",
        "https://store.steampowered.com/app/2442590/KardVenture/"
    ],
    "postText": "Let's go on a [**KARDVENTURE**](https://store.steampowered.com/app/2442590/KardVenture/)!\n\n.\n\n\n**KardVenture** is a survival card game where you play as a legendary hero. Explore mysterious locations, gather resources, build your village and face the challenges ahead, be it a cold blizzard or an orc raid. Stack cards to make combos, craft, build, fight and most important... SURVIVE!\n\n**Trailer**: https://www.youtube.com/watch?v=ZwPNB4Qdy0k\n\n**Steam**: https://store.steampowered.com/app/2442590/KardVenture/\n\n.\n\n**Key Features:**\n\n* Play a wide selection of Heroes!\n* Stack cards to make them interact and discover new combos.\n* Explore unique locations and find what's hidden inside.\n* Use resources to build your village or equip your Hero.\n* Interact with NPCs and even buy their loyalty to fight alongside your Hero.\n* Fight fierce foes like Orcs, Werewolves, Goblins, Bandits and the Undead.\n* Complete Quests and Events.\n* Gather Renown by performing deeds.\n* Earn Titles to win the game.\n* Gain spells and unleash your fury on your foes.\n\n\n.\n\n\n**About**: I used to make boardgames a while ago and I had this idea for a cardgame for a long time. Since it involved too many real cards I dropped the idea of trying to make it a real card game. This year I've decided to try and prototype the idea and see if it would work as a video game. Halfway through prototyping I discovered Stacklands and was so happy to know that this concept is already proven as I was really unsure. I was also happy that my vision is quite different than what Stacklands did so I have a very good niche for the people that want to explore this concept and see it taken to the next level. So far the reception was beyond my expectations and I have very high hopes. Join the KardVenture!\n\nDemo will be available soon.",
    "comments": []
}