{
    "id": "14701nq",
    "score": 38,
    "title": "The Elder Scrolls Online - Journey to Necrom",
    "author": "Gorotheninja",
    "date": 1686505166.0,
    "url": "https://www.reddit.com/r/Games/comments/14701nq",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Just how big is the Elder Scrolls lore? It feels like every single time there's a Bethesda or Xbox related presentation the team is there to show some more additional content, the game must've gotten at least a dozen expansions already",
            "score": 17,
            "author": "-PVL93-",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's been out for 9 years and constantly updated, so yeah it's pretty massive at this point. Technically speaking this is the **30th** expansion, but that's not that useful of a description. Some have been huge, many are just a couple dungeons; some are free and have been rolled into the base game now, others are included in the subscription, and some must be purchased. But there's a ton of content no matter how you look at it.",
                    "score": 22,
                    "author": "SpaceballsTheReply"
                },
                {
                    "level": 1,
                    "comment": "Similar scale to something like Warcraft but it's not as fleshed out so it's easy to keep adding details with new content. Some fans of the main series don't like the eso additions to the lore and don't consider it canon.\n\nEdit. Got my first suicide hotline meme for this post lmao. Keep yourselves safe guys.",
                    "score": -17,
                    "author": "TangerineDiligent131",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's profoundly more fleshed out than Warcraft and is also well thought out, which Warcraft is not.\n\nElder Scrolls is more along the lines of Lord of the Rings or Wheel of Time.",
                            "score": 31,
                            "author": "BEERD0UGH",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What this guy said.",
                                    "score": 7,
                                    "author": "SirPenrose"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "For better or worse, the fans don't get to decide what is canon.",
                            "score": 7,
                            "author": "Cautious_Hold428"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "this worth getting in to?",
            "score": 3,
            "author": "BelovedApple",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've bounced off the game hard about 5 times. Never liked any of the classes, which was my major issue with the game. The new class, Arcanist is the first class they've put out that I genuinely enjoy. The new zone is also exceptionally nice. So far, this feels like the first time I won't drop the game after a month. Your milage may vary, but I'm liking it so far.",
                    "score": 22,
                    "author": "T3chnocrat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ve always had big gripes with combat, found it to be tedious and lifeless. Would you say the Arcanist class fixes that at all? Cause if it does, even a bit, I’ll probably jump in and try to power through",
                            "score": 10,
                            "author": "Bout73Ninjas",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's hard to say. I genuinely hate light attack weaving in the game. It feels bad. But on Arcanist, you don't need to. In fact, if you're using a particular skill, you really... *can't*. It's this large beam attack skill that does AoE damage and that feels nice to use. The class actually has decent animations as well. \n\nWhen I first picked it up I attempted to light attack weave and I genuinely think I was worse off doing so. If any of that sounds like problems you had, I think Arcanist might be up your alley.",
                                    "score": 10,
                                    "author": "T3chnocrat"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you love the world of the elder scrolls, yes. I'm not really into mmos, but I've played eso for hundreds and hundreds of hours",
                    "score": 18,
                    "author": "VenusAsAThey"
                },
                {
                    "level": 1,
                    "comment": "Absolutely- community (in game and on Reddit) is quite nice. Zone design has a excellent, with the art direction bridging the gap where the graphics may otherwise be dated. \n\nExceptional writing for many zones, with recurring characters that appropriately reference your past together (if you have one). \n\nVery modular and open ended, so it ranks as one of the few MMOs where you can kinda play how you want.",
                    "score": 5,
                    "author": "Trodamus"
                },
                {
                    "level": 1,
                    "comment": "If you wait until the winter sale you can get the game plus dlc for pretty cheap. It’s worth a dive if you love the elder scrolls",
                    "score": 5,
                    "author": "insomniac_z"
                },
                {
                    "level": 1,
                    "comment": "I loved ESO. I'm not really an MMO fan though, I just liked doing the story lines, exploring the zones, farming chests. Also it was really easy to find a guild and make friends.",
                    "score": 5,
                    "author": "Plants_R_Cool"
                },
                {
                    "level": 1,
                    "comment": "honestly no, the gameplay of ESO is really bad and the writing is very hit or miss, so it isn't able to make up for how bad it is to play. It does have a few good Elder Scrolls stories, but a lot of bad as well and imo the bad outweighs the good in terms of writing/story. \n\nand yes, the gameplay is really as bad as people say in every ESO thread... this game already had an engine that was already dated when it first released back in 2014, and it's only gotten worse since then from bugs to horrible animations to bad classes to poor gameplay design and so on. \n\nAnd it's an MMO, so it comes with a lot of MMO trappings and such which can be good or bad depending on what you're looking for, but even for an MMO it's got a lot of issues both in PvE and PvP.\n\non that note, ESO has one of the worst cash shops in any western MMO and the pricing structure of the game isn't great. Sure it has no monthly sub, which is good, but so much of the game is paywalled and it's made worse with how much shit is on the cash shop.",
                    "score": -7,
                    "author": "voidox"
                },
                {
                    "level": 1,
                    "comment": "not anymore. theyve begun milking the game for every last cent possible now that the community is dying out.",
                    "score": -8,
                    "author": "MeatWrld"
                },
                {
                    "level": 1,
                    "comment": "Worth checking out if you an Elder Scrolls fan. It's easily the most immersive MMORPG world by far. Everything is voice acted, world/quests react to you, and there's just so much to explore and eat up.\n\nHowever, the combat is a bit hard to get over, a lot of the melee weapons feel floaty. If you're just playing for story though, that doesn't matter too much.",
                    "score": 1,
                    "author": "Hexdro"
                }
            ]
        }
    ]
}