{
    "id": "1474mel",
    "score": 53,
    "title": "Islands of Insight | Reveal Trailer",
    "author": "Turbostrider27",
    "date": 1686515839.0,
    "url": "https://www.reddit.com/r/Games/comments/1474mel",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I am very confused by the concept of a shared world puzzle game. Isn't that just going to result in the cleverest person online at the time solving all the puzzles while everyone else watches and gets robbed of the a-ha moment?\n\nLooks neat if you can play it entirely without other people, though.",
            "score": 9,
            "author": "thoomfish",
            "replies": [
                {
                    "level": 1,
                    "comment": "The trailer went out of its way to emphasize on being able to play at your own pace, solo or with others. I just don't take shared world to imply that puzzles will be a race to whomever completes them first. If you consider all the games that have \"shared worlds\" these days. It's usually just a lobby system where people still mostly do their own thing and certain things might encourage you to group up or communicate.\n\nSometimes it's fun to work through a puzzle as a group. I have a lot of friends who don't really play puzzle games on their own, but love to watch me stream and then get caught up in it. I think they just don't like the idea of hitting a brick wall. This type of game might actually be something that bridges the gap for them. \n\nMy interest is somewhat piqued and I'm eager to see how it develops.",
                    "score": 4,
                    "author": "daiz-"
                },
                {
                    "level": 1,
                    "comment": "Sky: Children of the Light does the shared world puzzle thing.\n\nKinda.",
                    "score": 3,
                    "author": "WitchiWonk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And how does that work? You just stay away from other players so you can solve the puzzles by yourself, effectively turning it into a single player game?",
                            "score": 1,
                            "author": "Ayjayz"
                        }
                    ]
                }
            ]
        }
    ]
}