{
    "id": "147z63b",
    "score": 674,
    "title": "PRAGMATA - June 2023 Trailer",
    "author": "Turbostrider27",
    "date": 1686607921.0,
    "url": "https://www.reddit.com/r/Games/comments/147z63b",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "/r/Games is currently in Restricted Mode. You can learn more about this here:  \nhttps://www.reddit.com/r/Games/comments/145s613/rgames_and_the_june_1214_shutdown/\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Games) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Honestly the delay is probably gonna save them. We have at least 5-6 different bangers coming out this year and they will be competing against them.",
            "score": 107,
            "author": "Borgmaster"
        },
        {
            "level": 0,
            "comment": "If anyone has earned delay forgiveness over the last 5 years it is most certainly Capcom.",
            "score": 90,
            "author": "BuckSleezy"
        },
        {
            "level": 0,
            "comment": "This was announced waaaaaay too early in the first place.",
            "score": 49,
            "author": "Carfar_Farcar"
        },
        {
            "level": 0,
            "comment": "Delayed again according to Capcom",
            "score": 30,
            "author": "Turbostrider27"
        },
        {
            "level": 0,
            "comment": "I’m glad for the update, but we still don’t know what this game is exactly.\nThat being said Capcom has been great with their current slate of releases so I will definitely give the developers a pass on the delays.\nI will be ready when the developers are ready to show more, whatever this game actually is.",
            "score": 15,
            "author": "AnvilAdams"
        },
        {
            "level": 0,
            "comment": "It’s nice to see Pragmata again, even if development has clearly not gone so well.     \n    \nGlad to see it appears to be an action game. That first trailer left me curious what genre to expect",
            "score": 5,
            "author": "hitalec"
        },
        {
            "level": 0,
            "comment": "Pragmata actually still exists! And it actually looks very polished, even if it's being delayed longer. Going to have to watch the trailer a few more times to see what the game is generally about.",
            "score": 12,
            "author": "AwesomeYears"
        },
        {
            "level": 0,
            "comment": "This game looks so goddamn weird, but it's a new triple A IP, that will always have my curiosity",
            "score": 15,
            "author": "Revo_Int92"
        },
        {
            "level": 0,
            "comment": "Its great to see Capcom working on a sequel to Deep Down.\n\nJokes aside, this looks pretty interesting, sucks that it got delayed twice.",
            "score": 13,
            "author": "oilfloatsinwater"
        },
        {
            "level": 0,
            "comment": "I’m cool with a postponement, I just wish we knew a bit more about the game.",
            "score": 3,
            "author": "Perks508"
        },
        {
            "level": 0,
            "comment": "It's weird how it took so long for Capcom to start working on original ideas again. But it's good that they can do that, even though i can't figure out what kind of a game it will be.",
            "score": 7,
            "author": "ElvenNeko"
        },
        {
            "level": 0,
            "comment": "Kojima meets Bioshock/Prey, really cool concept, looks like a 3rd person action where little sister can use abilities (?) to attack enemies? Overall, love the concept, but I guess it will be released closer to 2025 or later, the drawing is a reference to indefinite delay, I guess.",
            "score": 9,
            "author": "masylus"
        },
        {
            "level": 0,
            "comment": "I appreciate the honesty with showing a trailer and telling us it's getting delayed again, wonder if it's still coming in 2023. That aside I completely forgot about this game until they showed it in the pre show I thought it was cancelled",
            "score": 2,
            "author": "TheMerck"
        },
        {
            "level": 0,
            "comment": "strong death stranding vibes!",
            "score": 1,
            "author": "AwareAnteater8923"
        },
        {
            "level": 0,
            "comment": "Hard to tell what this game even is. Is it a Returnal copy? Story driven adventure? All i can tell is that you fight with the help of a child.",
            "score": -3,
            "author": "Zip2kx"
        },
        {
            "level": 0,
            "comment": "It's been about four years since the original announcement, and the best Capcom can do is a 60 second mp4 and an announcement of a delay? If it was any other company people would be more critical, but hey, it's okay when Capcom does it. Just an extremely mediocre presentation from them overall, as usual.",
            "score": -23,
            "author": "PKMudkipz"
        },
        {
            "level": 0,
            "comment": "Capcom just created a meme, usually companies put the bad news out on the down low before a showcase to soften the blow. \n\nThese mofo's straight up said fuck it lets' waste time and money to change a scene in the game to show a changed release window on a game we first saw at the ps5 announcement. \n\nThis entire showcase was  complete waste of time and they should be banned for a year because of it. Showing off old trailers, no announcements or dates and then a section to promote a fuckign online capcom ID?!? \n\nBahahaha",
            "score": -34,
            "author": "Malemansam"
        },
        {
            "level": 0,
            "comment": "Looks neat, although I don't like the trope of someone blissfully focusing on something while there's a life or death conflict going on in the background. \n\nScrews with my suspension of disbelief and makes me dislike the character.",
            "score": -22,
            "author": "MASTODON_ROCKS"
        },
        {
            "level": 0,
            "comment": "I'm not really sure what I expected from that first trailer, but it certainly looks like a capcom game.",
            "score": 0,
            "author": "HutSussJuhnsun"
        }
    ]
}