{
    "id": "148jgj5",
    "score": 1460,
    "title": "With the latest update, GTA:Online has removed nearly 200 vehicles from its in-game store as a move towards a more \"streamlined experience.\"",
    "author": "Thrasher9294",
    "date": 1686673918.0,
    "url": "https://www.reddit.com/r/Games/comments/148jgj5",
    "media_urls": [],
    "other_urls": [
        "https://gtaforums.com/topic/991017-the-list-of-all-the-cars-removed-from-the-websites/)",
        "https://www.rockstargames.com/newswire/article/75k42ak2422o4o/experience-improvements-coming-to-gta-online)",
        "https://www.reddit.com/r/gtaonline/comments/148c2n9/vehicles_removed_from_the_ingame_websites_thanks/)."
    ],
    "postText": "With today's new update to GTA:Online, \"San Andreas Mercenaries,\" Rockstar games [has removed 195 vehicles from purchase](https://gtaforums.com/topic/991017-the-list-of-all-the-cars-removed-from-the-websites/) from the in-game store. Per the Rockstar Newswire 5 days ago, they announced that [\"Lesser-used vehicles will be removed from in-game websites to streamline the browsing experience. These vehicles will be made available via events showrooms, The Lucky Wheel, and other places.\"](https://www.rockstargames.com/newswire/article/75k42ak2422o4o/experience-improvements-coming-to-gta-online)\n\nThe vast majority of these vehicles are not simply less-common or spawn-on-the-street vehicles. Some, like the Stirling GT, are among the most competitive vehicles in their specific classes. And in that particular case, the Stirling GT *is* still available for purchase—for GTA+ members only at the new \"Vinewood Car Club,\" a location where 10 vehicles will be shuffled around every week for test driving/purchasing.\n\nIt's a fairly baffling example of attempting to introduce FOMO into a decade-old game at this point, and the community is rightfully [pretty pissed](https://www.reddit.com/r/gtaonline/comments/148c2n9/vehicles_removed_from_the_ingame_websites_thanks/).\n\nIf it really was about \"streamlining\" the experience, many have pointed out that they simply could have added a filter function to the in-game sites for particular classes, or even an option to sort alphabetically. Instead, it looks like this is the general direction they'll be taking with GTA:VI as well.",
    "comments": [
        {
            "level": 0,
            "comment": "/r/Games is currently in Restricted Mode. You can learn more about this here:  \nhttps://www.reddit.com/r/Games/comments/145s613/rgames_and_the_june_1214_shutdown/\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Games) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "It's pretty despicable, but I'll never forget when Strauss Zelnick said the following:\n\n&gt;“We are convinced that we are probably from an industry view undermonetizing on a per-user basis. There is wood to chop because I think we can do more, and we can do more without interfering with our strategy of being the most creative and our ethical approach, which is delighting consumers.”\n\nAnyone looking at GTA's continued success under the status quo and expecting it to get *more* fair is a huge masochist imo. They haven't been about making fair post-launch monetization for donkey's years now, and that's not about to change anytime soon. According to them GTA's current monetisation is ethical, these people do not have your best financial interests at heart. Every passing day they're spitballing ideas on how they can charge you even more, and the only way out is to stop playing.",
            "score": 784,
            "author": "BLACKOUT-MK2",
            "replies": [
                {
                    "level": 1,
                    "comment": "The weirdest thing about GTA Online to me has always been how genuinely difficult it is to do anything in the game. Sure, it has fun moments but to truly enjoy it you have to jump through so many insane hoops, all of which come with a full minute of loading screens. I play it and I think \"Really THIS is the game people shell out so much for?\"",
                    "score": 1,
                    "author": "acrunchycaptain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Spending five minutes to get into a two minute race with annoying checkpoints where making one mistake probably means you should just quit. It's a *frustrating* experience. Quick little games should take seconds to get into, not multiple minutes aside from actually finding a game. Then in the open world you'll just randomly explode anyway. Then again, even the single player always feels a lot like breadth before mechanical polish. That's not to say they don't put work into the systems, but the tennis minigame isn't to the quality of a stand alone game, and I feel like that applies to stuff like combat and missions too. Maybe something like Assassin's Creed is a comparison. Nothing's broken, but there's always a level of clunkiness. \"Oh I've got to pilot this sub back? Oh that takes 10 actual minutes of slow underwater driving? Hurray.\"",
                            "score": 1,
                            "author": "APiousCultist"
                        },
                        {
                            "level": 2,
                            "comment": "Same experience here. As a serious game it offers a much worse experience than other co-op or pve games. I'd much rather do heists in Payday or third person combat in The Division than ik GTAO. Doing open world CEO/Biker Gang/Drug Lab/whatever reskinned other thing they are doing is all boring. \n\nThe only fun I've had is fucking around with friends, robbing gas stations and trying to kill each other in creative ways.",
                            "score": 1,
                            "author": "Less_Tennis5174524"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}