{
    "id": "ig91kv",
    "score": 17150,
    "title": "Call Of Duty Trailer Replaced Worldwide Over Tiananmen Square Footage",
    "author": "AnActualPlatypus",
    "date": 1598348865.0,
    "url": "https://www.reddit.com/r/Games/comments/ig91kv",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Don't get why they had to change it for worldwide? Such a weak move but money wins as usual",
            "score": 5140,
            "author": "PengwinOnShroom",
            "replies": [
                {
                    "level": 1,
                    "comment": "Because the cod community doesn't really care, most people are casual players that don't even pay attention to this kind of stuff, certain communities wouldn't let this pass, Rainbow Six Siege for example, when Ubi tried to censor it worldwide because of china, people got so mad and gave them so much shit that they had to give up and create a separate version for china.\n\nI don't really see that happening with activison and their cod yearly releases.",
                    "score": 2364,
                    "author": "N1nj4Sp00n",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To be fair. R6 siege would have been massively cut. They wanted to take out blood entirely and blood splatters and bullet holes in walls from maps etc. They wanted to cut maps with gambling tables or something. \n\nThese are gameplay effects etc. The other is a glimpse of a trailer.",
                            "score": 1155,
                            "author": "wulv8022",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Might as well take out the shooting and guns in Siege too then. That's ridiculous.",
                                    "score": 417,
                                    "author": "SurreptitiousNoun",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Welcome to mainland China.\n\nWould like to mention any imagery of skulls was going to be removed, including death markers and Caveira’s face paint.",
                                            "score": 337,
                                            "author": "Swiftclaw8",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The amount of censorship in WoW in China is astounding and hilariously bad.\n\nThey replaced gore piles with BREAD. Fucking loaves of bread all over.",
                                                    "score": 293,
                                                    "author": "BureaucratDog",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "At least you can tell it's bread. I'm still trying to figure out why they made the Reforged skeletons into mutant Thanos. :/\n\nhttps://www.hiveworkshop.com/attachments/upload_2020-2-6_17-36-15-png.346498/",
                                                            "score": 105,
                                                            "author": "BaronKlatz",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Reminds me of the original Warcraft 3 zombie model.",
                                                                    "score": 27,
                                                                    "author": "th3davinci",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Wonder Bread is the superior foodstuff",
                                                            "score": 14,
                                                            "author": "Swiftclaw8",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "In DOTA 2, bloodseeker's ult icon which just generic blood gushing out, is colored black so it looks like an oil rig exploded lol",
                                                            "score": 10,
                                                            "author": "TheLastAshaman"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "yea it's crazy..\n\nunrelated but- pubg mobile is HUGE in china, although before they could monetize it in any way they had to jump through so many weird hoops... the game is literally called 'Game for Peace' now.",
                                                    "score": 62,
                                                    "author": "tirrramisu",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Isn’t the blood green?",
                                                            "score": 5,
                                                            "author": "Bossman131313"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I really don't understand the whole skulls and face paint thing. I get that the Chinese gov't is weird and oppressive but even that is kind of a stretch.",
                                                    "score": 56,
                                                    "author": "Ruraraid",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "When the government has censored things over skeletons, it's under a rule against promoting superstition, specifically a belief in ghosts.\n\nBut sometimes they censor inanimate skeletons. And sometimes they let Disney release an entire fucking movie about walking talking skeleton ghosts. It's wildly inconsistent, and that's deliberate. If the censorship line is clear, people will skirt as close to it as they can. If it's blurry, people will go above and beyond censoring themselves to avoid being caught out and banned.",
                                                            "score": 30,
                                                            "author": "PhasmaFelis",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Probably because mostly everything that is removed is to avoid exposing people to blood gore, or any other forms of human ‘suffering’, at least in the sense of human remains or fluids etc.",
                                                            "score": 41,
                                                            "author": "Swiftclaw8",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "No digital suffering in games, only the people are allowed to suffer",
                                                                    "score": 99,
                                                                    "author": "Assatt",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You can't let them see suffering otherwise they might know what it is when it happens",
                                                                            "score": 5,
                                                                            "author": "EndureAndSurvive-"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Have you seen what they did to PUBG in China? They delisted the game and replaced it with a new game called \"Game for Peace\". It has the same developers as PUBG.  \n\n\nGame is pretty much the same. Some people said that their achievements from PUBG transfered over. There's no blood--when people get hit there are some lights that light up around them. When they \"die\", they sit down and wave to you and then disappear.  \n\n\nThe Chinese government must think its citizens are 3 years old or plain stupid. When you get shot with a gun enough times, you don't sit down and wave your hands to your opponent.",
                                            "score": 79,
                                            "author": "Hailene2092",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Fuck, I kind of want there to be a choice in other versions.  Keep the blood spatter AND they sit down and wave.",
                                                    "score": 30,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Haha. Why do you want to see them wave? You can youtube and see how silly it looks.",
                                                            "score": 8,
                                                            "author": "Hailene2092",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I don’t know....I just find that bloody hilarious. \n\n*get lit up*\n\n“Bye guys!!! See you next tiiiiiime.”",
                                                                    "score": 18,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I guess it's just a big game of laser tag!",
                                                                            "score": 9,
                                                                            "author": "Hailene2092"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Pew Pew Pew........\n\nI got you!\n\nNa ah!\n\nYes I did!\n\nNo because of China!",
                                            "score": 24,
                                            "author": "thearss1"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;bullet holes in walls from maps\n\nIsnt that literally the core aspect of the game? Making holes for fireing lines and spotting?",
                                    "score": 167,
                                    "author": "Guffliepuff",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "OP probably meant map decals as in signs of gunfire when you first enter the map, not the ones made by players",
                                            "score": 73,
                                            "author": "Kuyosaki",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yeah the micro destruction is a major part of the game's meta.",
                                            "score": 17,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Although I don't think any new or reworked map features blood splatters and bullet holes. It'll be interesting to see what is going to happen to skyscraper when it gets reworked (afaik, it's next one, for y5s4)",
                                    "score": 19,
                                    "author": "CastawayOnALonelyDay",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Pretty sure the bricks of cocaine in the hong kong theme park map wouldnt go as well. Those were good covers from the window",
                                    "score": 8,
                                    "author": "tumble895"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It would all be much better if China just didn’t slaughter innocent civilians and try to cover it up, not sure why we have to tiptoe around them because of it",
                            "score": 242,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The reason most companies are really really subservient to China, is the fact that China makes up a huge huge part of profits, due to a high profile gaming community, as well as a high population who will want to buy the game in the first place.",
                                    "score": 121,
                                    "author": "whathefuckbitch",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "When you look at where these companies generate most of their revenue right now it's not China but they do want that extra 5, 10 or 20 percent so they're more than willing to make changes if they think that'll get them a product that they can sell everywhere.\n\nChina has a huge population but the majority of their populace is quite poor and isn't buying any video games. The market they're selling to in China is the 200-300 million people that live in the so called fist tier cities, and even there I bet the regional price is set quite a bit lower than it would be in Western countries. Plus you also require a local Chinese \"partner\" if you want to do business in China which means some of the profits will be skimmed by them and even if you ascent to evey demand made by the CCP there is still a chance you do something that annoys them tomorrow and that'll be it, no more access to the Chinese market for you.\n\nNot saying it's not a big enough market to care about, which company doesn't like making more money, but with a few exceptions most companies that are doing business in China just want to pump those profits that little bit more, only part of the population has extra money to spend and there is a non zero chance one day all your investment in the country goes poof because you angered the government. Plus that government is only becoming more easily angered by the day.\n\nI'm interested to see if they let COD back in the market even though they removed the footage from the trailer, if it's one thing they can't stand being mentioned it's Tiananmen Square. It's literally something that you are not allowed to talk about and does not appear in any state approved Chinese media ever, and as we can see with video games it all has to be approved of by the CCP.",
                                            "score": 69,
                                            "author": "zoobrix",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 75,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 68,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Isn't there a difference in the type of catering when it comes to censorship? I'm all for putting Wukong and Lunar New Year in every game on the planet but when you start taking stuff out of games that were already in there for years (WoW, Siege) then what is the point?",
                                            "score": 35,
                                            "author": "GarenBushTerrorist",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The thing about us yanks though is many of us are fine with criticism of America. I have heard of things getting swayed because of the American market, but I can't really think of anything that's been outright banned in such a way.",
                                            "score": 26,
                                            "author": "JuppppyIV",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 31,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Whoa dude, careful now, you'll get the Reddit China Defense Force in your replies if you keep mentioning those real events.",
                                    "score": 12,
                                    "author": "AlexStonehammer"
                                },
                                {
                                    "level": 3,
                                    "comment": "I mean as a company, it's not a hard choice. Do you keep the clip and sacrifice billions of dollars in profit? Or do you make a tiny adjustment and rake in the cash? Is it the moral thing to do? Absolutely not. Is it the smart business move? Absolutely.",
                                    "score": 13,
                                    "author": "KnobWobble"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Because the cod community doesn't really care, most people are casual players that don't even pay attention to this kind of stuff, certain communities wouldn't let this pass, Rainbow Six Siege for example, when Ubi tried to censor it worldwide because of china, people got so mad and gave them so much shit that they had to give up and create a separate version for china.\n\nThey should stop catering to China.",
                            "score": 68,
                            "author": "Infinite_Moment_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 54,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They changed it worldwide because that's what China wants. China is attempting to use cultural influence to increase their standing in the world, in the same way that American cultural influence came to dominate the world over the last hundred years. Video games and movies are their main targets, and they push to have the changes made worldwide rather than just for the local market, so the rest of the world sees what China wants us to see. But you also see it in other things, like how they wanted to bully the NBA over remarks about Hong Kong.",
                    "score": 333,
                    "author": "oatmealparty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://www.theglobeandmail.com/world/article-new-hong-kong-security-law-allows-beijing-to-go-after-critics-well/\n\nNot only that. But if an American or Canadian says bad words about China on the internet or in the news, in their own country. China now says your breaking Chinese law and they can arrest you if you ever go there. \n\nYou're committing thought crimes against a state you dont belong too.",
                            "score": 172,
                            "author": "FenixRaynor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Afaik they still have the two Canadian michaels who were arrested as bargaining chips to try and get back their chinese spy. Just scooped up two random Canadians.",
                                    "score": 70,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Bad time to be named Micheal in China I guess",
                                            "score": 13,
                                            "author": "Stalagmus",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 15,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My money is on China threatening to ban their other properties as well, overwatch, wow, ECT.",
                    "score": 79,
                    "author": "pm_me_ur_doggo__",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "People forget it's activision-blizzard now. If CoD goes so does Starcraft and wow and all the other blizz properties too.",
                            "score": 36,
                            "author": "newObsolete",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This might surprise you but most companies only care about money",
                    "score": 36,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bu...but their PR team said they do everything they do because of us!",
                            "score": 13,
                            "author": "elitexero"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Because the writers of Call of Duty are simple minded, jingoistic hacks who don't have any actual thematic or moral approach to storytelling and would gleefully remove anything from their games that they thought would affect sales.",
                    "score": 7,
                    "author": "CptDecaf"
                },
                {
                    "level": 1,
                    "comment": "Every little trace of reality **must** be erased and overwritten to avoid any potential revolution in the future",
                    "score": 20,
                    "author": "parishiIt0n",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "just a reminder, the tagline, marketing or w.e for this game is:\n\n\"...know your history or be doomed to repeat it...\"\n\nof course, \"know your history\" only for what daddy china wants you to know~ \n\njust fck the hell off Activision",
            "score": 11796,
            "author": "voidox",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lmfao irony of this is so hilarious and depressing at same time , truly dystopian.\n\n\"know about your history until it comes in way of us making profit\"",
                    "score": 3921,
                    "author": "shivam4321",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is it anything but entirely expected? If you're expecting a game to take risks and push boundaries, Call of Duty is the worst possible place to start. They haven't changed their gameplay formula or release structure in over a decade lol",
                            "score": 1052,
                            "author": "JmanVere",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well imagine how stupid the person approving that trailer must be. It was quite obvious that China would never allow something like that on their market. But somehow they went for it anyway and are now backpedalling.",
                                    "score": 390,
                                    "author": "95RigorMortis",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Or smart. Get a second trailer ready, wait for the shit from china to hit the news and replace it to placate china and enjoy the free publicity from the scandal.",
                                            "score": 675,
                                            "author": "kippetjeh",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah actually you are 100% correct. My bad.",
                                                    "score": 284,
                                                    "author": "95RigorMortis",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Activision marketing turned Streisand effect into free marketing\n\nThey're too dangerous to be left alive!",
                                                            "score": 121,
                                                            "author": "Young_Djinn",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "AND they still got to double-broadcast awareness of the Tiananmen massacre. First with the trailer, and second with the controversy when they replace it.\n\nIt's subversively ethical, in a way.",
                                                                    "score": 64,
                                                                    "author": "Bexexexe",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "So, good guy Activision actually?",
                                                                            "score": 18,
                                                                            "author": "le_GoogleFit",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "There's some pretty significant gymnastics being done here but sure, I agree with the other guy - compliments to the marketing team, ***if it was indeed planned out to use China's national shame and insecurities as a marketing gimmick***\n\nThat's kind of baller, in a fucked up way.",
                                                                                    "score": 35,
                                                                                    "author": "Middle_Class_Twit",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Good guy marketers. Activision are coward profiteers, but usefully-predictable ones.",
                                                                                    "score": 37,
                                                                                    "author": "Bexexexe",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "\"⚡⚡LIMITED STORAGE SPACE⚡⚡\"\n\n-My Console",
                                                                    "score": 47,
                                                                    "author": "Bjorn2bwilde24"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "You don't know that. Why do we just assume each and every situation like this is some insane guerilla marketing campaign? Have we ever been right? Maybe the situation is just what it appears to be on the surface?",
                                                            "score": 34,
                                                            "author": "slickestwood",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "In this case, I think it would be pretty obvious to any moderately competent marketing team that China would have a problem with it...",
                                                                    "score": 57,
                                                                    "author": "free_beer",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 53,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Because on the scale of all marketing teams for every company, I can only assume Activision, one of the biggest video game companies on the planet, has a marketing team that ranks higher than most other companies. You may be trying to make the claim that there is no such thing as a moderately competent marketing team, but you'd have to be a fool to think that Activision isn't hiring some of the best people in the industry to their team.",
                                                                                    "score": 26,
                                                                                    "author": "ScipioLongstocking",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I am suprised at the suprise about this in this thread, the other thread about China banning it, all the top comments where basically saying this",
                                                    "score": 18,
                                                    "author": "Lazyr3x"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I don't think even Activision wants the publicity of bowing down to the CCPs censorship worldwide. If anything it makes me 100% certain that I will continue to avoid any game published by them.",
                                                    "score": 6,
                                                    "author": "hillside126",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It's made headlines and been on the front of reddit for three days. I wouldn't call that stupid, they knew exactly what they were doing.",
                                            "score": 26,
                                            "author": "Coziestpigeon2"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "\"WeRe YoUeXpEcTiNg SoMeThINg ELse?\"\n\nThis is a poor argument that completely brushes aside the issue by implying that nobody should be upset when companies/people do shitty things because companies/people  do shitty things and that's just a sad thought to be that defeated.",
                                    "score": 74,
                                    "author": "PLUMBUS_AMONG_US_117",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; If you're expecting a game to take risks and push boundaries\n\nShowing footage of the Tianamen Square Massacre isn't taking a risk or pushing a boundary.",
                                    "score": 49,
                                    "author": "mettyc",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Goal posts, we have to sacrifice so much of what we know to be true just to feel like part of the conversation. Saying China slaughtered protesters is just saying what happened. Normalizing, ignoring, or outright denying the massacre is very dangerous and harmful for human rights in general. The greed and compliance is unacceptable, and yeah...it’s unamerican. How do you rake in this much cash glorifying the American ideal of giving your life to defend freedom and not see the dissonance here? My guess is that the franchise, and a lot of aaa ips, have gotten “too big to fail”, like they have to sell to China to turn a profit. Imo that’s too big, but then again I have not played since world at war, and I wasn’t planning to buy the new flavor anyway.",
                                            "score": 47,
                                            "author": "prepangea",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; They haven't changed their gameplay formula or release structure in over a decade lol\n\nYes? They tried to turn it into a shitty jetpack hero shooter and only recently brought it back to traditional cod gameplay, thank god.\n\nMost recent cod changed its release formula into something way better with the season pass. Plus warzone continuing across numerous games now.",
                                    "score": 26,
                                    "author": "JarekBloodDragon",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "They're tried changing it and sales drop.",
                                    "score": 10,
                                    "author": "droctagonapus"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 32,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "That’s capitalism baby",
                            "score": 34,
                            "author": "evilroyslade420",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Activision knows COD sells. They wanna repeat that history.",
                    "score": 167,
                    "author": "whynonamesopen",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The irony LOL. Honestly at this point who's surprised though. COD campaigns has been for the majority of its time a propaganda filled, money printing machine.. Did we forget last year's Highway of Death?",
                    "score": 379,
                    "author": "iV1rus0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Remember when they brought in literal, actual war criminal Oliver North to consult, and also appear as your cool NPC buddy? This is just Activision kowtowing to a different brand of nationalism.",
                            "score": 67,
                            "author": "THE_SEX_YELLER",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What the fuck? Are you serious?",
                                    "score": 10,
                                    "author": "kirrin"
                                },
                                {
                                    "level": 3,
                                    "comment": "What game was this? Didn't know about that one",
                                    "score": 5,
                                    "author": "Tostecles",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Black Ops II",
                                            "score": 8,
                                            "author": "Quetzal-Labs"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That is infuriating and frustrating in equal, giant parts.",
                    "score": 33,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The irony is so palpable you can taste it.",
                    "score": 19,
                    "author": "Makgath",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "https://www.youtube.com/watch?v=1Gtt2JxmQtg",
                    "score": 7,
                    "author": "julio_dilio"
                },
                {
                    "level": 1,
                    "comment": "Don’t forget American war crimes that were assigned to Russians in previous game under creative fiction excuse. Pure brainwash propaganda for American citizens.",
                    "score": 238,
                    "author": "V_es",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'll never understand why people keep calling out EA as being the worst company, when meanwhile Activision is pulling despicable shit like this.\n\nSeriously, fuck Activision.",
            "score": 2980,
            "author": "Cleverbird",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1097,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That dlc was cool. Totally massive maps. I wish I could play it again with about 100 people, tons of jets, cars, helis etc. I guess it’s not really possible but someone can definitely wish!",
                            "score": 360,
                            "author": "Jasek19",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Closest you can get is the custom servers with instant vehicle spawn and player respawn and 6000 tickets. It turns chaotic.",
                                    "score": 118,
                                    "author": "TheMexicanJuan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's a real battle at this point",
                                            "score": 34,
                                            "author": "Neosantana",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Nothing like the old Bad Company 2 Rush days of two teams colliding around the objective and it being pure chaos for the next 25-30 minutes.",
                                                    "score": 16,
                                                    "author": "swodaem",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I still find myself yearning for what BF Bad Company 2 gave us. I’ll never forget being constantly harassed by an attack helicopter circling overhead and my group hasn’t unlocked guided missiles yet. So long story short we all went engineer, got rpgs, and just started shooting rocket after rocket at him until finally we got him and could move on the objective. It was 20 minutes of pure multiplayer madness.",
                                                            "score": 10,
                                                            "author": "ltrainer2",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 25,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ah yes, the meat grinder.\n\nYou're fighting for 45 minutes and then just one Chad ends up finding a gap and flanks your entire team, the next thing you know you're being spawnraped",
                                                    "score": 16,
                                                    "author": "TheMexicanJuan",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; That dlc was cool. \n\nMost of the basegame was also set in China, not just the DLC.",
                                    "score": 74,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The main villain of the game was Chinese, to be fair he's not far off the real thing.",
                                            "score": 39,
                                            "author": "MagnummShlong",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "well if I recall it was actually some power-hungry general that was pumping the chinese military full of false info to instigate a war. In the end China and US ended up working together. Hell one of your partners was a chinese representative.",
                                                    "score": 30,
                                                    "author": "breakfastclub1",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yup, and that power-hungry general tried to kill the Chinese president which you ended up saving.\n\nThe true villains in the story is the general and Russia (of course) since they backed said general with funds and military aid.",
                                                            "score": 18,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If im not mistaken (i could be wrong) EA has very few if any Chinese shareholders, plus they dont really sell any of their games on the Chinese market, especially not BF. This would mean China cant push them around and punish them for putting the country in a bad light.",
                            "score": 47,
                            "author": "wgunn77",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It has little to do with Chinese shareholders and more to do with how much business they do in China. Like Valve has 0 Chinese shareholders but they're still going to make concessions for the Chinese market.\n\n&amp;#x200B;\n\nAnd while Activision/Riot or whoever get lots of criticism for being Chinese complacent, you're not going to see Nintendo denouncing China anytime soon.",
                                    "score": 63,
                                    "author": "lestye",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nintendo won't ever denounce anyone, though. They straight up removed all forms of communication so that nobody stands a chance of being offended by something even someone else said on their platform. You can't even direct message someone, to be offensive or otherwise, and they'll remove user-created content that even approaches a touchy subject.\n\nNintendo will never make a stand against anything, ever. They're here to sell games and that's ALL. In a way, it's refreshing, to know that they won't be swayed by (external, at least) politics - but it also makes me feel like they have no soul.",
                                            "score": 27,
                                            "author": "skulblaka",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If you ever go to Japan, keep that feeling in mind and you'll understand so much more about their culture, very generally speaking.",
                                                    "score": 7,
                                                    "author": "themettaur"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That was years ago, China has more control now and I doubt that would happen today.",
                            "score": 62,
                            "author": "Krak2511",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Activision censored WoW for China way back in 2007.",
                                    "score": 124,
                                    "author": "InvaderSM",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They merged in 2008 though?",
                                            "score": 22,
                                            "author": "gonnabetoday",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Companies have been censoring the Chinese version of games for decades.\n\nNo one complains about the changes games made for Germany for years. Or the games that switched real drugs for fake ones to avoid a ban in Australia.\n\nCountries have rules. You live under yours, they live under theirs.\n\nThe worldwide censoring of shit is where the issue is. Not WoW changing content for Chinese servers. They're just following Chinese law in China.",
                                            "score": 83,
                                            "author": "the_timps",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Happens all the time in the US as well, just that they censor sexual content instead. US audiences have no issue with violence but as soon as there's some tits all hell breaks loose.\n\nI'm not even criticizing it, I don't like art being compromised for the sake of the local cultures tastes but as you say countries have rules and if you want to sell a product there you have to abide by them. Whether they are written in stone or just vague concepts of what is acceptable and not.\n\nChanging a game for local release is fine, changing a worldwide trailer just for the sake of a single market is pretty disappointing.",
                                                    "score": 39,
                                                    "author": "i_706_i",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 82,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "EA used to be the worst, stigma hangs around for a bit. Arguably they have gotten much better recently, and others have taken the mantle.",
                    "score": 34,
                    "author": "oxero",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They managed to turn around their crunch culture and treatment of employees, while Rockstar and CDProjekt seems to still struggle big time with it",
                            "score": 36,
                            "author": "koalaondrugs",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Most big for-profit companies, almost especially ones that operate internationally, are the same. It’s at the point where the list of exceptions to my statement would be far shorter.",
                    "score": 8,
                    "author": "Andrakisjl",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "\"Fuck Activision\"... yet fanboys immediately buy the next COD. It's a video game version of crack cocaine. People just can't stop playing it and willing give Activision more money.",
                    "score": 124,
                    "author": "crazydave33",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The fuck Activision squad is a minority sadly. Same with the boycott FIFA or Nba 2k squad. The companies will make millions even if you and I boycott th3m because most people don't give a fuck.",
                            "score": 100,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The problem is different with sports games. It’s weird people buy COD so much because first person shooters are everywhere. You can fill that void wherever you want.\n\nIf you’re a huge wrestling, soccer, football, or basketball fan, well, you’re fucked. There is no alternative. And opinions like this where you “just don’t buy it” with no alternative despite how much you just want to simulate games are extremely irritating. I’d love to stop buying madden. Offer me a proper alternative, and I’ll get right on that.",
                                    "score": 15,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Your problem, is misunderstanding whom is posting here and who the actual wider audience is.",
                            "score": 17,
                            "author": "Depth_Creative",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sigh. These companies take turns, gradually dragging quality down the drain. Once one company gets heat, it lies low for a couple of months, meanwhile another company lowers the standards even further and the former company can come out as “see? compared to that, our shit wasn’t even that bad!”. Rinse and repeat.",
                    "score": 5,
                    "author": "nothis"
                },
                {
                    "level": 1,
                    "comment": "Suggest that they only ever released this version of the trailer.\n\nThere'd be no calls that they were being despicable, or censored, or under China's thumb. At the very least you wouldn't ever know if they were self-censoring their trailer.\n\nInstead they released a video with the utmost widely known icon of censorship in the world. Tiananmen Square was taught in school twenty years ago. There's no way they wouldn't know how it'd be received in China.\n\nThis instance is purely a media stunt and it's worked.",
                    "score": 4,
                    "author": "InfTotality",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "How the fuck are you going to have a tag line that says “know your history” and still censor yourself? Isn’t this whole game about the Cold War struggle of Communism and Democracy? \n\nThis is truly embarrassing and while I’m not shocked by it, I find it extremely gross how far companies will go for that Chinese money.",
            "score": 1604,
            "author": "SparkyPantsMcGee",
            "replies": [
                {
                    "level": 1,
                    "comment": "The irony is that they would ever use that line to begin when the US military uses CoD as a propaganda tool for recruitment.\n\nAlso fun fact one of the writers and producers on Call of Duty left to be an \"unknown conflict\" adviser for the Department of Defense.\n\nFinally if you don't know about the The Military Entrainment Complex I highly suggest you read up on it so you at least know that it exists. \n\nI'm not excusing China's actions at all but I think this outrage is unwarranted for a series which has been doing this kind of thing for years now. \n\nhttps://www.theguardian.com/technology/2014/oct/22/call-of-duty-gaming-role-military-entertainment-complex\n\nhttps://en.m.wikipedia.org/wiki/Military-entertainment_complex",
                    "score": 398,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; but I think this outrage is unwarranted\n\nnope pretty warranted. just because they have done shit like this fir years doesn’t mean it’s not warranted...\n\nin fact it needs more outrage",
                            "score": 69,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Communism and *Capitalism, not “democracy”.",
                    "score": 82,
                    "author": "T1O1R1Y1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Way too many people think democracy and capitalism are synonymous and exclusive to each other.",
                            "score": 73,
                            "author": "ThisIsGoobly",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "“Isn’t this whole game about the Cold War struggle of Communism and Democracy?”\n\nNo - it’s just another Call of Duty entry. It’s a shooter that glorifies violence and has no redeeming value. It’s army recruitment propaganda that gives kids a hard on for army shit which likely encourages them to enlist. With this censorship step they have taken, there should be a broad boycott of this terrible franchise.",
                    "score": 231,
                    "author": "Septic-Mist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As someone who use to play CoD campaign every year for a while I found the reboot to Modern Warfare to be very...uncomfortable to play. That might’ve been the point of the game but maybe the graphics were to real idk but I didn’t enjoy the constant killing and shooting and terrorist attacks. I know that what most CoD have been about but that one just made me not want to play another CoD game.",
                            "score": 32,
                            "author": "SYLOK_THEAROUSED",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 357,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't know if that's true or not, but the problem is that China will reach beyond their sphere of influence to impose their rewrites of history onto other countries via businesses, and businesses will roll over.",
                    "score": 268,
                    "author": "madog1418",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah this is what bothers me. While I dont agree with it at all I can live with them censoring the Chinese trailer, but to edit the trailer for the whole world because China has a fit is ridiculous. Especially when the whole theme is \"know your history\".",
                            "score": 89,
                            "author": "unfortunatesoul77",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "True. That tag line aged like milk for Activision. Even if they're not selling that particular product over there, as long as they're selling something there, they've got em by the balls.",
                                    "score": 16,
                                    "author": "make_love_to_potato"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If you're reaching beyond your sphere of influence, is it really even reaching at that point? That sphere is earth sized at this point.",
                            "score": 18,
                            "author": "wadad17"
                        },
                        {
                            "level": 2,
                            "comment": "The powerful get to write history. As they have done, as they will do. China's taking its turn at the time, for better or worse.",
                            "score": 6,
                            "author": "shaaangy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 613,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 113,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 64,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 9,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 55,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fuck the Chinese Communist Party. Grow a fucking backbone.\n\nSame to you Activision, Fucking weak! You're all for doing the right thing when it came to the black lives matter movement but you don't want to touch a nerve in the Chinese government. So what if your game doesn't sell in China. You make less money but you'll still make a profit and you'll be respected for taking a real stand. Chinese people will hear about what happened and the truth will prevail. You could be on the right side of history but instead you support an oppresive regime.\n\nEdit: Thank you for the silver. I see some agree with me and some have taken issue with my comment. At least we can have a civil discussion about it on an internet forum. Consider that if we were censored, as is the case in some places, this would not be allowed.\n\nEdit 2: Thank you for the awards. I've been enjoying reading the comments and getting everyone's perspective.",
            "score": 1658,
            "author": "ForumStalker",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's not about a backbone, it's about money. If they want more money, they will keep doing this. They don't give 2 fucks about anything else",
                    "score": 319,
                    "author": "I_dontevenlift",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "^ this, literally the case for ANY cause or movement in the world and a company shows up, it's all fcking PR and money :/\n\n[insert] company here, we totally $upport [insert] cause ^^^^unless ^^^^daddy ^^^^china ^^^^says ^^^^no , buy our products",
                            "score": 94,
                            "author": "voidox",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's a corporation that loves money.",
                    "score": 12,
                    "author": "kashmoney59"
                },
                {
                    "level": 1,
                    "comment": "They make a game making western countries invading others are good guys. They been in the business of supporting oppresive regimes from the jump.",
                    "score": 89,
                    "author": "Obaketake",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably because they did the whole \"America under siege\" thing a little too many times lol",
                            "score": 8,
                            "author": "SnipingBunuelo"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The Chinese \"Communist\" Party, who loves billionaires.",
                    "score": 3,
                    "author": "faesmooched"
                },
                {
                    "level": 1,
                    "comment": "Call of Duty is published by Activision Blizzard, it’s the Hearthstone debacle all over again. It’s Activision bending the knee to the Chinese communist party. Tencent own 5% of Activision Blizzard.",
                    "score": 17,
                    "author": "rickhunter17",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "In 20 years, will china censor what they are doing to uyghurs and hong kongers right now?",
            "score": 291,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean, they're censoring it right now, so yeah, no reason to think they won't keep censoring it.\n\nFuck the CPC, and fuck all the companies who bend over for them. They are collaborators in human rights violations.",
                    "score": 138,
                    "author": "stufff"
                },
                {
                    "level": 1,
                    "comment": "Someone should make an FPS where you liberate the Uyghurs from Chinese camps ala Nazis \n\nPost it on the epic game store and try to get epic pre sale funding\n\nWould be a shit storm of epic proportions",
                    "score": 169,
                    "author": "suprduprr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Haha, imagine if its a wolfenstein game",
                            "score": 58,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 34,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They are already doing it",
                    "score": 28,
                    "author": "Sergnb"
                },
                {
                    "level": 1,
                    "comment": "It doesn't take 20 years. It's happening right now, but since it's in the present and information goes around fast we know more about it so it doesn't seem as covered up. These things are most definitely actively getting swept under the rug. Wait till coverage dies down a bit more than it already has and it'll be like it never existed in China's eyes.",
                    "score": 7,
                    "author": "evorm"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why put the Tiananmen footage in the trailer if you know it is one of the most censored pieces of media in China?",
            "score": 83,
            "author": "paintlegz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Double headlines baby",
                    "score": 150,
                    "author": "Ganondorf66",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "100% this. I would even bet they will have had the new trailer ready before the first went up for sure. Maybe even generated the stir themselves! \n\nIt shouldn't be censored though. Far worse events have been shown in video games and media.",
                            "score": 25,
                            "author": "ponytoaster",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are we pretending for a second that Activision didn't do this on purpose. They new exactly what CCP would do if they released a trailer showing T.S. massacre. It's a marketing play.",
            "score": 95,
            "author": "DanceJuice",
            "replies": [
                {
                    "level": 1,
                    "comment": "Activision's motive is unclear to me, but it does seem like a fairly predictable domino to get people talking about it.",
                    "score": 11,
                    "author": "pmdrpg"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly who cares if China looks bad? Why the hell do they care so much? They’ve committed crimes, so have most, if not all other nations. Germany committed genocide, so have the Americans, Japan did some HORRID shit to China in the mid 20th century, the USSR well we don’t even know the full extend of what they did.\n\nEvery nation fucked up at some point, China can’t hide it, so why the fuck are they so pissed off when someone mentions Tiananmen Square?",
            "score": 16,
            "author": "mdhunter99",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I love the quote at the end.. \"know your history\" \n\nI guess you may know all of it, except that from China.",
            "score": 149,
            "author": "t0shki",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 40,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "But sure, when they issued Blitzchung a ban it wasn't at all because of upsetting the Chinese government",
            "score": 11,
            "author": "Fatal1ty_93_RUS"
        },
        {
            "level": 0,
            "comment": "I wonder how long Activision can keep playing both sides before The US military or the CCP just cut ties with them outright.",
            "score": 62,
            "author": "RyukaBuddy",
            "replies": [
                {
                    "level": 1,
                    "comment": "The US military will never cut ties as long as they keep recruiting kids who think that the military is like playing CoD.",
                    "score": 140,
                    "author": "Dr_Adopted",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "1) playing cod 14-18\n\n2) recruited in the army at 18\n\n3) deployed at 19\n\n4) lose leg or an arm\n\n5) retired at 21 and can't do basic human things + having ptsd\n\n6) thousands in debt for the american healthcare system\n\nMan I love the call of duty \n\nbut its true that both halo and cod were used to recruit people in the american army now these same people making these games appeal the nazis and dictators of the world  for money lol",
                            "score": 69,
                            "author": "Amaurotica",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Except of you lost a limb while being in the military you're covered.",
                                    "score": 18,
                                    "author": "CalebS92",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If anything, losing a limb is the fastest and most guaranteed way to ensure the VA takes care of you for life. My spine is completely fucked from my time spent serving but I’m 7 months into my VA claim with another ~11 left before I get a rating, and the only way I can afford physical therapy is with that rating. Shit I’d be better off if I lost a leg while I was at it.",
                                            "score": 18,
                                            "author": "IllllIIIllllIl"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "See now that's an interesting question. For those who don't know the US military invests a good amount of money into the CoD especially via esports. I assume that until it becomes a true conflict of interests the US military doesn't care and the same goes for the CCP however I wonder how long it will be until there is a true conflict of interests between the two.",
                    "score": 20,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "So the trailer is about showing bad things that bad people did, as that's core to the game and it's narrative.\n\nBut when those bad people complain that showing the scene of a massacre makes them look bad it gets removed, dafuq ?\n\nOnce more showing they care more about their wallets than creating a faithful game.",
            "score": 10,
            "author": "I_Shag_Aliens"
        },
        {
            "level": 0,
            "comment": "Why would China worry about Tiananmen Square footage?\nNothing happened there. Right guys?",
            "score": 42,
            "author": "Rorplup",
            "replies": []
        },
        {
            "level": 0,
            "comment": "And as they certainly calculated with this maneuver they are just getting all the attention on them for free just before the preorder startup. We think China is playing with them but in reality they are playing with us.",
            "score": 28,
            "author": "aroloki1",
            "replies": [
                {
                    "level": 1,
                    "comment": "There’s no such thing as bad publicity. I wonder though if this will be the end of it, or if they have another PR card in their sleeve to spin this in their favor.",
                    "score": 4,
                    "author": "onwee"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is rich considering what they've put in COD in the past...I think people forget, this game is literally about killing people and thats it lol.",
            "score": 7,
            "author": "Java_Bomber"
        },
        {
            "level": 0,
            "comment": "China: We demand you censor out the brutal oppression we lie to our people about committing on them. Activision: You got the money?",
            "score": 7,
            "author": "tinylittlebabyjesus"
        },
        {
            "level": 0,
            "comment": "Anyone have the orginal?",
            "score": 27,
            "author": "Affablesea9917",
            "replies": [
                {
                    "level": 1,
                    "comment": "The kotaku article has both the orginal and the shorter one embeded.\n\nhttps://www.youtube.com/watch?v=m1kfCGjOaSw",
                    "score": 54,
                    "author": "dyrin",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Are Redditors physically unable to read an article?",
                    "score": 15,
                    "author": "lucid_scheming",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "So much for the biting political commentary, eh Bobby?",
            "score": 29,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Boycotted, not one to normally do this, but if you censor yourself worldwide to appease the fascists, you're fucking pathetic.",
            "score": 5,
            "author": "TheDankestG"
        },
        {
            "level": 0,
            "comment": "Not gonna lie, but I'm kind of tired of these corporations sucking up to China. It makes one wonder if any of their intentions are serious, or do they simply support whatever is politically expedient at the time? Something tells me that black lives matter and LGBT rights would go out the window as soon as China decided to have a problem with either.",
            "score": 6,
            "author": "cutememe"
        },
        {
            "level": 0,
            "comment": "The Russian defect shown is a largely discredited hack who made pretty false claims and pushed a right-wing narrative. In the same lecture as shown on the trailer he calls Civil Rights activists “useful idiots” and then goes on to try and smear Vietnam war protestors and black people fighting for their liberties as Russian funded psyops. \n\nif there was any merit to the story of a Russian spy infiltrating all of America during the height of the cold war, the American government wouldn’t let a fucking ex-KGB agent go on a tour blabbering about it. I can’t believe people actually take him seriously.",
            "score": 248,
            "author": "jorgery22",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, that whole trailer is basically just using a right wing conspiracy that re-gained a lot of traction when smearing any sort of social progress as \"cultural marxism\" became vogue in a lot of corners of the internet. If you have any doubt what kinda people celebrated that trailer, just read the comments. Lots of straight up Nazis talking about people finally waking up.\n\nIdiotic move to replace it because of footage of Tiananmen Square, but it was a shitty ass trailer to begin with it.",
                    "score": 146,
                    "author": "crautzalat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I legitimately forgot that the intentions of that were to fear-monger about cultural marxism.\n\nCultural marxism itself is a fucking invisible boogeyman drummed up by none other than the actual Nazi’s to excuse them invading Russia during WWII.",
                            "score": 84,
                            "author": "jorgery22",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Funniest thing is the guy wasn’t even a kgb spy, he was publics relations working under the kgb lol\n\nAnyone that buys into him lacks any critical thinking, so no surprise that a lot radicalised gamers and nerds buy into his speech",
                    "score": 49,
                    "author": "wagwan11111",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He never claims to be, he outright says he works for the propaganda office lol.",
                            "score": 27,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The government probably offered him something in exchange for trying to discredit progressive activists in the US. With the [intended consequences](https://lh3.googleusercontent.com/proxy/m4BxEn-Jy-oa9OKEerd13RoByRF_f8Lh9aF6k4S_e-d0AerkHwrx2bXkS_5CdN7OcLVQ1uaXDZUOiw8UuN1uHuw9nZuIyfQYWD4p6PfsMGzUu58LAgmxqKc6kmszbQ791jXkAq_WVlgPwcuAfA) being very clear.",
                    "score": 35,
                    "author": "Flipiwipy"
                },
                {
                    "level": 1,
                    "comment": "Yeah, discussion about this game is hilarious right now. \"Uuuuh know your history huh activision? But then you cave in to the communist china, hypocrites!\", meanwhile they are completely fine with a trailer peddling far right imperialistic propaganda.\n\nI get hating on the Chinese government is in Vogue and I agree with it, that but it's just funny to hear so much \"this is supposed to be about knowing your history!\" while completely ignoring the absolute bullshit that the trailer was showing before. \n\nGuys, it already was hypocritical from the get go, this china deal didn't change much about the latent irony of that trailer.",
                    "score": 30,
                    "author": "Sergnb",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah this entire game is literally just propaganda and manufactured consent for us imperialism. How are people still falling for it and how are we still doing video games that are just \"lol kill the evil Russian COMMIES\" jfc",
                            "score": 10,
                            "author": "Lilyo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There is no doubt in my mind that they knew that there would be trouble if they included the footage and are using this to drive up noise and support about the game's political value",
            "score": 17,
            "author": "Prowlerbaseball",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean they caved so they don't have much political value to go off of.",
                    "score": 5,
                    "author": "Mattdriver12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got downvoted yesterday for saying China censorship is worse then any type of American censorship currently.\n  \nBoth nations have issues but I'll take living in America any day over even thinking about China.",
            "score": 14,
            "author": "armyboy941",
            "replies": []
        },
        {
            "level": 0,
            "comment": "China's position as the dominant superpower from an economic standpoint is the reason why this happens and the reason why they aren't the target of economic sanctions despite suppressing tibetans and uighurs",
            "score": 5,
            "author": "Pancho507"
        },
        {
            "level": 0,
            "comment": "Seems weird to condemn Activision for this when the entire game is a propaganda project that is going to be hiding what the actual Black Ops during the Cold War were. \n\n&amp;#x200B;\n\nDon't get me wrong, fuck the CCP, but if we are going to examine the political responsibilies of Call of Duty, perhaps we should look past the promotional material and to the actual game.",
            "score": 86,
            "author": "Flipiwipy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Consider that this trailer is promoting a conspiracy theory. In time when people  are very welcome to believe them.",
                    "score": 62,
                    "author": "darth_bard",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "We don't even need to look past the promotional material for the game when they are using right wing/american imperialistic conspiracy theories and propaganda to sell it.\n\nLiteral red scare McCarthyism in a COD trailer, nobody bats an eye. China bans it? WELL NOW WE HAVE A PROBLEM!",
                    "score": 33,
                    "author": "Sergnb",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I feel like a moron, I was watching that trailer and thinking \"Oh neat they're doing an alt-history thing where the Soviets actually tried this in the US, that's an interesting idea.\" but no they're just doing it unironically.",
                            "score": 12,
                            "author": "sgthombre"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I mean it’s a game full of American propaganda. Why is everyone so mad if they censor some Chinese atrocities as well? Their target audience is global and the same way they will not expose American crimes in South America and Iraq, they won’t expose Chinese ones. Be consistent when demanding the truth.",
            "score": 20,
            "author": "itiswhatitis2323",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Lol the irony of knowing your history being the slogan yet that footage being taken out because China was mad.",
            "score": 9,
            "author": "jlange94"
        },
        {
            "level": 0,
            "comment": "Oh look, more spineless caving by ActivisionBlizzard to the almighty China. They'll never change.\n\nWonder how many people kept up the Hearthstone boycott past a few weeks.",
            "score": 4,
            "author": "Easilycrazyhat"
        }
    ]
}