{
    "id": "jpt8ga",
    "score": 13757,
    "title": "Mass Effect Legendary Edition announced",
    "author": "Turbostrider27",
    "date": 1604764831.0,
    "url": "https://www.reddit.com/r/Games/comments/jpt8ga",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "From the article:\n\n&gt; Mass Effect Legendary Edition will include single-player base content and DLC from Mass Effect, Mass Effect 2, and Mass Effect 3, plus promo weapons, armors, and packs – all remastered and optimized for 4k Ultra HD. It will be available in Spring 2021 for Xbox One, PlayStation 4, and PC, with forward compatibility and targeted enhancements on Xbox Series X and PlayStation 5. More information to come in the new year!\n&gt; \n&gt; Meanwhile here at BioWare, a veteran team has been hard at work envisioning the next chapter of the Mass Effect universe. We are in early stages on the project and can’t say any more just yet, but we’re looking forward to sharing our vision for where we’ll be going next.\n&gt; \n&gt;",
            "score": 3698,
            "author": "Turbostrider27",
            "replies": [
                {
                    "level": 1,
                    "comment": "Casually announcing a new Mass Effect game in development, lol.",
                    "score": 3335,
                    "author": "Bolt_995",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 1240,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 485,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 372,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 132,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 94,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 52,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 34,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 21,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 11,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 15,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 157,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 128,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 23,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 11,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 13,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And knowing current BioWare they will fuck around for 5 years, reboot the project 3 times and then cobble together a game within a year and a half under permanent crunch to meet the deadline for the project.",
                            "score": 841,
                            "author": "unsaintlyx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bad management seems to be the bane of multiple studios unfortunately.",
                                    "score": 254,
                                    "author": "RedRex46",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Remember back in college how you fucked around for a project that was a month out and crammed the night before? \n\nThis is the nature of game design. Literally.",
                                            "score": 134,
                                            "author": "zackchess10",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Procrastination is in human nature it seems, every corporate environment embraces it.",
                                                    "score": 38,
                                                    "author": "moseswunde",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It can be managed around with a competent leader who sets smaller and achievable goals at multiple stages of development. And by having a cohesive vision that isn't scrapped repeatedly.",
                                                            "score": 19,
                                                            "author": "r4wrb4by",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Anthem Effect",
                                    "score": 93,
                                    "author": "AltimaNEO",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "*Andromeda Effect \n\nSame issues, 2 years earlier.",
                                            "score": 58,
                                            "author": "SurrealKarma",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "And the game will be brillant enough to be remarkable, but bogged down by things that not even indie devs do wrong.\n\nAnd have fantastic Dlcs\n\n*Angrily staring at Inquisition*",
                                    "score": 133,
                                    "author": "drago2000plus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That take's a bit outdated, I think. Mass Effect Andromeda and Anthem were both very unremarkable (but don't know if the DLCs are good tho). Anthem was actually remarkably bad.\n\nOnly reason I'm pointing this out is because that expose after Anthem was released pointed to this \"we can fix it in crunch and it will be BRILLIANT somehow\" attitude as one of the main causes",
                                            "score": 221,
                                            "author": "nemuri_no_kogoro",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That's the way to be honest. We know games are being made way too soon and they end up nothing like they say all the time.",
                            "score": 116,
                            "author": "Darkone539",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Games should be like movies. Who cares if we know they are being worked on. Work on them as long as you want and show them when you are ready.",
                                    "score": 75,
                                    "author": "FatalFirecrotch",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Cyberpunk 2077 is the perfect example of this. They really shouldn't have announced a release date, but now they keep delaying (this is what, the fourth time now?) and the \"mandatory crunch,\" not to mention the insane hype for it that will in no way be met by the game. Honestly, they should've stayed a small, productive studio with their \"it'll be ready when it's ready\" mantra",
                                            "score": 54,
                                            "author": "Bayonethics",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "But movies DO have release dates, and they have crunch too.",
                                                    "score": 21,
                                                    "author": "Daedolis",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Exactly. If they didn't announce, nobody would care if it comes out next year instead. Build hype when the game is nearly done, officially announce when the game is ready to go gold, and don't force the team to crunch for a day 1 patch.",
                                                    "score": 24,
                                                    "author": "one_is_the_loneliest",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Say what you want about Fallout 4, but that was the way to do an announcement. \"Here's the game, it'll be out in 6 months.\"",
                                                            "score": 9,
                                                            "author": "VellDarksbane"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I hope they return to the multiplayer from  3, it was so damn fun.",
                            "score": 39,
                            "author": "pazur13",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "More people look forward to the OT remaster than a new game. They trust the OT to be good and after Andromeda are afraid of a new game being bad.",
                            "score": 89,
                            "author": "Carmen_SDiego",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't think that's the case. A lot of ME:Andromeda players, including me and some of my friends, want to know how the Andromeda story unfolds. Andromeda was clearly just the first chapter, so many quests and plot points in the game were only a build-up for things to come. Despite the many flaws of the game in technology, narrative and gameplay, I'm quite looking forward to the next one.\n\nA remaster however, even one as much asked for as this one, never reaches the same audience than the original releases. It won't have the same budget, marketing and hype as a new release. I just played through the orignal trilogy in September since I was between jobs and had a month off, and I was quite happy with the nostalgia of playing the aged first title.",
                                    "score": 92,
                                    "author": "zirfeld",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Same here. When all was said and done, I liked Andromeda a lot. Its *different* from the OT. It's more about exploration than a focused narrative. But I liked that, and once the release bugs were sorted out I had a really good time with it. I'm all for a sequel.",
                                            "score": 53,
                                            "author": "bamisdead",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes. In Andromeda the races act a bit more nuanced. I really liked the development of the Krogans and Nakmor Drack was a good companion.",
                                                    "score": 22,
                                                    "author": "PapstJL4U",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Nobody hates Andromeda for the Premises of exploring a new galaxy and see a fresh part of the universe with a new story to follow, that was the great part about it. The game is not well liked because it was clearly rushed, lost a lot of the promised freedom and features, and on top of that was never finished. It could have been fantastic, but EA and BioWare settled for mediocre.",
                                                            "score": 14,
                                                            "author": "IQtie",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Honestly it didn't need to be a Mass Effect game. That name carried more baggage than the game deserved.",
                                            "score": 5,
                                            "author": "v1nts"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 40,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It was killed by those hilariously bad animations that went viral after copies were sent to reviewers. Doesn’t matter that they fixed it shortly after release, it branded Andromeda as a clown show. If not for that, people would have viewed the game in a different lens.",
                                            "score": 27,
                                            "author": "Puggednose",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; Meanwhile here at BioWare, **a veteran team** has been hard at work envisioning the next chapter of the Mass Effect universe  \n\nI guess they had to clarify that after Andromeda that was made by a team that hadn't developed a full game before.",
                    "score": 650,
                    "author": "RobotWantsKitty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah yes, from the same veteran team that gave us Anthem.",
                            "score": 501,
                            "author": "menofhorror",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 135,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And the team admitted that it was under hellish condition and caused many veterans to leave the studio.",
                                            "score": 172,
                                            "author": "menofhorror",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I played DA:I for the first time this year and while I like it a lot, it's at the same time a very frustrating game. The characters and story quest are great. But it feels like the game is trying to waste my time at every opportunity it gets by making me do boring shit, like side quests that reminds me of MMOs from the early 2000s and timers from shitty mobile games. The open worlds also feels tacked on and disconnected from the rest of the game. \n\nThe gameplay itself wasn't bad but the tactical mode was buggy as hell (played on PS4, a friend told me it was better on PC) which made it a chore to use. I really feel like if they improved it and put more effort into designing challenging encounters it could be something really special. I wouldn't be surprised if they instead removed the tactical view from the sequel though, since I doubt many used it.",
                                            "score": 44,
                                            "author": "Bzamora",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The game is better if you just ignore the open world filler quests and focus on main + companion quests. Pacing is much better that way and you aren't really missing much with the fetch quests since crafting made the best weapons anyway",
                                                    "score": 18,
                                                    "author": "xflashbackxbrd"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "DA: I had fucking David Gaider.",
                                            "score": 38,
                                            "author": "thelastcookie",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And now they have Patrick Weekes who's even better.",
                                                    "score": 43,
                                                    "author": "TheHolyGoatman",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "For DA, not this next ME, which needs a similar quality lead writer to be any good.",
                                                            "score": 17,
                                                            "author": "thelastcookie",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Sure, but the previous Mass Effects never had Gaider either.",
                                                                    "score": 17,
                                                                    "author": "TheHolyGoatman",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "their A team has mostly left the studio.",
                                            "score": 5,
                                            "author": "gordonpown"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "But Andromeda was 10x better than Anthem, which was developed by the veteran team. So let’s not act like this means everything is going back to the way it was. I hope so though.",
                            "score": 224,
                            "author": "index24",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Anthem proves the team is unable to make a live service game. But, perhaps, they are still capable of making a regular action RPG.",
                                    "score": 114,
                                    "author": "RobotWantsKitty",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s similar to my thinking. Plus there were so many other unfortunate events and circumstances during the development of that game.\nHopefully going back to what they’re masters of and things going smoother will result in a great Mass Effect game.",
                                            "score": 21,
                                            "author": "index24",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "God, I hope there's Mass Effect 3 multiplayer included too, but I'm not holding my breath.",
                    "score": 162,
                    "author": "StandsForVice",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wish, but the post says the single-player content and dlc, so that looks like a no go until further announcements. \n\nHonestly, I bought andromeda for $10 just to play the multiplayer, I really liked the balance between caster and shooter in the game, as well as the power combos.",
                            "score": 126,
                            "author": "madog1418",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Even though the single player of Andromeda was a trainwreck, I desperately wanted to like the multiplayer after loving the one in ME3. But, the Andromeda multiplayer never captured the same feel as ME3 for me for some reason.",
                                    "score": 52,
                                    "author": "FROMtheASHES984",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You werent as powerful, and ability priming caused certain abilities not to proc the same way. the combat loop was just a little off.",
                                            "score": 45,
                                            "author": "Based_Lord_Shaxx"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes please, i can't believe how fun that mode was. So underrated.",
                            "score": 47,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I had no intention of getting into that mode, I played like 200 hours of it.",
                                    "score": 43,
                                    "author": "MyCoolWhiteLies",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Mass Effect 3 multiplayer was one of the happiest surprises in gaming.",
                                            "score": 42,
                                            "author": "culturedrobot",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Having never played it before, I'm really excited for this!",
                    "score": 37,
                    "author": "silkysmoothjay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're in for a treat T_T I discovered it like 2 years ago and couldn't believe I'd slept on it for so long. It's one of my absolute favorite franchises now.",
                            "score": 11,
                            "author": "Prisencoli_All_Right",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So basically Mass Effect 1,2,3 remastered with all DLC and held to modern standards (this probably applies to 1 more) and a new ME with “veteran devs”.\n\nPlease for the love of God don’t mess this up Bioware",
            "score": 2506,
            "author": "ownage516",
            "replies": [
                {
                    "level": 1,
                    "comment": "Modern standards.. and a remaster only, not remake.. I wonder about the graphics, then.",
                    "score": 246,
                    "author": "TheLast_Centurion",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hope it's an actual remaster and not one of those \"remasters\" where it's just a texture resolution + lighting upgrade that messed with the already established artstyle. I'm looking at you Crysis \"Remastered\"",
                            "score": 235,
                            "author": "SnipingBunuelo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think it will be. Dont forget on contrast. That must be always changed, so they could show any change, cause you'd see none.",
                                    "score": 99,
                                    "author": "TheLast_Centurion",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lol that's so true. It's hard to point at COD for guidance, but I think their MW campaign remasters were excellent. Same with Mafia DE and Halo 2A. I wish that was the standard for remasters and not the exception\n\nEdit: I made a mistake, Mafia DE is a remake not a remaster lol",
                                            "score": 57,
                                            "author": "SnipingBunuelo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Spyro and Crash had great remakes. Remaster seems to be usually just \"we gave option for 5k and unlocked framerate, give us 60 bucks. Oh also, a bit of different contrast, so we can show comparison shots.\"",
                                                    "score": 23,
                                                    "author": "TheLast_Centurion",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "What do you think an actual remaster is?",
                                    "score": 10,
                                    "author": "RavenCyarm",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Hd textures, make ui worse, done.",
                            "score": 22,
                            "author": "Adamulos",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "New game will realistically drop in 2024 if not later. Watching how much messed up the world has been in last few months I don't hold my breath to plying a game few years in the future. A lot more things can fuck it up other than Bioware itself.",
                    "score": 398,
                    "author": "Buki1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't forget before a new mass effect we have the upcoming dragon age and I believe a new IP game coming out.",
                            "score": 159,
                            "author": "King-of-Kards",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And Anthem: A Realm Reborn, although that's likely a different branch of BW and I'm not even sure they're still working on it.",
                                    "score": 79,
                                    "author": "zptc",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I believe anthem is being worked on and has had a few blog updates outlining what the team wants to do. That being said, it looks like the team working on anthem right now is extremely small, and I wouldn’t be surprised if plans for the overhaul are scrapped and anthem is never mentioned again.",
                                            "score": 33,
                                            "author": "iceburg77779",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If it is in *early* stages, aka the writing and planning on what to do, the current climate shouldn’t slow that down an obscene amount. Later stages absolutely, but I’ve heard that the early stages of development aren’t too bad due to zoom calls being just as effective as board meetings etc",
                            "score": 8,
                            "author": "Yurt_TheSilentQueef"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh, they will.",
                    "score": 591,
                    "author": "MapleHamwich",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks, Nostradamus.",
                            "score": 178,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Quasimodo predicted this",
                                    "score": 67,
                                    "author": "Brilliant-Disguise",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Very allegorical, the sacred and the propane",
                                            "score": 13,
                                            "author": "Ser_Ten_Goodmen"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Dunno who that is, but the name rings a bell.",
                                            "score": 44,
                                            "author": "Schrau",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Don't tell me you've never pondered that",
                                            "score": 6,
                                            "author": "Capten_Idiot"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I had tons of fun with ME, but unfortunately I aint willing to comeback and re-purchase the same games with an upscaled resolution so that it looks sharper. A “remake”like how capcom handled RE2 would’ve convinced me to even buy it all individually. But the article said bioware didn’t plan to do that. It wanted to give the original experience but with visual enhancements. So this would be enticing to gamers who’ve never played it but will probably be mehhh for long time fans.",
                    "score": 56,
                    "author": "dnvncntdln",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Agreed. I'm a huge Mass Effect fan (I literally have a full wall dedicated to Mass Effect posters) but if this is indeed just an upscale with some lighting changes I doubt I'll rebuy it until I decide I want the games on PC. Now if it got the full Halo 2 anniversary treatment I'd buy it in a heartbeat, but I don't think that's happening unfortunately.",
                            "score": 19,
                            "author": "8bitowners"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[**The trailer**](https://www.youtube.com/watch?v=1HirtVXyKOU)",
            "score": 260,
            "author": "MulciberTenebras",
            "replies": [
                {
                    "level": 1,
                    "comment": "Chills. \n\nI love this series so much.",
                    "score": 118,
                    "author": "Smallgenie549",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've never played any of them and that still gave me chills. I'm really excited to find out what all the fuss is about.",
                            "score": 64,
                            "author": "Randomd0g",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They were right to focus on the characters, they are great.",
                                    "score": 56,
                                    "author": "insan3soldiern",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's insane how few games have a cast as incredible as mass effect. Mordin, Garrus, Jack, Thane, Tali, Liara... fucking legendary. Even the worst characters in mass effect are better than some of the best in other games",
                                            "score": 60,
                                            "author": "funkym0nkey77",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I love that you mentioned Mordin first.\n\nHis arc is incredible. Him and Thane got me emotional in the third game and I've never felt so deeply friends with a fricking NPC like that before.\n\nMass Effect 2 is still the gold standard for companion NPCs. I looked forward to make the rounds between each mission to see if their dialogue had anything new to it and would relish every single moment we spent together.",
                                                    "score": 28,
                                                    "author": "Kayyam",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;I love that you mentioned Mordin first.\n\nHad to be him.",
                                                            "score": 14,
                                                            "author": "MrTrt",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Joker, EDI, Wrex, Legion, so dope",
                                                    "score": 10,
                                                    "author": "dharmabum87",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You’re in for a treat then, it’s a fucking awesome series, don’t let anyone talk down on 3 it’s fucking great.",
                                    "score": 14,
                                    "author": "whycantibelinus"
                                },
                                {
                                    "level": 3,
                                    "comment": "I wish I was you. It’s gonna be amazing.",
                                    "score": 6,
                                    "author": "Rycan420"
                                },
                                {
                                    "level": 3,
                                    "comment": "They're making this precisely for people like you who never got to experience the OG trilogy and may not be willing to play 8-13 year old games. And then when you fall in love with it, like we did, you're ready and waiting to buy the new one they're working on!",
                                    "score": 4,
                                    "author": "beeramz"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I find their choice of characters in the title image interesting.  Shepard is obviously the MC and they seem to have tried to keep them gender/appearance neutral.  Presumably for the secondary characters they chose the ones they liked the most - or thought the community likes the most.  Hence we have Garrus given the highest billing (as it should be) followed by Liara and Tali.  That's no surprise but what's curious is who else is there - particularly Miranda and Thane.  They're no more significant in game than other characters who didn't 'make the cut' (e.g. Legion, Jacob) but clearly Bioware thinks they're popular enough to boost sales.  They're probably right.\n\n(Nice to see Anderson sneaking in as the sole non-crew character.)",
                    "score": 11,
                    "author": "sgtkang",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Makes sense to me, Miranda and Thane are both great. I'd say along with Mordin (who was also shown) they represent the best of the new characters introduced in ME2 - no offense to Grunt (who was likely excluded in favor of Wrex), Jack, Legion, or Samara. Some offense to Jacob.",
                            "score": 14,
                            "author": "MtHammer"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;  That's no surprise but what's curious is who else is there - particularly Miranda and Thane. \n\nMiranda and Thane were both part of ME2's marketing, [as I recall](https://cdn.gamer-network.net/2019/articles/2019-11-23-15-50/games-of-the-decade-mass-effect-2-gave-me-characters-i-will-cherish-forever-1574524195863.jpg/)",
                            "score": 8,
                            "author": "mikeburnfire"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is perfect - just what I was hoping for. I just played through all three games a few years ago but look forward to doing it again in 4k and new textures plus no more long elevator rides (hopefully!) thanks to SSDs.",
            "score": 672,
            "author": "sag969",
            "replies": [
                {
                    "level": 1,
                    "comment": "There was a lot of dialog during those elevator rides, I think they'll be staying. Plus with the simultaneous PC release, they'll have to support HDD machines still.",
                    "score": 418,
                    "author": "denizenKRIM",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hope they remark this like 'hey when did the citadel fix the elavator? It's so much faster now!' Whenever player exhausting all dialogue.",
                            "score": 212,
                            "author": "dadvader",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If I remember right they make that joke in ME2",
                                    "score": 164,
                                    "author": "Onisquirrel",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They did, Tali gets impatient and hacks the elevator  to go faster in one of the scenes",
                                            "score": 83,
                                            "author": "Misha_Vozduh",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Miranda as well",
                                                    "score": 19,
                                                    "author": "l4dlouis"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah I'm torn on this as well.  You heard radio announcements that actually give you missions in those elevator rides, as well as fun banter with your squad.  Wouldn't seem right for them to just be \"gone.\"\n\nThe one in the Normandy could be removed, nothing ever happened there.\n\nAnd you can fast travel on the Citadel and avoid most of the elevators anyway.\n\nI think they have to keep them.",
                            "score": 119,
                            "author": "UnHoly_One",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The elevator rides were usually longer than the dialogues. They could just make them last as long as needed for the dialogue to finish.",
                                    "score": 67,
                                    "author": "Cabamacadaf",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's already how they work. It's demonstrable on PC since PCs are going to have variable loading times",
                                            "score": 27,
                                            "author": "AprilSpektra"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Keep them, but skippable.",
                                    "score": 21,
                                    "author": "Charwinger21",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Most likely answer. \"Hold X to skip\" is a pretty easy thing to slap on.",
                                            "score": 19,
                                            "author": "Nyrin"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "On 360 the dialog ended WAY before the elevator ride was done, on One X the elevator stops right after the dialog is done which is MUCH faster.",
                            "score": 50,
                            "author": "WendellStampsX",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I hope they tweak the elevator rides so that they only last as long as the dialogue. That way we get both shorter 'load' times and hear the party banter",
                    "score": 31,
                    "author": "MasterVader420",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The elevator rides will always be a sort of charm to the game if you ask me lol",
                    "score": 12,
                    "author": "HAHArun2y0mama"
                },
                {
                    "level": 1,
                    "comment": "I will miss the news announcements in elevators, please keep em",
                    "score": 24,
                    "author": "n0stalghia"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's been about 5 years since I played through my favorite game series of all time, so I'm pretty excited. Like others I wish more elements were being remade and polished, but after the Mass Effect IP was kind of left in limbo for several years, I'll take whatever good news I can get. Excited to just play through the series again and have everything under one collection\n\nCurious about the direction of the new game though. As a huge fan, I couldn't get into Andromeda..even though the gameplay wasn't bad, it just felt kind of soulless. Really hoping they can figure out a way to get back to the series original roots, because it's a hugely underutilized IP in my opinion.",
            "score": 116,
            "author": "_Razgriz_",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Wonder how they’ll handle the elevator rides with SSDs in the new consoles. Although not pertinent to the story, there was a lot of fun dialogue between characters while you waited for the next level of the citadel to load. \n\nSecretly hoping for some added “wow the citadel elevators are fast now” voice lines",
            "score": 55,
            "author": "Taco-Tico",
            "replies": [
                {
                    "level": 1,
                    "comment": "imo the elevators will go as fast as the dialogue does",
                    "score": 33,
                    "author": "rebezil"
                },
                {
                    "level": 1,
                    "comment": "Would be cool if the dialogue now played over radios on the Normandy, showing the squad mates talk to each other. \n\nI liked how in 3 and Andromeda, the squad were a lot more friendly with each other and interacted outside of missions.",
                    "score": 24,
                    "author": "wormywils"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 249,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The Mass Effect Trilogy were some of the most ambitious RPGs of the 7th generation. I barely remember them, but I'm certainly interested in trying them all over again!\n\nIt's interesting that this is handled like the Master Chief Collection. One launcher for all the different games. Seems the multiplayer for Mass Effect 3 isn't included, sadly. I heard it was pretty good.",
            "score": 77,
            "author": "Extreme-Tactician",
            "replies": [
                {
                    "level": 1,
                    "comment": "Very good.",
                    "score": 22,
                    "author": "leadhound"
                },
                {
                    "level": 1,
                    "comment": "I've played and beaten, and played and beaten, and played and beaten over and over each game a dozen ways. But for whatever reason I never actually played all 3 in a row with one Shep. \n\nThis remaster is very much hype for me, seeing as how COVID will never fucking end, I now have the time. All the time in the world. (Twilight Zone music...)\n\nAlso they haven't said anything confirming a Nintendo Switch version, but I swear I've seen a 3rd party leak reveal. So my conflict is, if possible, do I buy it for the console I already have, or wait until I can snatch up a PS5 and get it then...",
                    "score": 13,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Seems like the rumors about this not including ME3 multiplayer are true. That's a massive disappointment.\n\nIt's easily better than Andromeda's and it's honestly one of the best multiplayer offerings EA has put out in the last decade.",
            "score": 225,
            "author": "RealityExit",
            "replies": [
                {
                    "level": 1,
                    "comment": "For a multiplayer that was just tacked on, it was damn amazing and me and my friends played the shit out of it",
                    "score": 201,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Amusingly, then they actually *tried* to improve it in Andromeda and it sucked.",
                            "score": 13,
                            "author": "GumdropGoober"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah it was a blast!",
                            "score": 26,
                            "author": "LotaraShaaren"
                        },
                        {
                            "level": 2,
                            "comment": "Part of that was because of how unique it was. No other multiplayer game was trying to do the same kind of thing, so to set a unique goal and hit the mark is really impressive.",
                            "score": 8,
                            "author": "Helicase21"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I kind of agree here but the good news is ME3 multiplayer is still going strong on most systems. Check out r/MECoOp, still very active.",
                    "score": 46,
                    "author": "LiquidInferno25",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know, it absolutely is. But it's a much easier sell to get my friends and fresh people into a new game than one came out (by then) 9 years and two consoles ago and has a small player base. It would have been a great chance to fix some of the many long-standing bugs and polish up the controls as well.",
                            "score": 23,
                            "author": "RealityExit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No arguments there.  Though the thought of how they may choose to increase monetization on a remastered ME3 multi does scare me.  Maybe we'll get lucky and it will be added later pending good sales of the legendary edition.",
                                    "score": 10,
                                    "author": "LiquidInferno25"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It was very surprisingly fun, I got deep into it for a couple months.",
                    "score": 13,
                    "author": "kidkolumbo"
                },
                {
                    "level": 1,
                    "comment": "Absolutely agree. Really strong multiplayer with a lot of depth and good progression - plus it would be an opportunity to get a whole bunch of microtransaction revenue so whatever work is needed to get it running would surely pay for itself?",
                    "score": 34,
                    "author": "Piggstein",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "ME3 Multiplayer was one of the best surprises of gaming tbh. I went into it expecting to just play a bit for achievements and ended it being one of my most played games on the 360. So fucking fun",
                    "score": 7,
                    "author": "ShadoowtheSecond"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mass Effect 1 not being remade as the rumors said is disappointing, but maybe the improved graphics and shaders will be enough. Ah well.",
            "score": 523,
            "author": "Croswynd",
            "replies": [
                {
                    "level": 1,
                    "comment": "Rumors were clear that none of the games are getting a remake. It was only said that they decided ME1 needs more work and that's why they postponed the release. More work doesn't instantly mean a remake.",
                    "score": 655,
                    "author": "readher",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And given Bioware’s status these days it’s probably best they don’t touch these games up too much. I’d rather have a game with outdated mechanics but the same experience than one that ruins the charm of the series.",
                            "score": 262,
                            "author": "FunkyChug",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "QoLl changes and rebalance is where it's at, anything more would risk spoiling the experience.",
                                    "score": 88,
                                    "author": "pazur13",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Like trying to save rescue liara in the mako, randomly die from nothing, have to start the entire mission over.",
                                            "score": 29,
                                            "author": "Pardo86"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "tbf, ME:A's gameplay was not bad at all, it had it's issues but imo it was overall on the fun side of things\n\nhonestly, I wouldn't mind at all having ME1 story/characters/quests with ME:A's gameplay and mako",
                                    "score": 198,
                                    "author": "voidox",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Andromeda had by far the most fun and dynamic combat , I wouldn't mind biotic jumping around the citadel stomping cerberus",
                                            "score": 122,
                                            "author": "Frale_2",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, realistically it was the extremely poor quality of the writing and animations that held it back. It really felt like it was written entirely by interns.",
                                                    "score": 49,
                                                    "author": "Hellknightx",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Did you know I was an asari commando?",
                                                            "score": 33,
                                                            "author": "Frale_2",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I'm sorry, my face is just tired.",
                                                                    "score": 42,
                                                                    "author": "Hellknightx",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "From memory, that is the absolute worst line of dialogue in the entire game.\n\nNot counting everything Liam says.",
                                                                            "score": 30,
                                                                            "author": "Frale_2",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Optimistically, I'm hoping that it's just the writers taking a cheap shot at the shitty facial animations.",
                                                                                    "score": 6,
                                                                                    "author": "Hellknightx"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Andromeda combat was only better than me 1.  I prefer the class based system of 2 and 3",
                                            "score": 32,
                                            "author": "rokkshark",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Since ME3 and MEA went harder into the sci-fantasy side of things with space ninjas and biotic-wizards, the MEA system felt good for jumping around and physics kills.  But god-dammed nothing matches the pure dopamine hit I get from playing a Krogan Vanguard in ME3.  MEA is just too light and airy, ME3 had some real meat to its characters and certain shotguns/snipers.",
                                                    "score": 14,
                                                    "author": "One_more_page"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Rumors were clear that none of the games are getting a remake.\n\nNah, a lot of (fake) rumors talked about heavy modifications in all the 3 games.\n\nhttps://www.reddit.com/r/MassEffectAndromeda/comments/habhbi/me_remaster_here_is_what_i_know/",
                            "score": 18,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;Mass Effect 1 not being remade as the rumors said is disappointing\n\nAs one of five people who genuinely liked Mako content I couldn't be happier!",
                    "score": 150,
                    "author": "Plastastic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "5 people?  There are dozens of us - DOZENS!",
                            "score": 65,
                            "author": "AlienHairball",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I always had fun driving the mako! Better than that stupid hovering thing in the second one. \nWHEELS FOREVER!",
                                    "score": 24,
                                    "author": "CaptnNMorgan",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm in the big majority, ME1 is my favorite of the trilogy and I loved exploring the planets.",
                            "score": 5,
                            "author": "GoochRash"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Also maybe touching up the animations a bit in the three games would have been great. I adore the ME series but the animations were already dated on release",
                    "score": 77,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Adding animations would be great too. The “scratching back of neck”, “checking gun”, and “rotating shoulders while getting on tippie-toes” are like Wilhelm screams to me... jumps out every time I see them reused",
                            "score": 79,
                            "author": "Neon-Night-Riders",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh my god I can visualize them all",
                                    "score": 50,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Pushing off the table. Throwing their arms up. Standing with that hero pose. Pointing the finger forward to make a point with the half step forward. Going to SWTOR for a couple hundred hours cemented these animations in my mind.",
                                            "score": 23,
                                            "author": "Sugar_buddy",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I wouldn’t expect too much there. The ME characters faces were animated with bones by hand and there’s kind of a practical limit to how good you can make that look even with a skilled animation team. It’s always gonna look kind of like muppets (because that’s essentially what they are)\n\nNowadays facial animation would likely be done with mesh deformations which allow more nuanced and fluid expressions, and if it’s a more realistic style they’d probably do face scans and performance capture. But it requires a completely different production pipeline to do that. It would mean remaking a good chunk of the original games’ content if they were going to attempt that which would be super cool but it doesn’t sound like they’re going that far with this remaster.",
                            "score": 15,
                            "author": "we_are_sex_bobomb"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 44,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The mafia and Demon Soul's remake set expectations high. Also, the first mass effect came out over a decade ago. I feel like improvements beyond purely technical stuff that mods already address aren't that crazy to request.",
                            "score": 52,
                            "author": "1000000thSubscriber",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "2 and 3 still hold up well enough.\n\n1 is where there would need to be some modern touch-ups, but all the rumors have already pointed to it receiving the most attention anyway.",
                                    "score": 30,
                                    "author": "denizenKRIM",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah seriously. ME1 is an amazing RPG but they really could've done to update the gameplay, which is...a little rough. I think keeping it's RPG systems but aligning it's combat with ME2 or 3 would've been the perfect formula.",
                    "score": 96,
                    "author": "Darth_drizzt_42",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Balance changes aren't out of the question - making it so you can actually hit the broad side of a barn with a rifle without having to invest half your skill points into it isn't anything that requires a major combat revamp. That would go a long way to relieving some of the frustration.",
                    "score": 12,
                    "author": "StandsForVice"
                },
                {
                    "level": 1,
                    "comment": "I'm mostly just keeping an eye on how much they remaster ME1's visuals. I'm not one of the people who thinks ME1 was a better gameplay experience than ME2/3, but I still think it's totally fine to keep its gameplay the same, as for all of its clunks and flaws it's a really unique and interesting experience. \n\nVisually, though, ME1 kinda sucks compared to the other two games. Character models in particular are atrocious; every time I replay it, I sit there and lament how hard it is to make a good looking Femshep. What I really want is for them to overhaul the game's visuals in order to bring it up to the rest of the trilogy's standards.",
                    "score": 29,
                    "author": "AigisAegis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Counterpoint: Diana Allers.",
                            "score": 14,
                            "author": "Hyperionides"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 7,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "While I am disappointed that ME1 isn't being fully remade, I'm also relieved since I don't know how much I trust the Bioware of now to remake ME1.\n\nI'm still super excited to play through all the games again, I'm hoping we'll see gameplay soon.",
            "score": 128,
            "author": "bristow84",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel like if they just updated the gunplay to what they did in ME2 and ME3, and updated the ui interface, it would be pretty damn good. The gameplay in the first game has definitely aged the worst.",
                    "score": 43,
                    "author": "FlotationDevice",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think that's what they mean, the gunplay won't be updated",
                            "score": 5,
                            "author": "HurricaneHugo"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "BioWare would absolutely fuck up an ME1 remake.",
                    "score": 56,
                    "author": "WubWubMiller"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are BioWare overloading themselves here? According to this blog, they're now working on next Mass Effect, Anthem 2.0 revamp, and Dragon Age 4, plus still supporting Old Republic",
            "score": 49,
            "author": "Fatal1ty_93_RUS",
            "replies": [
                {
                    "level": 1,
                    "comment": "Support for Old Republic is Austin I believe. Same with Anthem. Sucks to be those guys.\n\nDragon Age 4 is its own team. And I'm guessing Mass Effect new game is the team that did ME1-3 and the release version of Anthem.\n\nAnd this project doesn't appear to be anything. Retexturing? They likely hired out a small group to do that outside the company. Or, since this has been rumored for years, a handful of people have been working on retextures in between bigger jobs.",
                    "score": 26,
                    "author": "K1nd4Weird",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not gonna lie, I was hoping ME1 would get a remake with ME2 and ME3 getting remastered, the same way the Mafia series did it recently. ME1's gameplay *really* doesn't hold up well today. Kind of deflating.",
            "score": 270,
            "author": "gigantism",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 253,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's more of a CRPG. The latter games are more ARPG style.\n\nAs a CRPG fan, I prefer the first one.",
                            "score": 91,
                            "author": "grendus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What exactly constitutes a CRPG?",
                                    "score": 11,
                                    "author": "MegamanX195",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Classic role playing game and action role playing game. I had to google lol",
                                            "score": 12,
                                            "author": "yossarianvega",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I would've been okay with an inventory UI overhaul and some tightening of other mechanics, but I'm glad they didn't throw it all out to match the other two games. There are definitely things that I like most about ME1.",
                            "score": 28,
                            "author": "IM_V_CATS"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Early stages for the next game, probably means 2022 or '23 at the earliest right?\n\nEdit: I keep forgetting 2020 is basically almost over.",
            "score": 69,
            "author": "Salmakki",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably later than that, DA4 needs to come out first and it's not scheduled for 2021.",
                    "score": 99,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, it's nice to hear it hasn't been abandoned after Andromeda at least",
                            "score": 13,
                            "author": "CandidEnigma"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'll be shocked if it releases before 2024 tbh",
                    "score": 24,
                    "author": "JackStillAlive"
                },
                {
                    "level": 1,
                    "comment": "2022-2023 honestly feels like when the new dragon age will release, so this feels like something that will happen in 2024 or 2025 at the earliest.",
                    "score": 7,
                    "author": "iceburg77779"
                },
                {
                    "level": 1,
                    "comment": "I would say 2024-2025.",
                    "score": 13,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Mass Effect Legendary Edition will include single-player base content and DLC from Mass Effect, Mass Effect 2, and Mass Effect 3, plus promo weapons, armors, and packs – all remastered and optimized for 4k Ultra HD.\"\n\nThe way it's worded makes it seem that it's not going to include everything. Why not say ALL single player base content and DLC?\n\nIf this compilation doesn't include everything, it's a no-buy for me.",
            "score": 9,
            "author": "Dawg605",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'll wait for the details, but my suspicion is that Pinnacle Station for ME1 will be left aside here. It was notably absent from the PS3 port (area something about the source code being corrupted and lost).\n\nPlus if multiplayer is not included with mass effect 3, it's content dlcs wouldn't be part of it either.",
                    "score": 18,
                    "author": "NuttyFanboy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's definitely it. Pinnacle Station is no big loss, though. It's the only single player DLC I never completed, because it's so bad.",
                            "score": 5,
                            "author": "Steel_Beast"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The fact that there’s no switch version makes me hopeful that they’re putting more effort in this remaster than the NFS and Burnout remasters.",
            "score": 64,
            "author": "areyounuckingfuts",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 49,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "switch should be more than capable of running the ME games",
                            "score": 40,
                            "author": "Nisheee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Mass Effect 3 was on the Wii U after all",
                                    "score": 25,
                                    "author": "krisminime",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So, will this be available on EA Play immediately or ??? The original trilogy is already on there, just curious if this counts as a \"new\" release and will be subject to the 1 yr wait.",
            "score": 19,
            "author": "Comrade_Jacob",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I hope they don't make any changes to the soundtrack though. It was perfect as it was.  Other than that, I'm very excited!",
            "score": 18,
            "author": "BlueKat25",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The big problem with Mass Effect is that they royally tanked their universe with the ending to ME3.\n\nWell, you could set it before the events of the original trilogy, you might say.  Unfortunately, the span of time between humans discovering the Mass Effect relay and the end of ME3 is 29 years.\n\nBecause the ending results in the destruction of the mass effect relays, and possibly the synthesis of organic and mechanical life, trying to set the game after is almost entirely out of the question.",
            "score": 33,
            "author": "IceNein",
            "replies": [
                {
                    "level": 1,
                    "comment": "You could make a pretty decent game about the First Contact War.",
                    "score": 30,
                    "author": "marcthedrifter",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Not if they select a canon ending to build off of. I'm sure they can find a way to deal with the destruction of the relays as well.",
                    "score": 22,
                    "author": "Mikey_MiG",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe, but not in a way that would be as satisfying thematically as not destroying them in the first place.  Mass Relay tech is economically way more advanced technology than the council races posessed.",
                            "score": 12,
                            "author": "IceNein"
                        }
                    ]
                }
            ]
        }
    ]
}