{
    "id": "8gyi4n",
    "score": 5,
    "title": "What buildings should we check out on a potential freshman's visit?",
    "author": "reaper70",
    "date": 1525433199.0,
    "url": "https://www.reddit.com/r/indstate/comments/8gyi4n",
    "media_urls": [],
    "other_urls": [],
    "postText": "My son is leaning toward music education at Indiana State in the fall.  We haven't had any previous campus visits because he's made some very recent changes to his college major that didn't include ISU.\n\nIt doesn't look like there are any general group visits available for Saturday, but we thought we'd drive down and check out the campus anyway since we have a rare, free weekend.  I realize it's late in the semester and finals are next week, but it's also another reason we'd like to visit tomorrow when students are still on campus.\n\nThat said, what are the key/popular buildings you suggest a potential freshman should check out?  Things like popular lecture halls or dorms, student hangouts/unions, etc.  It can be general, but anything specific to a music education major would be a bonus.  He's interested in being a part of the Marching Sycamores as well.\n\nThanks guys, and best of luck to you all on your finals!",
    "comments": [
        {
            "level": 0,
            "comment": "You can check out the Commons and the Library as well as just walk the grounds to get a feel for the campus. Besides that, I'm not sure what else will be accessible. In the Commons building there is an information desk that can probably help you out. \n\nThe Towers (dorms) will have limited access, University Hall is the nicest building where they might take classes. The Science building can be a bit of a maze in the lower levels but is worth checking out. Dreiser has many of the English/Media classes. Root Hall has math classes but is mostly unremarkable. The Quads are at the other end of campus and are a popular housing option for students after their freshman year. They're not nice, but might be worth checking out. \n\nOutside of that, you could explore the neighborhood directly off campus, just don't go too far as the area can get a bit rougher. \n\nEDIT\n\nAlso, I know several people who were in various degrees in the music program at ISU and it seems like a great school for it. ",
            "score": 3,
            "author": "thetushqueen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for your reply!  I saw it before we set foot on campus, so it was helpful in our day.\n\nOne follow-up question:  You mentioned exploring the neighborhoods directly off campus but not to go too far as the area can get a bit \"rougher\".  Just about every city/town has those areas the locals wouldn't suggest venturing into, and being as we're not from the Terre Haute area, this would be good to know.  Can you expand on this a bit?\n\nFor example, we drove east on Wabash Ave. for a few miles (at least out to Memorial Stadium).  While I wouldn't necessarily say what I saw was \"rough\", it did seem as though it might be a poorer part of the city.  But looks can be deceiving, and we made no judgments either way.\n\nDriving south on 41 for a few miles, until the businesses trailed off (I think we might've hit city limits because when I turned around, I saw a welcome to Terre Haute sign), it looked much nicer/cleaner.  It also looked like anything my son would need off-campus could probably be found on 41, and that seemed like the way to go.  Thoughts?\n\nThanks again for the information - it was very helpful!  My son really enjoyed the small feel of the campus (his only frame of reference prior was the sprawling campus of Purdue in West Lafayette, so this was a huge but pleasant change :-)",
                    "score": 1,
                    "author": "reaper70",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As a general rule, avoid north of the tracks at the north edge of campus. There's the University Apartments and a frat house or two, but beyond that it gets pretty rough. There's a cluster of low rent housing between 4th and 6th, after Oak and before Farrrington that isn't very nice, I lived there for a year.\n\nFar south and west are nice areas, if you drove east you probably went past the homeless shelter, or at least what used to be the homeless shelter, there was a fire my senior year, not sure if it's being used again, but that in turn makes that area a little less safe. Realistically they shouldn't have to worry about any of that living on campus, I believe freshman have to live on campus their first year, which I think is a healthy experience. \n\nThe farthest off campus they'd need to go is Walmart and it's not a bad area. Restaurants and other things college kids like and need line 41, so they shouldn't have to stray too far from there. \n\nLet me know if you have anymore questions. \n\nAlso, a lot of people enjoy the small feel of ISU, it definitely makes for a more personal feeling classroom and campus experience. ",
                            "score": 1,
                            "author": "thetushqueen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wow -- thank you so much for the information.  This is very helpful.  I also appreciation the offer to ask more questions, and I do have one:  How safe do you feel the campus is overall (meaning on campus itself and not outside of campus)?  Granted, every place is going to have its bad apples, but to be honest I'd heard more than a few negatives about ISU in this area over the years (everything from \"dumpy\" or \"trashy\" to \"ghetto\").  We didn't get that feeling last weekend when we visited -- the campus was beautiful -- although there weren't many students out and about, as expected for a Saturday and before finals.  Interested in your take on this.",
                                    "score": 1,
                                    "author": "reaper70",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "ISU has some crime, maybe more than a small campus should, but almost every instance I heard of was only a mugging. There was one instance where someone was shot in an argument and one instance where a girl was punched during a mugging, this was over the course of 4 years, so violent crime is pretty rare. Campus overall is safe, but is less so at the edges, you'll never hear about something happening in the center or during the day. I never experienced anything that made me feel unsafe, and the TH police are pretty good at what they do. ",
                                            "score": 2,
                                            "author": "thetushqueen"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}