{
    "id": "pu3zns",
    "score": 3,
    "title": "Do freshmen HAVE to live in dorms?",
    "author": "ottertossx4",
    "date": 1632428995.0,
    "url": "https://www.reddit.com/r/indstate/comments/pu3zns",
    "media_urls": [],
    "other_urls": [],
    "postText": "My daughter is applying to attend ISU next year as an aviation major, but she Really hates the idea of living in a dorm.  How hard is it to get an exemption from living in the dorm for a freshman?",
    "comments": [
        {
            "level": 0,
            "comment": "Honestly I feel like most people don’t live in dorms after their freshman year. Living in a dorm is truly an experience that she should at least try out for a year. Goes by quickly tbh.",
            "score": 3,
            "author": "International-Set956",
            "replies": [
                {
                    "level": 1,
                    "comment": "AMEN!",
                    "score": 2,
                    "author": "SalannB"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I lived in the dorms all four years at ISU...graduation was 36 years ago. I lived to tell the tale. LOL\n\nI encourage living in the dorm for at LEAST the first year, if not more. Your kid probably needs life and coping skills that she'll acquire by living in the dorm. They do a LOT of growing up and have to make their own decisions on things, as opposed to having parents swoop in to rescue them. Not to mention, exposure to different people from different cultures and life experiences.",
            "score": 3,
            "author": "SalannB"
        },
        {
            "level": 0,
            "comment": "I believe there's a commuter exemption for a 5 mile distance from Terre Haute",
            "score": 1,
            "author": "SqueezyYeet",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would rent an apartment for her, but I would not be living in the apartment with her.  Would that be a commuter?",
                    "score": 1,
                    "author": "ottertossx4",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unfortunately nope, has to be a permanent address. Which an apartment could be, but the school knows where the apartment complexes are. \n\n If it's any consolation, our dorms aren't that bad. She'd more than likely be in \"The Towers\", which are the newest and not terrible. Once you're a sophomore by credit hours, you can live off campus",
                            "score": 2,
                            "author": "SqueezyYeet"
                        },
                        {
                            "level": 2,
                            "comment": "My sophomore year roommate who was a freshman got out of it by renting a room at the annex. Her parents lived hours away but she got of it. As long you prove you own/rent a place that isn’t too far from campus I think it should be good.",
                            "score": 1,
                            "author": "Flame24685"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Freshman must live on campus",
            "score": 1,
            "author": "cheesynachoman"
        },
        {
            "level": 0,
            "comment": "How close to campus is your permanent residence? [This page](https://www.indstate.edu/services/commuter) states that, \"*The Residential Life Office allows  exemptions for students to live and commute from their parent or legal guardian's home (within a 60-mile radius of campus). Exemptions must be requested through the student portal.*\"\n\nIt gives instructions on how and where to go to file the exemption. Assuming you fit the bill, you could designate her address as your home's address but then just rent her an apartment somewhere. \n\nGood luck.",
            "score": 1,
            "author": "Elminster_Aumar"
        }
    ]
}