{
    "id": "3dlhzy",
    "score": 2,
    "title": "Canadian looking to see an NCAA football game. Where do I find tickets for Nov 7 game???",
    "author": "chezboy",
    "date": 1437113591.0,
    "url": "https://www.reddit.com/r/butleruniversity/comments/3dlhzy",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am going to be in Indianapolis the weekend of Nov 7 and would love to see a Bulldogs football game.  I can't find any tickets available online.   Do the games sell out incredibly fast or have they just not released all the tickets yet.   If someone could point me in the right direction to find tickets I would appreciate it.     ",
    "comments": [
        {
            "level": 0,
            "comment": "http://www.butlersports.com/information/tickets/fb_tickets\n\nOn the bottom it shows you can order tickets by phone at 1-800-745-3000. It also gives a link for you to order tickets online, but the fact that it links to where you can get butler basketball tickets is only telling of Butler football. You can honestly buy tickets at the gate if you wanted, there is always extra seats. Nov 7th is family day and a rivalry game (doesn't mean much) but I would still call ahead and get tickets through phone if possible.\n\nIf your looking to watch a \"real\" NCAA game, you might have to go to Bloomington (Indiana University), Southbend (Notre Dame), or Lafayette (Purdue) as Butler Football is not D1 but FCS. Butler is by and large a basketball school unfortunately, but at least we can say we have that!\n\nGo dawgs",
            "score": 5,
            "author": "john_the_fisherman"
        },
        {
            "level": 0,
            "comment": "&gt; Do the games sell out incredibly fast\n\nha",
            "score": 4,
            "author": "SalemDrumline2011",
            "replies": [
                {
                    "level": 1,
                    "comment": "PIONEER LEAGUE CHAMPS! ",
                    "score": 1,
                    "author": "mal5305"
                }
            ]
        }
    ]
}