{
    "id": "147pmwa",
    "score": 166,
    "title": "[WP] A royal fairy child was born, and three human godparents were invited to bless the child with gifts. This time, the royal family requested that the godparents be these 'Cowboys' they've heard so much about.",
    "author": "Time_Significance",
    "date": 1686583272.0,
    "url": "https://www.reddit.com/r/WritingPrompts/comments/147pmwa",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n&gt;* [No AI-generated reponses &amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n&gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n&gt;* Responses don't have to fulfill every detail\n&gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&amp;restrict_sr=on&amp;sort=new&amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&amp;restrict_sr=on&amp;sort=new&amp;t=all) for stricter titles\n&gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator",
            "replies": []
        },
        {
            "level": 0,
            "comment": "All clad in white with a deep blue and silver wisps the three strode into the great hall, these men had an air about them of accomplishment, and whisky. \n\nThe group was lead by a quiet, tall but handsome man with fair skin and golden hair. He was flanked on his left by a short dark skinned man with obviously powerful legs. There was no doubt he had spent many long days doing very hard work, no one in the whole royal city had ever seen a body built in such a way. The last man in the group had a smile as wide and bright as imaginable. His hands were the size of the fairy child and as he offered his blessing the child was handled by the most strong but gentle hands that ever were.\n\nAs the 3 stood and donned their helmets with their impressive silhouettes over the child the great silver star on their helmets shown proudly. It was then the Fairy Leader looked over his people bathing in the regality of these Cowboys. \n\nHe addressed his people; \"We gather on this fateful day, to accept the blessing of the 3-time super bowl champions on the future of our kingdom! We thank ye, Troy, we thank ye Emmit, and we thank ye Michael, and what do we have to say to them!?\"\n\n\"HOW BOUT THEM COWBOYS!\" The crowd roared.",
            "score": 1,
            "author": "Thrilling1031"
        },
        {
            "level": 0,
            "comment": "\"Howdy, partner,\" grinned the first of the dusty men to shake King Oberon's hand. \"Mighty fine of ya to invite us. And is this the sweet little princess? Ain't she just the most darlin' peach this side of the Mississippi!\"\n\n\"Everywhere here is beyond the Mississippi,\" remarked Queen Titania, though her small smile showed she appreciated the complement to her daughter all the same, holding her out to the gruff and grizzled leather-faced man to hold.\n\n\"Well, shucks. She'll be a beaut,\" the cowboy said, blinking away a tear that threatened to fall from his sky blue eyes. \"Brought ya something, missy. A present from god-daddy numero uno. This here's a silver six-shooter, and folks say it shoots straighter than moonbeams. Of course, where we come from stories don't mean much, but I bet it'll be real useful to you faerie types.\"\n\n\"Sho nuff!\" said the second cowboy, an old black man with a thick white beard, as he took his turn holding the tiny faerie baby. \"Even back home, stories mean more than ya think. For my part, though, I'm giving you my guitar. My granddaddy taught me on it, bless his soul, and it'll teach you music so sweet it'll make the Devil hisself sit down an shut up, so blue it'll make the skies cry a torrent, an so true ain't no lies can touch ya. Aw, sweet thang, you be good now, y'hear?\"\n\nThe old man passed the baby to the third and final cowboy, a gruff and grizzled bandito in a rough poncho. \"Ay, I don't know how you two can say so much to a baby, she don't know what you saying. But here, chiquita, I give you my lucky hat. I'm retiring anyway,\" he said, putting it on the baby's head. The hat instantly shrank to fit, and the baby giggled, making the bandit blush.\n\n\"Well, thank you all for coming,\" said King Oberon. \"You're welcome to stay for the birthday feast, and-\"\n\nA shot rang out. \"Not so fast,\" said a fourth cowboy in a black top hat. Spurs jangled as he walked over. \"Why, oh why, my dear man,\" he drawled, \"was I not invited to the party?\"",
            "score": 1,
            "author": "FenrisL0k1",
            "replies": [
                {
                    "level": 1,
                    "comment": "The fourth cowboy, in the black hat sauntered over, for the air had gone still and the fae king and queen daren't speak for being inhospitable hosts. The three cowboys formed a wall, standing shoulder to shoulder, figuratively. There was plenty of room for each to make a fast draw, and fingers were twitching near holsters.\n\nA long stream of acrid gunsmoke blew away from the barrel of the revolver that the black hat slowly reholstered. \n\n\"Amigos. Friends. Comrades.\" The brim of the hat covered his eyes, but the smirk among the unshaven whiskers of his rugged face was sin enough.\n\n\"I come bearing no beef, and no fight shall start at my hand. I am here to give the babe a present. A gift. But as I was not invited, I must consider carefully what manner of offering befits this poor reception.\"\n\nThe cowboy pulled back a poncho, and reached into a battered denim vest. A rolled up poster, faintly showing 'WANTED' through the back of the paper was dropped on the ground. A few bullets and a whip followed. A map was also discarded.\n\n\"Seems a thing isn't going to do it, not for someone like you. Well, seems to me that this child is imporant. Should never be overlooked.\"\n\nThe gloved hand of the black hatted cowboy reached to the rim, and lifted the hat to show his eyes, one of which was a socket of flame, burning like a branding iron.\n\n\"Let no town, city, or settlement, ranchholdings or ridings be content to be shared between you and another. They will always be too small for the both of you.\"\n\nThe trio's faces fell, the young one stepping forward, barrel of the Smith and Wessern leveled calmly at the interloper. \"You take that back, you hear, you monster, to curse a baby like that.\"\n\nThe second cowboy shook his head, and turned away. \"You young fool, that trigger won't solve anything. We're in the story now, can't you feel it?\"\n\nThe oldest cowboy smiled wanely, as if pained. \"That wasn't a curse, and it wasn't a gift, and you know what you gave that child and what path you set them upon.\"\n\nThe black hat tipped the brim.\n\n\"I gave the child a weapon. And the path to greatness.\"",
                    "score": 1,
                    "author": "LeVentNoir",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; \"Let no town, city, or settlement, ranchholdings or ridings be content to be shared between you and another. They will always be too small for the both of you.\"\n\nDoes this mean she'll stay single forever?",
                            "score": 1,
                            "author": "Time_Significance",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was going for the \"This town ain't big enough for the both of us\", but the key word is shared.\n\nThe princess can have a lover, a spouse. But the town / city etc won't be shared.",
                                    "score": 1,
                                    "author": "LeVentNoir"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "i love it. only thing, its Smith and Wesson, not western",
                            "score": 1,
                            "author": "Narrow_Atmosphere996"
                        },
                        {
                            "level": 2,
                            "comment": "Love it! There isn't anywhere *near* enough fae westerns, and this has the makings of a great one. If you end up doing more with it, please let us know! :D",
                            "score": 1,
                            "author": "Innominaut"
                        },
                        {
                            "level": 2,
                            "comment": "\"I tip my hat to you, my dear sweet god daughter. From one legend, to another.\"",
                            "score": 1,
                            "author": "eseer1337"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well I'll be, that was some mighty fine cowboy dialogue right there. Those gifts don't be looking too fantastic for the moment, but I bet in the hands of the princess they're gonna be lean, mean killing machines.",
                    "score": 1,
                    "author": "Time_Significance"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The child-sized cowboy hat sat on the table, its embroidered brim all bent and trampled. The little hobby horse, its stuffed head well-worn by years of play, was broken in two. Only the wooden pistol was undamaged. It lay beside the other two gifts, pristine, as if left to make a point.  \n  \nWherever she was now, it said, the princess was defenseless.  \n  \nThe faerie queen looked across the table at the three men she had summoned. Her immortal face was lined with worry and lack of sleep. “She always loved your world,” she said. “We told her time and time again to stay away from the gate. That it led to a place of smoke and iron, were our kind are no longer welcome. But…” she sighed, smiling sadly. “What daughter listens to her parents?”  \n  \nOne of the men looked up from the pile of gifts, meeting the queen’s red-rimmed eyes. “What happened?”  \n  \nThe queen’s hands clenched into fists at her sides. “It was a witch,” she said. “A mortal woman, born of your world, who practices magics long ago forbidden in ours.” Her voice was bitter. “She burst in through the gate in a cloud of black smoke, slaying two bodyguards instantly. By the time we felt her passing, she was already gone. And our daughter was gone with her.”  \n  \nThe second man reached out to touch the crumpled hat, his weathered hands shaking slightly. “She took the girl?” he asked.  \n  \nThe queen nodded, closing her eyes in pain. When they opened again, each man saw the desperate hope that shone there.  \n  \n“We are too old, now, to make the crossing,” she said. “And the world has changed too much. We…” she stopped as her throat caught, silent for a moment as she struggled to hold back the tears. “We have no way to find her,” she said. She met their eyes in turn. “We hoped that you could do what we cannot.”  \n  \nThe third man slowly lifted the small wooden pistol from the table, turning it over in his hands. Then, handling it as carefully as a precious treasure, he tucked it safely into his belt. When he looked at the queen again, his eyes blazed with fury.  \n  \n“We’ll find her, ma’am,” he said. “And god help anyone who stands in our way.”  \n  \nThe three men turned without another word, their spurs ringing as they left the faerie palace. They walked through the crowd of fae folk that had gathered outside, which parted at their passing, leaving a trail of whispers in their wake. Three men from another world. Three men who had sworn an oath, long ago, to watch over the kingdom’s only princess.  \n  \nThree men with murder on their minds.  \n  \nMiles beyond the gate, a young girl struggled against her bonds. She was tied and gagged, slung over the saddle of a black stallion that raced across the desert. Moonlight illuminated the trail of dust churned up by its pounding hooves. Her captor, a woman all in black, whipped the horse into a frenzy as it ran beneath the stars.  \n  \nThe witch rode through the night, her laughter sending shivers through the child tied behind her.  \n  \nBut now, the witch's death rode after.",
            "score": 1,
            "author": "Innominaut"
        }
    ]
}