{
    "id": "148hff0",
    "score": 424,
    "title": "[WP] As it turns out, entropy is considered to be the #1 universal threat by the Galactic Council, and are furious when they learn just how much humans contribute to it on purpose to \"stay warm\"",
    "author": "Mr_Meme_Master",
    "date": 1686668490.0,
    "url": "https://www.reddit.com/r/WritingPrompts/comments/148hff0",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n&gt;* [No AI-generated reponses &amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n&gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n&gt;* Responses don't have to fulfill every detail\n&gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&amp;restrict_sr=on&amp;sort=new&amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&amp;restrict_sr=on&amp;sort=new&amp;t=all) for stricter titles\n&gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator",
            "replies": []
        },
        {
            "level": 0,
            "comment": "“This is ridiculous.” Head Chair Konk said. “To stay warm, you simply vasoconstrict your extremities, increase your heart rate, and climb into your mama’s pouch.”\n\nKonk motioned to the pouches that the women of the Gongroos sported on their bellies.\n\nThe audience grumbled their agreement.\n\n“Yes.” Ginok, Monk’s mother, said. “And in doing so, the entropy of the universe is only very slightly increased, due to disorder introduced in the cells of the pouch.”\n\nThe human ambassador’s eyes lingered on Ginok’s pouch too long, his mouth twisted down and to the left.\n\n“Right.” The human tapped his desk. “Right, well, uh, we humans do not have… pouches, as you call them. We warn ourselves via blankets, or the sun, or heating machines.”\n\nThe audience grumbled angrily.\n\n“Nonsense!” Konk said. “You’re simply a male, young human. Surely, your mother has a pouch that you crawled into when you were a little tyke. You must remember the soft sticky warmth of caccooning inside your mama.”\n\nThe human’s face grew a slightly green shade.\n\n“No.” He said in clipped tone. “Our females do not have a pouch. We need clothes, or air conditioning. Our most base method is the same as yours: we constrict or dilate our blood vessels to exchange heat with the environment. But, that method only works to a point. If I were to try to exchange my heat in an environment hotter than me, well obviously that wouldn’t be possible. It would be the other way around, and I would gain heat.”\n\n“Stop with this boring sciencey talk.” Konk said. “Look, you need to experience it yourself, then you can provide the necessary knowledge to the humans. Come, man, hop in a pouch.”\n\nThe human blinked.\n\n“That’s not necessary.” He said.\n\n“I insist!” Konk said. Several women extended their pouches.\n\n“Really, I’m fine.” The human said.\n\n“Really, I insist.” Konk said, motioning for the man to advance.\n\nFinally, peer pressure won. The human approached.\n\nHis pinstriped suit entered a deep shade of blue. It exited a yellowish color, dripping goo.",
            "score": 1,
            "author": "JohnIsWithYou",
            "replies": [
                {
                    "level": 1,
                    "comment": "Continue! So good",
                    "score": 1,
                    "author": "Nickelplatsch"
                },
                {
                    "level": 1,
                    "comment": "Hah, i was in your moms pouch... get rekt.",
                    "score": 1,
                    "author": "warmachine237"
                },
                {
                    "level": 1,
                    "comment": "You momma's pouch so big she can heat an entire human!",
                    "score": 1,
                    "author": "EonicParasite"
                },
                {
                    "level": 1,
                    "comment": "This is pretty funny",
                    "score": 1,
                    "author": "Acceptable_Visual_79"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Prime Minister Cha'hv looked at the human delegate as he entered the Rostrum. The Rostrum served as a primary debate space for the galactic council and was more of an annex to the primary council chamber in order to isolate people during particularly volatile matters of galactic security.\n\nCha'hv took a sip of Verothian Nectar, the sweet fluid coated his proboscis and helped to comfort him. He took a final review of the papyrus, made couple of notes with his stylus, and ran some figures on the slide-rule while the human waited patiently.\n\n\"Would you like something to drink Mr...\"\n\n\"ah yes.\"  picking up a queue to finally say anything, \"Yes, My name is Sir M.C. Culwich Bustsmore, President of Earth and keeper of the sacred Sword Caliburn, and hit rapper with over 20 platinum singles.\"\n\n\"and yet none of that rhymed...\"\n\nUndeterred, \"I find I'm more effective if I focus on one job at a time, sorry to disappoint a fan. Water qould be great.\"\n\nThe Prime minister glared. or maybe not, but his dome like segmented eyes gave that impression, somehow.\n\nSir M.C. Culwich Bustsmore kept his composure, he was completely aware that representatives from over 700 systems across the galaxy were all watching in real time, each scrutinizing everything with teams of interpreters, body language experts, Preists, astrologers and Living Tarots, hegemonic councils, Insurance agents, bookies, lawyers. Any combination of the above give or take.\n\n\"Ill skip right to the chase here, you are aware of the concept of 'entrophic heat death?'\"\n\n\"Yes, that was the focus of my research for my forth album, *Cold. Dead. Universe*. It received many accolades from the scientific community and I received an honorary doctorate in Neo-quantum integrated Physics from the Institute for intergalactic research and theoretical analysis. I also like to think the production quality was quite inspired, thanks to my team of researchers.\"\n\n\"We understand that your sun is dying. and that rather than reach out to the council for assistance, you took matters into your own hands.\"\n\n\"Actually my team did reach out, I have the logs...\"\n\nCha'hv interrupted now, \"...and decided to alter the fabric of space-time in order to resist relocating your paltry little population?\"\n\nSir Bustsmore stood waiting. Making sure Cha'hv was actually finished. He centered himself in order to not sigh with exasperation.\n\n\"...and what is it that you believe we *did* to Space-time?\"\n\n\"All of our scientists agree that you have affected the Higgs-Boson and dark matter coefficients across the galaxy!\"\n\n\"...We have.\"\n\nFlabbersgasted, Cha'hv's Nostril Fronds flared and produced mucus. his chest flagella shook in excitement. to his credit he said nothing.\n\n\"In order to add solar mass to our sun, we had to modify the galactic Higgs-Boson/dark matter coefficients with the output from a converged mutithreaded photonic particle stimulation inverter, we not only saved our suns but slowed the progress of galactic expansion by a rather infinitesimal amount. while saving our star doesn't solve the whole problem, I believe there are 45 more systems in need of assistance of this type in the next 100 years, and more beyond that. eventually everyone will want and need their home worlds saved. the throughput on this project will actually stop galactic expansion, barring some unforeseeable consequence. We are monitoring the situation. \"\n\nHe picked up the Prime Minster's notes, then grabbed the quill. \"Lambda and the Planck constant... did you even listen to my album?\"\n\n\"My interns did.\"\n\n\"Well, maybe if you paid your people a living wage, they could afford to put in the effort.\" and with that, Sir M.C. Culwich Bustsmore turned, nodded to and accepted his water from the unpaid intern and walked out like the badass he was.",
            "score": 1,
            "author": "CelestialTerror",
            "replies": [
                {
                    "level": 1,
                    "comment": "And now I really want to hear some of his music...",
                    "score": 1,
                    "author": "ChefAtRandom",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unfortunately, his lyrics would be way above my head. Though I imagine something like Aesop Rock rapping about futuristic Stephen Hawking level academic writing.",
                            "score": 1,
                            "author": "CelestialTerror"
                        }
                    ]
                }
            ]
        }
    ]
}