{
    "id": "148ipo2",
    "score": 1914,
    "title": "[SP] \"Soldier, how the hell did you manage to take 9,999 captives?\" \"No idea, sir. They all just surrendered after I killed the first guy.\"",
    "author": "SpookieSkelly",
    "date": 1686671980.0,
    "url": "https://www.reddit.com/r/WritingPrompts/comments/148ipo2",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n&gt;* [No AI-generated reponses &amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n&gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n&gt;* Responses don't have to fulfill every detail\n&gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&amp;restrict_sr=on&amp;sort=new&amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&amp;restrict_sr=on&amp;sort=new&amp;t=all) for stricter titles\n&gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator",
            "replies": []
        },
        {
            "level": 0,
            "comment": "\"Soldier, how the hell did you manage to take 9,999 captives?\" The General questions me, clearly a cunt's hair width away from losing his shit. \n\n\"Sir, No idea, sir. They all just surrendered after I killed the first guy. Sir.\" I state clearly. Internally I am pleading with my sphincter to hang on long enough to get through this meeting.  Nobody ever wants to get called into the General's office, ever. \n\n\"WHAT DO YOU MEAN AFTER YOU KILLED THE FIRST GUY\" The General screams, finally losing the thin hold of his temper. \"It was a fucking peace mission soldier. A simple 'Howdy fucking do you do' contact mission.  The next thing I hear is that some pea-brained Private has 9,999 alien soldiers on their knees.\" \n\nI have to keep from flinching as spit flies in my direction.  It's not the worst dressing down I have ever had, but this is by far the worst person I could get one from. Trying to maintain my composure I start to explain.\n\n\"Sir, we were just talking and the guy, he, made a joke\" I said\n\n\"ANNND\" The General growls, waving his hands in that 'hurry the fuck up with it' motion. \n\n\"Sir, I had just taken a really big drink of water and the joke was funny, so I spit out the water...on to his face. Sir\" I say with hesitation.  The General stares at me, insisting I continue. \"After that, everything happened really quickly.  Sir, the guy....well sir, he um, he melted, sir.  Like the wicked witch of the west, but without the commentary, sir.\"\n\n\"Everyone just stopped talking and looked at me, then looked at the puddle, and then just, knelt down sir.\"  I was not going to try and explain to the General that I am almost positive I just pulled a Riddick and apparently get to \"keep what I kill.\" I was not ready for that conversation at all.  I could hear the gasps through the crowd.  I also picked up through my translator \"Death Breather\" and \"Water Dragon\".  The rest of the group kneeled, yes, but they knelt towards me, not in \"I surrender\" kind of way.    \n\n\nWe didn't really know anything about this race before we landed.  We knew that it was basically a desert planet, that it was hot as fuck, and that the people were fierce fighters, but generally peaceful.  We didn't know anything about their culture or biology.  We defiantly didn't know that water was fatal to them.    \n\n\nI am not sure what will happen next.  The group is insistent that they only go with me and a few of the soldier's got a good beating trying to lock them away in rooms.  So here I am, standing in front of a fuming General, trying to figure out what do to with my new army.",
            "score": 1,
            "author": "genuine_risk1"
        },
        {
            "level": 0,
            "comment": "&amp;#x200B;\n\n\"Private! That is unprecedented skill! What the hell did you do?!\" Shouted the Sargent.\n\n\"Sir! Sargent, SIR! I told them they were on the side of the bad guys! This one guy came forward- Looked like a leader! He spoke some of the language and got in my face! He made an L on his forehead and they laughed! I didn't think it was very funny, SIR!\"\n\nSargent turned felt the wind on his cheek, cherry blossoms were flowing behind him. He had a mysterious look in his eyes, \"And you killed him for that?\"\n\n\"No sir!\"\n\n\"How'd you kill him then, PRIVATE?\" Sarge was boiled red like a beet. He wanted to know NOW.\n\n\"Well you see sir, it hurt my feelings.\" Stated the soldier.\n\n\"DID IT HURT YOUR FEELINGS, PRIVATE?!\" Spit was frothing from his mouth, he looked enraged like a tiger.\n\n\"IT DID SIR! I'm not a loser! I make my bed every morning and make call and do drills and my platoon is really proud of me! He was wrong, SIR!\"\n\n\"So you killed him for being WRONG?\" Bellowed Sarge. He looked as big as a whale and as a red a crab. \"IS THAT WHAT YOU DID?\"\n\n\"NO SIR!\" Reported the Soldier, again.\n\nSarge grabbed the soldier by collar, \"YOU WILL TELL ME WHAT YOU DID THAT GAVE US AN INCREDIBLE ADVANTAGE ON THIS WAR FRONT SO WE CAN CELEBRATE YOUR HEROISM. DO YOU UNDERSTAND ME, SOLDIER?\"\n\nThe Solider's face was wet now with not only blood, but spit and sweat that was not from himself.\n\nThe Soldier stood at attention and hunched his shoulders forward and down. His skin began to rip apart at his spine and what came barging out from his chest cavity was a drunk old man holding a small, frightened freshman.\n\n\"BURP...BELCH...Ah-uh-eh I don't believe \\*BURP\\*-the US Army is equipped to neutralize a  threat like a Gasslemorph invasion so, so, so I killed your guy. Yep, he's dead. It was aliens. Your war is over. There's no \\*HACCK\\* uh, what is it you guys want? Oil? Sorry boss, there's no oil here. Just-just terrorist aliens trying to invade the planet.\"\n\n\"Oh, oh God Rick. You c-You can't say that to-to-to the Military. They, they've got bombs rick.\" Morty was sweating bullets.\n\n\"YOU KILLED PRIVATE PATTERSON AND THERE'S A SECRET AN ALIEN INVASION?\"\n\n\"Wow, can't get- \\*URP\\* much past this guy. Yeah \\*URP\\* you're welcome. Your cannon fodder was as useless as, as a plastic knife. Haha. He also had some not PC friendly tweets from back in the day that would not age well...You're welcome for giving you a REASON to go back home to your cheating-on-you-for-sure wife and stranger-to-you-child that you will DEFINETLY traumatize. \"\n\n\"RICK! You can't- You got to- yo-yee- you gotta be nicer! Yihh-Yuhh- You killed a guy! And you stereotyped military families. Th-that's rough, Rick.\"\n\n\"Shut up, Morty. This is why I'm not giving you vocal codes for avatars anymore. I \\*BLEGH\\* I could have finished this little chat up and we could be looking at Glorpglipplort boobs right now, Morty. They have 6 nipples that all are shaped like boobs! Nipple Boobs, Morty. But Noooooo Morty wants to do a Morty American Tail.\"\n\n&amp;#x200B;\n\nThat's all I got, someone take it from here!",
            "score": 1,
            "author": "Shpilkismalilkiss",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Sargent\n\n\\*Sergeant",
                    "score": 1,
                    "author": "shadowrun456"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Soldier, how the hell did you manage to take 9,999 captives?\"  \n\"No idea, sir. They all just surrendered after I killed the first guy.\"  \nScott sighed. \"Do you have ANY clue how suspicious that sounds?\"  \nThe base rocked.  \n\"What was that, sir?\" Said Tom.  \nThey could hear a distant \"Heeh...\" in the direction of where the captives were. Another shake, and they heard \"Charge!\" before it.  \nThey both remained silent. Tom grabbed his gun.  \nAnd Scott radio'd the team.  \n\"Go check the cells,\" Scott said. \"Might be a breach.\"  \nPerhaps they should have used better materials? Picked a lower gravity planet so it'd be harder for captives to charge?  \nCRASH.  \nThat was all they heard at that moment. A deafening crash, and the sound of alarms.",
            "score": 1,
            "author": "FarlandersOffABit"
        },
        {
            "level": 0,
            "comment": "What have I done?\n\nWe are soldiers of the Greal Dominance. Ours is not to ask why. We are ordered to fight, and so we fight. My family line extends for centuries. All my ancestors were warriors. All fought the same enemy. \n\nThe Wiggan Tribes.\n\nThey were a fierce people. A warrior race. Men, women, children. All would fight. All would die, and we assumed it was for glory. \n\nWe were wrong.\n\nI grew up on the stories of the fabled heroes from our nations history, fighting impossible odds. Losing entire garrisons to the foul fire magic of the enemy, and rallying to smite the enemy and force their retreat. The fire mages of the Wiggan were the Boogeymen of our children. When I was promoted, and earned myself higher clearance to intelligence reports, I found out there was more truth than fiction to that assertion.\n\nOur ancestors had unknowingly settled on the sacred lands of the Wiggan. There was a meeting between the leaders of the time to discuss a path to coexistence. The Wiggan leader became enraged that they would dare to build on his holy land, and set fire to the entire village. We had been at war ever since, but recently something had changed.\n\nThey were closing in on us. \n\nThe largest Wiggan army ever assembled. Berserkers, spearmen, pyromancers and archers. 10,000 battle hardened born warriors, and they were coming to erase us and cleanse their sacred lands once and for all. For the first time in my life, I disobeyed a direct order.\n\nI did not lie to my men.\n\nMany fled, and I did not report them. Many wept, and I did not blame them. Many looked at the cloud of ash growing on the horizon with a grim sense of duty, and I did not fear. I couldn't. My men needed me to be strong. My people needed time to evacuate. \n\nSo I chose to buy that time with my own life.\n\nI ordered the men that remained at our outpost to hold their position, no matter what happened. I rode out to meet the advancing army.\n\nAlone.\n\nWhen I arrived, at the front of their line was the strangest looking man I had ever seen. His eyes were golden and his hair was black, but it seemed to shimmer with an almost blue glow. He lacked the stringy builds of his people; he was muscular, and looked clean despite what must have been a long journey. This was all very strange, but he accepted my bargain nonetheless.\n\nA duel.\n\nA proving to show that his army was worthy of facing my men. Him and I. To the death. I took my eyes off him for only a moment when I dismounted, but found him standing beside me as my feet hit the ground. He was three heads taller than I, and wielded a great longsword. \n\nI drew out the fight as long as I could, but I could tell he was toying with me. His people cheered him on, laughing as he dodged my every attack. *\"Fidra! Fidra!\"* they cheered. He was arrogant. Deliberately sloppy, even. I realized that this was his weakness. I goaded him into a foolish attack and to my surprise, he took it. By the time he realized his mistake, my sword was lodged in his ribcage, rending his heart in two.\n\nAs I walked 9,999 prisoners back to my outpost, I asked who Fidra was. \"Fidra was not his name, defiler,\" the man said. \"It is our word for 'God.'\"\n\nWhat have I done?",
            "score": 1,
            "author": "jpb103",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the narrator just killed the god emperor of mankind.",
                    "score": 1,
                    "author": "Lrundblad",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Heretic!",
                            "score": 1,
                            "author": "dman2316"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That was cool",
                    "score": 1,
                    "author": "Real_Bug"
                },
                {
                    "level": 1,
                    "comment": "There’s a song called “The General” by Dispatch. The first half of this story were in line with that song’s story…the back half not so much haha",
                    "score": 1,
                    "author": "Dudley_Do_Wrong"
                },
                {
                    "level": 1,
                    "comment": "This was a great read!",
                    "score": 1,
                    "author": "LG_tech"
                },
                {
                    "level": 1,
                    "comment": "THAT was an AWESOME story!!",
                    "score": 1,
                    "author": "Imaginary_Estate3969"
                },
                {
                    "level": 1,
                    "comment": "Cool.",
                    "score": 1,
                    "author": "MrRedoot55"
                },
                {
                    "level": 1,
                    "comment": "Their god is dead. Long live god. (I hope he is up to the task. The poor bastard)",
                    "score": 1,
                    "author": "MechisX"
                },
                {
                    "level": 1,
                    "comment": "I upvoted the second I read 'Alone'. So cool how it was so powerful and so short at the same time. Also is that Goku???",
                    "score": 1,
                    "author": "WhiteNight2505"
                },
                {
                    "level": 1,
                    "comment": "\"What have I done?\"",
                    "score": 1,
                    "author": "Sorcererstone458"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Well, you see, it was a bit of an odd mistake, really, sir.\"\n\nThe commander of the King's Companion Guard stared at the novice mage in front of him. Almost twice the young man's age and with infinitely more combat and tactical experience, Garreth readily did not believe the man, and yet...\n\n\"Tell me what happened; from the beginning.\"\n\n\"Well, you see, sir, I had woken up this morning and wanted to see something.\" The mage paused, waiting for a response. A steel grey eyed stare was all he received, he gulped, \"I had this idea about what would happen if you stacked tablets together in a single space and activated them all at once.\"\n\n\"Tablets?\" The grumbled question came.\n\n\"Oh, yes sir, uh, the magical rune tablets that we inscribe our spells on for later use. I have only seen one tablet get used at a time so I had a theory about what would happen if you triggered more of them at once.\"\n\n\"I am aware of what you meant to test.\" Garreth said evenly, \"Now, how did you capture almost an entire regiment's worth of men?\"\n\n\"So, I had decided that I was going to do my experiment with a Spark spell, one that only produces a small flame or light, much like what you would give a child on a midsummer festival night. However, I didn't realize my error in my haste and because I wasn't completely awake at the time.\"\n\n\"And that issue was?\"\n\n\"Well, you see, I mis-inscribed the phrasing for 'Spark into 'Storm' and, well...\" the mage looked down at his feet nervously.\n\nGarreth took a deep breath, \"Just how many of these... tablets, did you inscribe?\"\n\n\"Fif... fifteen, sir.\" A squeeked reply.\n\n\"And, how many did you use at once?\"\n\n\"Fifteen, sir.\"\n\n\"So, to encapsulate everything that happened, you triggered 15 inscribed spell tablets at the same time, all stacked upon one another... and completely and utterly incinerated the king of our enemy who was about to lead an ambush upon our encampment in the process.\" Garreth was gripping the bridge of his nose tightly and had his eyes shut. He could feel the drum beat in his temple growing steadily.\n\n\"Yes... sir. That's about it, I guess.\"\n\n\"You are to speak about this to no one, mage, until you are cleared by my authority alone. I will send for you when I have made my report.\"\n\nThe mage bowed quickly \"Yes sir, good morning to you, sir.\" He shuffled quickly out of the command tent, leaving the commander alone to his thoughts. There was a moment of silence before he sat back in his chair, arms limp at his sides, head tilted back and eyes still tightly shut.\n\n\"The king is never going to believe me...\"",
            "score": 1,
            "author": "DKSpocky"
        },
        {
            "level": 0,
            "comment": "“What kinda horrors did you inflict on this man to bring an entire battalion to its knees!” The general said horrified.\n\n“Well you see it’s just getting into spring, and all the allergens in the air…”\n\n“Spit it out private!”\n\n“I sneezed.”\n\n“You sneezed.” The general repeated exasperated.\n\n“I mean I didn’t really kill him, I just sneezed, and the guy fell over clutching his heart. They all laughed for a minute until the medic came up and said he died. They were all quiet then. I mean… I guess I looked quite terrifying killing a man with a sneeze, but I really didn’t do anything.”\n\nAnother soldier came up to the general whispered into his ear. The general looked grim and nodded a few times throughout her report. She talked without expression giving no clues to what she was saying but eventually she stopped, saluted and walked out.\n\n“I appreciate your honesty private.” The general started. “Reports came in telling me that the deceased had a long history of heart problems and the event that occurred today was unlikely, but not implausible. Through complete dumb luck, you have achieved the greatest victory we’ve ever seen. As such you’ll get medals and ceremonies. Be proud of yourself private your allergies may have saved the world.”\n\n“But I didn’t do anything!”\n\n“You did everything.” The general said, “Some soldiers have strength, or brains, or pinpoint accuracy. But none of them could have done what you did. I never believed in luck until you came in, against insurmountable odds, and won. And that was before I found out how you did it. By their very nature, the qualities you possess are incredibly, incredibly, rare. You can’t train it into someone or teach it, or buy it into equipment. It’s just something that happens. And you found it in yourself to use it when it mattered. And for that I applaud you. Congratulations Private. Take the victory and leave with it.”\n\n“Thank you sir I don’t know what to say except…” The private trailed off puzzled.\n\n“Yes private.”\n\n“Leave with it sir? I want to keep fighting. You said it yourself I have rare gifts that will help.”\n\n“You do indeed. However your allergies have also disqualified you further service and you will soon be honorably discharged.” The general responded. “Get back to your barracks, you are dismissed.”\n\nAs the private walked away, the general waved over his second in command. “Get him out of this war before he gets killed.” \n\n“What are you thinking. Bone spurs… Maybe a bad liver?” \n\n“Allergies.”\n\n“We’ve never tried that one before.” \n\n“It’ll work. They know what we’re doing and they’ll let it happen. Luck runs out as long as there is a bullet hole in the bucket. Take away the bullets and he’ll be alright. Let him win and we all win.”\n\n“Lucky guy.” She concluded.\n\n“Lucky guy.” The general agreed.",
            "score": 1,
            "author": "Ok_Leadership2606",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t get the ending. Or the whole bucket and bullets and thing. Other than that pretty enjoyable read actually.",
                    "score": 1,
                    "author": "Stays_Up_Late",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The private is LUCKY, all capitals.  Think maxed luck in fallout + plot armor.  \nThe general is savvy enough to recognize if they keep the private in the war... well, the luck may turn on them to keep the private safe.\n\nSee Bink of the Xanth series (early books), or the anime The Irresponsible Captain Taylor  for what happens with such forces.\n\n&gt;!Yes, I know Bink's power isn't luck, but it sure does masquerade as luck, coincidence, and so on enough times...!&lt;",
                            "score": 1,
                            "author": "bimbo_robyn"
                        },
                        {
                            "level": 2,
                            "comment": "I think it’s saying that the private got so incredibly lucky that the general doesn’t wanna test that, you keep getting shot at, probabilities suggest you are gonna take a bullet, bullets kill. So the general saves his life with a bullshit allergy excuse so the guy can keep living. Maybe if you wanna go deeper if the guy stays alive and is living in the country, with his luck they will still win the war and he doesn’t even have to fight.",
                            "score": 1,
                            "author": "KaiZaChieFff"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Good job.",
                    "score": 1,
                    "author": "MrRedoot55"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Report, squire.\"  \n  \n\"Well, um. Sir. I was... I was just out, you know. Digging a new hole for the, um. You know, the, uh...\"  \n  \n\"Latrine. I'm aware of the task you were *given*, squire. Continue.\"  \n  \n\"Right. Okay, um. Sorry. Yes, sir, um, Lord Commander, sir. I just - so I was out that way, and I... well, I couldn't find any good dirt, you know? Wait, sorry, um, you're the Lord Commander, how would you-\"  \n  \n\"Hard to dig a latrine for your entire detachment through roots like those in this forest.\"  \n  \n\"... Right, yeah, that's it. So, it's all roots around our camp, far as I could see, so I went, um... *that* way, and... I guess I went further than I thought, 'cause all of a sudden I was out in the tall grass, sir, um-\"  \n  \n\"Squire, you have established that I am, in fact, both the Lord Commander *and* someone you should call 'sir'. I appreciate you trying to maintain decorum in these... unexpected circumstances. Now *stop saying sir* and *report*.\"  \n  \n\"Right, s-. Um. So I'm out in the grass, which is, you know. Bad. Very bad. The tall grass is where - uh...\"  \n  \n\"The tall grass is where we *what*, squire?\"  \n  \n\"Where we go to...\" *gulp* \"...die, sir.\"  \n  \n\"I see. You seem to have proven that assessment incorrect, squire.\"  \n  \n\"Well, I... um. I was - I mean, it's *tall grass*, sir. Taller than I am, at least right there. And I was... kinda... turned around, so I started knocking some of the grass down, and I came across... um... well, a raiding party, sir. Kind of a big one, and the guy in front, well, he was the biggest damn - um-\"  \n  \n\"Squire, there comes a point where decorum becomes tiresome. You are nearing it.\"  \n  \n\"Right. Um. He was a big fucker, sir. Biggest one of those guys I've ever seen. Head taller than me, at least. I mean, he could see over the grass, and here I am knocking it down just to find the trees, you know? And there he is, out of nowhere. Startled me so bad I damn near didn't need to dig the latrine anymore, and I just... freaked out, and hit him with my shovel.\"  \n  \n\"You hit him with your shovel.\"  \n  \n\"Well... um... yeah, okay. I hit him a bunch. Like... I don't know. Twenty or thirty times, at least. I knocked his axe away after the, um... third swing, I guess? And then just, you know. Kept going until he quit moving.\"  \n  \n\"With your shovel.\"  \n  \n\"Well... yeah? I mean, I wasn't gonna go for the axe, and I don't even *own* a sword, but I'm a farmer, sir, and my family raises cows. I've been shoveling shit since before I can remember. I killed my first barn snake with my father's shovel when I was six, so, um. Yeah, I hit him with the shovel. Edge, flat, handle, the whole thing, until it broke, and then a couple more times with the busted handle.\"  \n  \n\"And then what?\"  \n  \n\"Then the second biggest guy said something to me. My, uh... grasp of their language ain't great, sir, but I did catch the words 'rabbit' and, um. 'Wolf', I think, or maybe 'wolves'. And then he offered me his axe.\"  \n  \n\"You aren't *carrying* an axe, squire.\"  \n  \n\"Have you *seen* those fucking axes? I could use the damn things to shovel *snow* if it wasn't for all those stupid curves and such. No, sir. I told him that if he wanted to hand it over, then I would bring him to where he could give it to one of the knights. And he followed, and they all came up out of the grass like new carrots and followed, all carrying on about rabbits and wolves and such, and then... they all... surrendered. Sir.\"  \n  \n\"Which one was it? That you spoke to?\"  \n  \n\"Um... That one, there.\"  \n  \n\"Aide, bring that man here. Make sure he's unarmed.\"  \n  \n...  \n  \n\"I am the Lord Commander of these men. What is your name?\" \n   \n\"Merin, of Padal's line.\"  \n  \n\"Did you surrender to... this young man?\"  \n  \n\"Of course. I'm not stupid.\"  \n  \n\"Why do you say that?\"  \n  \n\"He's barely grown. Not one of your horsemen, or even wearing armor. A camp follower, or maybe some kind of apprentice. No warrior.\"  \n  \n\"I... do not understand.\"  \n  \n\"Your army flies the banner of the Wolf, but this boy... He is no wolf. He is a *rabbit*, and a young one at that. And after what he did... fighting like a madman, killing one of our mightiest with a *tool*, and then leading us to your camp without even bothering to disarm us. Unconcerned about the many thousands of axes at his back, as though we are no greater threat to him than the corpse he left behind. If *this* is what your *rabbits* look like, we would be fools to face your *wolves*.\"",
            "score": 1,
            "author": "thepush",
            "replies": [
                {
                    "level": 1,
                    "comment": "I really enjoyed this! Having had to give a report about some wild shit to a commander, and tripping all over titles in attempt to be proper- I found the banter quite fun!",
                    "score": 1,
                    "author": "Docsm",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I loved the idea of the commander getting tired of it and granting permission to speak freely - and then the f-bombs start in the next sentence 😁",
                            "score": 1,
                            "author": "thepush"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is my favourite one so far. Great job!",
                    "score": 1,
                    "author": "SpookieSkelly",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Seconded.",
                            "score": 1,
                            "author": "c4golem",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "thirded",
                                    "score": 1,
                                    "author": "fluorozebra",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Fourthed\n\nIs that a thing?",
                                            "score": 1,
                                            "author": "DrVoid7"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thank you so much 😀",
                            "score": 1,
                            "author": "thepush"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\"I've been shoveling shit since before I can remember\" - epic freak'n sentence, and a great story!",
                    "score": 1,
                    "author": "IlijaRolovic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also accurate. Such is farm life and I remember being 8 or 9 and shovelling shit, among other livestock chores.",
                            "score": 1,
                            "author": "magnum_hunter",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I had a very brief job at a local \"farm\" (quotations because while it was a farm, it was a \"performance art\" farm, we had like 3-5 schools visiting each weak to learn about farms or just for fun at the end of the year) and my duties involved shoveling shit, feeding animals, shoveling shit, joining larger classes to keep an eye on the kids, shoveling shit, collecting eggs, shoveling shit, let kids play with the bunnies, and shoveling shit, and if i had some time between jobs, there was always some extra shit that could use a shoveling.",
                                    "score": 1,
                                    "author": "Shileka",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"There was always some extra shit that could use a shoveling\"\n\nNo truer words have ever been spoken.",
                                            "score": 1,
                                            "author": "thegamenerd"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Hehehehe, I'm glad you liked it 😊",
                            "score": 1,
                            "author": "thepush"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I like this one a lot.",
                    "score": 1,
                    "author": "Thelmara",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you, I appreciate it 😁",
                            "score": 1,
                            "author": "thepush"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This was amazing!!",
                    "score": 1,
                    "author": "Mabunnie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you 😁",
                            "score": 1,
                            "author": "thepush"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I LOVE this take on it! Heck yeah, farmers will fuck some shit up! &lt;3",
                    "score": 1,
                    "author": "Fyrebarde",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Based on all the farmers I've ever known... yep 😁 Thank you!",
                            "score": 1,
                            "author": "thepush"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I love this!! It’s reminds me of watership down in just the way they talk and the characters. Really cute!",
                    "score": 1,
                    "author": "that_onequeitkid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you 😊",
                            "score": 1,
                            "author": "thepush"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I hope a richer person than me comes along and gives you an award for this.",
                    "score": 1,
                    "author": "Sir_E_L_Bawks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Aw, thanks 😊 but this comment is just as appreciated, believe me",
                            "score": 1,
                            "author": "thepush"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;Startled me so bad I damn near didn't need to dig the latrine anymore, and I just... freaked out, and hit him with my shovel.\"\n  \nThat made me laugh. It was funny and cute. Lol.",
                    "score": 1,
                    "author": "ElegantInspector7633",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you 😁",
                            "score": 1,
                            "author": "thepush"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;\"Your army flies the banner of the Wolf, but this boy... He is no wolf. He is a rabbit, and a young one at that. And after what he did... fighting like a madman, killing one of our mightiest with a tool, and then leading us to your camp without even bothering to disarm us. Unconcerned about the many thousands of axes at his back, as though we are no greater threat to him than the corpse he left behind. If this is what your rabbits look like, we would be fools to face your wolves.\"\n\nOnly thing I have to say is push this up, somehow, before the poor kid is interrogated. To give him some substance. Otherwise, regardless of any changes, I love it.",
                    "score": 1,
                    "author": "purduephotog",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd mention the wolf banner flapping overhead right at the start and that should do it.",
                            "score": 1,
                            "author": "PM_ME_UR_SYLLOGISMS",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's a good idea.",
                                    "score": 1,
                                    "author": "thepush"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Even a cornered rat (or rabbit) is nothing to be messed with. \n\nOn deaths ground? Fight Harder.",
                    "score": 1,
                    "author": "MechisX",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That was the sentiment that started the whole idea in my head :)",
                            "score": 1,
                            "author": "thepush"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Love it!",
                    "score": 1,
                    "author": "Flint312",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you 😁",
                            "score": 1,
                            "author": "thepush"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This was basically the idea I had (squatting and entrenching tool) but you did it wat better than I could have.  Good stuff, man.",
                    "score": 1,
                    "author": "irmajerk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you 😁",
                            "score": 1,
                            "author": "thepush"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "“It was pretty easy actually, would you like to hear?”\n“That’s good soldier, but maybe another ti-“\n“It was me and John, John Lewick that would be. We somehow made it to the front deck of the AYYS Putsch, (John is a smooth fellow you see) and planned to talk reasons with the captain. John’s idea, not mine. He always believed in the good of people”\n“Believed? Is solider John Lewick dead? You have to report that to the-“\n“Shhhhhhh- I’m not done. Well you see, when we finally made it to the captain’s office door (lots of convincing this took) John almost gave it all away by saying “death to the fascists” aloud. What a dim wit! So there was a moment we both were plenty scared as the captain opened the door just as it was said. \n“What was that about?” He mumbled.\n“Sorry sir?” Said John \n“I was listening to the radio- what may you need?”\n“Sir” John salutes and I followed.\n“We are part of the USL Gariner, sir, and ask for your permission to halt attacks”\n“To halt? Hardly. You say you’re from the Gariner, very brave to make it to our ship”\n“Thank you sir, may we come into your office?”\n“This is not how typical business is conducted, do you have a letter?”\n“No sir no letter”\n“A package?”\n“No sir”\n“A death sentence? We could kill you right here if we wanted”\n“……no sir”\n“Men, put them back on whatever they came on”\n“No please! We’re here to reason!”\n“I’m not in the mood for games”\n“Sir let me say a few words”\n“Stop fighting my men or we will use force” \n“But sir!” He then pushed out of the other soldier’s arms, scaring the guards, one pulled out a gun. I hold out my arms, as if to grab the guard, but stand still.\n“Please put the gun down I come only with my hands”\n“Only if you pose no threat, now please calm down”\n“Let me just-“\n“Fire!”\nAnd the gun plants into his chest before I can act. I stare at him, in shock, and without a second thought I pull out my own gun and shoot them both down. I don’t really remember what happened after that, I may have blacked out. But when I woke up the ship was in our hands. I don’t want to know what happened, to be honest. Best leave it”\nI finally look up and realize the general left\n“Where’d he go?”\n“Oh he left when you hushed him to go report that John passed away. But incredible story! How  much was made up?”\n“Haha! I’d rather not say. Is there any bread left on the dinner tray?”",
            "score": 1,
            "author": "that_onequeitkid",
            "replies": [
                {
                    "level": 1,
                    "comment": "[Paragraphs help a lot for reading comprehension, my dude.]\n\n“It was pretty easy actually, would you like to hear?” \n\n“That’s good soldier, but maybe another ti-“ \n\n“It was me and John, John Lewick that would be. We somehow made it to the front deck of the AYYS Putsch, (John is a smooth fellow you see) and planned to talk reasons with the captain. John’s idea, not mine. He always believed in the good of people”\n\n“Believed? Is solider John Lewick dead? You have to report that to the-“ \n\n“Shhhhhhh- I’m not done. Well you see, when we finally made it to the captain’s office door (lots of convincing this took) John almost gave it all away by saying “death to the fascists” aloud.\n\nWhat a dim wit!\n\nSo there was a moment we both were plenty scared as the captain opened the door just as it was said. \n\n“What was that about?” He mumbled. \n\n“Sorry sir?” Said John \n“I was listening to the radio- what may you need?” \n\n“Sir” John salutes and I followed. \n\n“We are part of the USL Gariner, sir, and ask for your permission to halt attacks” \n\n“To halt? Hardly. You say you’re from the Gariner, very brave to make it to our ship” \n\n“Thank you sir, may we come into your office?” \n\n“This is not how typical business is conducted, do you have a letter?” \n\n“No sir no letter” \n\n“A package?” \n\n“No sir” \n\n“A death sentence? We could kill you right here if we wanted” \n\n“……no sir” \n\n“Men, put them back on whatever they came on” \n\n“No please! We’re here to reason!” \n\n“I’m not in the mood for games” \n\n“Sir let me say a few words” \n\n“Stop fighting my men or we will use force” \n\n“But sir!” \n\nHe then pushed out of the other soldier’s arms, scaring the guards, one pulled out a gun. I hold out my arms, as if to grab the guard, but stand still. \n\n“Please put the gun down I come only with my hands” \n\n“Only if you pose no threat, now please calm down” \n\n“Let me just-“ \n\n“Fire!” \n\nAnd the gun plants into his chest before I can act. I stare at him, in shock, and without a second thought I pull out my own gun and shoot them both down. I don’t really remember what happened after that, I may have blacked out. But when I woke up the ship was in our hands. I don’t want to know what happened, to be honest. Best leave it” \n\nI finally look up and realize the general left \n\n“Where’d he go?” \n\n“Oh he left when you hushed him to go report that John passed away. But incredible story! How  much was made up?”\n“Haha! I’d rather not say. Is there any bread left on the dinner tray?”",
                    "score": 1,
                    "author": "GhostfaceKiliz"
                },
                {
                    "level": 1,
                    "comment": "This may be the hardest to follow thing I've ever seen on here",
                    "score": 1,
                    "author": "Ok-Yoghurt-9976"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i rode into battle, my robes waving through the wind like a flag.\n\nupon reaching the frontlines, my horse would stop, spooked by what lay ahead.\n\nten thousand men, dwarfing our squad of only a few hundred.\n\nthey laughed, they laughed hard. \"they send a magician?\" one said. \"what are you doing to do? pull a rabbit out of your hat?\"\n\ni knew i only had one chance to prove them wrong, so i did the only thing i could.\n\ni pointed to one of the men and recited my incantation. everybody saw as the life faded from his eyes and his skin went pale, falling dead onto the ground.\n\n\"and so they all just gave up?\"\n\n\"yeah. pretty much\"\n\n\"i didn't know you were such a powerful mage\"\n\n\"i'm not, that was my only spell slot\"",
            "score": 1,
            "author": "foxstarfivelol",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is why it's always a good idea to max out Charisma.",
                    "score": 1,
                    "author": "SpookieSkelly",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*\\*Laughs in Sorcerer\\**\n\n*\\*Cries in Warlock\\**",
                            "score": 1,
                            "author": "SuperSmutAlt64",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "**laughs in Sorlock**",
                                    "score": 1,
                                    "author": "CptAndy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "*\\*Laughs in Eldritch SMG\\**",
                                            "score": 1,
                                            "author": "SuperSmutAlt64",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Precisely",
                                                    "score": 1,
                                                    "author": "CptAndy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Now duck tape agonizing blast, faerie fire, and an ever-smoking bottle (courtesy of the mildly-felonious artificer) to your character sheet and make your DM cry as you SWAT some goblins into the far realm",
                                                            "score": 1,
                                                            "author": "SuperSmutAlt64"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Pulled the guys heart out of his hat :)",
                    "score": 1,
                    "author": "MechisX"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Soldier, how the hell did you manage to take 9,999 captives?\" \n\n\"No idea, sir. They all just surrendered after I killed the first Drig.\"\n\nHe couldn't believe it himself really, their kind had fought the Drig for countless cycles, and win or lose the Drig did not surrender.\nSo he waited till the lone human walked away and approached one of the lost looking Drigs and pulled her from the chain gang heading to the detention center. Humans were a near extinct race, they had nearly lost their world to the Drig, it was why they had enlisted their aide against this insectile menace, they knew the humans could help, but they needed to know the secret should they need to prevail against their ally should the humans ever turn foe.\n\nHe grabbed the warrior and slapped a translator collar on her.\n\"What did he do?\"\n\nThe translator communicated the clicks and pops of the creatures mandibles.\n\"It is not what he did, it is, what he is...\"\nShe hissed and pointed to the three other humans also coming back with similar groups of prisoners now.\n\"Human, they are, but not just any human. That is a Canuk.\"\n\nHe frowned.\n\"Translate that, what is a Canuk?\"\n\nShe hissed again, but after a begrudged glare at the group of humans hung her head.\n\"In the north of the human world we met defeat like none other. We had heard the threat was those in their largest areas, attacked in mass, and devoured them as we fought. But, when we attacked the north, it was hell. They crept out from the coldest nights as we hibernated, and slew whole hives to the last. No amount of pleading stopped the engaged Canuk from their warpath, and in the end it was all we could do to hold our own. Nothing stopped them once they became enraged. Till we had lost. And when they rebuilt, all the world was nurtured back to life in the ways of the Canuk, Peace Keepers.\"\nShe spit on the ground.\n\"We told the, to not resist, for we would win.\" She shivered visibly, \"They simply said, Hold my beer.\"",
            "score": 1,
            "author": "TrevorFCoelho",
            "replies": [
                {
                    "level": 1,
                    "comment": "Pray they don't unleash the geese.",
                    "score": 1,
                    "author": "--redacted--",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't worry.  Even WE aren't sure what would happen then.  We'll send the moose first.",
                            "score": 1,
                            "author": "MHarbourgirl"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Considering how polite most Canadians are you have to consider what the flip side of that is when they finally lose it. \n\nRUN!",
                    "score": 1,
                    "author": "MechisX"
                },
                {
                    "level": 1,
                    "comment": "People always think us Canadians as pacifist. We restrain ourselves to protect others. Don't give a reason to let slip our dogs of war.....",
                    "score": 1,
                    "author": "Spektral1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You mean the geese of war",
                            "score": 1,
                            "author": "FogeltheVogel"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "omg canadians are so nice, I hope that people do not enrage them because they will \"slew whole hives to the last\"",
                    "score": 1,
                    "author": "Sorcererstone458"
                },
                {
                    "level": 1,
                    "comment": "That Canuk is channeling his inner Leo Major.",
                    "score": 1,
                    "author": "NinjaMoose_13"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Well go ahead and recap your story, and maybe we can figure out how the hell you managed to bring all these combatants in.\", said the General as he confusedly looked at the entire company that is on thier knees around him. \"So there I was, scouting out the encampment as requested, and spotted a huge stash of munitions. Enough that could easily be acquired and brought back for our own use. So I slipped in. Once I was say... 100 yards from the stash, I overheard some of those guys arguing about something. Something about eating a hat and how the place isn't secure.\" The soldier continued to ramble on for about another hour, bits about a port-o-john being flipped and a part about a jeep being turned on its nose being an act of god. \n\nThe general pursed his lips, confused, and none of it all making sense. At the moment, he looks over at the soldiers hands, and sees some small burns. \"What the hell happened to your wrists soldier, you've got injuries!\" The soldier gives pause, and goes, \"Oh yeah! They found me and took me prisoner, but that didn't last long. They tried to have me listen to that damn closing bit from... Barney I think? I beat that dude to death with the stereo there with the music playing at full blast. These guys all said something about \"purple wrath\" and just froze up.\" \n\nThe general, now entirely confused, concerned... and absolutely befuddled, stares at him with the most perplexed look. \"You're telling me, that these guys were terrified of you beating someone to death with a stereo blasting \"I love you, you love me\"? In all my years I've never heard something so absurd.\" At that moment the stereo somehow kicked on, for just a moment, and fear washed over the entire crowd. The general, in absolute exasperation and utter confusion, just sighs, \"I need a damn drink... get back to base and get the motor boys out here, we've got work to do.\"",
            "score": 1,
            "author": "Peakomegaflare",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love the absurdity, well done.",
                    "score": 1,
                    "author": "Treereme",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Appreciate it! I'm more of free-verse/surrealist poetry guy, however the pure chance of absurdity was too much to ignore.",
                            "score": 1,
                            "author": "Peakomegaflare"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;\"purple wrath\"\n\nThis is a thing. \n\nYou do not play this song.\n\nYou do not speak the purple ones name.\n\nSummoning the purple one by saying its name and singing it's song will mean the death of you all.",
                    "score": 1,
                    "author": "MechisX"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Garreth, is it?\" the General asked the young soldier before him.\n\n\"Yes, general,\" he replied. He was tired; too tired for a lengthy interrogation, but it was to be expected. The general observed his expression and manner, and offered a slight smile.\n\n\"Please,\" the General pointed to a nearby chair, \"sit. You must be exhausted.\"\n\nGarreth looked at the General with an uneasy look; for a common rank soldier to sit next to a decorated general was unacceptable. Still, he thought - it would likely be a greater offence if he didn't obey. He fell into the comfortable chair and felt every muscle in his body ache as he did.\n\n\"So,\" the General continued as he poured two cups of wine, \"I've been told you've just returned from the Arbor patrol.\"\n\n\"Yes, general. I did.\"\n\n\"Ambushed?\"\n\nThe soldier nodded.\n\n\"I'm sorry to hear that,\" the General said, handing the young man the wine.\n\n\"They were good soldiers, General. Friends, too,\" Garreth said solemnly and took a sip.\n\n\"But then,\" the General continued and sat in his own chair, \"I'm told the ambushing force... surrendered?\"\n\n\"Yes, sir, they did.\"\n\n\"All of them?\" the General squinted incredulously.\n\n\"No, sir. I killed one. The one that approached me first.\"\n\n\"Let me get this straight, Garreth,\" the General said, finally saying the man's name, \"your entire patrol - that's 60 men - was ambushed by a,\" he looked at a nearby piece of parchment, \"*thousand* enemy soldiers and not only did you alone survive, but then, by killing just one of their soldiers, forced them to surrender?\"\n\n\"Not entirely, General.\"\n\n\"Well?\" the General asked impatiently.\n\n\"I didn't entirely survive, sir. The first soldier, the one I killed, ran me through.\"\n\nThe General stared daggers at the soldier. \"Is this a *joke*, boy?\"\n\n\"Of course not, sir,\" Garreth said hastily. \"No, he approached me from behind like the rest of us and stabbed me through the chest with his sword,\" he explained and lifted his tunic, revealing a large, fresh scar in the middle of his chest.\n\n\"How...\" the General gasped.\n\n\"And when I got back up,\" Garreth continued casually as he put his tunic back down, \"I killed him in retaliation. The rest of his squadron then just... surrendered, sir. I'm not sure why - I expected at least a couple more of them to try and fight. I suppose the sword in my chest must've intimidated them.\"\n\n\"*It was still in your chest?*\" the General leaned forward.\n\n\"Yes, sir. It was a bit of a struggle. He tried to choke me and I tried to do the same. I'm... ashamed to say rage took over me and I'm... not terribly sure what happened in the next few seconds, but when I regained my composure, I was holding half of his head. I apologize for such barbaric conduct. I then removed the sword in my chest and prepared for the rest to fight me, but they simply... surrendered.\"\n\n\"You...\" the General started but found himself unable to finish the words. He was a veteran of a hundred campaigns and stared death in the face a hundred times more, but for the first time in what felt like an eternity, he was... afraid. Afraid of a young man sitting in front of him, sipping wine. Worst of all, as he carefully looked the boy up and down, he felt *off*. Like something about the soldier was inherently wrong. His mouth was perhaps just *slightly* too large. He shuddered.\n\n\"Who *are* you?\" the General said softly.\n\n\"Garreth, sir. Private, first Division.\"\n\n\"No, I- *what* are you?\" the General insisted.\n\n\"I am truly sorry, General,\" Garreth replied calmly, \"but I cannot tell you that.\"\n\n\"You can. I... I'm sure I'll understand,\" the General said with attempted compassion.\n\n\"No, sir, it's that- I've told people before and it never ended well for them. I had hoped being a soldier would help with the cold, lack of purpose, the... *the hunger*, but it didn't. I- I don't think I want to keep being a soldier after today. It brings out the worst in me. I'm sorry.\"\n\nThe soldier stood up and put down the now empty cup. He saluted and turned to leave the General's tent.\n\n\"Stop!\" the General yelled. \"We can still make use of you. You can't just *leave*!\"\n\n\"Respectfully, General,\" Garreth said and looked back at the General, his eyes shimmering in the half-light,\n\n\"...who's going to stop me?\"",
            "score": 1,
            "author": "SirPiecemaker",
            "replies": [
                {
                    "level": 1,
                    "comment": "Garreth ain't duckin around, this my favorite",
                    "score": 1,
                    "author": "JSL520"
                },
                {
                    "level": 1,
                    "comment": "DAMN. I really enjoyed reading this one. Dialogue is great, characterization is great, all of it's great. Well done!",
                    "score": 1,
                    "author": "drislands",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you kindly! I wasn't terribly sure about it to be honest.",
                            "score": 1,
                            "author": "SirPiecemaker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nah, it was fantastic. This is one of those prompts that could totally be developed into a great story but does equally well remaining as is",
                                    "score": 1,
                                    "author": "StubbornKindness"
                                },
                                {
                                    "level": 3,
                                    "comment": "I accidentally clicked off this page while reading your story, and normally I just say fuck it and move on, but I had to finish it. When I came back, I had to search for it just to read the last 2 paragraphs. It was well done.",
                                    "score": 1,
                                    "author": "lidsville76",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The last ten lines are the best part, too! Is it an ending? Or a beginning? Very well done.",
                                            "score": 1,
                                            "author": "glowinghands"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That's quite the praise! Thank you, glad you liked it. If you'd like, there's more on my personal sub, some of which I'd say are a fair bit better.",
                                            "score": 1,
                                            "author": "SirPiecemaker"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;\"Not entirely, General.\"\n\n&gt;\"Well?\" the General asked impatiently.\n\n&gt;\"I didn't entirely survive, sir.\n\nI was NOT ready for that twist hahahahaha. Well done!!!",
                    "score": 1,
                    "author": "khalasss"
                },
                {
                    "level": 1,
                    "comment": "Giving me Hancock in jail vibes. Like really...handcuffs? a fence? walls? really?",
                    "score": 1,
                    "author": "Vroomped"
                },
                {
                    "level": 1,
                    "comment": "Reminds me of that /r/thathappened story where the guy says his nickname in the army was Blackout because he said he will suddenly black out and kill people with a knife",
                    "score": 1,
                    "author": "TomMado"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Private! What the hell did you do?!?!\"\n\n\"Sir, nothing Sir!\"\n\n\"Bullshit!  What did you do?!?!?  What in god's name is that smell?!?!?!\"\n\n\"Sir, I um... I may have inadvertently committed a war crime....\"\n\n\"Private!??!  What in THE HELL DID YOU DO!?!??!?!?!\"\n\n\"Sir, I was uh... I was looking for a place to take a shit, Sir!  My stomach was upset from the MREs, and trying the Jalapeno Cheese Spread didn't clog me up like I thought it would.  So, instead of making a mess in the porta potties, I decided to go out and do some biological warfare of my own.  I went out into the woods, found a place with bushes and tall grass, dropped trouser and let er rip.....\n\nI'm sitting there, starting to feel better.. when the next thing I know, I hear someone screaming like they were on fire, literally.... and up pops the biggest guy I've ever seen... screaming his head off like a little girl with shit running down his face...\n\nHe's yelling and clawing at his face frantically trying get the shit off and out of his eyes and mouth.. when suddenly he stops, looks down at me, mumbles something then drops dead at my feet.   The next thing I know, I've got an army popping up with their hands in the air and surrendering.\"\n\n\"Private!   You mean to tell me that you took out the infamous enemy commander and caused the ENTIRE enemy force to surrender with nothing more than a case of the shits from Jalapeno Cheese Spread?!?!?!?!\"\n\n\"Sir!  Yes Sir!\"\n\n\"Well, my my... good work Private.  Good work indeed..   Damn, you smell like shit!  Go get cleaned up and then go to medical to get looked at.   Dismissed!\"\n\n\"Sir!\"",
            "score": 1,
            "author": "TaskMaster881",
            "replies": [
                {
                    "level": 1,
                    "comment": "As funny as this is, I really wish I hadn't read it right as I was about to eat my chocolate cake.",
                    "score": 1,
                    "author": "SpookieSkelly"
                }
            ]
        }
    ]
}