{
    "id": "148v8h6",
    "score": 143,
    "title": "[WP] It's July 20th, 1969. The Apollo 11 mission is a success, and the three astronauts touch down on the moon. \"That's one small step for a man, one giant leap for man-- wait, is that an American flag?\"",
    "author": "Formeraxe",
    "date": 1686706697.0,
    "url": "https://www.reddit.com/r/WritingPrompts/comments/148v8h6",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n&gt;* [No AI-generated reponses &amp;#129302;](https://www.reddit.com/r/WritingPrompts/comments/zi452b/modpost_reminder_that_aigenerated_responses_are/)\n&gt;* Stories 100 words+. Poems 30+ but include \"[Poem]\"\n&gt;* Responses don't have to fulfill every detail\n&gt;* [\\[RF\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Reality+Fiction%22&amp;restrict_sr=on&amp;sort=new&amp;t=all) and [\\[SP\\]](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A%22Simple+Prompt%22&amp;restrict_sr=on&amp;sort=new&amp;t=all) for stricter titles\n&gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n&amp;#128226; [Genres](https://www.reddit.com/r/WritingPrompts/w/directory) \n&amp;#127381; [New Here?](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) \n&amp;#9999; [Writing Help?](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) \n&amp;#128172; [Discord](https://discord.gg/writingprompts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator",
            "replies": []
        },
        {
            "level": 0,
            "comment": "“Buzz, somethings wrong here.” Neil stared at the American flag.\n\nIt was red, white, and blue, and it was moving as if there was air flowing by. He counted the stripes. 13 stripes, normal. Blue square in the corner. Fifty stars. Yet he couldn’t stop the shiver that passed through him. \n\nAfter what felt like forever, Buzz joined him. \n\n“That’s wrong. It shouldn’t be moving, and there’s too many stars.” Buzz whispered. \n\n“There’s fifty.”\n\n“Count them.”\n\n“You’re right. Where did the five new stars come from?”\n\n“Puerto Rico could be one. They were considering state hood.” \n\n“You both are wrong.”\n\n“Buzz, please tell me you heard that.”\n\n“I did. It sounded male. I don’t see anyone around though.”\n\n“This isn’t your timeline.”\n\n“Um…”\n\n“Your timeline is splintered.”\n\n“Neil, I think I just wet myself.”\n\n“You can never return to your timeline. The Fossa Luminance is closed.”\n\n“BUZZ! SOMETHING MOVED OVER THERE, AND I SWEAR ITS NOT A SHADOW!”\n\n“Yep, definitely wet myself.”\n\n“BUZZ!” \n\n“I see it too. Run?”\n\n“I CAN’T MOVE!”\n\n\n\n“NEIL! WAKE UP!”\n\nNeil bolted awake, heart pounding. It was just a dream. He took a calm breath and suited up. The airlock opened, and he and Buzz stepped outside. \n\nNeil suddenly froze. Up ahead, the American flag waved.",
            "score": 1,
            "author": "Catqueen25"
        },
        {
            "level": 0,
            "comment": "\"Buzz! Come and see this. Why didn't NASA tell us about this?\" \n\n\"What? Collins, take a picture of the flag and send back to base...Collins? I have a bad feeling about this. \" \n\n\"The Lunar module is gone! Collins, where are you?\" \n\n\"...\" \n\n\"...\" \n\n\"Please man don't toy with us...\" \n\n\"Neil, I think we were deceived.\" \n\n\"What do you mean?\" \n\n\"I believe this has never been the mission.\"\n\n\"What?! This is insane! We trained years for this. We spent years competing againts the communists. This was all about showing the potential of America. How can all of this be fake? You telling me the war, the space race is fake?\" \n\n\"No, but some of it. Neil, I'm sorry. I haven't been honest with you.\" \n\n\"What are you hiding?\" \n\n\"Back on Earth, during our breaks. I overheard something. In that moment, I didn't think it was a real concern. Our superiors were talking about how the Soviets had developed the necessary tech to send humanity to the moon. It was just a matter of time for them to get here. They were going to win the race. Weeks after, I heard vague rumors of a secret project. A programmed lunar module, sent here without the risks and difficulties of bringing people in the flesh. This module probably planted evidences, hence the flag, so when the commies broadcast their arrival for the entire world, they would only find the humiliation of being defeated.\" \n\n\"But...but we actually won the race. We arrived first.\" \n\n\"I was counting on that. it seems they left us here.\" \n\n\"Why?!\" \n\n\"Our sacrifice will go down in history. America needs heroes.\" \n\n\"We are no martyrs, no heroes! They left us to die!\"\n\n\"We won't be alive to tell them anyway...\"",
            "score": 1,
            "author": "LukkeMDL"
        }
    ]
}