{
    "id": "7rb6uj",
    "score": 19969,
    "title": "[WP] Death is just a predator much higher on the food chain than we are, and our perception of it is as limited as an ant's perception of a child with a magnifying glass.",
    "author": "CaspianX2",
    "date": 1516295542.0,
    "url": "https://www.reddit.com/r/WritingPrompts/comments/7rb6uj",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "**Off-Topic Discussion**: All top-level comments must be a story or poem. Reply here for other comments.\n\n#####Reminder for Writers and Readers:\n* Prompts are meant to inspire new writing.  Responses don't have to fulfill every detail.\n\n* Please remember to [be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback.\n\n---\n\n[](#icon-help)[^(What Is This?)](https://www.reddit.com/r/WritingPrompts/wiki/off_topic)\n[](#icon-information)[^(First Time Here?)](https://www.reddit.com/r/WritingPrompts/wiki/user_guide)\n[](#icon-exclamation)[^(Special Announcements)](https://www.reddit.com/r/WritingPrompts/wiki/announcements)\n[](#icon-comments)[^(Click For Our Chatrooms)](https://www.reddit.com/r/WritingPrompts/wiki/chat)\n",
            "score": 1,
            "author": "WritingPromptsRobot",
            "replies": []
        },
        {
            "level": 0,
            "comment": "*Wow, well isn't this quite something?*\n\nYou blink, as if you can't quite believe what you're hearing. \n\n*Yes, yes, you're not imagining it. I'm, \"speaking\" to you I suppose is how you would understand it*\n\n\"B...but,\" you say out loud and a couple of the other specimens stare to look at you in confusion. \n\n*Now, now. There is no need to speak out loud. I will be able to hear your thoughts. Your kind comes along so rarely, I would hate for you to get taken in to some prison and electrified*\n\n\"Electrocuted actually,\" you say, this time in your head. Then you shake your head, as if you can't believe what you just \"said.\" \"Wait...I...you...\"\n\n*Use your words, now*\n\nMy mocking tone momentarily angers you, clearing your thoughts. \"Who, no, *what* are you?\" you say, again, in your head.   \n\n*Ah but you know already, don't you? You were just thinking about it*\n\nYou blink and frown. \"I was thinking about....something.\" Your frown deepens. \"I know what I was thinking about, I am thinking about it right now, and when I do, everything sort of goes blurry and I feel like I'm watching myself in third person...but I couldn't tell you what exactly I'm thinking about...\" \n\n*Precisely!* \n\nMy sudden excitement makes you jerk. Sometimes I forget how sensitive you folk you are. \n\n*Apologies for that, quite rude of me. But regardless, what you're feeling, there is no way to describe it in your language. Your language is bound inherently by the three dimensions, by a limited scope, which is all most of your kind is capable of seeing.*\n\n\"Limited scope?\" you retort, \"what sort of bullshit is that?\" You're angry, understandably; after all, I've just insulted your species.\n\n*You know full well what I mean. Look around yourself, your fellow people, this...transport that you're in. What do you see?*\n\nYour eyes widen, and you look around, your head jerking from left to right, up and down, out the windows, *beyond* the windows. You are like a child who has just been born into a new world. In a sense, you are exactly that. Then you look at me. There is no three dimensional direction, you just *perceive* me. You open your mouth to speak. \n\n*Stop. You will just confuse yourself by speaking in that tongue of yours. You now know what I say to be true. You no longer just see, you* ***perceive.***\n\n\"But...\" you stammer, \"I'm no philosopher! I'm just a guy bored on my commute to work. I was just thinking pointlessly about stuff!\"\n\n*Throughout history, there have been very few who've crossed the barriers you have, and in an objective sense, they are the most capable of your species. Yet not a single one makes it in your history books. To arrive at this thinking, you cannot be thinking with a purpose, the very nature of Ascending to this thought is to stumble upon it.* \n\nYou give this a moment of thought, then nod, agreeing. Then your frown deepens. I know what you're about to ask.\n\n*Yes quite right. There really is no point to it all. And no, you will never be happy going back to your life.*\n\nYou do not protest, you are well past such silly things. You know it to be true. Instead you set your jaw. \"I will undo it all then, forget all of it. I just want my life back!\"\n\n*Which is exactly what everyone else who's made the discovery has, said, your species or otherwise. They all say the same exact thing within moments of first Ascending.*\n\n\"Has anyone done it?\" you ask, and for the first time fear creeps into your voice.\n\n*I've been trying for as long as time existed. No avail.*\n\n\"Then....\" Again, like clockwork, I know what you're going to say. \n\n*You'll kill yourself?*\n\n\"You think I won't?\" you say, again that anger rising. It's funny how even after Ascending, certain traits still remain common. \n\n*Oh you will try, we both know, but you know too that nothing will happen. You are now the same thing I am, Death itself. You will wander like I do, like a handful of others do, throughout time and space, killing as needed, breeding as necessary. Giving them the release you wish you could achieve. I believe your kind calls it artificial selection.*\n\nAt first you're sickened, aftereffects of the old reality. But then you speak, and your voice is calm. \"To find someone capable of Ascending beyond us,\" you say. \n\n*Precisely. Only they will put an end to our suffering.*\n\nEveryone else has left the transport, but you're still sitting where you were, looking the same, but fundamentally changed, likely forever. You look around, trying to get one last glimpse of the world that was once yours, but its too late. You can no longer see it as it once was. For you, it is already gone. \n\n*For what it's worth, I'm sorry* ",
            "score": 4960,
            "author": "XcessiveSmash",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think this is the only story in second person I have ever read",
                    "score": 145,
                    "author": "thegoldengamer123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've read a few and this is by far one of the best. Reading poorly written second person is literally headache inducing. ",
                            "score": 26,
                            "author": "SyariKaise",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I'm not used to second person. This story took a bit to get used to tbh but it was amazing",
                                    "score": 8,
                                    "author": "genghiskanye_"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Large portions of [the Fifth Season] (https://www.goodreads.com/book/show/19161852-the-fifth-season) were written in second person, present tense. It was pretty neat.\n\nThere's also [You'll Surely Drown Here If You Stay] (https://uncannymagazine.com/article/youll-surely-drown-stay/), a short story by Alyssa Wong. I'll be honest and say that I really didn't understand that one, but it seemed kind of cool and it's freely available online so you should check it out. ",
                            "score": 5,
                            "author": "SirJefferE"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Some stories really just need to stand on their own, hence why I put my usual postscript in this separate comment. This story is unlike anything I've written. Kind of existentialist, vague, and in second person. Would love to hear your thoughts and any critiques you might have. \nIf you enjoyed, check out [XcessiveWriting](https://www.reddit.com/r/XcessiveWriting/) ",
                    "score": 1347,
                    "author": "XcessiveSmash",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's almost HP Lovecraftian. I absolutely love it. I wonder if death was messing with  the man to turn them into a serial killer for his entertainment or death's motives were exactly what he said they were\n\nEdit: just wanted to add I like how he focused more on developing the characters and then exploring how they interact when they come together rather than having and endpoint that you were trying to reach with your writing.",
                            "score": 373,
                            "author": "TheLastOne0001",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I wish I could write. That was pretty brilliant to be honest. ",
                                    "score": 84,
                                    "author": "applesauceyes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Maybe you just need some help on how to flesh out your ideas and put them together. [This could be of interest to you](https://www.amazon.com/Writing-10th-Anniversary-Memoir-Craft/dp/1439156816)",
                                            "score": 50,
                                            "author": "TheLastOne0001",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 31,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm pretty sure he's just a knock-off Steve McQueen, the book probably isn't worth the paper it's written on.",
                                                            "score": 9,
                                                            "author": "MarcelRED147"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "We can all write, mate. Read my stuff when I just started. Like, I'm not great by an means now, but when I started geez I was straight awful. The trick is to write, improve, and write more. \n\nHope if anything, my story will inspire you to give writing a shot :)",
                                            "score": 33,
                                            "author": "XcessiveSmash"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You just did. Why you lyin' like that? ",
                                            "score": 16,
                                            "author": "DavidG993"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Wait, he turned him into a serial killer ? When I've read it the first time I assumed he somehow manage to became aware to the higher dimensional being, dying in the process. And at the end he realizes he became one of them and their only motivation is to \"awake\" other humans as well, in the hopes that some will be able to achieve a higher level of consciousness than them. ",
                                    "score": 8,
                                    "author": "blueugly",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Interpret it however you like - it's fairly open ended",
                                            "score": 8,
                                            "author": "XcessiveSmash"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Thank you for the kind words, especially the edit, that is exactly what I was going for. ",
                                    "score": 7,
                                    "author": "XcessiveSmash"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I actually really love this, great writing!\nI had to read a few things more than once to fully understand what was being conveyed, but I think that's a good thing.",
                            "score": 113,
                            "author": "Steveis3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you! I do think I could've been a bit clearer at certain points. I hope you didn't find the rereading frustrating.",
                                    "score": 14,
                                    "author": "XcessiveSmash",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It might just be a personal preference but i felt the editorial vagueness came across as more a first person level of bewilderness of a new and strange situation then as lapses in perspective and nuance. Im not usually one to cheer on vagueness because it usually feels lazy, but here i think id be disapointed if it was more straightforward. Excellent job and thank you.",
                                            "score": 18,
                                            "author": "alargeobject"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yo, I'm stealing this for my DND campaign. \n\nJust though I'd let you know.",
                            "score": 40,
                            "author": "thetitan555",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Man, I am so jealous of your players right now.  Be sure to post a full account over at r/DND when the campaign is finished!",
                                    "score": 19,
                                    "author": "IAMAHobbitAMA",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So the Reverberating Valleys tells the story of how man profited off of a bunch of creepypasta-esque phenomena and the space bats taxed love stories. You should look on r/DNDgreentext more than anything else, and not anytime soon. I'm still making the map. It's in the Western Marches style (Google it). I use a lot of 'freaky things' from obscure sources, mostly Sunless Sea/Fallen London, with a bit of OC sprinkled in for good measure.",
                                            "score": 11,
                                            "author": "thetitan555"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Cool, glad you enjoyed it! I've never played DnD, but I hope you have fun!",
                                    "score": 6,
                                    "author": "XcessiveSmash"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This kind of existential dread in writing is something I really love, I don't know if it's a part of 'horror' or is it something else entirely? I don't know but I really enjoyed it. Did you have any sources of inspiration you drew on writing this up? Have you written anything else like it? I'm always on the prowl for writing about this kind of stuff and would love to read some more.",
                            "score": 19,
                            "author": "SirLlamaTheGrad",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Existential horror, psychological horror, transcendentalism",
                                    "score": 5,
                                    "author": "kanuut",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Truth, undiluted existential truths, they hold a worse and longer lasting hold because humans are an adaptive element and we use what view is productive. If you can break the line of normal thinking you not just go against you own nature but potentially against any series of thought processes that keep you alive/able to procreate. \n\n\nSpecifically imagine learning a single fact that had the power to remove you from the gene pool or out right leed to your death.\n\n\nThats “horror” but purified till its not something you can create on demand, it must always be found on accident.  ",
                                            "score": 5,
                                            "author": "alargeobject"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I usually don't but recently I've been experimenting. Check out [Clarise Fae and the Hole](https://www.reddit.com/r/XcessiveWriting/comments/7q8434/myth_clarise_fae_and_the_hole/) that I wrote very recently for another \"horror\" kind of story. I have a couple others if you're interested, but mostly I write character driven first person stories.  \n\nGlad you enjoyed the story!",
                                    "score": 5,
                                    "author": "XcessiveSmash"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This story has most of the plot in common with a story written by Isaac Asimov. It's named 'The Last Answer'. Your story also bears some similarities to a novel by Asimov called 'The Gods Themselves' in which immature beings ascend to a greater understanding and breed and control other immatures.\n\nSo basically nice work in making something thought provoking similar to the grandmasters. Also you might want to check out that short story because you would probably enjoy it.",
                            "score": 15,
                            "author": "FordEngineerman",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You're the third person to mention *The Last Answer* - I'm reading it as we speak!",
                                    "score": 6,
                                    "author": "XcessiveSmash",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "How'd you like it?",
                                            "score": 2,
                                            "author": "8122692240_TEXT_ONLY"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The second perdon mode was hard to grasp for me. But it fits totally into the story of ''something'' talking into your head. I had to read some parts a few times because i was confused if the ''you'' was talking about me or the main character. \n\nWeird and original but fitting.",
                            "score": 13,
                            "author": "Spikrit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I wrote it and I think it's weird, but I'm glad it fit at least. \n\nThanks for the feedback!",
                                    "score": 1,
                                    "author": "XcessiveSmash"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I loved it. No prologue, no epilogue, and all the information the reader needs is nicely paced. Throughout, I would read so much more of this, but I love it exactly the way it is now.",
                            "score": 11,
                            "author": "GaelanStarfire",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That second line of yours really struck me, I don't really know why. Like I want more of this, but any more of it would only make it worse. \n\nRegardless, glad you enjoyed, and thank you for reading. ",
                                    "score": 7,
                                    "author": "XcessiveSmash",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Loved it! Felt very similar to some darker  dreams/trips I've had... and the story was just vague enough to let me imagine some details... :)\nI also really liked that the entity was able read the character's mind. Thanks for sharing!\n\n10/10, would become death again.",
                            "score": 7,
                            "author": "Jampasta",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you for reading!",
                                    "score": 2,
                                    "author": "XcessiveSmash"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This was beautifully crafted. Few people can seem to comprehend the idea of writing outside first or third person. Can I ask one thing though? Do the beings of death have a physical body that can be seen? I am curious on whether the man will become known as something like Jack the ripper, or if he is slowly changing entirely.",
                            "score": 7,
                            "author": "AGulliblesloth",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hmm, I feel like this world would have jack the ripper be someone in the process of ascending.\n\nHe never got caught because he grew more Powerful than any mortal force could hope to match, and we still haven't caught him because he used that power to erase himself from our 3 dimensions",
                                    "score": 6,
                                    "author": "kanuut"
                                },
                                {
                                    "level": 3,
                                    "comment": "It was the first time I tried anything but first and third and it seemed to have worked so I'm glad! As for your question, I've left it deliberately vague - interpret it as you wish. ",
                                    "score": 6,
                                    "author": "XcessiveSmash"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you very much!",
                                    "score": 2,
                                    "author": "XcessiveSmash"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The first time I read the second person writing I thought it may have been an accident, but as I kept reading it just made sense. I've never seen it used like that and you really killed it. Pun intended. Thank you!",
                            "score": 4,
                            "author": "Beelzebubs_Whore",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I've never done it and I'm surprised at how well it worked! Thank you for reading. ",
                                    "score": 3,
                                    "author": "XcessiveSmash"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Hey have you ever read \"The Egg\" by Andy Weir? Your style in this is very similar to that story and I love it! Keep it up man!",
                            "score": 4,
                            "author": "jman12234",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I read that one years ago, yeah. I love Andy Weir's writing style, so this is a huge compliment. Thanks for reading!",
                                    "score": 2,
                                    "author": "XcessiveSmash"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I liked it. ",
                            "score": 3,
                            "author": "Malachhamavet"
                        },
                        {
                            "level": 2,
                            "comment": "This is so damn good. I feel like I just went through an existential crisis myself with the character only realizing myself in the end. ",
                            "score": 3,
                            "author": "Laz0Rust"
                        },
                        {
                            "level": 2,
                            "comment": "that story literally stopped me in my tracks, I've been sitting here with a half rolled cigarette  the whole time. very nicely done",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Huge compliment, I'm glad my writing could affect you in a physical way - seriously, it means a lot. ",
                                    "score": 3,
                                    "author": "XcessiveSmash"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You have an interesting take on \"ascension\" - to think simply for the sake of thinking. It gives a different meaning to \"I think, therefore I am.\"\n\nI don't know if you were influenced by it, but your story reminds me very much of [The Last Answer](http://www.thrivenotes.com/the-last-answer/) by Asimov. If you haven't read it, you should check it out. It's also almost the opposite of The Egg by Andy Weir interestingly enough.",
                            "score": 3,
                            "author": "Do_Not_Go_In_There"
                        },
                        {
                            "level": 2,
                            "comment": "I loved it.  My fantasy mind instantly attached and started to build a world around it.  Episodes if you well, though 'generations' would be more like it.  I felt i could really be there, that it might actually be my reality and that is a potent skill.  I wish you were a high profile writer, I'd love to see multiple 'journeys' of the ascended.  I liked that there wasn't really a conflict beyond the acceptance of ones new life.  I wish there was more media that eschewed the typical antagonists and dark turns that require intervention, and your story gave me that for a short moment.  Thank you.",
                            "score": 3,
                            "author": "notalltogether"
                        },
                        {
                            "level": 2,
                            "comment": "So threats what second person is ",
                            "score": 1,
                            "author": "atgmailcom"
                        },
                        {
                            "level": 2,
                            "comment": "I think this gently touches upon the philosophies of Alan watts in regards to spiritualism and meta-physics. Love It.\n\nQuite inspired friend, great format to separate narrative as the switch between first and second person between both characters is almost muddling. \n\nGive ya 12/17 bald peaches.",
                            "score": 1,
                            "author": "Sees_Walls"
                        },
                        {
                            "level": 2,
                            "comment": "Really good, I enjoyed it very much. \n\nReads as a good prologue to a short story collection.",
                            "score": 1,
                            "author": "90Sr-90Y"
                        },
                        {
                            "level": 2,
                            "comment": "That was goddamn amazing.",
                            "score": 1,
                            "author": "Kraz3"
                        },
                        {
                            "level": 2,
                            "comment": "I think you've captured hard concepts in a very Simple way, I'd like to know where the inspiration for this story came from, experience or studies? ",
                            "score": 1,
                            "author": "DizzyCrabb"
                        },
                        {
                            "level": 2,
                            "comment": "This is the first time that I've really been introduced to second person writing. Do you have any more examples from this perspective!?",
                            "score": 1,
                            "author": "ALefty"
                        },
                        {
                            "level": 2,
                            "comment": "I love it, how at points it's hard to remember who is who, and that it doesn't matter. ",
                            "score": 1,
                            "author": "Hoeftybag"
                        },
                        {
                            "level": 2,
                            "comment": "I liked it....I kind of understand what \"Death\" is and what it is doing and why it is doing it but I can see that it's doing the same thing....we....well....some of us try to do and that's find something better something more than what we currently are.  Death is just another way of reaching beyond the world we have, hoping and praying that there's something more and something better on the other side.  It's an endless cycle.",
                            "score": 1,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Really creative, and is an amazingly captivating standalone piece.",
                            "score": 1,
                            "author": "The_Synthax"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 46,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This is The Last Answer by Isaac Asimov",
                    "score": 27,
                    "author": "RestoreMyHonor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've read *The Last Question,* wasn't aware there was *The Last Answer.* Another guy also said a similar thing - I'll give it a read.  ",
                            "score": 20,
                            "author": "XcessiveSmash",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thought it was a typo. Very pleased with The Last Answer, as much as I was with The Last Question.\n\nYour story was wonderfully written as well. Enjoyed it very much.",
                                    "score": 3,
                                    "author": "MildFig",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "good story right?",
                                            "score": 1,
                                            "author": "RestoreMyHonor",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I must confess, at first it was hard to see who was saying what, but it was done well. Amazing, would love to read more. ",
                    "score": 16,
                    "author": "Arimania"
                },
                {
                    "level": 1,
                    "comment": "Isaac Asimov has something very similar between the consciousness of a dead scientist and a higher beings' consciousness. I don't think it's second person though. The second person aspect is cool I think.   Nice job!",
                    "score": 13,
                    "author": "bluefishredditfish",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup yup. That story is called The Last Answer.",
                            "score": 5,
                            "author": "FordEngineerman"
                        },
                        {
                            "level": 2,
                            "comment": "Thanks!\n\nAnother guy said it's called *The Last Answer*, I haven't read it - will check it out.",
                            "score": 4,
                            "author": "XcessiveSmash"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm so sad there isn't more but I also don't want more. This is so well written!",
                    "score": 7,
                    "author": "4lackofaName",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "thank you!",
                            "score": 6,
                            "author": "XcessiveSmash"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "how do they know someone is capable of ascending beyond them?",
                    "score": 9,
                    "author": "jumpup",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Humans die because *they* exist. For *them*, though, who possess a higher understanding of the world, existence is pain. So *they*'re creating beings just like *them*, by forcefully making humans Ascend, in hope that one of *them* might one day Ascend and become a being that prey on *them*. \n\nThat way, they'd be able to die, once and for all. ",
                            "score": 54,
                            "author": "Zeal_Iskander",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So they're Meeseeks.",
                                    "score": 18,
                                    "author": "catholicgrant",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Existence is pain, like lying in bed right now while I should get up for work.",
                                            "score": 6,
                                            "author": "Vlyn"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I believe they simply hope, as they did not know they would ascend the first time. But if one ascends a second time, it seems that one would then be unable to die as well. He would simply be able to give mercy to the others who could not die. In my interpretation, at least.",
                            "score": 13,
                            "author": "AGulliblesloth"
                        },
                        {
                            "level": 2,
                            "comment": "What's the alternative? Spending Eternity in misery without hope? They've got plenty of time to spare to invest in the possibility.",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is great! I love the ambiguity of it",
                    "score": 5,
                    "author": "WintarMeadows"
                },
                {
                    "level": 1,
                    "comment": "...all magical girls become witches?",
                    "score": 3,
                    "author": "conradsymes"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 24,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I get where you're coming from, but I think I that's exactly what made me love the story as much as I did.\n\nIt gave the narrator an otherworldly quality and made them feel like they were powerful to a degree we, as the merely human reader, can't even comprehend. ",
                            "score": 63,
                            "author": "DonRobo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly this.\n\nSo when you're telling a story, you're in total control, right? But you also have a responsibility to make the story flow well. You have a duty to say things like \"he said\" at the end of someone's speech, but you also have the ability to throw in \"and then he threw himself off a cliff and was quite dead at the end\".\n\nNow imagine if the person telling the story of your life started talking to you. That little invisible \"he said\" at the end of all your sentences, now says \"I want\". It has all the power -- indeed, the fact that you're in his story means that you have _no_ power. Why is it talking to you? What does it want, or indeed, _how_ does it want, anything from you?",
                                    "score": 6,
                                    "author": "PM_ME_PRETTY_EYES"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thank you! I really struggled with which character was speaking. ",
                            "score": 6,
                            "author": "S0k0",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "/u/XcessiveSmash, me too.  When you first switched to it, it threw me off and I read the same few sentences a few times to make sure I wasn't off.\n\nI read a few more lines, finally understood, then went back and reread the whole section.\n\nI really liked your story, but that stuff really made it a job to read.",
                                    "score": 3,
                                    "author": "dwmfives",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah I get where you're coming from. This was my first time writing in second person and rereading it I realize a few confusing points. I'll strive to do better!",
                                            "score": 2,
                                            "author": "XcessiveSmash"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Apologies - it is my first time writing in second person, so I could certainly have executed it better. ",
                                    "score": 2,
                                    "author": "XcessiveSmash",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's a great story though. Nice bit of creativity. ",
                                            "score": 1,
                                            "author": "S0k0"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thank you very much for taking the time to give feedback! This was my first time writing in second person, so I'm sure there were awkward spots. And I certainly agree some points were confusing to follow. Funnily enough, the edits you suggested are how I would usually write this. Regardless, thank you *very* much for the feedback, I really appreciate you taking the time to give it!",
                            "score": 7,
                            "author": "XcessiveSmash",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh gladly! And, as with any feedback in creative writing, remember you are free to disregard it for any reason (as long as you do in fact have a reason). If I am just a dolt that can't wrap my head around second person, then so be it. If some of it was actually helpful, great! \n\nCheers! and keep writing!",
                                    "score": 3,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think the reason why death is narrating the person's thoughts is because he cannot 'hold' them in his brain. Death has to narrate the person's thoughts to him back. I think it's like holding a toddlers hands to help him walk. I think it's weird and that's another reason why I like it.",
                            "score": 5,
                            "author": "nicholasferber",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Interesting idea, and it would certainly be a fun one to explore with a short story. I would definitely need practice to try and write something like that with any sort of flow. Maybe I will have to try the idea some day. A narrator who has to hold the cast's thoughts. How novel!",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It made it feel like the New Guy is coming along...still struggling through the transition, and he asks Death what sort of progress he's made in adapting.\n\nThis is Death telling him how he used to be.",
                            "score": 4,
                            "author": "Diablo165"
                        },
                        {
                            "level": 2,
                            "comment": "Your three dimensional dialogue confuses me.",
                            "score": 1,
                            "author": "SurpriseWtf",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;So let me tell you a story. I was dead once, sitting in a cell in some strange palatial prison. The prisoner next to me was a mouse of no small intellect. This mouse could talk as well as any.\n&gt;\n&gt;\"Good day to you, wretched and damned bastard you are,\" said the little creature.  \n&gt;If you have never been addressed by a foul mouther rodent before, I assure you it will catch you off guard the first time it happens.  \n&gt;\"WHAT THE BLOODY HELL ARE YOU?!\" I screeched at the poor creature.\n\nThis is a very explicit example of a 3 way dialogue for a 1st person narration. I, the narrator and member of the story, am addressing the reader directly, but the story I am telling is still 1st person.\n\nDropping the explicit reference to the third person results in a story more like the one I adapted from OP.\n&gt;^\\*By ^writing ^I ^am ^talking ^to ^someone, ^weather ^I ^address ^them ^explicitly ^or ^not.   \n&gt;\"What am I to do now?\" I thought to myself. \n&gt;The walls of the cell pressed in on me.  \n&gt;I had caught a glimpse of the grand palace in which I was prisoner during my arrival, but that was little comfort when my last memory before being driven through this strange place was of going to sleep in my slightly draft room with a chest cold the night before.  \n&gt;\"Good day to you, wretched and damned bastard that you are.\" said a small mouse to my right.  \n&gt;If that room seemed small before, it just got a whole lot smaller.  \n&gt;\"WHAT THE BLOODY HELL ARE YOU?!\" I screeched at the creature.\n\nBoth 1st person, both involving the reader as a 3rd party, one doing so quite explicitly.",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm not sure if it was originally intended but the narration technique that OP used  fits the context of the story quite well.  They are perceiving each other in some other dimension we can't comprehend.  I was totally immersed during my 2nd read through thanks to that narration.\n\nMaybe I am ascending.",
                                            "score": 2,
                                            "author": "SurpriseWtf"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'd take a sequel and then some.\n\nReally, please try to expand on this. It's well-done!",
                    "score": 4,
                    "author": "Everscream"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Isaac Asimov\n\nIsaac Asimov *aka* The Good Doctor",
                            "score": 4,
                            "author": "HieronymusBeta"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've read this as Anthony Hopkins and it was sublime ",
                    "score": 2,
                    "author": "shaveslavers"
                },
                {
                    "level": 1,
                    "comment": "Great job, particularly in tackling the 2nd-person perspective. I feel the POV really helps the reader grasp the abstractness of the event itself, and even if told in second person, “my” reactions are simple enough that the reader could insert their own versions if they emphasize with “themselves” enough to agree with the plight at hand. \n\nOn the other hand, while I think using the initial Death character to fill space was good, it would be better to stick to referring to Death in the 3rd person and avoiding taking Death’s perspective at all, otherwise it becomes 1st person (the initial Death narrating the events in real time). Strong piece overall. ",
                    "score": 2,
                    "author": "MidlothProject"
                },
                {
                    "level": 1,
                    "comment": "This is really, really well done. ",
                    "score": 2,
                    "author": "MrMorgoth"
                },
                {
                    "level": 1,
                    "comment": "What kind of narration is this called? It’s almost as if it’s double omniscient, like they are narrating themselves to each other, while also speaking telepathically to each other. I don’t think I’ve read anything like it before. ",
                    "score": 2,
                    "author": "Mik3one5"
                },
                {
                    "level": 1,
                    "comment": "Ooooh second person, so rarely well done! 😀",
                    "score": 2,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I like how the protagonist zoned out so hard that they reached another plane of existence.",
                    "score": 2,
                    "author": "Kaleon"
                },
                {
                    "level": 1,
                    "comment": "Absolutely fucking beautiful. I can't find a single issue wrong with any aspect of this story. The dialogue between two entities that are completely imperceptible to each other is handled excellently, the sense of the surreal isn't too heavy handed. \n\nFuckin' hell man, 9/10 story only because I don't think the perfect story exists. \n",
                    "score": 1,
                    "author": "DavidG993",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "... that's a dumb reason to take off a point. If 10/10 doesn't exist, your scale is to 9. ",
                            "score": 13,
                            "author": "Genlsis",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Except no it's not. It's to 10. Do you not see the numbers right there? It clearly says 9/10. ",
                                    "score": 1,
                                    "author": "DavidG993"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thank you very much for the kind words!",
                            "score": 3,
                            "author": "XcessiveSmash"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you want an informed critique on what I believe you did right and wrong, I can dig it. Hopefully my thought provoking and downright insightful comment helps.",
                    "score": 1,
                    "author": "im-not-watching"
                },
                {
                    "level": 1,
                    "comment": "Hah life with depression is what it sounds like. Amazing story ❤",
                    "score": 1,
                    "author": "Cactar888"
                },
                {
                    "level": 1,
                    "comment": "I, for one, liked this.",
                    "score": 1,
                    "author": "BobsBurgersJoint"
                },
                {
                    "level": 1,
                    "comment": "That was really good. Kinda gave me some \"Childhood's End\" vibes",
                    "score": 1,
                    "author": "Tastypies"
                },
                {
                    "level": 1,
                    "comment": "Pretty good format with the second person. I kinda thought all anyone needed to figure out this prompt was watch Supernatural lol.",
                    "score": 1,
                    "author": "GasPoweredStick92"
                },
                {
                    "level": 1,
                    "comment": "This was a very nice take on Isaac Asimov's \"The last answer\" if you havent read it I would take the time. ",
                    "score": 1,
                    "author": "iammaline"
                },
                {
                    "level": 1,
                    "comment": "Fuck. Me. ",
                    "score": 1,
                    "author": "x32s_blow"
                },
                {
                    "level": 1,
                    "comment": "Fuck! I'm sitting in a train and reading this on my way to work. Ironically my phone plays this soundtrack: https://youtu.be/c7rY10hY8Cw \nPerhaps any human language is limited indeed to express my profound thoughts at this moment!",
                    "score": 1,
                    "author": "parkarab"
                },
                {
                    "level": 1,
                    "comment": "I'm sure you've gotten a ton of feedback but this was great! Esp the second person aspect. The fact that your are narrating what I'm doing conveys just how little I'm in control of the situation. It's different. \n\nPer the people who said it wasn't clear, I suggest using italics for your dialogue to me but that's all. A simple change like that might bring clarity without sacrificing the unique nature situation the we are in and the writing style it self.\n\nAh and the end where we are looking for the higher beings to kill us. It's a great way to address to the prompt. Also, that simple idea implicitly conveys the deeper layers. What would the 8th layer of death look like? 12th? Nth?\n\nA self contained but full narrative. Very well done.\n\n",
                    "score": 1,
                    "author": "taylorsbrill"
                },
                {
                    "level": 1,
                    "comment": "I really liked this, great job. Second person narratives are so tricky! ",
                    "score": 1,
                    "author": "rarelyfunny",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks, mate! It's the first time I've written anything like this, and I'm glad it panned out. Thanks for reading!",
                            "score": 1,
                            "author": "XcessiveSmash"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": " \"Now I am become death, the destroyer of worlds\"",
                    "score": 1,
                    "author": "hawtredmints"
                },
                {
                    "level": 1,
                    "comment": "I am going to have this story saved and use it as an inspiration for attempting to write in the second person. Which is a really difficult thing to do, as I have found out, but you make the transition between the two speakers seamless. One of those pearls ones stumbles on in reddit. Thanks. u/XcessiveSmash",
                    "score": 1,
                    "author": "pandafromars"
                },
                {
                    "level": 1,
                    "comment": "Wow.. So did I just evaporate into a higher dimension? ",
                    "score": 1,
                    "author": "Awesomianist"
                },
                {
                    "level": 1,
                    "comment": "Very nice story ! As I read I was pretty sure you got your inspiration from \"The Egg\" :)",
                    "score": 1,
                    "author": "zabadap"
                },
                {
                    "level": 1,
                    "comment": "this has nothing to do with your writing, as its honestly amazing, but I am always so frustrated when characters become \"dumb\" in a story and dont even consider taking a second to think about things reasonably or just saying that they dont understand or even guess.",
                    "score": 1,
                    "author": "SAlNTJUDE"
                },
                {
                    "level": 1,
                    "comment": "That's an amazing story, I really liked it. \n\nOn an unrelated note, do you ever spend time on r/surrealmemes ? All this talk of **ascending** reminded me of this subreddit.",
                    "score": 1,
                    "author": "jopyt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They had made up names for her. \"The Grim Reaper\" was her favorite; that one came with its own mythology. The story went that when it was a human's time to go, they'd see manifestations of the Reaper, coming to collect their souls and escort them to the afterlife. The black robe and scythe had become very much a part of her iconography, and she had embraced that. In reality, the scythe was the favored weapon of her people, and the black robe just made her feel cool. Humans knew, of course, that it was logically impossible for the Reaper to collect *every* dying human soul, but they ascribed that to the supernatural, something they tended to do with most things they didn't have the capacity to explain.\n\nThe truth was that human souls were delicious. The mundanity of the real reason Kat'til was hunting that day was almost funny to her. She spent most of her time on Earth, though occasionally she would share her kill with her brothers and sisters throughout the galaxy.\n\nTonight, she found herself in a city that humans called Oss-tin. It was  quite a lively city, and it was a night that saw the streets of Oss-tin flooded with people. She scanned the street from atop a roof, assessing the richness of the feast of souls set out before her. Humans were mostly frail, but in large groups, they could wreak havoc on Kat'til. She needed to choose carefully.\n\nA man stumbled out of a bar, filled with the libations that she understood this part of the city was famous for. His aura glowed brightly.\n\nHe was ripe.\n\nKat'til waved a hand in front of her face, transforming what would be a ghastly appearance to any human into a pleasant, charming face. The idea was to lure him into one of Oss-tin's many alleys and side streets, striking him down while he was alone. She jumped down from the roof, landing in the roaring crowd without making a sound.\n\nShe marched right up to the man she'd spotted from above, whose hands were on his knees. This one was going to be sick. She moved out of his way just in time to watch him expel the contents of his stomach out onto the street. A hand flew to Kat'til's mouth to keep her from laughing. She reached out to him.\n\n\"Let me give you a hand.\" He looked up at her, immediately taken with her new guise, and slurred some form of assent. Kat'til draped his arm over her shoulder, guiding him to the alley beside the bar he'd just fallen out of. Once she had determined they were sufficiently alone, her disguise dissipated. The man's face went completely white.\n\n\"Oh, god. Oh, shit. Is this it?\"\n\nKat'til nodded. \"This is it. I can carry a message to your family, if you'd like.\" She would do no such thing, but it typically calmed down her prey enough to make her job easy.\n\n\"Just... just tell my parents I love them, and sorry I'm such a fuck-up...\" He let out a choking sob, putting his head in his hands. Kat'til's heart fell. She always felt bad if they started crying. But she had a job to do.\n\n\"I'll tell them. Now kneel.\" The man did as he was told, and Kat'til raised her scythe, bringing it down on the man's neck. No cut was made, though a white mist began to seep from his body. Kat'til opened a pouch she was carrying inside her robe to collect it. The soul was rich in nutrients.\n\nShe had done well.",
            "score": 263,
            "author": "ThreeEyedCrow1",
            "replies": [
                {
                    "level": 1,
                    "comment": "This reminds me of the Evelynn lore from League of Legends.  Any chance inspiration came from there?  ",
                    "score": 20,
                    "author": "TheNinthDM",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Huh, interesting! I played a long time ago, but never really dug into the lore of any of the champs, so can't say it was much of an influence.",
                            "score": 9,
                            "author": "ThreeEyedCrow1"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Enjoyable for an intro to the main character, but nothing grabbed me as interesting enough to continue reading if this was the start of a longer story. For Kat’til, this scene was mundane and part of that feeling rubbed off on me as the reader.",
                    "score": 15,
                    "author": "jeffh4",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I appreciate the feedback! I agree with you that this is more of a low-key scene. I'll need to work on grabbing the reader better. Thanks for reading!",
                            "score": 11,
                            "author": "ThreeEyedCrow1"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 7,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Haha, that was definitely the intent! Used to spend quite a bit of time there myself. Thanks for reading!",
                            "score": 12,
                            "author": "ThreeEyedCrow1"
                        },
                        {
                            "level": 2,
                            "comment": "I think that was the point. She said that's what the humans called it and probably hadn't ever seen it written down anywhere",
                            "score": 9,
                            "author": "Clutz35"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Death isn't physical though, the child is\" Whitaker felt proud debunking this one so fast.\n\n\"No, it's the sun the ant needs to destroy. Without it, the child is powerless\" Thomas replied, not even looking up from the sparks blazing past his unprotected face.\n\n\"So you're an ant trying to take down the sun?\" He handed Tom a face plate whilst taking a peak at the workbench.\n\n\"I'm none of the players in that little skirmish, but I occasionally let the ants ride shotgun\" Tom smirked as he covered his face.\n\nThe sentiment wasn't lost on Whitaker. Despite the good humour intended he couldn't help but feel exactly as Tom described, an ant on a car seat. Looking at a device he knew nothing about, let alone begin to repair as Tom was doing, Whitaker suddenly felt the isolation and insignificance of his new life.\n\n\"Of course an insect that plays, even a small part, in the destruction of a celestial body would be remembered as a legend\" an echoed voice reassuringly mused.\n\n(First post here, on my phone, with too much dialogue. Yay)",
            "score": 30,
            "author": "StrangeStrawMan"
        },
        {
            "level": 0,
            "comment": "*There they are. Run little insects, run.*\n\nDeath looked at the green and blue sphere that was suspended in front of him. He circled it, looking at all the billions of little microscopic creatures. He watched them scurry around, seemingly aimlessly. \n\n*Their lives have no meaning. I could kill them all, just with one little flick of a finger.*\n\nDeath lightly flicked a blue part of the sphere, the blue overtook part of the green. Death watched in sadistic amusement as the little black specs running through the green were washed away. It gave him pleasure, having control over such inferior creatures. \n\nExcitement bubbled inside him as he reached for a lighter and flicked it on. He gently pressed the lighter against a green area and watched it slowly catch fire. He loved watching the black specs scramble, watch them surround the fire and eventually make is subside. \n\nDeath heard someone coming and quickly hid the sphere under his robe, careful to not kill all of his little science experiments. *Shit, she's coming*\n\n\"Death Jr.! Have you been playing with that Earth thing again?\" The woman stood in the dark room, her green dress and smooth skin stood out among the solemn decorum. \n\n\"No, ma. I swear I wasn't.\"\n\n\"What's under your robe?\" She gestured for him to give up whatever he was holding.\n\n\"Ah, ma. I was just having a little fun.\" Death Jr. handed over the blue and green sphere.\n\n\"Look what you've done to the little thing!\" She motioned to the charred part, a black scar was left where the lighter had touched. She gently blew toward the scorched piece and it suddenly sprang back to an elegant green. \"No more playing for you, Mr.\" She stomped out of the room, sphere in hang.\n\n*I'll get it back later. After all, killing is my nature. It's just too fun.*",
            "score": 268,
            "author": "llamachicken1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is that Mother Nature?\n",
                    "score": 87,
                    "author": "Thenhow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, that was the idea haha",
                            "score": 53,
                            "author": "llamachicken1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I suggest you \"Mother!\" one of the most weird ass films out there.",
                                    "score": 6,
                                    "author": "mantlair",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Weird as hell and possibly my favorite film of all time!",
                                            "score": 6,
                                            "author": "ALefty"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "fun",
                    "score": 10,
                    "author": "9spaceking"
                }
            ]
        },
        {
            "level": 0,
            "comment": "To be a form of death is an art, really. We must take it as one to fully respect and appreciate our position on the spectrum of order and chaos. \n\nWe have several projects on the go, and though it is not as many as some, it simply means we allow more care and dedication to our specific flavour. I like to make dying a process, because I find it makes the life substance so much richer. It becomes stewed and overpowering, leaving you with a bittersweet buzz somewhere between nostalgia and homesickness.\n\nMy pet project is a middle aged man with leukemia. Influenced into existence by a lineage of hand picked predecessors, genetically primed over generations of selective breeding to create a nearly perfect balance of health, sickness and hope. We are predicting that his body will almost survive, for his mother was hand picked for her physical willpower and optimistic outlook, which inevitably she passed onto her son. Through the right environmental influence and our delicate hands of manipulation, she found his selected father with minor interruptions. Occasionally we get poachers who try and couple their cheaper humans with ours in the hopes that they will gain the rights to accidental offspring or early harvest life substance, but their techniques of human connective manipulation are usually lackluster and short-lived. Our humans always feel more compelled to follow our richer and more fulfilling influence paths. \n\nMy leukemia patient was also born into a long standing theistic belief program that our cultural team developed in humans some several hundred years before his birth. Our commitment to human creativity means that the moment of death will be imaginative and expectant of something more, leaving you wanting more; satisfied but desiring. \n\nIn the end our product is always the superior on the market. Forty years of carefully planned living, carefully planned environmental conditions, and careful collaboration with outside breeders, all summarised in just one moment of harvest. A moment truly unique,suspended in time, complete and enriching. ",
            "score": 51,
            "author": "Ichebod"
        },
        {
            "level": 0,
            "comment": "They watched as the man woke up, emptied his bladder, made coffee, and scrolled on his phone for ten minutes while the coffee grew cold. They watched as he dressed in clothes he found uncomfortable to go to a job he found distasteful to pay for a life he didn't appreciate. He was swept along in the current, like all humans were, but this one had caught Death's eye.\n\nHe liked the coloring on this one's heart. It had that quality that Death found desirable. He baited and waited.\n\nThe man sat down in the food court with his usual meal, and ate it with gusto. Though impassioned by his desire to eat, he still paid no mind to the food, and ate it while scrolling through his phone. The man read something upsetting on his phone, and clicked it off with a click of the tongue. He shoved the last bite in his mouth and stood up to go.\n\nDeath reeled in and the man fell to the floor, clutching his chest. Several nearby rushed to his side but there was nothing they could do. There was nothing anyone could do once Death had them. Hook, line, and sinker.\n\n\"Throw it back,\" yawned Enlightenment, leaning back in the boat.\n\n\"You always throw them back,\" retorted Death.\n\n\"And you always keep them,\" Enlightenment responded, as he'd done trillions of times.\n\n\"What can I say? A man's got to eat.\"\n\n_Postscript: Went with fishing instead of ants under a microscope, as I recently had a conversation with a friend about how it would feel to be fished out of our life by creatures we don't understand and then thrown back. Hopefully I'm not too late for this prompt so I can get some feedback!_",
            "score": 29,
            "author": "HeWhoWritesAgain",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is really good. I love the fishing idea and Enlightenment was a nice touch.",
                    "score": 5,
                    "author": "Mooncinder"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“You think I’d let you play this stupid game? You think I have the time? The leisure?” Death said, his bones rattling. The black fog that surrounded him sped up slightly in its swirling. He was unimpressed at my suggestion to bargain with him.\n\nI looked around. We stood on a surface of pure white, complete flat and even. Everything seemed to be lit from above but when I looked up, there was no light source in sight. “Is this the afterlife?” I asked.\n\n“No, dummy. This is the dimension of thought. If I explained it to you, your primitive mind wouldn’t understand it anyway. Anyways, I’ll give you a brief rundown. So, you see, your mind exists on a different plane to your body, linked together. But when you die, your body no longer exists, and the link is broken.” Death said, waving his skeleton arms around to demonstrate his point.\n\nLooking back, I thought about death a lot when I was still alive. Maybe there was nothing after death. Maybe there was a heaven, an afterlife. Maybe there was reincarnation. I’ve never expected for there to be a literal Grim Reaper. It just didn’t feel right.\n\nI saw a black speck in the distance behind Death. “What is that?” I said, pointing.\n\nDeath turned around, then turned again and ran.\n\nI didn’t. Instead, I walked closer. What if it had answers? Maybe it was the answer. As I approached it I saw it was approaching me too, but faster, magnitudes faster. As it got closer I saw it was a massive black cloud, made out of the substance that surrounded Death, swirling and twisting.\n\n“Hey, um, can you tell me where I am right now?” I said. But the black cloud was unrelenting. As it approached, my thoughts, they… became more and more… incoherent. It was feeding on them.\n\nBlood pumped into my brain, providing it with the jolt it needed. I ran as fast as my legs would carry me, but it wasn’t fast enough.\nBut I didn’t have legs. They were pulverised in the crash that killed me. My blood would’ve drained out. My brain would’ve been dead. It was hard to remember the circumstances, but I tried anyway. I remembered the car I was driving, its model, what it looked like, how I was sitting in it before the crash.\n\nThe imaginations were more vivid in this dimension, I thought, before I realised they became real. I was sitting in the car, driving. As I checked the rear-view mirror, I realised the black cloud was still chasing me, inching closer every second, but the car bought me time to think. I thought about what Death had said. This was my mind, existing in a different plane to my body, which was now gone. As a result, I was the component of my thoughts, and what I was only existed as a figment of my imagination.\n\nI imagined a faster car, but the cloud still chased on, relentless. I imagined a jet, but it still wasn’t fast enough. *Transcendent your human thoughts,* I told myself, *that world doesn’t exist anymore.* And for a while, I was a black cloud, unaffected by the laws of physics, able to go as fast as I pleased. When I looked back, the creature had long disappeared. Changing back into a human – I was more familiar as a human, after all – I walked, only to see the Grim Reaper again.\n\n“What was that… *thing*?” I asked.\n\n“It’s just another mind. Thinking requires energy, you know, so minds devour other minds for energy. With a body, minds are protected so that only the most powerful could imagine feeding on them, and even then, it requires decades to finish the process. You might’ve heard of it as dementia. But once a mind becomes separated from its body, the protection is gone and it becomes vulnerable. That thing must have seen you and thought you’d make an easy prey.”\n\n“As for what that thing was,” He continued, “I don’t know. Does it matter? It could’ve been a bear or an ant or whatever when it was still alive, but now, it’s just a collection of thoughts. It can be whatever it wishes. You know, I’m surprised that you even escaped it, but I’ll tell you what. I need food too, and you won’t escape me.”\n\n“I don’t need to.” I said.\n\n“Oh, what do you mean? You’re still human. You still haven’t figured out what you can be yet. Still a primitive, undeveloped mind, ripe for feasting.” Death said.\n\n“Well, no. Look at you. The Grim Reaper. Still holding on to our culture, still having bones and a cloak. And that sickle too. And you were even human enough for us to have a conversation! If anything, I’d say it’s you who’s ready for feasting.” I said, reforming my body into a shadowy cloud.\n\n“No, don’t you dare. No, you are not doing this.” Death screamed, but it was too late for him. He wasn’t even Death, to be fair, just one of them, and a particularly bad one at that. I absorbed his mind, his soul, his imagination. So much energy.\n",
            "score": 23,
            "author": "Increditastic1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Damn, that's dark. ",
                    "score": 5,
                    "author": "torgian"
                }
            ]
        },
        {
            "level": 0,
            "comment": "In all my eras, of all the apprentices I'd ever trained, Pete was the most impatient. His lack of focus made him insightful, and he'd sometimes grow unique and truly beautiful ecologies. More often it brought him terrible difficulties in mastering even the most basic lessons.  \n\n\"I keep telling you,\" I told him, \"you're harvesting too early.\"\n\n\"I was just trying to do some pruning,\" Pete objected, reflexively. \"See? I'm still leaving the richest ones to grow ripe. Look at that these guys over here -- they are going to be prime! Better than anyone else's in the whole academy!\"\n\nPete indicated a community of humans that had colonized nearly an entire continent of a small planet he'd been farming. He was correct: The growth on that little patch of planet was exemplary in form and function. Healthy, vibrant, and fecund, it was as fine a specimen as anything I myself had ever grown. \n\n\"Growing a few prime humans, in one continent of one planet, is not the purpose of our academy here, Pete. That's not our goal.\" I tried to sound compassionate -- or at least not envious. \"The purpose is to feed ourselves --- not for one fine feast, but for every day! The goal is to grow enough food that we do not have to hunt.\n\nPete continued to watch over his little planet, but I felt like he had heard me and was trying to think of what to say next.\n\n\"You know Pete, that really is as fine a community of humans as I've ever seen -- here at the academy or out in the wild. I really do not mean to take away from that in any way\"\n\nHis eyes seemed to brighten, though almost imperceptibly. I continued.\n\n\"That continent is as perfect as I've seen, but look at this one -- it's so overgrown with humans that they are all sickly and weak. And then on this continent, so sparsely populated with any life at all, the humans are few, and they are all lead tough and stringy lives. There's no flavor -- no good nutrition in that at all.\"\n\nI'd lost any of Pete's remaining attention by then though, as I had in so many previous lectures. In the abstract, I'm sure he heard me and knew I was correct, but in the here-and-now, he just couldn't take his attention off of that one beautiful little community he'd grown. All that was left for me to give him another admonishment, which I already knew he wouldn't really hear. \n\n\"You get the most life, and therefore the most food, when there is balance. The way you've been snacking on this continent here and that one there, it's is not healthy for the system as a whole. When there is too much disparity between the weak and the strong in a system, the strong will feed on the weak. When the weak are consumed, the strong then go hungry and grow weak as well.\"\n\n\"Balance is a better way,\" Pete quoted the academy's ancient founder. \"When we control our sustenance, our sustenance does not control us.\"\n\nBut Pete wasn't a farmer. Pete was a hunter -- like the rest of us, despite our cultural evolution and farming academies and all the rest of it. He was a hunter, like me.\n",
            "score": 16,
            "author": "GGBarabajagal"
        },
        {
            "level": 0,
            "comment": "Quick comment: First time posting here so sorry if I violated some rule I didn’t know about\n\n“Hi, my name’s death. Nice to meet you.” I saw the businessman in the suit in front of me shiver and hide behind his briefcase. I’d seen his time coming, pathetic human that he was, for a long time now. He’d been my most recent assignment and I always liked to give humans a taste of the world they could not see before they died\n\nMy name is death 327. I am one of many deaths living on this little blue rock third from the Sun, just like you. We are a species, you know, just like humans and ants and everything else.\n\nWe don’t love a name as vulgar as death, but I suppose with what we do it makes sense. We don’t know where we came from, or how we came about, but we know our purpose: reap the humans. When their time comes we kill them and send them wherever they go next\n\nI saw the businessman before me staring around, startled, and mumbling incoherently. I gave him one last look, and then killed him, like plucking a leaf off of a branch. I watched the color drain from his face as he died, and marked another box off of the clipboard in front of me. That was number 128 today. I walked out the door of his apartment, already drifting to find the next human on my list.",
            "score": 34,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "They had forgot their own history, he thought. \n\nIt was not long ago that man first evolved on this rock. But they, and every creature like them bred, and multiplied, and multiplied. Some would die when they fell, drowned, starved or were eaten by something bigger. But they would never just , die. The mammalian body is capable of infinite self regeneration. It was evolutions marvel, its masterpiece. Cells could divide, replace old ones and regenerate all but the most severe of trauma's. As long as the creature ate and drank, the process could go on forever. \n\nThis of course had all happened before. Another lifeform, the tree had grown an indigestible bark which no microorganism could metabolize. Dead forests littered the earth, were buried, turned to coal in time but then something discovered a weakness, a chink in the hard armor, just as he had found a way now. \n\nA fungi had overcame the problem and oh, did it feast for decades. Spreading into every non subterranean dead forest like a swarm. When you are the only thing that can eat a helpless prey, the lack of competition invites you to grow ever more greedy. And he was hungry.\n\nAnd so the same had came to pass for humans. Their number had spiralled out of control, they were hunting the planet to extinction to feed their own immortality. Until the infection of death came, a bi product of their powerful life force, echoing out into the cosmos, through means they could not comprehend. A beacon for the dark, inviting it in.\n\n Death was a virus, but not a regular virus. It had permeated space, time and multiplied to fill the void between stars.  Its own sentience grew from its vastness. Like colonies of bacteria who show a greater intelligence than their constituent parts, death had once been a small thing, a footnote of the universe. But it had always fed, and it had always made more of itself. Only its methods had changed as it found new types of life, and new ways to make more of itself. \n\nIt was ethereal, invisible but, it was there. To fuel its own propagation, the death strain needed hosts, just like any other virus, ones it could co-opt to perform its own tasks. So it slipped inside every living organism as it spread to a new part of the galaxy, and discovered how it worked. Some alien life stole energy from their fat, inflated blue giant stars, becoming monstrous and large, living in the clouds of the super Jupiter class planets. Death could syphon these, deflating them slowly like a balloon , taking that converted energy to make more of himself. Larger and smarter with a brain that permeates between the stars themselves. \n\nHumans were a rare find. Energy converter organisms which predated other life to fuel a type of cell division. Those cells could make more of death at a faster pace than any other encountered life so far. What unique creatures. A new field to grow and harvest and reap. If he had a mouth, it would be salivating at the mere thought of understanding how to take of this ripe crop.\n\nAs death infected the first humans he propagated inside them and discovered they were bi gender, male and female, completely different on the inside. He would be able to infect them before they were even born for every female he inhabited. He made their first cells replicate for him. \n\nWhat a mistake this was , every cell atrophied in seconds as the burden of producing so many took its toll . It was horrific to watch for their children as their mother grew aged , crooked and silver haired. That silver hair, no other human had ever became old, they did not know what was happening only that their parents were in terrible agony. They did not know they were fuelling a being larger and more terrible than their tiny brains could ever fantasize of its existence. \n\nAs their parents withered and died in seconds, death understood how this new, powerful process worked. He could spread himself thin. Infect every living human, and every new human growing in the womb. He could slowly sap their cell function and he estimated that none would survive this beyond 120 years due to shortening of vital telomere's, which protected their immortal DNA. Every ethereal death cell caused these to wear down. The impact of this would affect humans differently and many would not survive harsh environments with which once they could exist in easily. The world had become a darker, more dangerous place for the humans. \n\nThat was the plan, but he found he could not stick to it. The rate these humans were making more of him, it was insatiable and had awoken something even darker within himself, a lust for more and more. He decimated the population, rapidly aging every human he could encounter. In mere minutes the human race went nearly extinct. And death did something he has not done since, moving most of his physical being to encase the planet. The sheer concentration of his cells destroyed the biosphere and upset natures delicate balance, plunging it into an eternal cold age of ice. \n\nWhat humans did survive the reaping were faced with a bleak, frozen landscape. Thousands more died from exposure. This pained death greatly. What missed opportunity. So much more of death could now no longer be created. This must stop. He had to regain control of himself. He stuck to the plan. \n\nAnd so it was that every human slowly died. But none could remember a time when they did not. Stories of ancient humans grew into mere myth, passed down as tales to the next generation. As death slowly consumed the older humans. For ever more fuelling him, making him stronger and smarter.\n\nThe child of the first mother however, didn't know any of this of course. Only that something terrible had happened . The child had friends who's great, great grandparents had been eaten or killed, but most children got to spend thousands of years with their parents before accidents could claim them. So they simply clutched the withered, desiccated corpse and cried her name. \"Eve\". ",
            "score": 9,
            "author": "Kurai_Kiba"
        },
        {
            "level": 0,
            "comment": "The young boy took the little toy truck and rammed it into another. \n\"Boom!\" he screamed in his childlike excitement. \nHe then walked over to his anatomical toys. He took, ever so slightly, a piece of plaque to continue an ever-so-slow process of plaque accumulation. His model here was on his way to heart disease, but he had another 10 years at this rate. \nBored, he took an action figure and another.\n\"Pow!\" he exclaimed, as one figure bent over in pain, being shot by the other. \nThe young boy was just one of many of Death's children. You could say there were thousands. Though time is of no issue, it would take too long to get to everyone to die for just one person. And it was a lot harder now to go about things, being exiled and all. Oh, it's been thousands of years to be sure, so it's not like Death hasn't coped by now with the loss, but just don't mention it in front of him.",
            "score": 6,
            "author": "1OO1O11O11O1O"
        },
        {
            "level": 0,
            "comment": "Some of us had it closer than we'd liked to imagine, some of us less so.\n\nThroughout the world and its history, our fascination with the concept of the fourth horseman, poised atop his pale horse, never ceased. It branched out, twisting and turning into so many different variations of the simple truth, that death was an entity, an entity at the end of the line.\n\nSome cultures thought it was a new beginning, while others thought it was the gateway to our final judgement, or retribution.\n\nThere we those of us that were called \"skeptics\", who were simply believed to sit upon their throne of logic and denote that there was nothing after it had come to claim us. That the world transpires into darkness and our tiny blimp in the vast cosmos has come to an end. These people, are closer to the truth than they may think, yet so far away from the horror at which they stare upon.\n\nDeath is an entity, a force more true than gravity, a being more elusive than comprehensible. A concept that exists as a contradiction to itself, for it can only exist if there is life, but when it does, it is remorseless. It cannot be bargained with, it cannot be reasoned with, it simply comes to claim that which is its due.\n\nIt has always existed, adrift in the universe, asleep, present in all things, yet continuing through life as if unaware. Yet, then it saw it, life, an oddity which contradicted all that it was, and perhaps, all that it wished to be. And so from this blackhole, death came to be, became conscious and traveled across the galaxies to devour all that was life. Perhaps it consumed because it saw life as an error, as something that could not be allowed, or perhaps it hoped, that it could one day be like us.",
            "score": 5,
            "author": "kinpsychosis"
        },
        {
            "level": 0,
            "comment": "The artist spent eternity examining their latest creation. \n\nTo human eyes, it would look like a small glass case, nine inches wide and six inches high. The left half of the case was plain black, with tiny shimmering lights. Halfway through, there was a ribbon of color, with another black expanse to the right. Near the end, the color crescendoed to a rainbow, filling the rightmost inch of the case with color from top to bottom.\n\nThe artist’s eyes were experienced. They altered the position of a molecule on the left side of the case, and the rightmost inch became streaked in black.\n\nTime was a human word for cause and effect. When you had only the small view, you need words like second, minute, hour. When you watch from the outside, you can just point to the spot in the case.\n\nThe artist took a deep dive, zooming in. \n\nInside a house inside a ribbon, a woman sketched plans. Her day job was nothing, something to pay the bills while she worked out her true passions. She wanted to push humanity to the stars, and had the brains to do it within her own lifetime. \n\nThe artist’s eyes were expert. They altered the position of atoms centuries in the past, and a tiny hole appears in Earth’s atmosphere, in just the right position to let a little more radiation pass.\n\nThe ribbon thins to a hair’s length.\n\nThe artist glanced at the remainder of the Earth, a moment of time for one to which time meant nothing. They saw skeletons in robes, jackal-headed humans, men crossing rivers. How cute. They made art for the artist.\n\nThe artist’s eyes were open. He returned to the outside view, and with a few tiny alterations, his hard work was undone, and the right three inches of the case burst with color.\n\nThey set the case to the side with the others. They too, were full of life. Every time, he sought to create a clear, empty piece, devastating in simplicity. Every time, he grew attached.\n\nHe picked up a fresh container, and began again.\n______________________________________________________\n18/365. Constructive criticism welcome and appreciated.",
            "score": 4,
            "author": "xXnormanborlaugXx"
        },
        {
            "level": 0,
            "comment": "\"For so long, we've thought of death as an event, a process, but what is death really? And why is someone at an Ecology conference waxing philosophic about death during their talk?\" \n\nThe shuffling of conference attendees flipping through their schedules was briefly interrupted by a few chuckles.\n\n \"I'm not here to talk to you about death as you think of it--I hope by the end of this talk, I can convince you that humans have a larger role to play in the food web than a chaotic top predator. In fact, we are nowhere near the top.\"\n\nThe shuffling faded as she spoke, replaced by silence and rapt attention.\n\n\"Our body works on electrical impulses. Normally you would assume that, upon death, you would see a smattering of electrical activity that slowly fizzles out. But you don't, instead we see an abrupt disappearance of activity! Where does all that energy go? I've worked with physicists to visualize this process, and we found that the energy jumps from atom to atom, appearing to move into the Earth.\"\n\nAudience members squirmed in their seats. She thought she heard a comment in the back \"well at least this nut is better than the guy who read his entire talk from a sheet of paper\".\n\nShe cleared her throat and switched from her title slide to a video showing the phenomenon. \"As you can see, the electrical charge travels to the left of the body's head in a dendritic pattern until it narrows to a single pathway into the Earth.\"\n\nGasps came from the darkened room as she replayed the video for effect. \n\n\"Based on our observations of this pattern, we believe there are beings approximately 1 mile into\nthe Earth that funnel this energy. In fact, we see several of the electrical lines, if you will, leading to clusters of energy found underground. Furthermore, these clusters of energy will abruptly start funneling deeper into the Earth through new networks ultimately reaching larger clusters of energy. We have reason to believe that there is an entire ecosystem belowground, with a top predator in the core.\"\n\nAt this, some of the audience clucked their tongues and stood to leave. Others hushed them, trying to listen over the noise of those exiting. She paused until the room was once again quiet.\n\n\"We've called this superorganism Death, and we believe it is responsible for keeping our planet warm.\"\n\n*Edited for spacing. My first post, so I didn't expect it to look so squished! Thanks for reading ",
            "score": 4,
            "author": "ThatsWriteItsMe"
        },
        {
            "level": 0,
            "comment": "For centuries, philosophers and thinkers from around the world worked in secret to develop some means of combating Death. From the rumours that leaked, most simply assumed that they were hard at work seeking to increase longevity. However, this was not death with a lowercase *d*. It was Death himself.\n\nOn the eve that Death died, all was quiet. In a bed, sitting in a dimly lit room, rested the bait. Her shallow breaths rang like a death knell. Death was coming.\n\nA long, spindly appendage reached through the room unseen. It grasped and probed for any sign of near-unlife. It quickly found what it was looking for and began its attempt at devouring the dying woman's essence. That was when the trap was sprung.\n\nThe woman was already dead. Her shallow breaths a ruse created through primitive life support systems. The appendage began to withdraw, but it was too late. A spectral assassin had already latched on.\n\nIn all the years of research, the major breakthrough came upon the discovery that ghosts were not echoes of the past or spirits who had not yet passed on. They were in fact souls that had escaped the devouring essence of Death's touch.\n\nThe Void was black and endless. But spectral assassin could see it. A caricature of Earth, floating in the vast nothing. Above it drifted a horrible and deformed fetus with billions upon billions of tendrils writhing upon the surface of the Earth.\n\nAs the eye of the fetus opened, the spectral assassin willed its way toward it.\n\n\"I am the wind that blows. I am the precipice of the apocalypse. I am new life and I am decay.\" rasped the fetus.\n\nThe spectral assassin slashed at the throat of the fetus, spilling essence that dissipated instantly.\n\nThe fetus gurgled and then laughed. \n\n\"You can kill me.\" it managed. \"But I am young and my kind much older. They will come and soon all life will be extinguished.\"\n\nAs the tendrils of Death began to disintegrate, Death flicked his fetal wrist and the spectral assassin was destroyed in a blinding flash of blue light.\n\nOn Earth, man immediately felt the power of immortality. Unlimited by the ravages of time or death, the millions of years it took for man to reach all corners of the galaxy became mere moments to them. But in the dark corners of the Void, Death was coming.",
            "score": 4,
            "author": "RedJudas"
        },
        {
            "level": 0,
            "comment": "   From the viewpoint he had he could barely see what was happening, but the surrounding sounds made up for his blocked sight, the rusty sound of crying combined with the soft sound of the priest reading from the gospel and the loudest of those,the silent sound of those around him, as though he could hear the people thoughts racing and crashing together like a trumpet player in front of percussions beating separate,but in a way together,their thoughts were all in the same key, death.\n   One of the hardest things to understand is the concept of someone gone, the idea of that when a person dies, they're gone, their bodies, their dreams,their everything is gone for good.\n   As he was talking with the deceaseds cousin after the funeral was over he heard a breath from behind,not a normal human breath but a breath that made his whole body feel like a stiff peice of wood, and with the small courage that the breath sound left him with he looked behind him,as slow as a human being could possibly turn, to find nothing but empty graves.\n\"Are you alright Seth?\" Gordon said.\n\"Yea...yea anyway I need to get going, my asshole boss already called me like a hundred times,again if you need anything call me I would be more than glad to help\".\n  The shouts from the protest were really loud this time and the amount of people participating was astonishingly increasing, Seth made a note to himself to never work next to a corrupt ministry in a country like this.\n   And as usual the protesters were blocking the parking spots of the company so Seth had to park  ten blocks away.\n   Trying to walk through the crowd to his company, he wondered how the fuck does he not get a vacation from the company with the current situations of the work place, but again as usual he just continued on walking.\n    It felt like hours trying to get to the building of the company,but finally he saw the entrance,which looked somewhat different,as though something changed or perhaps... \n\"Guns!!\" The shouting came from behind \n\"HE has a gone!!EVERYONE DOWN !!\"\n And as Seth was turning around he saw something that saying it's terrifying won't do it fair, its size was huge for it to be a human, its white hair dangling long on the naked black and red skin, and the eyes a purple so shallow it almost took his attention away from the bullet and blood coming out of his back,but it didn't hurt! It felt like nothing, as though he lost the ability to feel pain, as though his only feelings were the fear of the creature approaching, seconds felt like days while the creature got closer, he saw his whole life in those pools of purple stained water.\n But then it happened the red and black creature opened his mouth, only to reveal rusty black teeth, and then the pain that Seth never felt before, never even imagined is possible hit him while he saw something blue come out of his chest, and while the creature chewed on it with those black spears in his mouth,Seth screamed so loudly that no one seemed to hear.\n  And only then did Seth realize, there is no more stronger torture,thab facing death itself.\n..................................................................................\n\nJust to be clear : I am not a writer or pretending to be one, I am just bored and thought this would be fun, I know I kind went off topic but I liked thefinal result, so be nice pls.\nThank you\n \n",
            "score": 3,
            "author": "Ihim99"
        },
        {
            "level": 0,
            "comment": "Would you care if you found out the laws of physics are such that you are nothing more than a simulation, living in an executed reality on a cosmic level. Physicists still debate if there is an “outside the shell” world as it has been dubbed, where true reality exist that is where we were created but ever since the first zero latency quantum computer came online in 2242 and the experiments that arose from its creation there has been little doubt among experts that reality and virtual reality are identical.\n\nMy area of study has been surrounding restructuring the programming, changing the “laws of physics”. We have theorized that the laws of physics change, in the 21st century it was almost common knowledge that at the edge of the universe and the farthest reaches of the expansion the laws of physics are entirely different and then rolling back to the creation at the Big Bang yet another set of rules. It wasn’t until the first tier 3 black hole was created by scientists in 2350 that actual variation in the laws of physics was observed. Contorting physical laws intentionally and with purpose turns out to be much harder than initially suspected and humanity only had minor success; manipulating the set point of absolute zero to allow for nuclear fission at a marginally lower energy input being the biggest of this century.\n\nHowever that all changed, nesting a white hole inside a black hole creates a space where the two meet of such entropy in the laws of physics, it’s theorized time ceases to exist in any conceivable form. I won’t clutter my memoir with excessive theory but this is where my experimentations had led me to. I had secured the necessary funding to build a shuttle to explore the region from a save distance, insulated from the gravitational distortion that would throw me off of the timeline I live in. The space station outside the solar system where black hole creation is done had been booked and as I suited up for what might be disaster I kissed my wife and began to embark. The black hole generated without a critical failure and the anti grav field was holding at 10% saturation, upon creation of the white hole at cruising distance the field load jumped to 52% saturation but stabilized at 34%, anything over 50% had been calculated to be too much to proceed safely. Nothing eventful happened as I approached the barrier between the two event horizons and my tunneled communication provided the base with live data of my approach.\n\nAs I crossed the barrier and entered the dual horizon the saturation jumped to 90% and the cockpit became abuzz with lights and alarms, orbit had started to decay as the warp thrust was no longer able to outpace the gravitational pull, I was panicked, our most conservative calculations had said that at this distance I should still have complete thrust control (in retrospect we were testing for the breakdown of physics and should have considered that ... well physics equations would start to break down into meaningless numbers). A voice announced “Anti Grav field saturation at 91%”. I checked communications and nothing, I was completely in the dark and worse, the outside was completely in the dark. “Anti Grav field at 95%”. Quick diagnostics showed I was falling into the horizon with alarming speed. “Anti Grav field at critical limit, failure imminent, now departing from linear time”. My head was spinning, I was going to die, if the field was failing everyone I knew probably already died even if I somehow made it out. As the field broke down everything turned to white. I gasped and looked at my hands ... my hands were still there, I had a body. Nobody knows what happens as you fall into a black hole, maybe this place is it. Where was I. I turned to look around and shouted, behind me was the Federation Leader. What kind of conspiracy had I stumbled into that the Leader was here?\n\n“Your mind has chosen this familiar form of authority to represent me, I am not actually the person that you know to hold this form” the Leader said.\n\n“What?” was all I could stammer out, my mind took some time to actually register what he had said, what did he mean. And had he chosen to say that because he knew what I was thinking.\n\n“I understand this is difficult to process, we created your world, your universe.”\n\nAlright definitely a mind reader. “So our world really is virtual, is the outside world real?” So many questions, but if our world was virtual how do I know this is real, how do I know I didn’t bump my head when the shuttle was free falling and pass out.\n\n“I’m real, I can assure you, and you are as real as the sense of the word matters. Your world is modeled on an early version of our world, we need help and we hope you Testers can find a way to save us. You will join others that come in iteration of your world before this one.”\n\n“Why have you gathered us, what makes us special that we can save those in The World Outside The Shell?” And why would I want to save them.\n\n“Testers are those who develop a sense of the fluid nature of physical laws, the first tester boiled water in a sealed container and made ice which broke the very simplistic seed world. You are familiar with what brought you yourself here. Every one of the Testers is able to manipulate physics through an ability that can only exist in this place. We can’t make you save us but saving us is the only way to cross over to our world.”\n\n“What sort of testing will we be doing?”\n\n“We have ascended to a plane of non corporeal beings and ... we have forgotten how to die. We don’t age, we don’t forget, we just exist.”\n\nThey ... they want me to help kill them? How, and why? Why would we do that.\n\nAt that moment many people appeared.\n\n“These are the other Testers, they will explain why you will become death in our world and you will decide if you want to join them, once you know the pain we endure.”",
            "score": 2,
            "author": "XG_anon"
        },
        {
            "level": 0,
            "comment": "I am so very tired.\nI wouldn't suppose you could understand.\nI was not at work. I was a child, impatient at the dinner table, quick to shoot and slow to question.\n\nYour sicknesses - the poisons that tear away your soul so slowly and painfully that you can cry and scream and finally find yourself too weak to fight back - I am responsible. You are a species of determination, creation, progress.\n\nI understand your want to carry on.\nI've become fond of my prey - like a cat, tired of chasing mice, content to lay beside rats in her final days. I feel sorrow for you now.\n\nI ask you - are you ready to die? - and pray you do not understand.\n\nThere is someone else, somewhere out there, poisoning me.\n\nListening to my cries and screams, waiting, waiting until I am too weak to fight back. I understand what I did to you.\n\nI ask you to forgive me now: I did it to survive.",
            "score": 2,
            "author": "meredithofark"
        },
        {
            "level": 0,
            "comment": "“Well blow me down, he ain’t dead after all.”\n\n“Bit blue in the gills but alive and kicking, alright.”\n\n*spluttering and retching is audible*\n\n“Alright then, there’s a lad.  Anything the sea forced down your gullet is best spewed right back up.”\n\n*vomiting noises continue for several minutes, along with vague and insincere platitudes*\n\n“Bend me over if he’s not spat out enough brine for three drowned men and a cat besides. How long was he under?”\n\n“I’d have told you at least an hour, but I must have got it wrong, on account of...”\n\n*a particularly loud and liquidy period of gagging is heard, followed by frantic gasping*\n\n“...well, all that noise.”\n\n“Here then, boyo! What’s the skivvy, eh? Damn near boarded the final ferry!”\n\n“Th... the- they said...”\n\n“What’s what? Who said?”\n\n“Let him sizing talk and maybe he’ll clue us, eh?”\n\n“They said- they told me-“\n\n“Out with it then, come on.”\n\n“I still don’t know who ‘they’ is-“\n\n“‘Are’.”\n\n“For Her Own sake, what self serving scallylad still says ‘Arr’? Get with the ti-“\n\n“They said... I wasn’t... ripe yet.”\n\n“...ripe?”\n\n“Said they’d... pick me later. When I was in... season...”\n\n*thud is heard, followed by a period of silence*\n\n“By the by, I was actually correcting-“\n\n*audio is lost over commotion of Constabulary arrival*\n\nTranscript of audio recovered from Neat Osprey Junction survelicorder, May 22nd, 1553: Mostly Cloudy, Waxing Gibbous",
            "score": 2,
            "author": "bigolfishey"
        },
        {
            "level": 0,
            "comment": "Death speaks to us constantly. \n\n150,000 times each day, death feeds on us; the smacking, rending, shucking of the soul from the body accompanied by a whispering that never ends. We think we can't hear it, but we do. Deep in the hindbrain, somewhere very close to the spine, we can hear it.\n\nWe think our egos can't hear it, and we're right but we're also kind of wrong. Like a dog pricking up its ears and running from a tornado that hits an hour later, our lives are spent sprinting from the known unknown.\n\nThat's just for us, of course - we *special humans*. Death shows no such restraint in the animal kingdom - there among the carnage, death laughs loudly and joyously, and its sound is 150 decibels played through an iphone speaker forever.\n\nBut for us, death whispers. Sometimes, like 70 years ago, Death raises its voice and a terrible, terrible language is spoken to those who would hear. But usually, it's a low murmuring as death goes about its business. \n\nThis is because, lately, we've been escaping from Death more and more. We have begun to see it coming from the distance, like gazelles spotting a low-moving lion across the savanna, and bolting from it, leaving Death standing bewildered in cancer wards and warzones wondering how we got away this time. We have begun to understand the killing fields it prepares for us, and we bypass these ambushes while Death waits in vain for us to stumble in.\n\nSome might claim it's foolish or prideful to find satisfaction in this - that Death has always been the top persistence hunter on earth, that it always feeds in the end - but they do not understand. Death thinks of the future too, and it can see that one day we may finally escape to the places it cannot go.\n\nThere is a sound in the act of creation. A sound beneath a sound in a baby's first wails, or a seed splitting open, or a cell dividing. A sound that we hear too, calling the dog to shelter from the tornado.\n\nThis is the sound that Death fears.",
            "score": 1,
            "author": "Crankyoldhobo"
        },
        {
            "level": 0,
            "comment": "Time sighed and crumpled up her newspaper as she got to the \"Celebrity Deaths\". She reached over to the nearby counter and took a large gulp of steaming coffee. Even though she was a predator to all mortal life, she couldn't help but feel raw envy as Death waltzed around, feeding off of her hard work, and finishing it with his own (honestly dazzling) touch.\n \n She would watch as the clock spun and a man would wither either away, only to die of a sudden curiosity of how many marshmallows he could fit in his mouth before she could feast on all those precious memories aged liked a fine wine. She would waste someone's time and make them ruin their lives with their silly websites and games to play with her food, ready it for the banquet, only for Death to talk them into killing themselves days later. She felt anger with a dash of envy. Sure, he couldn't kill her, for she wasn't that tasty or nutritious (she was also a higher being with deity-like powers, but that was a minor detail), but he got away with preying on other's rightful meals like a vulture. She had taken a liking to humans when they first gained sentience, but Death caught on quickly and trailed close behind.\n \n The humans believe that the food chain was as simple as a well-graphed pyramid. This couldn't be farther from the truth (it was at *least* a well-graphed dodecahedron). Rather, the food chain was utter chaos, with Time sitting patiently to one side, mortal life gnawing away at each other, inter-dimensional beasts looking hungrily in on the mortals like a dog waiting for his food, indigestible beings that live on distant moons laughing at their unfortunately-digestible prey, Death picking at the dying scraps that everyone else had stabbed people so hard for, Disease coming up with cruel concoctions to nibble away at everything's life only for it to be cured within a year, and Weather storming about throwing tantrums when the perfectly planned Tsunami he had aimed for that bastard Richard ends up drowning an unforeseen small island community. \n \n Sure, there were others, but they couldn't bother Time much at all. She was safe from anything material in her cozy pocket dimension. In fact, another being promptly titled \"Consciousness\" used to be the king of the hill until the library was invented, then he fell like a brick to the bottom, left only to grasp at newer civilizations far from Earth with depressing the knowledge that they too will someday learn his weakness: books. He sometimes got a scrap or two during these things called \"elections\", where humans would have Scream Fests in which whoever yells the loudest gets to run a country. \n \n And yet Time fantasized about the future of humanity. She dreamed they would quash death back, letting them grow ever older. So what if they destroy the rest of the planet and drag every other species alive with them? Death would a field day and leave Time alone. Disease was starting to starve, showing hope for Time. She was invested in these odd, hairless apes, and she was going to milk them until they were wiped from the planet.\n \n But until then, Time decided she would wait. That's what put her higher than every other cosmic predator, after all. Since the beginning of this deranged Cat and Mouse game (with a little four-armed beast and all-seeing God thrown into the mix), she had perfected the skill of patience. With the snap of a finger, another newspaper landed onto her lap. Her eyes scanned it before she put it back down and took another sip of her (now cold) coffee. She would gorge on the vast memories as human's perfections turned them into gourmet meals for Time and Time alone. With age comes wisdom, but with age comes forgetfulness as well. Time longed for the day where humanity left Death and let their minds fester and collect those juicy moments like a child in school running around with Play-Doh and sticking all the colors together while the others kids watched in disgust at the horrifying combination of pale yellow and dull magenta. \n\n But until then Time Sat and waited. It was what she was best at, after all.",
            "score": 1,
            "author": "dragons_are_lovely"
        },
        {
            "level": 0,
            "comment": "The therapist had asked three times. \"Are you sure you have not been taking any psychoactive drugs?\" I had not. Nor would I for as long as these so called *pseudohallucinations* persisted. I was not crazy. Even so, each time one occurred I questioned my sanity after. A slightly darker blob moving against the dark of night sometimes. A will-o-wisp at the corner of my vision during the day. A vague whisper of malice on the back of my neck; like an ice cube held within a hairs width of the skin. Sudden spikes of adrenaline and paranoia, as if my body knew something my mind could not grasp. Incomprehensible empathy for the ants the neighbors' kids were burning with a magnifying glass. \n\nIt was maddening at times. Others it was simply confusing. Like right now. I had driven this route through D.C. a couple dozen times before. Yet somehow I could not remember my turn. Each time; just as I knew the intersection was near, my mind seemed to blank. I tried setting the GPS, but of course it was on the fritz through this part of the city. It seemed fine while I detoured to get back on my route, then failed. Just before I did. I gave up on my outing after failing to make the correct turn a fourth time. And then I was being watched. **Intently**. Of course I knew that wasn't so. My foot grew heavier on the gas pedal anyways. It might otherwise be funny, like watching a pet mouse try to outrun its' exercise wheel. \n\nI made it home in record time. I locked the knob. I locked the deadbolt. I even secured the chain for once. I did not feel the least bit safer. I closed my eyes and tried to control my breathing. A deep breath in. A long slow exhale. A slow and deep inhale. Hold it in to keep the terror out.\n\nBut it found its' way into my chest, along with an incredible pain. Before I could scream, something unseen clamped over my mouth. As if someone had suddenly used duct tape from the freezer to gag me. I couldn't move. I wanted so badly to run. But ice had crept its way into my legs, they were nearly numb. I could open my eyes though, and was met only with a blur. A mirage of air. As if I was in the desert. I tried to exhale finally but was met with resistance.\n\n**\"Not yet morsel\"** \n\n*\"Mortal? Is it Death? Whatever, please just let the pain stop!\" I thought to the disembodied voice in my head.*\n\nI felt a slow draw from my lungs begin. Like it was being savored. As my lungs emptied, sheer cold emptiness replaced it. I tried to breathe in but it just seemed to escape even faster. Things were beginning to fade. I could not feel the room around me. The rhythmic tick of the clock in the hall was absent from my hearing. The stale aftertaste of gum was gone from my mouth. And my vision began to go dark. As my sight reduced to but a tunnel of muted light I caught the barest glimpse of a skeletal face and then nothingness.\n\nThe creature known to this food as \"Death\" let the carcass fall to the floor. The last breath was always the most delectable. This one had been almost minty.\n\nIt let out a satisfied belch; stretched its' tail scythe, and dissipated back into its' own realm. As it popped out of this existence it uttered a final word to itself.\n\n**\"Delicious\"** ",
            "score": 1,
            "author": "FrenchMilkdud"
        },
        {
            "level": 0,
            "comment": "It was the strangest thing. No bright light. No flames either. Just this... fleshy, engorged halibut 30 meters across. Or something like a halibut. God, it was grotesque. And soaked in its own fluids, sitting on a rock in the middle of mud. The mud was everywhere. Ankle-deep, not distressing. But the mud really was everywhere. In fact, where exactly... ?\n\nAnd then it gulped. Or burped, more-like. Just the faintest wriggle. And some drool. From a mouth like... well, like a cave or a black hole or... more like... You know, now that I remember it, the mouth was really a room unto itself! That's right! I remember! The mouth of the beast was a sight! You could put your head in, if you'd wanted! And \nyet it sucked,  like an orifice, and... ! And if you put your head in, why, you'd have the most nauseating dream about a fish, and... !",
            "score": 1,
            "author": "mister_mirror"
        }
    ]
}