{
    "id": "aj5ffb",
    "score": 18967,
    "title": "[WP] Thirty years after the apocalypse, a book is discovered. It tells the people of old gods, the strongest, the smartest, the tallest. Places of splendor and objects renowned for rarity. They immediately created a religion, following the Gods shown by the Guinness Book of World Records.",
    "author": "NofriendoLand",
    "date": 1548282666.0,
    "url": "https://www.reddit.com/r/WritingPrompts/comments/aj5ffb",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "**Welcome to the Prompt!** All top-level comments must be a story or poem. Reply here for other comments.\n\n**Reminders**:\n\n&gt;* Stories at least 100 words.  Poems, 30 but include \"[Poem]\"\n&gt;* Responses don't have to fulfill every detail\n&gt;* See [Reality Fiction](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A\\(Reality+Fiction\\)&amp;restrict_sr=on&amp;sort=new&amp;t=all) and [Simple Prompts](https://www.reddit.com/r/WritingPrompts/search?q=flair%3A\\(Simple+Prompt\\)&amp;restrict_sr=on&amp;sort=new&amp;t=all) for stricter titles\n&gt;* [Be civil](https://www.reddit.com/r/WritingPrompts/wiki/rules#wiki_rule_10.3A_be_civil) in any feedback and follow the [rules](https://www.reddit.com/r/WritingPrompts/wiki/rules)\n\n[](#icon-help) [^(What Is This?)](https://www.reddit.com/r/WritingPrompts/wiki/off_topic) ^•\n[](#icon-information) [^(New Here?)](https://www.reddit.com/r/WritingPrompts/wiki/user_guide) ^•\n[](#icon-help) [^(Writing Help?)](https://www.reddit.com/r/WritingPrompts/wiki/index#wiki_writing_resources) ^•\n[](#icon-exclamation) [^(Announcements)](https://www.reddit.com/r/WritingPrompts/wiki/announcements) ^•\n[](#icon-comments) [^(Discord Chatroom)](https://discord.gg/XYsEYfS)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WritingPrompts) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator",
            "replies": []
        },
        {
            "level": 0,
            "comment": "“What is wrong, my child?”\n\nSilence.\n\n“You know the words spoken at Confession will never leave this room.”\n\n“It…it hurts, High Priest.”\n\n“What hurts?”\n\n“This doubt.”\n\n“What do you doubt, child?”\n\n“I doubt…everything. It is as if all the truths I once believed in were merely a house of cards, and now a breeze has come and blown the house down.”\n\n“And what is this breeze?”\n\n“The gods…I once saw only strength, bravery, boldness without any fear. Now I only see the strain in their muscles, the doubt in their eyes.”\n\n“My child…are you suggesting?”\n\n“A trial,” the boy said quietly.\n\n“My child, you must know what this means. The consequences…”\n\n“I am ready to accept them, father.”\n\n\\-\n\nSo for weeks the boy practiced, out in the ponds in the Forbidden Valley he snuck out to in the mornings before lessons. Every time he entered the water, he would curse himself, almost hoping that it would not be true.\n\nBut then in the water, he found peace. Found the only peace, perhaps, that he had ever known. It was as if he could perfectly feel the air in his lungs, the oxygen, coursing through him, clean and vital, and hear all the quiet machinery of his body, his heartbeat, his veins, the sway of his limbs.\n\nAnd then eventually, the oxygen would be gone, and he would resurface. And he would close his eyes before looking at the numbers, only to see and know with growing conviction that all he had been told before was a lie.\n\n\\-\n\nThe last person he looked to was his mother. She smiled bravely while his father could not even look at him, but the boy could see the fear, the sadness in her eyes. He would enter the water, and then come out as an exile, an outcast, or…something else entirely.\n\nAnd then it was time. He squeezed her hand, trying to let her know he was still her son. As he was lowered into the water, he saw her turn away, her hands over her eyes.\n\nThe water. Quiet and peace from all the chatter and murmurs above him. He tried to still his nerves, his wildly beating heart, the tremors and tingles that kept flaring up in his fingers. He tried to count, but somewhere along the way he was going too fast or too slow, and he gave up.\n\nBut still, he held on, determined to…he didn’t know what drove him so, but he closed his eyes and stood still in the water tank until his lungs felt like bursting, felt like fire and pain and…\n\nHe rose, and the crowd was silent. As he climbed out of the water onto the platform, he knew something was wrong.\n\nAnd then they all knelt, one by one. His mother first, then the elders, then…everyone. His father. His childhood friends. Eventually, the High Priest.\n\n“Oh, Great Guinness, thank you for gracing us with the presence of a new God, the Champion of Holding Air…”\n\nHe heard the people he had known all his life, loved and hated and envied and walked past without a second thought, pray to him, lauding his greatness, his elevation above their existence, and a new belief came to him. The lie beneath the truth, the fact that the Gods were nothing but mortal humans, like everyone, and that his life would never be the same.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n[r/penguin347](https://www.reddit.com/r/penguin347)",
            "score": 1867,
            "author": "penguin347",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think you need a different phrase other than \"it hurts high priest\".",
                    "score": 558,
                    "author": "Amaradus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"It hurts, oh! Oh so bad, high priest. \"The young boy squealed in trepidation. Looking upwards with glassy, naive eyes he reached his hand towards the smiling priest, who leaned forward with something like kindness in his eyes, but that wasn't.",
                            "score": 293,
                            "author": "iXenomorph",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, officer, this post right here ",
                                    "score": 250,
                                    "author": "Tyrusssss"
                                },
                                {
                                    "level": 3,
                                    "comment": "r/cursedcomments",
                                    "score": 106,
                                    "author": "carpal_tunnel_69"
                                },
                                {
                                    "level": 3,
                                    "comment": "Stop right there. ",
                                    "score": 79,
                                    "author": "RegalCopper",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Criminal scum!",
                                            "score": 50,
                                            "author": "MTFOmega12_Agent",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You have committed crimes against Skyrim and her people!",
                                                    "score": 32,
                                                    "author": "Zorsus",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Pay the court a fine or serve your sentence!",
                                                            "score": 23,
                                                            "author": "Cup_juice",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Wait a minute... that line doesn’t go in that game... but it *does* go with the other lines...",
                                                                    "score": 15,
                                                                    "author": "Zenog400"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "What say you in your defense?!’",
                                                            "score": 4,
                                                            "author": "noncore_apostrophe"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You have violated the law! ",
                                                    "score": 9,
                                                    "author": "RedRidingHuszar"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Screamed the stable boy",
                                    "score": 9,
                                    "author": "ChammyChanga",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Something about priests panting.",
                                            "score": 6,
                                            "author": "iXenomorph"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Why don't you have a seat? ",
                                    "score": 8,
                                    "author": "Loaf4prez"
                                },
                                {
                                    "level": 3,
                                    "comment": "Execute him, for treason against the glorious city of Alcanretia.",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "/suddenlygay",
                            "score": 77,
                            "author": "LucioCosta97"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "ooo I like this one",
                    "score": 131,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Only prob I can see is that the record for breath holding was probably set using pure oxygen, which would mean this kid has godly lungs. Nvm that fits",
                    "score": 11,
                    "author": "aPoorOrphan23"
                },
                {
                    "level": 1,
                    "comment": "I think I like this one best so far. Your words have a natural gravity to them, and the whole thing \"fits\" near perfect for a short. Oh the woe of insight and unwanted adulation?",
                    "score": 36,
                    "author": "thesquarpening"
                },
                {
                    "level": 1,
                    "comment": "I could see this concept filling an entire novel. The intricacies of the culture would be really fun to explore as a writer, I bet",
                    "score": 6,
                    "author": "nickfinnftw"
                },
                {
                    "level": 1,
                    "comment": "The descriptiveness in your writing is incredible. ",
                    "score": 2,
                    "author": "Kharrjo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What if I told you there once lived men who could lift automobiles using only their breath? Almighty beings that ate metal slabs for breakfast, who covered their bodies with hieroglyphs, purposely inflicting pain upon themselves just because they could. What if I told you these creatures walked the earth, like you and me? Would you believe it, or not?\n\nChildren, let me tell you the story of Guinness the Great and the world before the surge.\n\nBack then, life wasn't about survival. The scab rats hadn't hatched yet, so it was fairly safe on this planet. We prospered and created meaning for our own lives, which went into an unexpected direction. Everyone wanted to be noticed.\n\nAtop his golden throne, Guinness the Great held a competition of champions. He called upon the strangest and strongest, the weirdest and wildest to compete for a chance to be noticed. As expected, millions and millions of them arrived at Guinness's doorstep, all begging for his blessing.\n\nHe snapped his fingers and they all filed into a line, stretching around the earth five times. One by one, they presented themselves to his holiness, and if their talent was deemed worthy, he would invite them to be immortalized in his book and turned into a god. Guinness the Great wasn't known for patience, so those who showed no promise were thrown into a pit of lava, their corpses turned to ash.\n\nThis judgement went on for a hundred years, until one man rose above it. He saw the tyranny in Guinness the Great's ways and wanted to stop it, at all costs. He arrived at Guinness's doorstep, where he was told to bow. He did not. Again, he was commanded. Again, he withheld. Guinness was intrigued by the valor, so he gave the man a chance to redeem himself.\n\nThe man stood up straight and spit onto the very ground he walked on. He said these are no gods. No. Only men. Men who have dedicated their entire lives to these niche talents, and the disrespect will not stand. Guinness glared at him, offering no remorse. Not anymore. As he prepared to banish the man to the pits of lava, the man smiled. He dared Guinness to do it. He said he cannot die.\n\nThe fate of this man is not written in the sacred texts as it is unknown to the population. But I know. I know what happened.\n\nHe sucked in his gut and swam through the lava where he found refuge in a cave. For six years, he subsisted off of rats and rat blood. It wasn't until a fire breather drifted ashore that he was able to escape. Together, the two men stormed into Guinness the Great's lair and challenged him, inciting a war that would last another 20 years or so. The humans were too distracted with records and challenges that they didn't even realize when the scab rats and the mammoth fleas hatched. \n\nThe man who dared challenge Guinness is long gone now, but a quote etched in stone remains. \n\n\"There are no gods, only man.\" - Ripley",
            "score": 2010,
            "author": "Jagathor",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love this little fathers tale story.\nI half expected the man to be named Ripley's though.",
                    "score": 472,
                    "author": "ZenithSatori",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh my gosh, that would have been so much better...",
                            "score": 184,
                            "author": "Jagathor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You know you could change it to Ripley if you wanted it.",
                                    "score": 95,
                                    "author": "WillyTheHatefulGoat",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Changed it!",
                                            "score": 45,
                                            "author": "Jagathor",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Who was the original name?",
                                                    "score": 35,
                                                    "author": "KatKaneki",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It was just the person telling the story. I changed the entire ending.",
                                                            "score": 52,
                                                            "author": "Jagathor"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "There's still time!!",
                                    "score": 13,
                                    "author": "MapleTreeWithAGun",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Okay, I changed it! I hope it's better now, aha.",
                                            "score": 9,
                                            "author": "Jagathor",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Success",
                                                    "score": 6,
                                                    "author": "MapleTreeWithAGun"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 13,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 49,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm only familiar with the museum myself. So much fun walking in and seeing all the tricks and reading all the stories.\n\nThe floating faucet always confused me.",
                                            "score": 15,
                                            "author": "Neospector"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I don't know who Ripley is, so I don't really understand the \"new\" ending. Care to explain please?",
                            "score": 1,
                            "author": "Tomagathericon"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Kneel and swear to ~~the Lord Dragon~~ Guinness the Great, or you will be knelt.",
                    "score": 14,
                    "author": "vastowen"
                },
                {
                    "level": 1,
                    "comment": "&gt;a fire breather drifted ashore that he was able to escape.\n\nThis didn't make sense to me and really stuck out.",
                    "score": 8,
                    "author": "Pinkmongoose"
                },
                {
                    "level": 1,
                    "comment": "I don't get the last part. Who is this guy with the 6 kids? ",
                    "score": 19,
                    "author": "BananaDick_CuntGrass",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ripley.",
                            "score": 10,
                            "author": "MapleTreeWithAGun",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah he edited it, it was a little different. Thanks though. ",
                                    "score": 6,
                                    "author": "BananaDick_CuntGrass"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So Ripley was one man, who was the other?",
                    "score": 9,
                    "author": "natedawggy27",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My head cannon is the old show host from the 90s",
                            "score": 21,
                            "author": "whiskey-monk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "that’s actually a very plausible head canon ",
                                    "score": 4,
                                    "author": "natedawggy27"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I immediately upvoted for the sly introduction of the Ripley's catch phrase. It's so innocuous that if you didn't know the phrase it'd just seem natural",
                    "score": 1,
                    "author": "whitestguyuknow"
                },
                {
                    "level": 1,
                    "comment": "This is a shitpost if I remember correctly",
                    "score": -8,
                    "author": "80nd0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Me too, thanks",
                            "score": 10,
                            "author": "Jagathor"
                        },
                        {
                            "level": 2,
                            "comment": "?",
                            "score": 1,
                            "author": "ProfessorPlans"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You strayed away from the theme half way in :l",
                    "score": -16,
                    "author": "biggustdikkus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Themes are just for inspiration, the authors can do what they want with them",
                            "score": 18,
                            "author": "Blaizey",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah",
                                    "score": 3,
                                    "author": "ProfessorPlans"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maj would never shut up. Not when we were children play-fighting with moss covered sticks in the woods. Not when our parents would sit down for dinner and ask about my day. Not in the classroom when I was the one called on by Teacher Latke. He would always jump in with a glistening smile and a resounding speech. My presence vanished at the first crack of that smile.  I was never to speak while he was always to be heard; he liked it that way. Today was no different.\n\nA book of the ugliest sort was perched on an altar at the center of the Great Hall. Dilapidated pews were packed together; each of them facing the gaudy purple brick, and the decorated man standing beside it. I meandered through the crowd and took a seat. I glanced at those around me. I wanted to find doubt: a skeptical smirk, a condescending scoff, even a nervous jumping knee. Anything that would show me that these people weren't really buying it. Yet the truth was unavoidable. Their eyes were transfixed; their heads swayed to and fro in a struggle for a clear view of the altar. Next to the glistening purple brick, stood my brother. The look on his face told me that he wasn't present in this giant dusty room like the rest of us. He was raised high above the rafters. A swarm of eyes stuck to him and sent him higher with every passing second. Everything he had always wanted, companionship, attention, and praise had coalesced in this Great hall every Tuesday night for the last 6 years. Maj, like most of his followers, transcended, and even ignored, reality when he was among the pews.\n\nYet for Maj, the greatest part of it all was that I had become his foil. For all the praise, attention and reverence he absorbed I was met with coldness, disgust and banishment. I dared to blaspheme the \\*great\\* prophet. The people would whisper that his mighty holiness was cursed with a jealous brother. I, the unholy brother, was lacking. Lacking in faith, reason, and divine connection and that was why I lied. They did not know that I saw him dig up the book. I knew that the golden wrinkled hand of Kane Tanaka, the oldest person alive, did not reach down from the sky to pass him the holy pages. I knew that the worlds tallest man did not pluck stars from the night and grind them in his palm so he could sprinkle their dust on the purple book cover. It was all nonsense. There was no massive man, no stardust, no golden wrinkled skin. I know the truth and it has made me an outcast.\n\nToday my brother will preach about the will of the eldest man. He will preach of the secrets of the worlds strongest, tallest, smartest, and smallest. Their stories will fill the air like the dust. Then, at the height of his sermon, when the hall is silent and anticipation boils, the closing words will dance across his lips and his entranced victims will obey without thought.\n\n\"Donate to the Church of Guinness, my friends, and the elder may grant you a place in the next Holy book.\"",
            "score": 41,
            "author": "Pleasantdadjoke",
            "replies": [
                {
                    "level": 1,
                    "comment": "This post might have the best comments I’ve ever seen. Kudos to you all. ",
                    "score": 11,
                    "author": "TortugasEnFuego"
                },
                {
                    "level": 1,
                    "comment": "Don't feel like you got enough upvotes for this, I really enjoyed it.\n",
                    "score": 8,
                    "author": "spicccynuggets"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Years... No, it took *decades* of real preparation. They say that to honor your god is to make the ultimate thing. Once you manage to do that *thing*, they will bless you. There were many gods. Many.\n\nBut none of them mattered to John. For John, there was only one true god. And just thinking of rewards made him giggle, and try even harder.\n\nThey all told him it's impossible; that it was stupid and insane. Even his wife finally abandoned him.\n\nBut that was okay. After all, he didn't. He stayed with him.\n\nAt first, he took out his phone to record it. But there came the point when he lived his life with GoPro basically clued to his forehead. He needed the proof. \n\nJustin Case - that's the man who collected the proof to finally respond with blessing. He was the one who held the original book. And until he gets that proof, he will try hard.\n\n*And that day came.*\n\n\"Come here, Palmerranian!\" John said, looking at his dog, Pomeranian \"We are gonna do more than that Pea did. More than the true god's dog. You know what, Palmerranian? What's god backward? Dog! Exactly. Nobody else can see! But together, we will do it!\"\n\nHe took out the glass and filled it with water. The dog stayed still, watching him, ready. His tale was as excitedly swirling as ever. But for once he really looked ready.\n\nJohn put the glass water on Palmerranian's head, making him take fifteen steps backward and then forward. And he did it.\n\n*For once, he did it.*\n\nTears began to gather. He fell on his knees, just to hear the glass shatter and the dog running towards his master.\n\n\"I did it,\" he muttered. \"I will get the blessings of our god!\"\n\nBut the dog groaned and stopped, falling down.\n\n\"Palm?\" John muttered, looking at the dog, running to him. He was bleeding. The dropped glass's shard had cut him.\n\nImmediately he grabbed the dog, rushing towards the room's exit.\n\n\"Anything but my dog!\" John shouted, screamed. But he could feel it. The dog was licking his face, barking a few times.\n\nHe stopped and put him down, just to see the dog sitting and looking at him, waiting for that glass of water on his head. The usual pose, ready to please the master.\n\n\"You... You did this just because you want to make me happy? Even when you bleed?\" John muttered, falling on his knees the second time and ripping off his GoPro, looking at it, wanting to throw it away. But he couldn't.\n\n\"At least we are getting a lot of views on youtube,\" John said, kissing the dog.\n\n(/r/Elven &lt;- I write psychological fiction. Cheers &lt;3! Love your doggos! Like I love Palmerranian!)",
            "score": 163,
            "author": "elfboyah",
            "replies": [
                {
                    "level": 1,
                    "comment": "You beautiful bastard.",
                    "score": 45,
                    "author": "Palmerranian",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "/r/beetlejuicing/",
                            "score": 18,
                            "author": "ssd21345"
                        },
                        {
                            "level": 2,
                            "comment": "*Hugs*",
                            "score": 13,
                            "author": "elfboyah"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This story made me smile. ",
                    "score": 8,
                    "author": "implordofall",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Me too.",
                            "score": 11,
                            "author": "Palmerranian"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So, would the Guiness Book of Records go on some sort of... bookshelf of the gods?",
                    "score": 8,
                    "author": "AquaeyesTardis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nah, just a guy who owns the original Guinness book of World Records.",
                            "score": 2,
                            "author": "elfboyah"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don't know what this is about but I love you",
                    "score": 7,
                    "author": "RasterTragedy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; The most steps walked down by a dog facing forwards while balancing a 141 g (5 oz) glass of water is 10, achieved by Sweet Pea, an Australian Shepherd/Border Collie owned by Alex Rothacker (USA), at the Sport und Schau Show, Verden, Germany, on 05 January 2008.\n\nOh my, I missed the \"steps walked down\"... That makes my story invalid. Nooooooooo!",
                            "score": 8,
                            "author": "elfboyah"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "High in the timber-shrouded hights of the Guinness Crags a light snow fell. A crescent moon shone through the clouds like the Great Lightstick of old. All was silent; all was dark; all was deathly cold.\n\nIn a quaint stick hut nestled in a dell upon the mountain-side song and laughter hid from the cold in the light of a crackling fire. Many people danced and made merry in a circle around the old shaman Arthur as he spoke in an alien tongue.\n\nAt length the man of the book held up his hands. \"Stop!\" he cried. \"The consecration of the altar is complete. Let us begin.\"\n\nWith that they went to the table and began their work. Its surface was smooth and dark; many twisting wires wound like snakes from a protrusion on its back. Red, green, and yellow, they seemed color-coded for some forgotten purpose. Sparks still danced upon them during snowstorms.\n\nUpon the table's top they laid sheets of prepared wood-pulp. With sharp stone knives they cut, with sure hands they folded; a slice here, a crease here. With strings of animal gut they tethered the sheets together.\n\nThe storm outside grew louder, the winds harsher. Grim thunder sounded forth from the sky. The sparks danced along the wires of the table. Many of the coven were struck down by the wrath of the angry Gods. A hard glint appeared in Arthur's eyes, and he began to chant again. Of fire and water he sang, of earth and wind he told. He spoke of sorrow, and joy, and days passed away.\n\nThe shaman reached the end of his song. \"Step back!\" he cried. When the table was clear, he gently lifted the frail dart shape with both hands. He looked at the Book of Guinness upon the mantelpiece and gestured. \"There it is, my friends,\" he told his followers. \"The greatest 'paper airplane' that ever the Gods made.\"\n\nConstructive criticism much appreciated!",
            "score": 14,
            "author": "BrutusTheQuilt"
        },
        {
            "level": 0,
            "comment": "\"Lettuce Jim prays Tim Book of Holy Harp\" cried Longest Beard, addressing the congregation; \"Chronicles of Tallest, Smallest, Nails Longest and Tim Strongest!\" \n\n\"Prays.\" Answered the congregation.\n\n\"Annuals of Tim Fastest, Tim First, and Tim what been on Tims moon\";\n\n\"Prays.\"\n\n\"Lettuce jim tanks tim Insane Bolt, fastest tim run 100 Ems. Ancient Measurement of Timlympics.\"\n\n\"Tanks\"\n\n\"Lettuce jim tanks tim Felix and tim Roger, tim arm strong and tim Furman, For who tim greatest if not tim Fur man. Seeker of tim many Records.\"\n\n\"Jim tanks!\" answered Longest Beards flock; \"Tim Fur man!\"\n\n\"We jimmum tim Sacrifices in tim honor, in tim memory and tim name. Woah, tim Children of tim Red Bull, Heathers! Wingless Liars! Guinness saves but does not travel well! \\*Ptoo\\*\" Longest Beard spat on the 3 sacrifices. They were tied up and bound together. Heads bowed low, they were frightened.\n\n\"Travel well!\" Cried the congregation. \"\\*Ptoo, Ptoo, Ptoo\"\n\n\"Record!\", yelled Longest Beard \"For this tim is biggest sacrifice tims memory. Record! Tim biggest sacrifice ever.\" The congregation cheered, they tossed their hoods into the air above their heads and danced the dosey-doe among themselves. The sacrifices shuddered.\n\n\"Orden! Orden!\" cried Longest Beard \"Now is tim winter of tims discontentment.\"\n\nThe congregation blinked.\n\n\"Strongest Arm step forren.\" Longest Beard beckoned forth one of his congregation. The burly mutant Strongest Arm. The Rads had given him great strength but only in his right side, his left was withered and malnourished.\n\nHis left arm hung weekly by his side, while his right, bulging and muscular, tipped him over to one side. He was still very strong however. He could chop Lampposts down with one hand and he once through a stone across the great Black river to the other side. \n\n\"Aye Longest Beard,\" Strongest Arm grinned a toothy grin, whenever he did so his ears would flap out. Strongest Arm was very ugly even by mutant standards.\n\n\"You may have tim honour of tim sacrifice. May tim blessing of tim Holy Harp keep you in record.\" Longest beard then made the symbol of the harp across Strongest Arm and took a step back towards the congregation.\n\nStrongest Arm paused and examined the sacrifices. They cowered before him. One of them was crying and had pee'd all over his robes. One said nothing, merely eye balling the balding mutant and Longest Beard.\n\nStrongest Arm grabbed the crying one in his big oversized hand and raised him into the air by his head. He giggled stupidly as he crushed the mans skull in his hand. The congregation cheered. Longest Beard, raised his hands in exaltation.\n\nThe body fell to the floor, still writhing. Strongest Arm wiped his hand on his robes and took a step towards the next sacrifice.\n\n\"STOP TIM SACRIFICE\" There were sounds of surprise in the crowd as one from the back kicked and pushed his way to the front. \n\n\"What is tims meaning of this?\" cried Longest Beard.\n\nThe one who had stepped forward was Fastest Feet, a young whipper snapper, he had always protested the need for sacrifices. He was always the fastest runner in the tribe. On sports days he would always win the egg and spoon race. \n\n\"Stop.. tim.. sacrifice..\" Fastest Feet stammered, out of breath.\n\n\"Yes we heard that,\" Said Longest Beard,\"We want to know why.\"\n\n\"I found it Longest Beard Old Father, I found it I did,\"\n\n\"You found what?\" \n\n\"The map Old Father, the map to the Guinness Factuary.\"\n\n\"You found the.. Map?!\" Longest Beard quite rightly amazed nearly pulled his beard off in surprise. He had spent his whole life looking for knowledge about the Factuary of legend. The place where all Guinness records began. \"Holy Harp! Show it to me boy, show it to me now.\"\n\nFastest Feet reached into the front pouch of his robe. He pulled out the map, it was an old Dublin City Bus Tours map from the before the Bombs. It had been preserved in the memory box of a family in Cork. Where it remained undisturbed for almost a hundred years until  it was discovered by Fastest Feet as he was scavenging the rubbles of yesteryear. \n\nLongest Beard snatched it from the boys hand. Excited he hurried over to the light of the nearby torches and examined the map. \"Yes.. This is really real. Tims map. Tims map to tims factuary. Tims source.\" His eyes gleamed in the dull light of the cave.\n\n\"Very well. We tanks you Fastest Feet. You have Shirley done us a great service.\" Said Longest Beard raising the map above his head and addressing the congregation. \"This is tim map of tim holy harp, tim map of tim myth and legend. Now we can proven once and for all to tim Children of tim Red Bull, that tim Guinness is tim one true Fact Recorden.\"\n\nThere were oohs and aahs from the congregation. The sacrifices looked on. One of them, eye balling one from earlier stood up.\n\n\"Ye Blasphemers, Ye can ne'er proven nothing. The Bull knows all truth. Ye are but charlatans and additives. Takers away from the truth of our cans.\"\n\n\"-Strongest Arm will you?\" Nodded Longest Beard, Stongest Arm stepped forward and grabbed the Blasphemer by the head raising him into the air. He screamed.\n\n\"No..!\" protested Fastest Feet,\" Perhaps they can be saved!\"\n\n\"What?\" cried Longest Beard, incredulous,\" Impossible, no child has ever renounced their phoney Red Bull.  Not even when submitted to all tim facts contained in the Books of Records. They still yet deny tim harp.\"\n\n\"But if they see that tim Factuary is real. Once they see how all of these were made.\" Fastest Feet addressed the alter at the back of the cave. Arranged in order of year issued were twenty three unique copies of the Guinness Book of World records. The earliest dating back to 1977. \"They will have to believe. I propose we take these two with us to far off Dub Lin to tim Factuary. Where they will seen proof of tim Holy Harps. Then they will have to believe.\" \n\nLongest Beard thought about that for a while. \"Very well, what say you blasphemer? If we bring you and your kind to tim great factuary will you heed our righteousness and support tim holy harp?\" \n\nStill held up by Strongest Arm in the air the Blasphemer kicked and punched the air around him. \n\n\"Never, I will never convert, you heathens will but in hell for your blasphemy whilst my people will sprout wings and fly-ighs-ahh-ahh!\" He never got to finish his curse, one of his flailing kicks landed on Strongest Arms nose. That was the end of him.\n\n\"You see Fastest Feet, these people will never convert. They are too deluded. Come Strongest Arm, finish of tim last sacrifice that we may prepare tims great journey.\"\n\n\"Sacrific-\"\n\n\"Nooo!\" Cried the last sacrifice; \"I will come, I will see your factuary. If it does indeed convince me then i will Shirley convert.\"\n\nLongest Beards eyes gleamed in the dark. He grinned, \"Very well.. but first a sacrifice.\"\n\n&amp;#x200B;\n\n&amp;#x200B;",
            "score": 2,
            "author": "stormy-da-mules"
        }
    ]
}