{
    "id": "13fwv8r",
    "score": 109,
    "title": "My parents are unaware that something else has been living in their house",
    "author": "ThrowAwaytheCJ",
    "date": 1683925044.0,
    "url": "https://www.reddit.com/r/nosleep/comments/13fwv8r",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/user/ThrowAwaytheCJ)"
    ],
    "postText": "Honestly, I was relieved I had accumulated so much vacation time that when my parents asked me to watch the dogs for them while they went on vacation, it was a non-issue. I took a week off and still had enough vacation time saved up to take 5 weeks off. My parents were going to Tampa Bay, a vacation that they desperately needed to save their unstable marriage. \n\nComing back to the house I grew up was always surreal mix of comfort and depression. Nostalgia usually is like that. I was greeted by our two family dogs, Sadie- our chubby Mastiff, and Roxie, our hyper Bernese Mountain Dog. They both eagerly jumped at me and I wrangled them up with love. It had been at least a year since I had stayed overnight since I'd moved out. \n\nI decided I'd embrace the fact I was technically on vacation, so feeding the girls their dinner, I cracked open a bottle of Soju and went to town on it. I was on vacation, but most of my coworkers at my construction site would drink heavier on a work night. \n\nMy brother was supposed to drop by periodically during the week. His shifts were later and his fiancé was a handful. I was accustomed to handling the responsibility of taking care of family alone. \n\n&amp;#x200B;\n\nThough after a few nights, I kinda wish I wasn't the only one staying overnight.\n\n&amp;#x200B;\n\nI got a text from my dad as I went to grab another drink, eager to indulge myself further:\n\n*Not sure if mom mentioned it to u, but sometimes the girls will go crazy at night...probably something outside but they calm down fast enjoy urself kiddo.*  \n\nI forgotten how old-school my dad was. I'm pretty sure I was 15 when I last typed \"u\" or \"ur\" non-ironically. I was surprised he bothered to text, usually it was mom.\n\nThe text didn't register much to me. I knew the girls barked at almost anything outside- it was our version of home security alarms! I threw on a show, and cuddled with the pups. I caught myself dozing off a few times before I drunkenly decided to call it a night. I locked up the doors, and quickly tucked myself into bed before Sadie and her heftiness hogged the centre of the bed. The two quickly hopped on the bed and we fell asleep without issue.\n\nThe next morning, I heard Roxie get up and start growling in the hallway. I was more annoyed to be dragged out of bed on vacation, but this was part of the responsibility. The growling persisted, and Sadie joined her.\n\nWith the two growling down the hallway, I lumbered out of my parent's luxurious bed. Wiping my eyes, I saw they were fixated at something on the floor. I ushered them out of the way to peep at it. I was confused.\n\nIt looked like several dust-bunnies clumped up, but they smelt kinda bad. Some clumps of mold were also present, but I know mold doesn't smell like that, does it? I looked around the house trying to deduce where it had come from. I looked up, seeing the attic entrance closed. I never had seen it open in my life. I think my parents said it was just a crawl space so that people could fix the roof from the inside. \n\nWeirded out, I cleaned it up and disposed of it. The rest of the morning was relaxing. My brother popped in briefly to complain about his fiancé, then went to work. The girls were happy to see him for the hour that he had popped by. I occupied the remainder of the day by gaming, working out downstairs, and walking the dogs. \n\nIt was around 7pm, and with the dogs fed earlier, I decided I wanted a slurpee. The 7-Eleven by my place was timeless, and I swear their quality was superior to any other location. I took a quick walk to it and back, and that's when I noticed something strange.\n\nOn the narrow side of the house, there looked to be a dark spot in the shingles. I took a borderline brain-freezing sip of my slurpee and investigated. I could hear the dogs barking from inside the house, I imagine they were happy to see me, or maybe smell me from where I was. \n\nIt was a hole. We had a hole in the roof. It was about two or three feet wide. I rolled my eyes, I didn't want goddamn raccoons or any other rodent waltzing into my abode. I texted both my parents about it, and got nothing. At least it wasn't supposed to rain in the forecast. \n\nI hopped inside the house, played some games and before long it was time to go to bed. I looked at the clock, just before midnight. I followed the same routine tucking myself in and fell asleep with the girls pretty quickly.\n\nIt was 2:42am when Roxie and Sadie both started to grumble. It woke me up, and I told em to stop it. I sat up, curious if there was anything outside they'd be barking at. I heard a van coming around the crescent, but that's nothing new. \n\nI heard thudding above me just before I dozed back off. I thought to myself it was the upstairs neighbours. \n\nThen I realized I wasn't in my apartment. \n\nThe girls started barking like crazy, and I quickly tried to hush them, but they were persistent. The thudding sound persisted from above our bedroom, to the other end of the house. It sounded somewhat heavy. I got the girls to stay in the bedroom while I fetched my dad's trophy bat from the closet and investigate.\n\nI flicked on the lights around the house, something I used to do as a kid when I was afraid of the dark and couldn't sleep. I didn't think about the nostalgia this time. That was 6 year old me, not 27 year old me. The noises halted when I shakily went to the other end of the house. The girls were still barking like crazy in the bedroom. \n\nWhatever was above us, it was in the attic. It began moving again, back the way it came. I pursued it, tapping the ceiling with the bat and yelling at it. I realized I didn't have my cellphone in hand to call anyone, the police nor my brother. Reaching for the landline meant I'd have to divert from this thing's path. It moved pretty slowly, and where the thuds would occur were far apart. It was clearly large enough that it needed to crawl in large strides through the attic. \n\nWhen it connected with the attic's entrance, it knocked it open. Dust and mold spilled onto the floor, and that same smell from this morning was there, but worse. I froze, gripping the bat so hard I could've given myself splinters. I yelled at it some more, hoping it'd piss off, or show itself to be a fat raccoon or something. \n\nA bony arm reached out desperately to close it. There was no ladder attached, folks would have to access it with a step ladder from the hallway. It had a skin tone similar to mine, but its skin looked tightly wrapped around its arm. The claws on it were at least 4 inches long. I mustered up some courage and swung at it. \n\nI must've hit it pretty damn good, or it was brittle, because one of its claws broke off and dropped to the floor. It shrieked, like a horrifying mix of animals and people all at once. I looked up at it, and from the light in the hallway I could see it was a long, lanky figure with red eyes and what looked almost like a horse's mane that tapered off of the top of its body. \n\nIt didn't bother with the attic door anymore, it just kept moving. Moving towards the bedroom.  I used the bat to shut the attic door and quickly made my way there.\n\n The girls were freaking out, and went I went inside the bedroom with them. I put the bat on the bed and instinctually hugged both of them.  The thing had reached above the bedroom, I could hear it crawling in seemingly a circle. It kept hitting the ceiling harder and harder. \n\n\"Enough!\" I finally screamed at it. Picking the bat up, and pumping the ceiling with it, hoping to deter it.\n\n\"Enough!\"  I heard, but in a voice that sounded eerily similar to mine.\n\n\"Enough!\" This time in my dad's voice. \n\n\"Enough!\" In my mom's voice.\n\nMy blood turned to ice. I frantically looked for places to hide,  but what could I do with the girls going crazy? Their hackles were up, and now they were snarling, baring teeth, going more apeshit than I'd ever see them before. \n\nI thought about it, it'd be a horrendous risk, but would Sadie and Roxie be able to tear this thing to shreds?\n\nI didn't have to worry for much longer. I heard it leap out of the hole in the roof and scurry off. It sounded like whimpering- specifically Sadie's whimpering. Where would this thing even go? There's a national park about a half-hour walk, it's the closest wild environment to my parent's place?\n\nI'm surprised that I fell asleep that night. I woke up in a panic, but I saw the sun was up. Sadie and Roxie were extra cuddly and affectionate that morning. \n\nBesides calling someone to patch the roof, I'm not sure what to do. It knows where we live, and from the sounds of things, it looks like it's been around while my parents were here, too. It knows my face. I called the police that morning, as I still had the claw with me. \n\nMy brother won't be around, and I'm not sure I want ANYONE near this thing. I can't stick the girls in the apartment, since there's a no pet policy in place. My parents come back in five days. The roofers come in two days. With everything that's happened, I'm expecting it to come back. \n\nBecause deep down, I don't think IT was scared.\n\n[I think it was warning me.](https://www.reddit.com/user/ThrowAwaytheCJ)",
    "comments": [
        {
            "level": 0,
            "comment": "Ooh, one of those creatures I've heard about who mimic the voices of people you know so they can lure you into the woods. Please wait for the police and do not stay overnight in that house again. I hope you can find somewhere safe for you and the dogs. \n\nAlso, just a minor typo:\n\n&gt;and went I went inside",
            "score": 17,
            "author": "amesann"
        },
        {
            "level": 0,
            "comment": "They are aware of it.  That’s why your dad warned you. \n\nGo to a pet friendly hotel tonight GTF outta there!!!",
            "score": 9,
            "author": "No_Entrepreneur9939",
            "replies": [
                {
                    "level": 1,
                    "comment": "didn't think of the pet friendly hotel, there! Not a bad plan.",
                    "score": 5,
                    "author": "ThrowAwaytheCJ",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hope you found somewhere safe. Worried about you and the puppies!!!",
                            "score": 3,
                            "author": "No_Entrepreneur9939"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree with the above comment, get out of there asap and take the dogs with you. A pet friendly hotel is just the right thing! Please keep us posted!",
            "score": 6,
            "author": "HoneyMCMLXXIII"
        },
        {
            "level": 0,
            "comment": "Oh hell no. Oh HEEEEEELLLL no.\n\nCall priests, shamans, everyone you can get your hands on. That thing needs to be warded off.",
            "score": 2,
            "author": "CoffeeBeanx3"
        },
        {
            "level": 0,
            "comment": "If it can be hurt it can be killed, from what you said it sounds pretty slow so with enough firepower you should be able to bring it down if you stay in open spaces incase you need to run from it. Search your parent's house for a gun.\n\nAlso aim for the eyeballs or limbs and dont forget you can crouch",
            "score": 1,
            "author": "D1DPR"
        },
        {
            "level": 0,
            "comment": "when was the last time you saw your parents in person? try giving your dad a call the next time you hear that thing in the attic. you didn’t see them when you got there, it can mimic voices, and your dad doesn’t usually text but did this time? i’m wondering if that thing can work a phone",
            "score": 1,
            "author": "kaizokuseb"
        }
    ]
}