{
    "id": "13g1f8t",
    "score": 213,
    "title": "We created a device that let us see God - I'm so sorry about everything that's happened since.",
    "author": "twocantherapper",
    "date": 1683936085.0,
    "url": "https://www.reddit.com/r/nosleep/comments/13g1f8t",
    "media_urls": [],
    "other_urls": [],
    "postText": "It's been 23 years since the incident, and I can't keep living with the guilt. I need to confess. In 1999, we - a group of scientists and engineers at IPSET - created a device that we dubbed the Nietzsche Box. It was supposed to be the ultimate invention, the one that would change the world forever. And it did, but not in the way we intended.\n\nThe Nietzsche Box was designed to allow us to communicate with and see God. \n\nYes, that's right - God. The head honcho. The divine creator of the Universe (or as close as there is to one at least, the theophysics of it get a bit iffy once you boil it down to formulas and hard numbers).\n\nIn the Biblical sense layman's terms though? God.\n\nAs one of the lead scientists on the Nietzsche Box project, I can attest to the fact that it was unlike anything we had ever worked on before. As soon as we figured out what the designs were for, my team worked with a tenacity I don't think I'd seen in my almost thirty prior years of employment. Hell, even I had a fire under my ass.\n\nBramfield had his own reasons for fast-tracking the project I'm sure, but none of us really cared what they were (did we ever?). We were all driven by a deep-seated desire to make a difference in the world, to leave our mark on history. And we believed that the Nietzsche Box was the key to achieving that goal.\n\nBut as we delved deeper into the project, things began to take a dark turn. Our research was based on designs from a small, red book called \"The Children Are Bleeding (A Housewife's Tale),\" which had been discovered by IPSET Director Bramfield who only knows where. He was obsessed with that damn book, convinced that it contained the key to unlocking some sort of great power or preventing some kind of apocalyptic tragedy. \n\nA team with clearance levels far above my own gleamed the designs for what we'd later dub the Nietzsche Box after several years of fruitless studying. I heard through the grapevine that Bramfield actually wept with joy when he had the transcribed pages thrust in front of him by a shaking and bloodsoaked research assistant. The designs were faxed from London to the Marathon County Facility immediately, and those lazy assholes in London NEVER did things immediately. \n\nAnd so, at Director Bramfield's personal insistence, my team began to study The Children Are Bleeding - and the designs inside for the Nietzsche Box - in earnest.\n\nWell, I say we studied the book, but that's not entirely accurate. We had photocopies. Despite the majesty of our task, we were still a low-level team. We weren't allowed access to the original text of course. Not that I ever wanted to read the real thing, you understand. I heard in the breakroom that at least a dozen Paranatural Literary Event Researchers had snuffed it just to get the few pages IPSET deciphered.\n\nThe pages of the book around the designs filled with bizarre and disturbing illustrations, and the text was written in a language that none of us could understand. But we persisted, driven by the promise of greatness that we believed lay within the schematics. We spent months pouring over those maddening blueprints, translating the text and deciphering the diagrams. And finally, after almost a year, we had our breakthrough.\n\nThe Nietzsche Box was born.\n\nThe box itself was made of a deep, dark wood, with intricate carvings covering its surface. As per the instructions in the almost-certainly-heretical The Children Are Bleeding, the carvings on the Nietzsche Box depicted scenes from various religious texts, ranging from the Garden of Eden to the Crucifixion of Jesus Christ.\n\nThe device was powered by a series of gears and cogs, each one carefully crafted from rare and exotic materials. Some of the cogs were made from the carved bones of saints, imbuing the device with a holy power that was believed to be necessary for communicating with God.\n\nThe wiring was made of copper, but it was not just any copper. The copper was threaded with the hair of Mary Magdalene, believed to be one of the closest followers of Jesus Christ. This hair was said to have been imbued with a special power, one that would help to channel the energies of the universe into the Nietzsche Box.\n\nThe device was also equipped with a series of lenses, each one made from a different type of crystal. These crystals were believed to have special properties that would help to amplify the power of the Nietzsche Box and allow us to see God.\n\nThe Nietzsche Box was the result of years of experimentation, with each part carefully selected and crafted to fit together seamlessly. It was a device that was believed to be the key to unlocking the mysteries of the universe, and it was created with the utmost care and attention to detail.\n\nI remember the first time I looked at it complete once the final components were in place. As I stood there, gazing at the intricate machinery of the Nietzsche Box, my mind couldn't help but wander to the artefacts that powered it. I knew that Director Bramfield had a reputation for acquiring rare and exotic materials at any cost, but the origins of these particular components were shrouded in mystery.\n\nI couldn't help but wonder where he had obtained the bones of saints and the hair of Mary Magdalene. These were not items that one could simply find for sale on the open market. And yet, there had been no delay in acquiring them.\n\nMy stomach turned at the thought of what atrocities IPSET might have committed in order to obtain these artefacts. I tried not to dwell on it - and still do - but the nagging feeling of unease would not leave me.\n\nI knew that our work on the Nietzsche Box was groundbreaking, but at what cost? Was the pursuit of knowledge worth the moral compromises we had made along the way? These were questions that I could not answer, and they weighed heavily on my conscience.\n\nThe Nietzsche Box was a powerful tool, but it was also a reminder of the darkness that lurked within the human soul - a darkness the entire team had to try and pretend our work brought us far closer to than the average Jane and Joe on the street. That's probably why we all became so personally invested, I think. It was a chance of redemption.\n\nAs we learned all too well, even the most carefully crafted inventions with the most well-placed of intentions can have unintended consequences. The Nietzsche Box was no exception. We knew we were playing with a fire far hotter than anything mundane science could hope to match - this was pretty par for the course in our line of work - but we could never have predicted the catastrophic outcome of our experiment.\n \nOn the day of the test, we were all nervous. We had no idea what to expect. \n\nAs the switch was flipped and the Nietzsche Box hummed to life, a palpable tension filled the air. It was as if the room itself was holding its breath, waiting for something to happen. And then, suddenly, the energy hit us like a tidal wave.\n\nIt started as a low rumble, like distant thunder, but quickly built into a roaring crescendo. The air crackled with electricity, sending shivers down our spines. It was like standing in the middle of a lightning storm, but instead of fear, there was an overwhelming sense of awe.\n\nThe energy seemed to take on a life of its own, pulsing and shifting around us like a living thing. It was as if we were standing at the centre of a hurricane, surrounded by a maelstrom of raw power.\n\nBut even that comparison falls short. The energy was something beyond our understanding, something truly otherworldly. It was like trying to describe a colour that doesn't exist, or a sound that can't be heard. Thinking about it or trying to unravel it for longer than a single second caused an instant migraine to flash across my vision, and over the ringing in my ears I could hear several hardened IPSET researchers sobbing.\n\nAll we could do was stand there, transfixed, as the energy washed over us. It was a physical sensation, like a weight pressing down on our chests, but also an emotional one, filling us with a sense of wonder and amazement.\n\nAnd then, in the midst of all that power and chaos, we saw it. We saw God. It was like a bolt of lightning, illuminating everything around us with a blinding light. A moment of pure transcendence, a glimpse into something beyond understanding that anything or anyone should have. \n\nLooking upon it was like being touched by every particle in the universe all at once. The majesty of this being we'd summoned was all-encompassing. In its presence all sense of self washed away. I became nothing but pure subjugation - every fibre of my being dedicated to my reverence of this reality-emitting presence and my shame that I had the audacity to exist in the same universe as something so perfect.\n\nTo this day I cannot - no, WILL not - describe it visually. Despite what happened I can still remember enduring those moments of perpetual oneness with whatever underpinned the tapestry of reality. I refuse to muddy those memories by attempting to contextualise them with something as feeble and pathetic as worms.\n\nEven if things hadn't gone further south than anyone ever could have predicted, all present were changed by that experience, in ways that we could never have hoped to fully articulate. The energy had touched us in a way that was both profound and indescribable, leaving us with a sense of awe and reverence that would have stayed with us for the rest of our lives.\n\nI'm sure I don't have to tell you, but we were all in shock, staring in awe at the being before us. Some people were shaking, others sobbing, a single gunshot from behind let me know it had already become too much for one of the security personnel.\n\nThat's when everything really fucked up.\n\nSomeone tripped and knocked over a cable, or a powercell, or CPU Tower, causing a surge of esoteric energy to flow into the Nietzsche Box. The switch was instant. God began to convulse and writhe in pain. Its form that I will not describe lashed out, smashing into the walls and sending debris flying. The air became thick and heavy, and the room began to shake.\n\nAnd then, God exploded.\n\nThe force of the blast was overwhelming. The air was filled with a second blinding light, although this one didn't come with an unending sense of belonging. The sound was deafening too, a roaring that sucked any hope of silence from my tinnitus-addled ears from that day onward. We were thrown to the ground, and everything went black.\n\nAs we slowly regained consciousness and stumbled to our feet, we realised that something was different. The energy - the tear-inducing presence of infinite calm and acceptance - that had filled the room moments before was gone, replaced by a crushing emptiness.\n\nThe feeling of awe that had overwhelmed us had given way to a sense of despair and hopelessness, a burden so heavy that even the denizens of the deepest circles of Hell wouldn't be laden with it for their sins. It was as if a piece of our very souls had been torn away, leaving us hollow and broken.\n\nThe air was thick with the acrid smell of smoke and burning metal. The room was in shambles, and debris was scattered everywhere. So were some of the researchers. The once-beautiful Nietzsche Box lay shattered on the ground, its intricate machinery twisted and destroyed beyond recognition.\n\nAnd in the centre of the room was the source of our despair - and the evidence of the greatest crime against existence ever committed. God, the being we had seen only moments before, was now nothing but a smouldering pile of rubble. Its divine and repugnant-to-attempt-to-describe form, once so majestic as to render stars cold with its shadow, now lay lifeless and broken.\n\nAs we stood there, frozen in fear and disbelief, the remains of God began to crumble away into nothingness. At first, it was just a small trickle of dust and ash, but soon it became a torrent, as if the very essence of the entity was being sucked away into some unknown void.\n\nThe howling sound grew louder, filling the room with a deafening cacophony that made my ears ache. Nothing earthly could have made that sound - a piercing shriek that seemed to be tearing apart the very fabric of reality itself. Given the source and circumstance, I am utterly convinced it's a sound nothing was ever supposed to hear, mortal or otherwise.\n\nAs the last remnants of God dissipated into the air, the howling gradually subsided, leaving us in a stunned silence. The room was now completely destroyed, and the stench of smoke and burning metal was almost suffocating. We had to evacuate, but the sense that we'd rather the building came down around us to punish us for our misdeed was palpable. Never before has a stampede to safety shuffled so slowly. I bet Bramfield had a chuckle to himself about that when he reviewed the footage, the bastard.\n\nMy heart was pounding in my chest, and my hands were shaking uncontrollably. It was as if my body was trying to purge itself of the fear and revulsion at what we'd achieved that had taken hold of me.\n\nIt was a moment of profound loss, the kind that leaves a permanent mark on your core being, that little part of you that feels the emotions and hears the thoughts etc. The you that is you, and the me that is mine was damaged forevermore. The feeling of awe that had filled us before, and the normalcy and blissful ignorance in the time before we turned on the Nietzsche Box, was now replaced by a deep and abiding sadness. \n\nWe had witnessed and caused the death of something sacred and irreplaceable. Perhaps the most sacred and irreplaceable thing there is in all of creation. We had committed a crime on a cosmic scale, one which nobody on Earth (besides maybe that bastard Bramfield) could ever hope to understand. The only reason I personally haven't ended it all is I feel I owe suffering in this world before I rightly suffer for an eternity in the next. What we did was... it was the worst thing. I mean that in a very definite sense.\n\nAs we stumbled out of the ruined room, we knew that nothing would ever be the same. The energy that had filled us before, the energy that had shown us the utmost limits of what it is to experience being, was gone forever. In its place was a void, a deep emptiness beyond the comprehension of the sane, filled only by a shame too profound to quantify.\n \nThe energy killed God. We had killed God.\n\nAll of us handed in our resignations immediately. The entire department shut down. We had just witnessed the death of the Almighty. Not just that, we had CAUSED the death of it. We did go try to fix the Nietzsche Box beforehand of course, but it was too late. God was gone, and we were left with a world that was forever changed.\n\nFor years, I tried to rationalise what we had done. I told myself that we were just trying to do what was right. But I can't live with the guilt anymore. I need to confess. I killed God, and it's my fault that the world is the way it is today.\n\nAs the decades have passed, the weight of what we had done only grew heavier. I couldn't help but see the effects of our actions everywhere I looked. It was as if every tragedy that occurred in the world since the year 2000 was somehow connected to our tampering with the Nietzsche Box.\n\nI remember watching the news in horror as the Twin Towers fell on September 11, 2001. At the time, I couldn't comprehend the scale of what had happened. But as the days passed, and the full extent of the devastation became clear, I couldn't shake the feeling that somehow, we were to blame.\n\nThe wars that followed only deepened my sense of guilt. The images of soldiers fighting and dying in far-off lands, of families torn apart by violence, haunted me. I couldn't help but wonder, would any of this have happened if we hadn't killed God?\n\nNatural disasters only added to my despair. The 2004 Indian Ocean earthquake and tsunami, Hurricane Katrina in 2005, the 2010 Haiti earthquake... Each time, I found myself asking the same question: was this punishment for what we had done?\n\nAnd then, of course, there was the pandemic. As the world ground to a halt in 2020, I couldn't help but feel that this was the ultimate consequence of our actions. We had upset the balance of the universe, and now we were paying the price.\n\nAs the years went by, my guilt only grew more unbearable. I tried to talk to others about it, but no one else seemed to understand. That's back when those researchers still alive returned my calls, of course, and they haven't done THAT in over fifteen years. They couldn't see the connections that I saw, the cause and effect that linked our actions with the tragedies of the world.\n\nAnd so, I retreated into myself, consumed by my guilt and my shame. I couldn't bear to face the world anymore, not when I knew what we had done.\n\nBut now, in 2023, I realise that I can't keep this to myself any longer. I need to confess what we did, to try and make amends for the damage we caused. I don't know if it will make a difference, but I have to try.\n\nI only hope that someday, somehow, IPSET can find a way to reverse what our team did over two decades ago with the Nietzsche Box, to make it right again. I'm doubtful though. Part of me thinks this was Bramfield's plan all along. Why else would be not be present for the inaugural switch-on of the Nietzsche Box after being so heavily invested in its development? Whatever happens, I will carry the weight of my guilt with me, a reminder of the terrible mistake we made when we killed God.",
    "comments": [
        {
            "level": 0,
            "comment": "Some advice: Make a Nietzsche Box for the devil. If God is, or more acurately was, real, and now he's dead, chances are high that the devil exists too, along with hell. And, to be honest, I'd rather not end up down there. You want to make up for killing God? Kill the devil, this time on purpose.",
            "score": 68,
            "author": "ProfKlekowskii",
            "replies": [
                {
                    "level": 1,
                    "comment": "im not sure about that since the good side of the universe is already gone which is god the world becomes imbalance and maybe uf you kill the devil the world will be no more since evil is necesarry for balance i think.",
                    "score": 8,
                    "author": "Gedqres"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh my God, they killed God! You bastards!",
            "score": 13,
            "author": "LeXRTG"
        },
        {
            "level": 0,
            "comment": "I would blame the guy that tripped but that’s just me I guess🤷🏼‍♀️",
            "score": 9,
            "author": "leah_paigelowery"
        },
        {
            "level": 0,
            "comment": "Poor worms, they're trying their best 😥",
            "score": 10,
            "author": "sixninefortytwo"
        },
        {
            "level": 0,
            "comment": "Holy shit, I thought we’d seen the last of Bramfield, as well as The Children are Bleeding (A Housewife’s Tale).",
            "score": 18,
            "author": "Tandjame",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 8,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 10,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 5,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Huh. Died pretty easily.\n\nAlso, nobody there seemed like they were doing science. lol\n\nJust sounds like culty shenanigans.",
            "score": 5,
            "author": "LARGames"
        },
        {
            "level": 0,
            "comment": "Ngl shouldnt have gone with the holy stuff for making the box,id like it alot more if there was more of a sci fi aspect, pure science",
            "score": 2,
            "author": "hotpuff1234"
        }
    ]
}