{
    "id": "13gqvhm",
    "score": 53,
    "title": "I Was The Victim Of A Back Alley Brain Surgery. One Of The Surgeons Was A Brain.",
    "author": "A_Vespertine",
    "date": 1684007257.0,
    "url": "https://www.reddit.com/r/nosleep/comments/13gqvhm",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/TheVespersBell/)",
        "https://www.reddit.com/r/Odd_directions/)",
        "https://www.reddit.com/r/TheCrypticCompendium/)."
    ],
    "postText": "The first thing I saw when I opened my eyes was the bright glare of an overhead lamp. After a few seconds of dull confusion, panic set in when I realized I couldn’t possibly be in my own bed. I tried to jolt upwards, but found that my body was completely paralyzed. I couldn’t speak or scream or even voluntarily control my own breathing.\n\nThe only things I could move were my eyes. As they adjusted to the bright light above me, I was just able to make out enough detail to realize that I was in an operating theatre of some kind. Had I been in an accident? I strained my simultaneously drowsy yet adrenaline-shocked brain to remember how I could have ended up here.\n\nI was just barely able to recall a slim young man with slicked black hair and blue eyes. I had been on a trip and ran into him at the hotel bar. During our conversation, he mentioned that he distilled his own whiskey with home-grown corn. It sounded intriguing, and he told me that he had a small bottle of it back in his hotel room. He said that I was free to try a glass, and if it pleased me, he could arrange for me to purchase some.\n\nHe had been charming and affable, and with his slight frame I didn’t deem him much of a threat to me personally, so I followed him back to his room.\n\nThen I felt a syringe being plunged into my back, and everything went dark before I could so much as utter a whimper in protest.\n\nSomeone repositioned the swivel light so that it wasn’t pointed directly at me, and I could see that the operating theatre was ancient, likely dating back to the turn of the twentieth century. Instead of the sterile white that would be expected in any modern medical facility, everything here was browned and yellowed and stained with time. There was wood where there should have been ceramic tiles, and cast iron where there should have been stainless steel. It was decrepit, but not quite derelict. Someone had kept the place functional, and given my present circumstances, their motives couldn’t possibly be innocent.\n\nThe tiered rows of seats that encircled me were all dimly lit, but I could tell there were figures sitting in them. I could discern no details, so they were all merely humanoid silhouettes to me. They moved only slightly, and I thought that here and there I could catch the light reflecting in their eyes, but they were a deathly quiet lot. There was no whispering, no coughing, and I couldn’t even be sure they were breathing.\n\nSqueaking wheels and the bellows of a respirator began to creep towards me, and from the periphery of my vision, I witnessed a brain in a bubbling jar slide up beside me. It was mounted on some kind of antique pedestal, with a gramophone horn, tesla coil, and all matter of steampunk-looking contraptions built into it. The oddest thing about it was that there was a bowler hat placed on top of the jar.\n\nAt least, that was the oddest thing until it spoke.\n\n“Welcome, welcome, scholars and students of forbidden gnosis and the damned sciences. *Ave Ophion Orbis Ouroboros*!” a voice boomed from the gramophone horn as the brain bobbed and flickered in a strange blue light with every syllable.\n\n“*Ave Ophion Orbis Ouroboros*!” the audience murmured in unison.\n\n“Thank you all for coming. For those that don’t know me, I am High Adderman Professor Whitaker C. Crowley of the Harrowick Chapterhouse; Preternaturalist, Parapsychologist, Crypto-anatomist, Alchemical Consultant, and – when the occasion calls for it – enthusiastic vivisectionist! For your education and entertainment, tonight I will be demonstrating the neuro-ethereal functions of the human brain with this fully paralyzed, yet fully conscious, test subject. Though he cannot move an inch to save his life, he can see, hear, and most especially feel everything that happens here tonight. Whether or not he’ll survive or be in any mental state to remember any of this when it’s over is… uncertain at best.\n\n“Of course, due to my physical limitations, I will not be performing this vivisection alone. Assisting me tonight will be Master Addermen James and Mary Darling.”\n\nThe audience began murmuring amongst themselves, the names evidently meaning more to them than they did to me. I heard footsteps crossing the wooden floor, and when they stopped, I saw the young man from earlier standing beside my bed. He wore a blood-stained leather apron over a dark Howie lab coat, his cloth mask drawing focus to his gleaming and gleeful blue eyes.\n\nBy his side stood a young woman so much like him that she could only be his sister. She had the same pitch-black hair, worn in bunches, and the same striking blue eyes that glittered with a manic psychosis. She was dressed in a red and white nurse’s uniform from a bygone era that I couldn’t quite place, and was likely just intended to look old-fashioned without actually belonging to any actual time period.\n\n“Please, please, there’s no need for concern,” Crowley said, trying to assuage the misgivings his audience apparently had with the visiting surgeons. “It’s the Darlings we have to thank for bringing us this test subject in the first place. I’d like to remind you all that the Darling Twins are fellow members of the Ophion Occult Order, and you are all to treat them with the respect that they’re due. I’m aware that they don’t technically possess any formal medical training, but their extensive self-taught knowledge of human anatomy should prove quite useful.”\n\n“I’ve always found that the difference between a butcher and a back alley surgeon was one of entrepreneurship,” James added.\n\n“That’s exactly the sort of amoral heterodoxy I like to see in my colleagues!” Crowley heartily agreed. “I do however feel the need to point out that your personal protective equipment is simultaneously inadequate and, given the circumstances, not strictly necessary.”\n\n“It’s mainly for show. I like to get into the part,” James said, holding up a pair of hands clad in old leather gloves that were surely far more unsanitary than any bare hands could ever be.\n\n“And so do I, just not as much as I like to drink and smoke,” Mary said, and I saw her raise a martini glass to her unmasked face and take a sip. “Oh, that reminds me. Professor Crowley, I’d like to apologize for you having the misfortune of witnessing me during one of my rare lapses into sobriety at our last encounter. I want to assure you that that dreadful experience was enough to knock me back off that horrible wagon and I’m proud to say that I have not been sober since.”\n\n“That’s… good information to have, I suppose,” Crowley said. “To be blunt, your cannibalistic tendencies are a far greater concern to me than your proclivity for inebriation. I trust you’re able to refrain from entering your ‘Wendigo psychosis’ when the situation calls for it?”\n\n“Wendigo psychosis? We’re not Wendigos,” Mary corrected him. “Wendigos are cursed with an insatiable hunger as a punishment for resorting to survival cannibalism, which seems a little judgmental if you ask me. The spirit cursing you couldn’t be bothered to intervene when you were starving, but once you solve your own problem it suddenly gets off its high horse just to condemn you for it? Regardless, James and I are not Wendigos. We are Randian, Nietzschean Übermenschen. We recognize our intrinsic superiority and reject morality as a means for the weak to oppress the strong. We do as we damn well please, and we find living off the flesh of our victims incredibly pleasing. If no one can stop us, then why should we stop? Also, Wendigos have antlers.”\n\n“No, they don’t,” Crowley objected.\n\n“Ah, White Wendigos do. I’m pretty sure those accounts take precedence,” Mary said.\n\n“Right. Well, random racism and self-serving philosophical butchery aside, I was referring to your propensity to strip down and wallow in your victim’s viscera as you gorge yourself on their raw flesh,” Crowley clarified. “Whatever it is you call that.”\n\n“I call it a good time,” Mary said, raising her glass in a toast before taking another tip.\n\n“You will refrain from resorting to any such debauchery tonight,” Crowley insisted. “Tonight, you’re here to work. Is that understood?”\n\n“Work? Me? Absolutely out of the question. James promised me I’d never have to work a day in my life. Isn’t that right, James Darling?”\n\n“Technically, I forbid you from working. But, you being you, took that as a very loving gesture,” James corrected her.\n\n“Hmmm. If you say so, James Darling. It’s a moot point, regardless. I don’t know what’s more ridiculous; that a pretty girl like me would ever need to work or that a drunk like me could ever hold a job.”\n\n“I think you’re being a bit hard on yourself, Mary Darling. You’ve always managed to be a spectacular homemaker in spite of, perhaps even because of, your drunkenness,” James complimented her.\n\n“Now don’t go getting all women’s lib on me, James Darling. If being a homemaker was a job, then the invisible hand of the free market would give it a salary,” she disputed. “As rational, Randian Übermenschen, we do not question the existence or wisdom of invisible hands.”\n\n“Well, you’ve got me there, Mary Darling,” James conceded.\n\n“But if you’re not here to work, then why – I mean, if you don’t mind my asking – why come at all?” Crowley demanded.\n\n“We couldn’t find a sitter, and we thought this would make a nice family outing,” Mary replied.\n\n“You… what?” Crowley asked.\n\nIt was then that I saw James smile with his eyes in the worst way possible.\n\n“Sara’s here,” he explained, waving up at the tiered seats. “Hello, Sara Darling!”\n\n“Hello, Daddy Darling! Hello, Mommy Darling!” the cheery voice of a preteen girl called out from somewhere outside my field of vision. I heard the audience react in dismay at the revelation of her presence, which was very confusing as I couldn’t fathom how a young girl’s presence could have gone unnoticed in such a setting, or why it would be a cause of such trepidation.\n\n“You brought your forsaken child into my operating theatre!” Crowley demanded, a violent outrage somehow surging through his mechanical voice.\n\n“Forsaken? How dare you! We may not be helicopter parents who oversee our daughter’s every waking moment, but we gave her everything she needed to grow into the truly magnificent abomination she’s become,” Mary said.\n\n“It’s true we don’t often take her out hunting with us, as she often prefers much more elaborate means of tormenting her prey than we do, but this isn’t a hunt,” James added. “This sort of thing is much more her style, and we thought it would be a genuinely educational experience for her.”\n\n“Educating bright young minds full of potential and advancing intellectual progress is always a valid reason for vivisecting a low-utility plodder like this,” the girl asserted.\n\n“You see how conscientious she is? Always thinking about the ethics of things,” Mary dotted. “I honestly have no idea where she gets it from, but if she says it’s morally obligatory for superior beings like us to do as we please in order to maximize overall happiness, I’m not going to argue with her.”\n\n“Is everything all right, Crowley? You’re looking more wrinkly and pickled than usual,” James said with a menacing grin that stretched out his mask. “Our Darling daughter is welcomed here, isn’t she?”\n\n“I promise I won’t be any trouble, Mr. Crowley,” the girl said sweetly. “I’ll be as quiet as a church mouse who’s terrified of what the priest will do to him if he tells his secret.”\n\nThe brain pivoted in his jar, turning back and forth between the Darling Twins and their unseen child in the audience as if he could somehow see despite his lack of eyes.\n\n“Yes. Of course, she’s welcome here. My apologies. I’m just not accustomed to having children around, but of course, your daughter is the exception,” Crowley muttered a forced and flustered apology.\n\n“She’s more than exceptional, Crowley. She’s a Darling,” James boasted proudly. “When you’re as perfect as we are, inbreeding only makes the bloodline stronger.”\n\n“I’ll defer to your considerable expertise on the matter of incest. However, I feel we’ve kept our spectators waiting long enough,” Crowley said. “Whenever you’re ready, we can begin the procedure.”\n\n“Of course, Ducky. You might have to bear with me a bit though. Usually, when James and I play doctor, I’m the patient, not the nurse,” Mary explained. “I get drugged up, stripped down, and felt up. Always a good time.”\n\n“That’s not how Daddy and I play doctor,” Sara chirped out.\n\n“Oh, Sara Darling. That’s because Daddy loves you and knows that if I ever saw you as a sexual threat, I’d kill you,” Mary replied, casually taking another sip from her martini.\n\nFor a moment there was dead silence, not a single person daring to risk interceding in this bizarre and disgusting threat between mother and child.\n\n“…You mean you’d *try* to kill me,” Sara said at last, her tone flat and cold, the juvenile joy and innocence I’d heard before now utterly absent.\n\nI may have spotted a transitory glint of fear in Mary’s eyes before she burst out laughing.\n\n“Atta girl, Sara Darling. Sometimes I forget how much we’re alike,” she said. “I’m sorry, I didn’t mean that. Mommy’s just a jealous old drunk. So long as you don’t get any older, you can be Mommy’s little monster forever.”\n\n“Don’t worry, Mommy Darling. I won’t,” the girl promised. “Puberty doesn’t sound like it’d be any fun anyway.”\n\n“That’s because you don’t have a brother to play with,” Mary chortled. “Which I suppose I should get back to. James Darling, what should I do first?”\n\n“Well Mary Darling, even though you’re not playing the patient today, I would never dare deprive you of your beloved drugs, and I think it would best if I gave them to you now before I get too occupied with the surgery,” James said.\n\n“Goodfellas?” she asked hopefully.\n\nJames nodded, and Mary eagerly outstretched her hand and allowed him to tap a few pills into her palm. She raised the pills to her mouth, but paused before swallowing.\n\n“You’re not just giving me these so that I’ll be out of your way during the surgery, are you James Darling?” she asked.\n\n“No of course not ‘just’. I’m still going to have my way with you later,” he promised.\n\n“Okay, good. I was worried there for a second,” she sighed in relief before chasing down her pills with what was left of her martini. “Mmmm. Everyone out there in the audience, a moment if I may! I may not be a real nurse, but I have a lot of first-hand experience with prescription drugs. As any reputable pharmaceutical representative will tell you, an addiction to prescription medication is a crucial component of a happy and fulfilling life. I can personally attest that amphetamines and benzos have justly earned their reputation as Mommy’s little helpers. I take Adderall when I need the mood and energy for housework, exercise, and lovemaking, Valium to help me unwind and to keep the shakes from waking me up through the night, and of course opioids whenever the booze isn’t quite enough to keep me in my happy place. Oh, and don’t pay any attention to the silly little warnings on the labels telling you not to mix them with alcohol. They pair together marvellously, though I do think I ought to sit down before this hits me any harder. James Darling, I’ll just be over here if you need me.”\n\n“You just relax, Mary Darling. I’ve got this,” James nodded as Mary stumbled off out of my sight, the sound of her collapsing and failing to land in a wooden chair following soon after.\n\nJames reached for an electric bone saw from the surgical table, and held it up high to the light to examine it. Then, turning his head down to look at me, he addressed me directly for the first time.\n\n“Hey there, buddy. How are you feeling?” he asked. “Listen, don’t feel bad about ending up on the slab here. Smarter people than you have fallen for my ploys, and I wasn’t even lying about the whiskey. I realize it’s customary to have some kind of painkiller during a procedure such as this, but as you just saw, the Missus cleaned me out. Happy wife, happy life, right? You understand, don’t you? Besides, my little girl’s up there, and nothing makes her happier than human suffering. You wouldn’t want to let her down, would you? The good news is that you’ve got plenty of paralytic pumping through your veins, and a complete lack of movement on your part is essential to reducing the risk of collateral damage. As much as this is going to hurt, you wouldn’t want me to slip, would you?”\n\nThe rotary blade began spinning, singing its distinctive whirring hum. Placing his left hand on my chest and savouring the futility of my rapid pulse, James brought his saw down upon my forehead. I felt the ragged blade tear up my flesh and mutilate my nerve endings, every rotation of the blade feeling like a fresh cut. The only thing worse than the agony was the fear, the overwhelming compulsion to escape, to fight back, to do anything, all to no avail. I was completely helpless as I stared up with fully dilated pupils at my attacker, his mask unable to conceal the demented Joker’s smile underneath as he delighted in his mayhem.\n\nMy blood splattered up into his face, but this seemed only to delight him more. I could smell my flesh and bone searing from the friction of the saw, and my skull shook rapidly against its restraints from the continuous vibration. Throughout the ordeal, I was only able to hear two things over the sound of the saw against my skull; Crowley’s dry lecturing to his students, and Sara’s delighted laughter at her father’s atrocity.\n\nWhen James had finally managed to cut through the entire circumference of my cranium, he turned the saw off and set it down on the tray beside him.\n\n“There we are Crowley; not one bit of grey matter nicked,” he said proudly as he slowly lifted off the top half of my skull to reveal my exposed brain. “And he’s still conscious! I guess he didn’t lose as much blood as it looks like.”\n\n“A successful craniectomy, and he was awake for every instant of it!” Sara exclaimed. “I could hear him screaming in my head the whole time. I’ve never felt terror that was so urgent and helpless at the same time. Thank you so much for letting me come tonight, Daddy Darling!”\n\n“You’re welcome, Sara Darling! But we’re not done yet, are we Crowley?”\n\n“Not remotely, no. Since the craniectomy went smoothly, it’s time to move on to the next phase of the procedure,” Crowley replied. “James, please insert the thaumic-electrodes in accordance with the diagram provided. Everyone, please take note that these electrodes are comprised of one hundred percent pure Seelie Silver, so their thaumaturgical conductivity is quite high. As you should all be aware, the Panpsychic force is the only direct link between the astral and physical planes, with consciousness being the only thing that exists across both realms. All preternatural phenomena are the result of focused and coherent Panpsychic force on either physical or astral reality. Now that James has all the electrodes implanted, you can see on the readout here that this brain’s thaumatological activity is nearly a flatline. Which is good, as I don’t much care for sharing my contraption here. Fortunately, these electrodes work both ways, and can channel psionic waves into as well as out of the brain. Please watch the readout carefully as James initiates electro-thaumic stimulation to the test subject.”\n\nI hadn’t felt James insert the electrodes into my brain, since the brain doesn’t possess any pain receptors, but when I saw him flick a switch on whatever machine was behind me, I was suddenly aware of thirteen cold, metallic needles piercing deep into my brain tissue. It wasn’t pain, so much as they were announcing their presence and I understood what it meant. They had a quick, rhythmic pulse to them, but the pulse wasn’t in the physical matter of my brain but rather directly in my conscious mind. This was accompanied by a sensation I can only compare to static electricity accumulating inside my head.\n\n“As anticipated, the subject is reacting to the electro-thaumic stimulation,” Crowley announced. “While a first-hand account of his experience would no doubt be illuminating, I’m highly skeptical he’d be cooperative if we reduced his paralytics. Nonetheless, we can still infer a great deal from what –”\n\n“Can the machine go any higher?” Sara asked.\n\n“It… it can,” Crowley replied hesitantly. “But that’s not relevant for tonight’s experiment. As I was saying, if we direct our attention back to the graph –”\n\n“Daddy Darling, turn the machine as high as it will go,” Sara requested. “I want to see what it will do to him!”\n\n“Absolutely out of the question!” Crowley objected. “That would jeopardize the entire –”\n\n“I wasn’t asking you! I was asking Daddy!” Sara cut him off again. “Turn the machine as high as it will go!”\n\nCrowley spun around in his jar to face James, who once again had a smile that no surgical mask could ever hide.\n\n“James, if you turn that dial so much as one notch higher, you will be in breach of our agreement and will have forfeited the second half of your payment!” he warned him.\n\n“Hmm… Mary Darling, are you following this?” he asked, turning towards where Mary collapsed some time ago. I heard her give an incoherent but affirmative-sounding response. “Crowley says he’s not going to pay up if I do as Sara Darling asks. Does this fall under my authority as a financial matter, or under yours as a family one?”\n\n“Well… I suppose I did nearly ruin our family outing with my unprovoked death threat, so we should probably do something nice to make it up to her,” she replied. “If you don’t think the money’s worth fretting over, go right ahead.”\n\n“I was never here for the money anyway,” James shrugged. “And what kind of monster would I be if I cared more about a little bit of money than my daughter’s happiness?”\n\n“James, don’t you dare – ”\n\nBefore Crowley could even finish his sentence, James spun the dial as far as it would go.\n\nThe static electricity I had felt inside my head exploded into a thunderstorm, and I felt my bones break as I spasmed uncontrollably against my restraints. Bolts and waves of the strange sensation effortlessly escaped my body and began ravaging the environment around me. Some part of me that managed to remain lucid amongst the alien agony tried to direct these forces against my captors, but I found I was utterly unable to control it in any meaningful way.\n\nThe audience had broken out into panicked screams as they desperately tried to flee the operating theatre, except of course for Sara, who I heard laughing and applauding gleefully.\n\nCrowley fired an electric arc from his tesla coil at James as he wheeled himself towards the machine behind me, but Mary had evidently been roused from her drugged stupor and attacked him from behind, stabbing a butcher’s knife through his bellows over and over until he lost all momentum and screeched to a stop. The bubbles in his jar all fell still, and he had seemingly lost the ability to speak through his horn as well, but the brain itself remained glowing and active, slamming itself against the glass in impotent rage.\n\n“What do you think will give out first, Mary Darling? The man or the machine?” James asked, acrid smoke from the overloaded machine stinging my eyes as the violent spasms threatened to tear my body apart. Before Mary could answer, the machine sparked and sputtered out, its ungodly racket dying down to a raspy whimper as the psionic assault on my mind finally came to an end.\n\n“Yay!” Sara cheered and applauded before running down to join her parents. She was still behind me and I couldn’t see her, but I heard her throw herself into her father’s arms. “Thank you, Daddy Darling! That was so much more fun than just keeping it on one. He’s never felt pain like that before, and he still didn’t die! It was marvellous!”\n\n“You’re welcome, Sara Darling,” James cooed. “Though, our subject’s surprising resilience does present us with a bit of a dilemma, doesn’t it? Mary Darling, do you think we should finish him off?”\n\n“There’s no fun in killing someone who can’t put up a fight. He’ll probably be pretty onery once the paralytics wear off, but I don’t really want to wait around for that, especially not with Crowley’s associates likely on their way,” Mary replied. “Plus, that adrenaline surge I just got is already fading and the fentanyl is kicking right back in. We ought to head home. What do you say, Sara Darling? Have you had enough fun for tonight?”\n\n“I have. Thank you for taking me with you, Mommy Darling,” she said sweetly. “And I forgive you for threatening to kill me. I know it was only because you love Daddy so much. And thank you, Mr. Crowley. I’m sorry about the damage to your theatre, but it made me very happy and I learned a lot, so it was worth it.”\n\n“In addition to the other half of my payment, you can keep the test subject as well,” James offered. “That should set as even, Crowley, don’t you think?”\n\nCrowley responded by angrily bashing himself into the glass of his jar.\n\n“Well, that’s a pity then. Let’s head out then, girls, before crotchety old Crowley gets the wind back in his bellows,” James said.\n\n“Just a minute, Daddy Darling,” Sara said, and I felt someone pulling out the electrodes from my brain and then setting my severed cranium back in place. “Thank you too, mister. I really did enjoy watching you suffer like that, and because you made me so happy, I’m going to let you walk away from this.”\n\nLooking up, I could see her bending down to kiss my forehead. She had a flawless porcelain face framed by long dark locks; a perfect, *darling* daughter that any parent would be proud of, except for her eyes. From any casual viewing distance, they could pass for being very dark brown, but when she was face to face with me, I could tell that her irises were actually filled with some sort of animate black fluid, swirling like hurricanes of obsidian storm clouds.\n\nWhen she kissed me, every broken bone and my body snapped back into place and began slowly, excruciatingly knitting themselves back together. If I could have screamed, I would have cursed the demonic little girl out for her perverse sense of mercy.\n\nPulling back, she gave me a smug smile, undoubtedly aware of how much pain she was causing me and exactly what I thought of her.\n\n“You're going to want to get out of here as soon as you can stand, before Crowley's cronies show up,” she said as she undid my restraints one by one.  \"Feel better, mister!\"\n\nSinging happily, she turned around and skipped off with her parents, the sound of their footsteps slowly receding until eventually fading altogether, leaving me and Crowley lying humiliated and defeated in the now silent and [forsaken](https://www.reddit.com/r/TheVespersBell/) [operating](https://www.reddit.com/r/Odd_directions/) [theatre](https://www.reddit.com/r/TheCrypticCompendium/).",
    "comments": [
        {
            "level": 0,
            "comment": "Wtf?   I have surgery scheduled for a knee.  This msakes me think twice!  Hope you can get your skull top back in place.  Gorilla Glue might work.  Not sure what to do for electrocusion!  You will never be the same person!",
            "score": 2,
            "author": "Shadowwolfmoon13"
        },
        {
            "level": 0,
            "comment": "Ha. What a ride.",
            "score": 1,
            "author": "Corporeal_form"
        }
    ]
}