{
    "id": "13guma2",
    "score": 84,
    "title": "The Worthless Grandson Becomes Helpful",
    "author": "SubstantialBite788",
    "date": 1684016651.0,
    "url": "https://www.reddit.com/r/nosleep/comments/13guma2",
    "media_urls": [],
    "other_urls": [],
    "postText": "The disability check wasn’t a lot, but it was enough to allow Rose’s perfectly healthy grandson, Jerry, to work part-time and spend much of his days playing video games. There was no mortgage and Jerry’s wages were enough to supplement Rose’s meager lifestyle. \n\n\r  \nRose was my neighbor. She had to be in her late seventies. She was obese and bedridden. She never changed her clothes. It was an old pink nightgown. That’s all I ever saw her wear. What I could gleam from our conversations was that she hadn’t been out of her bed in two years. She barely fit in her bed. It was small, but it had a large wrought iron headboard, unattached, and leaning against the wall. She was surrounded by several mismatched nightstands, stacked high with old paperback novels and cassette tapes. She loved to listen to the old radio shows, her favorite being Amos n Andy. Her room faced the front yard and street. She had one of the largest windows I had ever seen. It stretched from the ceiling to about an inch from the floor. The window afforded her a vision of the entire fenced-in front yard and the basketball court down the road. Often, I would catch her watching the kids play, with a smile on her face. It was her movie screen, a glimpse into the world outside her room. I offered to buy her a television, but she refused. \n\n\r  \nShe often called me on the phone for various favors. Jerry sometimes would help, but more often than not, it was up to me. She became my adopted grandmother. They even had a key made for me. I would come over and Jerry would either be asleep in his room, playing video games, or arguing with Rose. He once told me that he couldn’t wait for her to die. Jerry never mowed the lawn, so it just became a part of my routine. When I mowed my lawn, I mowed theirs. \n\n\r  \nWhat’s sad is that Jerry was about my age, in his early thirties or late twenties. He was healthy and vibrant but the guy was useless and I suspect a little abusive towards his grandmother. \r  \nOne Saturday, I was wheeling my lawn mower across to their yard when Jerry approached me. \r  \n“Hey Tom, if you’re going to cut our grass, I’d appreciate it if you didn’t cut down the Poke Salad. Rose threw a hissy fit the last time you cut em down and I had to listen to her whine all night about it.”\r  \nI was always put off by the fact that Jerry called his grandmother by her first name. \r  \n“Well Jerry, I don’t even know what Poke Salad is or looks like. If you want to avoid her pitching a fit, then why don’t you cut the grass?”\n\n\r  \n“I do cut the grass asshole. I just don’t do it every week like you do. I know you think I’m a bum. You got your fancy job and your fancy car. You like mowing and keeping up appearances. Well, there’s more to life than mowing the lawn.”\n\n\r  \n“Yeah, like taking care of your grandmother.”\n\n\r  \n“Up yours. Just don’t mow any of the plants around the fence line. I haven’t picked any in a while and she’s got a hankering for some Poke Salad. Mrs. Baily cooks it for her and I want to have some ready for next week. There’s a little batch left in the corner so leave em alone moron.” \n\n\r  \nHe then turned and walked away. \n\n\r  \nI did recall seeing him pick plants along the fence line on several occasions. When he didn’t, they grew tall and sprouted long clusters of deep blue berries attached to a bright purple stem. I remember playing with them as a kid. I never knew what they were called, but you could crush them and use the juice like ink. It was tough as hell to clean it off of your hands. I always heard they were poisonous. I didn’t know that with the right preparation it was an edible plant. \n\n\r  \nI carefully mowed the yard, making sure not to get too close to the fence line, especially in the front corner. I even stooped down and cleared the area of weeds and grass from around what I thought might be the Poke Salad. I heard a knock on the window. It was Rose and she was giving me a thumbs up and mouthed the words, “Thank You.” I nodded, grinned, and gave her a thumbs up as well.\r  \nThe following Saturday, I didn’t feel the need to cut either of our yards. My wife wanted to go the park and, in the evening, go to the movies. When we got home and out of the car, I could hear an argument from next door. I couldn’t hear the specifics but I recognized the tone of anger and hate. I was too tired to deal with it and thought that everything would work itself out. \n\n\r  \nI went to my bedroom, took off my shoes, and was about to strip down to my skivvies when the phone rang. \n\n\r  \n“Tom, its Rose. Could you come over and help me?” she asked in a weepy trembling voice. \n\n\r  \nIrritated, I agreed. I grabbed the key to their house and reluctantly made my way across the back alley and through their yard to the back door. Their back door opened up into their kitchen. When I opened the door, there stood Jerry at the refrigerator looking for something to eat. \n\n\r  \n“Dammit, why did she call you? You can just go on back home. None of your business.”\n\n\r  \n“Rose called me, not you.”\n\n\r  \nI walked past him, slightly bumping his shoulder with mine. \n\n\r  \n“Watch it mother…” I didn’t hear the rest as Rose started yelling for help. \n\n\r  \nI ran into her room. There on one of her nightstands, just slightly out of reach, was a bedpan filled with urine and feces. The room smelled rancid. There wasn’t just the smell of human defecation but also body odor, as if Rose hadn’t been sponged down in quite a while. \n\n\r  \n“Please Tom, could you empty that,” she said as she pointed at the bedpan. “Please, it stinks. I’m so embarrassed, but I can’t stand having it around. He refuses to empty it. He says it’s my responsibility.”\n\n\r  \n“Hold on Rose.” I was furious and stomped back into the kitchen. Jerry was walking towards me, and before he could react, I put my hands to his chest and shoved him back against the kitchen cabinets. \r  \n“You better get in there and empty that bedpan and clean her up. If you don’t, I’m calling the police for neglect and abuse.”\n\n\r  \nJerry quickly got up and went into Rose’s room. His face was red with anger, and he was visibly grinding his teeth. I followed in behind him. \n\n\r  \n“You want me to empty your bedpan, clean your clothes, mow your lawn, cook your food. You want me to be your slave. Well, I’m not doing it anymore you old bitch!” He picked up the bedpan and slung the contents of it all over Rose. He slung the bedpan across the room and turned towards me.\n\n\r  \n“You wanna try and push me again hoss?”\n\n\r  \nI knew he’d get the best of me. He was bigger and stronger and the last thing I needed to do is to get in a fight in front of Rose with her grandson, even if he did deserve a good whooping. \n\n\r  \n“Nah.” \n\n\r  \n“That’s what I thought. You’re lucky I don’t beat you to a pulp.” He turned and walked out of the room. \n\nI heard the back door slam shut. \n\n\r  \nRose was bawling, covered in piss and shit. I went to the bathroom and grabbed some tissue and several clean towels. I cleaned Rose and the room up as best I could. She really needed a new night gown. \n\n\r  \n“Rose, doesn’t a nurse ever come and help out?”\n\n\r  \n“She does Tom, but I can’t wait and shit only when she’s here. Nature don’t work that way.” She grinned and we both laughed. \n\n\r  \n“Well, my wife and I are going to go and get you some new night gowns.”\n\n\r  \n“Thank you, Tom. You’re such a good person.”\n\n\r  \n“Don’t give me too much credit. You don’t know me that well.”\n\n\r  \n“Jerry’s a good person too. He’s just frustrated. His mom left them when he was young and my son is in and out of jail every few years.” Rose reached into the nightstand closest to her bed and pulled out a small medallion. She started caressing it. “The lord has forsaken me. I used to have his power, but it’s been a long while since he visited me.”\n\n\r  \nI had never known Rose to be a religious person. She never prayed, talked of God, or even possessed a Bible, or at least one I ever saw. There were no religious pictures or artifacts at all in her house. \r  \nTuesday was a long day. I put in a lot of overtime and by the time I got out to the parking lot the sun had set. My wife called to say that there was a ruckus next door. \n\n\r  \n“It’s just their usual arguments. I don’t feel like messing with it today. I’m worn out.”\n\n\r  \n“No Tom, this is different.”\n\n\r  \nI got home as fast as I could and as soon as I got out of the car, I heard the painful shrieks of a dying man. There was a constant rhythmic banging. I ran into my house and got the key to their house. When I got to their back door, I heard a constant rhythmic banging. When I opened the door, I noticed there was a pool of blood on the kitchen floor. \n\n\r  \nJerry had pulled up a chair to the kitchen sink. His head was level with the edge of the sink, his hands were gripping the chair arms, knuckles white, and spattered with blood. There was blood all over the front of his body. The sound I had heard was him banging his head as hard as he could against the edge of the sink. With each strike he yelled, and blood sprayed out into the air and against the window looking out over the backyard. \n\n\r  \nI tried to run over to him, but I slipped in the blood and fell. I spun around and grabbed him by the arm. I got to my feet and put my arm around his neck, hoping to stop him from knocking his head off. It took all my strength to keep him from continuing his madness. There was something else, something more powerful than Jerry struggling against my hold. It was so powerful that I began to lose my grip. Jerry lunged backwards banging his head into my chin. The pain shot through my jaw. I lost my grip but before he could slam his head back against the sink, I pushed him out of his chair. It was a last second plan, but it worked. He fell to the floor limp, released from whatever diabolical force that had moved him to do what he did. \n\n\r  \nJerry laid there looking up at the ceiling. He blinked incessantly as the blood ran into his eyes. There was a huge gash in his forehead, tangles of flesh hanging loosely from the bottom of his wound, and his skull partially exposed. \n\n\r  \nI laid the chair on its side in case he was tempted to resume his nightmarish dance with the sink. I got out my cell phone and called the police. \n\n\r  \nThe police and paramedics got there in a timely manner. They gave him a shot to calm him down, but long before they got there, Jerry was in a catatonic state. I tried to talk to him but there was no response. He never stopped staring at the ceiling. \n\n\r  \nThey asked me questions but I had nothing logical I could give them. “Had he been acting strange lately?” No, but he was always an asshole, I wanted to say. I had nothing. I couldn’t even explain it myself. They went into Rose’s room and I heard the asking the same questions. Her responses were nonchalant. She wasn’t at all worried about Jerry. \n\n\r  \nWhen the police left, I went into comfort Rose.\n\n\r  \n“Rose, are you ok?”\n\n\r  \n“Oh, never better. The lord finally visited me last night. After all these years. He said he would deal with a Jerry and put him in a good place. Jerry’s going to be a good boy from now own.” She was caressing that medallion again as she spoke. \n\n\r  \nI’m naïve, but I thought that the police or the paramedics would clean up the mess, but that wasn’t the case. There it all lay- blood and flesh. I didn’t know how to clean it up. This was my first time. Not too long ago I was cleaning up piss and shit, now it was blood and flesh. Does it always come in pairs? Is one grotesque feature of life always married to another? I cleaned it up the best I could, splashing a large amount of bleach on the floor. \n\n\r  \n“Tom, it smells strong in there. I don’t know if I can handle that.” Now, I was feeling guilty. Am I no better than Jerry. I was beginning to get irritated with Rose. Lady, I’m cleaning up blood for you. Could you show a little appreciation? I thought. \n\n\r  \n“I’ve got some scented candles. Could you light a couple and bring them in my room?”\n\n\r  \nI was about to ask her where they were, but at that moment the kitchen closet door opened. There on the top shelf, above the food, were several candles in glass jars. I hesitated, too scared to move. \n\n\r  \n“Could you hurry Tom? It smells really bad. If there’s cinnamon apple, I’d prefer that.”\n\n\r  \nI hurried over to the closet and grabbed two candles. I didn’t care what scent they were. I brought them to Rose’s room, lit them, and got out of her house. She tried to talk, but I was in no mood to hang around and listen. \n\n\r  \nLater that night the police came to my house. Jerry had died, but his body had gone missing. \n\n\r  \n“Did he bleed to death? I thought everything was going to be fine.”\n\n\r  \n“He had a massive heart attack. We don’t know if it was unrelated or not. I suspect some bad drugs. \n\nBut we’ll never know if we don’t find the body. Do you know where it might be?”\n\n\r  \nI was shocked by the stupidity of the question, and I guess my face gave it away because the detective responded angrily. \n\n\r  \n“Well sir, forgive me for asking a strange question, but it is a strange situation. I don’t have a policy or procedure, or a guide on how to question witnesses about stolen dead bodies. It’s not an everyday occurrence.” \n\n\r  \n“I’m sorry sir. I didn’t mean any offence. No, I have no clue about the body.”\n\n\r  \nA year passed. I didn’t get any phone calls from Rose. I didn’t hear any arguments from next door. All was peaceful. I still cut their grass. That didn’t change. There was no one there to cut it but me. The Polk Salad was growing in abundance along the fence line. So much so that some of them had matured and the pulpous fleshy berries began to fruit. They hung like dead berries on a withering vine. They looked hideous to me for some reason. \n\n\r  \nLate one night I heard Rose’s front door open. I looked out my bedroom window and there under the moonlight was a figure foraging the young Polk Salad plants. I was too tired to investigate but early in the morning I gathered up the courage to go over Rose’s house. \n\n\r  \nI got their key and headed to the back door. I unlocked it and went inside. It smelled dead and the air was stale and putrid. I heard an old radio show in the distance. \n\n\r  \n“Rose? Hey Rose, everything ok?”\n\n\r  \nI walked into her room. Rose was staring out the window with a smile on her face. Out the window I could see a group of kids playing basketball. \n\n\r  \n“Tom, long time no see. How have you been?”\n\n\r  \n“I was worried about you Rose. I haven’t heard from you in a while.”\n\n\r  \n“Oh, no need to worry. I’m sorry. I should have called you and let you know everything is alright. I’m in good hands. Jerry has been taking real good care of me.”\n\n\r  \n“Jerry?”\n\n\r  \n“Yes, Jerry,” she said as she pointed across the room to the bedroom closet. \n\n\r  \nI looked over to where she pointed. There was a closet door I had never noticed. I walked towards it and as I got closer, I could hear flies and the smell of death grew stronger. Before I got there, the closet door opened. The closet was empty except for a chair. Sitting in the chair was Jerry, stiff and at attention. His eyes opened, but glazed over with a milky haze. His mouth was shut tight and there was a large rotting scar across his forehead. His hands were purple, and I reasoned it was from the Polk Salad he had picked the night before. \n\n\r  \n“Tom, are you thirsty? Would you like some Polk Salad and eggs? Jerry, go fetch Tom some Polk Salad and don’t forget the orange juice.”\n\n\r  \nJerry stood up and walked out of the room. \n\n\r  \n“He’s come such a long way, Tom. He’s such a good boy now. The lord is good.”\n\n\r  \nI wanted so bad to see that medallion, and the lord that she actually prayed to, but fear got the best of me. I thanked her and refused the offer. I avoided the kitchen and went out the front door. The gate was locked so I climbed over. When I got to the sidewalk I looked back towards Rose’s house through a wide expanse of Polk Salad. Rose, looking out the window, with Jerry standing beside her bed and a plate in his hands, waved and gave me a thumbs up.",
    "comments": [
        {
            "level": 0,
            "comment": "Ohh my goodness... Chilling",
            "score": 6,
            "author": "bbabix0",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh yes. Wow!",
                    "score": 1,
                    "author": "amagivictoria"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Demon intervention time!  She prayed to that medallion not the bible.  Best stay on her good sidea.  Wonder how many candles used to hide Jerry's stink?",
            "score": 5,
            "author": "Shadowwolfmoon13"
        },
        {
            "level": 0,
            "comment": "We always called Polk salad choke cherries. I wonder how they prepared them to be edible?",
            "score": 2,
            "author": "superstitious722",
            "replies": [
                {
                    "level": 1,
                    "comment": "You gotta cook them twice in separate water. I don’t think that makes mindless zombies tho. I think that medallion has some type of entity attached to it.",
                    "score": 5,
                    "author": "Mo3inaz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 1,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        }
    ]
}