{
    "id": "13guhrq",
    "score": 340,
    "title": "Has anyone heard the poem called 'Clickity-Clackity'?",
    "author": "StrangeAccounts",
    "date": 1684016347.0,
    "url": "https://www.reddit.com/r/nosleep/comments/13guhrq",
    "media_urls": [],
    "other_urls": [],
    "postText": "I know it sounds silly, but has anyone ever heard the old poem about the Clickity-Clackity?\n\nI don’t know if it's just something that my small town kept alive or what. But I’ve been trying to do some research about it the last few weeks. I haven’t come up with much and I’m looking for help.\n\nHonestly, at this point, I’m really begging for someone who has any information on this thing to step forward.\n\nBut this is the poem I’m talking about.\n\n‘In these woods there lives a puppet.\n\nIt sits and watches all who pass,\nWith eyes of coal and teeth of rust.\nWith skin crackling and full of crust.\n\nWith wiry limbs as brittle as spent glass,\nIt moves with subtle creak and crass.\n\nSo if you’re ever in the woods,\nAnd you see a puppet sitting near,\nDo not look at it, no matter your fear.\n\nJust pretend you’re okay,\nThat’s truly all I can say.\n\nIn these woods there lives a puppet.’\n\nFor some context, I live on the southern edge of Wisconsin. My family has always been pretty savvy when it comes to camping and it was a big thing for my brother, Paul, and I growing up. We always had fun doing family camping trips.\n\nBut flash forward 20 years and my parents have since passed on. There was a bad car accident and the loss hit us unexpectedly.\n\nSo, as a little remembrance trip, my brother and I had planned a final journey up into the woods that our family had frequented. It’s up near the town of Clement Wisconsin. \n\nIt’s where my family had always camped. But this time we were going a little deeper into the woods. Just to have a little extra privacy from the normal campground tenants. Plus we were planning on getting a little drunk and didn’t want any Officers kicking us out. \n\nSo, we made our plans. \n\nWe were going to meet up at 3pm on Friday afternoon in the parking lot of the Clement Park Campgrounds. After which we’d head up north for a couple of hours. We found a pretty decent sized clearing through Google Maps we wanted to check it out. After all was said and done, the plan was to head back to our cars on Sunday afternoon.\n\nIt was just a dumb-drunk-greiving kind of weekend getaway. We both wanted to talk things through but neither of us could be described as the types to go through armchair therapy. \n\nThis is just how we handled things.\n\nBut once Friday came around, things immediately went south.\n\nI had parked my car in the rundown dirt lot of Clement Park around 2:30pm. There were a few scattered cars of other campers littered about the dirt fields but they held no one of note. In a way I had felt relieved that I wouldn’t have to exchange pleasantries with any old family friends.\n\nBut although I didn’t see any familiar people, I did see familiar faces. \n\nThe trees that had stood tall since I was a child still remained in their proper places. They held on rebelliously firm to their plots and were left untouched by time. If anything, they had appeared larger to me that day. They had loomed over me with an intensity that I hadn’t felt in years. Either they had grown larger, or I had felt that much smaller. \n\nWith a deep breath I took in the strong nostalgic smell of the cypress and pine trees that had filled the woods. \n\nIt had always amazed me that memories could be triggered so heavily with scents. That smell of fresh trees and dirt had taken me back to the simpler times of life. When you entrusted your whole being to the care of others. When you were so little that your parents had seemed unstoppable by the forces of nature. \n\nYou felt carefree because your parents could protect you. You never had to worry about yourself.\n\nNow that I was an adult, I knew that whole premise was faulty from the start. When death arrives, it arrives. It doesn’t matter how much experience or wisdom you have. It has always, and will always, take what it wants.\n\nAfter a few minutes I checked my phone and saw two unread texts from Paul. He wrote that he was going to be a few hours late due to work but told me to just go ahead without him. He said he’d meet me at the clearing sometime in the evening.\n\nI remember feeling disappointed in him. I know it wasn’t his fault, he had a rough job. But this was supposed to be our time together. Our time to bullshit and get everything off our chests.\n\nI knew that at the end of the day there was nothing I could do about it. I just thought ‘whatever’ and kept moving about with our plans.\n\nI walked behind my rusted little Honda Civic and popped opened the trunk. What was inside my beaten up little sedan was worth more to me then my entire life's work. Right in front of me lay the same beaten up rucksack that my Dad had always taken with us. \n\nWhen he had passed, my brother and I found all his camping gear still prepped and ready to go in his garage. At that point we hadn’t camped together for at least a decade. As a man I had held back tears when we found it. I think Paul did too. \n\n“Hey, Dad” I remembered saying as I picked up the heavy bag. “We’re going on another trip together. Paul will be here soon.”\n\nI looked towards the dirt path leading deeper into the woods and knew it was going to be one hell of a trek forward.\n\nIt was pretty well known in our town that the trees in the Clement Woods weren’t exactly easy to travel through. There were thick patches of dry-rotted tree limbs that had entangled and knotted around each other. \n\nOne bad foot placement and you’d end up snapping more than just a tree limb.\n\nWith that in the back of my mind, I started my journey. The first thing you have to pass through is the standard campsites. They were full of beat up trailers and half-assed tents. We called most of the trailers out there the ‘Regulars.’ They pretty much lived out there during the summers. They were good people, just a little odd. \n\nOnce you got past all of them you finally hit the start of the Clement Trail. It was less of a sanctioned path and more of a dusty foot trail. Years of fishermen coming and going had created the thin line of dirt that my family had enjoyed walking through for well over a decade.\n\nMy brother and I had walked down that exact path time and time again with our parents. It was basically a mile loop around a lake that happened to find itself surrounded by the Jack Pines and the Red Cedars that had made up the bulk of the Clement’s ecosystem. \n\nPast that was relatively untouched land.\n\nNow was it legal for us to camp out past the sanctioned areas? Probably not. But what Conservation Officer would head several hours into the woods on a hunch there might be some buffoons grieving out there.\n\nAnd so I pressed forward, continuing northbound into the depths of the treeline. Before I knew it, the Clement Campgrounds were out of sight and out of mind. \nDuring my hike I used the sun as my marker and kept a good pace. I was actually a little ahead of schedule without having to keep pace with Paul.\n\nIncidentally it was just over an hour of me walking due north that I started to notice something. \n\nThere was this odd creaking noise coming off from the distance just behind me. It didn’t sound like much of anything at first, just kind of like a tree cracking in a breeze. But when it kept happening, always the same distance away and always directly behind me, I started to get an odd feeling creeping up into the back of my mind. \n\nYet every time I turned around to look at whatever was making that noise I’d see the gentle swaying of the green leaves overhead and the sand colored trunks of the cedar trees. \n\nNothing else.\n\nSo every time I got that odd feeling running up my spine, I’d turn around, see nothing, then keep marching on. \n\nThis happened over and over again. \n\nIt wasn’t until I got to the clearing that something else had popped into my head.\n\nI hadn’t heard a single bird call that entire walk.\n\nBesides from the creaking of tree branches and whistling of the wind, it was dead quiet.\n\nBut once again I pushed that out of my mind.\n\nI shifted my focus to setting up the campsite for Paul and I. \n\nThe clearing we had chosen was perfect. It actually looked better in person than it did from the overhead view we had online.\n\nIt was an almost perfect circle of grass surrounded by a dense woodline. You could see the sun overhead, casting its dimming glow from just overtop of the green canopy of the tree leaves.\n\nI relaxed my mind a bit now that I had gotten safely to our makeshift campsite. I went through the mental checklist of everything I had to prepare for the night. I started with the fire. \n\nI collected a few big stones that littered the forest floor and formed a little rock pit in the dead center of the clearing. Shortly after I had made a big pile of dry firewood that I had found scattered about the ground. \n\nI did my best to fill the ad hoc firepit with the best wood I could find and tried to spark the timber with my Dad’s firestarter. The fire sparked without a hitch. It was just in time for the evening sun to start cresting over the horizon.\n\nEven though I felt a little rushed setting up the camp on my own, there was something relaxing about focusing on a single task. I had wished Paul was with me but part of me needed some silence to sort out my own thoughts.\n\nThe fire provided enough light for me to set up the three man tent without issue. Before long I was sitting by the fire getting ready to open up our cooler and have a drink. \n\nThat’s when I finally got a text from my brother.\n\n‘Hey, just fyi, I just got here. I’ll be up there in about two hours.’\n\nI know a lot of you probably think hiking in the woods in the dark is stupid. You’re right. We aren’t the brightest tools in the shed but we had an oversized ego of our capabilities. We’d been hiking and camping on our own for so long that it felt like second nature to us.\n\nI had just texted him back with a thumbs up and fished out a drink. I sat my back against a broken cedar trunk near the fire and looked at my handwork.\n\n“Here’s to you Mom and Dad.” I muttered before having a sip of my drink. Before I knew it the cans had gathered next to me and my eyes had gotten heavy.\n\nMy eyes were half closed when I heard the same clicking noise I had heard earlier. It was just outside of the clearing in the darkened woodline.\n\nMy eyes drifted towards the edge of the trees and focused in on something directly across from me. \n\nThere in the darkness of the sunless forest was a vague shape of something. It was barely noticeable in the shadows. It stood only about 4ft tall and was facing me.\n\nI slowly leaned myself forward, off the tree trunk. My eyes were fixated on the small, dark figure.\n\nI was expecting it to turn and run away from me. It wouldn’t have been the first time that I had been spooked by a deer in the night. I thought to myself that at any second I'd hear the skittering of deer hooves trampling their way back into the woods.\n\nBut that’s not what happened.\n\nAs my eyes were focusing on the little shape it had started to walk towards me.\n\nAnd by walk, I mean walk.\n\nEven with it being casted in shadows I could tell that it had the frame of a small child. It was deathly thin and gaunt. It moved with a sense of weightlessness to it.\n\nThe moment that it had passed into the camps clearing the fire had licked its face with light.\n\nEven through my drunken eyes I could see what it was. It was the face of an old wooden marionette doll. \n\nI felt my heart lurch up into my throat. My body had instantly skipped the fight or flight response and went straight into freeze. I couldn’t even move my fingers on my hand.\n\nAll I could do was watch and examine the puppet’s features. The wood was old and weathered, with cracks and chips layering its pale skin. The eyes themselves were dark and empty, and the mouth was just a gaping hole full of rusted metal false teeth. It had what appeared to be human hair matted over its wooden scalp.\n\nIt was just staring at me. \n\nTime passed and it just kept staring. \n\nI worked up enough courage to slowly slide my hand towards my flashlight. I slowly aimed the bulb towards the thing at the edge of my camp and flipped the switch.\n\nImmediately the puppet shot its hands up in the air and jittered its way towards me. Loud popping and cracking of aged wood filled the campsite. Its feet had glided their way over the forest floor as if it were floating. Its knees bounding high up into the air with every mocking step. \n\nThe clattering sounds of wood on wood jangling in the empty void of the darkness still haunts me.\n\nI dropped my flashlight and fell into the fetal position, completely curled up. My subconscious told me I was already dead and my body had totally given up in response. \n\nI counted the seconds in my head waiting for whatever nightmare I was about to experience to finally commence.\n\nBut it didn’t. \n\nI lay on the forest floor in a tight ball for God knows how many minutes. \n\nBut eventually I had worked up the courage to take a glance at my tormentor.\n\nThrough my fingers I peered into my campsite praying that the thing would be gone.\n\nBut the puppet was still there. It was now just halfway between the fire and me. The wind was blowing against its hardened skin, creaking its body ever so slightly against every gentle gust. \n\nOut of its mouth came a light clicking noise, almost like an infestation of woodworms all calling out. \n\n‘What do I do?’ I remember repeating to myself in my head. ‘What do I do?’\n\nThen I remembered that poem from when I was a child. I remembered what it had said.\n\n‘Just pretend you’re okay.’\n\nSo I slowly sat up and kept the puppet in my peripheral vision. It turned to face me again but I did my best to pay it no attention.\n\n‘You’re at camp, act like you’re at camp.’ I silently recited to myself.\n\nI noticed that the fires of the firepit had begun to dim. I needed to stock the pit again before the light went out completely. \n\nI looked over to the large stock of dry wood I had collected earlier. I thanked God that I had been smart enough to make a pile before sitting down for the night. \n\nThe timber couldn’t have been more than 10 feet away from me. But when I went to take a step towards the dry wood, my legs nearly gave out from under me.\n\nI was shaking. \n\nBad. \n\nI heard the puppet begin to creep its way back up behind me. Maybe it noticed my fear, maybe it knew I wasn’t acting right. My intuition was flaring up in my mind like red hot coal that this thing wasn’t just something I could run from. I had to play its game.\n\n‘Get the firewood. Don’t acknowledge it. Just. Get. The. Firewood.’\n\nI straightened myself out and walked as casually as I could over to the bundle of fallen tree branches and limbs. I picked up a large handful and turned around. The marionette was standing just behind me. Its coal black eyes looking up at my face.\n\nThe clicking noises that were escaping from its open mouth sent a nearly uncontrollable fear throughout my body. But I still pressed on.\n\nI walked in a straight line towards the firepit, narrowly missing the wooden body of the doll.\n\nI took a knee down near the warm flames and dropped the wood down next to me. Handful by handful I placed the branches into the pit. \n\nThe creaking of the doll had made its way over to my side as I was stoking the flames. I glanced down at my thigh as the doll had placed its thin and rotten hand against me.\n\nAt that moment I wanted to jump and run away as far and as fast as I could. But instead I ignored that feeling. I ignored it as tears welled up in my eyes.\n\nI took a stand near the fire and gathered my strength. I closed my eyes and took one last breath of the night air before walking over to the tent. \n\nAs soon as I walked into it I zipped the door closed behind me. I saw the silhouette of the puppet standing right on the other side of the plastic sheeting illuminated by the fire behind it. \n\nI finally cried. In hushed tones I cried for as long as I could remember. \n\nI went to look for my cell phone, to let my brother know not to come down there. To tell him to go back to his car and get the Conservation Officers out there as soon as they could.\n\nBut when I reached for my pocket it had hit me. I left my phone outside near the broken tree stump. I glanced back out to the shadow just outside of my tent. It was facing me. It felt like it could see me through the thin layer of fabric that lay between us. \n\nI tried to gather up my courage to walk outside my tent and to grab my phone but I just couldn’t.\n\nI just sat there in the tent until I heard footsteps walking up to the campsite.\n\n“Hey, Jules, you up?” I stayed silent as Paul called out to me.\n\n“Sorry I was late but-” Paul gasped. “What the fuck is that?”\n\nI heard the panic in Paul's voice. I watched the shadow play of the puppet turn to face Paul. Its arms and legs jerked violently in the air. Paul turned as fast as he could and ran out of the clearing. The puppet followed him with impossible speed. \n\nIt glided its dangling and flailing limbs in the air as it began its chase.\n\nNot even a full minute later I heard a horrified yelp then complete silence. \n\nI stayed in the tent all night. Numb, broken, defeated. I just continuously asked myself why I didn’t say anything. Why I didn’t do anything. \n\nBy the time morning came I had left camp, picked up my phone and tried dialing Paul over and over again.\n\nThere never was an answer.\n\nI left everything I had brought in that exact spot. I never went back for it. I left those woods in a half daze that I have never recovered from. Before I knew it I was back in the campgrounds.\n\nI contacted the Officers in charge of the area and they conducted a search. \n\nThey refused to listen to anything I had to say about what I had seen. But the thing is, they didn’t just dismiss me like I was crazy. It was like they had already known what had happened and had just refused to acknowledge it. \n\nWe never found my brother and I could never take another walk in those woods either. \n\nI had left the searching up to the Police and local volunteers. \n\nBut what I can do is ask a question. Does anyone know anything about the old ‘Clickity-Clackity’ story?",
    "comments": [
        {
            "level": 0,
            "comment": "Should have drop kicked it's ass into the fire.",
            "score": 38,
            "author": "ISawWendiGo"
        },
        {
            "level": 0,
            "comment": "Damn. Sorry about your bro, man. Stupid puppet.",
            "score": 21,
            "author": "Upset-Highway-7951"
        },
        {
            "level": 0,
            "comment": "I've heard of a Scots version of the 'Hook Man' involving a seaweed creature with giant fish hooks for fingers called \"The Clickety Man\", but that's as close as I've heard.\n\nBut this seems more like a possessed doll or puppet/golem or something else entirely.",
            "score": 17,
            "author": "Rangermatthias"
        },
        {
            "level": 0,
            "comment": "Clowns and puppets are abominations.",
            "score": 11,
            "author": "Wishiwashome"
        },
        {
            "level": 0,
            "comment": "We don't have that in Canada where I've camped. I can imagine I would have done the exact same as you. Sadly, my brother would have disappeared, too. If it were the other way around, my brother would have saved me if he knew I was in danger. He would have gotten the courage to get out of the tent and get his phone to text me. My self-preservation instincts are intense, my brother's? Not so much! I wish I could give you solace, OP. But you survived, your self-preservation instincts are intense, and you followed them, which I'm sure your bother would have wanted you to do. I know he wouldn't hold your lack of action against you. I wonder if there is more to your brother's demise? I think of the brothers in the TV show called Over The Garden Wall. Maybe you can still save him if you find him!",
            "score": 8,
            "author": "NASTYHEARTBREAKER"
        },
        {
            "level": 0,
            "comment": "First ticks now killer Pinocchio",
            "score": 3,
            "author": "CoochiKabuki"
        },
        {
            "level": 0,
            "comment": "Kickity it into the fire, omg 😱",
            "score": 2,
            "author": "CozyHorrorReads"
        }
    ]
}