{
    "id": "13gx8e8",
    "score": 72,
    "title": "I think the Government's hiding something in rural Wisconsin - if I don't find out why, Tom died for nothing.",
    "author": "twocantherapper",
    "date": 1684023431.0,
    "url": "https://www.reddit.com/r/nosleep/comments/13gx8e8",
    "media_urls": [],
    "other_urls": [],
    "postText": "It was two weeks ago Tom and I went up Mount Verrottet, and the memories still got me more fucked up than a Central Park crack squirrel. I got into wild camping when I was a kid. I'm in my mid-thirties now, and my passion for the outdoors has not diminished in the slightest. Neither has my friend Tom's, whom I've known since childhood. We've spent many summers exploring the vast wilderness of Wisconsin together. Tom had taken a break for a few years, but since he was back in town after trying and failing to set up roots in NY, was itching to get out to the mountains. \n\nIt's not the most dangerous hobby for sure, but it comes with risks. Enough to make it always feel like an adventure, you know? We'd encountered our fair share of bears, bobcats, and even a cougar. Both me and Tom had broke bones falling. We'd even done a couple of minimal-provision \"roughing it\" trips. Point being, when I say there was nothing we could have done differently that would mean Tom is still alive.\n\nYou can also sure as shit believe me when I tell you camping, it turns out, is one of the most balls-clenchingly terrifying ways to spend a weekend, and it can fuck you up like nothing else. Honestly, if you've ever been considering taking it up, don't. After what happened two weeks ago I can say with certainty that you're safer dabbling in recreational crack addiction.\n\nOn this particular occasion, we had set our sights on conquering Mount Verrottet, a mountain that towered over the surrounding landscape, its peak shrouded in an ethereal mist. The weather that Saturday was supposed to be great though - crisp and clear, perfect weekend to take some tents and a big 'ol bag of weed deep into the Wisconsin wilderness and help Tom forget about Felicia.\n\nThe trail up the mountain was treacherous, with steep inclines and rocky terrain that tested our endurance and resolve. But we were determined to reach the summit and bask in the glory of our achievement.\n\nAs evening approached, we set up camp on a small plateau overlooking the valley below. The moon was full, casting a soft glow over the surrounding forest and illuminating the rugged terrain. The air was still and cool, and the silence of the wilderness was broken only by the crackling of the campfire and the occasional hoot of an owl.\n\nAs we sat by the campfire, enjoying the ridiculously high-grade Lemon Haze, we reminisced about old times and planned for future adventures now that Tom was no longer tied down. We had just finished an absolute cannon of a blunt, soaking in the beauty of the night sky. The stars twinkled like diamonds, and the moon was so bright that we could let the fire dwindle to embers and could still see enough to take a leak in a bush without getting any on our boots.\n\nA good night, you know? Glad we got one last one together before Tom... \n\nAnyway, as I said earlier, weather forecast for the weekend had been good. We'd have been back at my place playing Left 4 Dead on the same Xbox 360 we'd sunk hours into in middle school if it hadn't been set to be a clear one. We enjoy the outdoors, but we're not masochistic. We were all set and expecting clear views and the welcoming crisp weather that makes you feel lucky to live in Wisconsin.\n\nBut as the night deepened, a thick fog began to roll in, obscuring the moon and shrouding the campsite in an eerie mist. The trees loomed like dark sentinels in the mist, their branches creaking and rustling in the wind. The fire flickered and danced, casting strange shadows on the ground. \n\nWith each moment there passed the fog grew denser, thicker, until it became almost oppressive, clinging to our skin and clothes like a damp, cold blanket. It was as if the mist had a presence beyond the physical, a malevolent force that seeped into our bones and made us shiver from more than the wet chill of it.\n\nThe smell was the worst part. It was a horrid, rotten stench that hung heavy in the air, making us gag with every breath. It was as if something had died and was decomposing just out of sight, emitting its putrid odor into the night.\n\nThe mist itself was a sickly grey color, like the color of decaying flesh. It swirled and eddied, creating strange, ghostly shapes and shadows that seemed to move independently of the mist itself. It was as if the fog was alive, a sentient entity that was watching us with malevolent intent.\n\nThe hairs on the back of my neck stood on end as I realized that there was something deeply unsettling about this mist. I couldn't shake the feeling that we were not alone in the wilderness that night, and that whatever was out there was not friendly.\n \nI voiced my concerns to Tom, and he remarked that it was really good weed I'd brought, and I was just about to retort that I don't think any Lemon Haze this far east of Cali had enough THC to prang me out this damn hard, when we heard it.\n\nA rustling in the bushes nearby caught our attention. \n\nWe both froze, unsure of what to expect. Was it a wild animal? Or just a harmless critter? We cautiously peered into the darkness, but couldn't see anything. We shrugged it off, assuming it was just the wind or a small animal scurrying about. Probably wasn't scurrying though, thinking about it. It was probably running for its life - funny how hindsight changes your perspective, ain't it?\n\nThe smell didn't leave, and neither did the paranoia Tom was convinced could be put down to too much smoke. Definitely enough make us call it there and pick up the good times again tomorrow though - vibe was totally killed. As we prepared to turn in for the night, I couldn't shake the feeling of unease that had settled over me. The mist had somehow grown even thicker, and visibility had all but gone. Time passing since my last blunt made the unshakeable edginess worse, not better, too. We crawled into our tents, zipping them up tight to keep out the damp chill of the fog, and I could tell Tom was feeling it just as I was despite his bravado.\n\nLying there in the darkness, I listened to the sounds of the night. The wind howled through the trees, and the branches creaked and groaned as if in protest. We'd camped these mountains dozens of times - I didn't get spooked by nature. My own fear was making me fearful for no reason other than it being so alien. It was that damn mist. I could get it out of my head or nostrils. It's like it and the smell that hung on it like a gallows victim left to swing in the sun for a week seemed to seep into the tent, muffling all sound and suffocating me in its clammy embrace.\n\nDespite my unease, I eventually drifted off to sleep, my dreams filled with strange and unsettling images that - thank God - were secubbed from my memory the moment my eyes opened. The troubled rest was short-lived too, as a sudden noise jolted me awake. I sat up, heart pounding, and peered through the foggy tent flap into the darkness.\n\nAnd that's when I saw it. \n\nIt took me a few seconds to realize my eyes had even honed in on a form, but once it dawned on me they had I couldn't ignore it. There was something out there, miles away, a shape carved against the jagged mountain peaks that shouldn't be stood amongst them. \n\nSomething was moving in the mist, a dark shape that seemed to be coming toward Mount Verrottet. Something as vast as it was distant - a nondescript shadow barely distinguishable within and against the thick fog and broiling midnight clouds. I couldn't make out what it was, and I even thought at the time that it was probably just a trick of the absent light, but the fear that gripped me was all too real. And then, just as suddenly as it had appeared, the shape vanished into the mist. \n\nIt left something in its wake though -  soft rumbling bass tone in the ear, a steady thumping almost like the slow heartbeat of some deep sea leviathan. I frantically shook Tom awake, whispering urgently to him to be quiet and listen.\n\nWe sat there in the darkness, holding our breath and straining to hear any sound. But there was nothing, only the rustling of the wind and the creaking of the trees. We sat for what felt like an eternity, waiting for another sound, but there was none. Eventually, we felt sheepish and started laughing nervously, trying to convince ourselves that it was just our imaginations playing tricks on us. We settled back down into our sleeping bags, ready to drift off again.\n\nBut just as we were about to succumb to sleep, there was a loud BOOM that shook the earth beneath us. And then another, and another, as if some prehistoric monstrosity had clawed its way out of the annals of ultra-antiquity to stalk the landscape once more. We leapt out of our tents, the fear that had gripped us earlier returning with a vengeance.\n\nThe mist had grown so thick it felt like it was basically a liquid while we slept, and we emerged from the tent to find we could barely see a few inches in front of us. We stumbled around in inky fetid air, trying to swivel our ears to the source of the noize and impending danger. But there was nothing - only the crushing dread and stench of the fog.\n\nI was about to yell to Tom that we needed to run when, as soon as it had started, the booming stopped.\n\nFor a few eye-of-the-storm moments there was silence and stillness, but then Tom let out a half-panicked, half-excited yell. He said he saw something in the far distance, a light that flickered and danced in the darkness. I asked him what the fuck he was talking about, and he started babbling about - and I shit you not - a UFO. Sky lanterns, he said, a pair of them, bobbing around nothing like a plane or chopper would, but it was too far away to be sure. Without warning, he ran off into the fog, leaving me alone in the darkness.\n\nI stood there, paralyzed with by the unhealthy injection of inexplicability and unfamiliarity into our trip, unsure of what to do. The silhouette that we had seen earlier loomed large in my mind, and Tom's talk of UFOs after a succession of artillery like booms didn't help assuage the fixation at all.\n\nDid I want to run? To grab my flashlight and head down Mount Verrottet as fast as my ass could carry me? You're damn right I did. That's ALL I wanted to do.\n\nBut, unfortunately, I'm not a bastard. I couldn't leave Tom alone in the fog, so I set off after him, stumbling blindly through the mist. My heart was pounding in my chest, and my breath came in short, ragged gasps. I called out to him, but there was no response.\n\nAnd then I heard the sound of running water, a rushing stream that cut through the darkness. I followed the sound, my feet slipping on the wet stones beneath me. And then, through the mist, I saw it.\n\nA vast silhouette looming in the darkness, cut into focus only briefly by a lightning-flash of the \"sky lanterns\" Tom had followed - the shape of it indistinct, menacing and, most harrowing of all, impossible to deny the existence of. It towered over me, seeming to stretch up into the very heavens, the peak of it obscured by the twin flares just emerged from above the cloud canopy to illuminate it. Before I could whip the beam of my flashlight around to console myself with lies about my mind playing tricks on me though, it vanished into the mist, leaving me once again alone in my now piss-soaked pants.\n\nI stood there, trembling with fear, unsure of what to do. And then I heard Tom's voice, calling out to me from somewhere in the distance. I stumbled through the mist toward him, my heart pounding in my chest.\n\nWhen I finally found him, he was standing on the edge of a cliff, peering out into the darkness. He said he had caught a glimpse of something in the distance, a light that flickered and danced in the fog. Or that's how he described it, at least. But when he ran toward it, it vanished into the mist.\n\nI didn't have to think long to put two and two together. I didn't know what was going on, but this thing Tom was so desperate to find I was equally invested in getting away from. I tried in vain to convince him that no good could come of those skylights, to explain what I'd witnessed before I'd found him, to kill any wild panicked ideas about UFOs, but it was no use.\n\nWe stood there arguing for what felt like hours, all the while waiting for something, anything, to happen. There were no more quaking booms, no more sky lanterns descending from the clouds. The mist swirled around us, and the darkness seemed to press in on us from all sides. The weirdness of Mount Verrottet had lulled, and I'd just about managed to convince Tom to head back to the tent. I'd even managed to half-convince myself I'd imagined the skyscraper sized figure in the fog, that it had indeed been the product of some kind of weed induced hallucination. \n\nThen it stood up.\n\nIt towered over us, the cliff edge barely at waist height, the treetops of the evergreens below just about scraping its knees. Before it had been far enough away that I only caught a fleeting glimpse of its sillouhette. This close, the beams of our flashlights could unmask its form in all its abyssal glory. \n\nI knew instantly we were in the presence of true horror no mortal had the psychological resilience to truly comprehend - a creature that defied all logic and reason, a behemoth thing wearing the form of a blackened human skeleton almost as if it existed to blasphemously mock the concept of life. Its skeletal frame easily stood hundreds of feet tall, towering over everything in its path. Its tree trunk thick bones were gnarled and twisted, as if they had grown warped from years of abuse and neglect. Each was covered in a thick layer of dark, oily grime, as if it had been coated in the filth of the most degradation-ridden metropolis in human history.\n\nBut it was the monster's eyes that robbed me of all hope in an instant, despite its eyes and the nightmarish nature of its impossible frame. Its eyes, the sky lantern UFO's Tom had been chasing, glowed with an otherworldly light, casting an eerie, sickly haze on everything around us as it bent its skull down toward the cliff edge. The brightness that emanated from them was not the warm, comforting light of the sun, but a cold, sterile shimmer that seemed to drain some of the vibrancy - and for lack of a better term, the reality - from all it touched.\n\nThe creature was draped in what appeared to be a cloak at first, but at it lowered itself to us and got closer I realized that it wasn't clothing. This abomination wore a perpetually cascading waterfall of murky pungent water - a perpetual torrent of what I can only describe as sewer-drainage filled with debris, garbage, and human waste of all kinds. The river of filth evaporated to steam at the skeletal giant's black boned feet, billowing out into the world as a cloud of gaseous haze of rot and misery.\n\nThe putrid stench that emanated from it was overwhelming, filling our nostrils and making us gag. It was as if the fog had been amplified a thousandfold, and I'm genuinely amazed neither Tom or I choked. It was as if this being was a walking, breathing landfill, a monument to the waste and excess of humanity.\n\nAs the monster crouched, the movement of its mammoth bony thighs alone was enough to leave destruction in its wake. The ground beneath its feet turned black and withered, as if all the life had been sucked out of it. Trees and plants wilted and died, their leaves turning brown and crumbling to dust. It was as if the monster's very presence was toxic to the environment, a harbinger of death and decay.\n\nThe necrotic rotting giant let out a deafening roar that shook the very ground beneath us, and we could smell its putrid breath from where we stood. And then, the monster did something that still makes me shudder to this day. It began to vomit.\n\nOh God, the vomit. \n\nThe black, slimy substance that the monster spewed forth was unlike anything I had ever seen before. It was thick and viscous, like tar, and it seemed to melt everything in its path. The smell of it was overpowering, like a mixture of rotting flesh, medical waste, and burning garbage. The ground beneath it sizzled and steamed, and the trees and plants where it landed withered and died. To my horror and disgust, any organic matter of the forest caught in the titans unholy bile devolved into a puddle of stagnant, steaming waste \n\nAnd so did Tom.\n\nHad I been standing about five foot to the right, none of you would be reading like this, I wasn't standing five foot to the right though, so when the colossal paragon of filth lowered its titanic skull and opened its coalish jaw, I walked away unscathed (saved for a minor-yet-still-painful bit of acidic backsplash). Tom didn't. He was directly underneath the upended geyser of noxious phlegm that exploded from between the beings' charred cracked teeth.\n\nI'm glad it all happened too fast for me to process it all. If I'd have been aware I might have tried to do something stupid like tackle Tom, to get him out the way. The fact all I could do was watch with my lip trembling and my bladder emptied is one of the few reasons I'm still alive.\n\nAs I watched my friend being consumed by the monster's vomit, I felt a mixture of horror and revulsion that I could never have fathomed was possible. My cowardice and impotency in the face of the sheer evil we'd encountered gave it a cruel introspective aspect too - a feeling I imagine isn't far away from finding out your spouse is a child molester, or awaking from sleepwalking to find you've slit your dog's throat. \n\nIt's an emotion I'm sure was caused by the towering pustulent skeleton's presence as much by its actions, too. It was a primordial disgust, one stored in the deepest bowels of our DNA to be pulled to the fore only when the things that terrorized our most ancient ancestors returned. \n\nI couldn't bring myself to approach Tom during the few seconds I lingered at the cliff edge after the waterfall of septic acid ceased. The black, slimy substance was eating away at his flesh, melting as though he were a discarded wax museum exhibit in the furnace of a crematorium. His skin turned an ashen gray, and it began to crumple and fold in on itself like molten tarmac.\n\nI could hear his screams of agony, but they were soon drowned out by the sound of his bones snapping and breaking under the weight of his own melting body. It was a sickening sound, like the cracking of wood in a fire, and it made my stomach turn - a response worsened by the grizzly sights that came with the cacophony of suffering. His final thrashes of pain created enough force to separate what remained of his liquifying muscle and skin from his limbs, leaving him looking like a wailing parody of the glowing eyed fog nightmare still towering over us. \n\nThe worst part was that enough of his face remained to make his eyes widening in shock clear to see - and the knowledge he was aware of everything they happened right up until the end will scar me for life.\n\nAfter what was left of Tom stopped twitching I felt a wave of nausea wash over me, and I knew that I was going to puke. I turned away from the sight, but the retching continued, and I could feel the bile rising in my throat. It was a violent and uncontrollable reaction, one that was born out of the sheer horror of what I was witnessing. I could feel my muscles contracting and spasming, and then it came.\n\nThe vomit that I spewed forth wasn't a noxious tide of lethal mucus. It was a thick, chunky mess, a mixture of the dinner that we had eaten earlier and the bile that had been building up in my stomach. It was a disgusting sight, and it only served to make the horror of the situation even more real. Thankfully, I managed to remember why I'd just seen Tom literally fucking melt in front of me just in time to throw myself sideways and avoid meeting the same fate myself.\n\nThe sound of the thing from the fog roaring made my heart skip at least three beats, but the rest of my body didn't care. I ran so hard blood vessels burst in my thighs, and I've still got the bruises even now. I didn't know where to go beyond that my destination was as far from that Mount Verrottet as I could possibly fucking make it.\n\nThing is, I wasn't the only one running.\n\nAs soon as I could hear the thunderous footsteps behind me, I knew that I was not going to make it out alive. The shaking of the ground damn near catapulted me over a ledge or down a raveen more than once during the five-or-so minutes I actually managed to keep going - it's honestly a miracle I didn't break my neck. Every time I stumbled and fell I'd look over my shoulder to the clouds above the mist, and always I saw the monster's glowing eyes staring down at me.\n\nThe final time they were right above me, so close I could make out their eldritch glimmer casting an obnoxious sheen across the gargantuan skull. I distinctly remember thinking \"this is it, this is the end\". The mortician-stench reeking in the mist intensified as the mucus began to bubble and pool between jaws lowering themselves beneath the line of the tree canopy. I closed my eyes, my face suddenly numb and my limbs inexplicably far away from my senses.\n\nThen everything went black.\n\nI was passed out for three days. Sheriff Harwurst was at the foot of my hospital bed when I awoke, and immediately had questions, most of them around where Tom was. I gave him my answers, and to my amazement he didn't call me a lunatic. He just sighed, scribbled something in his notebook, and left. I was still pretty out of it even by the time he'd gone - it wasn't till a few hours later that the horror of everything that happened hit me like a claw hammer right in my will to live\n\nWhen I finally regained my senses fully, my mind was a jumbled mess of fragmented memories. Not what happened with me and Tom on Mount Verrottet you understand - that shit was unfortunately crystal fucking clear. The bits I still can't piece together despite really needing to are how I got from there to that damn hospital.\n\nHere's the thing - I agree with you reading this right now, I should be fucking dead, so what in the Deus Ex Machina is going on?\n\nThat's what this is all about - why I'm determined to follow this through and not just swallow up the lie. The first thing I recall was the sound of gunfire ringing in my ears, followed by the deafening roar of the monster. Then, there was a massive explosion that shook the ground beneath me. I remember feeling a rush of hot air and debris hitting my face, before everything went silent.\n\nThe next thing I remember is the sound of helicopter blades chopping through the air, and then the sensation of being lifted off the ground. I must have been airlifted to a hospital, because the next thing I saw was a thin-faced man with a really unnerving aura looking down at me with a disapproving expression. He was muttering something to Sheriff Harwurst, but I couldn't make out what they were saying. My head was pounding with pain, and I was struggling to stay conscious.\n\nDespite the concussion, I knew that something terrible had happened. The monster had been real, and it had nearly killed me. But what had happened to it? Had the gunfire and explosion killed it, or had it escaped? Who had even shown up to stop it? No way did the police have the minds of munitions you'd need to take down something like that… whatever the fuck that thing was.\n\nI must have send something, heard something, that could put the pieces together. It had something to do with the thin faced man and Sheriff Harwurst, but who was he? I couldn't remember, and the uncertainty only made me feel more frightened and alone. It was a relief when the doctors finally gave me something to ease my pain and help me slip back into unconsciousness.\n\nThat was two weeks ago. Tom's disappearance is being treated, I found out through an old friend in the Marathon County Sheriff's Office, as a natural accident, with the rationale being Tom and I were caught in a freak avalanche. What I saw had been explained away as a concussion-induced dream.\n\nAvalanches and concussions don't cause acid burns though, do they? So why do I have a splatter pattern of them across my right cheek and arm?\n\nTo this day, I don't know what that monster was or where it came from, or why it didn't let me suffer the same fate as Tom, but I know one thing for sure: something weird is going on in Marathon County, and the police - or at the very least Sheriff Harwurst - are covering it up. The memory of that night still haunts me, and I can only hope that no one else ever has to witness the terror that I did on Mount Verrottet. \n\nMe though? I need answers, even if it means coming face-to-face with that thing again. I'm writing this as a kind of… failsafe, I guess? I'm going to go poking around, starting with Harwurst's house. My friends reading this (you know who you are) have been told what to do if I disappear after today. Sorry I couldn't tell you why you needed my social passwords etc, but would you have believed me before?\n\nAs for why I'm making it public, it's because I didn't want to put the burden of sharing this on someone else. This could run deep, there could be consequences for posting or even talking about it. I was the one up there with Tom, all those risks should be on me. Someone had to blow the whistle through - something evil is lurking in Marathon County, and people need to stay the hell away from Mount Verrottet.",
    "comments": [
        {
            "level": 0,
            "comment": "Think you got the wrong state, there’s no mountains in Wisconsin",
            "score": 7,
            "author": "_Anal_Beans",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nice try, Government.",
                    "score": 4,
                    "author": "twocantherapper"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Witnessing the bones of the earth walk is a blessing and a curse, I hope you find the answers you seek, for Tom, and your sanity",
            "score": 4,
            "author": "SamwiseOdinson96"
        },
        {
            "level": 0,
            "comment": "The dude with the sheriff was probably a government agent sent to cover up!  Sorry that happened to you and Tom.  You won't get any help regarding Tom.  I'd suggest letting it go to save yourself.  They probably are watching you.",
            "score": 2,
            "author": "Shadowwolfmoon13"
        },
        {
            "level": 0,
            "comment": "They're probably hiding a stockpile of their really good cheese.   The state is famous for it!",
            "score": 1,
            "author": "This-Is-Not-Nam"
        }
    ]
}