{
    "id": "13h1pkf",
    "score": 100,
    "title": "Dear Sophie",
    "author": "SebaWDK",
    "date": 1684036195.0,
    "url": "https://www.reddit.com/r/nosleep/comments/13h1pkf",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, I don’t know if this is the right place to talk about this, I don’t even know if I should be writing this down at all. My guts are telling me to shut up, and I’ve listened to them for more than ten years, but I can’t go on anymore. I feel like I’m going to explode if I take another breath without taking this weight off my shoulders. I’m gonna tell you something that fucked me up when I was a kid, it is not something nice to carry around so if you want to stop reading, please do. Here I go.\r  \n\r\n\n&amp;#x200B;\n\nI spent all of my childhood living in the same city, it wasn't a great one to be honest, there wasn't much to do so we spent most of the day just riding our bikes around or playing sports on the street. But, what we did have, was an entire catalogue of insane people just roaming around. It is now, as an adult, that I realize that this was not normal at all.\n\n&amp;#x200B;\n\n\r  \n\r  \nWe had \"The tumba”, his skin stretched and sunburned to the point that it seemed it could rip apart at any given moment. This was no surprise as he spent most of his day covering random streets with paper while the sun blasted his ass with 40 degrees of heat. People were already used to just walk around the block where he decided to work on because if you dared to step on a single piece of paper he would just snap and scream his lungs out. Once in a while you could even hear the faint scream that seemed to travel the entire town. Other than that, he was harmless.\n\n\r  \n\r  \nEveryone also knew the “Vest man”. His name came from the bright orange vest that he always wore and, no matter how covered in dirt and filth he was, the vest always looked brand new. His routine was quite simple, a life free of stress since all he did was stand in the busiest corner of the city, right in the middle where all the cars were about to collide. Once there, he just waved and moved his arms pretending to be a cop but everyone just laughed and ignored him.\n\n\r  \n\r  \nThe other one I remember clearly was “The dog man”. His belly pouring out of his stained brown shirt, hair popping out of his stinky armpits. You would definitely smell his arrival before seeing him, because he was followed all day long by his loyal pack of dogs and the plague of fleas that went along with them. \n\n\r  \n\r  \nBut, in the end, none of them ever came close to “Dear Sophie”. First, you would hear the screeching sound of the wheels of his rusty shopping cart. Inside of it was always a single plastic bag with the perfect size to hide something long, like a baseball bat. Then the air would smell like if a thousand people just decided to piss on the street, evaporating under the sun and reaching your nose in a warm whiff. His eyes were thin black lines, always closed making it look like he had a permanent smile, and if you happened to walk past him, he would actually giggle a little, mumbling something. Of course, you wouldn’t understand shit of what he tried to say under that laughter.\n\n\r  \n\r  \nBut, this apparently harmless man had a trigger, like a secret code. The day I discovered this I was in the car with a friend and his family. They were driving me home back from school when, out of nowhere, his dad pulls his head out of the window and screams like a maniac “OH DEAR SOPHIE”. I stared at my friend, eyes wide open thinking that his dad was straight up insane, and he pointed at the sidewalk. There he was. “Dear Sophie” was pulling out of the plastic bag a giant bat. The seemingly happy lines that were his eyes were gone, replaced now by a look that seemed to burn in rage and agony. Only then I realized that there actually was someone trapped behind that insanity, and you could wake him up with just two words. My friend screamed at his dad to hurry since the madman was running towards the car mumbling and screaming, clearly cursing at us but unable to actually say a single word. \n\n\r  \n\r  \nMy friend’s dad waited until the last second to drive away while he laughed, repeating to himself “oh Dear Sophie, you crazy motherfucker”. That was the day that I learned that, apparently, many people did that. You screamed at him that name and he would snap and turn into a psychopath trying to murder you. I know it looks cruel as fuck, and it is, but it seemed like people were so used to crazy bastards walking around the city that they just saw them like hollow pieces of meat.\n\n\r  \n\r  \nI asked my friend if he knew why people called him that way. He just shrugged and looked at his dad, waiting for an answer. The man opened his mouth ready to start talking, but then he looked at us through the rear-view mirror and assured us he had no idea. Today I know why he lied.\n\n\r  \n\r  \nNow, this is the part of the story where you will probably judge me for what I did. I don’t blame you if you do. Back then I was a lonely boy, I spent most of my days watching tv, barely talking to anyone, and the friend I just mentioned… well… If you asked him I doubt that he would call me his friend. I was desperate to fit in, and I saw in Dear Sophie an opportunity.\n\n\r  \n\r  \nYou see, kids started to arrive at school and share stories of how they screamed at him and barely escaped getting on the incoming bus, or losing him by running as fast as they could. Some were actually planning different ways to do this and meeting at places where they knew he’d be. I couldn’t miss this shot to actually be a part of the group so I decided I needed my own anecdote to share. Maybe they would take me into account in the future. \n\n\r  \n\r  \nSo, I walked home that day looking behind every tree and corner trying to find him. I admit my legs were shaking just with the idea of actually screaming at him, and a part of me wanted to walk straight home and be done with this. I almost gave up when, at the back of my ear I heard it. The unmistakable sound of the old rusty wheels and the giggle. He was coming.\n\n\r  \n\r  \nI was ready. The sound was getting closer and closer, my mouth was dry and I think I tried to swallow a hundred times with no success. I checked that my shoes were tight and ready to go full speed. The cart popped out at the corner and I saw those thin black lines and his round cheeks giggling at the sky. I Took a deep breath and…\n\n\r  \n\r  \n“DEAR SOPHIE!!!”\n\n\r  \n\r  \nThe giggle transformed into pure rage and his eyes were suddenly open revealing two dark spots that seemed to burst into fire. This chubby little man threw his cart aside, his legs flailing around and, somehow, still advancing at an insane speed. The mumbling curses got louder and louder behind my back, some people watched, too scared to do something I suppose, and I realized that tears were running through my face. I could feel the damp stench of piss getting inside my head and I knew he was getting closer with each step. \n\n\r  \n\r  \nThen I heard a loud thump. Something fell. I couldn’t stop and, at the end of the block I realized that the mumbling was gone, and my back was way lighter than it should be. I knew before turning around that I was screwed. The crazy bastard was looking down at my backpack on the floor, picked it up and stared straight at me, and I swear that, for a brief moment, I saw a rational mind, a conscious decision. He took it away and walked like nothing ever happened, giggling and mumbling. \r  \nMy family wasn’t exactly rich, and inside the backpack was my laptop, the one my father helped me buy with the little money that we managed to save each month. I knew that if I came back without it, I was fucked. I could make up some lie for sure, say that someone stole it, but I guess I was just pissed at this crazy asshole so I started following him, waiting for an opportunity to take it back. I should have left right there. That laptop was not worth my sanity. \n\n\r  \n\r  \nHe walked and walked. The backpack was safe inside the trolley, with no chance of it falling by accident, and the bastard never left it alone either. So I walked too, keeping a safe distance. I guess I was so focused on recovering my stuff that I never realized that it was getting dark and we were on the outskirts of town already. The landscape consisted of homes made of rubble and wood, old empty cars with no wheels scattered randomly, sometimes even blocking streets. I was in deep shit already so I kept going.\n\n\r  \n\r  \nWe finally arrived to something that pretended to be a house. It was just four concrete walls that looked like they would crumble with just a breeze. The two holes that acted like windows were covered with some torn red curtains and, where you would expect a door, was nothing but a larger hole to walk through. Under the darkness it all looked like a skull and Dear Sophie walked through the mouth of it, the backpack still in his power.\n\n\r  \n\r  \nI crawled through the uncut grass that covered the front door, my hands got all wet with what I like to think was some early dew and had to dodge some empty cans on the way, but I finally reached the side of the house. I could see the curtains move with the wind right above my head and I realized I was completely soaked in sweat, my body shaking with every blow. The streets were completely empty at this point, and the few houses I could see from where I was were, as far as I knew, abandoned.\n\n\r  \n\r  \nAll I could hear was the whistling sound of the wind and, hidden beneath, the quiet giggle of Dear Sophie. I started to stretch my legs, getting closer to the window just to get a glimpse of what was inside. The light that came from inside got filtered through the curtains turning into a faint red glow that disappeared into the night and somehow, I knew that this was my last chance to turn around and leave. Once I laid my eyes inside, it was over. \n\n\r  \n\r  \nMy legs were shaking now with a mix of exhaustion and fright, I had trouble controlling them so I grabbed a few smaller holes in the wall to keep my balance. Slowly, I dragged my head upwards, my breath bouncing off the wall and for a second I was certain that, the moment I peeked inside, those eyes that looked like dark lines would be waiting for me there, right on the other side of the window. \n\n\r  \n\r  \nThe room was barely illuminated by a single bulb that dangled lonely on a roof covered in moist stains. The walls looked the same and the floor was a mix of concrete and dirt patches, making it look like a bizarre chess board. To my right, again, a black hole made the entrance to another room, and right next to it was a small table with a plastic bowl in it. And in the center of it all, Dear Sophie stood on top of the black pool that was his shadow, giggling at nothing, his blank gaze stuck on the floor. The trolley was in the corner of the room, backpack inside, but to reach it I’d have to walk past him. I decided then that I was done, my bones ached with cold, who knew how far I was from home and if my father didn’t kill me because of the laptop, he would certainly do it for being gone all this time. \n\n\r  \n\r  \nI was about to leave when my eyes caught a shadow coming from the other room and I felt like my eyes were glued to that darkness. I could not leave, not now. Someone stepped out from the hole and Dear Sophie, that was completely still just a moment ago, started shaking and it reminded me of someone having a seizure. The giggle slowly transformed into a whimper, like the one a dog makes when you step on its paw, and his eyes, a few hours ago ignited with rage, were now pouring tears and screaming for help.\n\n\r  \n\r  \nIt was a man. Just a man. Even worse, it was the most unremarkable person I’ve ever seen. If you walked past him, you’d be wondering if you actually saw someone. I’ve tried so many times to describe him somehow, to come up with something that would help me identify him, and so far, I’ve had no luck whatsoever. \n\n\r  \n\r  \nThis man walked towards Dear Sophie, every step pushing him into an even deeper madness, when my heart stopped. Someone or something had licked my hand. I looked down and sighed with relief, at least for a moment. There were dogs sitting around the house, a bunch of them, some peeing on a tree nearby, others sleeping on the grass. This one came and licked my hand. Another blow of wind came and I smelled. Piss. Waste. The air turned oily and nasty, and I covered my mouth and nose to stop the puke that was crawling its way out.\n\n\r  \n\r  \nSuddenly I realized why there were so many dogs. They had followed his crazy master. I looked inside and the empty room was now filled, all of them were there, the insane, gathering around and, in the center of it all, Dear Sophie and the man. They stared at the two of them, waiting, expecting. \n\n\r  \n\r  \nThe man grabbed Dear Sophie by the shoulders, his fingers clawing the trembling flesh, and said:\n\n\r  \n\r  \n\\- “It is time”\n\n\r  \n\r  \nThe whimpering now turned into crying, a lost and lonely cry that seemed to come from someone buried deep inside. Dear Sophie started taking off his clothes, slowly revealing burn marks, scars and cuts all over his body. \n\n\r  \n\r  \nThe man turned around towards the bowl on the table and with a swift movement lit up a bunch of candles inside of it. Someone had turned off the light. The insane empty eyes were bright with fire, the drool that fell from their mouths reflected the flame and, as the expectation grew, they all started to moan. \n\n\r  \n\r  \nA punch struck Dear Sophie in the stomach, that bent gasping for air. The man screamed and went back into the other room. When he returned, he was dragging a middle-aged man, his mouth was covered with a dirty piece of cloth and his eyes bulged with the grotesque spectacle that awaited him. He made him watch all of it.\n\n\r  \n\r  \nThe unremarkable man started… doing things to Dear Sophie. My mind is blurry on this part and I suppose I should be thankful for it. But I can remember clearly… he got naked too and did unspeakable things to him. I was a kid back then and I didn’t know what I was watching, even today I can’t comprehend. \n\n\r  \n\r  \nBut it wasn’t what he did that messed me up. It was what he said in the meantime. You see… that night, surrounded by an orgy of screams, rage, violence and blood, I understood where Dear Sophie came from, since the man just kept screaming:\n\n\r  \n\r  \n\\- “You like that MY DEAR SOPHIE?!”\n\n\r  \n\r  \nI looked away as much as I could, but something about it all was morbidly entrancing, I felt like I was watching something so terrible, so forbidden, that it would make me somehow unique. I was not wrong. \n\n\r  \n\r  \nAt the end of it all, the middle-aged man, now crawled like a ball on the floor, was whimpering just like Dear Sophie did. The unremarkable man picked him up by the hair and removed the piece of cloth from his mouth. His eyes that minutes ago were twisting with horror were now dead, empty, and instead of screaming his lungs out begging for help he just mumbled and drooled. \n\n\r  \n\r  \nAnd then they all left like nothing ever happened, dragging their feet to nowhere, their souls whimpering somewhere inside those broken bodies.\n\n\r  \n\r  \nI feel relief now. You see, I had to do this. That night I didn’t watch all of it, and I guess that’s why I’ve been able to carry on a relatively “normal” life. But lately I found myself forgetting stuff, or waking up in places I don’t remember walking to. At least now I can go in peace, knowing that I’ve told this story, if someone ever wants to do anything about it.\n\n\r  \n\r  \nBut I doubt it, because there’s something that lingers in my mind. And it’s not the fuzzy image of that sick man, if I can call him that, but the face on my friend’s dad when we asked about the name of Dear Sophie. He was about to answer when he realized we were just kids. He laughed at that crazy bastard, mocked him, humiliated him, and all the time he knew the truth.",
    "comments": [
        {
            "level": 0,
            "comment": "PTSD is your new friend.  And I'd guess your friends dad was involved in some way with Dear Sophie - probably a viewer or participant in his torture.  You should get a professional to help you deal with what you saw.   Good luck and don't become one of the tormentors!",
            "score": 10,
            "author": "Shadowwolfmoon13"
        },
        {
            "level": 0,
            "comment": "Wow, that was a lot. Had to read it a few times to fully understand what all happened.\n\nThere's still one thing that confused me though. How did you ever figure out your friend's dad had seen this happen before? Was he one of the people taking part in the event the night you were there? Or is that just because he was originally gonna say something else to you and your friend and you figured he had to have witnessed a similar even prior? Either way your friend's dad def sounds sociopathic. \n\nI'd also see some sort of specialist about those spells you've been having lately, if you can afford it. If I've learned anything from the other tales people have shared here before, the worst case scenario is that something about witnessing the event planted some seed in your brain that'll eventually turn you into the next Dear Sophie",
            "score": 7,
            "author": "AnonymousIVplay",
            "replies": [
                {
                    "level": 1,
                    "comment": "Im not really sure to this day what the hell was wrong with my friend's dad, enough to say that I never got close to him again. As I grew older I realized that there were rumors among the adults about where the name came from, and I think he was going to repeat those to us.\n\nRumors were of course about the poor man being subject to violence ever since he was a child, but none of them came close to the reality of it",
                    "score": 10,
                    "author": "SebaWDK"
                }
            ]
        }
    ]
}