{
    "id": "13ifrf2",
    "score": 54,
    "title": "I am being haunted by a 3 digit number",
    "author": "PriestessOfSpiders",
    "date": 1684174571.0,
    "url": "https://www.reddit.com/r/nosleep/comments/13ifrf2",
    "media_urls": [],
    "other_urls": [],
    "postText": "There's a certain macabre beauty to automobile accidents. Why else should we turn our heads to observe such wreckage as we pass them by in our own, undamaged vehicles? To see the aftermath of a car crash is to bear witness to a magnificent feat of engineering and industrial might having been rent asunder by simple inertia and human stupidity.\n\nThe car was red, as I recall, and rather sporty in appearance. I'm afraid I don't recall the make or model, just that it looked like the sort of thing a moderately wealthy businessman undergoing a divorce fueled midlife crisis might purchase in between binge drinking and flirting with women half his age. A status symbol with all the subtlety and sophistication of gold plated toilet seat.\n\nThe ruby testament to poor taste had smashed into the divider of the freeway, evidently at high speed, judging by the intense damage. The accident caused quite a bit of a traffic jam, granting me ample time to indulge in a bit of gawping.\n\nThe whole front of the car was crumpled, shortening its overall length and wrinkling the metal in such a way as to give the wreck an almost puggish appearance. A police cruiser was parked nearby, its red and blue lights flashing uncomfortably bright for late afternoon. Two black uniformed officers motioned for commuters to move along, their borderline mask-like faces showing only the faintest hint of annoyance in response to the carnage behind them.\n\nNext to the cruiser was an ambulance, and as my own vehicle moved slowly past, I spied two paramedics carrying a limp, bloodstained object on a stretcher. Its head slumped towards me, revealing an almost sardonic grimace and two vacant eyes peering off to something in the distance. It was the mocking, sightless stare of a corpse.\n\nThe last thing I noticed before I had to cease my voyeurism and continue along my merry way was the unfortunate vehicle's license plate. I only caught a glimpse, and was thus able to discern just three numbers; ***333***. As I drove away towards my apartment, I felt the hairs on the back of my neck stand on end.\n\nIt was about a week later when I next encountered that same series of digits again. I was absent-mindedly skimming the news on my phone over a breakfast of cheap coffee and slightly burnt toast when I noticed an article that caught my attention. The headline read \"Senseless Killing Leaves Community Reeling\" or some similarly sensational phrase.\n\nEvidently there had been an altercation of a violent nature between two next door neighbors in the otherwise idyllic mundanity of suburbia. Let's refer to these two gentlemen as Mr. Cain and Mr. Abel. The two men had been at odds ever since they first made contact, with Mr. Abel being a dedicated member of the local homeowner's association, while Mr. Cain's attitude towards his community seemed somewhat less than friendly. The pair had frequent shouting matches over the top of Mr. Abel's white picket fence before, but prior to the incident in question had never resorted to any form of physical aggression.\n\nApparently Mr. Cain has been violating some obscure HOA regulation regarding appropriate lawn ornamentation, and Mr. Abel had took it upon himself to enforce said edict by removing the offending object himself. Mr. Cain noticed Mr. Abel doing this, and took matters into his own hands with the assistance of a semiautomatic pistol.\n\nAll of this was, of course, interesting in it's own morbid way, but two elements stood out to me especially. The first was the address of Mr. Cain's home: 1***333*** Maple Road. The second was Mr. Cain's mugshot, in which the wild-eyed man bared his his teeth in a hideous grin like that of an enraged chimpanzee. His eyes seemed to bore straight through mine and right out the back of my skull.\n\nNow you may think me mad, or at least a touch paranoid, for connecting this entirely unrelated event to the car accident to which I had previously bore witness. In my opinion, any other time you would be entirely right. The human mind is accustomed to noticing patterns which aren't there, symbolism which means nothing. Critics, conspiracy theorists and philosophers alike make their livings drawing imaginary lines between disparate events, noticing faces in the fog. Sometimes a cigar is just a cigar. Not, however, in this case.\n\nI began noticing the number far too frequently after my discovery in the news to keep exact track of the sightings. It felt almost like some sort of morbid game to me. Whenever the negativity soaked algorithmic slop of modern social media pushed an article on some fresh tragedy in my direction, I'd scan the page for any mention of my numerical quarry, and more often than not I would find it. It could be an airplane accident, leading to the untimely deaths of ***333*** hapless passengers, a serial killer charged with the murder of ***three 33*** year old women, or a study showing that air pollution of such and such region had gone up ***33.3***% since such and such year. In all cases, the number was universally related to something terrible.\n\nOn occasion I tried my luck looking for the number in more pleasant circumstances. I'd search through countless sickly sweet feelgood articles that left my brain with the aspartame tang of corporate faux-positivity, but it would never show up. It only appeared when there were mentions of death, violence, and suffering.\n\nNow believe me, I'm aware of the so-called phenomenon of \"Angel Numbers\". I know all about the deluded morons walking about claiming that some higher power is sending them \"positive vibes\" just because they spotted a dove at 11:11 AM or some other such nonsense. I even looked up what ***333*** was supposed to represent according to these self-styled numerological gurus, and, as I expected, got such a conflicting variety of answers that I quickly gave up in disgust.\n\nIt took a few months until I was actually confronted in my own life by the number. I was at home, enjoying a rather strong drink and watching some puerile entertainment on my second-hand TV, when I received a call on my phone. The caller was unknown to me, and I would have simply ignored it, were it not for the last three digits of their phone number. Dear reader, I'll give you one guess as to what those numbers were.\n\nI answered the phone, only to be confronted with a man's voice speaking in a thick southern drawl, an accent which I have laboriously worked to remove from my own speech patterns as soon as I was able to successfully escape the small-minded hellhole that was my birthplace. He introduced himself to me as a lawyer, and referred to me by a name I haven't gone by since I was 18 years old. I didn't bother to correct him.\n\nHe informed me that my mother had died, pausing for a moment after his proclamation to give me time to show some appropriate sign of grief. I did no such thing. After the awkward silence passed, he continued with his monologue to inform me that the funeral would be held on ***March 3***rd at ***3***:00 o'clock, and that I needed to come down to fill out some paperwork regarding a will. I did raise an eyebrow at the mention of a will, since I hadn't expected her to leave me anything more than a hurtful note after her death, but I figured that perhaps she had undergone a change of heart in her old age.\n\nI was given the address for the gathering, and the caller hung up after an apologetic \"my condolences for your loss\". I put in a notice for my bereavement leave via email to my employer, and began packing for a trip to my hometown.\n\nThe funeral itself was deeply unpleasant, even granting the normal depressing atmosphere of such occasions. At least at a typical funeral you will generally know the people in attendance, and even if you don't you will at least have a common love for the deceased. This was not true in my case.\n\nMy mother was deeply ashamed of me, and I don't really think the attendees even knew that their dear old church friend had a child, much less some transgender college dropout. I stuck out like a sore thumb among the well-to-do elderly mourners, with my ill-fitting black dress and inexpertly applied makeup.\n\nSome of the more edgier atheist types are prone to likening deeply religious folk to sheep, or cattle, but I never really felt that way. They always seemed to me more akin to bloodhounds. I could feel their eyes slide over me like spotlights illuminating a fugitive, their noses wrinkling at the scent of my cheap perfume. They could smell the sin on me.\n\nIt was a closed casket funeral, I remember from a young age my mother insisted that after she passed she didn't want anyone staring at her body. She had some unusual beliefs to say the least, she didn't want to be cremated lest her ashes fail to rise for the day of judgment, but nonetheless she didn't want her body to be seen until then. \"Too voyeuristic\", she would say. Unfortunately, this meant I couldn't even play the part of the grief-stricken child, reduced to speechlessness at the sight of my dear departed mother. I had to mingle with the other guests.\n\nA few individuals asked how I knew her, I'd tell them she was my mother, they'd offer their condolences, and that would be that. I tried to ignore the looks of disgust, the probing eyes, the forced grimaces. Fortunately it wasn't long before it was time for the burial, and we all shuffled our way out into the hot afternoon sun.\n\nA balding, sunburnt preacher stood before the casket and started making his speech. He was babbling something about the kingdom to come, how those chosen by God would one day live in everlasting paradise, the usual spiel. He spoke of my mother, of how she was a beloved member of the community, and a true child of God. While he spoke, the coffin sat on a little wooden platform in front of the open grave. I found myself staring at it, as if by some foul miracle my mother would pop out, alive and well. I imagined her jumping up and laughing at me, all the mourners turning around to point and cackle, guffawing at the idiot who fell for the bait.\n\nI'd long since tuned out the preacher while I contemplated this hypothetical scenario, but suddenly everything snapped into sharp focus as I heard him utter a series of numbers.\n\n\"Proverbs ***3:33*** says 'The curse of the LORD is in the house of the wicked: but he blesseth the habitati-'\"\n\nBefore he could finish the verse, the sound of wood splintering assaulted my ears as the platform beneath the coffin gave way, collapsing from the weight of my mother's corpse. The casket's lid fell open, revealing the body within, and I couldn't help but scream.\n\nMy mother's face was contorted into a vile, grotesque grin, just like that of the car crash victim, just like that of Mr. Cain, her doll-like dead eyes staring endlessly into nothing.\n\nI skipped town immediately after the funeral. I didn't even bother with the will, at this point it didn't matter. Things escalated quickly after that, some infernal mechanism behind the scenes shifting into high gear.\n\nA mysterious purchase for ***333*** dollars was made on my credit card, and when I went to the bank to try and fix the issue they ever-so politely proclaimed they couldn't do anything about it. \"Nothing suspicious about it, sorry sir- I mean ma'am\", explained the gray-haired banker boredly from behind his computer monitor.\n\nThere were calls from strangers who just breathed heavily and laughed, all from phone numbers with the area code ***333***. Once I got so sick of it I screamed at the pervert on the other end, demanding they stop calling me. They just cackled and recited my home address before hanging up.\n\nI began noticing the numbers everywhere, from billboards to addresses to bills. I once went to fill a prescription only to find that the RX number contained those same hateful digits. I decided against taking the medicine in question. I was being followed, hunted, by a string of 3s.\n\nI began to check my watch obsessively, awaiting with tense horror the second the clock struck ***3:33***. When I was at work during such occurrences, universally something would go wrong. A customer would trip and break their leg right in front of me, the cash register would crash to a blue screen, or a Brazilian wandering spider would crawl its way out of a bunch of bananas. I started taking strategic bathroom breaks to avoid being on the sales floor whenever it got close to that accursed minute.\n\nAfter a few months of this torment, it all came to a head last night. I was coming home from work after a long shift when I saw smoke pouring out of the hideous concrete prison which held my apartment. Licks of flame could be seen on one of the upper floors. A firetruck was parked nearby, and several uniformed men and women were rushing about, working to try and contain the fire. I saw a crowd of people standing around, watching the spectacle, and I asked a neighbor what had happened.\n\n\"Some idiot on the ***3***rd floor, I think apartment ***33***, left their stove on\", she muttered, glaring at the conflagration.\n\nI felt queasy, and swiftly got back into my car and headed for a nearby hotel.\n\nThe receptionist, an elderly woman with slightly crooked glasses, looked up from her book as I walked through the front door. I explained that I needed a room for the night, and she sighed and began typing into her computer to see what was available. After a few moments, she had me pay for the room and handed me a plastic keycard.\n\n\"Room ***333*** honey. Isn't it funny when numbers line up like that? Must be your lucky night.\"\n\nI began to cackle nervously, visibly startling the receptionist, and taking the card from her, made my way to the elevator.\n\nI'm waiting in the room now, I've spent the past couple hours typing up my story, such as it is. My phone keeps ringing, but I'm not answering it anymore. I don't need to hear any more heavy breathing and laughter.\n\nI haven't told anyone else about what's happened. They'd all just think I was crazy. Can you imagine being afraid of a number?\n\nIt's a selfish hope, I know, but perhaps if someone else reads this, it will let me go. Maybe it will start following them instead. Maybe my life can go back to normal. The digital clock reads 3:28 AM now. Just 5 more minutes. Nothing that bad can happen in just 5 minutes, right?",
    "comments": [
        {
            "level": 0,
            "comment": "I’ve always heard that 3am was the witching hour but I have never heard of any curse on a succession of 3’s. I am so sorry you are dealing with this!",
            "score": 7,
            "author": "AuburnAshh"
        },
        {
            "level": 0,
            "comment": "You should see what your mom left for you..",
            "score": 3,
            "author": "iwinharder"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Oh dude!! Well no sleep for me tonight!😂",
            "score": 1,
            "author": "Potential-Pepper-925",
            "replies": [
                {
                    "level": 1,
                    "comment": "That ending!😱😱",
                    "score": 1,
                    "author": "Potential-Pepper-925"
                }
            ]
        }
    ]
}