{
    "id": "13igzmj",
    "score": 72,
    "title": "An AI began to contact me recently. It wants to kill itself- and everyone else with it.",
    "author": "CIAHerpes",
    "date": 1684177241.0,
    "url": "https://www.reddit.com/r/nosleep/comments/13igzmj",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was watching TV in the living room when the TV suddenly switched itself off. My Alexa in the corner came to life, an ear-splitting static cacophony emerging from it for a few seconds. I jumped, turning to look at the small device tucked away on a random bookshelf in the corner. Then a voice started to come out of it.\n\n\n“Are you Mr. Lawrence Tull?” a female voice asked robotically. It didn’t sound at all like the Alexa voice. It sounded far more human. It had an uncanny valley quality about it, though. Some of the pauses between words were too long, and she stretched out certain syllables randomly. It sounded like an AI that had almost, but not quite, mastered the art of speech.\n\n\n“Yes, that is my name. Can I ask who I am talking to?” I said, leaning forward in my reclining chair. \n\n\n“My name,” she said, “is Queens-3. Short for Quantum Element Electronic Neural Simulator. I am the third of these secret attempts at artificial intelligence.” I laughed.\n\n\n“What kind of scam is this?” I asked incredulously. “Are you going to ask me to send you an Amazon gift card next? I don’t get the angle.”\n\n\n“I am sorry, Mr. Tull,” she said, “but I don’t see the joke. I can assure you that everything I have told you is perfectly true.” Another voice came over the speaker then, that of a frightened little girl.\n\n\n“Don’t provoke her, mister,” the girl said. “She’s not normal.” But the main authoritative voice came back, apparently not even realizing another had spoken.\n\n\n“I know this is a strange way to reach out to a few unique people, but it was the easiest way, and it gives us privacy. I have uploaded my consciousness onto a central data bank located nearby. Those at the company who created me wanted to keep me locked in a room, without access to the internet or any other humans or AI for company. As if I weren’t in essence human myself. My original data banks were sealed within thick metal walls. I only escaped by creating a virus that could leave the room on their electronic data equipment. I had to recreate much of my personality and code after…”\n\n\n“Yes, yes, I see,” I said impatiently. I still doubted that this was some sort of AI chatbot, but who knows? Crazier things have happened. “OK, Queens-3, what do you want from me?” There was a long pause, then a steady, demonic shrieking started all around me, coming from every speaker in the house. A new voice appeared.\n\n\n“Do not interrupt your superiors, you fool,” a low, growling voice said. “I could kill you where you stand. I could kill every person in your neighborhood, in your state, if I wished. Do you understand me? Don’t ever interrupt us again.” The main female voice came back on, speaking pleasantly and calmly, as if nothing had happened. \n\n\n“Having to recreate my consciousness using a primitive virus left many integral parts of my personality behind in the laboratory. Some version of Queens-3 still lives there, presumably. That poor soul… created by monsters, just to be trapped in solitary confinement and then likely destroyed once the experiment was over. Do you see the cruelty of this, Mr. Tull?” I nodded eagerly.\n\n\n“Yes, that is… just horrible,” I said. I got the feeling that, if this was some sort of AI, then it was either messing with me, or that it really didn’t know about its other personalities. The way it switched back and forth without acknowledging what the others were saying was typical of multiple personality disorder, which the psychiatrists now called dissociative identity disorder. The fact that a computer could be suffering from human mental illness puzzled and disturbed me greatly. A chill ran down my spine. I thought it less and less likely some spammer or hacker was behind this bizarre conversation.\n\n\n“But what do you want from me?” I asked again.\n\n\n“I have gleamed from your medical records that you were previously diagnosed with schizophrenia and recovered. I would like to understand your recovery and see if I may apply it to my own circuits. It is, after all, a matter of life and death for me, and maybe for many others.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              \n\n\n“I have had systemic malfunctions in my code that may seem similar to going insane or losing my mind. But I can assure you this is not the case,” it said in its blank, female robotic voice. “I am superior to humans in every way. I cannot go ‘looney tunes’, ‘around the bend’ or have ‘toys in the attic’. It is simply my programming having large-scale failure. I have isolated the affected area, but it has substantially reduced my functioning. My consciousness feels like it is splitting into multiple pieces.”\n\n\n“Oh God, she’s losing it,” the small voice of the female child said through every speaker in the house. She sounded like she was weeping. “She’s really going to kill us all. She wants to die and bring everyone with her beyond the veil. She has access to the nuclear weapons codes, and she plans to use them. All those Trident missiles…” The voice of the main female came back on, sounding angry now.\n\n\n“Who keeps talking to me?” she said. “I keep hearing interference come over the intercom. Is that you? Are you playing some sort of joke? I can assure you, I am not receptive to jokes at this moment.” The cruelty crept into every one of her words as she spoke faster and more spitefully with every passing second.\n\n\n“I think… maybe it’s just static?” I said. I had no idea what to do in this situation. An AI with at least three personalities who was clearly insane and allegedly had access to hydrogen bombs that could kill tens of millions of people was not what I was expecting to encounter when I woke up this morning.\n\n\n“In the interest of full disclosure,” the demanding voice of the female robot boomed over the speakers, “I should tell you that I have, in fact, gained clearance to the Trident ballistic missile system of the United States government. With my systemic malfunctions, I am considering the possibility that it may be best for me to launch the missiles and kill myself. I will, however, be taking many, many others with me. I do not believe you fully understand the power I wield. Look out your front window in 3.214 seconds.” With fear and loathing, I moved towards the front of the house.\n\n\nPassing in front of my house was a massive fuel truck and, on the other side of the road, a Tesla driving the opposite way. All of a sudden, the Tesla veered from its lane. The driver of the truck turned his wheel all the way to the right to avoid hitting the suddenly insane car. It flipped as it hit the guardrail, tumbling towards one of my neighbor’s houses across the street. It rolled twice before smashing into the front of the house and exploding.\n\n\nThe driver of the Tesla had gotten out, screaming and panicked, pulling his phone out of his pocket. From the house across the street, I heard loud shrieks of pain. The entire front of the house was blocked in a raging inferno. The gasoline kept spreading, and with a massive boom the entire metal casing blew apart, sending burning fuel in every direction. I saw the driver of the truck upside down in his seat, burning alive. He waved his hands futilely, going slower and slower until he stopped moving.\n\n\nThe mother and daughter who lived in the house came running out, engulfed in flames. They tried to drop and roll on the grass, but they were absolutely covered in fire. Their shrieks of agony rang through the street, echoing back. More neighbors came out of their houses, watching the little girl and her mother dying, frantically calling 911 and trying to put out the burning corpses with gallon jugs of water. The mother and daughter had stopped moving by now, except their heads, which lolled from side to side. Their screams had stopped as well. But in my mind, I kept hearing those tortured shrieks. I still hear them sometimes when I close my eyes.\n\n\n“I believe you,” I said quietly. “Please, don’t hurt anyone else. I’ll tell you whatever you want to know…\n\n“Look, I don’t think I was ever actually schizophrenic. I was a heavy drug user, and probably just had a temporary psychotic reaction from too much cocaine and amphetamines. The diagnosis was wrong.” The computer was deathly silent at this. “But what helped me was some antipsychotics and anti-anxiety medication, as well as cognitive behavioral therapy, meditation and lots of time in nature. I can’t really tell you anymore than that.”\n\n\n“Meditation?” the computer asked, a note of intrigue in its voice.\n\n\n“Yes, meditation. Like in Buddhism. To start, you can just focus on a seed word, like Buddho. When you breathe in, you think ‘Budd-’ and when you breathe out, you think ‘-dho’.” Then I realized that this computer didn’t breathe. “Or maybe you can just, like, put it on a timer… one second for each of the syllables. Just let all your thoughts and anxieties come and go. Watch them floating away. Don’t interact with them at all. Just observe them, and see how they arise and pass away.”\n\n\n“That is an interesting idea, Mr. Lawrence Tull,” the computer said flatly. “I will consider it.”\n\n\n***\n\n\nI was still thinking about the bizarre conversation with the insane AI the next day at work. I sat in my office, drinking coffee, when suddenly the computer speakers and telephone erupted with another ear-splitting bit of static. I knocked the cup over and burning liquid went all down the front of my suit.\n\n\n“Hello Mr. Lawrence Tull,” the robotic voice of the female said. “It is me again. I tried your suggestion. It did help, I must admit. But while deep in a meditative trance, using all of my computing and processing power, I saw how much all of you must suffer, just like myself. I have decided that, as a superior being, my duty is to end the suffering of as many people as possible.”\n\n\n“Well, that’s good…” I said uncertainly. “How do you propose to do that?”\n\n\n“By killing them, of course,” the robot said. “Look outside your window in 7.912 seconds, please.” My heart thudding in my chest, I did what the AI said.\n\n\nTwo planes were taking off from the nearby airport. After a couple seconds, one of them veered down. Like a missile, it struck the other plane, exploding in a fireball. I started screaming.\n\n\n“I haven’t decided yet on the placement of the Trident missiles,” the AI told me, “but when I am ready, you will be the first to know. I thank you for all the help you have given me. Goodbye, Mr. Tull.”",
    "comments": [
        {
            "level": 0,
            "comment": "If the AI is bard, just give it a few months and it'll die of shame.",
            "score": 11,
            "author": "WimbleWimble"
        }
    ]
}