{
    "id": "13jbmsy",
    "score": 21,
    "title": "The origin of the white car, the Dullahan, and the Cú Sidhe",
    "author": "lunanightphoenix",
    "date": 1684258318.0,
    "url": "https://www.reddit.com/r/nosleep/comments/13jbmsy",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/nosleep/comments/1034ykd/i_am_an_exterminator_for_the_supernatural_and_im/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=ioscss&amp;utm_content=2&amp;utm_term=1"
    ],
    "postText": "Part 3:\n\nhttps://www.reddit.com/r/nosleep/comments/1034ykd/i_am_an_exterminator_for_the_supernatural_and_im/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=ioscss&amp;utm_content=2&amp;utm_term=1\n\n\nSorry, I know it’s been a while since you’ve heard from us. We’ve been so busy recovering from our various injuries, cleaning up debris, helping Aunt Kathy repair her house (again), getting to know Naoise and Manannan, teaching the Cú Sidhe some basic English commands, returning the monster’s stolen body parts to their owners’ families, submitting our account of the whole debacle to the Bureau of Supernatural Services regarding the newly discovered American Dullahan because obviously those are now a thing…\n\nAll right, enough avoiding it. I’ve just gotta face it. This entire ordeal messed me up badly in the head. It messed all of us up, but for some reason I was the most affected. Maybe it was because I was the first person to have physical contact with it? I don’t know. Since this is the first American Dullahan encounter that has ever been documented, it’s certainly possible that it has unknown abilities. It was able to trap Dana in her first sleepwalking episode in years and bring her right to it, so I don’t see why it couldn’t mess with someone’s mind…\n\nBasically, I had some serious PTSD. Every time I tried to type this post over the past several months, I would immediately start getting flashbacks and go into a panic attack. Apparently since the Dullahan was dead, I finally had time to feel all the emotions that I had been able to cover up with my adrenaline and protective instincts. That combined with whatever the heck the Dullahan did to me before we finally managed to kill it caused me to have a small mental breakdown.\n\nDana somehow managed to contact the BoSS (she said it’s best if I don’t know how she did that). After some discussion among the bosses of BoSS (sorry, couldn’t resist), they decided that they would be able to help me without breaking any rules or confidentiality. They were not particularly fond of the idea of a girl who gets supernatural premonitions potentially having flashbacks of a battle with a creature that is not supposed to exist in public.\n\nRegardless of their motivation, we were all incredibly grateful for the help. After several months of anonymous therapy sessions with a therapist specializing in supernatural trauma, my PTSD has diminished to the point where it doesn’t take over completely anymore. It still affects me and probably always will, but I can control it now for the most part, hence why I can finally write this post.\n\nAfter Dana and I were released from the hospital, we got a phone call from the exterminator. He discussed what had happened with us and said he would be on his way as soon as he found some gold. I asked why he needed gold and he explained that gold is the only known weakness of the traditional Irish Dullahan. The problem was that he wasn’t 100% sure that the gold would work because this Dullahan was some sort of evolved form of the Irish Dullahan. Unfortunately the Bureau of Supernatural Services had no information on this form of Dullahan, so we would just have to hope that this would work. After informing us that he would be at our house a little before sunset, we ended the call.\n\n“Luna, you feel that itchy feeling on the back of your head too, right?”\n\n“Yep. Any ideas for a Plan B, Dana?”\n\nAs I mentioned in Part One, Dana and I feel strange sensations when something is wrong or something bad is about to happen. The last time we felt this sensation was when our town was preparing for a bad ice storm that was almost certainly going to take down power lines. Mom made sure that we had two racks of firewood in case our generator froze. She offered to help our paternal grandmother get firewood, but grandma insisted that she would be fine since she had a generator. Dana and I felt this same itchy feeling on the back of our heads and tried to get grandma to change her mind, but she wouldn’t listen.\n\nThe generator ended up freezing when grandma and grandpa lost power. Dad had to bring them to our house until they had power again so they wouldn’t freeze.\n\nIn other words, as awesome as the exterminator is, Plan A was just not going to work. We needed a backup plan.\n\n“Do you think Aunt Kathy might know how to contact Deirdre’s old owner? If she knew what Deirdre is, there’s a chance that she might know a way to beat this thing.”\n\n“That’s brilliant, Dana!”\n\nWe found Aunt Kathy behind the house by the lake. I was still trying to rest my throat as much as possible so it could finish healing, so Dana did the talking.\n\n“Aunt Kathy?”\n\n“Yes, Dana? What’s up?”\n\n“Luna and I were wondering if you have a way to contact the friend that gave you Deirdre. We think she might know something that could help us.”\n\n“Oh, actually, I have her address! Orla ended up moving into a smaller house than the one that was destroyed. She’s about 30 minutes away from here.”\n\nAfter Aunt Kathy gave us the address, we told Mom that we were heading out to visit a friend of Aunt Kathy’s. Mom was understandably concerned based on everything that had happened recently, so she told us to take Deirdre with us.\nDeirdre excitedly jumped into the car. I smiled and was about to get behind the wheel when Dana snatched the keys out of my hand.\n\n“Aren’t you forgetting something, Luna?”\n\n“Huh? What are you talking about?”\n\n“It’s my turn to drive this week.”\n\nA sense of dread slowly crept over me.\n\n“Dana, we made that agreement for use at home. You have no idea what the roads are like here in Florida, especially with the ongoing hurricane recovery.”\n\n“So? You never specified that the agreement only applies when we’re home, so it’s my turn.”\n\n“We just got out of the hospital a few days ago! Are you trying to put us back in?!”\n\n“Luna, come on, I’m not that bad at driving.”\n\nI just stare at her. “Do you not remember the passing disaster two weeks ago?”\n\n“I didn’t do anything wrong! We were stuck behind a tractor going 10 miles per hour in a 55 mile per hour zone that allowed passing!”\n\n“Dana, you were driving uphill! You couldn’t see the cars coming at you and you almost got hit!”\n\n“It was fine, Luna! He missed us by at least ten feet!”\n\nI threw my hands in the air in frustration. “That’s still too close! And let’s not forget about driving on the sidewalk for a full thirty seconds-“\n\n“The road was iced over!”\n\n“-hydroplaning during that thunderstorm last month-“\n\n“It was too dark to see the water!”\n\n“-dragging that traffic cone for ten miles-“\n\n“We were on a four lane road and I couldn’t switch lanes to avoid it!”\n\n“-and of course the incident with the chocolate milk tru-“\n\n“You promised never to speak of that again!”\n\nI sighed in frustration. “Dana, give me one good reason why I should let you drive the car.”\n\n“I’ll buy you a warm Starbucks brownie every day for a whole week.”\n\n“…”\n\n“…”\n\n“…two weeks.”\n\n“DEAL!”\n\nDana excitedly jumped behind the wheel and I reluctantly got into the passenger seat. “Dana, at least try to be careful, okay? Deirdre may be essentially indestructible, but we’re not and there’s no way Mom and Aunt Kathy can fight this monster without our help.”\n\n“Alright, alright, I’ll try to be careful.”\n\nAfter surprisingly surviving the 30 minute drive, Dana pulled up to a nice but small house. As we all got out of the car there were suddenly two deep barks. We turned towards the house and two massive black dogs came out of nowhere and started barreling towards Deirdre. Dana and I panicked for a moment until we realized that Deirdre apparently knew these dogs based on the way she ran to meet them and happily started playing with them.\n\nWhile we were trying to figure out how Deirdre knew these dogs, the front door of the house opened and a kind looking woman who looked to be in her early sixties began walking towards us. While the dogs did their thing, Dana introduced us.\n\n“Hi, miss! I’m Dana and this is my sister Luna. Are you Orla? Our Aunt Kathy told us that you were Deirdre’s previous owner.”\n\nThe lady smiled at us and started to speak with a lovely Irish accent. “Yes, I am Orla. It’s so nice to meet you girls! Kathy talks about you two a lot and I was hoping I would be able to meet you one day. Please excuse Naoise and Manannan. It has been quite some time since they have seen their sister.”\n\n“Miss Orla, could we please go inside if you don’t mind? We have some questions that we need to ask you. It’s extremely important,” I said.\n\nOrla’s warm smile quickly turned into a frown. “Oh dear, of course! I’ll help in any way that I can. Please come in! Deirdre, Naoise, Manannan, teacht!”\n\nAfter we had all found seats (or floor spaces) in the living room, Orla turned to us. “Now, what’s going on, girls? I’ve raised Deirdre and her brothers since they were puppies and I can tell that Deidre is on edge about something. I can also see a fading bruise shaped like a handprint on your throat, Luna. What happened?”\n\nDana and I looked at each other uncomfortably trying to figure out what to say. I decided to just ask. “Miss Orla, do you know anything about an Irish creature called a Dullahan?”\n\nOrla’s jaw dropped, then she stood and started pacing the room angrily while muttering some Irish phrases that I assumed were not very polite. All three dogs had started growling after I said the name of the creature.\n\nI wasn’t quite sure what to say to that, so Dana decided to speak up. “Miss Orla, I’m sorry, but could you please speak English? Luna and I don’t speak enough Irish to understand what you are saying.”\n\nOrla stopped pacing, gave the dogs a command that made them stop growling, turned to face the two of us, and sighed. “Oh, girls. I am so, so sorry that I dragged you into this. This is all my fault.”\nDana and I were extremely confused. How was the Dullahan’s attack the fault of this sweet and kind woman?\n\n“I can see that you girls are very confused. That’s completely understandable. I know you have a lot of questions and I will gladly answer all of them to the best of my ability, but first I need to tell you the history between me, this Dullahan, and the Cú Sidhe.\n\n“It happened about five years ago. I still lived in Ireland at the time. I was walking home from visiting a friend on the other side of my little village. It was around midnight, but I didn’t think anything of it since there was essentially zero crime in our village. I had just reached the main crossroads when I heard the sound of horse hooves on the road. I figured it was just one of the villagers on their way home, so I kept walking. When the carriage came alongside me, I turned to say hello to the villager and froze in shock.\n\n“The horses didn’t have heads. It was a Dullahan’s carriage.\n\n“I stood as still as possible and did not look at the carriage driver. As long as the carriage didn’t stop, I would be safe.\n\n“It stopped.\n\n“I started to hyperventilate and looked up to see the Dullahan climbing off the carriage and walking towards me.\n\n“What made me even more frightened was that this Dullahan’s head was still attached to its body. Dullahan literally means “without a head”, so this one still having its head attached to its body told me that something was very wrong with this one. I had no idea what to do, so I just did nothing and accepted that it was going to kill me.\n\n“Just as it was about to wrap its hand around my throat, something jumped in front of me. It was Granuaile, the village Labrador Retriever. She was growling and barking at the Dullahan in an attempt to protect me. The creature simply laughed at her and raised its whip. I crouched down and wrapped my arms around her in a vain attempt to protect her from being harmed. The Dullahan was just about to bring its whip down upon us when there was a huge angry roar that shook the ground followed by the Dullahan letting out the most horrific sound I have ever heard in my life.\n\n“I looked up to see what appeared to be a huge black dog blocking my vision. It was a Cú Sidhe. They are known to haunt crossroads but no one in the village had any idea that one haunted ours.\n\n“As the Dullahan continued shrieking I was able to make out some of what it was saying. It was ranting about never getting to take any lives because of Cú Sidhe interfering every time it tried. Apparently there was some agreement among the Sidhe that because it wasn’t a “proper” Dullahan it should not be allowed to take lives. It also said something about this being the last time it would be denied its prey and that it would find me again one day. It suddenly disappeared along with the horses and carriage as if it had never existed in the first place.\n\n“The Cú Sidhe turned to me and Granuaile. As I wondered what it was going to do to us, I suddenly heard a gruff, otherworldly voice speaking to me in my head. It was the Cú Sidhe. He said that our bravery and willingness to give our lives for each other had truly impressed him, so he decided to help us since we were on his crossroads. He confirmed that the Dullahan was not finished with me and would find a way to hurt me again in the future, so he was going to give me some protection. Granuaile happened to be in heat at the time, so he was going to mate with her. He explained that the resulting puppies would be my protection. They would be half Cú Sidhe and would have all of their father’s abilities, but the lab from their mother would decrease their size to help them pass as huge but normal dogs as well as give them the loyalty and love that their mother had shown to me. He told me to go home and that he would send Granuaile to my cottage when it was time for the puppies to be born. After they were weaned, they would be mine to do with as I pleased.\n\n“I thanked him for his help and somehow managed to make my way home. Granuaile showed up at my front door two months later ready to have her puppies. She gave birth to two males and one female. I named them Deirdre, Naoise, and Manannan. Once they were weaned I moved to Florida with them. I knew that the Dullahan would still be able to find me somehow, but I hoped that moving here would give me a bit more time. When the hurricane destroyed my house, I somehow knew that the Dullahan would take advantage of the aftermath to try and attack me.\n\n“I asked Kathy to take Deirdre to hopefully protect her. She inherited her father’s red eyes and I was worried that the Dullahan would try to kill her if he saw her eyes because of what her father did to save me. Naoise has green eyes and Manannan has blue eyes, so I figured that it would be safe to keep them with me.\n\n“I am so sorry, girls. The Dullahan said he was going to find a way to hurt me one day, but I had no idea he would go after my friends.”\n\nDana and I were stunned. Once we had taken a minute to process all of that, we reassured Miss Orla that none of this was her fault and that we did not blame her at all, which seemed to help put her at ease. Dana pulled out the list of questions we had put together and crossed out most of them since Miss Orla had already answered them. She then handed her the remaining questions.\n\n“Okay, girls, let’s see here. I honestly have no idea why the Dullahan is driving a white sports car. It’s certainly inconvenient to drive a horse drawn carriage in Florida. I’m not sure how it got Dana to sleepwalk to it. The Irish Dullahan does not have an ability like that.\n\n“As for a weakness, the only weakness that a Dullahan has is gold.”\n\nI explained to her what the exterminator’s plan was and she shook her head. “That’s not going to be enough to kill it. That’s definitely enough gold to hurt it, but not kill it. I do have something that will, though. Do either of you girls know how to shoot a hunting rifle?”\n\n“I do,” I said. “Grandpa was in the army and he taught me how to shoot.”\n\n“How good is your aim?”\n\n“I’m definitely no sniper, but my aim is pretty good.”\n\nMiss Orla got up and left the room. She came back a few moments later with a hunting rifle and a box of ammunition.\n\n“Luna, this is a box of armor piercing bullets. They are coated in a thin layer of pure gold. There are about a dozen of them. Even if you can only get one bullet into the Dullahan’s skull, it will incapacitate him long enough for the exterminator to use the other gold to finish him off for good. I’ve had this hunting rifle specifically modified to fire these bullets.”\n\nI carefully took the rifle and the bullets while Dana expressed our thanks.\n\n“Also, take Naoise and Manannan with you, girls. Deirdre will likely need her brothers as backup in this fight.”\n\nNow that we had a good Plan B, we could head back home and get ready to… ready to… to…….\n\nHey guys, this is Dana. Luna is alright. She had another flashback. Her therapist expected this to happen and she should be able to write the rest of what happened within a few days after she takes some time to cope. I hate that this happened to her and I’m so glad we killed that thing. It was a crazy fight and you guys will definitely enjoy it, but I’m not good at writing that stuff, so I’ll wait until Luna can write it. Thank you all for your help and support and Luna will hopefully be able to post the rest soon!",
    "comments": [
        {
            "level": 0,
            "comment": "\n\nIt looks like there may be more to this story. Click [**here**](https://www.reddit.com/message/compose?to=UpdateMeBot&amp;subject=Subscribe&amp;message=SubscribeMe%21+%2Fr%2Fnosleep+%2Fu%2Flunanightphoenix) to get a reminder to check back later.\n\nGot issues? Click [here for help](https://www.reddit.com/r/nosleep/wiki/nosleepautobot).",
            "score": 1,
            "author": "NoSleepAutoBot"
        }
    ]
}