{
    "id": "13n0kag",
    "score": 118,
    "title": "I was an open kid. But after a friend...I never came out of my closet.",
    "author": "Shrignolds_intenas",
    "date": 1684602929.0,
    "url": "https://www.reddit.com/r/nosleep/comments/13n0kag",
    "media_urls": [],
    "other_urls": [],
    "postText": "One early morning I was in class. I was probably about 9 when this happened. My teacher got our attention and had an announcement. \"Everyone I would like you to meet our new student!\" A young pale boy walked in. He looked very strange. He never lifted his head. Of course, my teacher sat him next to me.\n\nI noticed he put a book right in front of his face. \"Hey!\" I whispered not wanting to get yelled at. The pale boy pulled down his book and looked over at me. I will always remember his face. He had a pair of blue warn-out glasses and a surgical face mask.\n\nBased on the fact this happened in the 2010's this was a very weird sight. The boy did not say anything he just stared with his big grey eyes. He then slid me a note. It read: \"Do you wanna play with me at recess?\" With the cheesy yes or no. I of course drew a circle around yes.\n\nA few hours later the bell rang to signal recess. I was looking for the pale boy I met in class. I thought he might be at the playscape. No. \"Is he at the blacktop?\" I thought. Nope. \"Well, then he must be at the field.\" But he wasn't. I then looked everywhere for this little boy!\n\nI finally found him in a dark corner in an empty room no one went to. He was just sitting there...staring at me. He then got up and walked towards me. He gave me a note. \"Do you wanna know what's under my mask?\" It had the same yes or no and a smiley face.\n\nI did not know what to circle at first but after contemplating for a while I circled yes. The boy looked at the note. He didn't show a smile or an annoyed look he just was numb. He then grabbed his mask. He pulled it down slowly. My excited grin turned to a scared frown. The boy had no mouth but instead, a bloody jaw covered with guts and staples.\n\nI was about to scream in horror but the boy covered my mouth and handed me another note. It read in an old fashion font: \"Mommy did this. She hurt me.\" Written over and over and over again. He handed me another note: \"Mommy did a bad thing.\"\n\nI screamed in fear. I ran out of the room crying. All the adults came to my aid seeing the small hand prints on my neck. \"OH MY GOD WHAT HAPPENED?!\" the worried teachers said. I told everything about the pale boy about the notes. The adults quickly ran into the room. Instead of taking out the pale little boy, the adults came out with a normal boy.\n\nI was confused. \"That's not the boy!\" I shouted slapping their arms off him. They looked confused. \"Well, he must have run off then because this little boy was the only one close to the door outside of the room.\" I knew something was up after that. I told the teachers it was fine.\n\nAs I was walking home I saw a note sticking out my left pocket. I pulled it out to read it. I hesitantly unfolded the piece of paper it said: \"Blue bunny lane.\" I searched everywhere for this blue bunny lane. I took lefts and rights and turns until I finally found a sign that read blue bunny lane. I observed every house until I found a suspicious house.\n\nIt had black walls and a brown roof. There was an iron fence rapped with grey vines. But worst of all there was the creepy gargoyle. It was a disgusting brown color with razor-sharp teeth. I slowly walked up to the front door. I actually hoped it was locked to keep myself from going in but unfortunately, it was not. I quietly opened the door.\n\nThe first thing I saw was a woman around 40 or 50. She was humming in the kitchen while cooking. A young boy walked in. I gasped. It was the same pale boy. Except he was no longer pale. He had no bloody jaw covered in staples and flesh. Instead, it was replaced by a welcoming smile. And instead of his warn-out blue glasses. He had red ones. The boy walked into the kitchen. \"Mommy. What are we having for dinner?\" The woman turned towards him. \"It's a secret sweetheart.\" But instead of staying silent, he pulled on the woman's dress. \"Mommy please tell me!\" The woman once again said, \"It's a secret.\"\n\nThe boy started to jump up and down. \"Mommy, please!!!\" The woman brushed the boy off. \"Can you be at least a little bit patient Eric?\" \"So that boy's name is Eric?\" I thought. But then I was cut off from my thought when I heard the boy again \"Mommy, please. I need to know what the smell goes to!\" The woman pushed him on the floor annoyed and yelled at him to go away. The boy didn't and continued asking the same question.\n\nThe woman grabbed a knife and held it up to Eric's lip. I ran over to stop her...but it was too late. The mother sliced the boy's lips off as Eric screamed in pain. The mother didn't stop. She just sliced and sliced. She then yelled, \"THAT WHAT YOU WANT YOU LITTLE SHIT?!\" I was just frozen in fear.\n\nEric was dead on the ground. His mother then realized what she did and got a box of staples out. She filled the stapler up and started to staple pieces of skin that she chopped off onto the boy's jaw. She then noticed Eric's glasses broken glasses on the ground. She quickly grabbed an old pair of blue glasses off the coffee table and slapped them on the boy's face.\n\nI ran out of the house screaming. I got home and before my parents could ask me any questions I ran up to my room. I typed into our family computer: \"Blue bunny lane.\" I froze. The first thing that popped up was a news article. 'Eric Davison 9-year-old male gets brutally murdered by Mavis Davison aka. his own mother.\"\n\nThe news report said there were old scratches and scars and bruises all over his body the cause of child abuse. But worst of all Eric Davison was murdered on the day I first attend my new school.",
    "comments": [
        {
            "level": 0,
            "comment": "OP- chilling story! I think you were doing the right thing in trying to be Eric's friend.",
            "score": 31,
            "author": "AnandaPriestessLove",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 13,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 14,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Op you’re gonna need therapy for a while! What a grim thing to witness",
            "score": 11,
            "author": "rochelleaugust"
        },
        {
            "level": 0,
            "comment": "Poor Eric!",
            "score": 8,
            "author": "Opsirc9",
            "replies": [
                {
                    "level": 1,
                    "comment": "R.I.P Eric Davison",
                    "score": 3,
                    "author": "Shrignolds_intenas"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mom was a psycho nut!  The boy is in a better place and not being abused anymore.  Good on you trying to be his friend.  A moment of happiness for him.",
            "score": 7,
            "author": "Shadowwolfmoon13",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 0,
                    "author": "[deleted]"
                }
            ]
        }
    ]
}