{
    "id": "13nehlj",
    "score": 405,
    "title": "If You Ever Find a Children’s Book Titled ‘The Runaway Raccoon’ DON’T Read It!",
    "author": "BoxGoblin",
    "date": 1684630815.0,
    "url": "https://www.reddit.com/r/nosleep/comments/13nehlj",
    "media_urls": [],
    "other_urls": [],
    "postText": "*Her skin started to wrinkle before my eyes…*  \n\n\n“Daaaaddddy!” My daughter’s voice echoed down the hall. She was 6 at the time.\n\nI sighed. It was after 8PM. I was supposed to put Maddie down over an hour ago, but she wouldn’t go to sleep. She kept wanting me to read her another bedtime story. This was something her mother usually did on weeknights, since I tend to work late. I’m a line producer for a major animation company, helping keep children’s cartoons on schedule and under budget. It’s a well paying job, but quite demanding. Even when working from home, I’m usually on my computer until well past 9PM. \n\nBecause of this, Maddie’s mom is the de facto bedtime storyteller. My wife Sheila is a freelance writer. She mostly writes housekeeping articles, but she has an incredible imagination. She’d often make up fantastical stories on the spot (tales of Atlantean dolphin princesses and talking wands) that would make Maddie’s eyes light up with joy before sending her off to dreamland. \n\nBut my wife was away at a writer’s conference in Iowa. So all the parenting duties (including nighttime storyteller) had fallen to me. I entered Maddie’s bedroom. Her big blue eyes shined in the darkness like Gollum. Still wide awake. *Shit!* \n\nI grabbed a handful of children’s books from the bookshelf and sat at the foot of her bed. \n\n“YAY!” Maddie said. \n\nThe ceiling was covered in glowing stars. A Little Mermaid night light shone from the far wall. It was still too dark so I turned on her bedside lamp. Soft yellow light filled the room. It felt cozy and warm, not too bright. Just enough to read and hopefully coax my daughter to sleep. There were still plenty of shadows. “Ok. What should we read? There’s ‘Goodnight Moon,’ ‘Where the Wild Things Are’—“\n\n“I wanna new story,” Maddie said.  \n\nI sighed. Despite working in such a creative field, I’ve never been much of a creative myself. Always more focused on logistics and budgeting. It’s what’s made me such a star at my job, but also kept me so busy. I fanned out all the books I’d grabbed so Maddie could see their covers. “You don’t want me to read any of these?”\n\nMaddie frowned as she stared at the covers. “No. I want a new stooooory.” \n\nI rubbed my temple, feeling the rumblings of a headache coming on. *Someday, I’ll miss these moments, I thought. The times when my daughter still hangs on my every word.*\n\nAs I went to put the books back on the shelf, I saw it… A slim volume tucked against the back wall. I must’ve knocked the book down there when I grabbed the others. I reached behind the shelf and picked it up, reading the title aloud. “The Runaway Raccoon by hmm…” There was no mention of an author on the cover or inside. \n\n“I don’t know that one,” Maddie said. “Read it to me.”\n\nIt was an unfamiliar book. Sheila must’ve bought it at a used book store. Its hardback cover was worn and dented. Part of the spine had peeled off. \n\n“Read me the story, Daddy!” \n\n“Alright. Ok. What’s the magic word?” I asked, coming back to her bed. \n\n“Pleeeeeeeaaaasse,” Maddie said, giving me the biggest, brightest smile she could muster. She was too cute for her own good and she was starting to realize she could use it to her advantage. \n\nI sat back on the bed, my back slightly turned towards my daughter. In the lamp light I could finally study the book’s cover. It showed a silly-looking raccoon running through the suburbs on a moonlit night. The homes reminded me a bit of our neighborhood.   \n“Ok. Ready? Lie back down now.” \n\nMaddie slid beneath the covers until only her head peeked out. \n\nI turned to the first page. It showed the raccoon inside a treehouse with two bigger raccoons. “Ralph the Raccoon lived in a treehouse with his parents… ‘You need to finish your homework,’ his Mom said…” The story was pretty cliche. Ralph was this child raccoon who hated going to school and following his parents’ orders. He wished that he could just “grow-up” already. “When I’m bigger and older, I can do whatever I want,” the raccoon declares at one point. If only that were true. \n\nI didn’t notice anything odd until I got to a page where Ralph runs away from home late one night. There’s this illustration showing him scurrying through the suburbs beneath the moon. It’s similar to the book’s cover, but for one key difference. There’s a light coming from a window in one of the homes. And standing at the window is this Human Silhouette, pitch black against the bright yellow light. The person appears to be watching Ralph. My eyes immediately went to the image. It was so odd and sinister for a children’s book. It took me right out of the story— \n\n“Dad?”\n\nI looked up. Maddie was still awake, still listening. “What?”\n\n“You stopped reading.” \n\n“Oh… Sorry.” I patted my daughter’s head. It felt larger than before. Not only that, her face looked… different. I stared at her for a moment, trying to figure out what was wrong. Did she do something with her hair?  \n\n“Are you ok?”\n\n“Yeah, honey.” I rubbed my eyes. Maddie was still there, still cute as a button. Must’ve been a trick of the light and my oncoming headache messing with my mind. I needed to cut back on the late nights working. There were some days where I spent 12 hours straight staring at a computer screen. \n\nI turned back to the book. Ralph had entered a dark forest. The raccoon appeared so small amid a vast expanse of trees on a two-page spread. The art was quite impressive and realistic. Almost like looking at a real forest. I stared at the pages. My eyes went to the far left corner. There, I saw the same Humanoid figure. He was watching Ralph. The person had a male body, but no discernible features. His whole figure appeared to be made of static. The Static Man. The name just popped into my head and stuck there, like a piece of food stuck between your teeth. Though it was just an illustration, the Static Man was clearly walking towards Ralph in the image. Oddly, there was no mention of the strange figure in the book’s text. The anonymous author only mentioned how Ralph had gotten lost in the woods and couldn’t find his way back home. \n\nI flipped ahead. Each new page showed the Static Man getting closer and closer to Ralph in the forest. Until it was right on top of him—\n\n“Daddy? What’s happening?” A deep voice asked. I felt long legs brush against my back. \n\nI turned to look at Maddie and immediately dropped the book. For a second, I thought a stranger had broken into the house. I almost screamed before I recognized her… \n\nMaddie had grown. She was at least 13 years old! Her voice squeaked as she continued talking. “I feel soo strange?”\n\nI just sat there, mouth open in shock. My little girl had aged years in a matter of seconds. Her lanky frame was longer than the bed.\n\n“It’s ok,” I stammered. This must be a nightmare. It’s impossible. \n\nA bright red spot bloomed across the Little Mermaid bedspread. “Daddy! Help. I’m dying.” Tears clouded her eyes. The blood was coming from between her legs. Her first period. \n\n“It’s ok. That— that’s normal,” I said, getting up. “Lemme grab a towel.” \n\n“No. Don’t leave me.” \n\nI ran from the bedroom, rubbing my eyes. Surely my mind had broken from reality due to my hectic work schedule. This isn’t real. This is bullshit. Wake up! \n\n&amp;#x200B;\n\nWAKE UP! \n\n&amp;#x200B;\n\nNothing. I was still in the hallway outside Maddie’s room. \n\nI could still hear my daughter crying. \n\n“Daddy. Please come back. Pleeeeeaaase… I said the magic word.” \n\nI ran to the nearest bathroom and grabbed a hand towel. But something stopped me.   \n\nThis is an emergency. *Call 911, you IDIOT!* The warning was screaming in my head. I pulled out my cellphone. My shaky fingers hovered over the Emergency Call button on my iPhone. I pressed it. Ring. Ring. Ri—\n\n“911 where’s your emergency?” \n\n“I— My daughter— She’s—“\n\n“Sir… Sir? Can you tell me your location?”\n\nWhat could I say? *Help, my daughter is growing up too fast. She’s aging right before my eyes?* I’d sound like a crazy person, or worse, a prank caller wasting the police department’s time.  \n\nI hung up the phone. Grabbed the towel. Maddie was screaming, her voice hoarse and strained. I was not prepared for what I saw when I returned to her bedroom. \n\nMaddie was an old woman, decades older than myself. Her strawberry blonde hair had turned gray. Her body was curled and crooked. Her skin had folded into a thousand wrinkles. Liver spots had appeared on her frail hands. She reached out to me as I rushed inside. \n\n“Help… me…” Maddie’s voice was nothing more than a whimper. She looked to be a hundred, but I could still hear the 6-year-old girl underneath. Her arm dropped and her face slackened. Then, I saw the light leave her gray-blue eyes. \n\nI dropped the towel, choking on a sob. My knees buckled, sending me crashing to the carpeted floor. I lay there, curled in a ball, crying for God knows how long. Eventually, my tears ran dry. \n\nEventually, I noticed the book was lying next to me. I’d dropped it beside the bed earlier and the pages had flipped all the way to the end. I stared long and hard at that last page. It showed the Static Man looming over Ralph the Raccoon (now gray-haired and withered). The humanoid creature had grown a giant inky mouth, like a black hole. It was sucking Ralph into its pitch dark vortex. And there was text at the bottom. Some invisible force compelled me to read it aloud: \n\n*“No matter how far Ralph ran, he could never escape the Static Man.”*",
    "comments": [
        {
            "level": 0,
            "comment": "Sigh, that's parenthood for you. Always try to do the right thing, then one day you read your kid a demonic book and it all falls apart.",
            "score": 146,
            "author": "artistgirl0283"
        },
        {
            "level": 0,
            "comment": "Poor Maddie. It seems once you started reading the book, there's no escaping. You didn't even need to reach the end for all these to happen.",
            "score": 50,
            "author": "idontlikepapaya"
        },
        {
            "level": 0,
            "comment": "They grow up so fast don’t they?",
            "score": 38,
            "author": "fafnir0319"
        },
        {
            "level": 0,
            "comment": "&gt;I could still hear my daughter crying. \n\n&gt;“Daddy. Please come back. Pleeeeeaaase… I said the magic word.” \n\nThis made me choke back tears.",
            "score": 15,
            "author": "lukim3"
        },
        {
            "level": 0,
            "comment": "Still a better book than “Go the Fuck to Sleep”",
            "score": 50,
            "author": "TheBlackCycloneOrder",
            "replies": [
                {
                    "level": 1,
                    "comment": "This made me laugh way harder than I should have. I remember being a small child who would shout downstairs to my mother for a glass of water repeatedly.Eventually she would shout up the stairs \"If you don't get back in that bed I'll come up there and slap your arse.\" My response was,\"Mummy when you come up to slap my arse will you bring me a drink of water?\" I still like to have the last word.",
                    "score": 54,
                    "author": "hauntedathiest"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can only imagine how this would have went down if it was me and my dad.. I would have hit fifteen and the bastard would have started lecturing me about needing a job and demanding rent.",
            "score": 12,
            "author": "RagicalUnicorn"
        },
        {
            "level": 0,
            "comment": "Dang. Imagine being that parent☹️",
            "score": 11,
            "author": "AnyDistribution8016"
        },
        {
            "level": 0,
            "comment": "Try reading the book backwards",
            "score": 8,
            "author": "CrescentPearl"
        },
        {
            "level": 0,
            "comment": "OP: Holy shit man.  That must have been traumatizing! I'm sorry you and Maddie had to experience that.",
            "score": 3,
            "author": "Shrignolds_intenas",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean at least Maddie is at peace now. OP still has to tell his wife he read their kid a cursed story and she is now dead",
                    "score": 9,
                    "author": "LittleFairyOfDeath"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Little Raccoon and the Thing in the Pool=Safe",
            "score": 2,
            "author": "stupidjoshdick"
        },
        {
            "level": 0,
            "comment": "I’m sure florida will ban it anyway",
            "score": 2,
            "author": "CarryMain2304"
        },
        {
            "level": 0,
            "comment": "What's the correlation btw the static man and aging, did i miss something?! If the book was about growing up I'd maybe understand lol!",
            "score": 1,
            "author": "poetniknowit"
        },
        {
            "level": 0,
            "comment": "Mom is gonna come home and not understand how this got so fucked up",
            "score": 1,
            "author": "FuckitThrowaway02"
        },
        {
            "level": 0,
            "comment": "Very creepy.",
            "score": 1,
            "author": "creamie99"
        },
        {
            "level": 0,
            "comment": "I'm so sorry that happened to you. Wonder where the book came from and who or what wrote it.",
            "score": 0,
            "author": "Interesting-Fan-4849"
        },
        {
            "level": 0,
            "comment": "Well, that's what you get for reading a book belonging to Jurgen Leitner. Honestly, what did you expect?",
            "score": 0,
            "author": "AuthorEcho",
            "replies": [
                {
                    "level": 1,
                    "comment": "JURGEN LEITNER STUPID MOTHERFU-",
                    "score": 2,
                    "author": "Baby_Rotaytay"
                }
            ]
        }
    ]
}