{
    "id": "13oyse9",
    "score": 7,
    "title": "Sometimes having a Voodoo Doll is Good",
    "author": "Accomplished-Day6294",
    "date": 1684779811.0,
    "url": "https://www.reddit.com/r/nosleep/comments/13oyse9",
    "media_urls": [],
    "other_urls": [],
    "postText": "My name is Tommy, and I am 18 years old. I was out walking with my mother, Jessica, 39 years old, in New Orleans. There, we wandered around the famous French Quarter. Unfortunately for me, I wasn't out here on vacation. As you can see, my slim mother was a foolish woman who only had the desire to seduce men for their money and by using them for her augmented breast surgery. Well, more like a junkie for plastic surgery.\n \n\n \nBefore she met my father, she was a model and a stripper. Wanting to gain all the attention she needs. from going to modeling contests and to these stupid events out at the beach and in New Orleans. But when she did meet my dad, she only used him for so many things and became so demanding of him.\n \n \n\nThere was a time when I was a little boy that my mom took me out of bed just to stalk my own father, seeing the poor guy working his ass off. But when she spotted him mingling with a female coworker, she lost it. Gnawing at her leather purse and crying out her black mascara.\n \n \n\nAnd I could see that the female coworker was much prettier than she is, with blonde hair and blue eyes. Something that my mom couldn't compete with. As it was one of the reasons why she had these enchantment surgeries, she saw that my dad was a good man, knowing his hard work could provide her heart's desires, unlike the other drooling slobs she got to see before.\n \n\n \nOn the following night, my mom took me again. I was so tired, as I was in my pajamas. Don't forget, I was still a child. My mom drove her car as I slept in the backseat, holding my King Kong plush that my dad got me at Universal Studios Hollywood. I could only remember that she parked her car and went to this apartment. I mean, why this place? Does she know anyone who lives here?\n \n\n \nI don't know how long she was in there, but as she came back in the car, I could see that her hand was filled with blood and held a human heart. And when we arrived back home, I could see my dad waiting anxiously outside, wondering what was happening. I looked from the inside of the car as my mom walked out and threw that human heart at his face.\n \n\n\n \nMy dad was shocked into disbelief. He said that it was a female coworker who was helping him out so he could get more overtime at work. Saying to her that the blonde woman was his boss. I watched him pacing back and forth with his hands on his mouth. Trying to wrap his mind around, trying to process what my mom had just done.\n \n\n \nMy mom, of course, was having none of it. She took out a knife and stabbed him on the right side of his chest and stomach. He fell to his knees, coughing out blood. I got out of the car, running with my little legs, trying to save him. But he told me to stop. And with a smile on his face, he told me to go back to the house.\n \n \n\nI was so scared. My mom grabbed me and took me to my room. I saw her crazy eyes as she smiled with those black lips. Giving me a wet kiss on my cheek and then smothering me in her chest, feeling the throbbing rage in her heart. But fast forward to today. I was still with my mother, who clearly got away with murder. Despite her appearance, she was a killer.\n \n\n \nI always knew what my mother was doing, as she was selling herself to the lowest of the low. Even after all these years, my mom still talks about my dad. By wishing him here. Such a damn hypocrite she is. Knowing what she has done by being the one who murdered him and that poor woman I was reading the mail one day, back at the hotel, as I later found out that my own mother had been diagnosed with dilated cardiomyopathy with the three aneurysm syndromes of her great blood vessels.\n \n \n\nIt looks like karma is coming after her, but I was impatient. All that money she was making should've gone to that. But my mother was a black-hearted bitch and didn't care much about her condition or my well-being. And so I decided to get revenge on her heart, as I knew right at that moment that a window of opportunity had just opened up.\n \n\n \nI was so embarrassed to walk with her, as she was wearing her red dress. Her giant breasts bounced around, gaining the attention of others, as I was already sick of them. But for me, I was too smart for her bullshit, planning to get rid of her for what she did to my dad and for abusing me just because I looked like him.\n \n \n\nYet I wasn't sure if I was able to do this. I mean, she's my mom, but at the same time, I have to endure her abuse. because she saw me as the spitting image of my father, being so damn close to me and not letting me do the things I wanted, yet she did all the things she wanted.\n \n \n\nThis is why I want to take revenge on her heart. Ever since I felt it throbbing, letting me hear the damn thing whenever she pulls me in after giving me a beating. Saying that I am her creation, doing as she pleases, and that no one should take me. So I sent a letter to this voodoo witch doctor called the Shadow Man. Well, just weeks ago, I accidentally stumbled upon him when leaving my technical school overnight.\n \n \n\nAt first, I was scared of this guy, as he was this tall, intimidating figure wearing this suit with long dreadlocks hanging down from his shoulders, and he had these glowing eyes that looked down on me. I was terrified by this man, and I had to apologize to him quickly. He leaned down and placed his hand on my shoulder, telling me to breathe in his Creole accent. And there I did so. Seeing me still trembling, he told me to relax.\n \n\n\nHe asked me to walk with him, and so I did. I explained my reasons to him, and the more the shadow man listened, the better he began to think of a way to help me, as he just had the right thing to do, elaborating that he'd create a voodoo doll just for me. only for him to tell me to come when the time is right.\n \n \n\nAnd by giving me an address to his store's location, he said that there is a price to pay. But I wasn't thinking straight, as I was only wondering about this store of his. And today was the right time.\n \n \n\nI cringed at the very sight of my mother as we walked down the street. There are times I remember her slapping me for no reason at all because of her troubles, even though she was the cause of them. The last straw happened back at the hotel, when my own mother, Jessica, took my money that I worked hard for at this part-time job I found, working all these hours. While she had the nerve to verbally and then physically abuse me, calling me a mistake, I tried to be the best son possible. even to the point where she threw my phone in my face. It hurts so much, as I was shedding tears to the point that I was actually afraid of my own mother. I huddled by the wall like a cornered rabbit.\n \n \n\nUntil she stopped as her back and chest pains got the better of her. She stood over me and spit me in the face. I could only apologize to her. She smiled, saying that she loves me with that malicious grin on her face, then leaned down as she was breathing heavily as I watched her angry eyes staring right at me, giving me a kiss on my cheek followed by a slap to the face. Laying beside me as I trembled, she caressed my hair as she giggled. \n \n \n\nI watched my mother, who was flirting with this young man who was caught off guard by her. Seeing her enormous breasts that grew over the years due to her saline implants, which she boasts about being big or something, I didn't care, as I didn't pay much attention, as it was just embarrassing. I could see how the man was flabbergasted. But I wish I could warn him, as he should not be fooled by her appearance. She is dangerous, yet I was embarrassed that this guy was going to check her out, and I don't want her to beat me up out here in public.\n \n\n \nI suddenly heard a disembodied voice and wanted to know where it came from. There I spotted what I believed was the shadow man's shop. There was a voodoo doll with a heart on its chest and a red dress that was made for me. Many ideas flooded my mind, trying to see if I could actually harm my own mom, but I did not want to deal with my mother's abuse anymore. I plunged the pin into the doll's chest.\n \n\n \nAs I did so, the results were truthful. This voodoo doll actually works, as I watched my mother gasp out loud as the young man that she was mingling with backed off. Almost tripping over herself. Watching her clutch her chest as she felt an intense chest pain. She was trying to breathe as I saw her hands scratching her neck. Until she tore her dress apart, exposing those ridiculous breasts of hers that she took pride in, when suddenly having these black veins pulsating on them, watching the heart bulging back and forth with the cracking of her sternum Her eyes suddenly became all black. She then looked in my direction, facing me with those angry black eyes as she looked at the voodoo doll in my hand. She ran towards me until I plunged the pin deeply.\n \n\n\nShe paused in front of me as I fell to the ground. As I was quivering again, her arms pulled back, and with her exposed chest pushed forward, I could see before my eyes that it began to vertically split open. My mom was falling to her knees and grabbing my neck with her hands, trying to choke me as I was shedding tears. \n\n\n\nWhen she screamed as her chest exploded,  with a big black heart bursting out of her like a chestburster from Alien. Black blood splattered all over my face. I caught the huge heart in my hands, as if it were a basketball that was still attached to her chest. My mother lay on her knees right there, watching as her black eyes stared at me, smiling eerily, until she fell on her back. I was scared and angry, as I was thinking straight until I yanked out that oversized, throbbing organ.\n \n\n \nBeating thunderously on my hands was my own mother's massively abnormal yet globularly enlarged black heart with those dilated aneurysms of the great blood vessels—a grapefruit-sized aorta, that plump pulmonary artery, and that rare fusiform superior vena cava. All of them are so chunky. Along with those black veins and arteries hanging down. \n\n\n\nWatching it all in front of me, just like what the letter described in the mail, feeling the cold black blood streaming down to my hands as I was astonished by how heavy my mother's heart and aneurysms were. But they were all black; her blood is black. I didn't completely understand why—was it her condition, or could it be that she was evil, or both? Until my stomach couldn't handle it as I vomited to the floor.\n \n \n\nUntil a realization came upon me. I just killed my mom. Fear consumed me as I murdered her. People all looked at me as I was on the ground. I didn't understand any of it. They're going to call the police on me. Like, what have I done? I don't want to go to jail. I just don't want to be abused anymore.\n \n \n\nI wanted to run away, but I heard the shadow man's disembodied voice, assuring me all would be fine. I don't know what happened. But everyone started to laugh; it was the strangest thing ever, until I saw him emerge out of the crowd like a presenter at a circus. \n\n\n\nHe leaned down to me, took out a black leather pouch, and blew out a black powder on my mom's pale face. I could feel my body going numb as I saw her twitch. Until then, I had no control over the situation. Why was he doing this? I could feel my heart race in my chest as I watched her body move. The shadow man smiled as he said, \"You can keep your mother's black heart, but for now, however, you belong to her.\" I didn't understand what he meant by that.\n \n\n\nIt was when I saw my mom rise up as she smiled. Looking directly at me with her black eyes. I was so confused and afraid that sweat poured down my face. The shadow man stated that I not only had to be with her but that my own mom had made a deal with him as well. To be zombified, as I'll never leave her sight. I mean, like, why did she want to do that? She was the one who started the whole thing. It was her plan, wanting me to stumble upon him. \n\n\n\nI was being used at the start of this. Me being a damn idiot and believing that I have all control A dark love that she embraced me with open arms. How long did she know this? Did she meet the shadow man before? Now I am regretting it. \n\n\n\nI wanted to run, but I am under no circumstances in control. My mom wrapped her arms around me as I looked in horror at those black veins and arteries from her black heart, wrapping my arm like an octopus. Until a realization happened, she knew her condition would kill her, but wanting to be zombified was her answer to walking on this earth with me, and she had big plans for me. \n\n\nAnd when I heard her speak, she said, \"You will be with me forever, and as for now, you'll never leave my sight.\" Kissing me with her cold black lips on my cheek. Her obsession with me is truly unhealthy and uncomfortable.\n \n \n\nI was violently shaking, trying to get away from her. I asked the shadow man why he did this to me and did not tell me the truth about the deal he made with my mom. I was crying my eyes out as everyone was there savoring my agony. \n\n\nAre they all with him? Was I just a joke to him? I begged my mom to let me go, even calling her \"mommy, please don't do this\" twenty times to stop squeezing me tightly. I was that same little boy for many years, and I am terrified like a kitten.\n\n\n\nMe, an 18-year-old who is terrified of his undead mom. This has to be an embarrassing nightmare. I must wake up. I have to wake up. I need to wake up. This can't be real. Please let this not be real.\n ",
    "comments": []
}