{
    "id": "13p9zvu",
    "score": 28,
    "title": "My new boyfriend is insane",
    "author": "yes-thats_me_",
    "date": 1684805338.0,
    "url": "https://www.reddit.com/r/nosleep/comments/13p9zvu",
    "media_urls": [],
    "other_urls": [],
    "postText": "I've always been a hopeless romantic. I've always dreamed of a perfect wedding. Perfect life with perfect man. Unfortunately none of my relationships lasted very long. Not to float my own boat but I'm a pretty attractive girl and so I often find myself being used and manipulated by men.\n\nMy last boyfriend cheated on me. We had been dating for a few months and I decided I would go over to his house to surprise him, as I walked in I found him naked in bed with another woman. Since then I had given up with relationships. I've had a few guys hit on me but it's obvious by their words they only want sex.\n\nI got so lonely and depressed I stopped taking care of myself. I lived in a small apartment with 2 bedrooms and 1 bathroom, I had an open plan living room so you could just walk straight into the kitchen. My mood dropped so low that my apartment became a mess. Pillows thrown across the room, trash lying around, dirty dishes and clothes. I just didn't have the motivation to clean up or take care of myself.\n\nI was later fired from my job and that only pushed my mental health further down. I had to find a job and quick otherwise I would lose my home. I found a job at a small grocery store just stocking shelves and cleaning up every now and again. I would barely be making enough money to keep my home. \n\nI nervously drove to the store and made my way inside. It turns out one of my old high-school friends Melissa also worked their as a cashier. I hadn't spoken to her in years after she stole what I thought was the love of my life. She knew I liked this boy yet they ended up together and we fell out shortly after. She had seemed to forget all about the situation and I thought, she's going to be my colleague for a little while, it's best to move on and get along well with her.\n\nShe took a break and led me into the back of the store where we kept extra stock. She showed me around and told me exactly what I should be doing. It seemed she had changed since high-school. She was much softer and sweet than before. I gather a tray full of items and made my way around the store refilling shelves. I slowly walked down the Isles checking what needed to be refilled and as I turned the corner I bumbed into a man. I dropped the tray and some left over items fell to the ground.\n\nI stumbled across the ground picking them back up and just like those cliché moments from the movies, as I reached out to grab an item so did he. I slowly looked up and that's when I saw him for the first time. He stood up straight to apologise for the mess he caused. He was tall, maybe around 6\"2, messy brown hair, gorgeous blue eyes and... quite clearly liked to work out. I said he was okay as my cheeks started to burn red.\n\nHe introduced himself as Ben and he stuck his hand out. As I reached out for a handshake he took my hand and brought it towards his mouth, placing a gently kiss on the back of my hand. I told him I had to get back to work, if I had stayed any longed I feared my heart would burst out of my chest. I quickly walked into the back of the store and sat on a wooden pallet. I couldn't help but smile. He was so gorgeous... he's the perfect man I had been dreaming of all my life! I gathered the courage to go back out and ask for his number. As I walked through back into the store I couldn't find him. I walked down all the Isles but he was nowhere to be seen. I ran to the front of the store and asked Melissa if she saw him.\n\n\"Oh you mean Ben? Yeah he just walked out. Don't worry he'll be back, he's been coming here almost every day for a few weeks now. Although, I've never seen him buy anything..\"\n\nI thanked her and continued my work. Mopping the floors, continuing to refill shelves and that was me finished. I said goodbye to Melissa and a few other colleagues I met that day and made my way home. I was feeling quite positive tonight. I pushed a few clothes off of my sofa and sat watching some movies. A few hours later someone had buzzed for my apartment. I walked over and answered the intercom. \n\n\"Hello?\" \n\n...\n\n...\n\nNo reply.\n\n\"Hello this is apartment 37B?\"\n\nStill no answer. I checked the small screen but there was no one there. Probably just some kids messing around. I went back to my movies and shortly fell asleep on my couch. I awoke the next morning and looked at my watch. Oh shoot I'm going to be late for work. I quickly went for a shower and got dressed and made my way to work. I rushed inside and couldn't believe my eyes. Ben was in one of the Isles. He turned his head and he saw me. He slowly made his way over to me and once again took my hand and placed a soft kiss onto it.\n\n\"I didn't catch your name yesterday?\"\n\n\"Oh, sorry.. my names Lacey\"\n\nWe stood talking for a few minutes and then he finally asked for my number. I put my number into his phone and we arranged to meet up for a date the following night.\n\nThe date went well, Ben was a really nice man. Such a gentleman. He took me to my favourite restaurant and dropped me off at my home. We went out a few times after that and shared the occasional kiss. One night after one of our dates he dropped me off home and we were sat in his care making out. \n\nHe asked if he could come inside but I had to decline. My house was still a riot and I couldn't handle the embarrassment of him seeing it like that. \n\nThe first time I noticed something off sith Ben was when I returned home from work one night to find the door to my apartment cracked open. As I opened the door I couldn't believe what I was seeing. My apartment was spotless.. no dirty clothes. Clean dishes, no trash lying around. Everything was so clean. On the back of my door was a note.\n\n\"Hey im sorry if this is too weird. I just wanted to clean your apartment after seeing the state it was in. Hope you don't mind.\n-Ben\"\n\nAt first I was happy that he would take time out of his day to do something so sweet but I found myself sitting in confusion...\nWhen did Ben see inside my apartment? He had never even been inside the building so he couldn't have just seen inside as I entered my home. And he didn't even have a key so how did he get in...?\n\nThe following day at work Ben walked into the store. He didn't mention the cleaning or the note. I figured it was best to forget it and move on. He asked me about Melissa and why I seemed a little off while talking to her. I explained what happened in high-school with the boy I liked. He had this look on his face.. It looked like a mix with sadness and anger. He stayed at the store for my shift and I thought it was finally time to bring him home. We entered my apartment and we sat on the couch making out. One thing led to another and well... I won't bore you with the details.\n\nThe next morning i woke up in bed next to Ben. He was already awake and gave me a gentle kiss. He asked if he could get a glass of water.\n\n\"Oh of course, the glasses are in the top shelf next to the -\"\n\n\"Next to the oven I know don't worry babe\"\n\nBut how...\n\nHe returned to the bedroom and layed next to me in bed. I told him I had to get dressed for work and he asked if he could stay here for a while. I reluctantly agreed, I wasn't too comfortable with him being here by himself in my home but whatever, I trusted him enough. I drove to work and as I pulled into the parking lot there was 2 police cars and 4 officers standing outside talking to some customers and my colleagues. I parked my car and approached them. One of the officers turned to me and began to spoke.\n\n\"Good morning ma'am. We don't mean to cause an alarm however your colleague Melissa has been reported missing. Normally we don't acknowledge these reports until 24 - 42 hours however she never returned home last night.\"\n\nThey took me to a room and I explained everything I knew of Melissa. How we were friends in high school, she took the boy I liked and didn't speak for years before I started this job. They let me go and left shortly after. Ben rushed in a half hour later explaining how sorry he was about Melissa.\n\n\"I'm so sorry Lacey. I know Melissa used to be your friend I'm sorry she's gone missing. But on the bright side she won't be here to bother you anymore.\"\n\nHe said this with a disturbing grin on his face. \n\n\"How can you smile at this Ben? Melissa is missing...\"\n\n\"I only did what I ha-\" he stopped talking. Not another sound left his mouth.\n\n\"You only did what Ben...\" \n\nHe walked out of the store not speaking another word to me. I called and texted him but there was no answer. I returned home later that night and flipped on the lightswitch. Nothing happened. The power must be out. I noticed a small light coming from my bedroom and I made my way over. I slowly opened the door and as I did I felt someone place their hands on my hips from behind. It was Ben. He had a horrifying look on his face and some red marks on his hands.\n\n\"Let me explain Lacey... Melissa caused you so much pain all those years ago but now she's gone... she can't bother you anymore and you can move on! We can be happy together can't we?\"\n\n\"What the hell did you do Ben...\" I looked around my apartment and noticed a bloody knife on my coffee table. Ben realised what I had just saw and he pushed me to the ground. \n\nI struggled to get him off of me and ran towards my door. He tripped me up and slapped me across the face.\n\n\"I only want to love you Lacey.. protect you.. you're mine now and I won't let anyone hurt you again\"\n\nI struggled and screamed at him trying to get him off me. Suddenly my front door was kicked down and a police officer barged in and shoved Ben off of me. He pointed a gun at Ben and told him to put his hands behind him and turn around slowly. Ben was handcuffed and brought to the police car. \n\nWhat I left out, when I was being questioned at the store I told the officer about the strange occurrences with Ben. He gave me a number to call if anything else happened and after Ben's strange behaviour at the store I gave him a call. \n\nBen was placed under arrest and police later found the remains of Melissa's body at his home. The last I heard Ben was sentenced to life in prison without the opportunity of parole.\n\nYears have passed. I have a husband now and we're trying for a baby. I got up early and got dressed for work. I have a new job as an assistant manager at a local hotel. As I left my house and walked towards my car I let out a blood curdling scream...\n\nScratched into the side of my car was 2 words... 2 words that will haunt me for the rest of my life...\n\n\"Together forever\"",
    "comments": [
        {
            "level": 0,
            "comment": "Wait how did the police officer come into your apartment so fast? did a neighbor call when they heard u scream?",
            "score": 3,
            "author": "TelevisionNo7995"
        },
        {
            "level": 0,
            "comment": "Oh noooooo",
            "score": 1,
            "author": "KimS0330"
        }
    ]
}