{
    "id": "13qnajh",
    "score": 123,
    "title": "We Were Warned That the Land Beneath Our New Home Had Learned to Hate, We Should Have Run When We Had The Chance",
    "author": "Santiagodelmar",
    "date": 1684938507.0,
    "url": "https://www.reddit.com/r/nosleep/comments/13qnajh",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/grimoireofmadness/).",
        "https://twitter.com/SantiagoDelMar3)"
    ],
    "postText": "Two weeks. That's how long it took for my life to fall apart. Two weeks for everything I ever loved or cared about to be taken from me in the cruelest way imaginable. And it all started on that hateful plot of land that was supposed to be my family’s new home. We’d bought the house a month earlier and packed our lives up in Socal and moved to Northern California. It was unassuming, Two-story, Three-bedroom, cheaply built, and overpriced in an attempt to cash in on the housing shortage. The whole housing subdivision was like that and in the end, the gamble failed, only about a third of the houses were occupied. \n  \n\n  \nWe arrived early in the morning, spring had just reared its head and showers still peppered the land. This particular morning a light drizzle had been falling for a few hours. On a front lawn, staring directly at us as we pulled in was a kid, crying. Even through the rain, I could see from the way his shoulders and chest shuddered. There was a woman standing a few feet away, staring at the boy.\n  \n\n  \n“Are you ok?” my fiance Laurie asked, stepping out of the car.\n  \n\n  \nThe boy - who couldn’t have been older than 17 - nodded slightly and walked away, pausing halfway down the street to look back and shake his head. The woman, in her 60s, walked up as he strode out of sight and spoke to us.\n  \n\n  \n“He’s crying for you,” she said.\n  \n\n  \n“Excuse me?” I asked her.\n  \n\n  \n“He’s like an omen, I saw him crying a week before my husband went missing. All they found of him was the joint to his index finger. I'd leave and never look back if I were you.”\n  \n\n  \n“I’m sorry, are you a neighbor?” Laurie asked.\n  \n\n  \n“Nah, don’t live here, just follow the boy around whenever I see him crying. Never says anything to the people he’s supposed to warn, so that’s why I’m here. I know your kind though, young, arrogant, and unwilling to listen. It’s fine, I’m just a crazy old lady, just know this land here, it knows nothing but tragedy. Settlers watered it with the blood of Indians slaughtered by the hundreds, and before them, they did it to each other. See, bound by tragedy, it’ll come to pass again.” \n  \n\n  \n“I think you should be going,” I said firmly. \n  \n\n  \n“I’m off, just don’t say I didn’t warn you,” she said and hobbled away.\n  \n\n  \n“What the hell was that about?” I asked, facing Laurie.\n  \n\n  \n“Local’s trying to scare us. I get it, people like us move en masse, raise rents, vote differently, and change their way of life. It’s easy to see why they’d get resentful.” She said\n  \n\n  \nShe saw the look in my eyes and frowned.\n  \n\n  \n“Amir, I didn’t mean it like that, I’m not trying to sympathize with bigots, I’m just saying my parents think like her, I know what’s running through her mind. But honestly fuck her, she doesn’t matter, we do. The people around here are probably used to getting everything handed to them, why can’t we take a little something from ourselves.” \n  \n\n  \nI was comforted by her words then but in hindsight, she was wrong. Mrs. Norris was eccentric and crotchety but she never had anything handed to her. She grew up poor and lived poor most of her life and even now she works as a Walmart greeter, if anyone had been lucky, it had been me. My entire life I only failed upwards. When I fucked off in high school Mom and Dad's alumni status and hefty donations to an ivy league school ensured my acceptance. When I renounced my parent's faith, they stopped talking to me, but made sure my classes were paid for and they always kept me in their prayers. I had a job lined up for me the moment I graduated at Dad’s law firm, even if he scheduled it so we’d never interact. He even left me a trust fund that was enough to afford this house and cosigned when Laurie asked him to. I didn’t know until after all the horrors I’ve experienced how good I had it. guess you don’t know what you have until it’s wretched from your hands. \n  \n\n  \n\n  \nLaurie brought Carter out of his seat, my beautiful son, A year and a half now. I wanted to name him after my brother, he was closer to me in skin tone than Laurie and he even had my father’s eyes. But in Laurie’s exact words, “You didn’t carry him for 9 months, you weren’t even there for me until the last second.” It was true.\n  \n\n  \nMy son was born 2 months after I graduated. I didn't want to be a father. I held firm to this even when a casual fling ended with a pregnancy neither her parents nor I wanted. But she was resolute, Laurie was stubborn like that, driven by rebellious impulse. The only reason she had hooked up with me was that she knew it’d piss off her parents, especially her dad. We agreed that she’d have full custody and I wouldn’t have to even meet the kid. I had agreed, but when her labor came she called me while she was on the way to the hospital, she was afraid and her parents had all but disowned her. I came, I shouldn’t have, every part of my body was screaming for me to just run, but on impulse, I showed up. When I held him for the first time in my arms, I knew this was all I had ever wanted. I cried of course and broke into myself that I had ever considered cutting my beautiful baby boy from my life. I proposed later that night, and Laurie said yes, almost in shock. I told myself we were fighting against the world that day, against her racist parents, against ourselves. I’d make this work, I’d fight for us, for Carter. \n  \n\n  \nWe brought our son inside, did some unpacking, and settled in for the night. I ended up falling asleep on the couch after a few beers and some late-night TV. Laurie put Carter to bed and went to bed alone, later telling me she didn’t want to wake me. What roused me that night was a sound, something that pierced the veil of dream and reeled me back to the real world.\n  \n\n  \n***Thhhhhhhhh-thump*** \n  \n\n  \nMy eyes shot open and sat up, and looked around the living room. Only a few dim beams of streetlight peered in through the window, their pallid light doing little to render anything visible beyond a blurry silhouette. I froze, let my heart settle, waited for what felt like an eternity, then laid back down.\n  \n\n  \n***Thhhhhhhhh-thump. Thhhhhhhhh-thump*** \n  \n\n  \nI lay there, still and attentive, trying to parse what the sound was and where it was coming from. I tried to rationalize it as Laurie being up and about but as the sound repeated I picked up details that cast certainty into doubt, there was a slick wetness to it that couldn’t have been Laurie. Unless she now took to dragging wet rolls of tarp around in the middle of the night. I waited and listened until the sounds faded, I don’t know if they actually did or if the pull of sleep overcame my unease. All I know is that I woke up nearly late for work and before I could ask Laurie if she had heard anything, I had fled the house and sped all the way to my dad’s newly opened Norcal office. \n  \n\n  \nLater that day as I returned home I found Laurie on the front lawn, Carter in hand waiting for me. Her face was contorted into an annoyed scowl.\n  \n\n  \n“What’s wrong?” I asked, stepping out of the car. \n  \n\n  \n“That weird kid was back, around noon. And so was the old lady,” she said\n  \n\n  \n“What did they want?”\n  \n\n  \n“I think they’re trying to scare us out of here. The kid was crying again, bawling actually. The lady was behind him said that It’s already started and that our clock was ticking down. When I asked her what she meant by that she all but threatened me. She said ‘The earth, it weeps and it remembers the cruelties inflicted upon it. You’ll see, it’ll claim its dues one way or another.’ I told them I was gonna call the cops and they left but it didn’t sit right with me. They were harassing some of the other neighbors too... And it's just weird. Did the real estate agent say anything about this place?”\n  \n\n  \n“It’s an entirely new housing development, there is no history to tell, why? Did they get to you?”\n  \n\n  \n“No- it’s just that last night I heard something, like a dragging sound. I thought maybe it was you but… it felt like something was watching me, it didn’t feel like you.”\n  \n\n  \n“I heard that too, didn’t feel like anyone watching me, just the noise,” I said\n  \n\n  \n“Maybe we should call someone? A priest or-”\n  \n\n  \n“Laurie, don’t tell me you buy into that shit after one night of something that’s easily explained.”\n  \n\n  \n“It’s not too uncommon for people to have houses cleansed when they move, maybe it’s worth entertaining. Just down the street from us are nature reserves that used to be native land.” \n  \n\n  \n“Maybe it’s them, ever think of that? You said it yourself; they have every reason to try to get rid of us.”\n  \n\n  \n“That’s a little convoluted, isn’t it? Why would anyone go out of their way like that for us, what about the others they’ve bothered?” she asked.\n  \n\n  \n“Plenty of people have gone after us for less Laurie, having my kid put you at odds with half your family alone. Your dad shot at me, I’m not surprised by the crazy shit people do anymore. We’ll let security know that they’re harassing us, problem solved.”,\n  \n\n  \nLaurie looked at me with weary eyes “Maybe,” She glanced back down at Carter who giggled and she smiled. “Yeah, you’re right,” she said and let her shoulders relax. \n  \n\n  \nA few days went by without incident, and I was starting to settle into the flow of things. We got to know some of our neighbors, at Laurie's behest and  I was trying to get Carter to say his first words, but the word “dada,” seemed to evade him. Laurie was still in a bit of a funk, she got it often enough that I talked about therapy though she always evaded the topic. She dropped out of college, was disowned by her parents, and got engaged to the man responsible for her fall from grace on a whim. I caught her crying half a dozen times since she’d given birth, we hadn’t had sex more than a few times since she gave birth. I could tell she wanted to be more than a housewife and I know we needed the extra income. When I brought up that I was being groomed for a promotion her eyes lit up. \n  \n\n  \n“Think we’d be able to afford child care? Would be nice to have some time to work, maybe even finish my degree.” \n  \n\n  \n“It’s in the realm of possibility, still dream of being a nurse?” I said, smiling. \n  \n\n  \n“I could change to accounting so I can annoy the hell out of you at work,” she said with a laugh.\n  \n\n  \nAll seemed to be right in the world, nowhere to go but up. We put Carter to bed in his room, and Laurie and I settled into our bed for the night. I rolled over onto her side, pressed against her, and said, “Let’s make a brother for Carter.” Laurie looked at me stunned at first before her face slacked into a grin. \n  \n\n  \n“You think you can decide that?” she asked\n  \n\n  \n“We can try?”\n  \n\n  \n“And what if I want a girl?” \n  \n\n  \n“We can try for a girl after we give Carter a brother. Think about it, boys need other boys their age and our daughter gets two older brothers to protect her.”\n  \n\n  \n\n  \n“You make a compelling argument,’ she said and moved to straddle me.\n  \n\n  \nWe broke out into a wrestling match, disrobing one another with every hold and shift of motion. Laurie was halfway through pulling my boxers down when the sound of glass shattering froze us both in place. Seconds ticked by as my muscles tensed in anticipation. Another explosion of glass made the both of us flinch and Carter awakened with a snort and then a wail. “Go,” I said to Laurie and she launched herself to Carter’s room. I pulled my boxers up as I made my way downstairs. I snagged the bedside bat as another series of glass-shattering staccatos rang out throughout the house. “What the fuck?!” Laurie shouted as I ran past, bat held so tightly in my hands my knuckles paled. In my anger and haste, I sprinted into the kitchen without thinking. As I flicked on the lights as I stepped on a shard of glass\n  \n\n  \n“Fuck!” I yelled as it bit into my flesh. I looked around at the sight before me, blood pooling steadily around my foot. Nothing but a cabinet and half a dozen glass cups shattered across the floor. I set the bat down on the counter and pried the sizable glass shard from my foot. I didn’t have time to dress it, a scream rang out from upstairs. “Amir! Amir!” Laurie called and I sprang up, and ran towards them, leaving bloody footprints on hardwood and carpeted stairs. I was yelling at myself internally, whatever was doing this succeeded in separating us. As I reached the hallway it dawned on me that I left the bat on the counter.  Though my stomach tied itself into knots at the realization that I’d have to face whatever was in the room unarmed, nearly naked, and bleeding, I did not slow or relent. \n  \n\n  \nI flung myself through the open door, wild-eyed and ready to fight. Laurie was huddled in the furthest corner with our wailing son held close to her chest, a finger outstretched and pointing to the closet that faced her. My eyes flicked to where she pointed in the swirling darkness of the open closet door, and for the briefest of moments, I thought I saw movement. Muscles tensed and I raised my fists but the apparition was dispelled the second I focused in on it. Already rationalizations formed within me, and adrenaline-fueled delusion was the one I clung to. \n  \n\n  \n“What? What did you see?” I asked Laurie as she tried to soothe Carter.\n  \n\n  \n“I-I don’t know, but there was something here, it was in the closet. It was staring at us.” She said and gazed down at the blood seeping into the carpet.\n  \n\n  \n“What happened downstairs?” She asked,\n  \n\n  \n“Cupboard was open, and glasses fell out.”  \n  \n\n  \n“Amir, that doesn’t just happen, we can’t stay here anymore.”\n  \n\n  \n“And what do you propose we do? Go to a hotel, put the house on the market, and hope that we scrounge enough to find somewhere else?”\n  \n\n  \n“Why not?”\n  \n\n  \n\n  \n“Because this is our only chance, Laurie, because we have nothing else. We’ve made it here and I can’t make a gamble like that. Half the houses here are empty, they haven’t sold. If we leave and are worse off than when we started we have no one to turn to, not your parents, not mine, not a single friend. No one but us, we have to fight Laurie, for us, for Carter.” \n  \n\n  \nCarter had quieted, but Laurie had tears carving slow paths down her cheek. \n  \n\n  \n“I didn’t think it’d be this hard. I didn’t expect a walk in the park but fuck I didn’t think it feels like this, every day is a pit I have to crawl out from and every day it feels deeper,” she said.\n  \n\n  \n\n  \nI closed the distance between us, embraced her and Carter, and with my head on hers I asked her to fight, and through tears and quiet hiccups she said “I will.” \n  \n\n  \n\n  \nWe spent the next hour cleaning up the house, Laurie bandaged my foot and we planned to rent a carpet cleaner for all the blood. We moved Carter’s crib into our bedroom at Laurie’s request so that killed my plans for making Carter a brother. Things settled for the night and we fell into a fretful sleep. The next day as I was coming home from work I noticed that strange kid again,  Mrs. Norris was far behind on the intersection of my street and another. Like before, he was walking aimlessly but paused in front of our house. He was crying again, but harder this time. Sobs wracked his body as he struggled to hold a steady breath.\n  \n\n  \n“You’re not supposed to be here,” I said as I walked by. He nodded and kept walking but paused for a moment, letting his crying die down until he could speak and he said “You’re the ones that don’t belong. The earth here, it’s wept and wept and none listened to its pleas and so now it lashes out.” I headed toward him at a brisk pace and grabbed onto his shirt, pulling him close so he could see how deadly serious I was. \n  \n\n  \n“Are you threatening me and my family?” \n  \n\n  \nHe met my gaze, there was nothing in his eyes, no provocation, but he was crying again. A smile split his face, and his unsettlingly perfect teeth bared. He looked back into my eyes and said “It’ll end in screams.” He shook his head and laugh-cried until I was disturbed enough to let him go. He started walking away from me again, almost limping now and I regretted not slugging him when I had a chance. \n  \n\n  \nNow I had to deal with the hobbling hag, Mrs. Norris. Henry, a neighbor I recognized from three doors down was turning away from her, his walk was tense and as he retreated back to his house the old woman locked eyes with me and approached to speak. I let out a sigh as she closed the distance. \n  \n\n  \n“Since you’re too much of a fool to heed a warning from those who know better, let me give you a word of advice. Offer yourself in their place. Take your blood, slather it on your door, offer your life. You’ll spend every waking moment of your life in regret if you don’t.” she said.\n  \n\n  \n“What biblical bullshit are you on about? I won’t buy into your madness”\n  \n\n  \n“My husband and I were planning on starting a family before it took him. I haven’t moved forward a day since the day I lost him. That was 17 years ago, and that boy hasn’t aged a day since. He knew. Like an angel of death, he knew it would come for me. It took my future and I’ve spent every moment I can trying to warn others of what happens when the earth learns to hate but every single last one of you has been so stubborn. I haven’t saved a single one, maybe that’s another aspect of its malice, but God if I don’t try… this whole neighborhood will collapse under the weight of its own hubris, please-” \n  \n\n  \n“Look, lady, you’re obviously struggling with something. I feel for you but I won’t let you project your delusions onto me and my family. I hope you can get the help you need but stay the fuck away from us.”\n  \n\n  \nShe looked at me, dejected. She turned away from me and hobbled off and said “fine” in such a hoarse and airy whisper, I almost thought it a phantom. As she rounded a corner and escaped my glare I felt a sting of dull pain throb through my foot. My wound had reopened and fresh blood flowed and seeped into my shoes and the earth. \n  \n\n  \n“How was work?” Laurie asked over dinner once we had settled in.\n  \n\n  \n“Fine, Bueller's talk of promotions has all but dried up though.”\n  \n\n  \n“I’m sure it’ll come up again, you’re a hard worker.” \n  \n\n  \n“Let’s hope my dad’s not in his ear. What about you, how was your day?” I asked.\n  \n\n  \n“Fine we spent it at the park, we went for lunch and we’ve just been out and about, seeing the town.”\n  \n\n  \n\n  \n“You’re afraid to be here alone.”\n  \n\n  \n“Why wouldn’t I be, something was staring at me and Carter, it wanted to hurt us, I’m not comfortable here alone. Maybe Mrs. Norris was right.” \n  \n\n  \nI set down my fork and looked at her, her face was unreadable but she wouldn’t have said anything unless she was mad at me. \n  \n\n  \n“Laurie can we not- I mean, I’m sorry I wasn’t around. I would have loved to spend the day with you and Carter, I’ll look into affordable daycare and you can start looking for a job so you can get some time out of the house. I’m sure things will settle in a bit and we’ll be better off.”\n  \n\n  \nHer hand slid over on top of mine and she spoke, “I’d like that, and I'm sorry, I shouldn’t have been so stand-offish. I’ve been stressed, you’ve been stressed, it’s all been one big ball of stress since we moved in. I’m sure you’re right, we’ll be fine in the end.”\n  \n\n  \nHer hand tightened around mine and I maneuvered around so that I could interlace her fingers with mine. Wordlessly we ate dinner, put Carter to sleep, and made love in the next room. When we had finished we lay down to sleep and in the moments before I faded into dreams I thought that despite it all, I truly was a lucky man. \n  \n\n  \n***Thhhhhhhhh-thump***\n  \n\n  \nMy eyes flung open as I jolted awake. My heart raced as my eyes darted around the room scanning for movement. “Why tonight of all nights,” I couldn't help but mutter under my breath. Only a pale beam of moonlight streamed in through a parted curtain, a silver sliver cleaving through the dark of the room. Nothing, it had been nothing I tried to tell myself. \n  \n\n  \n\n  \n***Thhhhhhhhh-thump***\n  \n\n  \nThe sound was closer than I had ever heard it, I even picked up small details. An organic squelch, wetness, a small raspy moan. It was in the room with us, it was moving closer, I sat up, causing Laurie to stir. My hand reached for the bat by the nightstand and at the same moment, a desiccated arm reached through from the darkness and planted itself firmly in the beam of moonlight. Its hands rested upon what I now realized was a bloody pulpy mess. I brought the bat to my chest and watched in horror as it dragged itself into view. A bone white and withered naked woman, her eye sockets empty and void black. She strained and flexed as she scraped her crotch along the floor, leaving bits of skin and sinew all the while making that damned sound ‘thhhhhhhh-’ and her hand came down to with force ‘thump.’ She turned to face me, wiry white hair parting so I could see her lipless grin. She turned away and continued to drag herself across the floor, deepening the gash, how long had she been at it before I awoke? \n  \n\n  \n***Thhhhhh-***\n  \n\n  \nLaurie jolted awake and gasped at the sight, a scream caught in her throat. She turned to look wild-eyed at me, and the fear in my eyes caused her own to deepen. ‘Thump,’ and the woman was in the veil of darkness once more, but through it, we could still see her silhouette and burning grin. I started to get up, to confront her when the temperature of the room dived, in a split second my heavy breath was visible in quick bursts of white vapor. A crack reverberated through the house and the long gash on our floor split open. The dimensions of the floor warped as a giant, pockmarked skull crowned. It must have been as big as our bed and it kept pushing and jerking until finally, it broke free. A giant head from the neck up was staring at us, mummified skin yellowed like ancient papyrus. Its visage was harsh, angular, and skeletal. Holes and lines, rimmed with blackened flesh, scarred every inch of its skin. Slowly and methodically a giant hand slid out from the gash, inching towards Carter’s crib. \n  \n\n  \nSlow lurid movements as the hand snaked across the air and into the crib. My body was a cage and from it, I screamed with all my might and yet it made no sound as the ragged fleshy fingers curled around Carter and hoisted him up. \n  \n\n  \nLaurie screamed, Carter wailed, and something clicked into place, an ancient instinct, a righteous gene. I slid the covers off and held the bat out, I’d fight, I had no other choice. The hand paused and the head's attention shifted to me and it… blossomed. Every hole in its skin was now filled with the hateful glare of an eye, hundreds of them. Every line split open and a black tooth smiled grinned, grinned, with its whole being this thing was grinning at me. I understood it then, the depth of its rage, it all unfurled and wrapped around me and sank its blackened teeth into all the bravado and fatherly instinct within me until it shattered. It hated me, Laurie, Carter, us, it hated all the world and it would consume all it could in its wrath. The bat fell from my hands as my body went limp and it opened up its mouth, the black pit of its gullet stared into me and I was sinking in its pitch. An ear-splitting shriek dragged me back out into this world and I watched in agonized slow motion as it brought the hand it held Carter in closer and closer to its mouth. \n  \n\n  \nI wanted to scream, wanted to stop it, wanted to close my eyes, but I only watched as this emanation of hatred brought my son to its lips… and took a bite. The crunch is seared into the very core of my being, I’ll never forget no matter how hard I try. A pitiful cry that never truly formed clicked in my head and a crimson curtain fell. A thousand tounges, a thousand mouths all opened and clashed against each other to lap up the blood of my son, the blood of me, and Laurie. Our entire history, our future, gone. The hand pulled back, twisting as it did. The sound of small frail bones breaking and flesh tearing echoed throughout my entire being and still, I couldn’t look away. It took two more bites for it to finish, and it made sure to take its time chewing. When it finally swallowed it pursed its lips at me, smile stained red, and dove into the gash. It sealed itself and returned to the pulpy stain it had originally been, now with a few more blood stains. My ears were ringing, my screams, Laurie’s, the whole neighborhood was shrieking out into the night. In the corner, the naked woman watched us as we shrieked ourselves raw until she too faded into the blackness. \n  \n\n  \nDawn came a few hours later but night had been lit by the blues and reds of police cars. I saw that strange kid amongst the crowd of people, he wasn’t crying anymore. His eyes were empty and solemn, but the grin he had flashed me the day before was still carved into his visage. Mrs. Norris was at his side, our eyes locked and an understanding was shared between us. She shook her head, wiped a tear from her eye, and turned to leave. \n  \n\n  \nEveryone had lost someone that night. Coraline, a widow, was never found, only an empty house and a blood stain. Joshua, a single father, awoke to his daughter's room empty except for the fading silhouette of a woman hidden within a dark corner.  Henry only ever had himself and his dog, all that was left of the chocolate lab was the bisected lower half. There are other tales and losses too painful to hear but no one escaped the wrath of that angel of death, a resentful plot of land, or maybe some unknown dues finally being paid. I couldn’t answer the police’s questions, and they couldn’t answer ours, not even the local news stations would hear our pleas. Maybe there was some higher power at play, trying to cover up the event, the calamity that shattered the lives of dozens. Maybe the truth will come out one day, or maybe this has happened before and they’ve perfected the methods of covering it up. If there’s a consequence in store for my account, I’ll be dead before I ever face it.\n  \n\n  \nThat fateful night was three days ago. I haven’t gone to work since or even talked to Laurie. Catatonic, my mind regressed into a shell of itself because what else could I have done? Yesterday, I walked in on Laurie, lifeless. She downed all the bottles of medication she could find. I thought I had nothing left to lose, but then I saw her, that shell broke and I collapsed into myself more than I ever knew I could. I think I’ll be following after her and Carter before the day is done. I was never a religious man, it’s why my father disowned me. Now I pray that they’re out there, in a better place, and that they’re waiting for me and we won’t have to fight anymore.\n  \n\n  \nMy father once told me that children are your legacy, your future, and so to be fruitful. I think about how much we’ve taken from the earth and how much suffering it’s witnessed, how much blood has been spilled on it. How long it must have spent beneath our shadow weeping, praying for it to end, with enough time and tragedy even the brightest of hearts warp and twist into something else. Maybe you can only take from someone so much before it takes back. It took everything from me. I don’t know how far this spreads, where and if it’ll strike again. All I know is that the very earth we tread and live on can grow to hate us and maybe for you, it already [does](https://www.reddit.com/r/grimoireofmadness/).  \n___\n[TW](https://twitter.com/SantiagoDelMar3)",
    "comments": [
        {
            "level": 0,
            "comment": "I’m so sorry for your loss, I can’t imagine how gut-wrenchingly mortifying that must have been. I know an area of forest near me where apparently an entire village was burned to the ground in spite during the 1700s… should I visit?",
            "score": 14,
            "author": "rephlexi0n",
            "replies": [
                {
                    "level": 1,
                    "comment": "No",
                    "score": 5,
                    "author": "Marcos_Rock"
                },
                {
                    "level": 1,
                    "comment": "Absolutely! Sounds like a cool place to have a killer party bro, like what's the worst that could happen?",
                    "score": 3,
                    "author": "Glass-Narwhal-6521"
                }
            ]
        },
        {
            "level": 0,
            "comment": "hey op so sorry for your loss have you given a /special/ therapist? It could be good going forward, don't let PTSD creep up on you. I wish you the best!",
            "score": 11,
            "author": "Lunnaris"
        },
        {
            "level": 0,
            "comment": "So sorry!  If you stay, dig into land records,talk to a tribal shaman and see if he can help the land since they were the first.  You've lost so much!  Get help.  Don't give in.  You couldn't do anything for all that were lost.  It's bigger than humanity.",
            "score": 3,
            "author": "Shadowwolfmoon13"
        },
        {
            "level": 0,
            "comment": "After the first and second night you had to have known that what the woman and the kid were saying when they warned you had some truth to it. My question is why would you brush them off when you saw it for yourself? You had a chance to get away and you didn't take it\n\nAlso, I'm sorry for your loss. What a horrible way to lose your family. I have sympathy for you but I can't help thinking that this could have been prevented",
            "score": 3,
            "author": "LeXRTG"
        },
        {
            "level": 0,
            "comment": "I think you and Mrs Norris have a little work to do. Figuring out how to stop it before someone else loses their Carter, or their Laurie, or both. Laurie’s death just added one more awful, horrific, painful memory to an already damaged and agonized patch of earth. The First Nation tribe who used to call this land home will help, if they can. After you end the trauma of the land, you can deal with your own, in whatever way you see fit. I will NEVER judge the way anyone else tries to kill their pain. I un-alived myself a few years ago, so I say this from experience and not cruelty. It was a gentle, pure peace, but you won’t see them on the other side. It’ll show you the path their life took, and show you their pasts, along with the futures of the ones you love, but it’s more like you’re a cell phone that is finally plugged back into the main computer for a software update. The update was helpful, and made everything in real life feel…different. I’ve wished ever since to go back to that place, for reasons that are my own. But you owe it to your family to make sure no one else’s family suffers like you and yours did. Wishing you peace on your journey. Perhaps our plugs will be close together. I want to know more.",
            "score": 2,
            "author": "Its_panda_paradox"
        },
        {
            "level": 0,
            "comment": "Cock-a-fucking doodle ass shit sucking ball fuck that is fucking scary holy shit",
            "score": 1,
            "author": "MutantTailThing"
        }
    ]
}