{
    "id": "13qrjh2",
    "score": 43,
    "title": "Survivors of the SS Pontos",
    "author": "Accomplished-Day6294",
    "date": 1684948486.0,
    "url": "https://www.reddit.com/r/nosleep/comments/13qrjh2",
    "media_urls": [],
    "other_urls": [],
    "postText": "It is now the year 1927, with this being our last whaling expedition out at sea. The whaling industry has been in decline ever since the discovery of oil in the Midwest of the United States, along with other resources. Whale oil has been seen as a relic, no longer being used in lanterns or candles with the advent of the lightbulb. Companies don't want to do business with a dwindling industry, shifting their focus to better options by seeing opportunities in growing technologies. \n\n\n\n\nFor us, our last buyer, an Ottawan Canadian, not only wanted to use whale oil from the spermaceti but also its blubber for margarine, including its bone. As he demands to have it used out on the Canadian frontier. The problem was trying to find whales out in the North Sea. Their populations have declined over the past years due to overhunting of sperm whales and, sadly, right whales, and this has had cost-saving effects on the whaling industry.\n\n\n\n\nAnd not to mention the disasters out here at sea, which will make men hesitant to go out. People tend to avoid the sea by reading the newspapers or hearing about severe disasters on the radio, whereas I, well, I love the sea. Ever since I completed my eight years of service in the Marines, I've just returned to my old job, doing what I know best. although it hasn't been the same since. But it's what I know. Yet! I have been thinking about becoming a fisherman, but it's still not the same as being a whaler. Recognizing the same old faces coming on board and heading to our respective cabins\n \n\n\n\nAs we set sail off from the New England coast heading north, with new reports of large sperm whales being spotted in the Arctic. There were 24 men on board the SS Pontos, a sturdy steamboat that could withstand any punishment the sea could give. We are seasoned veterans in this profession, enduring the dangers of the sea and killing whales for the sake of resources. I, for myself, have sailed throughout the North and South Atlantic Oceans and straight towards the Indian Ocean. Going to lands far beyond anything any American can ever imagine, from Cuba to Madagascar. But I feel that this one is going to be different. I can feel it in my bones.\n\n\n\n \nTwenty-five days have passed since we reached Iceland by ship. There we disembarked at the port, gathering supplies and provisions from the seaside town. We stayed for two days in Iceland before we headed out. While we were accommodated inside an inn, I began to hear some chattering by some Icelanders in a pub. And that they have spoken of a great whale. A whale that has caused nothing but misery for the native whalers of Iceland and the Faroe Islands I have been coming to this country more than the others, and being here has made me pick up the language. \n\n\n\n\nAnd as I gleaned from their conversation, their voice was one of fear. Not once in my entire life have some native whalers been afraid of this so-called Great Whale, until they were interrupted by this bearded old man who came to them half drunk and whose voice trembled when he spoke something much worse than their great whale. And that was his encounter with a Vatnaormur. \n\n\n\n\nThe pub was suddenly silent when he spoke of this name. Now, I've heard this name before; in Greenland, it means sea serpent, while here in Iceland, it is called a water serpent. But in the old Scandinavian tongue, it meant sea dragon. \n \n\n\n\n\nOf course, it's all hogwash to believe such a superstitious notion in the modern world. Then again, these folks will see anything that they believe to be a dragon. And any explanation will concur that what he saw was just either a large eel or an oarfish. Besides, having a giant lizard out here in the North Sea will be impossible, nevertheless, there have been sightings of large leatherback sea turtles as far north as Nova Scotia. But as a serpent, I highly doubt it.\n \n\nWith our ship finally maintained, we returned to the sea fully supplied. All of the men were gathered around on the mess deck, and our captain and his first mate had given us new information. There he placed a map on the wooden table, directing his pen by pinpointing the location where the sperm whales had been sighted. And if it were true, a whole pod of whales would be enough to bring back to New England. Finding them and hunting a large one or two will cover our allowances for months. This will give us time to find a new career once this expedition finally concludes. With our meeting adjourned, everyone returned to their respective duties.\n\n\n\n \nWith sheer luck, we spotted a pod of whales off in the distance. Everyone on deck was excited by their sudden appearance this early, as it could only mean that the information we received was true. And now we can be done with this last hunt. However, there was something wrong with these whales. They seem to be swimming away from something and heading in our direction, but how? I knew with my entire life out at sea that these sperm whales don't fear anything, and being the world's largest predator, nothing can get in their way. \n\n\n\n\nThere have been some reasons why, as these females could've been swimming away from a large bull. After all, these cows have calves that are being led by a matriarch. We informed our captain of the situation, so we had to move our ship immediately, as it had been damaged by some frightened cows. Until we spotted a cloud of mist spouting from a large whale that was heading directly towards them. Was it a bull? I mean, it could be a good reason. \n\n\n\nThis large bull was within reach of the pod, where it rapidly swam ever closer. However, we came to realize that this bull wasn't there to court the cows but to hunt them. The closer it got, the clearer we saw its appearance. Being somewhat similar to a sperm whale, yet with some differences. It was much larger than any of the largest bulls out there. Dark in color, we watched the many scars on its robust hide, and as it opened its broad jaws, we could see that it had both rows of teeth on the lower and upper jaws. \n\n\n\nSomething that sperm whales don't have. As the Leviathan clamped its massive jaws on one of the cows. We were flabbergasted by the absolute immense size of this Great Brobdingnagian Whale, which easily picked off a large cow. But for our captain, all he saw was a great prize. When he gave the orders to kill this beast, we looked at one another, thinking of how it would even be possible. Seeing its colossal proportions, it would prove impossible to kill a whale that size. \n\n\n\nNevertheless, we took our orders and prepared for the hunt. One manned the harpoon, while the rest of us wore our oilskins, grabbed our weapons, and rowed out to sea. There was so much blood in the water as we rowed towards the spot. With pikes in hand and a rope on another. Watching the pod swim in fear. \n\n\n\nThere was so much chaos on the surface. When one of the men detected a bull sperm whale off in the distance, somehow hearing the cries from the cows came to their aid. And as it met with the Great Brobdingnagian Whale, The two bulls locked horns before disappearing under the water. Giving the pod of whales some time to escape with their lives.\n \n\n\nIt suddenly became calm out here, with the waves rocking our boats. Some of the men were hesitant about even being out here. But we have to kill this whale and make use of its body. Over an hour has passed since it became quiet—too quiet. When it was time to return to our ship, the Great Brobdingnagian Whale breached out of the waves and swam in our direction. We got on our ship in time, but it was too late. \n\n\n\nThe beast rammed our ship with such tremendous force, knocking everyone off their feet. We could have never believed that a whale like this could do so much damage to a modern whaling steamboat. A monster like this is something we've never experienced before. Our predicament was terrible. Breaching out of the waves again, he introduced his immense size once more before crashing back down below. The worst was not over yet; off to the horizon was an incoming thunderstorm. Winds picked up strength, and waves began to rise like hills. \n\n\n\n\nThe sound of thunder roared over the heavens with a clash of lightning within the dark clouds. The men rushed down inside the ship to fix the situation, as water was rushing inside. It took us hours to repair the damages that were inflicted on our ship. We did our utmost to seal it. But it wasn't good enough. Closing the many doors so the water may not flood We sent out signals for help, hoping and praying for anyone to find our location.\n \n\n\nWe're now stuck in the cold waters of the North Atlantic with this godforsaken storm. With some of the men continuing to work on the damage while the rest of us were on watch. With the rain pouring down on us on deck, we scoured with our eyes to catch anything out there as we held tight on our ropes.\n\n\n\nWhen I began to observe something emerging between the waves. Praying that it wasn't the Great Brobdingnagian Whale seeking another attack. However! The more I gazed at it, the more I noticed that it wasn't the whale. There was something distinctly different about it. I could only try to make out its appearance with the flash of lightning there. I can see that it was elongated yet heavily robust. But there it was, getting closer. We were horrified to witness something that shouldn't exist. Rising out of the waves was this reptilian-like sea serpent. Reddish brown with dark spots, with its long serpentine figure covered with hardened osteoderms and scutes. \n\n\n\n\nHaving a narrow, lizard-like head with rows of crocodile-like teeth. It plunged back into the waves. Was it the Vatnaormur? The sea serpent, the dragon of the sea No! It couldn't be, I mean... It can't. The men sounded the alarm at the sight of the sea serpent. The captain and the first mate got out to see what was going on. And when they did, the Vatnaormur raised itself out of the water, glancing at us with its heavy head before coming down. Examining the semblance of this prehistoric beast, until a ball of fire broke out. We didn't know how it happened, but we had to abandon ship.\n \n\n\n\nEveryone scrambled to get their life vests and weapons. As all of us got into our boats. We immediately left our ship. Before, there was a spectacular sight of this sea dragon trying to coil our ship, instead bringing it down with its weight. Watching it sink below the waves, with us being in awe of what just happened. \n\n\n\n\nThe first mate ordered the men to regain their composure as the captain helped his fellow men row their boat. One man spotted an island west of us. There, we headed in the direction of that island, away from the calamity. But! The Great Brobdingnagian Whale broke out of the waves once more as we dreaded its sudden arrival.\n\n\n\n\nRushing towards the sinking ship Both of the leviathans fought; this time the Vatnaormur clamped its powerful jaws on the whale, making a death roll. As much as I wanted to see this whale dead, we had to get out of there fast.\n \n\n\nSeeing the outlines of trees with each flash of lightning, we are finally getting close to the island. Then one of the sailors noticed something in the water. When an unexpected surprise occurred. A huge, terrifying shark bursts out of the waves, catching one of the boats with its diabolical jaws. It was unlike any other shark I had seen before. Being all completely white, like that of bone, a thick, heavyset body with a short, rounded snout, small black eyes, and very small dorsal and pectoral fins. Watching its black, watery eyes, the monstrous shark was unfazed and unbothered by our attacks. One thing was on its mind for sure, and that was hunger. \n\n\n\n\nGruesomely devouring with its blood-soaked mouth, but what I caught sight of was its gill openings, which were small for its great size. We rowed harder to get away from the carnage. Thirteen meters long and probably as heavy as two bull elephants. The white shark thrashed around.\n \n\n\nWe finally reached land, jumped out of the boat, and ran towards the trees. I don't care what island we're on. As long as we're not back in the water. The storm raged on throughout the night. We were now stranded, with a few remaining survivors. All we can do is hope that these monsters can go away, hoping that someone will find us soon, if not our corpses.",
    "comments": []
}