{
    "id": "13wvti3",
    "score": 269,
    "title": "I started hearing unsettling whispers coming from the walls of my apartment.",
    "author": "Frequent-Bed-40",
    "date": 1685561985.0,
    "url": "https://www.reddit.com/r/nosleep/comments/13wvti3",
    "media_urls": [],
    "other_urls": [],
    "postText": "I had just moved into my new apartment, a cozy little place on the outskirts of town. The building was old, with creaky floorboards and peeling wallpaper, but it had character. I was excited to start this new chapter of my life, but little did I know that the walls of my new home would soon reveal dark secrets about my neighbors.\n\nIt started on a quiet Tuesday night. I was lying in bed, trying to fall asleep, when I heard it - a faint whisper, barely audible. I sat up, straining my ears to catch the words. It sounded like someone was talking, but the voice was muffled, as if coming from behind the walls.\n\n\"…she doesn't even know… poor thing…\"\n\nI shook my head, dismissing it as my imagination playing tricks on me. But the whispers continued, growing louder and more insistent. I couldn't ignore them any longer.\n\nThe next day, I decided to investigate. I pressed my ear against the wall, trying to pinpoint the source of the whispers. They seemed to be coming from the apartment next door. I knew I shouldn't eavesdrop, but curiosity got the better of me.\n\n\"…he's been cheating on her for months… with her best friend…\"\n\nMy heart raced as I realized that the whispers were revealing secrets about my neighbors. I felt guilty for listening, but I couldn't help myself. The whispers were like a drug, drawing me in with their dark allure.\n\nAs the days went by, the whispers grew more sinister. They spoke of betrayals, hidden desires, and unspeakable acts. I found myself becoming obsessed, unable to focus on anything else. My once peaceful apartment had become a prison, trapping me in a web of fear and paranoia.\n\nI tried to ignore the whispers, but they were relentless. They invaded my dreams, turning them into twisted nightmares. I began to question my own sanity, wondering if I was losing my grip on reality.\n\nOne night, as I lay in bed, the whispers took a chilling turn.\n\n\"…he's planning to kill her… tonight…\"\n\nI bolted upright, my heart pounding in my chest. I knew I had to do something, but what? I couldn't just barge into my neighbor's apartment and accuse them of murder. But I couldn't sit idly by, either.\n\nI paced my apartment, my mind racing with possibilities. The whispers grew louder, more urgent, as if urging me to act. Finally, I made a decision. I grabbed my phone and dialed the police, my hands shaking as I explained the situation.\n\nThe police arrived within minutes, their sirens cutting through the night. They questioned me, their skepticism evident, but I insisted that they check on my neighbor. As they knocked on the door, I held my breath, praying that I wasn't too late.\n\nThe door opened, revealing a scene of horror. My neighbor lay on the floor, her lifeless eyes staring blankly at the ceiling. Her husband stood over her, a bloody knife in his hand. The police tackled him to the ground, cuffing him as he screamed incoherent obscenities.\n\nAs they led him away, I stood in the doorway, my body trembling with shock and relief. The whispers had been right, and I had saved a life. But at what cost?\n\nThe whispers continued, their dark secrets seeping into every corner of my life. I knew I couldn't stay in that apartment any longer, but I also knew that I could never escape the whispers. They had become a part of me, a twisted reminder of the darkness that lurked within us all.\n\nAnd so, I write this diary, a record of the horrors I have witnessed. I can only hope that by sharing my story, I can somehow find a way to silence the whispers once and for all. But deep down, I know that they will never truly leave me. They are a part of me now, a constant reminder of the darkness that hides behind the walls of our everyday lives.",
    "comments": [
        {
            "level": 0,
            "comment": "I'm confused. You say you saved a life, but whose? You said the husband was standing over the wife and her eyes were lifeless...",
            "score": 62,
            "author": "Blubelle85",
            "replies": [
                {
                    "level": 1,
                    "comment": "She could potentially just be like pre dead (I forgot the term for it) like say someone gets shot and they pass out, only to get revived later by their body or the paramedics/hospital.\n\n\nI guess i was looking for the term passed out?",
                    "score": 16,
                    "author": "Icy-Actuator5524"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How did you save a life if the neighbor was already dead on the ground when the cops got there?",
            "score": 7,
            "author": "ohhoneyno_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ya, I’m confused too. I think we all are…",
                    "score": 1,
                    "author": "Olivedogfatdog"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m a tad confused",
            "score": 4,
            "author": "Teighriel"
        },
        {
            "level": 0,
            "comment": "Please please please share more diary entries!",
            "score": 10,
            "author": "Maliaa91"
        }
    ]
}