{
    "id": "13zcczg",
    "score": 18,
    "title": "My parents tried to kill me 30 years ago and I had no clue why.",
    "author": "Condupee",
    "date": 1685797615.0,
    "url": "https://www.reddit.com/r/nosleep/comments/13zcczg",
    "media_urls": [],
    "other_urls": [],
    "postText": "December 16, 1991  \nIt was a harsh winter, and I was 10 years old. Christmas was coming, but the atmosphere was different. I was living in my parents house and was inside my room on my bed. As I got out of bed and went downstairs I found a notebook, it had weird drawings in it and what seemed like instructions to cast a spell.  \n\n\n  \nI went back upstairs to my room when I saw my parents. Both of them seemed different. My mom snatched the notebook and started to yell at me to get in my room and that I was in trouble. I rejected her request and walked away. My mom screamed something that I couldn't understand, and as I turned back, I saw a giant tree rise from a wall and destroy my room. In shock and tears, I ran downstairs and contemplated what I had to do.  \n\n\n  \nQuickly, I grabbed everything that I had and tried to run out the door, asking, \"What are you doing?\" I looked behind me and saw my mom with a huge grin on her face. At this point, I knew all my parents wanted to do was kill me I replied to her by saying: \"Oh, nothing! I'm just getting some of my stuff into a little pile.\"  \n\n\n  \nMy dad replied, \"Don't lie to us like that. You're trying to escape, aren't you? I panicked and ran as fast as I could. Before I could do anything, my mom picked me up and tried to bring me into the kitchen. I noticed my dad inside the kitchen, picking up a knife, ready to stab me. I screamed at the top of my lungs in fear.  \n\n\n  \nI threw off my shirt and used it to try to suffocate my mom. She started to choke on the shirt and then dropped me, we both fell to the floor as she gasped for air. Before my dad could run at me, I grabbed all my stuff and ran out of the house, frantically putting my shirt back on.  \n\n\n  \nI ran out of the house in the freezing snow. I had no jacket, hat, earmuffs, nothing. I tried finding my friend James house. After what happened, I felt he was the only one I could ever trust again. I walked for what felt like miles until I collapsed in the snow.  \n\n\n  \nSo much had happened in just one day that I couldn't process it. I bawled my eyes out, having no clue what would happen next. Still in tears, I tried to get up but realised that my legs and arms were too cold to try and get up. I looked up and saw his house,  \n\n\n  \nJames house! I was so close to safety, but it was too late now; my eyes were starting to shut and my heartbeat was slowing down. Even at such a young age, I knew that this was the end of the line for me. I closed my eyes and put my head down. Slowly, I drifted into obscurity as I saw life leave me. With the little hearing I had, I heard a door shut and someone scream my name. They picked me up and rushed me into their house.  \n\n\n  \nI  warmed up and was finally able to open my eyes. What I saw was James and his dad. I was relieved. \"Why are you here?\" James asked. I explained everything—what happened with my parents, the walk to get here. Tears rushed down my cheeks for the third time. James' dad was a very sensible man. He worked as a 911 dispatcher for longer than anyone could remember, and people recall him working very well under pressure even when he was a kid. Immediately, he told me to call the police and tell them what happened. 30 minutes later, the police ran into my house, frantically looking for my parents.  \nThey finally searched in the kitchen, where they found both my parents on the floor with blood splattered everywhere. They had been killed, and the police found a note that said, \"Too late!\" The pen in which it was written was still on the floor next to them. The police took it and the note as evidence. The police immediately came to me to ask if there was anyone who would do something like this to my parents. The problem was that my parents had never been rude or made enemies with anyone in our town. No one disliked them or had any reason to try to kill them.  \n\n\n  \nThe police said to me, \"Thanks, we will keep that in mind.\" I never did have any godparents, or anyone that I was close enough with to be able to stay with for the rest of my life. I thought that I would end up in an orphanage, but thats when James asked if I wanted to stay with him for a while as the police found out who killed my parents and, better yet, who caused my parents to want to kill me.  \nA little while turned into a year, and a year turned into eight years. After 8 years, I moved out and went to college. My parents were now a distant memory, and the police still did not know who had ended up killing them. The pen and the note both ended up with no fingerprints. It was an unfortunate reality that I would never find my parents killer, but it was a reality that I would have to accept  \n\n\n  \nI am currently sitting in my office job, writing about my past life trauma after an email I just received. The email was from the police, they did not find the killer, but they found what drove my parents to want to kill me. From an old sample of their blood they had recovered all that time ago, they were able to find an ancient zombie like virus that drove people to try and murder their children or nieces and nephews  \n\n\n  \nThe virus comes from ancient Egypt and is passed down from generation to generation. The reason that we had never documented anything like this happening before was because the human body had built an immunity to protect people who had lived with this disease. But due to a genetic mutation inside my family, the immunity disappeared, and my parents went mad  \n\n\n  \nIt's closure, but now I am forced to not have children: I always did want to have kids, it's unfortunate that I will never be able to now. I cry every once in a while because of that.",
    "comments": [
        {
            "level": 0,
            "comment": "You could adopt. You know what it's like to have no one.",
            "score": 6,
            "author": "twiztiddarc"
        }
    ]
}