{
    "id": "13zxeq5",
    "score": 493,
    "title": "Wedding Nightmares. Night Wedding.",
    "author": "CornerCornea",
    "date": 1685844090.0,
    "url": "https://www.reddit.com/r/nosleep/comments/13zxeq5",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/nosleep/comments/1410n9l/magic_traditions_night_wedding).",
        "https://www.reddit.com/r/nosleep/comments/1433l46/old_traditions_for_a_night_wedding/)"
    ],
    "postText": "I'm recently engaged to a beautiful woman named Larissa who makes my head swirl. Looks, personality, and a similar taste in food, I mean she had it all. For my birthday last year I got to drive one of those Lamborghinis across the track, and fire a round out of an Abram tank. A tank round! I'm not much of a gun aficionado, but a tank round!\n\nWhich was all the worst, when 3 weeks before the wedding I had to tell my drop dead gorgeous fiancée that I needed to leave for a couple of days.\n\nIt's not an easy thing for a bride to swallow:  juggling food prep, alterations, cancellations, seating arrangements, two sides of the family, busy bodies, food allergies, one aunt that won't stop calling, and another one that keeps asking if her wearing white to our wedding as she's sort of the matriarch of the family was going to be a problem (side note: we told her multiple times that it was not okay). The list goes on, trust me.\n\nAnd doing it all alone? It was a big ask. Which is why when my fiancée asked for an explanation. I had to tell her the truth no matter how terrible it sounded. It just wouldn't feel right knowing that the precursor to our marriage was a lie.\n\n\"Is it kids? Oh God, do you have a little Jimmy running around somewhere? No, Jim. The wedding is in 13 more days. I can't handle this right now.\"\n\n\"Lars, what? No. It's not a kid.\"\n\nShe was peeling and stamping invitations on our dining room table. \"Well then what is it? I thought we agreed to no bachelor parties. I thought. We agreed that those were for people who were ready for a wedding but not the marriage. I don't care if it is Tradition.\" She stamped the envelop extra hard.\n\n\"No, it's nothing like that. Trust me.\" I shuddered just thinking about it. \"It's not any kind of thing I would be doing if I didn't have to.\"\n\nShe glared at me, \"But you have to.\"\n\nI nodded.\n\nThe table shook again. \"Okay. So spit it out.\" She handed me a few envelopes. \"If it's not a kid. And it's not a bachelor party. Then what is it?\" She scoffed, \"It's not like you're married right?\" Her smile slowly started leaving her face, \"Oh my God.\" She crumpled an envelop against her forehead. \"You've got to be kidding me.\"\n\n\"Larissa...\"\n\n\"Don't you Larissa me!\" She looked me right in the eye, \"Tell me I'm not the other woman Jim!\"\n\n\"Well not technically.\"\n\n\"What does that even mean,\" she exasperated. \"Go on, tell me how it is not technically.\"\n\nSo several years ago I was straight out of college. I could have worked some menial desk job and climbed the corporate ladder. But the idea of never leaving my home town ate me up.\n\nSo when an ad for native English speakers to come teach on some remote island presented itself to me. I jumped at the opportunity. Next thing I know I was booking a one way ticket to begin my new life as an expat.\n\nIn my head, I thought I was going to land, check into my hotel, enjoy the sights, and come the first Monday walk to the nearest English Cram school and get a job on my good looks alone.\n\nOn Monday, the school I went to, the hallways were packed with other Americans, British, Australians, and I think some Canadian was squishing himself into one of the tiny student chairs. All waiting for a job interview.\n\nThe next place was like that as well.\n\nSo was the next.\n\nBy the end of the first week I was beat. Tired and defeated, I thought my luck had run out. So I did what any 20 something would in a brand new city. I hit the bars. I hit them hard.\n\nAfter the last place kicked me out as they closed I was stumbling around trying to make my way back to the hotel. Grumbling, groggy eyed and trying not to vomit all over the street. When something shiny caught my eye.\n\nIt was a silk red purse with gold embroidery tied with a thick yarn. There weren't many people out this late. But everyone who passed by it acted as if it wasn't even there. Like they didn't see it or something.\n\nThe bag alone looked like it was worth something. At the time all I was thinking was that, maybe someone would trade a drink for it, as my pockets were empty and all I wanted was for my head to be the same way.\n\nI stumbled as inconspicuously as possible, or as much a drunk guy could finesse, and made my way toward the bag. Looking around the entire time, making sure no one was running up claiming that it was theirs, or worse, calling me a thief and have me thrown in jail in a different country.\n\nAnd when no one did, I finally scooped it up and untied it. To my surprise, the bag was filled with money. Bright colorful bills with huge figures, even at the current exchange rate. And there was gold ingots too. Some rubies. I took one out and bit into it, almost breaking my tooth.\n\nI couldn't believe how my luck had changed. I flipped through the cash and realized that there was enough to fund my trip for a few extra weeks. AND get me a plane ticket back home. The jewelry even, seemed sizeable.\n\nThere I was, in one of the lowest, darkest moments of my life. And a pot of gold seemingly dropped out of the sky for me. Thoughts of finding its real owner never even occurred to me.\n\nI was quickly pocketing the thing and planning to high tail it out of there when a frail old man approached me from the shadows. Now I had learned some of the language beforehand, but I couldn't understand what he was saying.\n\nHe kept smiling though and patting my shoulder, spouting words so quickly that if they weren't already gibberish to me, they would still make no sense in my drunken state.\n\nI fumbled the bag around before juggling it into the crook of my arm, in order to reach my phone to help translate what the hell the old guy was trying to tell me.\n\nThe translation caught him mid sentence but all I needed was to hear one word back then and I regurgitated the last couple of hours all over the sidewalk and blacked out.\n\nWhen I came to, I was back at the hotel with a killer hang over. I was wondering how I made it back when I remembered faintly of the old man helping me. That's when I remembered the pouch and my eyes darted around the room and to my relief, \"It wasn't just a dream.\" The pouch was there, full and plump with a few bills sticking out from the throat.\n\nNext to it was a note, that I would later translate to read about a woman who had turned 18 that year. The numbers 3 and 13 were inscribed as well. Her approximate height, which seemed weird. I mean, why would they go through all this trouble and not just tell me her actual height? Her name, her sign, and her address.\n\nI was completely fucking baffled at all of this information, when I suddenly remembered my phone. I pulled it out and looked up the last thing still on my screen, which was a translation from Google. It read: my future son-in-law. I am so happy you've agreed to marry my daughter. Don't forget to come to the wedding.\n\nNo wonder I passed the fuck out.\n\nI shook my head and checked the purse again. Yeah there must have been close to 5 grand in there. Not including the gold, the rubies, or a jade piece I found at the bottom.\n\nWhatever was going on. I had no clue. But I sure as hell wasn't about to get married to some girl I didn't know. Even if I did need the money.\n\nSo I used a bit of the cash to get a taxi to the address. When I arrived, the old man saw me from his courtyard. He was smiling and happy, pointing and calling for someone inside the house. A few seconds later a short lively woman appeared. And she was just as happy to see me.\n\nI didn't know what was happening but next thing I do know was they surrounded me in a hug. Happy and joyous, bouncing and wobbling, enough for me to almost hurl again, which I did, except this time I swallowed it.\n\n\"Hey, I'm sorry. I don't know what's going on. But the note says something about marriage.\"\n\nThe pair looked at each other and exchanged a series of phrases. \"Marriage,\" the old man finally enunciated.\n\nI nodded. Then shook my head. \"No, not marriage.\"\n\nWe went back and forth in a similar manner for awhile before the woman ran off to get someone. When she returned with a young man about 14 or 15, wearing glasses and sporting a bowl cut, he explained to me about the pouch.\n\n\"It's a tradition in this area for a ghost dowry. I think that is how you say it.\"\n\n\"A ghost dowry?\"\n\n\"Yeah. In our area. When a daughter dies really young, especially as an infant. The parents will start saving money for her ghost dowry. Because we believe that when she turns 18, she'll return and ask to be married off.\"\n\n\"You've got to be kidding me.\"\n\n\"No, it's quite common. Mostly everyone knows about it. Which is why they don't pick up the pouch. Not unless they're really in need of money.\"\n\n\"I'm really in need of cash kid, but I'm not about to get married. I'm especially not getting married to some...girl that passed away.\" I handed him the money but he wouldn't even touch it. Avoiding it like some kind of plague. I even tried handing it back to the old man but he kept pushing the pouch back at me and shaking his head.\n\nThe kid shrugged, \"You can't give it back. Those are the rules. Once you've picked it up, you've accepted the dowry and MUST get married.\"\n\n\"Why me,\" I asked rhetorically.\n\n\"She chose you.\"\n\n\"What? Okay. Listen kid. What if I don't get married? Are they going to report me to the cops or sue me?\"\n\n\"No.\"\n\n\"So I can just walk away?\"\n\nThe kid shrugged again, \"You'll be back.\"\n\n\"What?\"\n\n\"I'm not sure. But from the stories I've heard. The groom-to-be always comes back. It might take awhile, but he does. Sometimes it's because he's traditional himself and his family tells him he must do the right thing. Other times he comes back because the girl won't leave him alone.\"\n\n\"Won't leave him alone?\"\n\n\"Yeah. They say that the bride will come find the man at the hour of her birth, haunting him until he returns and agrees to fulfill his end of the bargain.\"\n\nI rolled my eyes. \"Yeah. Sure. I'm sure that's it kid. Either way. I can't take this money knowing what it's for.\" I put it on the table. \"Please tell him that I wish their family luck in fulfilling their tradition. Also, tell them that I'm sorry for using some of the money for the cab fare. I had no other choice in order to return what is theirs.\"\n\nThe boy shrugged a third time, \"It's yours now. You should take it. What are you going to do? Walk all the way back?\"\n\n\"That's exactly what I'm going to do.\"\n\n\"It'll be dark by then,\" he added. \"She could come find you.\"\n\n\"I'll be fine. And plus what if she was born in the day time?\"\n\n\"They only come at the dark time of her birth hour. If she was born in the afternoon. She'll come at midnight,\" he shouted after me as I left.\n\nI tried not to think about everything that happened to me this past week as I walked back. But it wasn't a rocks throw by any stretch. Which gave me plenty of time to think. About my maxed out credit cards, the hotel stay winding out by the end of the week, and of course the wedding.\n\nBy the time that I got back to the hotel I was a tired, hot mess. I was also hungry and my feet were swollen as they were unused to the tropical heat. But I was sure glad that the showers were already paid up. I took an extra long one before crashing into my bed. Snacking on a candy bar I had brought from back home.\n\nI turned on some tv and tried not to let the impending doom of being kicked out on the streets bother me too much. As a plan began brewing in my head on who I'd call in a few hours when it was morning stateside. A few people still owed me favors back home, which I hoped they would be good for, which I hoped was good enough to get me back home.\n\nSeveral times I dozed off as the tv buzzed in the background. Each time I woke up staring at the bright red alarm clock blaring its red angry dashes at me. By the third or fourth time my head jerked me awake as it fell to my chest. I looked up to see the time on the clock. It was 3:12. When something clicked in my head and I fished for the note still in my back pocket.\n\nSu-ru Yen\n\n18 this year.\n\n3:13\n\nI stopped reading and glanced back up at the clock. The little kid's words rung in my ear. \"She comes at her death hour.\"\n\nI waited, not realizing that I was holding my breath until I felt my lungs start to burn.\n\nIn a blink the clock changed and I glanced around as if waiting for something to happen. But nothing happened. My stomach suddenly growled, echoing in the empty room and I laughed, \"Maybe I should have just taken the money.\"\n\n\\*dak dak\\*\n\nCame a knock from the motel door.\n\n\\*dak dak\\*\n\nI felt my heart suddenly constrict and then refused to let go.\n\n\\*dak\\*\n\nI was shaking in my bed, too afraid to move or answer the door.\n\n\\*dak dak\\* \\*dak dak\\* \\*dak\\*\n\nIt went on like this a full 4 minutes before it stopped. When it had finally stopped I tried getting out of bed, but I couldn't. For a second I was afraid to look down, afraid that her hand would be there holding me in place so that we could elope.\n\nBut it was just my hand clenching the bed sheets so tightly that I couldn't budge. I had to use my other hand to pry my own fingers off in order to creep slowly to the door and look into the eyehole.\n\nIt felt blurry as I blinked my eye, trying to clear it. Tears had welled at the corners without me realizing it. I wiped them away and slowly, reluctantly bent down and stared into the peephole.\n\nNo one was there.\n\nBut for the next 3 days. My door would knock a few seconds after 3:13. It didn't matter if I was on the bed, or in the bathroom. The closet was the worst as the knocking felt like it was right against my face. It didn't even matter if I ran outside, as no one would ever seem to be around. It didn't matter what I did. The knocking would always find me.\n\nOn the fourth and last day of my stay. The door knocked right on time.\n\n\\*dak dak\\* \\*dak dak\\* \\*dak\\*\n\nI felt the familiar twinge in my chest and my body was numb all over. But this time I was determined to take a look. And finally catch whoever or whatever it was that was playing this cruel joke on me.\n\n\\*dak dak\\* \\*dak dak\\* \\*dak\\*\n\nI tried getting out of bed but I couldn't. I was too scared. Several times I glanced from the clock to the door. Afraid to take my eyes off the door for too long, afraid that she would come through it if I did. Afraid that I would miss seeing her, and she would get her cold dead hands on me so that we could be together forever. And as the clock started ticking down. I kept whispering to myself. \"She's only here for four minutes. She's only here for four minutes.\" And it was almost 3:17.\n\nSeconds before the clock changed I jumped out of bed. Determined to end this thing once and for all.\n\n\\*dak dak\\* \\*dak dak\\* \\*dak\\*\n\nI didn't have time to look through the door. Even if I did I was afraid if I saw something there. I'd be too chicken to open it up. So I tore the band aid right off and swung the door wide open.\n\nThere was no one there.\n\nBut then from my corner cornea, something caught my eyes. A trail of something translucent was dragging away. I tried to take a step after it but my first step out of the door stopped me dead. My foot was drenched wet and it felt sticky beneath my sock. The coldness of it traveled up my spine, and to this day I can only describe it as the feeling of something metal scraping across my vertebrate. By the time I looked up, the wisps were gone. And the trail it left behind was already drying.\n\nThat night I couldn't sleep a wink. I waited until morning came and took to the streets. Desperate to find the old couple's house. Stopping several times to ask for directions and circling around streets and street signs that I couldn't read until I heard a familiar voice.\n\n\"I told you you'd be back.\"\n\n\"Kid,\" I grabbed him.\n\n\"Whoa. You look like you've seen a ghost.\" His eyes grew wide as he looked me over. \"So the stories are true!\" He didn't waste any more time. \"Come on,\" he called after me. Leading me down the street and to the old couple's courtyard. The pouch was still on the table outside where I had left it days ago.\n\nThe kid knocked on the door and shouted until the old man answered. He was still in his sleeping clothes when he saw my face, and his demeanor completely changed. He was so happy to see me. Opening the door wider and ushering us inside.\n\n\"Tell him I want it to stop,\" I told the kid. \"Tell him I want her to leave me alone.\"\n\nThe kid translated but the old man shook his head before speaking. The kid looked at me and said, \"He says then 'Marry her'.\"\n\n\"I can't do that!\"\n\n\"Then she'll never leave you alone.\"\n\n\"She just going to keep knocking on my door? Forever?\"\n\nThe kid turned to the old man and told him in their language what I said. The old man gripped his cane and tapped it once lightly on the ground, almost as if he were proud, before he told the boy who then told me, \"She's a kind and gentle soul. He knew she would be. If she's only knocking on your door so far.\"\n\n\"So far? So far? Okay. What? Fuck. So then what? What happens if I marry her?\"\n\nThe kid asks the old man and after a few words were exchanged he turned to me, \"Then you will be wed.\"\n\n\"yeah. I get that. But what does that really mean?\"\n\nThe kid clicks his tongue, \"From what I understand. I think it means you'll have to honor her every month.\"\n\n\"Honor her? How? Like make a sacrifice? A blood sacrifice or something?\"\n\nThe kid laughed, \"No. Just Bai Bai. I don't know how to say it. Pray?\".\n\n\"Pray to her?\"\n\n\"Acknowledge her. Talk to her wooden nameplate. It's what serves as a gravestone for our dead.\"\n\n\"So just pray to her once a month, and that's it?\"\n\nThe kid talks to the old man for awhile before turning back to me. \"Yeah. That, and you'll be blessed.\"\n\n\"Blessed?\"\n\n\"Yeah. Not sure about that one.\"\n\n\"Okay. Fine. What else. Like what if I want a girlfriend someday. Or get married. Have kids. Can I not do that? Will she haunt me? Haunt them?\"\n\nThe kid asks the old man before turning to me, \"Not if you ask for her permission. In a ghost marriage, you're allowed to have concubines. As long as she is consulted first and agrees.\"\n\nI shake my head, \"This is fucking crazy.\"\n\nThe kid shrugs. I seem to get the feeling he likes to shrug. \"It's either that or she keeps haunting you.\"\n\nI mulled that over in my head. \"Shit.\" I stomped around the courtyard. \"Okay. Fine. Fine! What do I need to do?\"\n\nThe kid looks up at the sky. \"We'll have to prepare.\"\n\n\"What? But it's already late. I want to get it over with as soon as possible. I don't want to wait another night of her coming to my door.\"\n\nThe kid smiles, \"Don't worry. You won't. This kind of wedding can only happen at night.\"\n\nFor the next several hours I watched as neighbors and family. Cousins. Came to help. Food was brought in. Large round tables were set outside the courtyard. A tailor came and measured me up, twice. Decorations were strung and the sun began to fall.\n\nWhen night came, the people who had gathered were tired but pleased with themselves that they had finished. I was asked to change into my wedding clothes and to wait outside the door of the couple's house until called. The lanterns behind me burning and the smell of food wafted in the air.\n\nI waited until the doors finally opened.\n\nInside I saw the old man and the old woman start constructing something before a traditional wooden shrine at the back of the room.\n\nThey started with the legs. Sewn pieces of white cloth. The torso. The arms. And finally the head. When it was put together, the couple slipped on a white dress over the effigy they had constructed. Then the old woman went off through one of the side doors and returned with a box. From inside the box she withdrew a folded blanket. It looked faded but the edges were crisp and completely clean. The old man reached into the box and removed a sickly green thread that seemed to stick to his fingers, from it hung tiny strands of black hair, which he stuck gently to the back of the effigy's head.\n\nThe woman threw the blanket over its face, covering it.\n\nThen the old couple turned to me and beckoned me forward. I looked behind me and none of the other guests moved.\n\nEven the kid stood next to the door, unwilling to step inside as I entered.\n\nI walked slowly up, next to the effigy until we stood side by side.\n\nThe old woman turned toward the shrine where a wooden plaque stood at the table. On it were three character words that I couldn't read. And she began to speak, the kid behind us translated en suite.\n\n\"Dear daughter. Mother is glad that you're finally being wed off. Though Mother will miss you as a girl. But I am so glad of the woman that you have become. I am so proud of you. Please, continue to make me proud.\" She sighed. \"When you were born I was so happy. Even if you only lived for a few short minutes. And I am sorry that the fates have been cruel to you. But I am thankful that they at least showed mercy enough to give you a husband. Take care my sweet girl.\"\n\n\"I am sorry that I couldn't have watched you grow up. I am sorry that I couldn't say that I am sorry to you when you did, so that I can apologize for waiting too long to have you, when we could have enjoyed you all this time. We love you,\" the father finished.\n\nThe old couple hands me a bowl. Inside are small boba looking balls swimming in a clear soup.\n\nThe kid behind me, \"It's tradition to take a bite, and then feed your bride.\"\n\nI looked at the old couple and they nodded at me, motioning for me to eat. I dipped my spoon in and took a mouthful. Chewing slowly. And swallowing.\n\nThen they motioned for me to feed her.\n\nI dipped my spoon again. And awkwardly raised it towards her. Slipping it under the veil to where her lips would be. Pretending to feed her.\n\nNow I watched them put this thing together. Besides the creepy hair and the swaddling cloth over her head. It was nothing more than linen and stuffing. I knew this.\n\nAt least that was what I thought until I heard it chew.\n\nI could hear her jaws sticking as they moved up and down. The room was dark but signs of the veil shifting completely terrified me. I couldn't even hear the people breathing behind me or the lanterns burning anymore. All I could hear was her chewing.\n\nWhen she finished. There was silence. Then everyone cheered.\n\nAfter that, it was like any normal wedding I had attended. The guests poured in and I shook just about everyone's hand. Hugging complete strangers. My new parents. And even the kid.\n\nThen we ate and drank, for almost a week. Someone was sent to get my things from the hotel and I stayed with my in-laws for the remainder of my time in that country. Which turned out to be several years. Because the following week I was offered as job as an English instructor at a nearby school.\n\nI was told the principal owed the old couple a favor, but something told me that it wasn't the whole story.\n\nI enjoyed my work at the school but didn't stay for long. As I started traveling to film a documentary about the local cuisine after a few of my YouTube videos mysteriously went viral as an expat who tried weird but delicious treats.\n\nEventually, my in-laws passed away. First it was mom. And four days later dad followed suit. I lived alone in the house for awhile, before I hit the jackpot at the weekly supermarket draw from one of my receipts. That, along with selling the house, was enough for me to go back to America and start a brand new life. Where I opened several shabu shabu restaurants that were met with great success.\n\n\"Eventually meeting you during one of my rounds at the restaurant.\"\n\nMy fiancée who had been listening to my story slack jawed the entire time couldn't believe what she was hearing. \"Bull-fucking-shit!\" She slapped me playfully across the arm. \"You are such a good fucking liar!\" She laughed. \"I've always heard about guys not wanting to help out with the wedding arrangements. But this one takes the fucking cake. I'm going to post this in the group chat tomorrow. Bra-vo.\"\n\nI laughed with her. \"Yeah. That's it. Skirting duties. That's me.\"\n\n\"Now finish this up and let's go upstairs,\" she commanded. We stamped the last envelopes and went to bed. She was still laughing sporadically as I closed the door to our bedroom. \"Knock knock,\" she joked.\n\nI humored her, \"Knock knock.\"\n\nAnd we watched tv until she fell asleep.\n\nI made sure she was cycling in rem, before I gently crawled out of bed and put on my slippers. Softly opening the door and closing it behind me as I walked through the house. Down to the first floor. Then to the basement. Where I pulled the key I kept around my neck and slipped it into the lock.\n\nInside the basement was bare, except for two chairs and some boxes that I had taken from the old house, and the table, and the small wooden plaque that had my first wife's name inscribed on it in her native language.\n\n\"I'm going to get married soon,\" I told her. \"She's a great person. Funny. Beautiful. And devoted. Kind of like you.\" I held the wood plaque in my hands. \"I hope you approve.\" I waited as if she would answer. But she didn't. Never in all the years we've been married has she talked. \"I can't go back home to ask for your permission. But I hope that this is enough.\" I looked at her name, almost longingly. As I had grown quite attached to our time together. \"And I hope that this will be the last time we talk as I move on with my life. Thank you so much,\" I told her as I put her away.\n\nMonths flew by, and I never revisited the basement. Knowing full well that I had missed our visiting days. Though I'd often catch myself talking to her on some tough days. But nothing bad happened by not seeing her plaque. Nothing bad at all.\n\nSoon the wedding day was upon us. And it was a great party, as great as the best there ever was. Great food. Great company. And tons and tons of alcohol.\n\nLarissa and I were giggling at the end of it, drunk as we stumbled upstairs from the venue to the presidential suite. Laughing all the way, kissing, barely able to keep our hands off each other as we got into our room.\n\nMy new bride pushed herself off me as we entered the threshold, and sprawled herself on the bed. Her legs rubbing against each other as her eyes invited me to come closer. I propped a knee on the bed ready to join her.\n\n\\*dak dak\\*\n\nWe both shot our eyes to the door and then at the side table where the clock blared at us an angry red of 3:13.\n\nLarissa gave me a horrified look. I could see her bottom lip quivering.\n\n\"Hello,\" I called out. With my back to the door. \"Sam? Bobby?\" But no one answered. \"Room service?\"\n\n\\*dak dak\\*\n\n\\*dak\\*\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nedit: I've received word from [a traveling magician about night weddings](https://www.reddit.com/r/nosleep/comments/1410n9l/magic_traditions_night_wedding).\n\neditt: I've been made aware of [a taoist priest concerning night weddings](https://www.reddit.com/r/nosleep/comments/1433l46/old_traditions_for_a_night_wedding/)",
    "comments": [
        {
            "level": 0,
            "comment": "This was so freaking creepy. But also if I were dead and my husband remarried without my permission I would haunt the hell out of them 😂",
            "score": 88,
            "author": "machsh",
            "replies": [
                {
                    "level": 1,
                    "comment": "I never knew how to get her permission. I just sort of talked to her. She never answered me. But I'm starting to think it's a no. Or...and I hate to think it. What if she doesn't like my new wife? And why?",
                    "score": 56,
                    "author": "CornerCornea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What if she wants to make it a \"three some\"?  Have a feeling you're in for a rough road ahead!  Good luck!",
                            "score": 13,
                            "author": "Shadowwolfmoon13",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That would be a supernatural experience. That I could miss. I’m thinking of passing through a ghost, seems 🥶",
                                    "score": 10,
                                    "author": "CornerCornea"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Get to booking that flight. Like, right now.",
            "score": 28,
            "author": "iwinharder",
            "replies": [
                {
                    "level": 1,
                    "comment": "Shit you might be right but can I ask for permission still. Or, should I be asking for forgiveness?",
                    "score": 19,
                    "author": "CornerCornea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "BOTH!!",
                            "score": 9,
                            "author": "Reddd216",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I really hope she gives them to me, I've never been past the knocking stage.",
                                    "score": 8,
                                    "author": "CornerCornea"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Whoa… gave me chills! Did you ever open the door?",
            "score": 21,
            "author": "LatterTowel9403",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not yet. It’s 7:30 here right now and day 2 of our honeymoon.",
                    "score": 19,
                    "author": "CornerCornea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You are ridiculous. How did you not think to visit her birthplace and family before getting married? Do it asap, they will know how to get in touch with her, and take your new wife with as well.",
            "score": 40,
            "author": "Defiant_Fiend",
            "replies": [
                {
                    "level": 1,
                    "comment": "I thought the wood plaque would be okay!\n\nEdit: I was wrong",
                    "score": 27,
                    "author": "CornerCornea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I ThOuGhT the woOD pLaQuE wOuLD bE OkAY!! Just like you thought picking up a shiny money bag was okay and not marrying her straight away till she drive you mad was okay? \n\nChop chop op, it's nearly 3.13 and I'm angry. I thought we had something going on. I'm waiting.",
                            "score": 35,
                            "author": "Defiant_Fiend",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I never claimed to be clever. And damn. You're right...it's almost 3:13....",
                                    "score": 19,
                                    "author": "CornerCornea"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ok. So leave all purses on the ground. Got it.",
            "score": 12,
            "author": "Kittiemeow8",
            "replies": [
                {
                    "level": 1,
                    "comment": "But the purses choose you...",
                    "score": 4,
                    "author": "CornerCornea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Did they stutter?!",
                            "score": 2,
                            "author": "The_Soviette_Tank",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I guess not...but money.",
                                    "score": 1,
                                    "author": "CornerCornea"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You have to introduce Larissa to her. And explain that you will always love her, as you were hers first she will always be your first. She’s upset to be left behind. Explain that if you have a child, a girl specifically, she will be named after First Wife to honor all she has blessed you with, and to keep her name alive now that her family has passed away. Ghosts are afraid to be forgotten. Let her know you will not. That now, Larissa will help in remembering her, so she will have 2 people who remember her, and then your family, as it grows, will also honor her memory. She will be appeased. Build her a shrine. Leave her trinkets. Keep speaking to her on a monthly basis. You accepted the blessings—you do NOT WANT TO SEE THE CURSE. Dm me for help.",
            "score": 32,
            "author": "Its_panda_paradox",
            "replies": [
                {
                    "level": 1,
                    "comment": "I kept her in the basement. \\*bad face\\*\n\nOh god, so she's basically put up with my neglect for so long...but name my first child after her? How would that child feel? What if my first wife doesn't like that? But what if she helps my kid....hmm.",
                    "score": 12,
                    "author": "CornerCornea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Your child will feel like it’s her name. She was named for your benefactor, who assisted you with all the blessings you got that allowed you to meet Larissa and create your child. Tell your 1st wife that L will help remember her. And that the baby will also know her. That is what she wants. And she will also bless the baby. She would be like a guardian Angel got your child. If not, she’s going to 100% hurt you, or L, or not allow you to have a baby.",
                            "score": 16,
                            "author": "Its_panda_paradox",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not allow us to have a baby? Noooooo. Don't say that! My first wife has always been good to me. I'm sure...she'll understand. Right?",
                                    "score": 6,
                                    "author": "CornerCornea",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you do what I advised you, yes. Thai black magic (or any eastern black magic TBH) is serious shit. Do not play with your life. It could be as simple as her nudging the surgeon doing your wife’s delivery, and you’ll lose both. Do. Not. Play. Around.",
                                            "score": 10,
                                            "author": "Its_panda_paradox",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "\"Body snatchers, and your girl is getting sleepy\" vibes",
                                                    "score": 3,
                                                    "author": "CornerCornea"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "(whispers) whatever you do, DO NOT DM Paradox for help. You already got enough trouble!!",
                            "score": 4,
                            "author": "FickleSpend2133",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Note to self: don't dm paradox or else more troubles - ficklespend2133",
                                    "score": 3,
                                    "author": "CornerCornea",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "(whispers) yeah. They a little suspect giving u pretty specific instructions and then instructions for shrines…..and want u to dm them?!   Im jus sayin",
                                            "score": 3,
                                            "author": "FickleSpend2133",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Have you ever heard of a blue procession? It's someone who goes around and collects ghost dowries, ghost brides, and night weddings. And so everywhere they go, there's a trail of ghosts following them. Maybe this paradox person is like that and has knowledge? Maybe I should consult them...",
                                                    "score": 2,
                                                    "author": "CornerCornea",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Ok I researched quite a bit and see nothing on a blue procession.  Blue haunted procession, ghost blue procession etc.. Saw some crazy shy including ‘haunt blue’.  but no procession.  My original advice still stands.  Do not DM paradox. Do not consult a palm reader or tarot card reader. \nIn fact, it’s probably time to bless your house.  “May nothing that is not Godly or of God come in or around my home. May nothing that wishes me harm enter or follow me home“   Sprinkle holy water.",
                                                            "score": 3,
                                                            "author": "FickleSpend2133",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You know I always see those basins at church but I never wondered if I could just walk right up to it, take a mason jar and fill it up. Would someone stop me?\n\nI might be translating it wrong. I heard it on the island and just directly translated each word. It might be more impactful in its native form.",
                                                                    "score": 3,
                                                                    "author": "CornerCornea",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Lol. I’ve never seen a mason jar used.  But I do know priests often have these tiny jars of holy water they bless people with. Nobody will stop you. \nOn a true note, I’ve blessed every home I’ve ever lived in.",
                                                                            "score": 3,
                                                                            "author": "FickleSpend2133",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I heard doors open both ways though? And does it need to be done regularly?",
                                                                                    "score": 2,
                                                                                    "author": "CornerCornea",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m sorry, but YTA here… Why did you wait until 3 weeks before the wedding to bring this up?? Not saying it’s a first date conversation, but you could have let your fiancée into the loop just a *tad*! If you were insistent on not telling her, you could have gone back discreetly to ask your wife’s permission at any time during your engagement- why put it off until the last minute?? \n\nProcrastinating isn’t a sin in most situations, but this is clearly not a normal situation. You’d better hope your new wife is forgiving toward someone who’d put her in danger of being cursed… &amp; you’d better hope your ghost wife is even more forgiving when you go straight there to apologize to her! \n\nWhich you’re going to do immediately, right??",
            "score": 24,
            "author": "astral_distress",
            "replies": [
                {
                    "level": 1,
                    "comment": "To be fair she's the one who told me not to go! I wanted to go, thought it was a good idea...but then I guess I didn't do much to convince her that it was real. But maybe a part of me thought that it wasn't? I mean, it was after such a long time...and I really thought talking to her wooden plaque was sufficient.\n\nI'm going to need to beg for forgiveness aren't I? I'm no good at begging...",
                    "score": 5,
                    "author": "CornerCornea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The good news is, it seems like your Ghost Bride is kind and patient if all she's done is knock on your door and appear as pale lights. Spirits, when angry, can do so much worse...\n\nThe bad news is... when patient people run out of patience, the results are usually explosive. Ignorance isn't a crime, but at this point you really should have educated yourself on these traditions and speak to experts to understand what you need to do next to appease her spirit. Show her the same kindness she has shown you and give her respect and care while properly asking her and her family if they will accept your marriage with Larissa. While I'm no expert, I'm sure that as long as you give a sincere and earnest effort to learn their traditions and honor her and her family, the spirit will reciprocate your gestures with her acceptance. \n\nA Marriage is a promise, NOT a prison for one or the other, and both partners must be willing to meet the other half-way in all things if they've taken their vows. That is how both show that their love is true.",
                            "score": 5,
                            "author": "ZepyrusG97",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You sound like an expert, on making a marriage work at least. But I think you're right. It would translate well to my current problems. I'll have to try harder in the future. Larissa and I are currently heading back to the island, though we've stopped nearby because I've received word from someone whose had experience in night weddings. He says he's some sort of magician.",
                                    "score": 1,
                                    "author": "CornerCornea"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "what if i, a woman, picked up the bag? do they believe in homosexuality?",
            "score": 8,
            "author": "theres_a_cab_outside",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a bi I think this question is good. Honestly if I saw a bag like that in a foreign country (or any) I would assume it's a trap or just bad news. I thought maybe I could carry it on a branch to the police station... not touching it.\n\nBetter not to risk it. Although this wife seems very low maintenance and gentle and OP straight up dissed her. Concubines are allowed, not wife u move on with, OP! Read the fine print!\n\nPlease update.",
                    "score": 11,
                    "author": "FrogMintTea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "From my time there, the trap/scam bags are very common. The fake ghost dowries are used to lure tourists in, get them into a wedding and then force them to pay money or rob them. I've been contacted by a traveling magician lately whose been very interested in what happened to me, who has described in detail some of these events as he's searching for a real ghost dowry.\n\nAnd yeah, I didn't understand that at all. I'm Catholic and we aren't allowed to have concubines so I thought it was more of like a divorce thing?",
                            "score": 5,
                            "author": "CornerCornea",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nah nah, concubines from my understanding are the other women in addition to ur main wife. Ur main wife being the ghost lady lol. Obviously I don't know what they meant in that culture. It might be a language barrier thing? Maybe u need to research what concubines meant in that country.",
                                    "score": 4,
                                    "author": "FrogMintTea",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My main lady, I've insulted her haven't I? I should right my wrongs, but I'm also afraid that what I've done is unforgivable and that going back to her country would spell grave danger. But a bit of me also wonders...what if it's because she doesn't approve of Larissa?",
                                            "score": 5,
                                            "author": "CornerCornea",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Honestly you waited so long. The real wrong is not telling her when you asked her to marry you.",
                                                    "score": 4,
                                                    "author": "FickleSpend2133",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You're right, I absolutely should have asked my first wife before I proposed. God how could I be so stupid.",
                                                            "score": 5,
                                                            "author": "CornerCornea",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I don’t know…. I actually find your naïveté a little sexy. You know, the kind of sexy that makes you intriguing but the kind of naïveté that would probably make me want to hurt you in frustration.\nPS I’m pretty sure the Catholic religion doesn’t allow you to have this type of arrangement.  You know, the whole annulment and consummation of marriage thing and all.",
                                                                    "score": 5,
                                                                    "author": "FickleSpend2133",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "If they got Henry the 8th, I'm pretty sure they wouldn't be lenient towards me. And thank you I appreciate it. But I'm a...marriedx2 man.",
                                                                            "score": 3,
                                                                            "author": "CornerCornea",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Note I said I find you intriguing. But at the end of the day it’s foolish to mess with a man who is already dangling two women, one of whom is never seen in the daytime. I like a lil danger in my life but Daddy didn’t raise no fool.",
                                                                                    "score": 3,
                                                                                    "author": "FickleSpend2133",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Maybe Larissa is in danger if she doesn't approve of her.",
                                                    "score": 2,
                                                    "author": "FrogMintTea",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I never did find out what comes after the knocking stage...",
                                                            "score": 2,
                                                            "author": "CornerCornea",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "😵‍💫",
                                                                    "score": 2,
                                                                    "author": "FrogMintTea"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Don’t worry. You get a ghost dowry too!!",
                    "score": 3,
                    "author": "FickleSpend2133"
                },
                {
                    "level": 1,
                    "comment": "According to the kid, the purses chooses you. So I imagine if there's are ghost dowries for lgbtqia+",
                    "score": 1,
                    "author": "CornerCornea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You're killin me OP! You made a deal that as long as you honored her, you could still get married and just ask for her permission. Instead of asking you straight up told her you're moving on with your life. Why wouldn't you just do your monthly visits and say a quick prayer? Is it so much to ask?",
            "score": 8,
            "author": "LeXRTG",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm catholic and we don't practice polygamy so I thought that a divorce would be the right route? I seem to be wrong.",
                    "score": 0,
                    "author": "CornerCornea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How do you divorce a dead wife?  Her Attny could turn out to be some ethnic demon, which makes matters worse!  You screwed up!",
                            "score": 4,
                            "author": "Shadowwolfmoon13",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Catholic serving time in other religious prison. Sounds like a bad time.",
                                    "score": 1,
                                    "author": "CornerCornea"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Perhaps the problem was you stopping visiting her moreso than getting married? I would take her nameplate out, apologise deeply. Maybe google how to do this - offerings of food or flowers or something (not familiar). Then I would not miss another monthly visit. If your new wife is bothered by this, you can reframe it as a meditation exercise where you reflect on your good fortune.\n\nGood luck- to the three of you!",
            "score": 4,
            "author": "Machka_Ilijeva",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think that's a good idea but oh boy now that I told the truth. I don't think Larissa is going to like this...as I don't want to lie to her.\n\nI am not looking forward to this conversation. With either of them.",
                    "score": 1,
                    "author": "CornerCornea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You should have just kept speaking to her. It was just once a month!! It seemed like she didnt need any offerings - pretty low maintenance if i do say so! Yet youve blatantly failed the one task you had to do! Do you know your actions were equivalent to ‘banishing her to the cold palace’ in ancient times especially since she’s the FIRST wife? \n\nYou had better hope she forgives you. Like the saying goes, hell hath no fury like a woman scorned. If she didnt accept of the marriage dont you think she would have already smited your newly wedded wife before you can even marry her?",
            "score": 5,
            "author": "Drowsywater",
            "replies": [
                {
                    "level": 1,
                    "comment": "I realize that now, I've been a neglectful husband, and need to do better. But since you said we haven't been smited yet, does that mean she'll forgive me if I apologize? Maybe I really do need an offering this time for my wrongdoings....",
                    "score": 4,
                    "author": "CornerCornea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm never going to pick up money on the floor again",
            "score": 3,
            "author": "DavidNorthWrites"
        },
        {
            "level": 0,
            "comment": "Will you update this later on? Once you’ve visited her birthplace and family?",
            "score": 3,
            "author": "MissRoselia",
            "replies": [
                {
                    "level": 1,
                    "comment": "Her parents have already passed away, but I do feel as if I need to revisit her birthplace again to ask for forgiveness. I'm not sure how to do that just yet. But someone has reached out to me about night weddings. And he's currently in the works of providing me with answers. Already he's told me, that I messed up because I didn't use some kind of moon blocks. I was like what are moon blocks and then I realized my in-laws gave me some of these red shaped things awhile ago. I've been using them as paper weights.",
                    "score": 4,
                    "author": "CornerCornea",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "First. Get rid of the moon blocks!  It’s crazy how easily you just grab stuff and keep it. \nSecondly stop talking to this dude.  He’s dangerous.\nThird, absolutely under no circumstances on any day for any reason whatsoever ARE YOU TO RETURN TO THAT PLACE. 👀",
                            "score": 5,
                            "author": "FickleSpend2133",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But what if he has the right answers? From what I understand he's currently there and will dm me again later. But it's been awhile since I heard from him. I hope he's alright.",
                                    "score": 2,
                                    "author": "CornerCornea",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What if he’s dead?!  And only contacted you in an effort to use you as bait so he can escape from the trap that he’s in?  And every time he DM’s you,it makes a portal open a little bit more?",
                                            "score": 3,
                                            "author": "FickleSpend2133",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No, please. I need an anchor!",
                                                    "score": 2,
                                                    "author": "CornerCornea",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You don’t have an anchor. I’m sorry.",
                                                            "score": 3,
                                                            "author": "FickleSpend2133",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I'm going to go out on a limb here and say you're not actually that sorry.",
                                                                    "score": 2,
                                                                    "author": "CornerCornea",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Does it count if you know that I’m truly trying to dredge up some serious feelings of sympathy and respect?",
                                                                            "score": 4,
                                                                            "author": "FickleSpend2133",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Idk if you step on my foot and feed me a cookie it depends on how hungry I am?",
                                                                                    "score": 2,
                                                                                    "author": "CornerCornea",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I guess first wife isn't really happy with you...",
            "score": 3,
            "author": "KeeperofAmmut7",
            "replies": [
                {
                    "level": 1,
                    "comment": "At this point in time, neither wife is happy.",
                    "score": 2,
                    "author": "CornerCornea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shouldn’t it be a red wedding dress? White is the color of sorrow and red is the color of joy in China.",
            "score": 2,
            "author": "SingingLobsters",
            "replies": [
                {
                    "level": 1,
                    "comment": "I believe that is right, but this was on a remote island in south east Asia",
                    "score": 1,
                    "author": "CornerCornea"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How did you go from a “tiny 625 sq/ft apartment” to a house with a basement??",
            "score": 2,
            "author": "kaceFile"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "WHERE. ARE. THOSE. BABY’S. CARSEATS!?",
            "score": 1,
            "author": "You_are_MrDebby"
        }
    ]
}