{
    "id": "140b54j",
    "score": 164,
    "title": "Have you ever heard of The Triangle Game?",
    "author": "Colt_Leasure",
    "date": 1685880570.0,
    "url": "https://www.reddit.com/r/nosleep/comments/140b54j",
    "media_urls": [],
    "other_urls": [],
    "postText": "1\n\nWe underestimate the trials the dead have gone through. \n\nThis obvious mistake leads to avoidable missteps in life. It is still all too common. \n\nWhen my Grandfather passed away, I inherited a house in the mountains. The view was breathtaking. It had a sweeping vista of infinite pine trees. The place was nowhere near as large as the properties surrounding it. \n\nIt was a summer home for him and my Grandma. The interior of it contained many of his items. This included tobacco pipes, cabinets of obscure teas, and cupboards of whiskey bottles.\n\nOne Saturday evening I went through the attic and found a dozen stacks of boxes. The majority of them remained unlabeled. Several contained pulp paperbacks and stacks of old photos. Towards the end of his life, he gave up his old pastimes of hunting and fishing.  He stayed at home and watched old game shows instead.\n\nI tried to clean the roof space in one day.  I found myself unable to complete it before tiring and going to bed. \n\nThe next morning I resumed the activity. It was no longer about trying to declutter the area and fill it with my own possessions. It was now a way to learn more about the man. \n\nAll I knew about his reputation was how he had served in World War II. My family told me how he was as short on words as he was on patience. \n\nI found an old newspaper article, dated 1983. There were other period pieces around it. The topics varied. This included the US invasion of Grenada and the debut of Cabbage Patch Kids dolls.  A device known as the mobile phone received a mention.\n\nYet what caught my attention was the first piece. I brushed aside cobwebs to find it buried underneath a pile of cardboard with burnt edges.\n\nThe picture was of my Grandfather, Roy Davies. He held a check for fifty thousand dollars.  This was an amount I later found out equaled to one hundred and fifty two thousand in today’s money. The mystery of how he could afford the place he gave me was no longer one worth pondering.\n\nThe wall behind him had an illustration of a ramshackle house on a hill. The title of the write-up was NORTHERN CALIFORNIA MAN WINS IN THE PILOT FOR NEW SHOW ‘THE TRIANGLE GAME.’\n\nI read the five hundred word account. It detailed how he flew to Los Angeles to be a participant in an allegedly syndicated program. There were two other people he competed against. The editorial feature did not go into detail about what the goal of the game was. How to win or get disqualified was unknown to me. Still Still, my Grandfather walked out a much richer man before he flew back home.\n\nIt did mention the couple he played against, a man called James Grover and a woman named Daisy Francis.\n\nI flipped the article. I found were words written in orange ink with a marker on the back, CC ENVELOPE EXIT.\n\nI searched online for the triangle game. I found variations on the pastime ‘I Spy’ first. Players would spot triangular items in their immediate vicinity. I discovered a few board games, along with IQ-related quizzes. \n\nNo information was available about a television broadcast.\n\n2\n\nIt took almost a month of research to find where James Grover lived. \n\nI managed to find his house by paying for a background checking website. He had gotten a criminal charge for running a red light in front of a cop. Otherwise his record was clean. That single infraction allowed me to find him since it put him in that specific database.\n\nI stood outside his red brick house in a suburb.  It was a Wednesday afternoon in a neighborhood located in an upscale part of Illinois. \n\nFrost caked the lawns near the heated sidewalk I stood on. I imagined the place to be serene in the summertime, even if it was a vacant-seeming region now. \n\nA stretch of abodes stood before me without their lights on. Nervousness coursed through me. The idea of having traveled all this way for the information to be wrong made me anxious.\n\nI walked along the concrete pathway towards his front door. I stepped on a creaky porch.  I set aside my awareness of the likely pending disappointment and knocked.\n\nA shuffling of feet was on the other side of the entrance. as well as A remote control clicked as the volume of a television blaring a news report got turned down.\n\nHe answered. The man fit the correct age range I calculated he would fall into. He wore a flannel jacket and slacks, He had on a blue pair of slippers. His gray mustache bristled as he saw me.\n\n“James Grover?” I asked. \n\n“If you’re trying to sell me something I’m not interested.”\n\n“I’m very sorry to bother you sir, and I promise I won’t take up much of your time. I’m here to ask if you would be willing to let me ask you a few questions about something you might know about. See, I make documentaries for a living, and I have concluded that you might be able to help me.”\n\nI could not take a good photograph when asked, but it was a stringent falsehood I conveyed well in the moment. \n\nIn reality, I was a podcaster. The term documentarian, though not as modern, seemed more legitimate. Especially to an older gentleman.\n\n“Alright,” he said after a moment’s hesitation. “What are you making a movie on? Also, where’s your film crew?”\n\n“I gleaned that you were the type to prefer remaining anonymous.  The conversation‘s recorded. This will be with your consent, of course. The subject I want to discuss with you involves the triangle game.”\n\nGrover took a few steps away from the threshold and broke eye contact with me as his lips pursed. His eyes wandered over to the corner of his living room, and he brought his gaze back to mine.\n\n“Why do you want to know about that?” \n\n“Because I can’t find anything about it anywhere,” I said. “I’ve even been to the National Archives of Game Show history in search of it. It’s as though it never existed. I know it did because I found this article.”\n\nAs I brandished the piece of writing to him, his eyes bulged as he focused and scanned the text. \n\n“Ahh,” he said as he took in a deep inhalation, “I remember that man. Tell you what, come on in. Would you like some coffee?”\n\nI took a seat in one of his recliners as I asked him a few generic questions about his life. \n\nJames spent a considerable time of his youth in North Lawndale, one of the rougher places in Chicago. He escaped his impoverished upbringing by pursuing a career as an inventory clerk. He worked his way up to management in a warehousing company.\n\n“I beat the odds in a big way,” he said as he folded his hands and sat across from me. \n\n“So, what can you tell me about your experience on set that day? Do you know about anything that happened post-production?”\n\n“They made us sign contracts where we would promise not to talk about what we went through with anyone. Still, I’m at the point where I’m not very worried, or I don’t think I should be. I was much younger then, about your age. I lived at the boxing gym and had dreams of going pro. Of course that didn’t happen, but when I wasn’t training I was drinking and doing stupid things that young men do. Bar brawls I didn’t deserve to get away with but somehow did. My mother watched a lot of game shows. Without my knowledge, she submitted my name for consideration to become a contestant. She thought it would make me a better person if I had some kind of hope for helping the family.  One besides crushing peoples noses for a living.”\n\n“How did she hear about it?”\n\n“I have no idea. I wish I asked her.”\n\n“How did you find out you were going to go on?”\n\n“Back then, everything was a phone call, so that’s what we got. They flew me out there, I took a taxi to get to the set. It was not a traditional studio. The place was closer to a factory with a fake space ship built inside of it. In the center of the room was a neon triangle with the same spaciousness of a house.”\n\n“How was the game played?”\n\n“Before it started, they told us to write down three things we were good at. I put boxing, organizational skills, and running. Daisy listed hers as poker, math, and long distance swimming. Roy - that was his name, the person in the picture you showed me - put outdoor survival, shooting, and cooking. We would stand at each point of the triangle. We’d get asked a question by the host, and we had three minutes to answer it. If we got it right, they gave us a reward being able to attack one of the other two people using the skill sets we put down. The goal is to make the other two quit by getting enough questions correct. Of course, we went into the game blind to the rule set. Otherwise I may have chosen the most aggressive ability imaginable. Roy won because he chose aptitude with a firearm, which trumps any martial art, whether I like it or not.”\n\nJames lifted his pant leg and showed me a scar above his knee.\n\n“At least he was kind enough to not make it a fatal blow,” he said.\n\nI showed him the words written on the back of the newspaper clipping.  He shrugged and told me he was unaware, dismissive of it as someone’s scrapped note.\n\nI asked him if he remembered the name of the host or could give me a physical description. \n\n“I don’t remember anything about what we called him, if he even told us what he went by. His hair was black and a pompadour style. He wore a purple suit with a bright orange tie.”\n\n“Two last questions,” I said. “Do you know what happened to Daisy, if she’s still alive? Also, do you recall the address of the place where they filmed the game?”\n\n“I wrote to Daisy twice a year before she vanished. We did have one conversation over the phone, and she told me that bad luck was going to follow the losers of that pilot. There was no media coverage about her passing that I ever saw. As far as the location, sure. I wrote it down in a journal I kept with me even when I traveled. I used to keep track of my workouts and diet regiment back then. Let me grab it.”\n\n3\n\nThe location where the Triangle Game took place four decades earlier stood in a squalid part of the city. \n\nI passed the ruins of the old LA zoo on my way to the spot. I contemplated how the sight I was about to take in could not get any stranger. I was wrong.\n\nThe building was five stories, but the front only had a trio of stained glass windows. Bullet holes surrounded the casements. The place had a nave roof and flying buttresses on both sides. Multi-colored graffiti littered the outside.\n\nIt sat in a neighborhood filled with homeless people who slept on benches. \n\nI went there mid-afternoon. I approached the front and found two locked doors. I scaled around back. I stepped over heaps of trash in the process, and saw an opening in the form of a hole large enough to crawl into.\n\nA surge of adrenaline hit me me as I belly crawled through. I was taking a bet on how there were no cameras, guards or residents who would make a scene out of my trespassing. \n\nIt is amazing the rules one will bend for the sake of new content on social media, I opined as I made way into the space. \n\nI turned on the flashlight of my phone and saw nothing but an enormous dusty chamber made of concrete. \n\nI moved into the next room. A hoarders lifetime supply of broken antiques sat. Spray painted devil-horned faces grinned from the ceiling. \n\nWhat caught my attention the most was a camera’s tripod.  It stood alone in the far left corner.\n\nI approached it to get a better look. I kicked aside a bunch of cans. As they clattered away, I looked down and saw a pointed tip of something drawn on the ground. \n\nI removed most of the trash by shoving the majority of it aside and saw what was underneath.\n\nThe large triangle, which took up most of the flooring in the chamber, was still there after all these years.\n\nIn the center of it was a thin line of blood. I crouched down and peered at it.\n\nThe fluid was still wet, and a horrid stench met me. I gagged and recoiled, and in my backing away, my shoulder bumped against a dusty and discarded shelf.\n\nGunfire rang out. \n\nI did not know if it was outside or near me, but I did not wish to find out. I exited the way I came in with a relentless sprint and drove as far away as I could.\n\n4\n\nA year later, I was finally wrapping up my recording of the podcast. I titled it ‘Three Ways to Die.’ \n\nWhile the name of the series was quite sensational, I felt the story merited a bit of clickbait. I had no followers and was unsure of how it would perform. \n\nI reasoned that giving the story any publicity I could would help me find the lost piece of media.  Even if it was on the cutting room floor of that very space I had to leave. \n\nI went to call Grover, to try and collect an email address so I could send him the pre-uploaded production.\n\nA woman answered.\n\n“You’re looking for my father. He lost his life six months ago. Someone killed him. I would appreciate it if you got rid of this number.”  \n\nShe ended the call less than a second after the last word. She wrote me off as an insurance agent looking to take advantage of a grieving family member.\n\nI paced around my room. Although I did not know him well, I had come to like him, and his gruesome end was not one he deserved. I researched crime news to find out what had happened to him, to no avail.\n\nThe newspaper piece I had collected that fateful day sat at the edge of my desk. \n\nI lifted it towards me and flipped it over again. I stared at the words — CC ENVELOPE EXIT. \n\nThe sentence was nonsensical. I had applied my own meanings to the gibberish phrase. Like it was a cryptic and silly way of saying ‘outgoing mail.’\n\nI do not know whether it was desperation, a creative inclination or an admixture of both. I decided to run it through an anagram generator I had searched for on the web.\n\nIt came up with many phrases, some of them surreal, but the one that popped out to me was EXPECT VIOLENCE.\n\nMy stomach turned as I realized how my own personal investigation yielded nothing. I opened the window and was soon exposed to some fresh Sierra air, which was therapeutic but not curative. \n\nI decided to take a long walk. I had been sedentary over the last week due to intensive editing. I figured a jaunt would help me smooth a few psychological knots things out.\n\nI slid my closet door open to try and find a pair of sweat pants. \n\nThe sound of thunder reverberated outside. I stared out to find the sky had become overcast.\n\nThe closet door creaked even louder than I could remember it having been before.\n\nOrange ties hung on the rack, and a triangle painted a pastel green was visible behind it.",
    "comments": [
        {
            "level": 0,
            "comment": "So it sounds like your grandpa was actually the host? Or maybe after he won he went on to host more episodes that never aired?",
            "score": 10,
            "author": "LeXRTG",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m thinking the latter",
                    "score": 2,
                    "author": "Important_Culture_37"
                }
            ]
        },
        {
            "level": 0,
            "comment": "cult im feeling secret money making group thing kinda cultlike",
            "score": 1,
            "author": "amstrugglingmentaly"
        }
    ]
}