{
    "id": "142g5t2",
    "score": 44,
    "title": "I think I've got a stalker... And he sends me sticky notes.",
    "author": "Justhegirlnextdoor",
    "date": 1686058170.0,
    "url": "https://www.reddit.com/r/nosleep/comments/142g5t2",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/nosleep/comments/143h6zb/i\\_think\\_ive\\_got\\_a\\_stalker\\_and\\_he\\_sends\\_me\\_sticky/?utm\\_source=share&amp;utm\\_medium=web2x&amp;context=3"
    ],
    "postText": "**PART 1:**\n\nI'm not really sure where to begin, but I do know that I need some advice....\n\nSo, it all started with a sticky note. First it was one... Then two... and now I've got a whole drawer full of them. Maybe I should give you a little background information. I moved into my first apartment about a month ago. It wasn't anything special, but it was mine. I noticed the first sticky note when I was stocking up my refrigerator with the copious amounts of Chinese takeout I'd ordered for the night. I was tired after all the unpacking and decided to just order a little bit of everything. I don't know how long the sticky note had been on my fridge before I noticed it, but midway through putting my egg rolls in there, I noticed a plain yellow note with one simple word scrawled across it in thick black ink.\n\n***\"Welcome.\"***\n\nI glanced at it and didn't pay it very much mind. It was midnight at this point and the only thing I really wanted to think about was getting into bed. Honestly, I figured it was either a note from the previous tenant or the landlord. Crumpling it within the palm of my hand, I discarded it and headed off to bed. The next morning when I stumbled into the kitchen though… There was another one.\n\n***“Hi there.”***\n\nA look of complete and utter confusion was plastered across my face. Frantically, I ripped it into shreds and shoved it into the trash. I know I hadn’t heard anyone come into my apartment any time during the night. I’m usually a very light sleeper. There’s no way anyone could have snuck in without me noticing. Then again, I was exhausted that night... So maybe? The next night I laid in bed and stared at the ceiling for hours waiting to hear the sound of the front door creaking open. I never heard a single thing, and before I knew it, I’d dozed off. The next morning, I crept into the kitchen expecting to see another note. The second I rounded the corner though, a nervous giggle bubbled from my lips and I sighed a breath of relief when there was no sticky note on my fridge. I thought I was just scaring myself. It must have been there with the one from the night before and I just hadn't noticed it? Making a beeline to the bathroom, I hurriedly began to get myself ready for the day. Since I’d stayed up so late, I slept in a little later than usual. Squeezing some toothpaste onto my toothbrush I lifted it to my mouth and immediately dropped it into the sink when I noticed something stuck to my mirror.\n\n***“You look beautiful today.”***\n\nChills raced over my arms and it took all I had not to work myself into a full blown panic attack. My heart was pounding and my breathing was shaky. My hands gripped the side of the sink as I stared up at the sticky note and then quickly scanned the bathroom. I called in sick to work that morning and tore apart my entire apartment looking for some type of explanation. Some part of me thought I might find some sticky note pads or pens stashed away somewhere, but I didn’t find any of that.\n\nI’m not sure what I should do if they continue, but I do know I can’t afford to move out right now. Any advice on what I should do is welcome. If I receive another one, I will keep all of you posted. It has been a week since that incident and I haven't received any more. Up until then they appeared in my apartment like clockwork though, so I'm sure there will be an update.\n\n&amp;#x200B;\n\nThose of you who are looking for an update.... PART 2: https://www.reddit.com/r/nosleep/comments/143h6zb/i\\_think\\_ive\\_got\\_a\\_stalker\\_and\\_he\\_sends\\_me\\_sticky/?utm\\_source=share&amp;utm\\_medium=web2x&amp;context=3",
    "comments": [
        {
            "level": 0,
            "comment": "Get a carbon monoxide alarm.",
            "score": 11,
            "author": "anubis_cheerleader",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 5,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Luckily my apartment has one, so carbon monoxide poisoning can be ruled out!",
                    "score": 2,
                    "author": "Justhegirlnextdoor"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Get the locks changed.  Put chairs in front of the doors when you sleep.  Get a dog.  Is this for real that there's someone actually in your apartment and you keep letting it go?",
            "score": 4,
            "author": "Quiet-Log-3146",
            "replies": [
                {
                    "level": 1,
                    "comment": "I spoke with the landlord and had the locks changed pretty early on into the whole sticky note fiasco. Despite my best efforts, they still found their way into my apartment. I haven't spoken to any of the other tenants, but that will be the next thing I do. As for a dog, I don't have any spare change to pay for a pet deposit. Luckily, I haven't received another one. Perhaps they're just biding their time and playing the long game?? Something tells me it won't be long until I receive another one though... Maybe I should play them at their own game and leave them a sticky note on the fridge?",
                    "score": 3,
                    "author": "Justhegirlnextdoor"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Check the cabinets and the vents. People have been known to sneak in through them",
            "score": 5,
            "author": "gregklumb",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel like I'm going absolutely insane! I've torn apart my apartment trying to figure out how these notes have been getting in. Maybe I just haven't looked in the right places?",
                    "score": 2,
                    "author": "Justhegirlnextdoor"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tell the landlord and look for hidden cameras",
            "score": 3,
            "author": "kimimo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hidden cameras... Good Idea. Maybe I'm just missing something?",
                    "score": 3,
                    "author": "Justhegirlnextdoor"
                }
            ]
        },
        {
            "level": 0,
            "comment": "this is creepy. stay safe and update us!",
            "score": 3,
            "author": "charlie_ily"
        }
    ]
}