{
    "id": "143ryze",
    "score": 81,
    "title": "Memories",
    "author": "KukaVex",
    "date": 1686178917.0,
    "url": "https://www.reddit.com/r/nosleep/comments/143ryze",
    "media_urls": [],
    "other_urls": [],
    "postText": "It hadn't been a sprint, but more a slow crawl to death. We'd said our good-byes to the man who could hear our voices and see our faces and show at least a semblance of recognition.\n\nBy the end, it was only me who visited. No-one else could stomach seeing this shadow of what was once a great man. A church leader, a man who dedicated his life to charity. But now? He was sunken, drowning in a body that was rotting around him. I held his hand, his skin brittle and paperish. Like I could tear the outside away and find a new man within. Find my dad again.\n\nHis eyes met mine, and for just a moment they flashed their brilliant blue. Like he saw me, for the first time in months.\n\n'Kathleen... Forgive me.' \n\nAnd he was gone. The relentless drone of the heart monitor was barely audible over the roaring in my ears, as gentle and pitying hands seemed to push and guide me through the days that followed. Hours felt like days, minutes felt like months. Nothing seemed real, tangible to me any more.\n\nAfter it all, once the funeral was done, I sat in my father's chair. Surrounded by his smell, his possessions. I thought of his last words. It was a name I didn't recognise; I'd asked around but no-one else seemed to know either. I looked down at the tube in my hands, the substance within dancing, glittering. It was heavy and yet far too light. Whilst commonplace for the children to be given the option of keeping their parent's memory, it was rare for the offer to be accepted.\n\nI had never known my mother. The only times my father had gotten truly angry at me was when I asked about her. So I had done the taboo, the unimaginable. I just had to know.\n\nI plugged the tube in to my laptop, the glittering substance turning waxy and then static as 89 years of life uploaded and wired itself through to my screen. It was easy - click the app. Ctrl+F. Kathleen.\n\nI see a baby, one I don't recognise. I moved forwards, confused. I saw the girl grow up through my father's eyes as she learns to walk, talk. She learns to ride a bike. I watch her graduate, my dad cheering. Wiping tears. I watched her live a whole life.\n\nBut I'm an only child.\n\nI run shaking hands through sweaty hair. I look away as they embrace, my eyes following the dust motes hanging in the stagnant air. I skip forwards. He approaches a door, dark stairs. Enters a key code. And there she is. Kathleen. Older, just older than me. In a small room with a kitchenette and a bed, a toilet in the corner.\n\nI throw the laptop, the tube smashes.The secrets of a dead man explode. It feels like my whole body is quaking, as I watch the black tar that was once my father run down the white wall. I look down the hallway to the basement door. Identical to the one in the video. Before I know it, I'm racing down the stairs.\n\nI'm throwing boxes, pulling over shelves. Paint cans are knocked, boxes of paper and photos fall and spill to the floor. Behind one of the shelves, a keypad. A door. The stench of decay overpowers the spilled paint and the must of memories now ruined. I see the scratch marks on the reverse of the door, rusted brown. Piles of clothing with odd angles. I gag, bent at the waist. I see children's pictures posted across the walls, and I vomit.\n\nIf only he'd died quicker, I think not for the first time, but for a new reason. Why didn't the sick bastard die quicker.",
    "comments": [
        {
            "level": 0,
            "comment": "Whops, ... Sins of Thy Father",
            "score": 2,
            "author": "falxarius"
        }
    ]
}