{
    "id": "145u469",
    "score": 44,
    "title": "I think I discovered a worldwide secret.",
    "author": "Silly_Wrongdoer3709",
    "date": 1686383780.0,
    "url": "https://www.reddit.com/r/nosleep/comments/145u469",
    "media_urls": [],
    "other_urls": [],
    "postText": "You may or may not have heard of the Osiris Shaft. If you haven’t, it’s a place beneath the Egyptian pyramid where the public can visit. However, what less people know is what’s beyond the walls of the shaft. \n\nI was with a tour group in the Osiris shaft. It was amazing. A once in a life time experience for most people, but for me, my experience was probably once in a blue moon. Maybe the first experience for anyone. \n\nI broke off from the tour group to take some pictures. I wasn’t sure if it was allowed or not, but I didn’t want to leave empty handed. The wall that supposedly shielded off more to the public. I headed down that wall, snapping pictures along my way. I came across a section of wall which was different to the rest. It was a different shade of yellow. I looked around and noticed a tiny gap in the bottom corner of the discoloured wall. I looked back at the tour group, then into the gap. I carefully placed my camera through the gap and squeezed through after it. \n\nI stood up. It was pitch black. I couldn’t even tell what was ahead. I slowly went forward down what I assumed was a tunnel. I reached a small shaft, surrounded by wooden beams. I could see dim light. I climbed down the ladder, shaking at what I might find. When I reached the bottom, I turned around. I tried filming with my camera, but after about one minute, my SD card ran out, and I didn’t have the spare on me. There were lamps along the wall, all connected to the same wire. What was this? I thought it must be something that maybe some geologists or historians set up for their work down here. I couldn’t be more wrong. I went on down the lit up tunnel, half hoping I’d come across a person. I reached the end of the corridor. I saw the most out of place door imaginable. It was iron, like the service doors you see on the tube. It was very rusty. I heaved it open and walked through it. \n\nThe other side was pitch black. Slowly and cautiously, I walked forward. Every step felt risky. One step. Two steps. Three Steps. Four steps. As I went for the fifth step, my foot met with something hard and I went over. As I was getting back up, I had the idea to use my camera flash as my torch. As I did, I directed it down to see what I’d tripped A rail. I looked directly at my feet. Another rail just in front of my feet. I was on a train line. “What the fuck” I said out loud. I went back into the door, thinking it was a modern subway. Then I realised, it could either be a modern subway or possibly a mineshaft railway with mine-carts at the ends. I decided to walk left. I walked slowly, keeping to the left side of the railway. \n\nAfter a while of walking, I suddenly came across something. This is what changed my entire life. A train. It wasn’t moving, it looked abandoned. It was silver and looked like the Chicago Subway trains. The door and small windows on the front were boarded up with wood. I walked up to the front of the train. I climbed onto the small front step, and with my forearm and elbow, I broke down the wooden board. It fell apart like polystyrene. I walked into the cab. The technology was so advanced. It had a massive GPS system to the right hand side. I couldn’t be sure if it was modern or not some sort of advanced technology from Egyptian times. I went over to the massive GPS system. It was a map that looked like it glowed. What I assume were stations marked on the GPS, were all in Hieroglyphics. What the hell had I discovered? I busted the next wooden board that led from the cab into the rest of the train. The carriages were so different on the inside. The decoration down the walls above and below the windows was amazing. There were pictures of Pharaohs on all the seats and they appeared every meter or two along the top wall. In my mind, I still couldn’t escape what I was seeing. This is history that was widely covered up, but why? I carried on down the train. The doors were even decorated too. I eventually found a missing door and jumped through that. \n\nI walked the way I was walking before, on the left of the train. Suddenly, I reached a station. It was so different to the kind of things we had. The layout was somewhat similar to Tube stations. Their was one railway, then a walk way between the other platform where there was the railway going the other way. The station seemed abandoned, for sure. But was it an old part of a still in use station? I went up a set of stairs, which were decorated with the same designs again. I reached the top, and it was walled of. They’d completely sealed it. However, it didn’t stop me hearing the faint voices on the other side. Where ever I was, a certain life form lived here. Humans? Possibly. Alien forms? Equally possible. \n\nI backed up down the stairs and jumped onto the same railway as the one before. I had to keep exploring. On my way to the next station, I came across another train, but passed by it. Suddenly, I came out of the confined tunnel. The tracks stopped dead as I did. I can never forget what I saw. There was an active transit system going in and out of this huge structure. It was insanely tall and wide. It had stairs leading up it, it had Egyptian patterns carved into it. It was taller than any pyramid. Suddenly, I was hit with the crippling feeling of being watched by lots of other… well… life forms. This definitely wasn’t human. The feeling grew, so I turned and legged it back down the tunnel. I could hear something behind me. I passed the second train, then the station. Eventually, I reached the first train. Not far to go. I reached the open metal door and ran in. As I was closing it, I saw white glowing eyes running at me at an inhuman speed. I slammed the door shut before it could get in and sprinted back into the Osiris Shaft. For me, I’m never trusting anyone again.",
    "comments": [
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}