{
    "id": "1465au5",
    "score": 51,
    "title": "I was Forced to Live a Nightmare",
    "author": "SkittishReflections",
    "date": 1686416429.0,
    "url": "https://www.reddit.com/r/nosleep/comments/1465au5",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/Skittishreflections)"
    ],
    "postText": "When you're rich enough, you get perks you can only dream of. Literally. But somehow, my paradise turned into hell.\n\nHave you ever had a dream so amazing, you wished you could relive it? Explore it? Relish it? Well, when you're rich enough, you don't have to wish. It's a reality thanks to dream banks. You may have heard of them and their pricy services, which include recording, saving, and projecting dreams.\n\nFor example, if you'd like a dream recorded, you can book one of their luxurious suites for the night, where the dream techs will fit you with a special helmet and leave you to rest. The next morning, they'll replay the recorded dream for you via the helmet and ask if you want to shell out the extra bucks to save it. If you don't, they'll delete it and you can pay to book for another time to try again. \n\nIf you do decide to save it, you must select an item within the dream that will act as the exit key. (This will come in handy during projections.) While still wearing the helmet, you must touch the item, and the dream techs will label those electric signals as the key.\n\nAfterwards, everything is saved under your name, and you can now relive your dream at any time by booking a suite for three, five, or eight hours. Unlike recordings, during projections, you don't have to wait for sleep to come. After you enjoy a snack of your choice, the helmet is fitted and you're immediately transported to your dream, where you have free will and can enjoy it at your leisure. And if you ever need to leave early, this is when you touch the key, which will shut down the helmet right away.\n\nIn my case, the key is the stegosaurus leather rug I have hanging on the wall of my throne room. I never have a reason to touch it otherwise, making it a perfect key. I've also never had to touch it. Experiencing life as an all-powerful, worshipped being who lives on my own planet and hunts dinosaurs in my spare time, I relished my dream to the last second.\n\nYes, the fees are exorbitant, but at the time, I felt it was worth it. The techs were skilled, the system was sleek, and the dreams were private. Each could only be unlocked by the unique brainwaves of the dreamer.\n\nOr so I thought.\n\nMy literal nightmare began when I booked a five-hour projection on a rainy Friday afternoon. After taking a sip of champagne to wash down the cranberry brie bites, I settled into the cool silk sheets with a smile. My usual dream tech smiled back as she fastened my helmet, and the last thing I heard was her wishing me pleasant dreams before I was plunged into darkness.\n\nI waited for the split-second adjustment from reality to the dream world, and my confusion grew when I didn't find myself on my throne surrounded by fawning gods and goddesses. \n\nInstead, I found myself in the middle of an endless street. Alone. There were no cars, no life, not even wind. Towering street lamps lined the sidewalk as far as I could see, arcing over the road and tinting everything an eerie red. Behind them, identical buildings stood side by side, silent, their dark, narrow windows hollow.\n\nMy pulse spiking, I whipped around. The other direction was just as endless. Uneasy confusion prickled beneath my skin. This had to be someone else's dream. The techs must have made a mistake. I didn't know how it was possible, but there was no other explanation.\n\nMy unease piqued as my situation sank in. I was in a stranger's dream and I didn't know the key. I was stuck here until my five hours ran out. Or until the techs realized their mistake. I was ready to rip them a new one once I was out, but until then, I had no choice but to wait.\n\nI studied my surroundings with a frown before I walked over to the curb and sat down, and that was when I noticed I couldn't feel anything. I also noticed I was naked. It didn't matter. There was no one here, and none of this was real anyway.\n\nTime passed, and I tried to distract myself from my nettled offense by humming, but no sound came out. Sitting up, I took a deep breath and screamed. Not even a squeak was heard. I slapped my hand against the ground. Nothing. This place was like a black hole of the senses.\n\nSighing, I lay down on my back and stared at the red light above me, wondering if I could fall asleep in a dream. I tried, but the more I wished to escape this silent, crimson prison, the more it seemed to come into focus. Soon, the utter lack of noise and movement grew from slightly unnerving to completely intolerable. \n\nThere was no way I could wait. I'd go insane. I had to get out of here. I had to find the key.\n\nJumping up, I ran to the nearest building and wrenched open the door, and a pitch black void greeted me. I gasped, and gasped again as it felt like my very breath was being suctioned out of my lungs. Panicking, silent wheezes rattled in my chest as I struggled to yank myself out of the vacuum, jerking my limbs and bucking my body until I toppled over backwards on the sidewalk.\n\nGulping in fitful breaths, I scrambled to my feet and ran down the road without looking back, my wide eyes scanning the horizon for salvation. I just wanted out of here, but the hellish path stretched on forever, making me feel like I was running in place as every identical building and street lamp mocked me. Even my silent stomping and mute panting served to draw insanity closer.\n\nAnd then, a person showed up.\n\nThere, in the distance.\n\nWith my hope spurred, I raced towards them, desperate. I didn't care who they were. I needed to break this monotony.\n\nAs I got closer, hope morphed to confusion, and then to despair. The person was me. It was a mirror, propped up across the entire street.\n\nSweat-soaked, I slowed down to a jog before I stopped right in front of my reflection. It was me alright, naked, exhausted, and frustrated. But the eyes, something was off about the eyes. With an anxious frown, I stepped closer, staring into them, and they stared back …\n\n… until they glanced behind me.\n\nI gasped and jumped away, and so did my reflection … before it glanced over my shoulder again.\n\nA chill trickled down my spine. My reflection had nothing behind it but the empty street, so I gulped and turned around, and my mouth fell open in a silent scream as a lovecraftian behemoth barrelled its way towards me. With its slick shell gleaming red beneath the lights, it slammed down one spiny tentacle after the other as its five mouths bared their dripping, concentric fangs.\n\nDrenched in undiluted horror, tremors gripped my body as I stumbled away until my back was against the mirror. I knew death was a foolproof key in a dream, but I didn't know if this creature would kill me right away or leave me to suffer in agony until my five hours were up.\n\nWith it only inches away, I squeezed my eyes shut and pressed myself into the mirror, and my stomach flipped as I fell backwards. I opened my mouth to gasp, but there was nothing for me to draw in. Floating in an airless void, I flailed and thrashed, my wild eyes scanning the darkness for answers as I began to spin around.\n\nAlthough death would free me, one of my greatest fears was suffocating. On one of my weightless rotations, a red, glass cube passed me by, and I grabbed it, hoping it was a breathing device. I brought it close to my face, and I gawked at what it held within.\n\nMe.\n\nSurrounded by identical buildings and red street lamps while a lovecraftian behemoth tore me apart.\n\nHorrified, I threw the cube as far as I could and increased my efforts to escape this void. Yet all the flailing and thrashing was for naught as the darkness revealed no end. My eyesight began to go red as my lungs spasmed, and I clawed at my throat as my pulse stuttered in my chest.\n\nThe red kept growing and growing until it engulfed my entire vision, and I gave up. There was nothing to do but face my fears and die. With my straining heart lumbering, I let myself go limp as I stared at the red and waited.\n\nAnd waited.\n\nAnd waited.\n\nI wasn't dying. \n\nIn fact, I could breathe just fine.\n\nFrowning, I opened my eyes, and intense unease spread through my core. Above me, a red moon had taken up the entire sky, each one of its craters crystal clear, like eyes watching me. I turned my head away, and I realized I was in a park, laying down on the grass. Sitting up, I blinked in surprise at the pond right beside me, its opaque water reflecting the moon's red light. Ducks were swimming in a circle across its surface, their movements smooth with nary a splash.\n\nTrees surrounded us, so dense I couldn't tell when one began and the other ended. It was mind-numbingly quiet here as well, and I still couldn't feel anything or make any noise, but at least the ducks were moving. This place seemed more tolerable than the last, and I was willing to wait out my five hours here. I hoped at least an hour had passed already, but with dreams, one never knew. All I knew was that I was too exhausted to search for the key. And too scared. I didn't know whose dream this was, but they had to be masochistic if they saved this nightmare.\n\nCurling up beside the pond, I worked on calming myself down as I watched the ducks swim in their systematic circle over and over and over. I tried counting the rotations the way one would count sheep, but that still didn't lull me to sleep. I wished I'd chosen the three-hour projection, but at least I hadn't chosen the eight-hour one.\n\nDistorted circus music crackled around me and I jolted up, my heart ricocheting in my chest. There was finally sound, but the last thing I wanted to hear was a cliche horror movie soundtrack. Gulping, I looked around. The music was coming from the trees, and my stomach dropped when I spied a shadow behind one of them. Then another. And another. They emerged into the crimson moonlight, and my blood turned to ice.\n\nClowns.\n\nI whipped around, trembling to the rhythm of my frantic pulse. They were surrounding me. Dozens of them. As classic as any clown could be. Colorful clothes, big shoes, silly hair, exaggerated makeup. I wasn't scared of clowns, as long as they were where they belonged. And they didn't belong here, staring at me with big, empty eyes and yellow, toothy grins.\n\nI tried to convince myself that they weren't dangerous since they didn't have weapons and didn't seem monstrous, but when they took a step closer in unison, I jumped back, nearly falling into the pond. The ducks remained oblivious, still swimming in their circle. The distorted circus music got louder, and my hair stood on end when I saw the grass ripple in front of each clown. They were sending something my way through the ground.\n\nPanicking, I jumped into the pond, and I screamed as I sank right in. There was no bottom. There was no water either. The pond was filled with red, translucent spheres, each the size of a tennis ball. Still able to breathe, I began swimming through the spheres with clumsy breast strokes, just hoping I could end up as far away from the clowns as possible.\n\nAfter swimming for what felt like enough time, I tried to swim up, until I realized I had no idea which direction I was facing. Remember a trick for those stuck in avalanches, I spat, but my glob of saliva just hovered in front of me. Before panic could set in, I noticed what looked like an office desk floating amidst the spheres in the distance. After blinking a few times to make sure it was really there, I swam towards it, desperate for any change in my situation.\n\nIt *was* an office desk, a wooden one with carved borders and locked drawers. Tucked beneath it was a stool, and the moment I pulled it out and set it under my ass, an office replaced the red spheres.\n\nI grunted as gravity returned, and I looked around in bewilderment at the cluttered bookshelves and grimy floors. Dust was floating everywhere, highlighted by the red light filtering in through the blinds behind me. I jumped as a clock hanging on the wall chimed. Its glass was too dirty for me to tell the time, but I was glad I could hear. I coughed at the dust. And I could make noise. I dusted my hands. And I could feel. I could even smell, which I now wished I couldn't as I wrinkled my nose at the faint stench of rot.\n\nAfter failing to read the spines of some of the books on the shelves, I studied the shadowy corners of the room. A slack-jawed skeleton hung in the far end, and a faded poster with anatomical diagrams curled off a cupboard. This had to be a doctor's office. Was the creator of this dream a doctor?\n\nA silhouette slid in front of the frosted glass door, and I gulped as the knob began to turn. A hand reached in, gripping the edge one finger at a time, and my heart dropped as I knew this horror cliche was only going to be followed by another. Having no time to think, I slid off the stool and crouched beneath the desk, my hand over my mouth as cobwebs clung to me.\n\nPraying spiders wouldn't swarm me, I peeked through a small slit in the wood, and I froze when an emaciated nurse walked in the room. Layers upon layers of blood coated her scrubs, so much so that I couldn't even tell what color they originally were. She had no shoes. No feet either. Just ankle stubs, and my stomach turned as I heard bone clunk against the tiles.\n\nA surgical mask covered her face, as bloodstained as her scrubs, and grimy lab goggles obscured her eyes. I was grateful, because judging by the pus leaking out of her scabbed, balding scalp, I didn't want to know what her face looked like. The closer she got, the stronger the stench of rot became, and I struggled to keep myself from retching.\n\nShe stopped halfway into the room, and I gawked at her hands. They were transforming. Her fingers elongating into razor-edged blades. She then began to hunch over, and I cringed as her spine cracked and popped until she was as bent as a candy cane, her face staring at her pelvis.\n\nAs if that wasn't unsettling enough, her head creaked as it spun around 180 degrees, now facing the front, upside down. Right after, her arms shot to the ground, and I watched with increasing dread as she bent them at the elbows and wrists so they flanked her head like distorted T-Rex arms. \n\nShe spread her fingers out and took a few more steps towards me, and I held my breath, hoping she couldn't hear my rabid heart or smell my fear. Her ankle bones clicked and clacked against the tiles as she made her way around the desk, and I cowered as my frantic eyes searched for a weapon. I found none, but I did spy a brass button beside my head.\n\nWith her legs now an arms distance away, I had nothing to lose as I jammed my thumb into the button. The back of the desk flung open, and I scrambled to my feet and dashed out from my hiding place, screaming in response to the nurse screeching behind me. Bursting through the door, I held up my fists and began punching like a maniac in fearful anticipation of a horde of nurses swarming me.\n\nExcept I was no longer in a hospital. I was in an outdoor parking lot. Alone. And judging by the roiling red clouds, a storm was brewing. After a second to collect my bearings, I dove into the closest car, thankful it was unlocked. The moment I slammed the door shut, lightning blinded me as thunder cracked and the downpour began. Sighing in relief, I tried to shake away my adrenaline, but the bloodshot eyes in my rearview mirror reignited my panic.\n\nBefore I could react, a belt snapped over my neck, pinning my head back against the headrest. With a frightened wheeze, I clawed at the leather, and I flinched as hot, heavy breath wafted across my ear. Gagging at the putrid smell, I reached over, desperate to scratch my strangler's face or poke their eyes out.\n\nI felt their greasy hair and tried to pull it, but my fingers refused to hold on. I tried again and again, using my nails for purchase, but the strands just kept slipping out of my weak grip. Shifting focus, I tried to claw at their eyes, but it felt as though I was moving through molasses as my hand slid down their face. Once I felt a wet, bulbous eye, I tried to scratch it, but I didn't have enough strength to do anything damage.\n\nMy frustration clashed with my terror and I tried to punch them, but my arm swung back in slow motion and merely prodded a stubbly cheek. Tears welled in my eyes as I writhed and gasped, my strangler's laugh adding insult to injury. Despite knowing death will set me free, fear and self-preservation rummaged through my mind, searching for a solution. And they found one. \n\nHoping I had enough grip and energy, I reached down and found the reclining lever. Wrapping my fingers around it tight, I jerked it up and heaved my body back, and I gulped in a deep breath as I fell backwards, the belt now slack. Not at all prepared to face my attacker, I slipped out from beneath the belt, flung open the door, and zoomed out into the storm. \n\nSheets of rain obscured my vision, but not enough for me to see that the keys were left inside a red convertible. After making sure no one was hiding in the back, I jumped in, started the engine, and took off, the wheels squealing through the puddles. A sole street curled down a hill, and I took it, adrenaline pumping in waves through my quivering body.\n\nThis rush was a confusing mixture of exhilaration and apprehension. I wanted out, but I wasn't giving up. I made it this far, and I was going to survive every cliche this masochist dreamed up. Sharks? Snakes? Zombies? Bring it on. And afterwards, I was going to detail every single trial and tribulation I went through as I sued the dream bank for all the trauma they caused me. \n\nUp ahead, the road curved, and I gasped as it ended in a cliff. I slammed the breaks, but they didn't do anything. Breaking out in a cold sweat, I slammed them again and again as I yanked the hand break as far as it would go. The car refused to slow down, and I cursed myself for not anticipating this cliche. In a move of desperation, I swerved, but it wasn't enough as the car careened over the edge and took me with it.\n\nMy heart hung in my throat as I hung on to the steering wheel, my knuckles white, my screams frozen in my lungs, the raindrops like needles. An endless body of water spread below me, and I knew sharks were my next challenge. I screwed my eyes shut as I awaited the inevitable plunge …\n\n… and I gasped as the car crashed against the surface.\n\nI lurched forward, and I cried out as I bashed my forehead against the wheel. Groaning, I leaned back, my ears ringing as I looked around, disoriented. I was still in the convertible, but we were right side up, having crashed into the concrete wall of an indoor garage. Blood trickled down my face and I reached up, only to feel around my head in shock.\n\nI was wearing the helmet.\n\nWhy was it in the dream?\n\nOr had I made it out?\n\nI looked down. I wasn't naked. My pyjamas were plastered to my sweat-soaked skin. I *was* out. I looked around at the broken glass and mangled metal in confusion. But if I was finally out, why was I in a car and not between silk sheets?\n\nI removed the helmet, and a yell from behind made me jump. I turned to see one of the dream techs running towards me. Was she always that skinny? And why were her scrubs red instead of the usual blue?\n\nShe made it to me, panting as she took the helmet out of my hands, and I wrinkled my nose at her unpleasant breath. She said I'd had a nightmare and began sleepwalking, and I'd left the dream bank and stole a car from their underground parking before she triggered a wake-up signal in the helmet, which made me crash.\n\nI stared at her, not believing what I was hearing. I told her I'd booked a projection, not a recording, and she gave me a concerned frown and claimed the opposite. Anger replaced my confusion, and I called her a liar and accused them of misconduct, and she reminded me that dreams can only be unlocked by the dreamer.\n\nFurious, I cursed at her as I tried to get out of the car, demanding to see my file. She was quick to tell me not to move in case I made my injuries worse as she pulled out her phone and said she was going to call an ambulance.\n\nWhile I sat there and waited, fuming, I glimpsed my reflection in the dangling rearview mirror. Unease rippled beneath my skin and I sat up, grabbing the mirror and angling it to show my neck.\n\nThere was an angry red mark across it.\n\nAs though I was recently strangled.\n\nTrembling, I tilted the mirror up. \n\nCobwebs. Stuck in my hair.\n\nDumbstruck in utter stupefaction, I scanned the rest of my body. My pyjamas were dirty and there was black under my fingernails, but the rest of my examination was cut short by tinny circus music. A chill jolted down my spine and I whipped my head to face the dream tech. That was her ringtone. She smiled as she answered the call, and I drew back at her yellow, toothy grin. \n\nWhat was going on? I was out of the dream, I knew I was. Had everything been real? What had the dream bank done with me? Done *to* me?\n\nAmbulance sirens wailed as they entered the underground parking, and the flashing red lights reflecting off the walls triggered my recent traumas. With terror-fueled adrenaline flooding my veins, I jerked my legs free of the wreck, jumped out of the car, and booked it, the dream tech's yells merging with the screeching sirens behind me.\n\n-----\n\n[SR](https://www.reddit.com/r/Skittishreflections)",
    "comments": [
        {
            "level": 0,
            "comment": "Uhau!! What a nightmare!! \n\nThat nurse was, somehow, inside your \"dream\", the clown music of her phone's ringtone, herself, skinny... My only advise would be to stay the fu\\*k away from that \"dream bank\"! If you want to go legal against them you'll have to submitt yourself to another \"dream session\" and who knows if that wont be your everlasting final dream /nightmare!",
            "score": 6,
            "author": "Happy_Alone369",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh, I definitely want to go legal against them! I'm collecting evidence, I just hope they don't delete everything from their side. And I'm never setting foot inside a dream bank again!",
                    "score": 5,
                    "author": "SkittishReflections"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Never fear has been unlocked for me. I don’t ever want to visit that business.",
            "score": 3,
            "author": "Mo3inaz",
            "replies": [
                {
                    "level": 1,
                    "comment": "I support that decision. Don't get involved!",
                    "score": 2,
                    "author": "SkittishReflections"
                }
            ]
        }
    ]
}