{
    "id": "146wmj3",
    "score": 40,
    "title": "what is that awful smell",
    "author": "TangerineSniffer",
    "date": 1686496884.0,
    "url": "https://www.reddit.com/r/nosleep/comments/146wmj3",
    "media_urls": [],
    "other_urls": [],
    "postText": "My mother’s sheets were the only thing that brought me comfort in my grief-stricken state. I would lie, curled up in her bed taking in the faint smell of her lavender perfume. I’d close my eyes and imagine her next to me, her hand combing through my hair, reassuring me that everything would be ok. Losing her was the hardest thing I ever had to go through. She was my rock. She was the one who held me together when life got tough.  \nI don’t remember how I dragged myself out of that bed, but I started taking care of myself, showering, changing, and even brushing my teeth. Everything seemed so much harder like there was a constant weight looming over me. While I no longer slept in it, I still liked to sit on her bed and stare out the window. We used to sit on it together at the end of a long day, and she’d always make me a cup of tea that I’d slowly sip while we just talked. I found myself getting lost in that warm memory.  \nI didn’t even notice the sun setting. I only drifted back into reality when it had completely disappeared below the horizon. The moon illuminated the yard, casting an ominous blue tint across it. A tinge of paranoia crept in, but I quickly shook it off. I got up to get myself ready for bed, but as I descended the stairs a putrid smell hit me like a brick. Gagging, I continued down the stairs, covering my mouth with my sleeve. I looked for the source, checking the kitchen, then the washroom. The smell intensified as I approached the living room. I realized the smell was seeping in through the open window, so I quickly closed it shut. As I did two eyes caught my attention.  \nThey were peering at me from behind some bushes in the yard. At first, I thought it was the culprit for the smell, some raccoon that had dragged in its decaying meal.  I was about to turn around when the orbs began slowly lifting higher and higher until whatever the creature was towered over me. The moon illuminated its back, leaving its face shrouded in darkness. I could however make out a silhouette, with ribs jutting out of its skin, threatening to tear their way out. It looked terribly emaciated. On either side of it hung long slender arms, claws glistening in the moonlight.  \nI slowly backed away, refusing to break my eye contact with the thing. As soon as I got to the foot of the stairs, I ran up, making my way to my mother's room and shutting the lights. My hands shook violently as I grabbed a blanket off of her bed. I wrapped it around me, the cool cotton working to soothe my nerves. I clenched the fabric tight in my hand as I made my way toward the window. Every bone in my body was screaming at me, begging me to turn around and lay in the safety of the bed.  \nJust as my hand gripped the window sill I heard a hellish scream. It was guttural and vibrated through the walls sinking deep into the foundation of the house. The room around me seemed to shake, recoiling in fear of whatever stood on the other side of the glass. That fear struck a match deep within me. How dare this thing make me feel so trapped in my own home? Make me cower in this room? That fire spread thawing out my frozen legs and propelling me forward. I yanked on the latch and threw the window open. I hardly released what I was doing before my head was sticking out in the cool night air. I screamed incoherently, wailing at the beast for making me feel as helpless as I did. There was no response. There wasn’t much of anything, I couldn’t hear a single car whirring down the street, or cricket singing away. Just my voice rebuking whatever abomination hid within the shrubs. I held my head outside until my throat went hoarse, and my eyes stung. Only then did I drag my body back inside, and fall into my mother’s bed. I curled up in her sheets and fell asleep quickly.  \nI couldn’t have been asleep for more than an hour when I heard knocking on the front door. At first, I thought I was just imagining it. After a few seconds, the knocking started again. I pulled myself to the edge of the bed, my arms felt heavy, weighing me down like two anchors. I managed to heave myself over to the side of the bed, dangling my legs over the side. I slowly made my way to the hall, the blanket trailing behind me as I held it tight around me. As I reached the stairs a sudden realization hit me. What if it's back? I shuddered at the thought of that thing standing in front of my door, waiting for me to let it in. I stood at the top of the stairs watching the silhouette through the muddied glass surrounding the front door. I nearly turned back around when I heard I friendly voice.  \n“I’m Officer Petrov, a concerned neighbour called for a wellness check.”  \nI rushed down the stairs, tripping over my blanket as I stumbled towards the door. I pulled it open and was met by a young woman in a pristine uniform. Her hair was pulled back into a tight bun, not a strand out of place. I glanced at my reflection in the mirror beside me. We couldn’t look any more different. My hair was a dishevelled mess, my bangs were matted onto my forehead from sweat and oil, and dark circles framed my eyes. I cowered behind the opened door, pulling the blanket tighter around me. The woman shot me a sympathetic smile.  \n“Can I help you?” I asked, my voice coming out meeker than I would have liked.  \n“We got a call of a disturbance, a woman screaming from this home,” she took a step towards me. “I came by to see if everything was alright.”  \n“I thought someone was trying to break in, so I panicked and yelled. I’m pretty sure it was just some animal. I’m sorry I didn’t mean to disturb anyone.” I tried to sound apologetic, but my voice wavered and cracked with every new sentence. I felt her eyes scanning me over, examining my fidgeting hands, unkempt hair, and the blanket that was still wrapped tight around me.  \n“Are you sure? If you need anything I’m here to help.”  \nI wanted to reassure her that everything was fine, that it was all just some silly misunderstanding and she should go on her way. Nothing was okay though, every day was a battle just to get through, and now I had to deal with the stress of some supernatural stalker on my own. My lip started to quiver, and as I met her eyes my legs gave out. She caught me, and I buried my face in the nape of her neck letting the tears fall. She held me tight and stroked my hair, the way my mother would,  reassuring me that everything would be ok. When I’d calmed down a bit, she helped me up and onto a couch. She sat opposite me, hand resting on my knee.  \n“I can’t help you unless you tell me what happened.” She said in a soothing voice.  \nI wanted to tell her, I desperately needed to tell someone about what I had seen. I knew I couldn’t though, she’d have me strapped up in a psychiatric hospital by the end of the night.  \n“It's just been pretty rough since my mom passed away.” It wasn’t a lie. “I just had a rough night, really it's nothing.” I got up to lead the officer out when the same putrid smell from earlier started seeping in through the door. I completely forgot about closing it after letting her in. I slammed my body into it and locked it as quickly as I would.  The officer trailed after me, concern lacing in her tone.  \n“What happened? Is everything alright?” As she made her way towards me, she stopped in her tracks, face scrunched in disgust. “What is that?”  \nAs I scrambled to find a reasonable answer, three knocks sounded from the door. I instinctively grabbed Petrov’s hand, skulking behind her. She braced herself as she turned to face the door. The creature’s tall and slender silhouette cast a shadow across the muddied glass, shrouding us in its darkness. Then it let out an inhuman growl. A gasp caught itself in her throat, and she took a step back pressing herself into me.  \n“I’ll call in for backup.” She said, keeping her voice steady. As she grabbed for her radio to call in we heard a loud crack. We jerked our heads back toward the door, clinging onto one another. The creature then again threw itself at the window, a spiderweb of cracks expanding across the glass. She yanked me towards the stairs, dragging me behind her. As we reached the top step the window shattered, and the thing fell into the house and onto the shards with a crunch. The glass pierced its leathery skin, black ooze dripping onto the ground. The officer squeezed my hand in reassurance and continued to drag me up the stairs. As I turned to face her I noticed sweat dripping down her neck, and her free hand trembling. Behind us I could hear the shards chipping below its feet, and its sharp claws scraping against the wooden floor as it chased in pursuit of us. I didn’t dare turn around again, I was terrified that if I turned I would come face-to-face with it. We jumped into the closest room, and she threw the door shut.\n\n  \n“Grab that dresser! We gotta barricade this!” She yelled, pressing herself against the door. I hurled myself at the dresser, desperately trying to shove it toward her. As I did a blood-curdling scream stopped me in my tracks. I looked over to see the officer hunched over, with an arm wrapped around her stomach. Blood was pouring out of her, pooling at her feet, and she wailing in pain. I desperately wanted to shove the dresser towards the door, help the woman, or do something, anything. But I froze. I didn’t do anything as she begged for help. Or as the emaciated beast continued to claw at the door. I craned my head to face it as it hunched behind the shredded door.  \nAs I met its eyes I wasn’t met with bloodlust or resentment, but a wave of warmth passed through my body. The smell of decay faded away and was replaced by lavender. The smell of my mother's sweet safe lavender perfume. The weight I had been carrying on my back was gone and for the first time in a long while, I felt light. With every step I took towards the creature the sweet smell intensified. I wanted to drown myself in what it was offering me, no matter the cost. As I took my final step toward it, my final step towards an eternal bliss a sound like crashing thunder took it all away. The creature collapsed in front of me, its black ooze splattered across my face. I turned to face the officer, limp in a pool of her own blood, with the gun still clasped in her hand. I shrieked as the weight of the world came crashing down on me. The euphoria ripped from me, and the putrid smell of sulphur mixed with iron suffocated me. I tried dragging myself towards it, but my limbs wouldn’t move. I laid paralyzed between the carnage softly weeping and mourning everything I had lost. I eyed the gun still clenched in the officer’s hand and made a vow to myself that I would follow the creature and collect what it promised me no matter the cost.",
    "comments": []
}