{
    "id": "83vwgw",
    "score": 18371,
    "title": "Letter from the girl who watched you grow up",
    "author": "MTLStoriesPaty",
    "date": 1520869492.0,
    "url": "https://www.reddit.com/r/nosleep/comments/83vwgw",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/nosleep/comments/9djazj/letter_from_the_girl_who_watched_you_grow_up_part/?st=JLQORSH8&amp;sh=eb0a14d0)"
    ],
    "postText": "Hi,\n\nThe first time I saw you, I was surprised I could see you. You had a small turtle in your hands. You kept calling it Michaelangelo, which I assumed was a nod to the Ninja Turtles. You tossed your long, brown hair behind your back and knelt down to place the turtle on the ground. You were excited to see it wobbling on the grass. It reminded me of my cat and how I used to play with him when I was your age.\n\nI witnessed your entire childhood from my small *window*. Your first ride on a bicycle. Your first day of school. Your first real friend Brenda. Your first day of middle school and the cute uniform you got to wear. The time you won the science fair and you brought home a trophy shaped like a cell. You were such a happy girl.\n\nI saw you grow older. Your body changing. You grew taller, your body slimmer, your face as beautiful as ever. I witnessed as others started to notice you in a different way. The stares from the jealous girls. The googly eyes from the young boys. As all this happened before my eyes, I noticed myself changing too. I got older. I got weaker. I got disillusioned . Bruised. I lost my will to escape my painful life. All I had was this *window* to your life to keep me going.  I lived my days through yours. Watching you was enough entertainment for me. You couldn’t know the different ways you saved me from bad thoughts, bad days and all the pain I had been suffering from.\n\nI saw the day that handsome young man came to pick you up in a red convertible. Your mother wasn’t happy about it, but she knew she had no choice. You had to start spreading your wings at some point. You left in a gorgeous floral dress that matched the summer’s flowers. You came back late that night. You had a stuffed bear and some leftover cotton candy. I imagined you had gone to the fair. I imagined all the rides you must have gone on. All the fun that must have been for you. I was so happy that you had enjoyed your first date. And then came the magical kiss. He leaned in, blushing, and kissed you. Your cheeks were so red that I instantly knew I had witnessed your first kiss. I closed my eyes, imagining what that must have felt like. For *one* second, I imagined it had been me wearing that dress, smiling so big, with butterflies in my belly and a kiss on my lips. But I was happy for you. \n\nI wanted to thank you for allowing me to live again. For allowing me to dream again. I wanted to thank you, but just couldn’t bring myself to you. I couldn’t go talk to you. I didn’t know how. If only you knew about my *window*.\n\nAnd then, one day, I heard him talking about you. The man I live with. He noticed you. I heard him complaining about how pretty girls like you shouldn’t show off their legs like that. The moment he mentioned your legs, I knew it was over. I knew you would become his next trophy. I had to keep you away from him. This was my chance to thank you. I couldn’t let you turn into me.\n\nI had been lucky. I don’t know why he liked me this much. Most other girls came and went, never to return. And yet, amidst all the years, he always kept me down here. I think it’s because he saw that I still had a light in me. Because I had *you*. All the other girls died long before he killed them. I could tell that they were already dead in their eyes long before he viciously murdered them in front of me, showing off his skill.\n\nBut not me. You kept me going. I had my little *window*. A little crack high up on the wall of this basement I call home. He didn’t like that he couldn’t break me down. He didn’t know about the little crack. So he kept me to see how long I could stay like this. It is a sick game... that I’ve been winning thanks to you.\n\nBut then... he noticed you. And I knew, I knew what fate awaited you if he laid his monstrous hands on you. Whatever strength I have left, I’ve collected it and prepared myself to finally do something about it.\n\nI want to thank you. Because if you’re reading this letter, it means I did it. I gathered my courage, packed it neatly into action, and went through with my plan to escape once and for all. I will make him believe I’ve died. I don’t know if it’ll work. But if it does, he will reach to pick me up. I’ll immediately kick him as hard as I can where it’ll hurt the most. *As hard as I can*. I will then steal his keys and run as fast as I can and drop this letter off in your mailbox. I have a feeling he will chase me and get a hold of me eventually because I am weak... I’m very weak. Battered. There is barely a human left in this body of mine. But if that is the case, I’ve been prepared to leave this world for a long time. I doubt anyone will hear or see me. This street is so desolate. You’re the only life here it seems sometimes. But so long as you get this letter, I know that I did my part and that you’ll be safe. \n\nMonsters are real. This one is named Ryan Morehouse. He is your front door neighbor. I have been kept captive in his basement for a very long time. I’ve lost track of the years but I believe I must be in my late twenties by now. I was fifteen when he first brought me here. My parents must have looked for me. Please don’t tell them about me. I don’t want them to know about the tortures he put me through. I don’t want them to see me broken down this way. I just want you to report him to the police. His evil nature and depraved mind can only be stopped if he is caught behind bars. \n\nThey will find bodies dangling in the walls of the basement. I’ve learned to live with  the smell by now but they will notice it the second they step down here. There are a lot of young girls in the walls of my room down here. Tell them to treat them delicately. They were good girls. They’ve been my companions. My friends. \n\nMost of all, I want to thank you. You’re the only thing that kept me going. You were my light. And now, I’m escaping thanks to you. Escaping this awful room. Escaping this awful life. Even if it means I finally get to die.\n\nWith love,\n\nThe girl who watched you grow up\n\n——————————-\n\nWe found this letter in our mailbox. After contacting the police, they entered the home of our neighbor across the street. Over a span of five days, they found a total of fifteen bodies hidden in different parts of his house. He had plans to kidnap our daughter, but thanks to this mysterious stranger, his plan was intercepted. We still have not found the girl who wrote this. We like to think she made it out alive, but, sadly, it isn’t likely as Ryan Morehouse is also missing. We don’t even know her name. But we did find the little crack in the wall, the one where she saw my daughter grow up from. \n\n[Part 2](https://www.reddit.com/r/nosleep/comments/9djazj/letter_from_the_girl_who_watched_you_grow_up_part/?st=JLQORSH8&amp;sh=eb0a14d0)",
    "comments": [
        {
            "level": 0,
            "comment": "What the fuck, there's a war on drugs but where is the declared war on sex slaves ",
            "score": 1494,
            "author": "MistsOfDis-Ill-usion",
            "replies": [
                {
                    "level": 1,
                    "comment": "Its all about money man. You ever notice how drug dealers always have higher bails and longer sentences than sex offenders?",
                    "score": 524,
                    "author": "snomroMtaEI"
                },
                {
                    "level": 1,
                    "comment": "Not a priority, because war on human trafficking, especially sex trafficking, would mean taking on very influential and entrenched groups such as the film industry, politicians, corporations, and religious institutions. \n\nNot that they're the main perpetrators, but to think that they haven't done shady shit all these years would be naive. ",
                    "score": 385,
                    "author": "thatgreenmess",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 57,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I know I'm going to hate reading these.  I also know I have to come back and read them because I need to know.\n",
                                    "score": 2,
                                    "author": "EatFrozenPeas"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "and some of the largest consumers of cocaine arent rich? lol\n\nit isnt a priority because it isnt nearly as wide scale",
                            "score": 15,
                            "author": "africadog",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Many rich people do drugs, yes. But I was pertaining to institutionalized or systematic sexual abuse happening in those I've mentioned, not just some people who happen to be sexual predators. \n\nAnother thing, human trafficking and sexual exploitation is [much more widespread than you think](https://www.stopthetraffik.org/about-human-trafficking/the-scale-of-human-trafficking/). Not seeing or hearing it as much as the drug problem doesn't mean it's less widespread nor does it mean it isn't there. It's just taboo to talk about it, unlike Drug use which is openly demonized by authority figures.",
                                    "score": 44,
                                    "author": "thatgreenmess"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I often ask myself that same question. I live just south of a city that has a huge human trafficking market, it's sickening. And yet every day people are arrested and locked up for non violent drug charges, by the dozens and nothing is ever done about the blatant and open sex trade going on. Our city is known for grooming sex slaves before they are either shipped off some where or sold to a John and put on the streets, but you never see or hear about it in the news. And the reason you don't see or hear about it in the news and the reason the corrupt politicians won't do anything about it is because it brings in millions of dollars every month, every time there is a home football game, or a concert, or some show at the arena you best believe those girls are lined up on the corners, it brings in hundreds of people and millions of dollars. And those that run the trade in this city line the pockets of the politicians and the sheriff's office so that they will turn a blind eye. Fucked up. ",
                    "score": 24,
                    "author": "Notafraidofnotin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What city is this?!",
                            "score": 3,
                            "author": "meeseeksdeleteafter",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Jacksonville, Fl",
                                    "score": 4,
                                    "author": "Notafraidofnotin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "i live there and had no clue about this? where did you find this information",
                                            "score": 3,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "From retired police officers from that area, I know several of them, and some of them were as corrupt as they come and involved in covering it up.  You won't find much of anything about it in news articles or any where because it is covered up. They don't want it getting out or it would hurt the tourist business both for Jacksonville and the surrounding cities. Plus the corrupt politicians and police that benefit from it don't want it getting out. ",
                                                    "score": 4,
                                                    "author": "Notafraidofnotin"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Dig to deep and you end up with your body in pieces scattered about the city. And that is a real thing, look up local murders in the area in the late 90s early 2000s when it was at its height. People were being found like this through out the city. ",
                                                    "score": 2,
                                                    "author": "Notafraidofnotin"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Aston Kutcher is spearheading it last I heard ",
                    "score": 75,
                    "author": "breadNbutter62",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*Ashton",
                            "score": 17,
                            "author": "nahteviro",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wasn’t sure. Thanks.",
                                    "score": 21,
                                    "author": "breadNbutter62"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There is a war on human trafficking as well, it is just not as large as the war on drugs",
                    "score": 23,
                    "author": "bambi_killer_49",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Doesn't help that its mostly used as a war on sex workers instead",
                            "score": 49,
                            "author": "UphillSky",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Indeed it is — I’ve felt the wrath of Vice. ",
                                    "score": 2,
                                    "author": "koalaver"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thats not just in stories child sex trafficking is a very insidious and real thing",
                    "score": 42,
                    "author": "Jaxelinfowars"
                },
                {
                    "level": 1,
                    "comment": "For the same reason there is no war on homelessness. There is no money to be made from it. So sad. ",
                    "score": 14,
                    "author": "MerkleMort",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "If they legalized drugs and allowed police to do actual police work they can fix then we probably could have a successful war on sex slavers. Trying to control demands for substance addictions is like trying to organize all the leaves blowing in the wind during the Fall.",
                    "score": 8,
                    "author": "Johnvonhein1"
                },
                {
                    "level": 1,
                    "comment": "Yah its a big issue on Indian reservations that’s not spoken about",
                    "score": 16,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "A war on drugs is really easy from a prosecution stand point.  You only need to catch someone with drugs on them or their property, charge them based on how much you find, and you're done.  It's much harder to actually investigate a crime or catch someone in the act.  ",
                    "score": 9,
                    "author": "Tricountyareashaman"
                },
                {
                    "level": 1,
                    "comment": "Really? Can't this place be free from politics? A lot of us come here for that reason ",
                    "score": 2,
                    "author": "PeacefullyFighting"
                }
            ]
        },
        {
            "level": 0,
            "comment": "oh no who put these tears in my eyes",
            "score": 317,
            "author": "probablynotben"
        },
        {
            "level": 0,
            "comment": "She was a very brave soul to do this to save your daughter.",
            "score": 1180,
            "author": "fifthrobin"
        },
        {
            "level": 0,
            "comment": "A sad, but good, ending",
            "score": 735,
            "author": "mylouie",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's no ending if the perpetrator is still on the run, though...",
                    "score": 147,
                    "author": "xplosm",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Somebody say sequel?",
                            "score": 48,
                            "author": "DJ_Mbengas_Taco"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Absolutely heartbreaking. ",
            "score": 364,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 820,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean it was still creepy ",
                    "score": 291,
                    "author": "Cimorenne",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, like... It's not that I don't sympathize with the basement girl, like, props to her for finding her strength and shit but... I don't to be watched for years by a basement girl. It's just not something I'm in to.\n\n*Edit: though it'd probably be an ego boost to be so interesting just walking down the street that it inspires someone to live.",
                            "score": 102,
                            "author": "chuckleberrychitchat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well maybe you're not.",
                                    "score": 59,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hey, whatever works for you. ",
                                            "score": 10,
                                            "author": "chuckleberrychitchat"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I was referring more to the fact that someone kept her in a basement for so many years as the creepy part",
                                    "score": 19,
                                    "author": "Cimorenne",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "It's not the ego boost but more that the person has some form of entertainment.. even if it's through the form of you. It doesn't change a day of your life, and they get something normal to think about",
                                    "score": 9,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah I was joking haha ",
                                            "score": 1,
                                            "author": "chuckleberrychitchat"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was ready for something like \"I ask your father every night to let me out of your basement\" or something, until it said \"he noticed you.\"",
                    "score": 86,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow...this is the first one I've actually teared up at. Hoky crap",
            "score": 278,
            "author": "whiskyydickk",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 30,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Haha! I didn't catch that until now ",
                            "score": 4,
                            "author": "whiskyydickk"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jesus Christ. That's my neighbor's name. I kid you not. And he has always weirded me out. \n\nEdit: I've called the cops before for unrelated reasons. His dad who owns the house he lives in came over and interrogated me the next day. ",
            "score": 208,
            "author": "smolpotatoes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Including last name?",
                    "score": 49,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes",
                            "score": 51,
                            "author": "smolpotatoes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Check his walls for cracks and weird smells!!!!",
                                    "score": 71,
                                    "author": "KhaosPhoenix",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He ded",
                                            "score": 46,
                                            "author": "Chitownsly"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "OP is trying to tell you something ...",
                    "score": 13,
                    "author": "scarstarify"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No shit, thanks Captain Obvious. ",
                            "score": 42,
                            "author": "smolpotatoes"
                        },
                        {
                            "level": 2,
                            "comment": "How about reading the fucking sub rules? Christ...",
                            "score": 17,
                            "author": "EchoOfEternity"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Tell them to treat them delicately, they've been my companions, my friends\" .... My heart broke and the tears fell. Such a brave girl!",
            "score": 59,
            "author": "jojosweets"
        },
        {
            "level": 0,
            "comment": "Take your upvote \nSlow clap ",
            "score": 54,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Oh, wow... Her sacrifice saved your daughter, even though she couldn't have saved the other girls from that monster.",
            "score": 478,
            "author": "Anticlimactic__",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ironic",
                    "score": 112,
                    "author": "feared134",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How?",
                            "score": 21,
                            "author": "Anticlimactic__",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Your post just reminded me of the star wars quote \" Ironic. He could save others from death but not himself.\"",
                                    "score": 206,
                                    "author": "feared134",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’ve been on r/prequelmemes too long. ",
                                            "score": 88,
                                            "author": "bowtiesarecool2012"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Oh. Yeah, I never watched Star Wars, so no recollection of that quote.",
                                            "score": 14,
                                            "author": "Anticlimactic__",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Me either. Thank you. ",
                                                    "score": 7,
                                                    "author": "Wikkerwoman11",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Username checks out",
                                    "score": 8,
                                    "author": "diariesofpierce"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This was an unexpected tear jerker. Bless her heart.",
            "score": 156,
            "author": "TesseractMagician"
        },
        {
            "level": 0,
            "comment": "it makes my heart happy and sad to read stories like this. sad for the situation the girl was in, but happy for your daughter and that the girl did this to save her.",
            "score": 43,
            "author": "coolmoonn",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Who the f is cutting onions? ",
            "score": 31,
            "author": "machsh"
        },
        {
            "level": 0,
            "comment": "I never thought I would cry from reading something in this subreddit...",
            "score": 26,
            "author": "RazzyCharm",
            "replies": [
                {
                    "level": 1,
                    "comment": "Search “When the stars go out”",
                    "score": 9,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "You should read the January monthly winner. Great read. This one was pretty good too!",
                    "score": 3,
                    "author": "rookierach"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 943,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I felt shivers. ;-; ",
            "score": 36,
            "author": "RoseDaCake"
        },
        {
            "level": 0,
            "comment": "I felt numb for about five seconds after reading this, then all the feels!",
            "score": 89,
            "author": "Tamalene",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Thank God she was able to put the letter in your mailbox and that you believed it enough. What's an\"front door neighbor\"?",
            "score": 62,
            "author": "ransomnoteface",
            "replies": [
                {
                    "level": 1,
                    "comment": "A next door neighbor is a house to the left or right of your own. A front door neighbor is in front of your house across the street, and a back door neighbor is the house behind your own on the street behind your own.",
                    "score": 104,
                    "author": "IcarusBen"
                },
                {
                    "level": 1,
                    "comment": "I assume it's a house directly across from yours.",
                    "score": 48,
                    "author": "cosmic-eggs"
                },
                {
                    "level": 1,
                    "comment": "I think it’s that they live across the street from you. Their front door facing yours? That’s what I thought but I don’t know ",
                    "score": 17,
                    "author": "maddyjk7"
                },
                {
                    "level": 1,
                    "comment": "It's like the back door neighbor. If you know what I mean. Wink wink. ",
                    "score": 3,
                    "author": "Chitownsly"
                },
                {
                    "level": 1,
                    "comment": "Well, obviously it means the neighbor across from you.",
                    "score": 3,
                    "author": "alicevanhelsing"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What if Ryan Morehouse has a multiple personality disorder and the author of the letter is one of their* personas?\n\nEdit: pronoun ",
            "score": 85,
            "author": "amandalmighty",
            "replies": [
                {
                    "level": 1,
                    "comment": "As if my feels weren’t already fucked...",
                    "score": 8,
                    "author": "ImThatMelanin"
                },
                {
                    "level": 1,
                    "comment": "Or her*",
                    "score": 16,
                    "author": "Forester-lol"
                },
                {
                    "level": 1,
                    "comment": "..... omg. That's brilliant. ",
                    "score": 7,
                    "author": "Itsafinelife"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If I could, I’d give gold.",
            "score": 24,
            "author": "C1rculatum",
            "replies": [
                {
                    "level": 1,
                    "comment": "!redditgarlic ",
                    "score": 5,
                    "author": "Chitownsly"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 33,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "But here we all are, leaving with the feels",
                    "score": 2,
                    "author": "girls_withguns"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awesome story!\n",
            "score": 10,
            "author": "kittykat1510"
        },
        {
            "level": 0,
            "comment": "And that girl was Albert Einstein.",
            "score": 11,
            "author": "unnamed_kinsman"
        },
        {
            "level": 0,
            "comment": "Nice! (In an encouraging sense of the word..not in how Mr. Morehouse treats his guests).",
            "score": 10,
            "author": "LandofLincolnLawyer"
        },
        {
            "level": 0,
            "comment": "Im so speechless, thank you for sharing OP",
            "score": 10,
            "author": "LiterallyChar"
        },
        {
            "level": 0,
            "comment": "I really enjoyed this post. The opening especially is quite moving.",
            "score": 8,
            "author": "aroomwithnomoose"
        },
        {
            "level": 0,
            "comment": "This made me cry.",
            "score": 6,
            "author": "JustReadinSubReddits"
        },
        {
            "level": 0,
            "comment": " Does anyone know why I got a notification that this story was posted? ",
            "score": 8,
            "author": "Babies_and_Danes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are you maybe following this person's posts?",
                    "score": 4,
                    "author": "brackenish1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": " No. They are a very good writer, but this is the first of their stories that I've read. I got the notification this morning and sister just got the same thing. We are both new to Reddit, so we weren't sure if this was normal. ",
                            "score": 7,
                            "author": "Babies_and_Danes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Is there a Crack in your front door neighbors basement wall?",
                                    "score": 20,
                                    "author": "knowssleep"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm a month late, so you probably already figured it out, but most days, reddit sends you a notification about top posts from subs that you subscribe to, i.e. I get \"Trending\" posts from r/politics, r/crappydesign, stuff like that.",
                    "score": 6,
                    "author": "UnfortunatelyIAmMe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes! Thank you so much, though! ",
                            "score": 3,
                            "author": "Babies_and_Danes"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "oh my heart. Wherever the girl are, I hope she's okay. May God bless her. This is so sad. :'(",
            "score": 7,
            "author": "RabbitPatronus"
        },
        {
            "level": 0,
            "comment": "Holy shit is this good.\n\n\nI started out thinking the girl is some sort of psychopath or even ghost that is gonna drain the life of ops daughter.\n\n\nThats a very good twist. ",
            "score": 8,
            "author": "jjjkong"
        },
        {
            "level": 0,
            "comment": "666th updoot",
            "score": 22,
            "author": "JackTheBadWolf",
            "replies": [
                {
                    "level": 1,
                    "comment": "The number of the beast ",
                    "score": 21,
                    "author": "MTLStoriesPaty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hell and fire was spawned to be released",
                            "score": 15,
                            "author": "magvon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Then my mission is accomplished.",
                                            "score": 2,
                                            "author": "magvon"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Make this a move. It's written perfectly and will serve well as a \"In a Galaxy far away\" type opening/narrative. Cut - to the beginning of your your story. The tension will reset and rebuild throughout the film. ",
            "score": 10,
            "author": "Pm-ur-butt",
            "replies": [
                {
                    "level": 1,
                    "comment": "The first like 45 minutes of the movie could be clips of the neighbor girls life being watched from a crack with some light breathing in the background but the face of the person watching isnt shown, clips of the man living his normal life outside his house, and clips of the girl living her life (the parts the girl in the basement can't see) and then* BAM* TWIST- camera finally shows the person the audience probably perceived as a \"spying pervert \" is actually a woman held Captive by *BAM* seemingly normal neighbor man, Ryan. ",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I like it. I like you. Print it. WE WILL make millions! ",
                            "score": 2,
                            "author": "Pm-ur-butt",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "MILLIONS! I have a head full of this stuff. Billions. ",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow, this was amazing. It was a heartbreaking, incredible read. ",
            "score": 5,
            "author": "monavic0829"
        },
        {
            "level": 0,
            "comment": "This is such an amazing read, well done.",
            "score": 6,
            "author": "orangutantan"
        },
        {
            "level": 0,
            "comment": "Amazing. What a beautiful sad story.",
            "score": 4,
            "author": "falconkitty"
        },
        {
            "level": 0,
            "comment": "This was an amazing read. Thank you. ",
            "score": 4,
            "author": "avocadochick"
        },
        {
            "level": 0,
            "comment": "Aww... I hope she has found peace somewhere...",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I didn't expect to have this much feels from r/nosleep :(",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Not me, the first turtle i caught was named Blastoise. \n\nGood writing though, sarcasm aside.",
            "score": 3,
            "author": "TheRealPainsaw"
        },
        {
            "level": 0,
            "comment": "I thought that it would end up that she was looking at her own past self through a photo album, and she wanted to warn the girl not to marry an abusive husband up until the murder and basement were mentioned, great ending.",
            "score": 6,
            "author": "Str4wBerries"
        },
        {
            "level": 0,
            "comment": "I get the most shivers as i'm trying to imagine at which point in my life she could've been kidnapped. Like, I was maybe around five years old, playing in the garden when somewhere in the States this girl got kidnapped. Then I imagine all the things i've been through in those years, whereas she only saw vicous murders and nothing more than a basement. Definitely a /r/nosleep :(\n",
            "score": 5,
            "author": "Djeddozo"
        },
        {
            "level": 0,
            "comment": "The greatest kind of sacrifice. Such a brave and amazing soul. I hope she is out there somewhere living.",
            "score": 5,
            "author": "lucids95"
        },
        {
            "level": 0,
            "comment": "This made my girlfriend cry",
            "score": 5,
            "author": "Stealthmonkey59"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 15,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 21,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "At least we know his name. We can search for him and find him! Maybe this woman is still with him and we can save her somehow.",
                            "score": 8,
                            "author": "Sokocime"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great job!",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Wow not at all what I was expecting.",
            "score": 5,
            "author": "someplasticks"
        },
        {
            "level": 0,
            "comment": "Almost crapped my pants thinking it was about me til I learned it wasn't...phew",
            "score": 4,
            "author": "CosmicLightning",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ryan...",
                    "score": 2,
                    "author": "Chitownsly",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "\nWow...this actually occurred? Man, we have some really twisted people out here. Crazy how different people’s mindset can be. And he probably felt justified in keeping those women down there for some reason",
            "score": 5,
            "author": "YOUNG_G0D"
        },
        {
            "level": 0,
            "comment": "I hope she made it. Hope that monster get put behind bars. It so heartbreaking to read this😫😫",
            "score": 5,
            "author": "frozen_neko"
        },
        {
            "level": 0,
            "comment": "Man I'm positive this story will make a good movie",
            "score": 3,
            "author": "NILCLMS",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Christ",
            "score": 3,
            "author": "Timetofly123"
        },
        {
            "level": 0,
            "comment": "I thought it was gonna be a really creepy old man but I was shocked in a kinda good way because it didn’t go as most scary stories go. Still so sad almost made me cry. ",
            "score": 3,
            "author": "titch_bits69",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This would make a beautiful film. ",
            "score": 3,
            "author": "tomoyopop"
        },
        {
            "level": 0,
            "comment": "Anyone else think it was a tree the first half?",
            "score": 3,
            "author": "Lacygreen"
        },
        {
            "level": 0,
            "comment": "My heart aches reading this. So incredibly sad.",
            "score": 3,
            "author": "arrozquartz"
        },
        {
            "level": 0,
            "comment": "No thanks she already hit me up on Facebook to let me know she doing way better than me",
            "score": 3,
            "author": "Illmatic_one"
        },
        {
            "level": 0,
            "comment": "This...",
            "score": 3,
            "author": "TwixelTixel"
        },
        {
            "level": 0,
            "comment": "I really want to cry now. :(",
            "score": 3,
            "author": "kbsb0830"
        },
        {
            "level": 0,
            "comment": "Wow, this is such a good story. I had chills the whole time reading. Amazing, thank you for sharing this. I can't imagine how she must have felt doing this, but she was very brave. ",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I read the first paragraph and I'm really fucked up now. I had a little read eared slider turtle named Michelangelo and I have long brown hair. I am a guy but it's just insane how closely related the introduction was to me. My eyes watered  ",
            "score": 3,
            "author": "BabySnakesYo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I thought I was here to make myself not sleep but right now you made me cry so I guess I'm gonna go to sleep with tears in my eyes. Here's your upvote.",
            "score": 3,
            "author": "marygracesmaya"
        },
        {
            "level": 0,
            "comment": "This is so beautiful, if you ever find her, please make sure she knows that we’re all thankful of her sacrifice for your daughter. ",
            "score": 3,
            "author": "MixTapeHolocaust"
        },
        {
            "level": 0,
            "comment": "NoSleep varies. Most of the time it’s something absolutely terrifying that deprived me of sleep. But sometimes it’s something heartbreaking that keeps me up at night. Kinda like that story here where a little girl with Down’s syndrome was liked behind a wall because her preacher/pedophile father was ashamed of her. She was only remembered by her brother who became a bitter old man because he didn’t help her. So gut wrenching. ",
            "score": 3,
            "author": "Manch94",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I was thinking the twist was the girl found this letter on one of the corpses in the basement where she now lives.  Great read.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I’m not even gone lie I fucking cried...",
            "score": 3,
            "author": "ImThatMelanin"
        },
        {
            "level": 0,
            "comment": "This made me cry. A lot.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "You have a knack for creating unique ways for telling stories. Keep it up!",
            "score": 3,
            "author": "that_one_bruh"
        },
        {
            "level": 0,
            "comment": "Omg I cried reading this because this is a sad reality. I've seen countless documentaries of poor girls picked up as kids and put through all kinds of horrors imaginable, some even developing Stockholm syndrome.\n\nAnd then there are the serial killers. I've read many books as a part of my psychology major and this set up is so common you won't believe it. The worst I've read was the girl in the coffin under the bed.\n\nSometimes when I have nothing to ask for while praying,I pray that anybody anywhere who's being enslaved, please let them escape :(",
            "score": 3,
            "author": "yuklz"
        },
        {
            "level": 0,
            "comment": "It’s not a “crack in the wall,” it’s a /window/ :-(",
            "score": 3,
            "author": "scarstarify"
        },
        {
            "level": 0,
            "comment": "This deserves all the gold, so emotional ;;",
            "score": 5,
            "author": "Ajfelis"
        },
        {
            "level": 0,
            "comment": "Heart thumper right here",
            "score": 2,
            "author": "RedProtoman"
        },
        {
            "level": 0,
            "comment": "When did this happen and is there anything that can be done to help catch Ryan Morehouse",
            "score": 2,
            "author": "Wajirock"
        },
        {
            "level": 0,
            "comment": "Stop it. You’re crying. ",
            "score": 2,
            "author": "potternerd89"
        },
        {
            "level": 0,
            "comment": "I love this story 💗 ",
            "score": 2,
            "author": "Alienela"
        },
        {
            "level": 0,
            "comment": "Nice.",
            "score": 2,
            "author": "natsu98k"
        },
        {
            "level": 0,
            "comment": "I love her bravery, but still keep your eyes out for the guy! Do not put her brave final act in vain! ",
            "score": 2,
            "author": "kichapi"
        },
        {
            "level": 0,
            "comment": "How'd she hear the turtles name from there",
            "score": 2,
            "author": "TristyThrowaway"
        },
        {
            "level": 0,
            "comment": "This made me tear up.  I hope she makes it.",
            "score": 2,
            "author": "AstroxPhysicsxGirl"
        },
        {
            "level": 0,
            "comment": "Silly me thought this was a very unusual unsentletters post until I got to the end. ",
            "score": 2,
            "author": "whaaaaaaatisthis"
        },
        {
            "level": 0,
            "comment": "Gave me chills. Beautiful but sad.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "My heart weeps omg :(",
            "score": 2,
            "author": "sassypixelgirl"
        },
        {
            "level": 0,
            "comment": "This actually really got me",
            "score": 2,
            "author": "bdpeezy"
        },
        {
            "level": 0,
            "comment": "This gave me chills and reminds me of the book \"living dead girl\" . Stores like these  make my feels happens and let me know I have  empathy.... damnit",
            "score": 2,
            "author": "Alic3_in_zombi3land"
        },
        {
            "level": 0,
            "comment": "I didn't expect to actually cry. You changed that. Thank you, and well done!",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I loved this story! It made my chest tight because that's a real horror and I've seen how manipulative people can be. I'm so happy she had the crack ",
            "score": 2,
            "author": "jflo_flosquared"
        },
        {
            "level": 0,
            "comment": "The last sentence made me teared up..",
            "score": 2,
            "author": "ykclby"
        },
        {
            "level": 0,
            "comment": "/u/misustree",
            "score": 2,
            "author": "MistahTree"
        },
        {
            "level": 0,
            "comment": "This is amazing. Talk about selflessness. This warmed my heart... sacrificing herself for your daughter. ",
            "score": 2,
            "author": "Knelie"
        },
        {
            "level": 0,
            "comment": "I hope she made it out or at the very least, finally earned her long-awaited rest. I hope Ryan didn't get to her and isn't torturing her. ",
            "score": 2,
            "author": "pe4cebeuponyou",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope that monster burns in hell for eternity.",
                    "score": 4,
                    "author": "Remarqueable"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Incredible.",
            "score": 2,
            "author": "Podzilla07"
        },
        {
            "level": 0,
            "comment": "Wait is this true ??? Holly crap\n\n\nEdit:Nvm damn this was awesome ",
            "score": 2,
            "author": "General_Zarroff"
        },
        {
            "level": 0,
            "comment": "For the first time since being here, I was actually very moved. ",
            "score": 2,
            "author": "waterbury01"
        },
        {
            "level": 0,
            "comment": "Remind me!",
            "score": 2,
            "author": "OhNoImAnOreo"
        },
        {
            "level": 0,
            "comment": "Please. I must have a sequel. I need closure. ",
            "score": 2,
            "author": "Blarrgatron"
        },
        {
            "level": 0,
            "comment": "I want to say thank you to the Redditor, whose username I don’t know, for sharing this link with me.  &lt;3 You were right. ",
            "score": 2,
            "author": "5hrs4hrs3hrs2hrs1mor"
        },
        {
            "level": 0,
            "comment": "This girl is incredibly strong\\-minded and loving,  and she is the type of people that have the light that could restore faith in humanity.",
            "score": 2,
            "author": "Cahpoewn"
        },
        {
            "level": 0,
            "comment": "My god that was beautiful\n",
            "score": 2,
            "author": "tinason3"
        },
        {
            "level": 0,
            "comment": "I just got, like, 5 consecutive waves of goosebumps. Love this story. Terrifying and heartwarming.",
            "score": 2,
            "author": "iDirtyDianaX"
        },
        {
            "level": 0,
            "comment": "I guessed it was someone who was either a kidnapped person, or a person who is planning to kidnap someone as soon as she mentioned the “*window*”, but damn is that a good story still.",
            "score": 2,
            "author": "PleaseLeave980"
        },
        {
            "level": 0,
            "comment": "Why just run? Why not ring doorbells and scream for help? Why be a martyr?",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "She was resigned to her fate. She did state in the letter that she was ready to leave the world. Her intention was to warn and save the girl not save herself.",
                    "score": 10,
                    "author": "sassypixelgirl"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mom?",
            "score": 2,
            "author": "ArcticWaffle357"
        },
        {
            "level": 0,
            "comment": "How could she see everything? Every moments of your life, that’s a bit off.",
            "score": 2,
            "author": "fakemuseum"
        },
        {
            "level": 0,
            "comment": "I will definitely ponder over this while in my bed... why could Ryan not escape earlier? how did Ryan not notice a stranger going past and scream for help?\nHowever this is an amazing story and made my morning. Thank you.",
            "score": 1,
            "author": "Forester-lol",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ryan is the kidnapper; the prisoner is the girl who wrote the letter, she never gives her name. :) I'm assuming she didn't scream because she figured Ryan would kill her before anyone got to her. ",
                    "score": 21,
                    "author": "slinky4444",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Right, thanks for that clarification. Peace.",
                            "score": 11,
                            "author": "Forester-lol"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "15 when she was first raped? thats fxckkedddd",
            "score": 3,
            "author": "Legacy_Ranga"
        }
    ]
}