{
    "id": "btkvkl",
    "score": 13953,
    "title": "My job is watching a woman trapped in a room. Part Four.",
    "author": "Verastahl",
    "date": 1558956315.0,
    "url": "https://www.reddit.com/r/nosleep/comments/btkvkl",
    "media_urls": [],
    "other_urls": [
        "https://redd.it/brco33)",
        "https://redd.it/brsj8v)",
        "https://redd.it/bsg2az)",
        "https://redd.it/9ndww5)",
        "https://redd.it/bue2kk)"
    ],
    "postText": "[Part One](https://redd.it/brco33)\n****\n[Part Two](https://redd.it/brsj8v)\n****\n[Part Three](https://redd.it/bsg2az)\n****\n\n\n\nI had to do something, and I had to do it right now.  If Melanie was somehow a fake, that meant they must have sent her.  And if they sent her, that meant they knew.  They knew about the messages in her painting.  They knew about me asking questions.  And they knew I didn’t hit a button during any of it.\n\nI felt panic and fear crawling up my chest, making it hard to breathe.  Standing up, I started pacing, periodically glancing back at the monitor to see if Rachel could help me, tell me what I needed to do next.  But she had laid down on her bed.  It was hard to tell for sure with her back to the camera, but I think she was crying.\n\nNo, I needed to fix this.  Get her out of there.  And if I didn’t have a better plan, I’d just have to go with the one I already had.  \n\nFeeling the hard eye of the ceiling camera on me, I went to the door and stepped back into the locker room.  My phone was in my locker, and after messing up the combination the first time, I got the door open and got it out.  Gripping it tightly, I tried to hold it by my side casually, but I knew there was little point.  If they knew everything, I wasn’t going to be able to hide anything.  I just had to try and be fast, get some kind of message out to people that could help Rachel before they got to me.\n\nI opened the camera on the phone as I re-entered the surveillance room and hit record.  It made a small beeping noise and once I was sure it was recording, I turned the camera on myself.\n\n“My name…my name is Tommy.  Thomas Calhoun.  And my job is watching a woman trapped in a room.  This is not a joke or a movie or…whatever.  This is real.  For three years my job is to sit in this room…”  I moved the camera slowly around the room, taking in the door to the bathroom, the water cooler, the desk with the monitors, keyboard, and button box, “…and watch a video feed of a woman locked up in a bedroom somewhere.”  I stepped closer to the desk and made sure the monitor showing Rachel was clear and in focus.  “I didn’t know this woman was a prisoner at first…or I tricked myself into thinking she wasn’t because the money was good.  Either way, I know she is now.  She is in danger and so am I.”\n\nAfter lingering on video of her for a few more seconds to make sure every detail could be seen, I turned the camera back on myself.  I had to hurry, or the video might be too big to send quickly.  I was trying to stay calm, but I felt myself tearing up as I went on, and I did my best to keep my words clear.  “Please help her.  I don’t know where she is.  I don’t know who has her, because I don’t know who I really work for.  But they are bad people and she is not safe.”\n\n“All I know is that I work at a building at [redacted] right outside of San Antonio.  (Per Nosleep rules, to be clear this address is not real.) I only know the names of two other people connected to this place.  The man who hired me, Mr. Solomon.  And a man who might have a job like mine…Charlie Jeffers…no, Jefferies I think.  I don’t know if they are real people…I mean, I don’t know if that is their real names.  Please.  I’m not crazy.  I know how this sounds.  Just come here, see the room.  Figure out where she is and help her.  And…”\n\nI heard the muffled sound of the outer door opening into the locker room and I frantically fumbled with the phone to stop the recording.  How do I send?  Oh no, how do I…there it is.  I hit the button to share, and felt a new panic rising.  Who should I send it to?  I had only a handful of contacts, and I just selected them all.  Maybe at least one of them would take it seriously and get help.  As I heard the door to the surveillance room opening behind me, I hit send.\n\n**Not connected to data service or WiFi.  Please send again when connected.**\n\n*What?  No no no no…*\n\nI turned to see Mr. Solomon entering the room.  He was flanked by two large men in dark suits that looked like bodyguards or something.  Raising a finger, he wagged it at me.  \n\n“No service in here, Thomas.  But then you should never need service in here, so long as you followed the rules.”\n\n****\n\nThey took me easily.  I tried to make it to the bathroom and close the door, but the two guards stopped me and pulled me down.  They put the…what do you call them?  Zipties on my hands and feet and pulled a black bag over my head.  Then I was being carried out of the room and it felt like they must have put me in the back of a van that was pulled right up to the building.  I was laying on what felt like thin, weird smelling carpet that covered a hard metal layer underneath.\n\nI heard someone get into the van with me, and I asked where we were going.  If they would just take me and let Rachel go.  There was a short laugh overhead and then Mr. Solomon’s voice as he told me that he would explain everything when we got where we were going.  For now, he said, I needed to relax.  It was a long drive and I would need the rest.  \n\nI went to say more, but then I felt a sharp pain in my neck.  They had stabbed me, or…no, they injected me with something.  I was feeling so strange now, but I had to stay awake.  I had to try and get away, I had to…\n\n****\n\n“Hello again, Thomas.”\n\nI blinked as I began looking around.  My mouth was dry and my head hurt, but otherwise I felt okay.  I wasn’t tied up any more--Instead I was laying back on a padded table like I’d seen when I went to the doctor.\n\nBut this wasn’t a doctor’s office.  The room was large, and aside from the padded table, it held a small bed, a desk with a computer monitor on it, and a couple of chairs.  Sitting in one of those chairs was Mr. Solomon.\n\nI raised up slowly, blinking at him.  “Where is she?  Is Rachel okay?”\n\nThe man smiled.  “You really are something, Thomas.  Trying to be the hero, even if you don’t quite know how.  I respect that.”  Licking his lips, he leaned forward slightly.  “In fact, I respect that so much that I’ve decided to start our new relationship with as much honesty as I’m allowed.  Some of my colleagues disagree with this approach, but you know what?  Fuck them.  This is my project, and I think you deserve to know what’s going on.”  Looking more serious, he stood up, lifting the gun he had been holding casually in his lap.  “But before we get into the details, would you like to see Rachel?”\n\nI slid off the table and nodded as I caught myself from falling.  My legs were still wobbly from whatever they had given me, but I barely noticed.  “Yes, please.  Let me see her.  The real her.”\n\nMr. Solomon gave a small laugh and gestured toward a nearby door.  “Yes, reality is always best.  She’s just there in the next room.”  \n\nI stumbled my way forward, my legs getting better as I walked, and when I grabbed the doorknob, it turned easily.  I expected the door to lead to her bedroom, but instead it opened into another room a lot like the one I had been in, though the stuff in it was different.  Strange machines filled the walls, and in the back of the room was a large…aquarium?  I didn’t know.  It was a big cylinder taller than I was, and it was filled with some kind of gray liquid.   There was a shape in that liquid,\n\n“Go ahead, Thomas.  Feel free to go have a good look.  You’ve earned it.”  I felt my stomach clenching tighter at Mr. Solomon’s words and the meanness in them.  My legs felt heavy again now, but it wasn’t from the drugs this time.\n\nShuffling forward, I could see the shape was a person.  *Oh no*  Or at least a body, because it was clear from just looking at it that the person was dead.  It was very well-preserved, but I could see how the skin hung wrong and looked bloated in spots.  *Oh God, no no no*  Its hair, which had been floating like seaweed in front of its face, drifted away as I reached the glass, and I could see Rachel staring out at me.\n\n“Murderer!”  I turned on Solomon and started to run toward him when he shot me.  Suddenly I was on the ground convulsing as he stepped closer.\n\n“Don’t worry, Thomas.  It won’t kill you.  Just make you unable to move much for a bit.”  I heard more footfalls as my body began to still.  “Get him up, take him back to the other room.”\n\nI could barely feel anything as I was carried back to the padded table and propped up into a sitting position.  This time I was strapped down, but I guessed it was more so I didn’t fall off, because I couldn’t move anything other than my head, and even that just a little.  I could hardly see at all for crying, but I recognized the blurry shape of Solomon sitting back down in front of me.\n\n“Before you ask…well, when you are able to ask anything again, yes, that is Rachel.  Not a fake Rachel, not a dummy, and not some kind of trick.  As I said, the time for tricks is past.  Now is the time for truth.”\n\nFrowning slightly, he went on.  “Thomas, I understand that showing you that, showing you her body that way, might seem very cruel.  You may hate me for it right now.  I would understand it if you did.  But you called me a murderer, and at least in this specific context, I think that is unfair, because I didn’t kill Rachel.  In truth, I’ve been with this aspect of the project for only seven years.”\n\nHe gestured back to the door behind him.  “And Rachel has been dead for over eight.”\n\nI felt my eyes widen as though they belonged to someone else’s body.  It was more lies.  More tricks.  All of it.  Oh God, it had to be.\n\n“Do you know what remote viewing is?”  He rolled his eyes.  “Sorry, right, you can’t talk right now.  I’ll just assume you don’t.  Remote viewing is a broad term for the ability to see things that are far away from you physically, to know things you shouldn’t be able to know through your normal five senses.  Some describe it as a psychic ability, though there are several schools of thought as to how and why it works.”\n\nHis eyes fixed on mine intently.  “Because it does work, Thomas.  Various governments and private organizations have studied it for a very long time, and while publicly it is always ridiculed as pseudoscience and foolish superstition, the reality is that some people have the innate ability…that means it comes naturally…to somehow see other places.”\n\n“Rachel was one of those people.  She came into the program when she was seventeen, having been identified via a front-facing screening process that was ran as a psychological test that paid subjects well at a time when Rachel was looking to make some money.  Three months after being identified as a good candidate, she was taken, and after the initial adjustment period, she became a largely compliant asset that quickly rose to the top of our talent pool.”\n\nSolomon folded his hands on his knee.  “I know you cared for her, Thomas, so I think this is worth sharing.  Rachel was never treated badly, other than her confinement and the occasional test that was mildly unpleasant.  No, we all treasured her.  She was enormously talented, not just as a remote viewer, but as an artist.  That’s how she would convey what she saw, you understand.  She would enter into an almost trancelike state when she painted, and when she was done, she would have given us a painting of images and words that provided…well, it was very valuable information.”  He chuckled.  “If you ever wondered, that’s why there was always such care that the paintings were never shown to the camera.”\n\nPicking at his pants, he went on.  “Rachel was so talented, that she was selected for a new program that we thought might greatly enhance or alter her ability.  We introduced something…foreign…into her body.  At first, nothing seemed to change.  If anything, the accuracy of her remote viewing was declining, which was a problem for us and for her.”\n\n“But then we realized that we were reading the new paintings wrong.  She was able to see more clearly than ever--she just was no longer bound to only current events.  Now her sight transcended time.”  He paused, and I realized he was enjoying telling the story.  The bastard was having a good time, pausing to make it more dramatic.  I would fucking kill him.  “While this made some of her paintings less immediately useful, they became much more valuable as we were able to decipher them.  For a time, it looked as though everything was working better than we had ever hoped.”\n\nHis lips thinned.  “And then, one day, she showed a painting to the camera.”\n\n“It said, ‘Please help me Thomas’.  This immediately sent up all kinds of red flags.  She knew not to show paintings to the camera, and now she was trying to communicate with someone?  We didn’t disrupt her routine, but an intensive investigation began into who she was talking to.  Was it one of her handlers?  One of the technicians?  Someone from her past life?  But nothing checked out.”\n\nLeaning back in his chair, a look of pride grew on Solomon’s face as he continued.  “I was the one that first suggested the idea that she was, intentionally or not, knowingly or not, seeing and talking to someone in the future.  I was still an outside consultant at the time, but by that point we had more strange behaviors from her, including the second message painting, ‘That girl isn’t me’.  My theory made some sense, but it very quickly ran into a greater obstacle.”\n\n“The introduction of the foreign material had not been as seamless as we had hoped, despite her having been stable for almost three years since it was implanted.  Whether it was due to her increasing emotional upset and stress, or simply the passage of time, she suddenly began to deteriorate.  Her work became more erratic and hard to understand as her body began to decline.  We were monitoring her health closely, but it didn’t matter.  Five days after she painted ‘That girl isn’t me’, she suddenly went into cardiac arrest and died.  Somewhat inexplicably, we were unable to resuscitate her.”\n\nThe man sighed.  “This was a great loss.  And it required adjustments of my theory.  Based on everything we knew, it still made sense that she was talking to someone.  Someone with access to the camera feed, and very likely someone named Thomas.  If Thomas was viewing that camera footage in the future, as I believed, then he must be working for us in the future.”  He gave me a thin smile.  “And whether you believe that the future is set in stone or not, I’m all for giving it a helping hand.”\n\n“Seven years ago I began the Thomas Project.  Over the course of that time I have overseen the screening and hiring of forty-three men named Thomas at several different sites, all with one very specific job.  To watch the videos of Rachel from just before her implant to the time of her death.”\n\nI tried to speak, but my mouth still wouldn’t work.  I wanted to say he was lying, that it didn’t make sense, that it *was* another trick…but I think I wanted to hear it more for myself.  Because I didn’t think he was lying.  I didn’t think it was a trick.  And I thought I was starting to understand.\n\n“The point wasn’t really them watching the videos, of course.  It was how they *reacted* to watching the videos.  What they did, and how that matched up with what Rachel had done in response in the past.”\n\n“Thirteen percent quit after the first day.  Thirty-eight percent hit either the red or the green button after the first message asking for help and saying their name.  Twenty-two percent attempted to contact the authorities before reaching the stage where ‘Melanie’ was introduced.”  He shook his head slightly.  “I wish I could take credit for her introduction, but it wasn’t my suggestion.  We assumed from the ‘that girl isn’t me’ message that there was a double of Rachel introduced to you at some point, perhaps to kill you or dissuade you or find out what you knew.  But it took a few tries until we felt it was well-refined, and as I’ve pointed out, only twenty-seven percent made it that far.  And all of them failed the next test.”  He pointed at me.\n\n“Her name.”\n\n“You see, the girl you’ve been watching, that talented, wonderful girl whose body is preserved in the next room?  Her name was Rachel Donovan.  I had always wondered if Rachel was merely seeing you, or if there was some kind of connection between the two of you.  When you called ‘Melanie’ Rachel, I knew that we had finally found the right Thomas--the distant point of light that our Rachel was looking at across space and time.”\n\nI swallowed thickly and found I could feel my tongue, if only a little.  Slurring badly, I pushed out a single word.\n\n“W-why?”\n\nSolomon looked surprised.  “I’d have thought that’d be clear by now.  You’re our only remaining link to one of our greatest treasures.  Perhaps you have a similar ability, or it may be that she forged the link purely though her own talent and will.  But either way, you are important and you have more work to do.”  He stood up and moved over to the table where he turned on the monitor.  As it came to life, I saw it was a frozen image of Rachel’s room--a tape paused where I had left off watching.  Turning back to me, the man looked solemn.\n\n[“You have to watch the rest of it.  Because Rachel painted you more pictures before she died, and we have to know what they mean.”](https://redd.it/9ndww5)\n\n**** \n\n[Final Part](https://redd.it/bue2kk)",
    "comments": [
        {
            "level": 0,
            "comment": "It looks like there may be more to this story. Click [here](https://www.reddit.com/message/compose/?to=UpdateMeBot&amp;subject=Subscribe&amp;message=SubscribeMe%21%20%2Fr%2Fnosleep%20%2Fu%2FVerastahl) to get a reminder to check back later. Got issues? Click [here](https://www.reddit.com/r/nosleep/wiki/nosleepautobot). Comment replies will be ignored by me.",
            "score": 1,
            "author": "NoSleepAutoBot",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2630,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; I literally saw none of this coming.\n\nRachel did.",
                    "score": 2351,
                    "author": "trippy_grapes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And yet she still died.",
                            "score": 438,
                            "author": "JoseMari117",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s like the time-honored question, “If they were really psychic, why didn’t they stop their own death?” Or not ever winning the lotto. 😯",
                                    "score": 124,
                                    "author": "MurseWoods",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "she had an implant; she probably couldn't do anything about it at that point, and she wasn't psychic until they put the thing in.",
                                            "score": 49,
                                            "author": "niamh73",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "She was psychic, that's why they enrolled her in the program. The implant's function was to make her abilities better.",
                                                    "score": 26,
                                                    "author": "1_camellia_3"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm binging the top posts of all time and this combined with the top post with the Alzheimers is reminding me a lot of the character Robin from Agents of S.H.I.E.L.D.",
                            "score": 21,
                            "author": "your_mind_aches",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Three years later, and doing literally the exact same thing while being reminded of the exact same character. Are you a psychic as well?",
                                    "score": 2,
                                    "author": "Tribe_Vivek"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Subverted expectations...but in a good way.",
                    "score": 121,
                    "author": "spencer5centreddit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ha! Throwing shade at D&amp;D. Nice.",
                            "score": 74,
                            "author": "orionpaper"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Omg you really had to spoil that..",
                    "score": 4,
                    "author": "Weary-Grapefruit3364"
                }
            ]
        },
        {
            "level": 0,
            "comment": "...I somehow get the feeling that Mr Solomon is manipulating the timeline of the videos. Like, what if Rachel's \"that girl isn't me\" painting was actually referring to the body in the cylinder, and not Melanie?",
            "score": 691,
            "author": "onepunchsans",
            "replies": [
                {
                    "level": 1,
                    "comment": "Remember how he say that she died right after showing that message.  \nBut then he also say that message came 5 days after the help me thomas. And that there was plenty of message to show still?  \nHe definitly jumped from Help me thomas to This girl isn't me and skipped 5 days in between.",
                    "score": 186,
                    "author": "Zorops",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Remember how he say that she died right after showing that message.\n\nWhere did he say that? I can only find\n\n&gt;Five days after she painted ‘That girl isn’t me’, she suddenly went into cardiac arrest and died.",
                            "score": 71,
                            "author": "teddim",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ok i miss read. She died 5 days after writing the that girl isn't me thing. But she went in cardiac arrest so she was like in a coma i presume and unable to make new painting so the other stuff must have been made before.",
                                    "score": 20,
                                    "author": "Zorops",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think you might still be misunderstanding. She painted \"That girl isn't me,\" then five more days happened, during which time she made more paintings, then she had a sudden heart attack which killed her.",
                                            "score": 55,
                                            "author": "CornSama"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "She didn't die after showing the message, check again",
                            "score": 16,
                            "author": "Madermc"
                        },
                        {
                            "level": 2,
                            "comment": "So they want to show him the rest of the feed because they are too erratic for them to decipher or to cause it to flush out some information he unknowingly has, that is valuable to them or perhaps to light up the remote viewing abilities probably dormant in him?",
                            "score": 5,
                            "author": "D3STRON"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think Solomon is telling the truth about Rachel's gift but maybe her message of \"that girl isn't me\" is referring to the body Solomon showed you. It seems strange that she would warn you about a test that Solomon would eventually tell you about. The real Rachel might be alive.",
            "score": 1896,
            "author": "TrendNation55",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same dude. I feel like Solomon is saying the truth here.",
                    "score": 369,
                    "author": "Mouseinanutshell"
                },
                {
                    "level": 1,
                    "comment": "That would be a major twist! It would completely change everything... But why does Solomon want to deceive OP about Rachel's death? And, if we truly think about it, why would she know she would ask for help in the future? If her paintings were of the future, then that means she knew she would need help in the future - Meaning she might still be alive, or that her consciousness hasn't completely perished. Either way, OP, once you're able to move, you have to keep us updated!",
                    "score": 245,
                    "author": "KvotheTheMaedre",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If she's \"dead\", OP will stop trying to help her, and they can keep her longer and do more experiments. Simple misdirection. Now they are exploiting OP's bond to her in hopes that he complies with their demands.",
                            "score": 134,
                            "author": "shiveringsongs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But  what's the point on keeping OP alive then, isn't it easier to just get someone else or what?",
                                    "score": 17,
                                    "author": "Madermc",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Because nobody else has come this far. If this is still a government psychological experiment, he's their best subject yet.",
                                            "score": 36,
                                            "author": "Vintomer"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It could be a case of a prophecy causing itself. In other words, if it hadn’t been written that “that girl isn’t me” then Solomon wouldn’t have felt the need to add that test with Melanie to fit with that timeline.",
                    "score": 63,
                    "author": "Cringylord420"
                },
                {
                    "level": 1,
                    "comment": "This makes a lot of sense. \n\nAlso, Solomon is a complete nutcase. This is unraveling some serious info and I believe OP might need Rachel's help. If she is indeed alive.",
                    "score": 12,
                    "author": "spinachcakes"
                },
                {
                    "level": 1,
                    "comment": "I agree Solomon is saying the truth.\n\nI don't think Rachel is alive anymore, the substance is indeed most likely was too much for her physically.\nHowever, I do believe that Thomas and Rachel will communicate through some spiritual means. Or maybe Thomas is Rachel's male doppelganger?\nOr maybe at the end Solomon will say: April Fools Day?\n\nYeah... Great Crazy story!",
                    "score": 33,
                    "author": "Camarila"
                },
                {
                    "level": 1,
                    "comment": "I very much agree with this. Her warning future OP must have had more meaning.",
                    "score": 10,
                    "author": "Relaxel"
                },
                {
                    "level": 1,
                    "comment": "What if....\n\nThomas is part of the Teddy and Cora universe and \"Melanie\" is actually \"Rachel\" brought back, except...maybe her doll wasn't right or something and \"Melanie\" doesn't have \"Rachel\"'s ability...\n\nI don't have a theory for the rest.",
                    "score": 6,
                    "author": "ambthab"
                },
                {
                    "level": 1,
                    "comment": "Maybe, but who was this girl he spoke too that looked like her. Even if the girl in the tank was the original girl they could be cloning her, Melanie girl could be a clone and the Rachel in the video could be another clone who actually is talking to him. Then yes the girl in the tank is just being preserved for DNA for their clones ad experiments. I new the minute she was in the tank she didn't just die, because  in only a about an hours time they body wouldn't b bloated like that. So he is either telling the truth or partly the truth. I feel like clones mak the most sense. If Rachel had some kind of twin, she would be 8 years older than the Rachel in the video if the video were 8 years old, but how else would they geta copy of Rachel for this melanie character? If they had clones they could name them whatever and probably talk them into something. Or the girl in the video is the original and the body in the tank is a first version of a clone that died and melanie is a version that came out right and they are still keeping the Original hostage.\n\nOP can't just trust this guy. He can pretend, but he can't just trust him now.",
                    "score": 3,
                    "author": "MolotovCockteaze"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was right about one thing. Thomas you are going to be working there. Most likely in captivity. RIP Rachel.",
            "score": 41,
            "author": "twiztidmeme"
        },
        {
            "level": 0,
            "comment": "So it’s just looped video feed... wow! That’s insane and definitely out of the box. Stay safe Thomas, if you’re not gone already and this isn’t Mr. Solomon posting. Can’t wait for the next part, this is one of the few stories I’ve followed closely for a while that’s really engaged me.",
            "score": 179,
            "author": "Demou",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 76,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, there is only 5 days left of recordings. Mr Solomon mentioned hat she died of cardiac arrest 5 days after she painted the \"that girl wasn't me\" paintings",
                            "score": 91,
                            "author": "MyronBlayze"
                        },
                        {
                            "level": 2,
                            "comment": "*5 days, I believe",
                            "score": 9,
                            "author": "SleeplessLilac"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t know what to think anymore. Is she dead, is she alive or is she real? Who is Melanie? I can’t wait for part 5.",
            "score": 25,
            "author": "ghostesscoffee",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s up",
                    "score": 2,
                    "author": "ThunberStorm",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd been pretty sure that remote viewing was the point of the experiment, but the temporal aspect definitely was a surprise. Given the number of Thomases they've recruited over the years, they should suspect that someone along the line would make a lucky guess at the name. Really, they should have suspected that 'Thomas' was another remote viewer rather than going through the whole business with the cameras. It's also strange that they kept the paintings from view if they didn't know they'd be showing the footage to randos named Thomas, though security people probably shouldn't see sensitive information either, generally.\n\nJust saying, the guy might be full of shit. Maybe that dead girl isn't Rachel.",
            "score": 15,
            "author": "Zero132132"
        },
        {
            "level": 0,
            "comment": "I'm wondering why Rachel is being kept preserved in a tank\nMaybe they think you can help bring her back to life?",
            "score": 16,
            "author": "Stupid_Rock",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or her consciousness is still alive.",
                    "score": 7,
                    "author": "Vortex618"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hmm... So Rachel did not have sort of clairvoyance after all. I always thought that guess was far-fetched, but this post has been full of surprises. How did you correctly guess that her name was Rachel? What could those further paintings indicate? OP... You have to be very careful. If what Solomon is telling you is true, than perhaps you can see the future as well? Which means you're destined for a life of coerced servitude... I would recommend getting out of there as fast as possible, Thomas.",
            "score": 51,
            "author": "KvotheTheMaedre",
            "replies": [
                {
                    "level": 1,
                    "comment": "She did though.",
                    "score": 23,
                    "author": "AlmostUnder",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sorry about that! I typed that up on mobile. I meant she did have a form of clairvoyance.",
                            "score": 14,
                            "author": "KvotheTheMaedre",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No worries!",
                                    "score": 6,
                                    "author": "AlmostUnder"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 48,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "The whole plot of this is insane,  but,  i want too know how they somehow figured out that she was seeing the future and she wasnt just crazy,  considering her gift",
            "score": 8,
            "author": "wondermanthesecond"
        },
        {
            "level": 0,
            "comment": "How could solomon suggest a theory for the \"help me thomas\" painting if he only started working 1 year after she died?",
            "score": 9,
            "author": "theproblemdoctor",
            "replies": [
                {
                    "level": 1,
                    "comment": "He started working \"this aspect\" of the project after she died. He may have been working on the same project in a different way before.",
                    "score": 17,
                    "author": "Mrs_carroll"
                },
                {
                    "level": 1,
                    "comment": "He was an \"outside consultant\" then",
                    "score": 3,
                    "author": "Bulbasaur2000"
                },
                {
                    "level": 1,
                    "comment": "Either they brought him onto the project and filled him in, or he was an outside consultant that didn't officially work for them yet.",
                    "score": 2,
                    "author": "conundorum"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If Mr. Solomon exclusively used people named Thomas then Charlie Jefferies has to be an actor. Has Jefferies had similar experiences with other Thomases? He must of right!",
            "score": 18,
            "author": "Clarksonforcaptain"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 7,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 7,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I believe Solomon because what's the point of hiring Thomas when Rachel is still alive? I believe that Rachel really is dead.",
            "score": 5,
            "author": "laixodarap"
        },
        {
            "level": 0,
            "comment": "I feel like Solomon is telling the truth, but isn't it his job to be a master manipulator? Creating all these lies and tricks for so many men before does not make me think OP should trust him. I feel like I've come to love Thomas Calhoun over these past few installations, I just don't want to see anything bad happen to him.",
            "score": 5,
            "author": "TheMightyCloud"
        },
        {
            "level": 0,
            "comment": "This ain't good for my blood pressure. I can't stress this enough, how you need to hurry and update your story. \nStay safe, Thomas!",
            "score": 4,
            "author": "Beltsezar"
        },
        {
            "level": 0,
            "comment": "I have a feeling that her final painting is some sort of transfer of power. Giving you hers or maybe using one of her abilities to unlock yours? There had to be a reason she saw you.",
            "score": 3,
            "author": "Boonski705"
        },
        {
            "level": 0,
            "comment": "If you don't want to end up like Rachel, assuming that's her in the cylinder, you better not be too good at deciphering those pictures.",
            "score": 4,
            "author": "dotlurk"
        },
        {
            "level": 0,
            "comment": "My mouth dropped open when he named her!",
            "score": 5,
            "author": "Whisper292"
        },
        {
            "level": 0,
            "comment": "I'm getting real creeped out here..",
            "score": 4,
            "author": "RachelRad25"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "When reading Solomon in my head I picture his voice like that of Stanley Tucci. Similar to his role in the Hunger Games, (the serious moments).",
            "score": 3,
            "author": "Mars_Black"
        },
        {
            "level": 0,
            "comment": "Whoa man! Awesome! What a twist! I assumed Rachel had some kind of seeing from another place ability but I didn't think it was through time. Wonder what is that \"foreign\" thing...",
            "score": 3,
            "author": "WRZESZCZ_1998"
        },
        {
            "level": 0,
            "comment": "Didn't see that coming at all. One thing I'm unclear on is he says she died 8 years ago and he started 7 years ago, implying she died before he started there. But he also talks about her as if he knew her and was part of the experiment. \n\n\nI'm almost certain the that isn't me message was for the dead girl, because the actress was an after manipulation.",
            "score": 3,
            "author": "dman722"
        },
        {
            "level": 0,
            "comment": "I’m convinced that 1) the paintings Rachel has made (that Thomas saw) will come into play, and 2) there is something happening inside of Thomas’s head. \nI’ll need to read the first few parts again but I remember OP describing 4 of the paintings— the ones with words on them— that he could see. I’m not sure how, but I bet those locations (the movie theatre particularly stuck out to me) will become prominent. \nAlso, sure, OP is a bit absent minded. But it might be leading to something. Again I have no idea what because I don’t have the mental capacity or the time to research what absent-mindedness could be a symptom of, but OP’s narration gives a lot of character detail- ie he often jumps to conclusions (RE: they stabbed me, no, injected me...) and it could very easily be grounds for a mental illness. This is a hunch but Solomon may use Thomas’s ‘illness’ against him like when Thomas attempts to call the police. \nOr OP’s personality could be a symptom of whatever power he has that Solomon wanted.",
            "score": 6,
            "author": "minimum-cinnamon",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm very curious about this as well! I've noticed that Thomas is often struggling to think of a specific word, which ends up being a very common word. I'm sure there will be significance to this.",
                    "score": 3,
                    "author": "lana-deltron-rey"
                }
            ]
        },
        {
            "level": 0,
            "comment": "oh damn. that was unexpected",
            "score": 2,
            "author": "joanagget"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "SPR seems a little more aggressive than i thought",
            "score": 2,
            "author": "gherks1"
        },
        {
            "level": 0,
            "comment": "So Solomon has been with the project for 7 years.\n\nRachel has been dead for 8 years...\n\n.\n\nBut Solomon was the one who thought she was messaging the future when she was still alive...",
            "score": 2,
            "author": "golem501",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That (Per Nosleep rules) sentence had me laughing out of the good story, but really really great work OP!",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is soooo fucking good the two stories rise up  together and this is amazing you have a gift keep writing you could make a book from your stories!!",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "You really should have quit when you had the chance",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "The second you were going for your phone I knew he would be in big trouble. Was not expecting it to turn out the way it did but them seeing you run toward the locker room from the camera was a huge red flag. I hope you're okay.",
            "score": 1,
            "author": "cheypeee"
        },
        {
            "level": 0,
            "comment": "While reading soloman’s lines idk why but I read it as a mafia boss ascent in my head lmao",
            "score": 1,
            "author": "Wethenorth25"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "good stuff good stuff keep them coming please.\n\non the other hand, i think Rachel knew that by painting these pictures solomon will try to find thomas and provide a body double in order for them to reach that stage, its rachel who have seen the future and by knowing what solomon will do she painted all these pictures and Thomas is yet to act according to rachel vision.",
            "score": 1,
            "author": "HusseinR"
        },
        {
            "level": 0,
            "comment": "They inserted something in her to make her \"better\". A seed perhaps?!?",
            "score": 1,
            "author": "howtochoose"
        },
        {
            "level": 0,
            "comment": "Yup, I thought the guys who hired him would be immoral fucks.",
            "score": 1,
            "author": "CharaNalaar"
        },
        {
            "level": 0,
            "comment": "Look, though, Rachel isn't a particularly uncommon name. At some point, it's entirely possible that a Thomas would just have mused the name Rachel!",
            "score": 1,
            "author": "elwynbrooks"
        },
        {
            "level": 0,
            "comment": "Wait, if Thomas thought he was watching live camera feed of Rachel that whole time, wouldn't he look for the time stamp? Most surveillance monitors show the exact day, hour, minute, and second of each frame, right? Couldn't he have seen that the feed was years old? Unless Solomon edited that out... But I would think that would raise more suspicion, not having solid proof of the footage's date...\n\nIdk it's late and I'm tired lol.",
            "score": 1,
            "author": "dankmemesvic"
        },
        {
            "level": 0,
            "comment": "I’m still trying to decide if this is supposed to be a perfectly logical government experiment that’s just highly confidential if not very disturbing or it’s actually something beyond logical explanation (like ghosts or spirits and that line of stuff)",
            "score": 1,
            "author": "Abliskarian"
        }
    ]
}