{
    "id": "bue2kk",
    "score": 16155,
    "title": "My job is watching a woman trapped in a room. Final Part.",
    "author": "Verastahl",
    "date": 1559133038.0,
    "url": "https://www.reddit.com/r/nosleep/comments/bue2kk",
    "media_urls": [],
    "other_urls": [
        "https://redd.it/brco33)",
        "https://redd.it/brsj8v)",
        "https://redd.it/bsg2az)",
        "https://redd.it/btkvkl)",
        "https://redd.it/8uj33q)",
        "https://redd.it/bue253)",
        "https://redd.it/cbn7uj)",
        "https://redd.it/kfvzse)"
    ],
    "postText": "[Part One](https://redd.it/brco33)\n**** \n[Part Two](https://redd.it/brsj8v)\n**** \n[Part Three](https://redd.it/bsg2az)\n**** \n[Part Four](https://redd.it/btkvkl)\n**** \n\n\nI spent the next five days watching Rachel die.\n\nFrom the outside, just watching the monitor, it didn’t seem that different than what I had been watching for the past three years.  Rachel slept, she watched T.V., she read, and she painted.  But there were signs if you were looking for them.  She seemed tired and tense, and she had taken to sleeping more.  And occasionally, just every once in a while, she would glance up at the camera—at me.  It was then that I could see the fear and sadness in her eyes.\n\nInside…well, inside I felt like a burned out house collapsing in on itself.  At first I refused to watch, to do anything they wanted me to do.  Solomon didn’t get mad at me, but just shrugged.  He said while cooperation was preferred and could go a long way toward making my stay with them more comfortable, it wasn’t required.  \n\nIf he was right, Solomon said with a thin smile, things would play out as they were meant to, regardless of what I wanted or thought I chose.  Either way, he added, the video was about to start back playing and would not stop for another five days.  Whether I wanted to spend that time getting to see her again was entirely up to me.\n\nI tried to not watch, but a part of me knew from the start I was going to.  Maybe I would find some clue that they were lying about her being dead.  Or Rachel could give me some advice or warning about what I needed to do next.  I didn’t know.  What I did know is that I couldn’t miss the chance to see her again.  And despite knowing in my heart that she was dead and everything on the video had happened a long time ago, I still felt that by watching I was with her somehow.  \n\nShe had been taken away from everything she knew when she was barely grown, trapped for years just for being special.  Experimented on.  Treated like property.  Kept from ever having friends or family or a life.  And yet through all that, she was still beautiful.  Not just on the outside, but on the inside too.  I had spent years watching her, getting to know her in a thousand tiny ways that so few people ever truly know each other.  I had seen her kindness and grace in her actions, even when she was fighting against the people holding her.  I had watched her strength when she woke up day after day in her prison and never gave up.  And I saw the beauty of her soul in her paintings, full of swirling colors and…what was the word…wonder.  She was able to paint these things she saw with such care and love, despite living in a world that had abandoned her so completely.\n\nWell I wasn’t abandoning her.  I would watch every bit of the video I could manage.  Try to burn into my memory every frame of her I saw.  Not for them and their stupid project.  But for me.  And for her.  I may not have much left to do in my life before they lock me away somewhere or kill me, but I could do this one last thing.\n\nRachel wouldn’t die alone.\n\n****\n\nI watched nearly all of it, stopping only to eat quickly and use the bathroom until the last two days.  I would ask the guards to pause it, but they would only shake their heads and say Solomon said it had to play normally until it was finished.  By the fourth day, I was in a stupor.  I had already dozed some the first three days, but when I woke up on the fourth day, I could tell a few hours had passed.  There were two trays of food on the bed, one breakfast and another lunch.  I looked back at the screen in a panic, worrying I had missed something, but Rachel seemed to be just waking up too.  I noticed her putting her hand to her stomach as she got out of bed and felt my own stomach twist.  She was already hurting.  Rachel glanced at the camera and tried to smile before moving to set up a new canvas for painting.  \n\nThis was the second of three paintings she did in those last days.  The first had been the inside of an old-fashioned movie theater from the viewpoint of someone sitting in a back row.  On the movie screen was just the image of a sledgehammer propped against a brick wall.  I didn’t understand what it meant, and I found myself scanning the picture for some message or other clue.  Eventually I found what might be one, though I didn’t understand it either.\n\nRachel must have come to understand they knew what she was doing with the paintings and didn’t want to stop her, because these last three she set up much closer to the camera.  I was still squinting and studying the painting closely when I realized the flipped up seats in the next row up had brass number plates along the front edge of the seats.  Though they were upside down from the viewpoint of the painting, the angle was good enough that once I noticed them I was able to read them.  \n\n**2…43…26…89**\n\nI didn’t understand any of it, but I committed it all to memory, focusing all my attention on the painting until she finally took it away.  Even that early on I could tell painting was taking a lot out of her now, and like I had for so long, I found myself talking to her, telling her to go rest before I remembered her body in the next room.  I almost stopped then, but no.  Maybe she couldn’t tell I was talking to her, or maybe she could.  Either way, me talking to her couldn’t hurt, and it made me feel a little less lonely and sad as I watched her.\n\nThe second painting, the one she started after I woke up from falling asleep for a few hours, was stranger than the rest.  It looked like it was in a room with curved walls made of tree roots, and in the center of the room was a little table made out of the same stuff.  Some of the roots around the room were a deep red, but other parts, including the table thing, looked burned and black.  I looked closer and saw that I could see a person’s shadow over the table—hands holding some long oval-shaped bundle.\n\nI studied it for a long time, going over it again and again in my mind after she took it away.  I couldn’t make sense of it.  Of any of it.  I wasn’t smart enough, and I was failing her.\n\nRachel slept for a long time after that painting.  Then she got up on the fifth day, her last day, and immediately started working again.  This time she was painting faster, and while I saw her wince occasionally, she never lost her look of determination as she slashed lines and colors across the canvas.  When she was done, Rachel picked up the painting and turned it toward the camera, giving me a small, tired smile as she was blocked from view.\n\nIt was looking out from the front porch of a house somewhere.  It was out in the country, and the morning view of the yard and the land beyond were wonderful, but closer-up the painting was of two hands.  Holding onto each other tightly, their interlocked fingers seemed to glow red and orange in the light of the rising sun.  I found myself crying as I looked at it.  \n\nPart of it was because I didn’t know what it meant, and I felt a growing sense of desperation at the thought that Rachel’s last works might be wasted on me.  Part was because I knew it had been five days, and I could sense I was close to the end.  To her end.\n\nBut there was something more to it than all that too.  The last painting…even with everything else in my head and my heart pulling me down…gave me hope.  Hope of what, I didn’t know.  But I started to think that maybe the only message Rachel had for me in that last painting was that somehow, somewhere, everything would be okay.\n\nOutside the edge of the painting I could see motion in the room.  People hurriedly coming in with some kind of medical equipment.  And then the monitor went black.\n\n****\n\n“You’ve done well, Thomas.  Very, very well.  For the last five days of video, we had charted one thousand and forty-seven microvariations in Rachel’s behavior that we believed might correspond to your behavior, your reactions, and your emotional states while watching the video.  Like before, the two of you remained in sync as though you were in the same room.  It really is remarkable.”\n\nI sat staring at Solomon.  I listened to what he said, but I didn’t care.  I just wanted it over.  Whatever this was, I just wanted it over.\n\nClearing his throat, he went on.  “That’s why we’ve decided to move the implant from Rachel’s body to your own.  That’s one of the many reasons we’ve preserved her so.  The foreign body was still showing signs of life all this time, but just barely, and we were afraid to attempt removal.  Our hope is that, given your connection to Rachel, it will accept you.  Perhaps even thrive in you more than it ever did our girl.”\n\nI was suddenly on my feet, and it was only the raising of Solomon’s gun that stopped me from attacking him.  “Don’t you fucking talk about her like that.  Like any of you gave a shit about her.  I’ll fucking kill you.”\n\nSolomon’s face darkened slightly as his lips thinned.  “No, you won’t.  But if idle threats make you feel better, go ahead.  It will only make things harder, not easier.”\n\nFeeling a stab of panicked fear, I sat back down.  “What is this thing you’re going to put in me?”\n\nThe man looked at me for several seconds before responding.  “I’m tempted not to tell you after your stupid—and frankly, hurtful—outburst.  But I’ll be the bigger person.”  Letting out a small sigh, he went on.  “Thomas, somewhere there is a tree.  A very special tree.  We suspect it is the same tree that Rachel painted for you that time, though we cannot say for sure, as we have never been able to find it.  It is either hidden away very well or it is able to hide itself from those it wishes.”\n\nI just looked at him, trying to kill him by just wanting it to be so.  “In any case, we have the next best thing.  An ancient clipping from the tree.  Secured at great cost and sacrifice, and studied for a long time without much success.  We have, however, in recent years been given…advice, that this clipping could be grown in the right soil.  We thought that soil was Rachel, but while it did develop further inside of her, she died before the necessary growth was finished.”\n\nLeaning forward, he smiled at me.  “We have it on fairly good authority, however, that you might succeed where she failed.”\n\n****\n\nI fought them when they came, but it didn’t matter.  I woke up some time later with a dull ache in my chest and a small, already healing scar on my upper stomach.  I didn’t really feel that different other than the little bit of pain, but I knew that would change with time.  Maybe I had more time than Rachel, or maybe I had less.  It didn’t matter.  I just…\n\n*Wait, what was that?*\n\nThere was some kind of soft voice…coming from where?  It wasn’t in the room.  It was in my head.  I felt a thrill of excitement.  Maybe this was Rachel’s voice.  She had somehow stayed in the tree thing they had put inside me?\n\nBut no.  I had never heard Rachel’s voice, but I sensed this wasn’t it.  This voice was too delicate to really be heard or understood, and it reminded me of music coming from a distant room that you felt in the back of your mind without realizing it.  It was a…a melody, a kind of song.  But it wasn’t Rachel’s song.  I realized with a shiver that it was the song of the thing inside of me.\n\nAt first I was afraid, but that didn’t last long.  It wasn’t trying to hurt me.  It was trapped here just like I was.  *But*, it started to sing, *it was time for us to be free.*\n\nI stood up and walked to the door, and as I did so, the lights went out.  The door in front of me clicked, and when I reached out and turned the knob in the dark, it opened easily.  How was this possible?  And if it could do this, why hadn’t it helped Rachel get out?  There was no answer, but there was also no time.  I could already hear boots around the corner as the glow from flashlights began to light up the far end of the hall.  \n\nThey would drag me back in there.  Chain me up or take this thing back out of me before we could get away.  If I was ever going to get out, it had to be now.  The voice was singing again, pushing me to go further into the dark, to run until we were safe.\n\nSo I listened and I ran.\n\n****\n\nEvery door unlocked for me, every turn kept me barely out of sight.  The people looking for me were barking orders over a radio, asking someone what was the hold up on the generator kicking on.  Whatever the response, the hallways stayed dark as I drifted through them blind but not falling, lost but not being found.  \n\nWhen I reached the final door, I opened it into a bright afternoon.  My lungs burned a little at the first fresh, unrecycled air I had breathed in a week.  Blinking, I waited for the voice to tell me where to go, but it had fallen silent.  I closed the door as panic began to rise in my chest.  All this and I would get caught because I didn’t know where to go.  I was outside a plain brown building in the middle of nowhere.  There was a road going off to the right, and to the left there was…\n\n*Rachel’s forest, from her first painting to me.*\n\nI knew it was the same forest immediately, and not just because of it matching the painting so closely.  I had some strange sense that felt like a kind of magnetism, or how birds know which way to fly.  Looking around for a second, I felt like I was being pulled when I looked again at those woods.  This was right.  Somehow, I knew this was the way I needed to go.\n\nSo I went.\n\nI had made it to the edge of the forest when I heard the noise of men coming outside the building.  I thought about hiding, but I knew it was a bad idea.  They would just catch me, and I felt a drive to go deeper into the woods.  I plunged ahead, running at close to a reckless speed but never tripping or stumbling as I went.  I would occasionally hear a noise behind me as they spread out to search, but the sounds grew fainter as I ran.  I almost thought I had lost them for good when I heard a short cough that was quickly muffled off to my left.  Someone had gotten close without me knowing it. \n\nPanicking, I looked for any places I could hide.  There were only bushes and trees and…over there.  A well.  Not just *a* well, but Rachel’s well, with the same worn, grey stone walls capped with a weathered wooden lid.  I felt a moment of happy recognition, but then it faded away.  How did that help?  They’d check the well if they found it, and I didn’t have any way to get down in it without getting hurt or stuck.  Then an idea stuck me.\n\nCrouching low and staying to the brush, I moved to the well and gingerly pushed on the lid.  At first it resisted, but when I pushed a bit harder, the wooden circle slid aside enough that you could clearly see someone moved it.  Glancing around, I eased back into the bushes as I heard soft footfalls approaching.\n\n“We need to check this out.”\n\n“You think he went down the well?  Better hope not.  He probably broke his neck if he did, and then its our asses.”\n\nI could see the two men approaching.  Both of them were wearing dark body armor and carried assault rifles.  The older of the two shrugged back at the other one.  “Better that than he was hiding in there and we *didn’t* check.”\n\nLooking irritated, the younger man nodded.  “I’ll look.”  He went over to the well and shoved the wooden lid aside, causing it to clatter to the ground.  Hitting a button on his rifle, a flashlight sprang to life on the barrel.  He started to shine it down into the well as the other continued to look in every direction.  I was worried he would see me if I moved, but I couldn’t wait.  I just had to stay calm.  Think slow and move fast.\n\nI kept expecting to hear them yell, or feel something or someone strike me in the back, but nothing came.  As the afternoon light began to dim, I saw the trees thinning ahead.  I was approaching a road.  It looked like a normal, public road too, with several cars passing one way or the other as I walked out of the forest and up the hill to the asphalt.\n\nThe idea of hitchhiking, especially this close to where they held me, was frightening, but I saw little choice.  I was wearing sweatpants and a t-shirt they had given me and my own shoes, but I had no money or ID or phone.  My only chance was to get far enough away that I could try and get help.\n\nI jumped slightly at the hiss of hydraulic brakes as a large semi rolled to a stop next to me.  The passenger window rolled down and an older man with white hair and a greying mustache leaned over and peered down at me.  \n\n“You look lost, son.  You need a ride?”\n\nI looked down at the door of the truck.  It had a logo that said “Martinez and Sons Construction and Hauling”  Below it was a cartoon man hitting a wall with a sledgehammer.  Looking back up, I smiled at him.\n\n“Yes sir, I do.”\n\n****\nI woke up five hours later as we pulled into a truck stop somewhere in Nevada.  I had planned on staying awake the entire trip, but that had only lasted a few minutes before exhaustion overtook me.  I glanced over at Oliver Martinez and he gave me a toothy grin.\n\n“I’m tired, but you were plumb tuckered out.  I’ve got to fuel up, shower and get some grub.  I’m going on to California after that.  If you want to ride further, just be back here in an hour.  Sound good?”\n\nI nodded and thanked him again for the ride as I got out.  I felt groggy from sleeping, but otherwise okay.  I just needed to decide whether this was a good spot to ask for help or if I should ride with Martinez further.  He seemed like a very nice guy, and he would probably try to help if he could, but I wanted to avoid putting more people in danger if I could help it.  Looking around, I saw we were in a fairly nice little town.  I decided I would go look around for a few minutes and then decide what to do.\n\nI was only three blocks down the street when I saw the flickering lights in the distance.  It was a movie theater.  As I got closer, I felt my chest tightening.  It was the one from Rachel’s painting.\n\n****\n\n“Hey there.  Welcome to the Phoenix.”\n\nThe guy standing at the candy counter of the theater looked a little younger than me, and while he seemed friendly enough, he also looked slightly concerned.\n\n“If you’re here for the horror double-feature, I’m afraid the second movie is about thirty minutes in.  I can give you a half-rate if you want to see it though.”\n\nI shook my head and tried to not look as strange and crazy as I felt.  “No, that’s okay.  I…well, I recognized this place from a picture a friend of mine painted.  So I came in to ask if you knew anything about her.”\n\nHe raised his eyebrows and shrugged.  “Okay, weird.”  He smiled and added, “Weird but interesting.  Who is she?”\n\nI swallowed.  “Her name is…well, it was, Rachel Donovan.”\n\nI expected him to look surprised or excited or angry, but I could see right away the name meant nothing to him.  Shaking his head, he shrugged again.  “Sorry, that doesn’t ring a bell.  I’d say you could ask the owner, but he’s on vacation this week.”\n\nNodding, I searched my mind for something else to ask, some way to make this place matter the way her other paintings had.  “Is there anything unique about this place then?  Its history or something?”\n\nThe man grinned.  “Buddy, you’re clearly not from here.  This place is super boring.  Not just the theater, but the whole town.”  Frowning in thought, he added.  “The only thing I know about the history of this place is that there used to be a house here that burned down.  This was like in the 1920s or 30s when this wasn’t even a part of town.  Couldn’t tell you the first thing about it beyond that, but I still bet it’s the most interesting thing that’s ever happened here.”\n\nI let out a disappointed sigh.  “Okay.  Well, thanks.”  I turned to leave when the guy called out again.\n\n“Hey man, sorry I couldn’t help more.  If you come back, I’ll get you a discount on a movie.  Half-off.  If I’m not working, tell them Marshall said it was okay.”\n\nI waved and tried to smile as I headed for the door with a heavy heart.  Why did you lead me here, Rachel?  What’s here that will help?\n\nI was outside again, staring up at the theater’s bright blinking signs as though they were going to give me some kind of secret signal, when I noticed movement out of the corner of my eye.  There was an alley that ran along side the theater and went behind it to…something.  Whatever was back there, the light of a distant security lamp cast shadows along the wall of the alley, and those shadows were moving.\n\nInstead of feeling afraid, I felt excited as I started down the alley.  Rachel had led me here, and I just had to trust that there was a reason for it.  Keep looking until I…\n\nThe shadows were made by leaves blowing in some wind I couldn’t feel.  As I got to the far end of the alley, I saw there was a small back yard behind the theater surrounded by a chain link fence, and on the other side of that fence was the tree from Rachel’s painting, with its deep red twisting bark and foam of green leaves waving to and fro in the night air.\n\nI felt a surge of warmth in my chest as the distant singing began again.  This was the place.  The special tree that could not be found unless it wanted you to find it.  It sat at the edge of a small overgrown lot surrounded on all sides by buildings and yards, somehow forgotten when whatever this land had once been was divided up, and despite its location, I had a strong sense that I was the first to see it in a very long time.\n\nClimbing the fence, I felt a jagged wire dig into my leg and rip my pants as I fell over the top.  I was bleeding a little, but I hardly noticed.  I could smell the tree now, and it was a rich, good smell unlike any I had smelled before.  Reaching out to it, I felt the singing grow louder as I touched it.  I felt stronger and less afraid then, and when I saw the light opening up at its roots, I didn’t tremble, I smiled.\n\nThere was a hidden tunnel under the tree.  A tunnel filled with sweet-smelling air that was like the tree smell but also different.  And the tunnel wasn’t dark—no, not at all.  It glowed with its own golden light that called to me, urged me forward.  Rain was beginning to fall as I looked around the dark lot.  I had the thought that I was leaving this world behind.\n\nAnd I found I didn’t mind that much at all.\n\nThe tunnel had continued to grow, slanting down gently and tall enough that I walked in without stooping.  The roots of the tree went on and on, woven through the dirt walls as I went deeper.  I looked back and saw the tunnel had closed behind me, but I wasn’t surprised.  The way forward was the only way that mattered.\n\nI walked for what might have been hours, but I never felt tired or hungry.  And I never worried I was lost, though I had no idea where I was or where I was going.  Still, I felt a surge of happiness and excitement when I turned a corner and saw something in the tunnel ahead.  As I got closer I realized it was a brick wall, but just as I began to think I had found a dead end, the wall faded away, revealing a dark room.\n\nI paused at the edge of the tunnel, looking out at the floor of what looked like a basement.  It was empty, but in the light from the tree I could make out something scratched into the floor.  It was the number two.  I felt my pulse quicken as I thought back to Rachel’s painting with the theater seats, and then I stepped out into the room.\n\nIt was the empty basement of a house, and as I went up the stairs and opened the door, I saw that the rest of the house was empty as well.  No lights were on, but bright sunlight poured in through every window and in the distance I could hear what sounded like small waves crashing on a beach.  I wanted to go out and see where I was, but I forced myself to check the house first for any people or clues.  But there were none.  The house was utterly bare of any sign of people other than the number scratched into the floor below.\n\nMy nose tingled with salty air as I stepped outside.  The house was near the beach on what I soon figured out was a small, deserted island, and I realized with little surprise that I recognized the house from Rachel’s painting.  As I stepped off the porch, I saw no signs of people, but I wasn’t entirely alone.  Because sitting some distance from the house, was the tree.  \n\nI knew it couldn’t be the same tree as in the abandoned lot, but at the same time I knew that it was.  Or at least a different part of the same tree that made the tunnels and appeared in my old world and whatever place this was.  \n\nBecause I had started having that thought as soon as I stepped out of the house.  I didn’t think this was my world.  Not exactly.  I could see a larger island some distance away, and it might have people on it.  Hotels and cars and planes.  Or it might not, as those things might not exist here.  Either way, my newfound intuition was growing stronger, and I could tell that the…what was it called?  The con…no, the texture of things was different somehow, if only a little.  Not bad or scary, just different.\n\nStill, after a couple of hours exploring the island and checking the house, I began to feel terribly lonely, even with the tree nearby.  I decided to go back into the tunnel and keep going.  The basement wall faded away as I walked up to it, and I entered the tunnels again.\n\nIt was only a short time later that I found my second version of the house.  Much like the first, the wall faded away into a basement, but this one was far from empty.  It was a workshop of some kind, full of tools I wasn’t familiar with.  I glanced down and saw “43” scratched onto the floor.  Who was doing that?  And why?\n\nI was going to explore the house, more carefully this time, as it looked like there were people here, but then I froze.  Propped against the brick wall, next to a small stack of boards, was a sledgehammer.  Trying to be quiet, I crept over and picked it up before heading back into the tunnel.\n\n****\n\nWhen I was little, before Daddy died, he had loved to hunt.  I never went with him and didn’t remember much of what he hunted, but I do know he had an old hound he’d had since before I was born.  The dog had only loved him—well, him and being on the trail of something.  When Rocker (his name was Rockerfeller) got a scent, it was like he was in a trance.  He would go and go, this way and that, and to look at him, it looked like he was having a fit—both lost and certain at the same time.  But whatever Rocker knew or didn’t know, he always found what he was looking for. \n\nI felt like Rocker now.  I was moving faster and faster as I went down this turn and that.  I felt like I was on the trail of something or traveling on memories I didn’t have.  Gripping the sledgehammer tightly, I could hear the rising hum of the distant music in my head as I turned the last corner, and then it fell silent.\n\nThere was another brick wall, and as I approached, it fell away.\n\nIt was another basement room, but this one was much smaller.  It contained a table, a clothes chest, and an old metal bed that had been broken apart.  At the far brick wall, a woman was using one of the metal legs from the bed to attack the wall and whatever lay behind it.  I felt my head began to swim as I looked at her from behind, and as she turned to look at me, eyes wide with surprise and fear, I felt the sledgehammer slip from my grip as I stumbled back against the now solid wall.  I could barely breathe at all, but I managed to get out a single word.\n\n“Rachel?”\n\nThe woman looked at me, her expression less fearful but still guarded.  She had the bed leg partially raised in warning.  [“Yeah?  Do I know you?”](https://redd.it/8uj33q)\n\n****\n \n**** \n\n**** \n\n**** \n\n\n\n\nIt was her, but it wasn’t, much like the tree on the island.  This Rachel looked a few years older, and while she looked stressed and confused at the moment, her eyes didn’t seem weighted down by the same quiet sadness I had come to recognize watching the other Rachel for all that time.  Still, I didn’t know how to answer her question and not sound creepy or crazy.  I stared at her for a second, floundering, when she asked another.\n\n“You came out of the tree tunnel, right?”\n\nI nodded, grateful for something I could answer easily.\n\nStudying me, she said.  “Where did you come from?  Before the tunnel I mean.”\n\nI flushed as I tried to think of the right words.  “Um, well, I came from Texas.  Originally I mean.”\n\nShe grinned at me for a second before catching herself and trying to look serious again.  “Yeah, okay.  But like…do you know how the tree works?  How did you find out about the tunnel?  How did you get here?”\n\nSighing, I rubbed my head and just started into it.\n\n“Look, I know this will sound crazy, but I had a job watching a woman trapped in a room, and that woman was you, or another version of you, and she asked me for help, and I couldn’t help her and then they took me, and I found out she had been dead for a long time but could see me in the future and then they put something from the tree in me that had been in her that killed her and then I escaped and then I figured out where to go to find the tree from things she had painted and I somehow knew how to go in the tunnels to find different spots, and I’m pretty sure the tunnels lead to different worlds and I got this sledgehammer and then I…”\n\n“Hold up.  God damn.  Take a breath.  You’re going to pass out.”  She was smiling again, and this time she didn’t try to hide it.  She looked over what was left of the bed to where the sledgehammer was laying on the floor.  “And did you say sledgehammer?”\n\n****\n\n**Whack**\n\n“So yeah, I believe you.”\n\n**Whack**\n\n“I’ve been in those tunnels too.  My ex-boyfriend tricked me into moving here so he could tie me to the tree in his place.”\n\n**Whack** \n\n“Well, not tie me to the tree literally.  Take his place as…what?  The tree’s buddy or something?  I don’t really know.  It’s all pretty fucked up and I don’t understand all of it.”\n**Whack**\n\n“But what I do understand is that the fucker walled me up in here.  At first, I thought I could just pry loose some bricks over time, but nope.  He put a layer of concrete on the outside this time.  Good ol’ Phil.  Or Justin.  Or whatever.  I mainly think of him as Fuckface now.”\n\n**Whack**\n\n“This is taking forever.”\n\nI stepped up and put my hand on the sledgehammer.  “Let me do it for a bit.  We can take turns.”  We had cleared away even more brick than she had already managed, but the concrete wall was only starting to show small cracks.  I wanted to just keep looking at her, have her talk to me, but I knew she was tired.  She nodded reluctantly and let go of the hammer.  Before I swung, I looked back at her.  “How long have you been in here like this?”\n\n**Whack** \n\nRachel scowled.  “It’s hard to say for sure, but I think about eight months.”\n\nI let the hammer drop down again as my eyes widened.  “How did you survive all that time?”\n\nHer scowl deepened.  “It’s the tree.  It won’t let me die.  I just dip into the tunnel every day for a bit and I never get that hungry or thirsty.”\n\nA thought occurred to me then.  “Why didn’t you just escape through the tunnels?”\n\nShe quickly shook her head.  “No, thank you.  I’ve had enough of seeing other worlds.  Some of them aren’t so nice.  And I don’t want to be more tied to the tree than I already am.  I just want out of here, into my own world, and then I can try and figure out how to get free of my connection to the tree for good.”  Rachel shrugged.  “I would have done it eventually with the stupid bed parts, but who knows how long it would have taken?”  She smiled again.  “I’m very happy you came to help and brought a sledgehammer with you.”\n\nReturning her smile, I nodded as I lifted the hammer again.  “Me too.”\n\n**Whack**\n\n****\n\nWe were both wringing with sweat when we crawled through the hole we’d made in the outer wall.  Rachel told me that she thought her ex-boyfriend was long gone, but she couldn’t be sure, so we had to be careful.  Grabbing the sledgehammer from inside the room, we made our way toward the stairs.\n\nThe house was decorated but quiet, and we saw no sign of anyone as we walked to the front door and opened it.  Outside, the sun was coming up on a new day, and as we walked out onto the porch, I jumped a little as Rachel took my hand and gave it a squeeze.  I looked over at her.  \n\nI hadn’t been able to help the other Rachel, but maybe that had never been the point at all.  Because I thought now she had been able to see more than just other places or the future.  She had been able to see into other worlds and possibilities. \n\nLike this one, where another version of her was trapped and needed help.  A place where I wouldn’t be hunted and she could be free.  In the end, even when she knew she was dying, Rachel had been determined to help us be together and happy.\n\nThe morning sun painted beautiful colors on Rachel’s face, and looking into her eyes I saw how much she was like the woman I had watched and cared about and tried to save.  The woman who, in the end, had saved me instead.  I wanted to tell Rachel so many things, ask her so many questions, but all that could come later.  Squeezing her hand back, I walked with her away from the house.\n\n[For now, this was enough.](https://redd.it/bue253)\n\n****\n\n[You have a delivery scheduled.](https://redd.it/cbn7uj)\n\n[The Ghost Tree](https://redd.it/kfvzse)",
    "comments": [
        {
            "level": 0,
            "comment": "Bravo OP. We can't wait to hear more takes from the tree. Who is this organization? How has the tree influenced Rachel through time and space? We know from Justin's account that she can't leave forever, the tree will pull her back. Do the same rules apply to you now?\n\nKeep us informed whenever you can!",
            "score": 2030,
            "author": "JDMLeverton",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did Justin post his own account? If so, what post is that?\n\nI’m fascinated by this tree now. It sounds really sinister, trapping people like that.",
                    "score": 354,
                    "author": "Revenez",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "in the link where rachel says \"do i know you\" it explains a lot",
                            "score": 105,
                            "author": "MemeTeen69",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wooah i don't remember that link being there before?? Thanks!",
                                    "score": 61,
                                    "author": "amelioratien",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It was always there. The tree helped you remember.",
                                            "score": 104,
                                            "author": "jhubeJELLO"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yeah same wtf",
                                            "score": 3,
                                            "author": "360Turn"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 58,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 17,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 22,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "i think the organization might be Tattersall from OP's other stories. every time i read a u/verastahl story i'm absolutely blown away by the lore and the connections they all have with eachother. wtf is a MCU? we have the Verastahl Story Universe, the VSU",
                    "score": 56,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "My thought would be, that since Thomas has a piece of the tree in him, he has more freedom and possibly can extend that freedom to Rachel - since she would still be with the tree.\n\nThen again, maybe OG Rachel died because she was connected to the tree and away from it for too long? Maybe that's what the other numbers in the theater are for, because she knew they would have to go back eventually?",
                    "score": 73,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Read the link in the \"do I know you\" sentence. Slight story continuation.",
                            "score": 14,
                            "author": "iloveallthebacon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wooah i don't remember that link being there before?? Thanks!",
                                    "score": 7,
                                    "author": "amelioratien"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Maybe she can leave now if she's with OP since OP has part of the tree in him?",
                    "score": 12,
                    "author": "bendygrrl"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The link in the \"do I know you?\" sentence.",
                            "score": 2,
                            "author": "iloveallthebacon"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So what about those other two numbers?",
            "score": 292,
            "author": "tauzeta",
            "replies": [
                {
                    "level": 1,
                    "comment": "There is a link in this part. If you read it, you'll get it.",
                    "score": 79,
                    "author": "k8fearsnoart",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, that explains why the numbers are *there*... But unless I missed something, it doesn't explain those two *specific* numbers.",
                            "score": 44,
                            "author": "ribnag",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It seemed to me that those specific numbers were basically a quick primer so that they would understand more about the other worlds quickly. With those numbers, one would be able to see that the tree isn't always benign. They'd discover that these other worlds could be dangerous, and that there are other worlds where they were in a different timeline, yet exist simultaneously. \n\nAt least, that was my read on the situation.",
                                    "score": 42,
                                    "author": "k8fearsnoart"
                                },
                                {
                                    "level": 3,
                                    "comment": "It was &gt;! Justin’s 2nd reality and 43rd reality!&lt;",
                                    "score": 34,
                                    "author": "Sealouz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;Justin’s 2nd reality and 43rd reality\n\nWhat is that",
                                            "score": 2,
                                            "author": "Zestavar",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fuck, I thought she was whacking him with the sledgehammer",
            "score": 909,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha same. I was like NOOOOO! Oh.",
                    "score": 276,
                    "author": "UnstoppableChicken",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Takes him out at the legs with the sledgehammer, ties him to the tree, and keeps him trapped in the tunnels with her a la Misery-style.",
                            "score": 56,
                            "author": "MurseWoods"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So after reading this i have a theory that might be a bit of a stretch but that i think would explain some loose ends.\n\nWhat if when Rachel said \"That girl is not me\" she was actually not referring to Melanie as we thought, but actually to the Rachel Thomas meets in world 43. We know Rachel is able to see stuff through time but what if the tree besides being able to travel between worlds and dimensions it can also travel through time. What if Thomas was not supposed to stop there but actually keep going though the tunnels and world 89 would be where past Rachel would have been, giving Thomas a opportunity to save her and finally achieve what he has been looking for all those years to meet and save his Rachel.\n\nEdit : Same theory with punctuation now",
            "score": 499,
            "author": "Qu1ao",
            "replies": [
                {
                    "level": 1,
                    "comment": "The thought of this possibility honestly makes me so sad.\nTo think that Thomas might’ve stopped short of his destiny and that the real Rachel might be out there waiting for him.",
                    "score": 224,
                    "author": "bryvl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same it turns the ending into a much more bittersweet one but it opens at the same time a lot of possibilities so I like that.",
                            "score": 68,
                            "author": "Qu1ao"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That is a nice hidden ending TBH. There were two more numbers to be seen. That girl was not her.",
                    "score": 56,
                    "author": "Qzin89",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "if that theory is true then why was Rachel's last painting of them holding hands in the sunset",
                    "score": 45,
                    "author": "LemonBreeze_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But this isn't a sunset, it's a sunrise",
                            "score": 52,
                            "author": "SamBoosa58"
                        },
                        {
                            "level": 2,
                            "comment": "I know this comment is old but I checked and the painting was of them holding hands in the sunrise, is how the story ends, with Thomas and Rachel holding hands in the morning sun.\n\nSo yeah I guess this is a good ending :)",
                            "score": 42,
                            "author": "_usotsuki"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "With punctuation, of course.",
                    "score": 114,
                    "author": "goblinrum",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How the fuck do you have 3 gold?",
                            "score": 82,
                            "author": "csgo_fckslivers",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "beats me",
                                    "score": 55,
                                    "author": "goblinrum"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah my bad kinda forgot that existed I will edit it when I get home",
                            "score": 14,
                            "author": "Qu1ao"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don't think its the Rachel from world 43. If you read the story of 'this' Rachel, it's actually world 1",
                    "score": 7,
                    "author": "Squamoto1998",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah and world 1 is the trading world for f2p players",
                            "score": 24,
                            "author": "Vibeth",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My thoughts exactly",
                    "score": 22,
                    "author": "OnkelWormsley"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Makes me think the tree might be Yggdrasil, or something closely tied to it.  What with the ability to bind you across different worlds and realms.",
            "score": 108,
            "author": "Addfwyn",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I know you feel really content with where you are now. But I hope you tell us more of this new world you found with this other Rachel. Are you truly free now? Who was Rachel's ex? What does the the other 2 numbers mean?",
            "score": 309,
            "author": "amelioratien",
            "replies": [
                {
                    "level": 1,
                    "comment": "26 89\n\nI want to know too. So they had to be other worlds?",
                    "score": 164,
                    "author": "theatog",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If there are, what are they like? Will Rachel and Thomas explore them, too?",
                            "score": 50,
                            "author": "amelioratien",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But Rachel also said she doesn't want to go back to the tunnel. So many questions. But somehow I didn't really feel unsatisfied. But it would be a bonus to find out.",
                                    "score": 48,
                                    "author": "theatog"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Maybe he needs to make it to all four of the other worlds in that order to make it to the original Rachel-maybe a world where she is still alive or something?",
                            "score": 15,
                            "author": "ACaley6916"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I assumed they were the worlds he stopped in on his way to Rachel.",
                    "score": 13,
                    "author": "JaksunPrime"
                },
                {
                    "level": 1,
                    "comment": "The link in the \"do i know you\" sentence kinda answers some of your questions.",
                    "score": 9,
                    "author": "iloveallthebacon"
                },
                {
                    "level": 1,
                    "comment": "Rachel was marking them as she was discovering them.",
                    "score": 6,
                    "author": "transcendtime"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 8,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"That girl isn't me.\"",
            "score": 98,
            "author": "MayorLag"
        },
        {
            "level": 0,
            "comment": "What about the numbers 26 and 89?",
            "score": 80,
            "author": "Raavan14",
            "replies": [
                {
                    "level": 1,
                    "comment": "We're they the same numbers he saw in the movie theatre painting?",
                    "score": 5,
                    "author": "GuffenbergDK2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "OP fail Rachel one last time, the numbers, it was meant for Thomas to going down the tunnel 2 more times. When it gets to 89, you may able to actually save the Rachel of your world.",
            "score": 72,
            "author": "Undersword",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Rachel of his world died trying to get him to be with the Rachel he found. I'd like to think he found the exact Rachel he was meant to find.",
                    "score": 46,
                    "author": "vinnycc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe you are right. But what about the remaining two numbers? I would really like to know what would have happened if op had continued his journey in the tunnels.",
                            "score": 22,
                            "author": "DANG3R_1204",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The \"That girl isn't me\" _could_ be referring to the Rachel he found in the other world.",
                                    "score": 33,
                                    "author": "Herr_Gamer"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That's assuming the corpse was really Rachel and they didn't lie to him. And also assuming \"That girl isn't me.\" Was for pointing out Melanie and not the alternate Rachel. And lastly assuming that the final 2 numbers weren't meant for him to visit and find the real Rachel. That's quite a lot of assumptions imo. I'm not saying it isn't possible, but the darker possibility is still as feasible as what you'd like to think is the truth.",
                            "score": 11,
                            "author": "ImmersedReader"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's possible the tunnels go through time as well so maybe world 89 was like his world at a time before she died and he could rescue her somehow.",
                    "score": 9,
                    "author": "ComicalSkate",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "The first Rachel saw more worlds before Thomas is done. I'm thinking this is just a layover and things will go south soon.",
            "score": 56,
            "author": "dmcdd"
        },
        {
            "level": 0,
            "comment": "So now, between you and Rachel, we've seen worlds 1, 2, 43, and 71, out of at least 211 - plus whichever number was in the basement of the house that became that movie theatre.\n\nI hope 26 and 89 answer some of the questions we all have, and I also hope that you both can make a beautiful life together.",
            "score": 52,
            "author": "Damerel",
            "replies": [
                {
                    "level": 1,
                    "comment": "Click the link that leads to another story explaining rachels ex and why she was stuck in the room",
                    "score": 5,
                    "author": "Muhammagaming"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 74,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I remember reading those about 2 years ago.  Very good series, and this is on the same level.",
                    "score": 6,
                    "author": "z0uNdz"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes!! I had a feeling that the two hands she painted were you and her! I just never guessed it would be an alternate-timeline version of her.",
            "score": 30,
            "author": "anonymous-horror"
        },
        {
            "level": 0,
            "comment": "Keep searching! Maybe world number 89 is the room that the Rachel you were watching is being kept. Maybe time doesn’t work the same where you are. Maybe you can bring her somewhere else with you",
            "score": 34,
            "author": "DoubleUntendre",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Wait so who was Melanie?",
            "score": 28,
            "author": "djquik1",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm pretty sure she was an actor hired by the company in an attempt to keep him complacent.",
                    "score": 77,
                    "author": "Mattman243",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Melanie was the actor they hired, hoping it was Rachel's painting for \"that girl's not me.\" It was a calculated risk they took, not knowing if that was actually how it was supposed to play out.",
                            "score": 45,
                            "author": "Gaiaimmortal"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "But wont the tree suck them back into it after a certain amount of time? I suppose if they get sucked back in, at least they would be together?",
            "score": 27,
            "author": "baryon3",
            "replies": [
                {
                    "level": 1,
                    "comment": "It might.  But considering the tree is literally a part of Thomas now, he might automatically meet the \"stay with the tree\" requirement thanks to the implant.",
                    "score": 6,
                    "author": "conundorum",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "...Except that ended up *killing* the other Rachel (probably not intentionally, but same effect); so, maybe not *quite* a get-out-of-jail-free card?",
                            "score": 6,
                            "author": "ribnag",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's true, too.  It's _really_ hard to say whether it counts or not, since there are so many factors that could affect it.",
                                    "score": 3,
                                    "author": "conundorum"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I thought she was gonna say something like, \"my ex boyfriend tricked me into taking his place being the tree's buddy and now it's your turn\" and waltz out of there, finally free, with OP trapped in there trying to figure out a way to find the next person to take his place.",
            "score": 29,
            "author": "anxious_dragon",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yggdrasil...The World Tree...",
            "score": 21,
            "author": "KnightGalavant",
            "replies": [
                {
                    "level": 1,
                    "comment": "When I first read about the tree, that was my first thought as well. However, Yggdrasil leads to nine different realms - This tree seems to lead to countless different dimensions... They are similar, yet not quite the same.",
                    "score": 7,
                    "author": "KvotheTheMaedre"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe the tree got bored with Rachel because she wasn't exploring and now Thomas is there to take her place...  Guess we'll see if Thomas gets yanked back into the tree in 2 to 3 years.",
            "score": 16,
            "author": "Boring_Ugly_Dude"
        },
        {
            "level": 0,
            "comment": "OH MY GOD. YES. Maybe now the two of you are together you can find some way to...I don't know, defeat the tree or find a way to all live together with it. This was amazing and captivating. \n\nIf you ever meet a young woman named Cora and her Uncle Teddy, they're super cool people. I advise befriending them.",
            "score": 16,
            "author": "UnstoppableChicken",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or Jason and his grandfather. They're also super cool.",
                    "score": 7,
                    "author": "ImmersedReader"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A STI that binds you to a tree... wear condoms, kiddos",
            "score": 17,
            "author": "NikkiLaudaa"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 29,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 35,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 16,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "But what about the other numbers in the chain of numbers she gave in the movie theatre painting?",
            "score": 15,
            "author": "ADnarzinski16"
        },
        {
            "level": 0,
            "comment": "Wasn't there another painting that hasn't beared any significance yet? The one with the weird root like walls with a table in the middle and a dark figure holding something in its hands while on it...",
            "score": 14,
            "author": "pTHOR1w",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Damn Brosky, I HAD TO KNOW, What's behind the other two worlds?? 89 and 26, btw i would instabuy a book if you would write one about this story.",
            "score": 12,
            "author": "_lusio"
        },
        {
            "level": 0,
            "comment": "That was a great read, together with the \"ashes of my heart\" one of the best stories here.\n\n\nYou can't help but wonder what the organization knew about the tree. Obviously enough to realize that implanting a shard of it in Rachel's body would affect her but not enough to know that it would open her up to alternate universes or timelines.\n\n\nOne thing that keeps bugging me is how they got the three shard in the first place. They shouldn't be able to see it or touch it since the tree was only visible (and touchable?) to the chosen few.",
            "score": 14,
            "author": "dotlurk"
        },
        {
            "level": 0,
            "comment": "Is Thomas a version of Justin?",
            "score": 10,
            "author": "ClassiestRobin"
        },
        {
            "level": 0,
            "comment": "OP... I'm getting the idea that \"Rachel\" still doesn't have your best interests in mind here...",
            "score": 9,
            "author": "mintegrals"
        },
        {
            "level": 0,
            "comment": "What if in an alternate ending he wasn't dupposed to stay with this rachel but go around the multiverse helping rachels until he finds himself in a loop of time was before the original rachel was taken and saves her. Idk just an idea i suppose",
            "score": 8,
            "author": "Erokhar"
        },
        {
            "level": 0,
            "comment": "And as they wall threw the door she says. \"Please stop calling me Rachel.\"",
            "score": 8,
            "author": "MolotovCockteaze"
        },
        {
            "level": 0,
            "comment": "I was expecting a darker ending but I loved it. Thanks for sharing this fascinating story with us.",
            "score": 8,
            "author": "Gamusino85"
        },
        {
            "level": 0,
            "comment": "Why couldn’t Rachel grab the sledgehammer and bring it back like Thomas was able to do?",
            "score": 19,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Why does Mr. Solomon wanted the tree?",
            "score": 5,
            "author": "ghostesscoffee"
        },
        {
            "level": 0,
            "comment": "But who was the woman who came up to him at his house and told him to quit?",
            "score": 6,
            "author": "nicoleab88",
            "replies": [
                {
                    "level": 1,
                    "comment": "I believe it was an actress hired by the organization running the experiment. It was part of their plan.",
                    "score": 9,
                    "author": "vinnycc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The only reason this is r/nosleep is because it takes like 2 or 3 hours to read!!! (Great storie btw)",
            "score": 6,
            "author": "Dreath2005"
        },
        {
            "level": 0,
            "comment": "Well that's a weird turn of events. Won't she get pulled into the heart?",
            "score": 8,
            "author": "WRZESZCZ_1998"
        },
        {
            "level": 0,
            "comment": "Just finished reading \"Come live in the ashes of my heart\" after reading this and I've gotta say bravo. Phenomenal. All I want is more and I know that these stories are connected in little ways so I can't wait to read about world 71!",
            "score": 6,
            "author": "pateizenga",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Mystery\" is about world 71",
                    "score": 2,
                    "author": "sbrownbear"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fucking brilliant from start to finish mate",
            "score": 6,
            "author": "friskyswizzy"
        },
        {
            "level": 0,
            "comment": "This narrative is a beautiful gift. Thank you for giving it to us. I hope you both find peace, love, and true happiness together.",
            "score": 5,
            "author": "SignificantSampleX"
        },
        {
            "level": 0,
            "comment": "Holy fucking shit. This is BY FAR the best reddit story I have ever read. I will now commence sharing it with all my friends and family. 😊",
            "score": 5,
            "author": "jodi5315"
        },
        {
            "level": 0,
            "comment": "I’m so glad I don’t have school tomorrow. I literally just binged this entire thing with no breaks. It’s 1am and Im definitely not sleeping now. So. Many. Questions.",
            "score": 5,
            "author": "mrsdisappointment",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Lord I wish I could read this and come live in the ashes of my heart again for the first time. So good!! Nothing like the first time reading and understanding such stories",
            "score": 3,
            "author": "cadburyegg101"
        },
        {
            "level": 0,
            "comment": "Ok but what the fuck happened to the music store?",
            "score": 4,
            "author": "VirginiaTeamsIGuess"
        },
        {
            "level": 0,
            "comment": "Hello. So basically Rachael from his world helped him escape and met another Rachael? And he gone with her on another world? Doesn't that mean that there's a Thomas too, what would happen if they meet? What about the other two numbers? But the most important question\nOP, have you considered continuing the story? Thomas realising the mistake and that he must go tot the other numbers and save the Rachael he and we love? That was a not that great ending, it was a good ending, but not the one we hoped for. We all want our Rachael saved.",
            "score": 5,
            "author": "KarmaTheKing9"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same! Literally same.",
                    "score": 2,
                    "author": "uhhhhbonlesspizza"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I never truly understood why this sub was called no sleep before this. Dammit man, imma need my 2 hours back.",
            "score": 11,
            "author": "anti-FBI-account"
        },
        {
            "level": 0,
            "comment": "The best NoSleep entry I’ve ever seen. I’m glad you’re happy now.",
            "score": 7,
            "author": "weberhed"
        },
        {
            "level": 0,
            "comment": "Speechless.",
            "score": 4,
            "author": "skjultsprutte"
        },
        {
            "level": 0,
            "comment": "I loved this series! I hope to hear more from Thomas and Rachel!",
            "score": 3,
            "author": "MissusBeeAlmeida"
        },
        {
            "level": 0,
            "comment": "this was amazingly beautiful. I hope you can make a nice life together, wherever you are.",
            "score": 3,
            "author": "omgnanna"
        },
        {
            "level": 0,
            "comment": "So what about the others number?",
            "score": 3,
            "author": "phonglinh55"
        },
        {
            "level": 0,
            "comment": "Damn son, shits right. Couldn't stop reading",
            "score": 3,
            "author": "MinisterCpolitics"
        },
        {
            "level": 0,
            "comment": "after reading through this whole story on and off this afternoon, i noticed the author/thomas trying to recall certain words at times, is there a code to that? are we subjects too and these stories are his paintings? what does it mean?",
            "score": 3,
            "author": "mrstustu"
        },
        {
            "level": 0,
            "comment": "I was hoping to read a scary story...  but was more like a fantasy thriller.  I mean it was ok but it kind of turned into a cheezy love story at the end.  What about the experiment?  We just never get any other answers?  It kind of felt like OP gave up on expanding the original story and wanted to leave it all behind.",
            "score": 3,
            "author": "lessadessa",
            "replies": [
                {
                    "level": 1,
                    "comment": "There were answers about the experiment though. What questions did you have?",
                    "score": 2,
                    "author": "Lucarian"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The only question that I have right now is how there is wifi in other worlds?? How were you able to post this?? Was your wifi able to transcend thru dimensions??",
            "score": 3,
            "author": "Yuni-que"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 3,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Twin Peaks-y",
            "score": 4,
            "author": "overhypedcarrot"
        },
        {
            "level": 0,
            "comment": "Beautiful. My heart is reborn from its ashes.",
            "score": 3,
            "author": "ImmersedReader"
        },
        {
            "level": 0,
            "comment": "Constants and variables.",
            "score": 3,
            "author": "nefuratios"
        },
        {
            "level": 0,
            "comment": "Lmao",
            "score": 3,
            "author": "Scorpionus"
        },
        {
            "level": 0,
            "comment": "I'm obsessed with this tree now, I filled the link in the comments, an read more about it bit I cannot hit like or leave a comment, so OP I just want you to know this is the best series I've read in months, please please write more about the tree.",
            "score": 2,
            "author": "Beckystrong007"
        },
        {
            "level": 0,
            "comment": "I want to start by saying this is beautiful. One of the best things I've read in terms of imagery and sentiment.\n\nI have only read two of your works, this one and the serial killer grandfather. I'm not sure what the time/experience gap is between the two but this is much better imo.\n\nThe details were all very relevant, the similes/metaphors were on point and helped me feel like i was there. I also like how you got to the point quickly, the pacing made it feel exciting and suspenseful. The other series felt like it had too many irrelevant details and dragged on without developing the story in a meaningful way.\n\nAnyway, again, this was SO good. The ending was appropriate, but would love to see you continue it from where you left off. Thanks.",
            "score": 2,
            "author": "smahabir"
        },
        {
            "level": 0,
            "comment": "&gt;Think slow and move fast.\n\nthis is my new mantra x3",
            "score": 2,
            "author": "czerwona-wrona"
        },
        {
            "level": 0,
            "comment": "What if Thomas was also found dead beneath that tree behind the theater because he \"died of cardiac arrest\". Then that evil organization would be equally confused.",
            "score": 2,
            "author": "JackStrait"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "@OP there is a tik-tok account stealing your content. I can’t report them because I’m not the owner of your story. There account is @askthereddit",
            "score": 2,
            "author": "novakman",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 3,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That was powerful and beautiful, thank you for sharing it with us.",
            "score": 2,
            "author": "Darel_L"
        },
        {
            "level": 0,
            "comment": "I'm so glad you and Rachel are at least facing this together.",
            "score": 2,
            "author": "yousmellexcited"
        },
        {
            "level": 0,
            "comment": "I wanna cry 😭",
            "score": 2,
            "author": "4ourr"
        },
        {
            "level": 0,
            "comment": "Awesome, so glad it worked out for you both!!!",
            "score": 2,
            "author": "I_am_number_7"
        },
        {
            "level": 0,
            "comment": "Always love to see a continuation of a different thread from this web. It just keeps growing. Soon it will envelop all the worlds. Our own, and all the others.",
            "score": 2,
            "author": "Deadbreeze"
        },
        {
            "level": 0,
            "comment": "You guys should marry each other",
            "score": 4,
            "author": "[deleted]"
        }
    ]
}