{
    "id": "bvy4vv",
    "score": 16267,
    "title": "We’ve been stuck in construction traffic for 8 hours now. If we leave our vehicles we will die.",
    "author": "nslewis",
    "date": 1559487141.0,
    "url": "https://www.reddit.com/r/nosleep/comments/bvy4vv",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/nosleep/comments/bxoscy/we_were_stuck_in_construction_traffic_for_8_hours/)",
        "https://www.reddit.com/r/nosleep/comments/byqo1k/we_were_stuck_in_construction_traffic_for_8_hours/)"
    ],
    "postText": "Lauren is in the Honda Accord right behind my truck, with our two cats, but I can’t get out and see her. The last guy who got out was shot in the legs and then run over by a tank.\n\nWe set out yesterday from Gainesville, Florida, where Lauren had recently graduated from law school. We were moving to my home state of Maine, to start a permanent life together. The drive was beautiful most of the way, and Lauren and I spent a lot of time on speaker phone with each other to comment on it. A couple of times we passed through rain, and once a really wild thunderstorm that lit up the whole sky for miles. Then, about 8 hours ago, we hit a traffic jam on I-95 just outside of Lewiston, Maine.\n\nI took a look at the navigation thing on my phone, but it didn’t show any red areas of heavy delay. It also had some trouble showing my exact location, though, so I lit a cigarette and figured it would just be a few minutes.\n\nAfter about fifteen minutes, I called Lauren. “How’s it going back there?” I asked. In the background, I could hear the cats going nuts.\n\n“Not great,” said Lauren. “Do you hear Hankie and Hattie howling? They started up as soon as we stopped. What's going on?”\n\n“Must be an accident that just happened. My phone usually gives a heads up if there’s planned construction or something.” I heard one of the cats hiss while the other one yowled.\n\n“I’m so tired,” said Lauren.\n\n“I know, me too. Let’s stop and get something to eat once we’re through, yeah?”\n\n“Okay.”\n\n“Alright. Love you. Sorry about the cats.”\n\n“Love you,” said Lauren.\n\nI hung up and tried to get something on the radio. I have a base model 2006 Toyota Tundra, so no AUX jack, and the CD player had broken years ago. During the entire trip, I had been at the mercy of radio stations, and for the most part, they didn’t do much for me other than create a general atmosphere of annoyance.\n\nNow, though, I couldn't even keep the radio on. What wasn't warbling static was some kind of distorted robotic voice reading off a list of numbers and random words strung together. Across the whole radio band, same thing. I couldn't take it so I shut it off.\n\nI picked my phone back up and went to check Twitter. All I got was that game where you have to jump the dinosaur over cacti faster and faster and then it gets dark out and the birds come. No internet. Finally, Twitter did half-load, so there was *some* intermittent reception there, barely.\n\nAfter a half hour had passed, I started to get antsy, and so did everyone else. People were sticking their heads out the window to try to see what was going on, but it was no use. The line of cars seemed endless. A few people got out of their vehicles to try to get a better look. I got out too and started walking to Lauren’s car.\n\nWhen I was halfway there, a voice cut into the air. It sounded like someone shouting through a bullhorn. “Return immediately to your vehicles! No one is permitted to be outside! This is your only warning. If you do not heed it, there will be severe consequences.”\n\n“Wha da *fuck* is goin’ on?!” some guy shouted in a thick Boston accent; he was standing a few car lengths in front of me. An instant later, he was down on the ground, not moving. I didn’t see what happened exactly, but that was enough to make me to hustle back to my truck.\n\nI tried calling Lauren again. When she answered all that I could hear were broken flashes of the cats screaming and Lauren sounding scared and begging to know what was happening.\n\n“I don’t know,” I said, not sure that she could hear it. “Maybe they’re searching for a criminal or something. I don’t know.” Then we were disconnected.\n\nA minute later, an ambulance was wailing its way down the right hand shoulder. It stopped just past my truck, and two EMTs jumped out of the back. They closed the doors behind them, but I saw that there was somebody else in there. Somebody dressed in riot gear, holding a big gun.\n\nThe EMTs dragged the guy with the Boston accent by the arms over to the ambulance. They opened the doors and sort of tossed him in, and then followed behind. I saw the riot gear person again for a second, and then the doors slammed shut and the ambulance sped off down the shoulder out of sight.\n\nSomebody four cars ahead of me got the idea to follow the ambulance out of there. I watched as a red Hyundai Sonata with a New Jersey license plate tore into the shoulder lane and sped after the ambulance.\n\nI tried calling Lauren to ask her if she thought we should try it too. It was a ballsy move for sure, but she had sounded at the end of her rope stuck in there with our wailing cats, so I thought she might be willing to give it a shot. This time, the call didn’t even go through.\n\nI was getting ready to try calling again when I heard this loud blast. A puff of smoke blossomed somewhere up ahead, and all of a sudden, there were chunks of a car flying through the air. A red car. Very likely a red Hyundai Sonata.\n\nAs I watched a flaming tire roll to a stop against the highway divider, I decided not to replicate New Jersey’s maneuver.\n\nI heard the blast of a horn behind me, and looked in the rearview to see that Lauren had her arm out the window, moving her hand around in a circle. Finally, it hit me that she was telling me to roll down my window, so that’s what I did.\n\n“Can you hear me?” she shouted.\n\n“I can!” I could even hear the cats. They sounded really freaked out.\n\n“What is happening?!” she asked.\n\n“I don’t know baby! I think we’re in some kind of military lockdown maybe! I think we have to just sit tight here.”\n\n“Can you throw me a bottle?” asked Lauren.\n\n“What?”\n\n“A bottle! Like Gatorade or something. I know that you’ve probably got ten of them in your front seat.\n\nIt was true. Not ten exactly, but close enough. I just threw all of my trash on the seat of my truck until it started overflowing, whereas Lauren kept her car clean. “What are you going to do with the bottle?” I asked.\n\n“Not something I want to shout out for the whole world to hear!” said Lauren. “Let’s just say we’ve been here a while and I don’t think we’re coming to a rest stop soon enough.”\n\nFinally, I understood. I reached over and grabbed a bottle. I chucked it out the window, but it was a bad throw, and bounced off the hood of Lauren’s Honda. I tried again, and this time she caught it. She rolled up her window and in the rearview mirror I watched her fuss around as she presumably tried to pee into the thing.\n\nThis was when the fleet of massive trucks started rolling in, on the southbound side of the highway divide. Some of them had cranes sitting on long flat beds, and others had big chunks of some kind of metal material. Soon, the southbound side was jammed up with these giant trucks and their haul. Then they started to get to work.\n\n“What are they doing?!” asked Lauren. She’d opened her window back up. “Are they… building a fucking *wall*?!”\n\nThat is exactly what it looked like they were doing. One crane would take a massive chunk of material, and lift it into place either next to, or on top of, another chunk.\n\n“Yes! They’re walling us in!” I shouted. I checked my phone for the thousandth time. I had a bar, and used it to call 911.\n\nA lady answered. “What is the address for this emergency?”\n\n“I… uh… I-95 northbound, just before Lewiston, Maine. I forget the exit number we were coming up on. I’m sorry.”\n\n“That’s okay. What is the emergency?”\n\n“Well… we’re in this weird traffic jam… and… people are dying here. Cars are exploding. They’re building a wall around us. They’re trapping us here. I know that sounds crazy….”\n\nThere was a long silence on the other end. I thought maybe we’d been disconnected. But then I heard her voice again, crystal clear.\n\n“Sir, I am going to need you to remain calm and stay in your vehicle. And if you would, roll down your window. Not the driver’s side, the passenger’s side.”\n\n“W… what?” I asked. Then I heard the tapping at my window. There was a lady cop standing there, holding a cell phone up to her ear. My heart jumped up into my throat, and my instinct was to slam my foot on the gas pedal, but there was nowhere to go. I rolled down the window.\n\n“You reported an emergency?” asked the cop. “Everything looks okay to me. We don’t discourage anyone from calling emergency services if they truly think that there might be an emergency situation occurring, but everything appears to be perfectly fine here. I will give you the benefit of the doubt this time, but remember that we also very strongly frown upon fraudulent 911 calls. You could be charged for that, sir. It’s no joke.”\n\n“Oh,” I said, trying to hold it together. “I’m sorry about that. I *did* think that something bad was going on, but now I see that everything is okay. Thanks for checking in.”\n\n“It’s no problem at all, sir,” said the cop, smiling. “And remember: *stay in your vehicle*.”\n\n“Of course,” I said, trying to smile, though I’m sure my face looked like a sweaty pretzel instead.\n\nThe cop nodded and then walked off down the line of cars. I waited a few minutes, and then called out to Lauren.\n\n“I think we’re fucked!” I said. “I called 911 and that cop that was just here? She’s the one who picked up. She said everything’s fine… but it’s not.”\n\n“Fuck!” said Lauren. “What do we do?!”\n\nThat’s when the guy jumped out of his car and made a break for the wooded area to the right of the highway. And that’s when they shot him in the legs. I heard him cry out and watched him hit the ground. I heard a loud continuous rumble, interspersed with snaps from the woods. Then I saw the tank. It didn’t so much emerge from the woods as it destroyed the woods in its wake. Beyond it, I saw another enormous wall. We were walled-in from two sides… and my guess was that we were walled-in from four sides.\n\nThe tank crushed the man like he was a particularly small ant.\n\n\\*\n\nThey are working on the roof now. It's almost done. Once the roof is on, I have a feeling that I won't get any reception at all. Before that happens, I'm hoping for one more spike so that I can get this post out.\n\nI don't know if this is on the news or not. I thought it was just a traffic jam, so that's probably how they're playing it off. They probably have rerouted traffic around us by now.\n\nI don't know what this is. But there are now dozens of heavily armed people in riot gear going from car to car. Sometimes they drag somebody out, and carry them screaming off to what remains of the wooded area, where they disappear from sight.\n\nThey're almost at my truck now. I hope they skip me, and Lauren. Oh God. I'm going to tell her that I love her.\n\nIf this reaches you, I don't know what you can do, but please try to help us.\n\n&amp;#x200B;\n\n[Part 2](https://www.reddit.com/r/nosleep/comments/bxoscy/we_were_stuck_in_construction_traffic_for_8_hours/)\n\n[Part 3](https://www.reddit.com/r/nosleep/comments/byqo1k/we_were_stuck_in_construction_traffic_for_8_hours/)",
    "comments": [
        {
            "level": 0,
            "comment": "It's good you have this in writing because it's pretty likely you won't remember a thing once the perpetrator has been detained. Having this information could cause you to be the reason of another \"traffic jam\" though so I'd suggest not digging further into this.",
            "score": 1447,
            "author": "whyshouldyouwakeup",
            "replies": [
                {
                    "level": 1,
                    "comment": "You sound like someone with experience. 👀",
                    "score": 374,
                    "author": "Riciehmon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Perhaps",
                            "score": 168,
                            "author": "whyshouldyouwakeup",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Username... I don’t think OP will survive...",
                                    "score": 87,
                                    "author": "Shockerdawg"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Indeed.",
                    "score": 7,
                    "author": "toxins020"
                },
                {
                    "level": 1,
                    "comment": "Hmmm",
                    "score": 32,
                    "author": "BSGYT",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hunting for aliens. Be sure to have several IDs ready and a good excuse of why you're going where you're going",
            "score": 347,
            "author": "LittleSansbits"
        },
        {
            "level": 0,
            "comment": "Yeah, that sounds like a New Jersey maneuver.",
            "score": 1985,
            "author": "Dark_Shade_75",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also pretty standard for I-95 anywhere north of Richmond, VA.",
                    "score": 313,
                    "author": "dreamtofalligators",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, would not reccomend.",
                            "score": 56,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "After living in Stafford, can confirm",
                            "score": 37,
                            "author": "samsamh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yo! Stafford! People still drive like dicks here!",
                                    "score": 11,
                                    "author": "jcwiler88",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Live in Richmond can confirm",
                            "score": 10,
                            "author": "moonlitfaeriexx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is why I take 301 and work nights.",
                                    "score": 5,
                                    "author": "GSM_Heathen",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Facts",
                                            "score": 3,
                                            "author": "moonlitfaeriexx"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "301 really sucks too",
                                            "score": 2,
                                            "author": "anonbaddie",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 313,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 70,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 40,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 36,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 17,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 14,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 47,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 13,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 9,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That was also my first thought. NJ represeeeent",
                    "score": 39,
                    "author": "owlrecluse"
                },
                {
                    "level": 1,
                    "comment": "Indeed, same thing I thought. Right up there with the jersey slide (changing over 2-3 lanes at once).",
                    "score": 45,
                    "author": "Twohip4school"
                },
                {
                    "level": 1,
                    "comment": "That is **exactly** what I thought when I read that. After almost ending up in accidents because of that maneuver being pulled by someone with New Jersey plates, amongst all of the *other* bullshit moves, I can't honestly say that I felt at all bad when it exploded. (Anyone beyond emergency personnel pulling that shit is a self-centered douchebag. Don't be a douchebag.)",
                    "score": 86,
                    "author": "k8fearsnoart",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "at least nj drivers KNOW what they’re doing, regardless of how stupid or dangerous it is. i can’t express the amount of times ny drivers went full autismo on me and essentially forgot every rule of the road.\nanecdotal evidence but fuck ny drivers, really.",
                            "score": 11,
                            "author": "baron_von_marrone",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "NY drivers are physically incapable of driving anywhere outside of the state",
                                    "score": 18,
                                    "author": "AlphaNinerEightBravo"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah, that's true, too. I always found it funny that on my trips to Rochester, NY around 25 years ago, (Oh, wow, I'm feeling old!) that the drivers were excellent when driving in snow of any depth; 3 inches to 43 inches, whatever the depth and conditions, it didn't faze them and they drove so well. But, when there's no snow on the ground, it's 72°F and sunny, *then* they suddenly couldn't drive well at all! My little sister's boyfriend just graduated from RIT, and she's been going up there to see him while he was still in school, and then for graduation. I had told her about my experiences up there so long ago, and she started laughing. She said that it was still exactly like that! \n\nObviously, this isn't every single New Yorker or New Jerseyan. But even one percent is still one hell of a lot of people.",
                                    "score": 9,
                                    "author": "k8fearsnoart"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hey man, with a population density like this, you gotta learn to drive aggressively.",
                    "score": 11,
                    "author": "HelloIAmHawt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I didn’t say I didn’t drive like that.\n\n;)",
                            "score": 6,
                            "author": "Dark_Shade_75"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 12,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 13,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ah, standard alien barricade. Just don't act normal at all when they get to/check your truck, don't jump out though, that would be a rather normal reaction as well. Remember, aliens will try to act as normal as possible.",
            "score": 1306,
            "author": "DeathToIslamGamer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Its the cats they have to be worried about I reckon",
                    "score": 225,
                    "author": "kaza27k",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The cats are Flerkens and one of them is containing the Tesseract",
                            "score": 321,
                            "author": "Datbundo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you. There are a lot of people who have spent a lot of time looking for that.",
                                    "score": 66,
                                    "author": "UrethraFrankIin"
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh shit",
                                    "score": 23,
                                    "author": "LIyre"
                                },
                                {
                                    "level": 3,
                                    "comment": "I've dreamt of it again. Only this time, I was able to actually pick it up. What could that mean?",
                                    "score": 4,
                                    "author": "DeathToIslamGamer"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ooh, you fell for it.  Sorry.\n\n**Always** take 295 through Portland, despite what the signs say - They meet back up in Gardiner, but 95 is literally 20 miles longer *and* has more tolls.  100% fewer alien roadblocks, too.",
            "score": 94,
            "author": "ribnag",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Could it be because of some virus?\nTake care OP! Save Lauren and the cats",
            "score": 266,
            "author": "InSpaceAndTime",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I thought it was a virus, too.",
                    "score": 74,
                    "author": "TheMostCrypticCrab",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't know,about that, if that's the case how does it spread? Can't be airborne if the cops, EMTs and military are walking around with no protection gear. And then the building a box over them seems weird.",
                            "score": 64,
                            "author": "GaiasDotter",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What if it's zombies? Then the wall would make sense. And maybe that's why the guy in the ambulance was in riot gear. And then it wouldn't necessarily have to be airborne, it could be spread through contact with bodily fluids.",
                                    "score": 55,
                                    "author": "TheMostCrypticCrab",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "God I hope not, I fucking HATE zombies! Nothing terrifies me like zombies. Also they are freakin nasty :/",
                                            "score": 14,
                                            "author": "GaiasDotter",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, zombies are pretty terrifying, and DEFINITELY nasty. But personally, I think that's what makes them so great for horror stories. Especially stories like the one above, where we see how law enforcement deals with it (albeit probably not in the best way).",
                                                    "score": 6,
                                                    "author": "TheMostCrypticCrab"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "If it's zombies then why the wall?? Are they trying to trap the zombies inside and that's why they are checking each car?? Or are they barracading themselves in from the zombies outside??\n\nDuring a zombie apocalypse ppl usually do one of two things: 1. Save themseleves. 2. Protect the human race from extinction. But attaking those who seems to be innocent ppl does not support either of these motives...",
                                            "score": 9,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Maybe they think patient zero is somewhere in there, and they're trying to contain the infection?\nEdit: Maybe the infection takes a little while to set in, and they're pulling people out of the cars to try and check for early signs of infection.",
                                                    "score": 11,
                                                    "author": "TheMostCrypticCrab"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Slow activating like how they could detect it in I Am Legend",
                                    "score": 3,
                                    "author": "psufan5050"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope you guys get out somehow. Keep the rest of the Gatorade though...",
            "score": 84,
            "author": "SadNAloneOnChristmas",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's what plants crave!",
                    "score": 34,
                    "author": "CupcakePotato",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It has electrolytes!",
                            "score": 26,
                            "author": "bcombest1",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think you should try to listen to the radio again, write down the numbers. I have no idea what’s going on but it’s terrifying.",
            "score": 71,
            "author": "before-the-fall"
        },
        {
            "level": 0,
            "comment": "Oh, everything's okay, OP. Just remember, stay in your vehicle.",
            "score": 67,
            "author": "KeksGaming"
        },
        {
            "level": 0,
            "comment": "My guess is they put a roof on the walls and he gets no signal, so we arent going to get an update...",
            "score": 341,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Sounds like they’re just trying to trap you guys in, and by tmrw morning everything will seem fine on i95 It’ll be just another hill on i95. Op should be able to hear traffic going on the roof.",
            "score": 50,
            "author": "MunchieDyfed"
        },
        {
            "level": 0,
            "comment": "i hope the kitties are ok",
            "score": 547,
            "author": "miachong06",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's all I care about. I hate hearing about the pets",
                    "score": 222,
                    "author": "aarovski",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hopefully they are left alone and can eat.",
                            "score": 40,
                            "author": "ladylei",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I just hope they don’t eat Lauren",
                                    "score": 12,
                                    "author": "colddeadsoul"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Don’t worry too much about the pets, sir, madam, or other honorific appropriate for your gender/universe. We at the IDPPS do our best to keep all your furry little friends as safe and comfortable during times of apocalyptic severity. \n\nAfter our founder’s own universe was destroyed by a particularly nasty strain of the Flavivirus devastated her world. Using her considerable time and resources, as well as an intellect that we at the IDPPS call “remarkably brilliant,” she developed a series of inventions that allowed transport between parallel timelines. \n\nOur mission is to use our resources to bring peace and safety to domesticated animals across the multiverse that may be otherwise adversely affected by X-class World Ending Scenarios, though we’ve been known to step in for the occasional D-class or K-class too. When we detect that a significant number of dogs or cats are in danger, we at the IDPPS just hop on over and nab ‘em out of trouble. It’s that simple! So next time your world is in danger of ending or your humanoid species is in danger of extinction, worry not. The IDPPS will be there post haste to rescue your pets and raise them to live their best and fullest lives in a universe where they’ll be given the love and nurturing that you’ll no longer be able to provide. \n\nHave a wonderful rest of your world!",
                            "score": 23,
                            "author": "coyoteTale"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same. Like please FBI, leave the kitties alone ;;",
                    "score": 6,
                    "author": "I_need_to_vent44"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I looked up I-95 Maine and saw that an accident occurred at 12:45 which is around when they posted.",
            "score": 44,
            "author": "LadyLuna1467",
            "replies": [
                {
                    "level": 1,
                    "comment": "Woah wtf",
                    "score": 9,
                    "author": "Ace_Phant0m"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 85,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 79,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 15,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 76,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 27,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 50,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That remains unsolved",
                    "score": 8,
                    "author": "DamienDutch"
                },
                {
                    "level": 1,
                    "comment": "Or cabrios, not the convertible type, just cabrios.",
                    "score": 2,
                    "author": "Winjin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 168,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I sincerely believe that OP will remember nothing of this if he actually ever gets out of there.",
                    "score": 3,
                    "author": "NattyChick"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 12,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Governments probably working on some human experimentation shit so they're abducting people...probably",
            "score": 23,
            "author": "taeoh666",
            "replies": [
                {
                    "level": 1,
                    "comment": "Surely there are more efficient ways to ubduct ppl. Unless this is part of the experiment...",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was thinking maybe box them in and fill the box with some kinda alien bio weapon as a test or such",
                            "score": 2,
                            "author": "taeoh666"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Be careful! And please update us if you can!",
            "score": 140,
            "author": "The_Shy_Yeti",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It sounds like an emergency quarantine. But what are they trying to keep inside? Or what are they trying to find?",
            "score": 49,
            "author": "indecisive_maybe",
            "replies": [
                {
                    "level": 1,
                    "comment": "Better yet: who are they? Are they human? Or something else?",
                    "score": 23,
                    "author": "helpimstuckinthevoid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Could they even possibly be dancers?!",
                            "score": 3,
                            "author": "MymlanOhlin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 61,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The poor cats",
            "score": 60,
            "author": "LePerfectionist"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 29,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 7,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe some kind of infection outbreak in that area?",
            "score": 13,
            "author": "Daisy-Fields"
        },
        {
            "level": 0,
            "comment": "Why would they wall the place just to kill everyone? They're up to something big.",
            "score": 9,
            "author": "atmagic",
            "replies": [
                {
                    "level": 1,
                    "comment": "The question is, *what*?",
                    "score": 6,
                    "author": "QuantumSp00k"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope everything turns out alright for you guys..",
            "score": 15,
            "author": "VixenGirl163"
        },
        {
            "level": 0,
            "comment": "I'm so glad I'm done going cross country for a couple years, but I know for a fact next time I do this is going to be on my mind. Good luck OP",
            "score": 14,
            "author": "scozta"
        },
        {
            "level": 0,
            "comment": "The mistake is Lauren isn’t driving a Type R. Because if she was she could drift her way out.",
            "score": 16,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "all you gotta do is hide in between the backseats and the front seats and you wont get shot or pulled out........... hopefully",
            "score": 16,
            "author": "perfec7insani7y666",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd advise against that. It seems as though they are killing everyone who doesn't go along with what they r being told to do. Probs ur best chance of survival is to do what they say and not draw attention to urself",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey there, I'm really sorry to hear about the hell you're trapped in. I'm in Portland, Maine, and I haven't heard anything about this, so they must be trying to keep whatever they're doing secret. Lock your doors and maybe try to get some rest? I can't believe something like this could be happening in our quiet state! I really hope you guys get out of there okay.",
            "score": 40,
            "author": "glamorousmisanthrope",
            "replies": [
                {
                    "level": 1,
                    "comment": "Apparently they were almost to his car when he posted this. I doubt he's getting much sleep.",
                    "score": 8,
                    "author": "UrethraFrankIin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I live in Gainesville, and I don't think I want to make the trip up to Maine any time soon.",
            "score": 23,
            "author": "beatkeepah"
        },
        {
            "level": 0,
            "comment": "If you make it out, please tell us what the hell happened! I'm hoping both of you make it out!",
            "score": 11,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Let us know, if you can, when they deliver your bunker to..well..where ever it's going. Because you can bet, with a roof on it now, it's going somewhere..",
            "score": 5,
            "author": "Jay-Dee-British"
        },
        {
            "level": 0,
            "comment": "Release the cats. Tell Lauren to let them out from their crates. No SWAT teams can beat the hissing, swatting, scratching, clawing ball of motion that is a scared cat. And you have two.\n\n\nSource: I do animal rescues.",
            "score": 7,
            "author": "aqua_sparkle_dazzle"
        },
        {
            "level": 0,
            "comment": "I tried to help so I came down 95 where you said, but everything seems fine. Just stay in your vehicle, and stay calm. Maby you slipped into alt dimension n that's why cats are goin nuts too??",
            "score": 20,
            "author": "Twohip4school",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or they already finished building and traffic is going over OP as we speak.",
                    "score": 15,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are you there OP?",
            "score": 8,
            "author": "Miss-Hell"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Course the guy following the ambulance is from jersey",
            "score": 4,
            "author": "-stoned"
        },
        {
            "level": 0,
            "comment": "We will never know what happened.",
            "score": 10,
            "author": "Sll3006"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It’s been 14 hours OP, I do hope you both are alright, and that the cats saved you.\n\nEdit: I’m reading this as my cat is purring beside me laying with one eye open...",
            "score": 10,
            "author": "TormentedOne69"
        },
        {
            "level": 0,
            "comment": "Man, you sound like your in a hell of a situation. If you ever get reception again and still have memory of this, please update us! Be safe out there.",
            "score": 7,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Do you see the construction workers building the roof? maybe something seems off about them.",
            "score": 4,
            "author": "shininstuff"
        },
        {
            "level": 0,
            "comment": "Government must be trying to protect you from a virus or aliens.\n\nAt least that's my consensus after reading some of the comments.",
            "score": 4,
            "author": "IamBarn"
        },
        {
            "level": 0,
            "comment": "...I travel this stretch of I-95 once a week. I have decided I will not do that this week.",
            "score": 5,
            "author": "selenagnomez"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 11,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cats make a wailing sound that is a bit like howling, only it's actually referred to as yowling and they generally only do it under extreme duress...*like being faced with an unfamiliar \"animal\"*, if you get my meaning.\n\nI can't say much, and maybe I'm saying more here than I should but, you see, I've done some governmental research on the response of felines to alien life fo",
                    "score": 21,
                    "author": "ambthab"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Canada is invading Maine",
            "score": 8,
            "author": "mregger",
            "replies": [
                {
                    "level": 1,
                    "comment": "The invasion we all needed",
                    "score": 7,
                    "author": "HowToBeReverseCarded"
                }
            ]
        },
        {
            "level": 0,
            "comment": "8 hours? Let me tell you about this place called the Grapevine.",
            "score": 4,
            "author": "Dreezy523",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The worst thing about this is that I’m pretty sure I’d be Boston Man in this situation.",
            "score": 5,
            "author": "-kerosene-",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 14,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "HWY 290 in Houston; been there...",
            "score": 5,
            "author": "MacSteele13",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Seeing as they are taking time to trap u guys in and are selectively separating u guys (pulling some out of cars whilst leaving others), I'd say they dont want to kill u all just yet. In saying that, they have shown that are obv fine with killing anyone who doesn't follow their rules so pls (unless u know for certain that they r about to kill u) go along with what they say.\n\nYou could try to listen to the radio, work out what it's saying - maybe the numbers/words are code?? But don't draw attention to urself. It seems that what ever is going on is way larger than u so chances are ur not gonna figure out what's going on.\nMy thought are with you all. Stay safe",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "So let's see...\n\n1. Not zombies. Unless they've caght outbreak in the fetal stages. Anyway, OP is screwed.\n2. Hunt for aliens. This one makes no sense what so ever.\n3. Chtulhu and Co? Well, who the hell know.\n\nAnyway, it will be interesting to know what the actual heck is going on. Because nothing is worse than unknown.",
            "score": 4,
            "author": "Plungermaster9",
            "replies": [
                {
                    "level": 1,
                    "comment": "zombies makes sense. hence the riot gear on the man in the ambulance that picked up the first guy shot and why the next two bodies were blown up or crushed by a tank afterwards. the fact that its walled a sealed tells me they're prepared to self annihilate in the event they lose containment and compromise the mission. it's very likely patient zero has already been discovered and they have traced the outbreak down to somewhere along that route of highway. this is clearly a DEFCON 1 control team.",
                    "score": 2,
                    "author": "cannabisized",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "DEFCON is usually Defense Conditions.  I grew up near an Air Force base and a National Guard base.",
                            "score": 2,
                            "author": "SaraWyndspryte"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As long as the cats are alright I could care less",
            "score": 21,
            "author": "gloreeuhboregeh",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 9,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 9,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hope the cats will be Ok :(",
            "score": 11,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It's I-95. This doesn't really suprise me.",
            "score": 4,
            "author": "mamasmurf1978",
            "replies": []
        },
        {
            "level": 0,
            "comment": "be careful op. I hope there are no zombies♡♡♡",
            "score": 3,
            "author": "essentiallycallista"
        },
        {
            "level": 0,
            "comment": "Man if you only you had a gatpiece on you",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Hopefully you can update us soon, just remember when they take the cats do not fight and remain in your vehicles it will all be over soon",
            "score": 3,
            "author": "KiloCharlieOscar59"
        },
        {
            "level": 0,
            "comment": "Maybe They think you saw something you shouldn't have seen. Maybe They need to destroy evidence. Witnesses are evidence. They are in total control of you now.",
            "score": 3,
            "author": "tootswerk"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 3,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If you manage to get a bar, pls update! Good luck man",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "What the hell did that thunderstorm do to you guys?! And how long have governments known about the storms?",
            "score": 3,
            "author": "lastfirstborn1"
        },
        {
            "level": 0,
            "comment": "op am lying in culvert pip abt 1000yd frmo wall area, dipped out hid in smoke from exploding car, was rocket or bomb that got him can see construction thought 2 check reddit nosleep, gas station sign up ahead all traffic normal otherwise, @ dark will get up cross highway hang tight will get help",
            "score": 8,
            "author": "SantGamer"
        },
        {
            "level": 0,
            "comment": "Sir, this is all done for your personal safety. Please follow the instructions of our first responders on site, remain calm and do not spread false reports or leave your vehicle.",
            "score": 2,
            "author": "Pavlos"
        },
        {
            "level": 0,
            "comment": "Perhaps, their searching for terrorist that would explain the people trying to make a break for it stay calm!",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Stay in your vehicle.",
            "score": 2,
            "author": "LeakyLine"
        },
        {
            "level": 0,
            "comment": "I think they are trying to save you from invader aliens. Relax.",
            "score": 2,
            "author": "aminastar"
        },
        {
            "level": 0,
            "comment": "Well, first\nIf you have food, water, etc\nYou should be fine.\nAs long as they actually keep you in your cars.\nIf they don’t keep you in your cars, your very much screwed-\nI’ve never heard of this type of situation, but, hopefully there intentions are ‘good’",
            "score": 2,
            "author": "Cant_Kill_The_Queen"
        },
        {
            "level": 0,
            "comment": "Well,all i can do is to wish you good luck, i hope you're alive.",
            "score": 2,
            "author": "Eurobeat_Addict"
        },
        {
            "level": 0,
            "comment": "Construction traffic? I’d just walk out, I’m not sitting in that until I lose my sanity.",
            "score": 2,
            "author": "TheNuclearMemelord"
        },
        {
            "level": 0,
            "comment": "I shouldn't have read this before heading out during peak times. Now stuck in traffic and glancing furtively everywhere to not see bricks, cement or soldiers",
            "score": 2,
            "author": "brinzel"
        },
        {
            "level": 0,
            "comment": "OP if you're still alive, see if there's anything you can use to Hotwire the car to cause a minor explosion where maybe an ambulance will come and get you",
            "score": 2,
            "author": "Yuto_Lukashenko"
        },
        {
            "level": 0,
            "comment": "Good Luck! And *Don't Get Out Of Your Car!!!*",
            "score": 2,
            "author": "MagicalDoggo9000"
        },
        {
            "level": 0,
            "comment": "Classic Lewiston. Pretty happy they walked it in.",
            "score": 2,
            "author": "IUrinateOutside"
        },
        {
            "level": 0,
            "comment": "hey op, i think about this story alot",
            "score": 2,
            "author": "[deleted]"
        }
    ]
}