{
    "id": "cmykhy",
    "score": 14339,
    "title": "The previous tenant of my new flat left a survival guide. It’s time to end this madness.",
    "author": "newtotownJAM",
    "date": 1565137227.0,
    "url": "https://www.reddit.com/r/nosleep/comments/cmykhy",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/nosleep/comments/clvga9/the_previous_tenant_of_my_new_flat_left_a/?utm_source=share&amp;utm_medium=ios_app",
        "https://www.reddit.com/r/nosleep/comments/h86ihe/the_previous_tenant_left_a_survival_guide_the/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)"
    ],
    "postText": "Last time: https://www.reddit.com/r/nosleep/comments/clvga9/the_previous_tenant_of_my_new_flat_left_a/?utm_source=share&amp;utm_medium=ios_app\n\n\nWhen I saw her out the window, garden shears being gripped by both hands and a maniacal expression on her face, I just stood still. \n\nI was frozen to the spot in shock. I felt no pain at all from the burn on my face, everything was numb. The relief of eradicating the imposter neighbours and the joy at finding a friend in Derek was hacked away in an instant. Just like every leaf from my shrubs. Why would she do this? What had I ever done to her? \n\nEvery question possible crossed my mind. I could feel the frustration bubbling inside me, everything about this place just threw up question after question and for every answer I got, there were ten new questions waiting to be asked. At that moment in time though, only one was truly important. \n\nHow did Prudence know? \n\nI thought about Terri and her telephone conversations. I didn’t want to think that the sweet lady I thought Terri had turned out to be would do that, but it did cross my mind. I thought of Ian the postman, I’d had bad vibes from him for a while, maybe he’d seen Derek coming up the stairs while on his rounds that morning.\n\nI stood there frozen pondering all these things until I saw Prudence collapse onto the memorial bench sobbing, head in her hands. She was surrounded by the remains of my attempt at a garden with the shears laid out on the floor. \n\nThe stairs were kind to me on the way down, it took 4 flights to make it to the bottom. I ran down the corridor and out the back entrance of the block, no idea what I was going to say. \n\n“Prudence!” Was all I could manage. Nice one, Kat.\n\nShe sat bolt upright before turning and standing quicker than I thought it possible for an old lady. \n\n“You evil, stupid little girl! Do you have any idea what you’ve done?!” She screamed, so much animation in her face that the spaces between her wrinkles pulsated like veins on an angry weightlifter. \n\n“Me?! You think I’m evil! You left that shitty note hidden, missing everything I need to know and got my boyfriend killed! And what you’re doing to your own -“ I screamed, tears beginning to roll, before she interrupted me. \n\n“Don’t you dare talk about her!” Her voice cracked and she broke down again, this time falling to her knees, twigs and leaves sticking to the bottom of her dress. \n\nI didn’t know what else to do. So I sat down on the floor. I knew that it was probably a bad idea, this woman couldn’t be trusted and I hadn’t forgotten that, but seeing an old lady crying on the cement floor still made me feel awful.\n\n“How did you know about the garden?” I asked her calmly, trying to change my approach. \n\nShe shoved a crumpled up piece of paper into my hand, she didn’t look at me, her eyes remained on the floor. \n\n*Dear Prudence,*\n\n*I couldn’t exist knowing what I’d done.*\n\n*I should never have told you about it.*\n\n*The last two won’t grow stronger, she was never theirs to begin with. But I have to end her suffering.*\n\n*I’m sorry.*\n\n*Derek*\n\nI knew what he had done as soon as I finished the note. Lyla, or what was left of her, was gone for good. Of all the creatures only Jamie’s killers from the lift remained. That’s how Derek had spent the few hours I’d slept between our encounters. \n\n“This is all your fault.” She sniffed. “My whole family are gone because of you.”\n\nThat hurt a lot. I trembled as I tried to speak but I always really hated confrontation and I could feel myself starting to glitch. \n\n“H..how can you say that! I saw... her and she was trapped in a tiny cage eating dog food and small animals. Your family died in that lift. Just like my Jamie.” I may have struggled to get my words out, but I wasn’t about to let Prudence Hemmings blame me for her decisions. Lyla was better off dead than what she was, however awful that may sound. \n\n“What happened to your face?” Prudence growled at me. “Take you to visit floor number 9? He did this to her in the first place, not me! And now he’s disfigured you!” She was spinning things. I could feel throbbing as she mentioned my face, I really should have had medical attention. \n\n“This isn’t his fault! You messed him up and he did that to her because of you! You told me that yourself.” I tried ferociously to defend Derek but something inside me still felt uncomfortable about what he had done. I couldn’t help it, Lyla was an innocent little girl who shouldn’t have been punished for Prue’s mistakes. This whole thing was such a mess.\n\n“I was grieving! And then I had her back for all those years, and then I lost Bernie, and then my home and now I have to grieve for her all over again.” Prudence continued to cry, but softer. I looked around at the chaos she created and up at the block my boyfriend had died in and rolled my eyes in disbelief that she could be so selfish. She continued.\n\n“Let me tell you about Lyla. She was a beautiful little girl. As I mentioned before, I have two other older children, they’ve had many other grandchildren, however I hadn’t spoken to my eldest two in years even before what happened with Lyla. \n\n“Lyla was my first opportunity to get to know one of my grandchildren. Bernie adored her too, always reading her stories and sneaking her sweets. \n\n“I begged my son to allow her to stay. My children were all incredibly ungrateful, they had it easy growing up and still resented me. I gave them a good, strict upbringing but they didn’t appreciate it. They said I was a cruel mother. Lyla’s dad was the only one I spoke to, but our relationship still wasn’t that of a typical loving mother and son. But she was a second chance. \n\n“It was a miracle when he agreed. I was more shocked he had convinced his wife to allow it. That awful harlot of a woman never liked me, although I didn’t like her either. \n\n“They refused to speak to me after everything, I haven’t heard from them since. They had more grandchildren I’ll never meet. I knew at the time my relationships with any of my children were over for good. So when Derek gave me a solution I took it.\n\n“I wasn’t entirely truthful when we first spoke. I said I hadn’t wanted this, but I was desperate. There was never a way to bring her back safely. Derek explained what she would become to me. He was initially trying to put me off even trying to get her back. I knew exactly what I was getting myself into. \n\nBut I couldn’t pass up the idea of my beautiful little Lyla, needing her grandma forever. I suppose I was too ashamed to admit it before. But why should I be ashamed?\n\n“My altercation with Derek happened after she was back, when he tried to kill her the first time. Spouting the same things on that note, what kind of monster wants to kill a little girl? That’s why I trashed the garden. He said he wasn’t coping with the news of the new block when he suggested it, that he shouldn’t have told me it was even possible and she had to die. I hid her until the bulldozers came in. \n\n“When he disappeared I thought I was safe to spend the rest of my life with her. \n\n“Bernie hated me. Spending time with Lyla was all I lived for, I grew to love her how she was.”\n\nI felt sick. Listening to Prudence talk bought up so many repressed feelings about Jamie. I hadn’t had time to grieve or process anything, I missed him terribly. My old life and my old future felt a million miles away.\n\nI was relieved to know that Derek hadn’t tricked Prudence, or even intended to create rat-Lyla. He was truly good.\n\n“But she didn’t get to have a life. You lived for her but she wasn’t really living. How could a sane person do that to their own flesh and blood?” I retorted.\n\n“You have no idea. This place can make you do irrational things! But she had a life! She had me. It’s all she needed.” She was certainly right about the building and irrational actions, the pain intensifying on my face throbbed in agreement. But I was still convinced she had lost it Dr Frankenstein style where rat-Lyla was concerned. \n\nShe had stopped crying. Her rage levels were rising again. I tried to tell her that it wasn’t really the child she’d known, but she seemed to have grown an entirely new attachment to the creature that replaced what she lost. \n\nEvery rational argument I gave was met with increasing levels of screaming. She got less coherent as she went on. The argument was going nowhere, we went back and forth for what felt like forever.\n\nAfter a while she started to get closer to me. We had both stood up by this point and despite her haggard and frail appearance, Prudence was truly frightening. She looked unhinged. \n\nHer words were no longer going in, I was overwhelmed and had too many thoughts rushing through my mind to process her ranting. I took a few steps back clearing a small distance between us. \n\nBy this point, out of the corner of my eye, I could see neighbours in windows of the block, watching the altercation outside, Prue’s screaming had bought a lot of attention. It was bright and I couldn’t see well but I turned to scan the windows and did recognise Eddie and Ellie watching from their bedroom, trying to wave at me. \n\nThey frantically waved and pointed, I tried waving back and gesturing to them, but they kept pointing at me.... why were they pointing?\n\nThen I heard it, the garden shears scraping against the ground as Prudence picked them up and charged towards me. “You ignorant little bitch! You aren’t even listening. You’re don’t deserve my home! You killed her!”\n\nThe twins had been telling me to turn around, I shouldn’t have taken my eyes off her. \n\nLuckily, unlike my earlier shock when I had first seen her, I didn’t freeze. My fight or flight instincts kicked in and I ran faster than I ever have before. I burst back into the building and heard neighbours on the bottom floor lock their doors in a symphony of bolts clicking. \n\nI couldn’t blame them. Prudence wasn’t far behind me and I wouldn’t want to take her on in her current state if given a choice. But it didn’t stop me pounding on their doors begging someone to call the police, although something told me that in this building that wasn’t going to happen. I ran up the stairs, still being followed by her. \n\nBy the second floor most were still locked but a few had come out of their homes, armed with a variety of heavy objects. Even in a crisis, I couldn’t fault the community spirit here. I ran another flight of stairs that became two but still lead me to floor 3 and then to the back of the corridor. I pounded on Terri’s door.\n\nMy heart was racing but when I turned Prue was nowhere to be seen. I was hoping the people who came out on floor 2 had stopped her but something was odd. I hadn’t heard any commotion. This wasn’t the end of it.\n\nEddie and Ellie hugged me tight as Terri let me in and bolted the door shut quickly behind me. I told her about what had happened. She couldn’t believe what Prue had done. It turned out no one knew about Lyla. \n\nI was edgy for the first hour. But Prue had disappeared. Terri helped to clean up my burn and put some cold compress on it. She offered to take me to the hospital, but I couldn’t. \n\nI was too shaken up from what had just happened, I couldn’t face trying to explain how I’d sustained my injuries and I still hadn’t reported Jamie missing. He still hadn’t had any messages from his family, and work had given up calling, but his friends had started. They were harassing me non stop but I had been too distracted to come up with a decent lie.\n\nIt had been a week since I moved in and it wouldn’t be long until people realised something was seriously wrong. My conversations with my family had been short, with me insisting they didn’t visit until we were “unpacked and set up”. \n\nOn top of a murderous old lady and an untold amount of abnormal issues the real world problems were starting to creep up on me. \n\nI sat with Terri for hours, drinking tea and chatting to her. It started to get dark and Eddie and Ellie came into the living room after playing in their room for a while. The voids replaced the big, brown puppy dog eyes again and their claws looked especially sharp, but to me they were still adorable. \n\nTheir transformation prompted me to head back to my flat, it was late. I needed to work out what to do next and how to dig myself out of this giant hole. I couldn’t just keep planting gardens. I needed to do this myself. \n\nI wandered up the stairs, they went on for a while, but nothing too horrific. I passed the man on floor 5, nodding politely and continuing my ascent. I wondered if he’d received the letter of concern yet, he was a little unsettling. \n\nWhen I got to my floor Mr Prentice was making his animal noises again. I smiled, which hurt my face. After all the madness I was starting to find the seemingly benign horrors of this building oddly comforting. \n\nI reached my flat and turned the key in the door before bolting myself in like Terri had. \n\nI could feel something wasn’t right the moment I entered. The flat was in chaos, which was nothing new because we had only moved in a week ago and I had been too preoccupied to unpack. But things were out of place, the organised chaos wasn’t how I’d left it. \n\nThen she strolled out of my kitchen. Prudence Hemmings. She was carrying a large carving knife in her left hand this time, she had prepared for her attack. She smiled at me and lifted her right hand, jingling a set of keys that she had entered with. \n\nI turned to unbolt the door but she grabbed me from behind before I could turn the handle to open it and held the knife to my throat. \n\n“I will kill you for what you’ve done.” She whispered into my ear. \n\nWithout a second thought I leaned forward just a tad and swung my head back as hard as I could. I couldn’t believe that it worked but I must have broken her nose. Prudence dropped the knife and clutched her face, blood streaming between her fingers. \n\nI went to grab the knife but she was closer and doing the same thing. I had no other option but to run again. I grabbed the door handle and turned it to exit the flat as she tried to stab me. I was mostly out the door, but her arm was close enough to reach my side, and I felt the knife pierce the side of my torso.\n\nI was in searing pain but I didn’t stop running. As I stepped outside my flat I could still hear Mr Prentice’s noises flooding the entire hallway. It gave me an idea. \n\nI ran towards his door, Prudence stabbing at me frantically with blood gushing from her nose. A few got me as I stopped outside flat 48, the pain was awful and I could feel myself starting to drift out of consciousness, I was losing a lot of blood. \n\nI would give my last breath to end Prue. So running on nothing but adrenaline I knocked hard on flat 48, and shouted.\n\n“Mr Prentice, can you help me?”\n\nIt was a shot in the dark, I didn’t know what would happen but I had to try something.\n\nShe had stopped stabbing at me, she was enjoying watching me bleed out slowly from the wounds she had already inflicted.\n\nI was incredibly weak, and I lost consciousness not long after that, but before I did I heard heavy clunking from the inside of flat 48, chain locks being released and bolts being undone. I watched with blurry vision as a large creature, that I can only describe as a cross between a bull and a wolf, charged out of the flat and trampled the old witch to death. I heard hear bones crunch just as slipped away. \n\nI woke up in the hospital a day later. My parents were there as were the police, apparently I had been found just outside the tower block with my handbag missing, by a neighbour who had been watching from a window as it happened. \n\nThe police told me that the person had seen the mugging out of their window. They had seen two men approach me and Jamie, splash something in my face, attack us, and when he tried to fight back, they bundled my boyfriend into a car, which the police had been searching for to no avail. He was officially missing. \n\nI was baffled, but grateful that Jamie’s disappearance wouldn’t be blamed on me. I went along with it and made out that he had ghosted work to enjoy our first week living together. \n\nI had been stabbed 4 times but thankfully in all the right places, if there is such a thing as the right place to be stabbed. I lost a lot of blood but I was going to be fine. They were all shallow. They assumed my burns were chemical and happened during the mugging too. \n\nThe police promised to keep us updated but they still can’t find the car. They never will. I wish the story the police had been told were true, it left some hope for Jamie. \n\nMy parents weren’t keen on me returning to the flat after what happened, they said the area was too rough, and that I was living proof it wasn’t safe. They offered to collect my stuff for me. I insisted though, told them that I wanted to see how I felt and they couldn’t force me not to.\n\nI was released from the hospital two days after I woke up in there. When I arrived at the flats, it was strange. It felt like home. Despite everything, something about this place drew me to it. \n\nI took the lift for the first time since Jamie had died. I had to, I wasn’t recovered enough to conquer too many stairs just yet, and I couldn’t guarantee they’d be kind to me. I smiled at the lack of a button 9 and winced at the thought of the creatures. \n\nAs I reached my corridor I saw Mr Prentice walking along with his newspaper and milk in a bag. He turned to me and smiled.\n\n“I wasn’t sure you’d come back. It’s nice to see you’re up and walking.” He made small talk as if I hadn’t seen him literally trample a woman to death a couple of days prior. The whole experience had been so disorienting that I started to wonder if I really had been mugged and had dreamed the note and everything that’s happened since. Then he said something that confirmed everything was real. \n\n“I never liked that woman. But you’ve got a real friend in the lady downstairs.” He winked at me and turned the key in his door. \n\nI got into mine and sat down on the second hand sofa. I felt empty but relieved. With Prue and the imposter Qneighbours all gone the only threat left were the creatures in the lift, who were only a threat between 1.11 and 3.33.\n\nMaybe I could start to live a semi peaceful life in this place. \n\nTerri knocked on the door, my handbag, that I had left at hers before Prue attacked in my flat, on her arm. Mr Prentice was right, she was a good friend. \n\nI thanked her for what she’d done and for what she’d told the police. She said it was pure luck that she found me, she had been walking up to return the bag and found me and Prue sprawled out on the floor. I asked what happened to Prue’s body and she just pointed in the direction of flat 48. \n\n“He was eating it.” She said.\n\nIt’s been a few days now and I’ve decided to stay. I can’t imagine going back to complete normality after everything I’ve been through and I’ve grown quite attached to some of the buildings quirks. \n\nI tried replanting the garden with the help of the twins. I ripped a few stitches doing it and Derek never came. I think he’s gone for good.\n\nI’m ready to fully embrace life here. The last few days have been hard but there’s some time to breathe. Along with the time to breathe, came the time to grieve and I’ve been grieving badly for Jamie.  \n\nThis leads me to the last thing I have to tell you. \n\nLast night I laid in bed, plagued with thoughts of Prue and everything that had happened, but what I couldn’t get to leave my mind was how much happiness it bought her to have Lyla back. It infected every part of my thoughts. I know you all warned me not to, but I did it. I repeated the ritual. \n\nI haven’t caught him yet, but I’ve heard the scratching. [Jamie’s back.](https://www.reddit.com/r/nosleep/comments/h86ihe/the_previous_tenant_left_a_survival_guide_the/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)",
    "comments": [
        {
            "level": 0,
            "comment": "It looks like there may be more to this story. Click [here](https://www.reddit.com/message/compose/?to=UpdateMeBot&amp;subject=Subscribe&amp;message=SubscribeMe%21%20%2Fr%2Fnosleep%20%2Fu%2FnewtotownJAM) to get a reminder to check back later. Got issues? Click [here](https://www.reddit.com/r/nosleep/wiki/nosleepautobot). Comment replies will be ignored by me.",
            "score": 1,
            "author": "NoSleepAutoBot",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yikes... after judging Prue so harshly for her actions, you went and repeated them? Girl. \n\nI sincerely hope that thing has no memory of being Jamie, because I can't imagine he'd be grateful for what you've done.",
            "score": 2637,
            "author": "BashfulHandful",
            "replies": [
                {
                    "level": 1,
                    "comment": "I Agree.",
                    "score": 323,
                    "author": "MolotovCockteaze"
                },
                {
                    "level": 1,
                    "comment": "The building sure makes you do some irrational things.",
                    "score": 269,
                    "author": "hotcat190",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Its not like she summoned him, she traded him with the monsters. For some.. dog food....",
                    "score": 30,
                    "author": "Kahlaintje"
                },
                {
                    "level": 1,
                    "comment": "Well i think its better than being surounded by monsters in flat 9... I would be gratefull to be honest.",
                    "score": 28,
                    "author": "Kahlaintje"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are you FUCKING STUPID?!?!     \n  Lyla was a *little* girl. There was Prue *and* Bernie(at least at first). Jamie was/is a full grown man.  You're on your own.  How do you think you're going to handle a full grown, male, rat-person?!  Especially by yourself!  You can't ask anyone for help, unless they have COMPLETELY lost it, the only help you'd get would be in killing him for good.\n\nDerek is probably avoiding you because       \n1) he feels bad about you getting hurt while imprisoning the imposters.       \n2) he feels guilty about Lyla/Prue, and knows you did/were going to, try the same thing.\n\nAnd lastly, ARE YOU FUCKING STUPID?!?!",
            "score": 1319,
            "author": "Mylovekills",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m pretty sure they were all described as being small. I might be wrong though.",
                    "score": 113,
                    "author": "Koture",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They were, but we don't know who or what they were before (if they were human to begin with, they could've been kids, teens, women...). But even so, she's still alone, wanting to [I don't even know, wrangle?] a rat-man.  Even if he's the same size as Lyla, Kat could've been ripped apart by her.",
                            "score": 87,
                            "author": "Mylovekills"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 21,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 29,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "OP! I can't believe you did what you did. You have become the very thing you swore to destroy...",
            "score": 2679,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 1342,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "One evil destroyed, another to take her place.  the Balance has been restored.",
                            "score": 549,
                            "author": "cthulularoo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A soul for a soul...",
                                    "score": 267,
                                    "author": "lchallco",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "A rat thing taken and a rat thing returned.",
                                            "score": 258,
                                            "author": "cthulularoo"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Equivalent exchange",
                                    "score": 55,
                                    "author": "MikeFlame",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ah! Such brilliant application. Nice",
                            "score": 28,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You either die a hero or live long enough to see yourself become the villian",
                    "score": 291,
                    "author": "DJ-spetznasty",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "You were meant to destroy prue, not join her!",
                    "score": 179,
                    "author": "Muzzie720",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 78,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A few days ago on an earlier submission in this series I called OP a sociopath and got downvoted to hell, and now I think I’m crabby about that",
                    "score": 228,
                    "author": "GreenLedbetter",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Well... in her defense, grief also leads to the dark side",
                    "score": 36,
                    "author": "notliztening"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And so you will be the Prue of someone else's story.",
            "score": 362,
            "author": "indecisive_maybe"
        },
        {
            "level": 0,
            "comment": "Way to go, Mr. Prentice! There's a future for him in the security field...",
            "score": 961,
            "author": "Karmasabeeyatch",
            "replies": [
                {
                    "level": 1,
                    "comment": "He's great! Even got rid of the body.🤗",
                    "score": 450,
                    "author": "Mylovekills",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe he is how you kill the things in the elevator.",
                            "score": 165,
                            "author": "2happycats",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Pretty much what Pru did, she herded them to the 9th floor and let the cultists deal with them. You pitthe supernatural against each other.\n\nProbably working as planned. Build a building that's attractive to the supernatural and let them wipe each other put.",
                                    "score": 95,
                                    "author": "cthulularoo"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Sounds like he'd be a better hitman than security guard",
                            "score": 14,
                            "author": "OptionalIntel"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I dont want to go back and reread. How did she meet Mr. Prentice?",
                    "score": 46,
                    "author": "thehotmegan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 151,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I kinda thought of him as a friendly skinwalker when she said wolf and bull. Who knows?",
                                    "score": 13,
                                    "author": "Big_chonk"
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh yeah thats right okay thank u!",
                                    "score": 31,
                                    "author": "thehotmegan"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "OP, youre stupider then I. Why would you ever want that... thing near you. Its not Jamie and it never will be. For all we know, its some random creature that you summoned. To make it worse, Derek isnt here to help guide you. You took a chance and you will have to pay for it. Good luck.",
            "score": 289,
            "author": "Arctic_Pistol",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agree",
                    "score": 23,
                    "author": "MolotovCockteaze"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Damn OP maybe try just Tinder next time before resorting to a ritual!",
            "score": 793,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Imagine the kind of people she would find in this area.\n\nJohn, 35. Half demon bachelor looking for a woman willing to participate em sacrifice rituals.",
                    "score": 307,
                    "author": "Ririzon"
                },
                {
                    "level": 1,
                    "comment": "Imagine the bio though.\n\n\"Live in a crazy ass paranormal building, have my ex as a rat pet and you might get killed getting in the elevator. But go ahead and swipe baby \"",
                    "score": 209,
                    "author": "theonefrombelow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“If things work out and we start a family here, our children may be ... gifted.”",
                            "score": 149,
                            "author": "Higglety-Pigglety",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"also I hope you like being watched cause we have a window cleaner that's kind of kinky. Good guy though\"",
                                    "score": 105,
                                    "author": "theonefrombelow"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You either die a hero or live long enough to see yourself become the villain",
            "score": 152,
            "author": "wakeandbakon"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 113,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I heard he is now saluting you back.",
                    "score": 15,
                    "author": "TheHollyLoser"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Aw man, girl, what the heck! Didn't you yourself ask how someone could do that to their own fles and blood? Don't keep this non-Jaime around, kill it! What would the gardener think?",
            "score": 344,
            "author": "Redcole111",
            "replies": [
                {
                    "level": 1,
                    "comment": "We all know that Derek knows how the every part of the building feels. Their thoughts .. and so on. Am pretty sure he was hearing the monster and Lyla's crying for help and that's why he couldn't let it go.",
                    "score": 73,
                    "author": "WhyDoIHaveToGetAName"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Really weird that you couldnt bring the gardener back, sounds to me like you just didnt try because you were ashamed for what you were about to do (and rightfully so)",
            "score": 107,
            "author": "eggplantsaredope",
            "replies": [
                {
                    "level": 1,
                    "comment": "OH, good insight",
                    "score": 38,
                    "author": "gravitysrainbow1979"
                },
                {
                    "level": 1,
                    "comment": "Maybe he saw the similarities between Prudence and Kat. He understands the building and it's residents, so if she was going to bring \"Jaimie\" back, I would imagine he wouldn't care about her peace-offering garden",
                    "score": 33,
                    "author": "jellybear421"
                },
                {
                    "level": 1,
                    "comment": "Nah I think he didn’t come back because the work on floor 9 had been completed.",
                    "score": 19,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nooo! Why would you do this to Jamie??",
            "score": 658,
            "author": "CoffeeBeanx3",
            "replies": [
                {
                    "level": 1,
                    "comment": "Grief makes us do some strange things sometimes I guess... and honestly after everything OP has been through in a week, it might just be for the best?",
                    "score": 185,
                    "author": "__dahlia__",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's gonna be a no from me, dawg!",
                            "score": 167,
                            "author": "KatiesGoldenDust",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I could have sympathized if she did it immediately after he died, but now?  After seeing what it's like?  She goes from solving almost all her problems to \"you know what I need to make this perfect? feeding my weird rat monster boyfriend dog food and keeping him hidden the rest of my life\"",
                            "score": 117,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mr Prentiss was chill AF after stomping an old woman and consuming her.  \n\nBut OP, geez girl, you know this is the wrong path to take.  I fear you're going to wind up getting very close to Mr Prentiss in the coming years. :-(",
            "score": 90,
            "author": "cthulularoo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Honey, that's not him :/",
            "score": 414,
            "author": "nejem",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's not him! I can't believe it after all you've seen. Now it's time to find some ritual to do to get get the ppl to turn back to normal????",
                    "score": 130,
                    "author": "crazymomRN"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Prue is a real stupid and arrogant bitch and it doesn't surprise me that her children weren't so fond of her... \n\nAnd what the hell OP! I was about to tell you to try to ignore the building calling you to get out and start a new life, but you have gone too far already",
            "score": 213,
            "author": "Profitlocking",
            "replies": [
                {
                    "level": 1,
                    "comment": "I reckon the building is turn OP into another Prue. Maybe that's another one of the building's quirks?",
                    "score": 102,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That flat might be cursed!",
                            "score": 61,
                            "author": "canebarge",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Cursed? Nah I don't think anything weird is going on there",
                                    "score": 45,
                                    "author": "soowhatchathink",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Totally normal stuff",
                                            "score": 29,
                                            "author": "cringy_dude"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Wonder if this room is special in particular",
                            "score": 27,
                            "author": "suicide_aunties"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 100,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 93,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 23,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 13,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 27,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 23,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 13,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 4,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think some force in the building infects your mind. OP finally has that “it’s a nice place to live” mindset everyone else does. I think it’s possible the twisted love Prue had for the Lyla creature was the same kind of ... contagious thought",
            "score": 138,
            "author": "pugpaws17",
            "replies": [
                {
                    "level": 1,
                    "comment": "Indeed. The building isn't benevolent. This shows it. It puts a spell on everyone that moves in. OP couldn't resist it",
                    "score": 68,
                    "author": "Redeemer206",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It may not be benevolent, but I don't think it's evil either.  I think it's a sentient thing, but it is neutral, if anything it's mischievous.  It did help Kat (she only had to go town 3 flights when she saw Prue) when it was urgent.  And I believe that it made Prue's journey to Kat's apt longer (that's why she wasn't right on Kat's tail when she got to Terri's apt.)\n\nAnd the building itself is what's holding the imposters in the apts., while blocking off the floor, so no one else gets hurt there.",
                            "score": 93,
                            "author": "Mylovekills"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Be careful of the mailman, it seems like he was in cahoots with the old bitch.",
            "score": 192,
            "author": "SoVerySleepy81",
            "replies": [
                {
                    "level": 1,
                    "comment": "How?",
                    "score": 26,
                    "author": "kiralalalala",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well for one Prudence told op to trust Ian. If someone who tried to kill me, got their grandchild killed, kept their monster grandchild in a cage in a shed, etc. told me to trust someone I would run.",
                            "score": 154,
                            "author": "SoVerySleepy81",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes but she also said to trust Terri and she’s been really great so far.",
                                    "score": 72,
                                    "author": "TreasureDragon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, but Terri was still talking to her. I think it's entirely possible she used Terri as a conduit for information about what was going on in the building.",
                                            "score": 52,
                                            "author": "SoVerySleepy81"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "But on the other hand, she had warned the OP to avoid the twins at all costs, but they turn out to be saviors, right?",
                                            "score": 10,
                                            "author": "trigerrednibba",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No she said to avoid looking after them for Terri as they never sleep.",
                                                    "score": 25,
                                                    "author": "HurricaneX31"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I dunno. People are multifaceted and just because Prue trusted Ian, doesn’t mean everyone else doesn’t trust him. I don’t recall the other neighbors saying anything bad about him, so maybe it’s just that Ian was nice to everyone?",
                                    "score": 83,
                                    "author": "kiralalalala"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "For everyone that is blaming OP for summoning Jamie back, I couldn't help but think it might be due to the curse of that particular flat. Maybe every flat had its unique quirk; flat 48 turns you into a were-bullwolf, and OP's flat turns whoever in it into a deranged tragic hero. Her actions were very similar to Prue - she figured out stuff on her own, she battled the evil of the building, she lost her loved ones, and she grew to love the building. Maybe whoever lives in that flat will slowly but surely go mad.",
            "score": 112,
            "author": "VerseAeya",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sadly, this makes a lot of sense. I hope you're wrong, though. I want Kat to come to her senses soo badly!",
                    "score": 36,
                    "author": "L00nuhtick"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 66,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I am so disappointed in you. After you judged Prudence so hard for it, you went and did the same thing. You are no better than she is. \n\n&amp;#x200B;\n\nAlso, the man on floor 5, something tells me he has a bigger part in this story than you let on.",
            "score": 21,
            "author": "ThisFatGirlRuns"
        },
        {
            "level": 0,
            "comment": "The ending... Why T_T\n\nI hope you don't turn into a Prudence some day, OP.",
            "score": 44,
            "author": "ziallfiezald"
        },
        {
            "level": 0,
            "comment": "Oh man this was a good one! Good riddance, Prudence.",
            "score": 81,
            "author": "kmae1028"
        },
        {
            "level": 0,
            "comment": "Loved this story, hated the ending. It's unfortunate that you became the thing you worked so hard to get rid of.",
            "score": 20,
            "author": "BW2K"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 170,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Now it makes sense why you didn't just leave the flat yet. You were hoping for a way to bring him back",
            "score": 17,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Was that the end? I’ve been checking every couple of hours for the next part of the story. Would be VERY disappointed if that’s how it ended.",
            "score": 41,
            "author": "shelikescats",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s been 3months, I think this is the ending :(",
                    "score": 6,
                    "author": "Sarim144"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh Kat you're starting to become just like Prue...",
            "score": 16,
            "author": "TheMythicMuse"
        },
        {
            "level": 0,
            "comment": "People are calling OP stupid, but it’s been proven that the building is supernatural. \n\nWhat if OP’s flat is an entity itself, driving the people living in it to make irrational decisions and revive their dead loved ones? First Prue, now OP. Either OP is as bat crazy as everyone says, or something else is going on. What are the chances that only OP and Prue had their loved ones killed in an elevator and tried to bring them back, but nobody else suffered the same fate?",
            "score": 67,
            "author": "Flamenami",
            "replies": [
                {
                    "level": 1,
                    "comment": "In one floor the flickering light turns them vicious. Maybe the damp stain in the bedroom has something to do.",
                    "score": 43,
                    "author": "ritzhi_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The real scary story is this might be the end of the story.",
            "score": 16,
            "author": "WhoAndWhatTheFuckAmI"
        },
        {
            "level": 0,
            "comment": "Fuck you for putting Jamie through this. You should’ve let him rest you sick fuck",
            "score": 15,
            "author": "Shrek-It_Ralph"
        },
        {
            "level": 0,
            "comment": "Imagine one of your family members decides to visit you and then they post their story about how OP has a set of rules her family member must follow.",
            "score": 15,
            "author": "TodroEzLo"
        },
        {
            "level": 0,
            "comment": "Oh no, is this story finished?! I loved it so much!!",
            "score": 13,
            "author": "m00nland3r"
        },
        {
            "level": 0,
            "comment": "OP, why would you do the exact thing you detested Pruedence for?  You saw the monster she had created and the sick codependency, why would you let yourself become that? Do you think it's any different?",
            "score": 23,
            "author": "Rustic_Mango"
        },
        {
            "level": 0,
            "comment": "I really had hope and felt that OP was still sane but I agree maybe it was just too much emotion to handle. But it felt a little forced you know. It was only the last paragraphs a few sentences where she suddenly “snapped” and brought “Jamie back.” You sure Prue is dead dead or she lurking around in her flat (yours OP) like how the arsonists were after death and controlling from the inside since early she failed to kill you physically?",
            "score": 24,
            "author": "TreasureDragon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Pretty interesting theory. Maybe OP kinda absorbed Prue's spirit or something. After all, she died in a cursed building due to a werewolf-bull thing.",
                    "score": 22,
                    "author": "cringy_dude"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I WAS ROOTING FOR YOU, WE WERE ALL ROOTING FOR YOU!",
            "score": 12,
            "author": "prettysmallandquiet"
        },
        {
            "level": 0,
            "comment": "So it must be something the building does to you to make you want to stay? I wonder if the rooms itself effect and change the people who live there.",
            "score": 22,
            "author": "thelonecactus"
        },
        {
            "level": 0,
            "comment": "With Prue finally gone, the building needed another necromancer to take her spot.",
            "score": 21,
            "author": "conundorum"
        },
        {
            "level": 0,
            "comment": "I can’t help but imagine how things could have gone differently. Perhaps in mourning Jamie, you could have incorporated a memorial for lost loved ones into the garden. And stepped into Derek’s place as the gardener, and a caretaker, so to speak, even. I kept hoping you’d find out that you’re expecting, and thus you’d always have some part of Jamie with you. Perhaps the building would have blessed/cursed your child in a similar way to the twins, or in a way of its own. \n\nPlease try to pull yourself out of this path you’ve let yourself go down. Whatever returns is not, and never will be, truly Jamie. Put it and yourself out of misery - once it’s gone, perhaps you’ll be able to grieve in a healthier way, because you will know there is no longer any way to bring him back. A temporary bout of poor judgement doesn’t have to be permanent.",
            "score": 11,
            "author": "Higglety-Pigglety"
        },
        {
            "level": 0,
            "comment": "Ever think Derek didn't come back because he was afraid this is what you would do?",
            "score": 41,
            "author": "VivVoorhees"
        },
        {
            "level": 0,
            "comment": "Take good care of him, Kat. And remember to give that old building, and all its residents, the respect they deserve. Cheers.",
            "score": 11,
            "author": "Scarlight"
        },
        {
            "level": 0,
            "comment": "Please don't. I don't think that's what Jamie would have wanted.",
            "score": 10,
            "author": "YahaHarjo"
        },
        {
            "level": 0,
            "comment": "God fucking DAMN IT Kat! You’re turning into what you hate.",
            "score": 10,
            "author": "stoner-bug"
        },
        {
            "level": 0,
            "comment": "He may be okay, the building rewarded prudence with what she deserved. OP you may have a more friendly Jamie.",
            "score": 10,
            "author": "HoneyBloat",
            "replies": []
        },
        {
            "level": 0,
            "comment": "LPT: Always change the locks when you move",
            "score": 10,
            "author": "PantsPartyPirate"
        },
        {
            "level": 0,
            "comment": "Bruh how stupid are you? You're probably gonna grow old in the flat, and if that happens, you will quite literally be Prudence Hemmings 2.0.",
            "score": 10,
            "author": "Skalkin"
        },
        {
            "level": 0,
            "comment": "After everything you achieved,  you restarted the cycle. You have lost your mind.",
            "score": 10,
            "author": "Aussiewolf82",
            "replies": []
        },
        {
            "level": 0,
            "comment": "i can’t remember the last time i sat somewhere willingly and read something so long.",
            "score": 10,
            "author": "rusty-vas-deferens"
        },
        {
            "level": 0,
            "comment": "You can't end it here!",
            "score": 10,
            "author": "Shadow_Road",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That was sweet. Many characters that are reasonably deep -- better than I can ever dream of writing, and well above average even for stories that \"make it\".\n\nBut it was also possibly the single most overrated story in the history of nosleep, and I'm a very long time reader. Who's handing out all these golds and plats by the dozen? This sub has seen many greats that were truly amazing but recieved only half the amount gold.\n\nApart from the ending which was *painfully clichéd* and frankly such a big disappointment; it was a very sweet read. It all felt like the earlier books of Harry Potter for some reason, which can only be a compliment, and even made me feel nostalgic.\n\nGreat work from a talented storyteller. I'm hoping to read more.\n\nAnd one thing about Jamie. If you can safely contain him within your flat you may be able to live on without any major issues. The prospect of \"the young lady living in 42 keeps her dead boyfriend in a cage\" does not seem too out of place for the building. It may be considered normal possibly following some quarrelling with and getting notices from the committee, but I'd wager that it'll be all right. They should grant you permission after all you've done for the community.",
            "score": 19,
            "author": "arkaze",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think all the badges are rewarding the world building. The hotel was a very cool concept, and there were lots of interesting side characters. That's what brings this story to another level imo. Though I'm not so sure if it was good enough to warrant *this* many awards...\n\nI totally agree about the ending, godawful.",
                    "score": 9,
                    "author": "AnonymousBi"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It seems that the building is responsible for everything, and that the cult and the creatures are a consequence of the building being weird.\n\n\n\nWould have loved to know more about the origin of the building, the landlord, Michael and everything !\n\n\n\nAlso, you fucked up ! 😥",
            "score": 10,
            "author": "everythinglookscool"
        },
        {
            "level": 0,
            "comment": "YOU SHOULD HAVE WAITED FOR DEREK AND NOT BE A CRAZY OLD BAT OBSESSED OVER A FREAK OF NATURE",
            "score": 13,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "What if the building's like a giant human trap that the rats maintain for their food supply?",
            "score": 13,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "OP, what the f..",
            "score": 7,
            "author": "Pat_thetic"
        },
        {
            "level": 0,
            "comment": "Is this final part?",
            "score": 13,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 28,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 19,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 15,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have whiplash from going from feeling content with the ending to facepalming thinking \"god damnit OP\" from those last two paragraphs.  \n\nSeriously, why?  You go from telling Prudence she's bonkers for enjoying taking care of her rat creature, and then you go and do it too?  Did she stab you in the \"making good decisions\" part of the brain?",
            "score": 10,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "part of the buildings quirks is affecting your mind to think these decisions are smart. the same way op could feel at home in such a rugged and dangerous place.",
                    "score": 8,
                    "author": "logannull",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sure, but I think it's still a very sudden reversal when it takes just a stay in the hospital to go from lecturing a woman on all the ways it is not right to \"actually i'm doing the ritual\".",
                            "score": 5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "the mind is a fragile thing, supernatural experience and entities alike mixed with grief, anxiety, and regret can be enough to make anyone make irrational decisions. maybe she can train him to fight the other ones.",
                                    "score": 4,
                                    "author": "logannull",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm super hoping there's a way to make him human, or if not she kills him to end his suffering. Or maybe communicates with him somehow if possible.",
                                            "score": 3,
                                            "author": "dadudeodoom",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a terrible woman! I understand your thoughts on Prudence bringing Lyla back, and I also understand why you eventually did it yourself. I imagine the whole ordeal made you kinda feel like Jamie would \"come back\" and when everything settled down and you could grieve you realised he wasn't.. That's enough to make anyone loose their mind. I wonder though, how did you know how to do the ritual? \n\nI hope to read another update soon!",
            "score": 38,
            "author": "xxlisaaxx22",
            "replies": [
                {
                    "level": 1,
                    "comment": "When Kat met Lyla, Prue explained it, in [Last Night My Survival Was Threatened](https://www.reddit.com/r/nosleep/comments/cjintp/the_previous_tenant_of_my_new_flat_left_a/)\n\n&gt;all I had to do was enter the lift and offer the creatures some food whilst repeating the phrase *revertetur mortuis* during their frenzied hours.",
                    "score": 36,
                    "author": "Mylovekills"
                },
                {
                    "level": 1,
                    "comment": "You missed a part of the story, the ritual was explained",
                    "score": 16,
                    "author": "Permatato"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good news is that when Derek has to come back to fix Kat's mistake, there will only be one mega-rat left.",
            "score": 5,
            "author": "Livagan"
        },
        {
            "level": 0,
            "comment": "content pogu",
            "score": 8,
            "author": "BillCipherism"
        },
        {
            "level": 0,
            "comment": "What. Have. You. Done?!",
            "score": 7,
            "author": "Bad_river_exile"
        },
        {
            "level": 0,
            "comment": "I liked this series but I'm sorry... what a shitty ending to an otherwise great story. She makes rat Jamie? Seriously?",
            "score": 7,
            "author": "AnonymousBi"
        },
        {
            "level": 0,
            "comment": "Holy.. fucking... shit. I LOVED this series so much and I was waiting for each update very impatiently. I fucking love the ending because it’s a paradox. You are now Prue. And the cycle will just continue forever. I love this story OP. Hope you have more amazing ones in the future.",
            "score": 24,
            "author": "Dadothegreat23",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think this is how the building will get rid of the monsters that hang around from 1:11-3:33. After Kat, there’ll only be 1 left then everything will be normal. ;)",
                    "score": 7,
                    "author": "kiralalalala"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Girl you literally yelled at this crazy old lady for bringing her granddaughter back, and then you go and do it? That’s shameful",
            "score": 9,
            "author": "keepitlowkey12"
        },
        {
            "level": 0,
            "comment": "OP you better be prepared to be eaten by jamie",
            "score": 8,
            "author": "8corrie4"
        },
        {
            "level": 0,
            "comment": "Well I guess the story can be summed up in this very quote. “You either die a hero... or live long enough to see yourself become the villain”.",
            "score": 6,
            "author": "ChristakuJohnsan"
        },
        {
            "level": 0,
            "comment": "OP, you see one of those many windows in your flat? Once you catch your totally friendly, normal, non-demon rat spawn Jamie, throw him out one!",
            "score": 7,
            "author": "Nightie4wood"
        },
        {
            "level": 0,
            "comment": "No no no no fuck no, why would you do that terrible ritual?? Dafaq OP. You are no better than that psychopathic bitch Prue.  \n\n\nFor one moment I really thought that OP might have dreamt the entire ordeal because of some accident/trauma/near-death experience and I was like Holy Fucking Shit.   \n\n\nOP don't just leave us hanging. Please tell us if you mean to clean the mess you created.",
            "score": 7,
            "author": "Ryunysus"
        },
        {
            "level": 0,
            "comment": "Why would you fucking do that?",
            "score": 7,
            "author": "orionpaper"
        },
        {
            "level": 0,
            "comment": "Well that was crazy. You totally gotta talk to the guy on floor 5. Maybe hes another supernatural entity like ian and Derek, its possible he knows how to undo whatever the curse is and make jaime human again.",
            "score": 8,
            "author": "supbitch",
            "replies": [
                {
                    "level": 1,
                    "comment": "I honestly get a weird feeling that he is the vessel for the spirit of the building or something.",
                    "score": 6,
                    "author": "dadudeodoom"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I might have missed some things, but what happened to the window cleaner demon guy? Also didn’t he also have the deep black eyes like the demon twins? I wonder if there are the window cleaner has anything to do with the twins...",
            "score": 6,
            "author": "Le_Harvest",
            "replies": []
        },
        {
            "level": 0,
            "comment": "###YOU FUCKING WHAT?",
            "score": 8,
            "author": "The-Nipple-Inspector"
        },
        {
            "level": 0,
            "comment": "I knew it...\n\nYou should have moved out after all this chaos was over... Or as soon as you knew Jamie was dead...\n\nYou stayed too long, OP, and now the building has you enraptured in its spell... And you even did the ritual, though I don't know how you learned it.\n\nI feel bad for you, OP, that you've been brainwashed to stay, and to bring Jamie back so horrifically. I can't say that I didn't see this coming though. The building got to you",
            "score": 6,
            "author": "Redeemer206",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I can't help but wonder about the wet spot on the cieling above the bed? Or was it just another quirk?",
            "score": 6,
            "author": "JemMatte25",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You either die a hero, or you live long enough to see yourself become the villain...",
            "score": 7,
            "author": "Spencer2704"
        },
        {
            "level": 0,
            "comment": "Shouldn't have done that. That's cruel",
            "score": 6,
            "author": "saitamasbaldhead"
        },
        {
            "level": 0,
            "comment": "i miss this story. wish there was more.",
            "score": 6,
            "author": "cassidythomas"
        },
        {
            "level": 0,
            "comment": "The window washer, Michael the cultist, the person in the stairwell on floor 5... lots of loose ends here.",
            "score": 5,
            "author": "AlitaBattlePringleTM"
        },
        {
            "level": 0,
            "comment": "It's amazing how any place can really become home. Hopefully you'll find peace of it is Jamie that made it back",
            "score": 15,
            "author": "NursePeyton"
        },
        {
            "level": 0,
            "comment": "OP! You say you’re ready to end the madness, was the madness all of us begging for more to your story day by day?",
            "score": 4,
            "author": "Zitchman123"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 4,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I hope you catch rat Jamie and end his misery. Then he'll really be gone and you can grieve proper afterwards",
            "score": 6,
            "author": "shibathefox"
        },
        {
            "level": 0,
            "comment": "I really really hope this isn’t the end..",
            "score": 5,
            "author": "Eibrab22"
        },
        {
            "level": 0,
            "comment": "I think she got eaten guys",
            "score": 6,
            "author": "howtobemik"
        },
        {
            "level": 0,
            "comment": "I WAS ROOTING FOR YOU. WE WERE ALL ROOTING FOR YOU. HOW DARE YOU?!",
            "score": 4,
            "author": "PointlessSemicircle"
        },
        {
            "level": 0,
            "comment": "I'm reading this way in the future but when Prue and Kat started fighting in the apartment I expected them to hear a knock on the window. \"Hello! Might I have a glass of water?\" I expected Kat to open the window open, run outside and lock Prue inside with that thing.",
            "score": 3,
            "author": "DarthSamus64"
        },
        {
            "level": 0,
            "comment": "You were so so close then you fucked it up Kat! This is why we can't have nice things!",
            "score": 8,
            "author": "OriginsOfSymmetry"
        },
        {
            "level": 0,
            "comment": "So totally convinced that Prue killed her husband. “Bernie hated me” Yup she probably threw him off the balcony because he wanted nothing to do with Lyla or tried to get rid of “her.” And OP....shame, shame, shame....I know your name!",
            "score": 5,
            "author": "bandaidson"
        },
        {
            "level": 0,
            "comment": "Wow, what a rollercoaster ride. Well done in defeating Natalia and Prudence. \n\nEnjoy your new home.....with Jaime?",
            "score": 4,
            "author": "Jafflehead"
        },
        {
            "level": 0,
            "comment": "Noooooo, OP! Noooooo! Why would you do such a stupid thing?!",
            "score": 5,
            "author": "Doom7331"
        },
        {
            "level": 0,
            "comment": "Good luck with Jamie! Let us know how he is.",
            "score": 3,
            "author": "lalarock1"
        }
    ]
}