{
    "id": "dj5fgp",
    "score": 12669,
    "title": "I just graduated from medical school, and my new hospital has some very strange rules",
    "author": "ByfelsDisciple",
    "date": 1571313931.0,
    "url": "https://www.reddit.com/r/nosleep/comments/dj5fgp",
    "media_urls": [],
    "other_urls": [
        "https://www.facebook.com/P-F-McGrail-181784199029462/)*",
        "https://www.reddit.com/r/ByfelsDisciple/)",
        "https://www.youtube.com/channel/UCcn_pa1QfNMRzbTuJqXSoRQ?view_as=subscriber)",
        "https://redd.it/djmjk2)"
    ],
    "postText": "You probably think that all doctors are filthy rich, because I sure as hell did in the beginning. Eight years and a fistful of premature gray hairs later, I’m just a few hundred thousand dollars poorer than “broke.” That would matter if I had a family to provide for, but the long hours in med school have led to an end of my last relationship and a countdown on the shelf life of my ovaries. \n\nI was in a “take what I can get and be grateful” situation. \n\nSo when St. Francis Hospital in Charleston, West Virginia offered me a position, I packed my sad life into three bags and sought opportunity in the hills of Appalachia. Nineteen of us started in July, and thirteen have since dropped out. \n\nI like to think of myself as the rat that wouldn’t drown.\n\nSome people broke inside after watching children die because they weren’t good enough doctors quite yet (everyone has to be a rookie at some point). It’s doubly hard when you have to inform the dead child’s parents, who then beg you to tell them different news, or scream that they want to die and just please kill them with whatever drug takes away the pain.\n\nBut most of my incoming class couldn’t handle the chief of medicine. \n\nDr. Vivian Scritt is, without a doubt, the biggest bitch I’ve ever met. \n\nNow I know why.\n\n“Nineteen of you start today, and we’ve got a pool going with bets on how long each of you will last,” she told us on Day One. “Don’t feel any pressure, folks. I’ve talked with each of you in private, and my expectations are very low.” \n\nShe peered condescendingly over her thin spectacles, snorted, then turned around to walk away. \n\n“You should know when to follow me and when to stay away, because I’m not going to waste time explaining what you should figure out on your own.”\n\nWe gawked at one another, all feeling weak and small, then scampered after her. \n\nI was last in line, and felt out of place taking even that much.   \n \n“You should have the list of expectations for St. Francis,” Dr. Scritt explained as she walked on, not bothering to look at us as she talked. “I printed eighteen sets of rules so that you would have to challenge one another for them, knowing that one of you would be left behind.”\n\nAn icy cold settled in the pit of my stomach as I saw everyone look down at a list of rules that only I did not have. \n\n“If you cannot follow these rules, there will be no place for you in this hospital. It most likely means that you are unsuited to be a doctor, and should consider a profession that demands a weaker mental aptitude.” At that, she turned around to face us all. “And if you think that I’m the type to give second chances after a mistake, you’re woefully underprepared for the world of medicine.” She stopped and looked at each of us in turn, apparently expecting a response that no one dared to offer.\n\n“Well,” she shot out in exasperation, “why are you standing here? People are dying. Get to work!”\n\n*\n\nNo one wanted to show me their list of rules, so I had to wait until one of my classmates died.\n\nIt took nearly a week. \n\nI was working at 3:00 a. m. because I had only been on the clock for ten hours. I was rushing into another room so that a patient wouldn’t know I was Googling his symptoms (doctors do this FAR more than you realize) when I saw Myron by himself in an O. R. \n\nI stopped immediately. “Myron?” I squeaked. “What the hell is that?” \n\nHis arms were working furiously, but his back was turned toward me, so I couldn’t see what he was doing.\n\nSomething felt wrong. \n\nMyron was the pick of our litter. He’d been top ten in his class at John Hopkins, and he would remind us of that fact in exchange for answering the questions that we were too terrified to ask Dr. Scritt.\n\nSlowly, I approached Myron, not wanted to startle him. “We’re really busy right now, is there something you need help with?”\n\nHe showed no outward signs that he had heard me. Instead, he kept pumping away furiously at the task at hand. \n\nWhen I was five steps from him, I could see drops of blood flying over his shoulder. \n\nWhich made no sense, since he had been alone in the room.\n\n“Myron?” I whispered, barely loudly enough to hear my own words.\n\nI slowly crept around his left side, finally bringing the scene into full view.\n\nMyron’s abdomen was split from sternum to pelvis. His esophagus spilled out, and his stomach sat on the table. A nest of quivering small intestine led from the bottom of his stomach back into his shredded torso. \n\nMyron showed no outward signs of pain.\n\nHe was too busy working.\n\nHe clutched his own stomach tightly in his left hand, the folds squirting through his fingers like unbaked bread. His right hand was working furiously with a scalpel, sawing his organ into ribbons. Rivers of sweat poured down his forehead with the intensity of the effort.\n\nI tried to scream, but it only came out as a moan.\n\nThat was enough to get Myron to notice me.\n\nSlowly, he raised his head. Slowly, he smiled.\n\nIt was not a happy smile.\n\nWith eye contact locked on me, he licked his lips, angrily stabbed a piece of his stomach, and lifted it to his mouth.\n\nHe bit.\n\nHe chewed.\n\nThen he lunged.\n\nBut most people don’t know how to move with their innards splayed out for all the world to see, and this was his downfall. Myron’s tattered guts caught on the corner of the table, and he fell to the floor. \n\nFinally, he screamed. \n\nI had learned very early in my medical career that compartmentalization is indispensible. That instinct took over my brain in the moment, and I acted clinically.\n\nMyron was still grasping his scalpel with his right hand. I kicked it – hard – and it flew out of his hands.\n\nHe stared at me and screeched.\n\nWith his entrails still wrapped around the table, I figured my best option was retreat. I moved to the back of the room as a doctor and a janitor burst in. \n\nAnd in possibly the most shocking moment of the night, I realized that they were *not* shocked. \n\nMyron was anesthetized, subdued, and extracted within a minute of their arrival. \n\nFor a moment, I was alone with a pool of blood and diced stomach lining. \n\nAnd something else.\n\nA sheet of paper lay on the floor, its corner just touching the edge of the creeping blood. \n\nMyron had dropped his list of rules. \n\nThe practical part of my brain continued to drive me. I snatched the paper from the ground, then quickly exited the room, taking care to avoid the puddle.\n\nI didn’t want to leave any bloody footprints in my wake. \n\nI knew that I had to read the list as soon as I was able to find thirty uninterrupted seconds to myself. Three hours later, I had my opportunity and ducked into a janitor’s closet. With a shaking, *exhausted* hand, I pulled the chain on a bare bulb, tried to ignore the noxious smell of leaking ammonia, and read.\n\n-------------\n\n**St. Francis Hospital Rules – Guidelines for new doctors**\n\n1 – Never, under any circumstances, share your copy of the rules with anyone else.\n\n2 – If any other doctor displays erratic behavior, leave the area immediately. Do not make eye contact.\n\n3 – If any other doctor is approached or detained by someone in a janitor’s uniform, do not interfere. Never ask about that former doctor again. \n\n4 – Never touch any seemingly abandoned Reese’s Peanut Butter Cups. Those are Dr. Scritt’s favorite candy.\n\n5 – Any child that dies in St. Francis hospital MUST be cremated within 120 minutes of official time of death. If you suspect this rule has been broken, alert Dr. Scritt, and the hospital will be evacuated. \n\n6 – There is no Children’s Burn Unit at St. Francis hospital. If you find yourself there, continue walking until you return to familiar territory. This usually requires traveling in a straight line down the central hallway for 47 minutes. You will not reach a wall during that interval.\n\n7 – This rule is on a need-to-know basis.\n\n8 – A small quantity of sulfuric acid is kept in every room. This is ONLY intended for use on patients with severed spinal cords. If they attack, a hypodermic injection of H2SO4 into the cranium is the only way to subdue the subject. \n\n9 – The morgue must house at least 13 cadavers at all times.\n\n10 – If find yourself on the hospital roof with no memory of how you got there, you have only two choices. Either wait for an extraction team to find you, or jump four stories to the sidewalk on Court Street.\n\n11 – If you see Room 1913, do not look directly at the numbers. Do not open the door. This is, by far, the most important rule.\n\n---------------\n\nMy heart stopped when the door opened.\n\nDr. Scritt was staring at me. What little emotion shined through her exterior seemed to be surprise.\n\nWe both stood, frozen, for five seconds of agonized silence. \n\n“Dr. Afelis,” she drawled gravely, “I’m shocked.” She stared down at the bloodstained list of rules in my hand.\n\nI reached for words. *Any* words, because literally any response would make me look less guilty than I did in that moment, staring up at my boss’s boss’s boss and saying literally nothing in my defense as she weighed my soul with her eyes.\n\nAnd I said nothing. \n\n“You took a list that wasn’t yours, and were nowhere to be found after your coworker experienced such an *unnatural* incident.” Dr. Scritt huffed through her nose. “It seems that *you’re* willing to do the unthinkable in the name of getting what you need. And *Myron* couldn’t’ even follow the most important rule.” She clenched her teeth. “I had a four-year streak of predicting which incoming doctors will break the soonest. This will *ruin* my chances in the office pool.”\n\nThe ghost of a smile graced her lips before she turned to leave. \n\n“Get to work, doctor. You’ve got three hours left on your shift, and those symptoms aren’t going to Google themselves.”\n\nI didn’t realize that I’d been holding my breath until I heard my own gasp for air.\n\nShaking, I slowly emerged from the janitor’s closet. I quickly stuffed the list of rules back into my pocket, reflecting on the fact that I had just achieved what *might* be considered an actual win.\n\nPerhaps, just maybe, I would keep my head above water at St. Francis after all. \n\nI turned to head down the hall when I stopped in my tracks. \n\nEverything was unfamiliar. What the hell had happened?\n\nI glanced all around. The design of the hallway was familiar, but everything was *off.* I could hear people talking in the rooms, but the immediate vicinity was devoid of all people but myself.\n\nNothing made sense.\n\nThen I looked up.\n\nAnd I’ll be honest, I peed just a little when I read the sign.\n\n*ST. FRANCIS HOSPITAL – CHILDREN’S [BURN UNIT](https://www.facebook.com/P-F-McGrail-181784199029462/)*\n\n[BD](https://www.reddit.com/r/ByfelsDisciple/)\n\n[Listen](https://www.youtube.com/channel/UCcn_pa1QfNMRzbTuJqXSoRQ?view_as=subscriber)\n\n-------\n\n[Part 2](https://redd.it/djmjk2)",
    "comments": [
        {
            "level": 0,
            "comment": "This is really good!\n\nStart walking OP and be safe. At least now you are aware of the rules and can avoid ending up like Myron.",
            "score": 1088,
            "author": "littlemockingjay18",
            "replies": [
                {
                    "level": 1,
                    "comment": "'Course she did... She is at least one of the last three left... So we know she made it out of Burns Unit...",
                    "score": 85,
                    "author": "Lionowlfox"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looks like you got a 47 minute walk!",
            "score": 594,
            "author": "LynnBawss",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was gonna upvote but it’s at 47 and it seems too perfect",
                    "score": 196,
                    "author": "erddy99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Now you have 47 ;)",
                            "score": 59,
                            "author": "Eralem",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A wholesome thread :)",
                                    "score": 55,
                                    "author": "TheValiantWhippet"
                                },
                                {
                                    "level": 3,
                                    "comment": "Now you have 47",
                                    "score": 35,
                                    "author": "Foolish_Phantom",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We gotta get this guy to 47",
                                            "score": 14,
                                            "author": "Eralem",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "holy X article",
                                                    "score": 2,
                                                    "author": "sf1999"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It's now at 417",
                                    "score": 2,
                                    "author": "Tierkreisze"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Well it's at 3.7k upvotes so go ahead.",
                            "score": 60,
                            "author": "shadow_girl-666",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Done",
                                    "score": 19,
                                    "author": "erddy99"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wonder which rule Myron broke?\n\nNinja edit: actually I think I know. Dr. Scritt said \"the most important rule\". So he must have broken the last one.",
            "score": 350,
            "author": "thinker3",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am wondering if it was #7, myself.  I mean, it is a big deal, after all.",
                    "score": 133,
                    "author": "mia_elora"
                },
                {
                    "level": 1,
                    "comment": "Oh, nevermind.  Someone pointed out it was #11!",
                    "score": 59,
                    "author": "mia_elora"
                },
                {
                    "level": 1,
                    "comment": "I wonder if it was rule 4. Then cut open his abdomen and spilled his guts to get the Reeses cup out?",
                    "score": 104,
                    "author": "giancarlox21",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Interesting thought, but that wouldn't explain why he started eating pieces of his stomach. Something about that room drove him mad.",
                            "score": 64,
                            "author": "thinker3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Orrrrr. Something in the reeses cup drove him mad...",
                                    "score": 43,
                                    "author": "giancarlox21",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Orrrr it's something else entirely. The list said it's the most important rule so far. OP was in a sense interrupted. There could be a couple more bigger rules she hasn't read yet. Brace for crazy, I guess?",
                                            "score": 25,
                                            "author": "Hanamiya0796",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Hah! Maybe!",
                                            "score": 5,
                                            "author": "thinker3"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "But doesn't this mean that the main character also went in room 1913?",
                    "score": 36,
                    "author": "k1llbot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Perhaps the room number was supermagically reassigned before the OP arrived, or the door was already opened, thus sparing her from breaking the rule.",
                            "score": 59,
                            "author": "LiKenun",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Im thinking either the latter or due to the fact that they were the one not given rules, they somehow didnt apply to them until they found the paper from someone who broke the rules.",
                                    "score": 50,
                                    "author": "DravenPlsBeMyDad"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm thinking that Myron interacted with the room in some way and then went about his day. (Whether he actually went into the room or simply stared at the room number too long, we don't know.) OP then ran into him later, after Myron's encounter already happened. So maybe it didn't affect Myron immediately.",
                            "score": 28,
                            "author": "thinker3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep this could be.",
                                    "score": 9,
                                    "author": "k1llbot"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thats where the Reeses stash is.",
                            "score": 14,
                            "author": "yosef_yostar"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh mannn. I can’t wait to hear more. I hope there’s more!",
            "score": 354,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "So was she never given a set of rules because Dr. Scritt didn’t think she would make it? That’s why she lost the office pool?",
            "score": 55,
            "author": "InkSpiller333",
            "replies": [
                {
                    "level": 1,
                    "comment": "She didn't get a set of rules just due to chance by being last in line. This made scritt see her as weak and bet that she wouldn't last very long. Turns out she's more capable than expected",
                    "score": 32,
                    "author": "TheNononParade"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"And Myron couldn’t’ even follow the most important rule\" what rule is that you say \n\"11 – If you see Room 1913, do not look directly at the numbers. Do not open the door. This is, by far, the most important rule.\" I can only assume that he looked at the numbers and opened the door which is why none of the docs or janitors were surprised to find him doing that to himself. Did anyone else catch that or am I reading into it.",
            "score": 216,
            "author": "TheDoctorIsOutThere",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the doctors/janitors have, at the very least, just seen this type of behavior before.....which is quite the red flag (no pun intended). It's also entirely possible that they not only have seen this before, but know what rule(s) are broken that precede said behavior.",
                    "score": 114,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The janitors are likely not just janitors, seeing as they’re in the rules too.",
                            "score": 82,
                            "author": "herrored",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Or being a janitor grants you some sort of administrative privileges or immunity in this hospital. It’s like being an NPC. Either that, or here’s another twist: the janitors have their own set of rules to follow up on. Being a competitive environment, the janitors that catch the rule-breaking doctors get to live another day. They miss the quota, and they’re finished. And then there is Dr. Scritt who might be beholden to another set of rules. If she fucks up her streak, she gets penalized by the hospital.",
                                    "score": 68,
                                    "author": "LiKenun",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Since she seemed pleased to have her streak disrupted I dont think she will get punished for that.",
                                            "score": 19,
                                            "author": "mia_elora",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Good looking out!",
                                    "score": 7,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That immediately came to my mind. He broke rule 11.",
                    "score": 23,
                    "author": "InkSpiller333"
                },
                {
                    "level": 1,
                    "comment": "And because the door was already open, OP neither saw the numbers nor had to open the door, allowing the room to not affect them",
                    "score": 24,
                    "author": "OnBrokenWingsIsoar"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Poor Myron. You'd think a top student at Johns Hopkins would be able to get into a better hospital than this...\n\nAre you a resident or attending? I wasn't clear on that.",
            "score": 31,
            "author": "TriPolarBearz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just because someone has the money or book smarts for John Hopkins doesn't mean they have the common sense to survive in such an extraordinary situation.\n\nEither that, or he was entirely a man of \"science\" that didn't believe in the supernatural, but that also goes back to lacking in common sense.",
                    "score": 21,
                    "author": "Zom_BEat_or_BEa10",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree. But I mean that he should have been smart enough to get hired at a better hospital. Oh well",
                            "score": 10,
                            "author": "TriPolarBearz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He should have been smart enough to live.",
                                    "score": 8,
                                    "author": "Zom_BEat_or_BEa10"
                                },
                                {
                                    "level": 3,
                                    "comment": "Maybe he will wanted to serve an underprivileged community.",
                                    "score": 5,
                                    "author": "anubis_cheerleader"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "She’s probably an intern (first year of residency). She said “8 years later” and they do 4 years of undergrad, 4 years of med school, then 3-7 years of residency (depending on specialty).",
                    "score": 12,
                    "author": "incongruousmonster"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 120,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 7,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh heck,,, I blame everything on Scritt even her name sounds fishy",
            "score": 39,
            "author": "blaclwidowNat"
        },
        {
            "level": 0,
            "comment": "Well you've got 47 minutes of walking so you can Google while you walk.",
            "score": 41,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Eating your own stomach is like recursion without a termination clause.",
            "score": 18,
            "author": "gotbotaz",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I live in Huntington, less than an hour away. Everything about this state is off, the wrong turn movies are more than movies. There are some hollers people just don't go down. If you want to make it at the hospital just keep your head down and follow the rules. The more you learn about the weird shit in this state the less you really know.",
            "score": 88,
            "author": "laurensmim",
            "replies": [
                {
                    "level": 1,
                    "comment": "True.  There's one in the southeast of the state along the interstate called Painted Creek Road.  I had to take that exit, once, and **never again**.",
                    "score": 42,
                    "author": "mia_elora",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What happened?",
                            "score": 10,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There is a feeling when you enter one of these places.  We could sense *it* watching, waiting for us to take a wrong turn.  The headlight didn't dim, but suddenly were barely doing any good.  The trees were suddenly much more menacing.  The darkness felt like it was trying to reach into the vehicle.  No sound of nature reached our ears, at all.  We spent 45 minutes traveling through there, and I can tell you with certainty that if we had taken a single wrong turn we would *never* have left.",
                                    "score": 39,
                                    "author": "mia_elora",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Be glad you're not in the UK. London has it's own share of shit. Take a wrong turn there, and you won't just get eaten by demons or whatever, you'll get stuck in *london traffic*. It's one of the most horrifying things that can happen. At that point you have to just abandon your car and walk home, fending off the typical guys in bowler hats, vampires, royal guards and very rarely, speedwagon.",
                                            "score": 22,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Reminds me of The Showers creepypasta or the one where you have to drive through a creepy woods late at night to have any wish granted.",
                                            "score": 8,
                                            "author": "izmalov36"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Born and raised WV. Some things are only slightly off.. Others are so far skewed there is no way to explain them.",
                    "score": 23,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I live in the Ozarks, and some of the more isolated areas are kinda like that. There's one wrong turn in NW Arkansas that I'll never take again. Well, maybe two. The less said about some things, the better. If I were to share those stories it would be on r/LetsNotMeet but I probably will not be sharing them.",
                    "score": 29,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I live in the Ouachitas in Western Arkansas. Same thing here as far as weird stuff goes. I've got a theory that general wierdness is at home in mountain areas.",
                            "score": 19,
                            "author": "Zom_BEat_or_BEa10"
                        },
                        {
                            "level": 2,
                            "comment": "Arkansas resident here!!! Love hearing about places I actually know about, have a good weekend....",
                            "score": 6,
                            "author": "dayer1"
                        },
                        {
                            "level": 2,
                            "comment": "Okay I literally live in NW Arkansas and I absolutely have to know what turn now. and honestly I’m dying to hear the story. You can message me if you feel like sharing but don’t feel like sharing so publicly",
                            "score": 5,
                            "author": "katencheyenne",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh, wow.  Charleston?  Well, there's enough burn stacks in the area that the off-schd crematorium won't be noticed by most.    \n\n\nAs someone born nearby (I was born in Huntington) I can tell you that some strangenesses will be scoffed at, but others will be met with an understanding by the locals.  Learn to tell the difference between someone imparting actual knowledge and someone teasing a newbie to the area - it can be a lifesaver.  \n\n&amp;#x200B;\n\nA few suggestions - \\*Never go looking for a Hell Gate.  There are supposed to be Nine of them in the area.  There are dozens of potential sites.  *Treat them all as real, but try not to talk about it.*  \\*If walking at night on a New Moon, try not to cross too much of open space without company.  The Mothman territory line fluctuates naturally with migration, so you're never quite sure if you are safe, or not, but *they* seem to like the darkness of new moons.  \\*If someone shows up at your hospital saying the mine collapsed, and they look like their clothing is antiquated, be careful to treat them with extra care - sometimes soft spots can form in the temporal skin and you can get people wandering in from farther afield in history than normal.  It's very, very important that you not turn on the TV when they are near, or show them a newspaper.  Cell phones are fine *as long as you don't try and show them the screen.*  \\*Carry extra Reeses - they are everyone's favorite candy... and maybe a kitkat, because I like them.  :P  \\*Don't date someone who's been there for more than a hundred years if their family hates you.  It's *possible* to survive, but... let's just say that if the Hills don't like you, they *really don't want* you to marry one of their sons/daughters/children.  If the Hills don't like you, it can be... tragic.\n\n&amp;#x200B;\n\nEnjoy the view, get out of Charleston some and enjoy the touristy stuff, and -oh!  One more thing.  Never drink the well water if you're alone.",
            "score": 69,
            "author": "mia_elora"
        },
        {
            "level": 0,
            "comment": "Love it!\n\nOkay but has no one else noticed that she unknowingly broke Rule #2??? \"If any other doctor displays erratic behavior, leave the area immediately. Do not make eye contact.\"\n\n&gt;With eye contact locked on me, he licked his lips, angrily stabbed a piece of his stomach, and lifted it to his mouth.\n\nAfter reading rule #2, my mind instantly went to this part, so I felt like maybe she saw the Burn Unit because even though she wasn't affected by the numbers on Room 1913 or opening the door to it, she was affected by Myron through eye contact (and whatever messed him up)",
            "score": 13,
            "author": "oneeb97"
        },
        {
            "level": 0,
            "comment": "You can fix it, there's a rule for it. But....stay away from scalpels and other sharp objects, you know. Just in case.",
            "score": 72,
            "author": "sassy_abbadon",
            "replies": [
                {
                    "level": 1,
                    "comment": "But she might as well just call herself webMD at that point",
                    "score": 14,
                    "author": "Pakd25"
                }
            ]
        },
        {
            "level": 0,
            "comment": "He obviously ate the peanut butter cups, realised that he shouldn't have, and tried to retrieve them.",
            "score": 10,
            "author": "aarongorn92"
        },
        {
            "level": 0,
            "comment": "You looked into his eyes. \n\nHope you’ll be okay, OP.",
            "score": 12,
            "author": "tmn-loveblue",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Clearly not an accredited residency program. Also, OP, try DynaMed or Epocrates or UpToDate. Google is not your friend.",
            "score": 7,
            "author": "bluet4ngo"
        },
        {
            "level": 0,
            "comment": "Why do so many of these establishments have rules!?",
            "score": 29,
            "author": "RIP_Country_Mac",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are too many creepy things to keep track of, I guess?",
                    "score": 11,
                    "author": "IndigoSynopsis"
                },
                {
                    "level": 1,
                    "comment": "Because too many unexplained or hard to explain deaths and disappearances make it difficult to stay in business. \n\nBesides, all places have rules. Some rules are just stranger than others.",
                    "score": 4,
                    "author": "Zom_BEat_or_BEa10"
                },
                {
                    "level": 1,
                    "comment": "If there were no rules in those places, there would be no survivor...",
                    "score": 2,
                    "author": "Permatato"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am intrigued. Make sure to keep us updated, OP! Would love to read of you rising and shining in that seemingly godforsaken hospital. But make sure to keep walking for now!",
            "score": 10,
            "author": "Cydraech"
        },
        {
            "level": 0,
            "comment": "Walk while Googling and you can shave an hour off your shift!",
            "score": 5,
            "author": "yujuismypuppy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Real advice here.",
                    "score": 2,
                    "author": "tmn-loveblue"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m not even halfway through reading and I’m already freaked. I went to St. Francis when I was about 7 (?) to see a special cardiologist. The place scared the hell out of me as a kid and I remember my parents being uneasy too. I can’t wait to tell my mom we were right to feel weird about it.",
            "score": 5,
            "author": "BeautifulRelief"
        },
        {
            "level": 0,
            "comment": "You should keep working there and uncover the mysterious, but do not break the rules. Try and get promoted too so you have access to other areas.",
            "score": 10,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Well ya better start walking I guess.",
            "score": 12,
            "author": "LizardJan"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 7,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Sounds like a general surgery residency.",
            "score": 6,
            "author": "NapkinZhangy"
        },
        {
            "level": 0,
            "comment": "That was riveting!!!  So that was the first to leave....  how did the next 12 fare?",
            "score": 5,
            "author": "spiderfalls"
        },
        {
            "level": 0,
            "comment": "time to put on some music and switch to some comfortable shoes, you have 47 minutes of walking to do!",
            "score": 4,
            "author": "emoverhere"
        },
        {
            "level": 0,
            "comment": "This is an amazing read. I cannot wait to hear what happens next! Hope you brought a power bar, you have 47 min walk to civilization.",
            "score": 5,
            "author": "-thisislife-"
        },
        {
            "level": 0,
            "comment": "So do the 47 minutes get deducted from the remaining 3 hours of the shift?",
            "score": 6,
            "author": "anathagenzum",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 9,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Internal Medicine residency is hell",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I always thought something was off about that hospital.",
            "score": 4,
            "author": "2LurkOrNot2Lurk"
        },
        {
            "level": 0,
            "comment": "As a current medical student, this has terrified me even more for residency. Hope to hear more OP, this was so captivating!",
            "score": 9,
            "author": "midnightdrops"
        },
        {
            "level": 0,
            "comment": "I get it... I think... but I'm not certain. English is my second language and I'm afraid a lot of things got lost in translation. Could someone reiterate the story for me? \n\nI thought it would turn I to a zombie story, then an experimental facility (after reading the rules), and then that the protagonist is... dead? As she was a kid? \n\nI'm just confuzzeld (confused + puzzled) :)",
            "score": 21,
            "author": "Maltaannon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I think you're losing a lot in the translation.\n\nBasically, OP works in a hospital with explicit rules that she wasn't given a copy of because she was the 19th person in line and only 18 copies were made.  The top student died, and she took his copy.  She's now in an area that has an explicit rule about it.  As for how or what is going on in that hospital - no one knows yet.",
                    "score": 53,
                    "author": "justathoughtfromme",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ok. That much I have gathered. I just don't see how the BURN UNIT plays into that. I get that we hardly know anything and that it can develop further on the BURN UNIT cliffhanger... but I just don't see it as a cliffhanger so I feel like I'm missing something important.",
                            "score": 18,
                            "author": "Maltaannon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The burn unit was listed as an area that does not exist at the hospital. We dont know if she's going to do what she's supposed to and walk down the hall for the 47 minutes specified in the rules.",
                                    "score": 16,
                                    "author": "two-legged-freak"
                                },
                                {
                                    "level": 3,
                                    "comment": "Don't get hung up that it's specifically a BURN UNIT.  It could have been a cardiac unit or an OB/GYN clinic or any other specific unit in the hospital.  What's important is that the hospital has no burn unit, OP is there now, and she needs to abide by the rules she now has.",
                                    "score": 28,
                                    "author": "justathoughtfromme"
                                },
                                {
                                    "level": 3,
                                    "comment": "I think you're thinking that the all-caps was emphasizing how important the burn unit was, when really it was just the label on the wall. As of now it's not any more important to the story outside of being something supernatural that was covered in the rules.",
                                    "score": 6,
                                    "author": "herrored"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That you had to wait until one of your classmates died to get a copy of the rules and said so nonchalantly - seriously gave me chills. No doubt you'll pull through OP.",
            "score": 3,
            "author": "attyh"
        },
        {
            "level": 0,
            "comment": "Keep walking OP until you get out of there! I'm curious to know why they bet on people...",
            "score": 3,
            "author": "destineef1997"
        },
        {
            "level": 0,
            "comment": "As a med student, I think you hace made an excellent description of what any job out there is like for us",
            "score": 3,
            "author": "agnesashworth"
        },
        {
            "level": 0,
            "comment": "I've transported some patients to Charleston. Its fucking weird up there. Almost ran into a small UFO on the way back through the woods. Best we can figure was mothman.",
            "score": 3,
            "author": "Drakothin"
        },
        {
            "level": 0,
            "comment": "you should look at practicing in Canada. Shortage of Doctors and would be treated better than that.",
            "score": 3,
            "author": "roxyroller369"
        },
        {
            "level": 0,
            "comment": "will you update us if you get back to the hospital alive?",
            "score": 5,
            "author": "florahora"
        },
        {
            "level": 0,
            "comment": "Amazing story! I hope you make it, we need excellent Dr's in WV!",
            "score": 5,
            "author": "Kellymargaret"
        },
        {
            "level": 0,
            "comment": "Aaaaaaaaaaaa5attatttttattttT'",
            "score": 2,
            "author": "HolyMarshMELLOWPuffs"
        },
        {
            "level": 0,
            "comment": "While I didn't realize that I'm holding my breath most of the time while reading this.",
            "score": 2,
            "author": "vivi_anne07"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "And here I thought I had it tough with my APs... good luck OP \n You got a long walk ahead",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Hope you update soon OP! Enjoy your 47 minute walk!",
            "score": 2,
            "author": "princessoffreakks"
        },
        {
            "level": 0,
            "comment": "Well, I really, Really hope we'll hear more of you soon. Have a nice walk doctor, and please, don't touch any reese cups my dear",
            "score": 2,
            "author": "iEmoto"
        },
        {
            "level": 0,
            "comment": "Ah, well. This is the first time I’ve seen one of these from my home state... good thing I was born in Parkersburg.",
            "score": 2,
            "author": "Ellogov21"
        },
        {
            "level": 0,
            "comment": "Remember op there is no burn unit start your 47 min walk good luck",
            "score": 2,
            "author": "8corrie4"
        },
        {
            "level": 0,
            "comment": "I live two hours from Charleston. This is dreadfully close to home, and I *love it*.",
            "score": 2,
            "author": "RyanOfGilead"
        },
        {
            "level": 0,
            "comment": "Well. There goes my application there, I'm not far from Charleston, but I've worked enough *crazy* hospitals to know which ones to avoid!",
            "score": 2,
            "author": "JadeEclypse"
        },
        {
            "level": 0,
            "comment": "\\*finds Reeses peanut butter cup\\* \"Ooooooh! A piece of candy\"\n\nI'd be buggered!",
            "score": 2,
            "author": "Rookie117117"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I literally live here and have been to this hospital numerous time. I worked in Doctor Moushmoush’s office.",
            "score": 2,
            "author": "sunshinewoman88"
        },
        {
            "level": 0,
            "comment": "Didn’t you break rule 1 by sharing this story???",
            "score": 2,
            "author": "sheeeeelby"
        },
        {
            "level": 0,
            "comment": "u/kitkatkaye read this",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I swear every other day someone post a story with this same “list of rules” plot where the list is loaded with creepy/unexplainable instructions",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is excellent",
            "score": 2,
            "author": "rootbeerfloat77"
        },
        {
            "level": 0,
            "comment": "those rules are the COOLEST",
            "score": 2,
            "author": "Edawg649"
        },
        {
            "level": 0,
            "comment": "Eating your cut up stomach would return it to your stomach, leaving you with the same amount of stomach. What a waste of time.",
            "score": 2,
            "author": "Tyranix969"
        },
        {
            "level": 0,
            "comment": "I didn’t realize this was a horror story sub until half way through and was legitimately freaking out. Kept wondering why I felt like I was reading goosebumps",
            "score": 2,
            "author": "cmf521"
        },
        {
            "level": 0,
            "comment": "Rule 5. I wonder if that is like British hospitals where so many people die by medical mishaps, causing the NHS to pay out billions in compensation claims. No dead body means you can't disprove what a doctor claims.",
            "score": 3,
            "author": "MikeinSpain"
        },
        {
            "level": 0,
            "comment": "Does your hospital not have a copy machine?",
            "score": 2,
            "author": "PtolemyShadow",
            "replies": [
                {
                    "level": 1,
                    "comment": "No one would give her their rules, even to copy and return it.",
                    "score": 7,
                    "author": "shoukota",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"Borrow\" it, make a copy, sneak it back.",
                            "score": 3,
                            "author": "PtolemyShadow",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh okay then, wish she tried that.",
                                    "score": 1,
                                    "author": "shoukota"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}