{
    "id": "dyqd5e",
    "score": 47157,
    "title": "Something walks whistling past my house every night at 3:03.",
    "author": "Grand_Theft_Motto",
    "date": 1574195866.0,
    "url": "https://www.reddit.com/r/nosleep/comments/dyqd5e",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/Grand_Theft_Motto/comments/emzy3b/the_stories/)",
        "https://travisbrownwriting.com)"
    ],
    "postText": "Every night, no matter the weather, something walks down our street whistling softly. You can only hear it if you’re in the living room or the kitchen when they walk by and it always starts at exactly 3:03. The sound starts faint, somewhere near the beginning of the lane near the Carson place. We’re towards the middle of the street, so the whistling moves past us before fading away in the direction of the cul de sac.\n\nWhen I was younger, my sister and I would sneak into the kitchen some nights to listen. Mom and dad didn’t like that and we’d catch Hell if they found us out there but they were never too hard on us since we always stuck to the one Big Rule.\n\nDon’t try to look at whatever was whistling.\n\nMy neighborhood is a funny place. I’ve lived here since I was six and I love it. The houses are small but well-kept, good-sized yards, plenty of places to roam. There are a lot of other kids here my age, I turned 13 back in October. We grew up together and would always play four square in the cul de sac or roam around from back porch to back porch in the summer. This was a good place to grow up, I’m old enough to see it. And there’s only the two strange things here; the night whistling and the good luck.\n\nThe whistling never bothered me much. Like I said, I couldn’t even hear it from my bedroom. But mom and dad don’t like talking about it, so I’ve stopped asking questions. My dad is a strong guy, tall and calm. He has an accent since he moved to the US as a kid. His family, my grandparents, they’re from the islands. That’s what they call it. My dad, the only time he isn’t so calm is if the whistler comes up.\n\nHe talks a little quicker then, eyes move faster, and he tells us not to think about it so much and to always remember the one rule, the Big Rule: don’t try to look outside when the whistler goes past.\n\nNot that we could look even if we wanted. See, there are shutters on the inside of every window, thick pieces of heavy canvas that pull down from the top and latch to the bottom of the window frame. Each latch even has a small lock, about the size of what you’d find on a diary. My dad locks those shutters every night before we all go to bed and keeps the key in his room.\n\nMy mom…I don’t know what she thinks about the whistling. I’ve seen her out in the living room before at 3:03 when the sound starts; I could see her if I cracked my door open just an inch to peek. She’s not out there often, at least I haven’t caught her much, but once or twice a month I think she sits out there on our big red couch just listening.\n\nThe whistler has the same tune every night. It’s…cheerful.\n\n*Da da dada da dum. Da da dada da dum.*\n\nRemember how I said there are two odd things about where I live? Well, besides our night whistler, everyone in my neighborhood is really lucky. It’s hard to explain and dad doesn’t like us talking about this part much, either, but good things just seem to happen to people around here a lot. Usually, it’s small things, winning a radio contest, or getting an unexpected promotion at work, or finding some arrowheads buried in the yard, you know, the authentic kind.\n\nThe weather is pretty good and there’s no crime and everybody’s gardens bloom extra bright in the fall. “A million little blessings,” I’ve heard my mom say about living here. But the main reason we stay here, why we moved here in the first place, is my sister Nola. She was born very sick, something with her lungs. We couldn’t even bring her home when she was born, only visit her in the hospital. She was so small, I remember, small even compared to the other babies. A machine had to breathe for her.\n\nWe moved into our house here to be closer to the hospital. As soon as we moved here, Nola starting getting better. The doctors couldn’t figure it out, they chalked it up to whatever they were doing but we all could tell they were confused. But my parents knew, even I knew, Nola getting better was just another of the million little blessings we got for living in our neighborhood.\n\nSo that’s why we stayed even after we found out that, for every small miracle that happens here every day, now and then…some bad things happen. But they only happen if you look for the whistler.\n\nSee, our neighborhood has a Welcoming Committee. They show up with macaroni casserole and a gift basket and a manila folder whenever someone new moves in. They’re very friendly. Four people showed up when we moved in seven years ago. The committee made small talk, gave me a Snickers bar, and took turns holding Nola. It was her first week out of the hospital so they were extra careful.\n\nThen the committee asked to speak to my parents in private so I was sent to my room where I still managed to hear nearly every word. The Welcoming Committee told my parents about how nice the neighborhood was, really exceptionally, hard-to-explain kind of nice. And then they told my parents about the even harder-to-explain whistling that happened every morning at 3:03 and ended at the tick of 3:05. The group, our new neighbors, warned my parents that the whistling was quiet, would never harm or hurt us, as long as we didn’t look for what was making the sound.\n\nThis part they stressed and I pushed my ear into the door straining to hear them. People who went looking for the whistler had their luck change, sometimes tragically. A black cloud would hang over anyone that looked. Anything that could go wrong, would. The manila envelope the committee brought over contained newspaper clippings, stories about car crashes and ruined lives, public deaths and freak accidents.\n\n“Not everyone dies,” I heard the head of the committee tell my dad. “But the life goes out of ‘em. Even if they live, there’s no light in them ever again, no presence.”\n\nMy mom, I could tell she wasn’t taking it seriously. She kept asking if this was some prank they play on new neighbors. At one point my mom got angry, accused the committee of trying to scare us out of our new home, asked them if they were racist on account of my dad being from the islands. My dad calmed her down, told her he could tell our new neighbors were sincere and they were just trying to help us. He explained that he grew up hearing these kinds of stories from his mom and that he knew there were strange things that walked among us. Some of those strange things were good and some were bad but most were just different.\n\nAfter the committee left, dad went out to the hardware store, bought the canvas blinds, the latches, and the locks and installed them on every window in the house after dinner. That first night in our new house, I crept out of my room at 3 a.m. only to find my dad awake sitting on the living room couch, holding my baby sister. My dad held up his finger in a shh motion but patted the couch next to him. I sat and we waited.\n\nAt exactly 3:03 we heard the whistling.\n\n*Da da dada da dum. Da da dada da dum.*\n\nIt came and it went just like our neighbors said. The whistling returns each night and we never look and we enjoy our million little blessings every day. Nola breathes on her own and she’s grown into a strong, clever girl. My dad even joined the Welcoming Committee. We don’t get new neighbors often, why would anyone want to leave? But when a new family moves in, my dad and the committee bring them macaroni casserole, a gift basket, and the manila folder. I can always tell by the look on my dad’s face when he comes back if the family took the committee seriously or if we’d be getting new neighbors again very soon.\n\nNot long ago a family moved in directly next to us. The previous owner, Ms. Maddie, passed away at age 105. She’d lived a good, long life. Our new neighbors seemed like they’d fit in just fine. They believed the Welcoming Committee, took my dad’s advice about the locking shutters since they had a young child of their own. Whatever newspaper clippings were in that manila envelope, whatever evidence, my dad never let us see. But I imagine it must have been awfully convincing since our neighbors got along with no issues for the first month.\n\nOne night, when our new neighbors had to leave town, they sent their son, Holden, to stay with us. He was 12, a year under me in school. I didn’t know him well before that night but as soon as his parents dropped him off after dinner I could tell it was going to be a bad time.\n\n“Do you know who is always out there whistling every night?” Holden asked the moment the adults left the room.\n\nThe three of us were sitting in the den, some Disney movie playing idly on the television.\n\nMy sister and I exchanged a glance. “We don’t talk about that,” I said.\n\n“I think it’s that weirdo that lives in the big yellow house on the corner,” Holden said.\n\n“Mr. Toles?” my sister asked. “No way, he’s really nice.”\n\nHolden shrugged. “Must be a psycho killer, then.”\n\nNola tensed.\n\n“We don’t talk about it,” I repeated. “Let’s go in my room and play Nintendo.”\n\nWe spent the next few hours playing games, eating popcorn and then watching movies. A typical sleepover but I could see Holden was getting antsy.\n\nAfter my parents had wished us a good night, locked the blinds, and gone to bed, Holden stood up from his bean bag and walked over to where Nola and I were sitting on my bed.\n\n“Have you ever even tried looking?” he asked. “It’s nearly time.”\n\nLike most sleepovers, we’d conveniently ignored any suggestion of a bedtime. I was shocked to see he was right; it was almost 3 a.m.\n\nI sighed. “We don’t-”\n\n“See, I can’t, I can’t even try to look because my dad locks the blinds every night and hides the key,” he continued, ignoring me.\n\n“So does our dad,” said Nola.\n\n“No,” replied Holden. “No, he doesn’t.”\n\n“You saw him do it,” I said, a little sharper than I meant to sound.\n\nHolden grinned. “Your dad locks the blinds, yeah, but he doesn’t hide the key. He keeps it right on his normal key chain.”\n\n“So?” I asked, worried I already knew what he would say next. Because I had noticed that my dad didn’t bother hiding the key anymore after all of these years. Because he knew we took it seriously.\n\n“So, after your dad locked up but before your parents went to bed, I went to the bathroom. And on my way, I may have peeked into their room, and I may have seen your dad’s key chain on his nightstand, and I maybe went and borrowed the key to blinds.”\n\nNola and I stared and his grin only grew wider.\n\n“You’re lying,” I said.\n\nHolden shrugged. “You can check if you want. Just open your parents’ door and look, you’ll see his keychain right there on the nightstand.”\n\n“Stay here,” I told both of them. “Don’t move a muscle.”\n\nI hurried over to my parents’ room but hesitated at the door. If Holden wasn’t lying…my dad would be angry. Beyond angry. I was scared thinking about it. But more scared of an open window with the whistler right outside. I opened the door, barely an inch, and looked in but it was too dark to see. Taking a deep breath, I walked into the room.\n\nTwo steps into the dark I froze. The whistling started. And I could hear it clearly…from my parents’ room. I never realized but they must have heard the sound every night since we moved into the house. They never told us. I don’t think I could have slept through it.\n\nI stood there, listening to the whistling come closer, unsure whether I should turn on a light or call out for my dad. Soft sounds from the living room brought me back to reality.\n\n“Nola,” I yelled, running out of my parents’ room.\n\nHolden and Nola were standing near the front door next to a window. Holden wasn’t lying. I could see him fumbling with the lock on one of the blinds. I heard a click. He did have the key.\n\nHolden let out a quick laugh. Nola stood next to him, hunched up, afraid but maybe curious. The whistling was right outside our house now.\n\nI think I made a sound, called out. I can’t remember. Time felt frozen, clock hands nailed to the face. But I found myself moving. I’m not fast, I’ve never been athletic. Somehow, though, I covered the space between myself and Nola in a moment. My eyes were locked on her but I heard Holden pull the blind all the way down so it could release. I heard the snap of it start to raise, and I heard the whistling just on the other side of the window.\n\nBut I had my arms around Nola and I turned us so she was facing away from the window. At the same time, I jammed my eyes shut.  The blind whipped open.\n\nThe whistling stopped.\n\nI felt Nola shaking in my arms.\n\n“Don’t look, okay?” I told her. “Don’t turn around.”\n\nWe were positioned so that she was facing back towards the hallway and I was facing the window. My eyes were still closed. I felt her nod into my shoulder.\n\nI reached out with the arm not holding Nola and tried to touch Holden. My hand brushed against his arm. He was shaking worse than Nola.\n\n“Holden?” I asked.\n\nSilence.\n\nI reached past him and gingerly felt for the window, eyes still sealed shut. The glass was cold against my fingertips. Colder than it should have been for the time of year. I moved my hand up the window, searching for the string to the blind. The glass began to get warmer the further I reached and there was a gentle hum feeding back into my fingertips. I tried not to think about what might be on the other side of the window. Finally, I touched the string and yanked the blinds shut.\n\nI opened my eyes. In the dim light leaking out from the kitchen, I could make out Holden, pale and small, staring at the now closed window.\n\n“Holden?” I asked again.\n\nHe turned towards me and he *screamed.*\n\nEverything became a flurry of motion. Lights sparked to life in the hall, then the living room. My parents’ footsteps thudded across the hardwood floor. I didn’t turn to look back at them, my eyes were glued to Holden.\n\nHe was pale, had bit his lip so hard there was a thin red line of blood running down his chin and he’d wet himself.\n\n“What happened?” my dad asked from behind me.\n\nI managed to swivel away from Holden and look back. “He looked.”\n\nI’d never seen my dad scared before but I saw it that night, in that moment, an old, ugly terror stitched on his face. A parent’s fear.\n\n“Just Holden?” he mouthed to me.\n\nI nodded yes.\n\nMy dad let out a breath. He looked so relieved I nearly expected him to cheer. But then he turned to Holden and my dad’s face changed. I wondered if he felt bad for feeling good that Holden was the only one that looked.\n\nThere was a knock at the door.\n\nWe all froze. Holden whimpered.\n\n“Don’t answer it,” my mom said.\n\nShe stood at the threshold of the hall. I’d always thought she was a skeptic and just humored my dad about the windows and the whistler but that night we were all believers. I noticed that both of my parents held baseball bats they must have taken from their bedroom.\n\nThe knock came again, a little louder this time.\n\n“Please don’t open the door,” Holden whispered.\n\nMy dad walked over to him, hugged him close.\n\n“We won’t,” my dad promised, still holding his bat. “Nothing is coming in here tonight.”\n\nThud thud thud\n\nThis time the knocking was loud enough to rattle the door. Holden screamed again and Nola clutched her arms around my neck. My mom came over and knelt down next to us, wrapping my sister and me close.\n\n**Thud thud thud**\n\n“Call the police,” my mom whispered to my dad.\n\nThe knocking instantly stopped. My dad looked over his shoulder at us.\n\n“Do you think-”\n\nHe was cut off by frantic knocking that trailed off to a polite tap tap tap.\n\n“*Police*,” something said from the other side of the door.\n\nThe voice from outside sounded exactly like my mom, like a parrot repeating the words back to her.\n\n“*Police*. *Call*. *The police*.” **tap tap tap** “*Police*.”\n\nMy mom pulled us closer.\n\n“*Police*. *Police*. *Police*. *Police*.”\n\n“Please stop,” I heard her whisper.\n\n“I don’t think calling them will help,” my dad said. “How will we know when they’re the ones at the door?”\n\nThe knocking came back harder than before. The door shook. Then it stopped. After a long moment, I heard the knocking again but it was coming from our backdoor.\n\nWe all turned together towards the backdoor but the knocking immediately returned to the front door. Front to back, back to front, loud then quiet then loud again. Suddenly, the sound was coming from both doors at once, big, heavy blows like a sledgehammer. Then something started rapping against all of the windows in the house, then the walls. It was like we were living inside a drum with a dozen people trying to play at once. Or we were a turtle and something was attempting to claw us out of our shell.\n\n“STOP!” Holden yelled.\n\nThe knocking died.\n\n“I won’t tell,” Holden said, staring at the door. “I promise I won’t tell anyone what I saw. Just please go away.”\n\nWe waited for nearly a minute. Then we heard it, a soft *tap tap tap* coming from the window Holden had looked through earlier.\n\nHolden started to cry, sobbing like a prisoner watching gallows being built outside their cell.\n\nMy dad held him, brushed his hair but never lied to him, never told him things would be okay.\n\nThe tapping at the window went on for the rest of the night. We huddled together in the living room for I don’t know how long. Eventually, my mom tried to take us kids into my room while my dad stayed to watch the door. But the second we moved into my bedroom the knocking came back, so loud it was possible to ignore. I was afraid the door couldn’t take it.\n\nWe went back to the living room and the knocking stopped. Only the tap tap tap on the window remained. None of us slept that night.\n\nThe tapping stopped around 7 a.m. That’s about the time the sun comes up here. We waited another two hours before my dad opened the blinds from one window. He made us all go back to my parents’ bedroom first. I heard him open the door then come back in.\n\n“Okay,” he told us. “It’s done.”\n\nHolden’s parents came back around lunchtime. My mom and dad walked Holden over to his house and they all went inside for quite a while. Nola and I watched from the window. She stuck to me the whole day, right at my side, sometimes holding my hand. When my parents came back they looked grim but wouldn’t tell us what they said to Holden’s family. It was a Sunday so we all spent the day together, ordered pizza and watched movies.\n\nThat night everyone slept in my room, Nola and my mom in the bed with me, my dad in a chair he’d pulled over. There was no knocking that night or any night since.\n\nWe didn’t see much of Holden or his parents for the rest of that week but by Thursday there was a moving truck in their driveway. Nola and I watched them packing up the whole afternoon after school. What sticks with me most is how tired Holden and his parents looked. All three had the same pallor, grim mouths and light-less eyes. Even from across the street I could tell something was very wrong. Holden and his family were gone before sunset.\n\nI remember what the original Welcoming Committee said to my parents when we moved in. Not everyone who looks at the whistler dies, but even those that live have the light go out of them and the rest of their lives are full of misfortune. A million little tragedies.\n\nI think Holden’s parents must have looked, either to comfort him if they didn’t believe or share the burden if they did. I watch Nola some days, happy and young and alive, and I wonder if I’d been slower, if she’d looked out the window that night…would I have looked too? To comfort her? To share that burden? I’m glad I don’t have to find out.\n\nWe still live in that house, in that neighborhood. We still hear our whistler walking past every night. The blessings, the luck, the good things here are too good to leave. But we’re careful. We don’t have friends over to spend the night anymore. And my dad hides the key to the blinds very, very well. Not that I’ve gone looking. Some things you just don’t need to look for.\n\n&amp;#x200B;\n\n[GTM](https://www.reddit.com/r/Grand_Theft_Motto/comments/emzy3b/the_stories/)\n\n[Hello](https://travisbrownwriting.com)",
    "comments": [
        {
            "level": 0,
            "comment": "OP has a wonderful way with words and has shared his experience with us so poignantly. We appreciate so many of you sharing your appreciation with him! However, please remember that OP is here to share a scary experience with us all, and we ask that all comments address the experience itself, and not OP’s ability to share it so well.\n\nThank you! \n\nPS. OP you are so unbelievably brave! You saved your sister’s life that night.",
            "score": 1,
            "author": "OnyxOctopus",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I have a video doorbell... I've already lost this fight. Great Read!",
            "score": 6766,
            "author": "ObligatedOstrich",
            "replies": [
                {
                    "level": 1,
                    "comment": "Open the door at 3:04, and be like \"HEY, we are trying to get some sleep in here! Keep it down Damnit!\"",
                    "score": 2609,
                    "author": "TheLastPanther",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The Whistler doesn't go away until 3:05. You'd have a bad time.",
                            "score": 1395,
                            "author": "Coachskau",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "*I know* :)",
                                    "score": 948,
                                    "author": "TheLastPanther",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Open the door at 3:03 the second he comes then hit like and subscribe for good luck forever",
                                            "score": 585,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Fuuuuck",
                                                    "score": 159,
                                                    "author": "EntitledPupperMom",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You hear loud knocking on the doors, and windows, you open the door and you see it. You angrily hit him with a left hook \n\"FUCK OFF IM TRYING TO SLEEP\" the whistler is shocked and leaves, you are even more lucky now",
                                    "score": 757,
                                    "author": "LoopZoop2tokyodrift",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Does everyone hear the whistler at the same time or do they hear the whistler at different times based on where they live in the town?",
                                    "score": 266,
                                    "author": "RampantBeast",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think it's meant to be the same time for everyone.",
                                            "score": 236,
                                            "author": "Totally_TJ",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Honestly that would make it more scary. Just the fact that no matter where you are, you always hear it, same time, same tune, same voice. No matter where you go, how far from the road, the center of town, it follows you, waiting for you to peek through the curtains.",
                                                    "score": 231,
                                                    "author": "dishonoredTR33",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "No, as OP said, he can't hear the whistling from his room. So I think it has to do with how far you are from the road on which the whistler walks.",
                                                            "score": 140,
                                                            "author": "Lancelot156",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "*dah-dah ^dah dah*",
                                    "score": 64,
                                    "author": "Tonynferno"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Put some mini  blinds with a lock over your doorbell!",
                    "score": 148,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Damn you technology driven curiosity",
                    "score": 47,
                    "author": "BigFamBam",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does the Whistler adhere to Daylight Savings?",
            "score": 4083,
            "author": "ShawtyUa10",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is a seriously underrated comment.",
                    "score": 399,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just asking the burning questions, ya know?",
                            "score": 235,
                            "author": "ShawtyUa10"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He must if it happens EVERY night at 3:03.",
                    "score": 336,
                    "author": "hi_brett"
                },
                {
                    "level": 1,
                    "comment": "They might be in Arizona. We don't got no daylight savings here.",
                    "score": 313,
                    "author": "igivelurks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "r/todayilearned there is no daylight savings in Arizona,,,",
                            "score": 209,
                            "author": "arna1423",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe people who speak about what they saw are the ones who die?",
            "score": 3522,
            "author": "MasterOfReaIity",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh right!!!",
                    "score": 737,
                    "author": "zachlyh"
                },
                {
                    "level": 1,
                    "comment": "Dude...you alive?",
                    "score": 111,
                    "author": "jayeshmange25",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bro still hasn't answered",
                            "score": 27,
                            "author": "Jay4025"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "999 upvotes",
                    "score": 80,
                    "author": "Thermo445"
                },
                {
                    "level": 1,
                    "comment": "Ok but like what happens to the ones who hear about it from that person?",
                    "score": 59,
                    "author": "CoyoteAggravating876",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "maybe he told his parents what they saw and they didnt even look",
                            "score": 28,
                            "author": "Own-Sun6531"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Opened Reddit at exactly 3:02, saw the title, and just knew I had to read it. Best choice I’ve ever made—this was phenomenal. I hope your family keeps having a good life, and I’m so glad you saved your sister that night.",
            "score": 1739,
            "author": "all-out-fallout",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah it was 3:03 when I started reading this. It's 3:15 now",
                    "score": 241,
                    "author": "garroshsucks12",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your dad is a very wise man to take this seriously. \n\nMy grandparents live in a village in Malaysia and we have similar stories. Whenever we go into the forest, we have a saying that asks the spirits to grant us safe passage and forgive our disturbance. Foreigners who do not say this have bad things happen to them quite often. It seems like too much of a coincidence that so many cultures have such beliefs if there isn't any truth to it.",
            "score": 1148,
            "author": "snaptastica",
            "replies": [
                {
                    "level": 1,
                    "comment": "Filipino here and we have a similar thing. We say \"tabi po\" which roughly translates to excuse me when we go somewhere in the forest, even when we sit on a rock or do some gardening.",
                    "score": 388,
                    "author": "the_av0cad0"
                },
                {
                    "level": 1,
                    "comment": "My mother is malaysian, but she lived in the city. Any chance you’re willing to share the phrase?",
                    "score": 132,
                    "author": "ocax8me",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yoo im from melaka now where's the phrase it's been 2 years",
                            "score": 11,
                            "author": "Joske-the-great",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "ayy i just visited down there few weeks ago, so hot 🥵",
                                    "score": 12,
                                    "author": "ocax8me",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Indeed that im sick all the fucking time",
                                            "score": 7,
                                            "author": "Joske-the-great"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I identify with these stories so much because my family comes from the Caribbean. We have a lot of ghost stories here and we have versions of ghosts called \"duppy\" but they are specifically malicious, so it feels very genuine that the dad would take the warnings seriously. I also identify with the kids being so obedient in the story. Caribbean kids don't need to be told instructions twice especially when it concerns spooky shit like this",
                    "score": 119,
                    "author": "Kitchen_Salad",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you mind sharing some of your ghost stories? I lived down there for a bit but never got to hear any.",
                            "score": 16,
                            "author": "MissCyanide99"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You're one very wise kid to take it seriously and follow your dad's lead. Poor Holden, thinking it was a game or something, messing around with dark powers not of this world. I loved the telling of this story. Very well done mate.",
            "score": 2832,
            "author": "gotbotaz",
            "replies": [
                {
                    "level": 1,
                    "comment": "One /r/kidsarefuckingstupid for the ages.",
                    "score": 998,
                    "author": "savesthedaystakn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Too true lol",
                            "score": 102,
                            "author": "TheSpicyTriangle"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The song I was listening to had knocking sound-effects, I felt a shiver go down my spine and I now have goosebumps. Brilliant story!!!",
            "score": 472,
            "author": "TheRakshaWolf",
            "replies": [
                {
                    "level": 1,
                    "comment": "Was it Britney Spears - Lucky?",
                    "score": 84,
                    "author": "ilovepolthavemybabie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Frozen - do you wanna build a snowman",
                            "score": 132,
                            "author": "Ahri_went_to_Duna"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My mom grew up with exactly the same situation when she was young, she lived in Upington, South Africa near an old angelo-boer concentration camp site (from the Angelo Boer war), the area they lived in was significantly better than the other areas around them, a lot richer, better properties and people seemed to prosper there, and every single night (I think around 2 or 3 am) without fault they would hear a whistler down the road, I don't think they had the same problem as you do in your street with not being allowed to look but my mom would always tell us how the air seemed to tense whenever the whistling started and the animals would start crying or growling. Very weird.",
            "score": 365,
            "author": "sxyslmndrcvs75",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow, my dad grew up in Upington. I'll have to ask him if he knows anything about it.",
                    "score": 58,
                    "author": "Eldinarcus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Does your dad know anything about it?",
                            "score": 30,
                            "author": "Gianni_EXE2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Does his dad know anything about it?",
                                    "score": 25,
                                    "author": "omXgabeasts",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Did anyone ever find out if his dad knows anything about it?",
                                            "score": 47,
                                            "author": "MissCyanide99",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don’t believe his dad knows anything about it judging by the time that has passed sadly :(",
                                                    "score": 29,
                                                    "author": "puma47TV",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Breaking news: his dad....knows nothing about it",
                                                            "score": 42,
                                                            "author": "Iginlas_4head_Crease",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can we all commend the dad for believing? In so many stories people just have to mess with the supernatural. And I already thought I was the only superstitious person in the world. Well done that your family came out of this alright. Holden put your entire family st risk.",
            "score": 352,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "OP as well. Pretty mature for her age and well, I can imagine any other 13 year old scoffing at their parents and sneaking a peek for themselves.",
                    "score": 163,
                    "author": "longlegs25",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i think its a boy",
                            "score": 63,
                            "author": "yaxir"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't know how you could not look out that window, I can only imagine whatever was outside looked like",
            "score": 1703,
            "author": "Doctor_Craic",
            "replies": [
                {
                    "level": 1,
                    "comment": "I try not to think about it.",
                    "score": 1310,
                    "author": "Grand_Theft_Motto",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My palms were a little sweaty during Holden looking out the window and explaining about how he took the key. I could see the whole thing in my head perfectly. Glad I read it during the day.",
                            "score": 487,
                            "author": "larrbud",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Am I the only one who pictured my own childhood home and neighborhood? The way he described the home matched perfectly and made it all the more insanely terrifying...",
                                    "score": 273,
                                    "author": "Pseudonym0101",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "For some reason I've always done the same thing every time I read a story. My mind always defaults to my childhood home. Then again, I grew up in a creepy ass house so I suppose it's fitting haha",
                                            "score": 120,
                                            "author": "tapestryofobscenity"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I know -- I had a sudden fear Holden had opened the shutters in the parents' room, to try to make them see the whistler.  Glad he wasn't a total psycho.",
                                    "score": 80,
                                    "author": "Rose_in_Winter"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I just thought now, if you thought about it for long enough and came really close to what it actually looks like... would it know? Just knowing what something like that looks like even theoretically? Just a thought.",
                            "score": 386,
                            "author": "Doctor_Craic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Only a slight slice of glass in the way. But if you don't look, if you don't see it, I think that's all that matters.",
                                    "score": 416,
                                    "author": "Grand_Theft_Motto",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I wonder if you were to stick a phone in the window before he comes and start recording with the blinds closed behind the phone, would the thing know that it’s been seen?",
                                            "score": 217,
                                            "author": "Hazardwashere",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well judging by Holden's reaction, just knowing is enough to ruin you. I wouldn't even dare to try at that point, even if there was no consequence from the Whistler itself.",
                                                    "score": 308,
                                                    "author": "legendaryhon",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Exactly, the thing only calmed down when Holden promised not to say what he saw...",
                                                            "score": 183,
                                                            "author": "Pseudonym0101",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Which makes me think that you'd be okay recording it. You'd only be in trouble if you see said recording.",
                                                                    "score": 39,
                                                                    "author": "FrostMage198",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yeah, but if you record it and opt not to watch, then the temptation is always going to be there. The curiosity -- always wondering what it looks like and whether or not it would know you looked. It'd probably be safer and wiser to just not do that.",
                                                                            "score": 58,
                                                                            "author": "max7345",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "That's when you blindly upload that shit to youtube, twitch, facebook, and every other possible site where you can share videos.\n\nNuclear option, just make sure not to watch it yourself while trying to upload.",
                                                                                    "score": 79,
                                                                                    "author": "Arsith",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Stick a mirror to the window. I wonder what would happen.",
                                                    "score": 70,
                                                    "author": "cursed_window_man"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It would, most probably.",
                                                    "score": 61,
                                                    "author": "redditor10780"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "No. Terrible idea. It would know. Something like the Whistler would always know. You can't trick something like that.",
                                                    "score": 165,
                                                    "author": "pozzledC",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Holden: YEAH?! BET!",
                                                            "score": 54,
                                                            "author": "TheLastPanther"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "He should record a video then post it online. It would end the whole world.",
                                                    "score": 87,
                                                    "author": "YEUNGMANN",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I don't want to do that, I rather like the world.",
                                                            "score": 161,
                                                            "author": "Grand_Theft_Motto"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Holy shit, that’s a brilliant yet terrifying idea.",
                                                    "score": 54,
                                                    "author": "LulaElizabethe"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Somehow I kind of imagined it as a parade of \"people\" walking down the street but only one of them whistling ahead. Like maybe they are delivering something, a sacrifice maybe, at the end of cul de sac. And on the \"people that are carrying it are looking on all sides. So when someone looks. They immediately scrum towards you.\n\nIt just seems like they don't want people know what they are doing thus the \"I won't tell anyone\"",
                                    "score": 50,
                                    "author": "cosmosidiot",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This probably sounds silly but I wonder about pets? My first thought was my little black cat who is basically nocturnal and loves to be out at that time of night. I'm already worried about him most of the time :/",
                            "score": 136,
                            "author": "Pseudonym0101",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Animals seem to be better at sensing danger compared to us humans. Especially danger of a supernatural kind. Maybe animals instinctively know to hide from the whistler.",
                                    "score": 253,
                                    "author": "Danielle_Haydis",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's very true, I would hope so.",
                                            "score": 50,
                                            "author": "Pseudonym0101"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You really shouldn’t let your cat out at night whether the whistler is around or not - they are wildlife killers. And with a black cat, you don’t know what the darkness &amp; the moon does to them. You never know if it’s them doing the whistling......",
                                    "score": 109,
                                    "author": "now_you_see",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh no...",
                                            "score": 20,
                                            "author": "Pseudonym0101"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The whole time reading it, all I could picture was the reject candy monster from gravity falls. Not sure if that's scary or hilarious 🤷‍♀️",
                    "score": 28,
                    "author": "jeebins"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My heart actually started pounding.",
            "score": 202,
            "author": "Sith_Destroyer_1138"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 417,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That was truly an \"edge of my seat\" story. Thank you for sharing, OP!",
            "score": 839,
            "author": "guardiandoggo",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was one of those stories for me as well. I was terrified but started reading as fast as I could during the part where Holden started opening the shutters. I had to know what was next! (Hopefully that made sense and I’m not the only one who does that. Lol)",
                    "score": 267,
                    "author": "LulaElizabethe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol, &amp; I thought I was the only one who did that! I'll speed up with excitement or slow down when I just wanna drag out something good when I know something bad is about to happen.",
                            "score": 55,
                            "author": "Sicalvslily",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh my goodness, yes exactly! Especially when I’m at the last part of a series I really enjoyed, I take my time cause I don’t want it to end!",
                                    "score": 21,
                                    "author": "LulaElizabethe"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Agree. Somehow, I also felt the danger and panic that the OP is going through!",
                    "score": 35,
                    "author": "ferdiebeer",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "After all, what Lovecraft said \"the greatest fear of man is the unknown\" or something like that...",
            "score": 147,
            "author": "xd_Lolitron",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; The oldest and strongest emotion of mankind is fear, and the oldest and strongest kind of fear is fear of the unknown.",
                    "score": 157,
                    "author": "KBPrinceO",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Goddamn thats some good shit right there",
                            "score": 29,
                            "author": "Phoenixpilot55"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I sincerely hope it’s not Tommy Taffy whistling his way through your neighbourhood.",
            "score": 146,
            "author": "Jenaucyde",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have PTSD from Tommy Taffy. Thanks for brining him to mind.",
                    "score": 86,
                    "author": "dead_PROcrastinator"
                },
                {
                    "level": 1,
                    "comment": "Ughhh now the story is even worse",
                    "score": 45,
                    "author": "itsmickib"
                },
                {
                    "level": 1,
                    "comment": "Who's Tommy Taffy?",
                    "score": 13,
                    "author": "Webb_201",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[Third Parent](https://www.reddit.com/r/nosleep/comments/51bnu3/third_parent/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)",
                            "score": 32,
                            "author": "Jenaucyde",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey, just read this. Fuck you &lt;3",
                                    "score": 29,
                                    "author": "Signal-Resident2379",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "What in the nightmares did I just read. Looks like they might be making a movie about this.",
                                    "score": 11,
                                    "author": "FragRus"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That was the first thing I was thinking about too.",
                    "score": 7,
                    "author": "abcputt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This story gave me the heebie-jeebies because a few years ago, for about two or three weeks, someone would walk outside our house pulling on what sounded like beer cans on a string or maybe a a suitcase with bad wheels. At 4am, on the dot. I could hear it start from my living room window (sometimes I sleep on the couch because it's where the AC can blast me in the face lol) and it would continue past my sister's room, and then past my room... And then a little ways further it would stop. \n\nWhat's interesting about it is that it seemed to start and stop out of nowhere. I imagine if it was someone on their commute to work, I would hear them rolling along before they reached our house (we live on a sort of cul de sac) and then continue on rolling along long after they passed our house, since the bus stop is a good 5 minutes away on foot. But it always seemed to start right outside our living room window and stop just a little farther from my bedroom window. \n\nAnd one day it just stopped. I never did find out who (or maybe *what*) it was because I was too spooked to look out the window to see, lol. Freaky!",
            "score": 118,
            "author": "Erza88",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I feel like looking isn't the extent of the consequences of The Whistler. Maybe Holden told his parents what he saw, that's why they looked grim too.\n\nPerhaps even KNOWING what The Whistler is like can have dire consequences.",
            "score": 112,
            "author": "_the_misfit_01",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree",
                    "score": 18,
                    "author": "Phoenixpilot55"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When you said something about the islands and the whistling, it made me the think of El silbon, which is a myth that is passed around in the Caribbean (though I think it originated in Venezuela) and he is a whistling spirit that can kill people, but after reading your story I can see there is no connection",
            "score": 279,
            "author": "cstaggs411",
            "replies": [
                {
                    "level": 1,
                    "comment": "Holy shit, you’re right! I completely forgot about El Silbon. He carries a bag of bones or something, right?",
                    "score": 88,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep that's the one.",
                            "score": 26,
                            "author": "cstaggs411"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wonder what Holden saw.",
            "score": 92,
            "author": "atsaykilla",
            "replies": [
                {
                    "level": 1,
                    "comment": "The human mind can make some scary shit",
                    "score": 11,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wonder if that 105 year old lady just said \"fuck it\" one night and looked. She probably had the build and health of a 60 year old.",
            "score": 80,
            "author": "thawacct2590"
        },
        {
            "level": 0,
            "comment": "Man I was so scared for your sister. Awesome job saving her! Then I was worried the bad luck would happen to your house because he looked from there. Thank goodness the whistler knew where Holden lived! \n\nAlso, just asking, are there any houses for sale? If so please send info!!",
            "score": 75,
            "author": "Sicalvslily",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You should have told your parents right away what Holden said when he first brought up the whistler.",
            "score": 219,
            "author": "Matobar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly. I wouldn’t even care about being labeled a snitch, as soon as he started talking about having the keys I’d be like “DAAAAAAD”",
                    "score": 365,
                    "author": "East-sea-shellos",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Me too",
                            "score": 54,
                            "author": "Roshdiddles"
                        },
                        {
                            "level": 2,
                            "comment": "Sadly, I think Holden's overwhelming excitement and curiosity towards the Whistler would eventually result in the same ending for him and his family. Just wish OP and his family didn't have to experience that night.",
                            "score": 94,
                            "author": "ButteredBroccoli",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Holden’s a little shit endangering your family like that.  \n\nSeems as though he got his comeuppance 🙂",
            "score": 65,
            "author": "Gall09"
        },
        {
            "level": 0,
            "comment": "Based on the fact that it mimicked your mom's voice, it sounds like it could be the goatman or at least some sort of shapeshifting fleshgait.",
            "score": 70,
            "author": "thekraken108",
            "replies": [
                {
                    "level": 1,
                    "comment": "Holy shit, Holden see himself when he looked..",
                    "score": 41,
                    "author": "garriej",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Since it can mimic human voices that means it’s obviously siren head.",
                    "score": 10,
                    "author": "IndyJacksonTT"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What if the reason why Holden and his parents look so terrible is because the whistler keeps them up at night knocking on the windows and doors?",
            "score": 67,
            "author": "MandarinTea",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm a bit late to the party but this is the conclusion I came up with as well. The whistler is offering punishment/reminder not to talk about it, it seems to use the power that it has over these people when it can: mimicking voices, increasing the knocking if they don't stay close to the window tapping, etc.",
                    "score": 16,
                    "author": "Andrewman03"
                }
            ]
        },
        {
            "level": 0,
            "comment": "IM NOT EVEN KIDDING every night at about 1-1:30am (so morning), some dude walks down my street whistling. Middle of winter? Whistling. About to storm? Whistling. Slushy sidewalks on a cold night? Better believe the whistler is coming by.",
            "score": 56,
            "author": "OriginalKyleBarrer",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Thank you for sharing your tragic story so eloquently. \n\nI wonder if the Whistler's similar to Dorian Gray's painting, taking the neighborhood's bad luck into itself so over millions of years of taking care of the area, has grown so hideous that looking at it, sucks the joy out of life. It whistles to forget its woes but seeing people, makes it realize how ugly it looks, hence why it becomes insane with rage.",
            "score": 134,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is by far the most interesting and tragic theory I've heard so far.",
                    "score": 106,
                    "author": "Grand_Theft_Motto",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This is incredible! Thank you for that analysis!",
                    "score": 22,
                    "author": "raeumauf"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is pretty cool, not gonna lie. Not looking through the window for whoever/whatever is whistling is a small price to pay to get good fortunes, ya know? i could live with that.",
            "score": 35,
            "author": "coldnoods"
        },
        {
            "level": 0,
            "comment": "Ok, now I'm freaked out. I literally just heard something yelling outside my apartment as I was reading this. \n\nI'm hoping it was a fox. Please let it be a fox. \n\nI'm not looking.",
            "score": 35,
            "author": "justanaccount80",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s been an hour. Look now 👀",
                    "score": 16,
                    "author": "Thurstonelambs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's 7am where I am. I should be ok. Not going outside tho.",
                            "score": 11,
                            "author": "justanaccount80",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "OP, has anyone ever recreated the tune of the whistling via piano or recorded it? Would it be dangerous for an outsider to hear it?",
            "score": 37,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't think it's dangerous to hear the sound. I think...it wants to be heard. But only heard.",
                    "score": 94,
                    "author": "Grand_Theft_Motto",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Please don’t take the risk. Don’t ever risk it. Be careful and safe. Goodluck, not that you need it thanks to the kind whistler.",
                            "score": 18,
                            "author": "Bambicorn772"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I kept thinking what if you hummed or played along with it. Maybe that's all it wants",
                    "score": 6,
                    "author": "AviiWasHere"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 264,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 143,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jokes on the whistler because I already won't look out the window at night!",
            "score": 30,
            "author": "roccotheraccoon"
        },
        {
            "level": 0,
            "comment": "I don't know why but I think the whistler is some kind of demon leprechaun.",
            "score": 162,
            "author": "WhiteArabBro",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would strongly advise against theorising what it looks like, even on reddit",
                    "score": 41,
                    "author": "SabreToothSandHopper",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "bruh   \n\n\nb r u h  \ni hear whistling sometimes outside at night but it's not around 3 am , more like between midnight and 1 am  \n\n\n  \n\n\n  \nbut i live next to a graveyard so I'm 100% not going to look out of the window.",
            "score": 29,
            "author": "NerdyNoot",
            "replies": []
        },
        {
            "level": 0,
            "comment": "How very creepy!!!",
            "score": 22,
            "author": "JessHas4Dogs"
        },
        {
            "level": 0,
            "comment": "What freaks me out the most is not being able to talk a 3 am walk around the house",
            "score": 165,
            "author": "spxne76",
            "replies": [
                {
                    "level": 1,
                    "comment": "can you really do that around your neighbourhood? mine is very dangerous. I've never taken a walk past midnight in my entire life, bet it feels good!",
                    "score": 117,
                    "author": "throwzdursun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not OP but it is nice to walk around town late at night. My town is safe though sometimes I sleep all night in a chair in the backyard.",
                            "score": 65,
                            "author": "IQ33",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "that sounds so amazing and peaceful, good for you mate. I hope one day I can move to a neighbourhood as safe as that.",
                                    "score": 56,
                                    "author": "throwzdursun",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It really is. I live in a small town of about 10,000 people so that makes a difference.",
                                            "score": 21,
                                            "author": "IQ33"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I would hate the bugs, or the thought that a bug or animal can approach me while I’m asleep",
                                    "score": 20,
                                    "author": "Eggrollman317",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah I dont do it during the summer because of the bugs. This time of year is perfect for it cause it's been in the 40s at night and the bugs are gone. As for animals it would be scary as heck to wake up with a raccoon or opossum on your chest. But I live in the midwest so it's not like I'm going to be eaten.",
                                            "score": 17,
                                            "author": "IQ33",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "40 at night?? You must have the comforter and extra extra blankets out with you hahaha",
                                                    "score": 10,
                                                    "author": "Eggrollman317",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I have a quilt that my mom and I made when i was in high school that does the trick. I got one of those zero gravity camping chairs that reclines all the way back makes for a comfy sleep. It's not like I sleep out there every night just every now and again when the mood hits me.",
                                                            "score": 13,
                                                            "author": "IQ33"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This was literally terrifying. \n\nI won’t hear whistling the same ever again.",
            "score": 20,
            "author": "Metalfacexxx"
        },
        {
            "level": 0,
            "comment": "It's 3:05am and I just finished reading this, I guess I'm safe tonight.",
            "score": 19,
            "author": "iBanished",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Actually something similar used to happen in my neighbourhood too. But way less terrifying and had quite the farce of an ending.\n\nIt's a long story. I'd tell it if anybody's interested.",
            "score": 21,
            "author": "No1BTSstanAccount",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yee",
                    "score": 8,
                    "author": "bilkywaygalaxy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So, this happened in mid 2017. I was pretty much an insomniac back then. I stayed up reading stories on the phone till 3 or 4 every night. I used keep the lights off because my mum used to sleep in the same room as me. Now, my room is the farthest from the street in front. And beside my window there's a huge pond. So, my room was kinda isolated.\n\nOne night i was up as usual reading when i thought i heard a sound. A drawn out loud voice kind of. It was very mild. Thinking that i was just thinking too much after reading the stories i ignored it. After some time though, the sound started to grow louder. I began to think whether something had jumped in behind my room. Knowing how hard it is to get to my room from the outside i was even more spooked out. The sound seemed like it was a little girl screaming and wailing in a really eerie manner. Slowly though the sound started to grow dimmer until it became absolutely silent. At this point the whole situation hit me. As i tried to make sense of it with the stories that i had read fatigue came upon me and I fell asleep.\n\nThe next night i had completely forgotten about it and was reading stories as usual. I had brushed off the whole thing as a one time occurance. But then it happened. Once again right at 1 o'clock the sound came. This time i felt that my mum was awake too. But none of us said anything to the other. We both laid their like planks holding our breaths in waiting for the soumd to end. Soon the sound grew more silent and our breaths became regular. I broke the silence and asked her whether she knows what's happening. She just told me it's nothing and told me to go to sleep. But i knew she was just saying that to calm me down and inside she was just as frightened as me, if not more. Somehow we fell asleep that night.\n\nEverynight the sound came and went. At the same time. And sometimes at 4 in the morning too. Nobody spoke about this when morning came. With each night the sound was making me more excited. I felt as if it was my little neighbourhood paranormal story. Like in the stories i read. Some nights after the sound had gone i even suggested my mum that she let me peek at the thing making the sound. Each time she just told me to go to sleep.\n\nAfter some more days when the sound had already become a part of our daily curriculum my mum came to my room excited, saying that she has some 𝓷𝓲𝓬𝓮 news. Turns out one of the older kids in our neighborhood had stayed up and peeked at the thing. The thing was a middle aged man wearing completely grey clothes on a cycle with a whistle. That whistle was the cause of all of this silent mental mayhem. It was the new watchman. Nobody had hired this dude. He just appeared one day and started watching over our neighborhood. Once a month he came around to all our houses for money. We gave him some and pleaded him to change his whistle. He didn't. I guess he just likes to fuck with us.\n\nAfter that I had to stay up some nights studying for my exam and I had seen the dude going by the road around the pond. Now, almost 2 years later the sound still happens but now instead of being scared i have found a sense of familiarity. The sound is now a reminder that it's 1 o'clock again. \n\nI hope this helps you sleep again. ☻\n\nThe sound https://drive.google.com/file/d/1r3VNeE2ELynYZIWwnYQznWXX0KYJaauI/view?usp=drivesdk\n\nEdit: the last bit of the recording is empty. He went away but i didn't realise it so...",
                            "score": 41,
                            "author": "No1BTSstanAccount"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would have to look. Like putting my tongue in the place where I bit my cheek or picking a scab. I wouldn’t want to at all but I would just HAVE to do it.",
            "score": 127,
            "author": "ThenComesInternet",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same. I'm nosy and I need to know everything. I'm the kind of person who goes into the woods at night because there are weird sounds coming outta there. Like...I just *have* to know, even if it kills me.",
                    "score": 39,
                    "author": "I_need_to_vent44",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "As I was reading this, there was a knock on my window. I am currently hiding in an interior room with no windows. I plan to stay here for a couple minutes.",
            "score": 20,
            "author": "firstson1125"
        },
        {
            "level": 0,
            "comment": "we’ve had similar things happen where i live it’s really weird",
            "score": 18,
            "author": "its_just_jojo",
            "replies": [
                {
                    "level": 1,
                    "comment": "I only stopped hearing it after we moved to a different state last year.",
                    "score": 13,
                    "author": "WolfofLoki"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is it just me or does this not seem that bad? Two minutes of danger in the middle of the night in exchange for tons of good luck? Yeah I’ll take my chances.",
            "score": 15,
            "author": "Ok-Doctor5866"
        },
        {
            "level": 0,
            "comment": "\"I think Holden’s parents must have looked, either to comfort him if they didn’t believe or share the burden if they did. I watch Nola somedays, happy and young and alive, and I wonder if I’d been slower, if she’d looked out the window that night…would I have looked too? To comfort her? To share that burden? I’m glad I don’t have to find out\"\n\nDamn, this part in particular was so well written it made me cry..\n\nGreat story 💕👍",
            "score": 42,
            "author": "otg85"
        },
        {
            "level": 0,
            "comment": "What town could be so perfect yet so scary at the same time?!",
            "score": 14,
            "author": "RampantBeast",
            "replies": []
        },
        {
            "level": 0,
            "comment": "What if you recorded outside and watched it in the morning",
            "score": 13,
            "author": "cr4cked_scr33n"
        },
        {
            "level": 0,
            "comment": "Just have sleepovers with kids that arent assholes. \n\nI mean, even if he thought your tradition was silly, he stole from your parents, ready to break a house rule and lie about it. Get all yall in trouble.\n\nWho goes to someones house and does that? A little asshole that gets tortured by the whistler.",
            "score": 12,
            "author": "gator_feathers"
        },
        {
            "level": 0,
            "comment": "Is there any history behind this whistling thing?? I really wanna know the backstory if there is!!!",
            "score": 34,
            "author": "blacktrafficlight"
        },
        {
            "level": 0,
            "comment": "Based on the fact that it imitated your mother's voice, I'm guessing when Holden looked out, he most likely saw this thing while it imitated how he physically looked like.",
            "score": 11,
            "author": "rafaelvicuna2"
        },
        {
            "level": 0,
            "comment": "There's this theory mainly related to lucid dreaming that you shouldn't look into a mirror in a lucid dream unless you're ready for it. It supposedly shows all the dark things within you and my theory is that this is exactly what the whistler is. It looks different for everyone, but it's face is the evil and fear deep down within your subconscious",
            "score": 9,
            "author": "tfc_prisma"
        },
        {
            "level": 0,
            "comment": "Imagine being a random driver going inside their neighborhood to make a U-turn at that exact time and seeing that shit lmao",
            "score": 10,
            "author": "spiceyanus"
        },
        {
            "level": 0,
            "comment": "Please be careful. I had a brush with a whistler 20 years ago. Took me 15 years to shake it off.    \n\n\nPlease be safe.",
            "score": 31,
            "author": "lemonmelonlemonmelon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tell",
                    "score": 13,
                    "author": "Innsmouth_Resident",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It kept luring me outside. I don't really know why it would do that. I stopped following it when I found the bodies of my cats, hollowed out and decayed. I stopped after that. Literally haven't left the house unless I need to.",
                            "score": 17,
                            "author": "lemonmelonlemonmelon"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 22,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 16,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Okay, I don't care who is whistling....\n\nI want to know how they figured this out. How did the first people know not to look? \n\nWas there trial and error? Was there a blind guy that was really lucky while everyone else had bad luck?",
            "score": 9,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 16,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "WHAT WAS IT",
            "score": 9,
            "author": "MessyBarresi",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 36,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Thanks, i won't be sleeping tonight",
            "score": 21,
            "author": "Nara_Rise",
            "replies": [
                {
                    "level": 1,
                    "comment": "Eh, just don't look outside 👍",
                    "score": 24,
                    "author": "averysneakysnek"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Holy shit. I haven't been this glued to my screen for a while.\n\nIt's time to move out, the law of averages alone says that some day you're going to get a glimpse. Even if it's just through a crack around the blinds.\n\nCount your blessings and go!",
            "score": 6,
            "author": "Revolvyerom"
        },
        {
            "level": 0,
            "comment": "This was a good scare, I haven't had one in a while. Thank you!",
            "score": 8,
            "author": "arya_ur_on_stage"
        },
        {
            "level": 0,
            "comment": "This was absolutely brilliant. And good job saving your sister too, OP!",
            "score": 7,
            "author": "howlybird"
        },
        {
            "level": 0,
            "comment": "Wow. That felt like watching a Japanese horror movie.",
            "score": 7,
            "author": "VeryGoodNiceMan"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 13,
            "author": "[deleted]",
            "replies": []
        }
    ]
}