{
    "id": "xyx284",
    "score": 13536,
    "title": "I’ve been squatting in a condemned high rise. These are the rules I follow to stay safe.",
    "author": "ChristianWallis",
    "date": 1665246702.0,
    "url": "https://www.reddit.com/r/nosleep/comments/xyx284",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m not homeless.\n\nI have a home. I just don’t own it. But it’s mine and I work to keep it. Every city has its fair share of abandoned buildings to squat in, but usually you gotta deal with either cops or shitty neighbours. The Annedale High Rise has neither. Police stay away, so do the locals. As a stranger from out of town I stumbled across the place on my first night in the city and thought it a little strange that a 28 story tower block had been left to rot. Every window black. Every light in the courtyard smashed. No cars in the lot. No booth for a guard. Not even barbed wire on the fence. Barely half-a-mile from a playground filled with shouting drunken teenagers but none of them strayed in the direction of Annedale. No fires or music or bottles hurtling through the air. It was silent.\n\nInside, I found that the lobby had been torn to shit. Double doors ripped open and left that way for what looked like years. Easy access for the curious, but I was the only one there. Most of the first story had collapsed. Waterlogged ceiling tiles turned to mulch by shitty British weather. I know water is invasive, but it had practically fucking colonised the place so bad algae was growing up the walls. Even the elevator shaft was flooded. My own reflection looking back at me as I peered through brackish water and caught a glimpse of the old rusted carriage just a few feet below. I couldn’t help but think about standing on top of it, waist high, and reaching down to pull open the emergency hatch. Only natural to wonder what was down there. Little metal box soaking in pitch black water for years and years. I thought about pressing the button, calling it up and seeing the elevator rise in spite of all logic. An image I still think of from time to time.\n\nMeanwhile the empty shaft loomed above, cables whistling in the wind. I’ve learned not to linger by it. If you look up you’ll sometimes see something ducking out of the way, pulling its head through the doors before you get a good look. It finds it awfully funny, even tries to make a game out of it, like peekaboo. Play too much though and it starts to pop up elsewhere. Any open door becomes an invitation. Sent more than a few people running for their lives in the middle of the night, but bad news for them. That thing is more than free to leave this place if it’s part of a game.\n\nIf you ask about Annedale most people just shrug or laugh. Kids’ll talk about it same way they talk about any haunted house. Difference is no one dares anyone to go up there. No one uses it to get pissed or high. No one sneaks into the basement to have a risky little fuck. No one hides their stashes there. It has all the hallmarks of your classic urban legend, only people *actually* stay away. They’ll laugh and joke and tell scary stories, but they treat the soil its on like it houses a radioactive leak. And the council, I’m surprised they haven’t knocked it down but they, out of everyone in the city, have the most to lose by talking about it.\n\nThey built it in the mid fifties as government housing. Only a lot of the young mothers who moved in there found their children’s health taking a turn for the worse. Started with newborns. Babies that wouldn’t wake after a peaceful night’s sleep. The kinda deaths that got written off as either negligence or abuse, screaming teenage girls hauled off to prison on the words of doctors who didn’t give a shit. It’s always the mother’s fault in some people’s eyes, and these girls had no one to stand up for them. Two in the first year, four in the next, and they kept on coming for every year until it closed.\n\nWasn’t until 1982 that someone traced the source of deaths to tainted water storage on the roof. Toxic metals leeching into the supply. Not enough to kill an adult, but bad news for anyone with weak immune systems. Thirty eight women had been imprisoned by then. Another twenty three had killed themselves before they could be sentenced. And those are just the ones accounted for. Not all the deaths were from the water. Annedale has a way of being bad for any child’s health, no matter the circumstance.\n\nMore than a few toddlers starved to death as their parents rotted in the tub from an overdose. Even more were lost when they found their parent’s stash, little bodies wracked with agonising fits as their panicked mothers screamed for help. One tripped down the elevator shaft because the doors opened as if the carriage was right there. And those are the ones who were found. Plenty more went missing, written off as runaways. In the end Annedale’s reputation as a cursed place got so bad the only way out was to shut the whole thing down. Board it up. Erase it from the records. Pretend it never happened and just forget.\n\nBut Annedale kept on killing even after the doors were officially shut. If anything it only got nastier. Talked to one cop who told me he found a guy dead from sepsis on the sixth floor couple years after the place was shut down. No one could fucking believe it. They reckon this guy scratched himself on a nail and caught gangrene like it was the 1800s. Never went to the hospital. Just laid there and died slowly and painfully as the infection spread, but not before he took every last bit of furniture in the room and shoved it against the door. Strange enough on its own, but it was the flag he’d made out of his own clothes that freaked everyone out. He’d scrawled *HELP* on it, like he wanted to get someone’s attention down below even though the lock was on his side. He could’ve left anytime he wanted.\n\nCop I spoke to said he was there when they kicked the door down. Still remembers the look in dead man’s eyes. He was glaring at the door two days after he’d passed, white knuckled fists gripping a blanket that smelled sickly sweet from all that infection.\n\nThere were others too. Lots of people falling, many of them without a good reason. Got so bad they bricked the roof door but by the time I arrived someone had cleared it all away with a sledge hammer. I still don’t hang out up there. Not after I first went up and saw pale fingers gripping the ledge, like someone was hanging off it and holding on for dear life. I reckon a lotta people see something like that and think a person needs their help. They go rushing over to offer a hand. But when I saw it something about those grimy nails set alarm bells off in my head. Fingers looked all wrong. So I took my coat off and used a broom handle to move it closer to the ledge. Sure enough those ugly hands snatched at the coat and ripped it outta my hands, sending it hurtling to the parking lot below. I’ve thought about taking a closer look from time to time, but I got a thing about heights and could never bring myself to investigate it much further.\n\nYou’d think I’d leave, but it’s my home. I own it as much as it owns me. People even refer to me as the caretaker now like they forgot I wasn’t always here. Police treat me the same, can you believe that? Any reports of a break in and they call me on my number to go take a look, like I’m some sort of official. Only other guy who was here as long as me was the philosopher. I don’t know his name, just call him that because of the books he left behind. He came here back when the block was still just a place to live and he stuck around for a few years after its closure. Lots of notebooks in his flat. Thousands of pages talking about child sacrifice made to gods who don’t like being named, along with pictures of strange things frozen in ice and medical photos that look fake.\n\nAt first I thought he came to document the curse. He has dozens of books just recording all the strange things he saw, like birds with too many wings or milk that turned to clotted blood in the bottle. But after going through every thing he owned I found letters to a wife who’d died in childbirth. He kept her death certificate way at the back of an old looking box filled with the letters he’d kept writing her long after the date.\n\nAnother box, just a row over, had the letters she’d written back. Awful things scrawled on random scraps, shit and blood for ink. He dated them himself and sometimes wrote notes about how they came to him.\n\n*Delivered by a rat that was cannibalised in front of me.*\n\n*Pulled by my dentist from a cavity in my mouth.*\n\n*Written in the web of a spider with thirteen legs.*\n\nAnyway, he gives away the real reason he moved to Annedale in one of the letters. Says that Annedale was the key to helping her, that he was weeks away from figuring out how to open the door. Told his wife he’d bring her back. Told her he knew how. I’ve never figured out where he went next or what happened to him, but his apartment was locked when I found it and likely would’ve stayed that way if the key hadn’t turned up in my inside pocket on the first morning. Now I live in his old place. It’s safe in there. He’s written things on the wall that keep everything well behaved. Symbols that I don’t understand but which are easy to trace so that’s what I do. I go over them every couple of months and so far they’ve kept me safe and sane.\n\nBecause you do need protection in Annedale. I don’t know when in its history the curse went from something mundane to something very real and very dark. It wasn’t all just bad luck or poverty, not by the end and certainly not anymore. You can’t just go strolling around Annedale, certainly not at night. It’s dangerous. For one thing, it attracts a constant rotation of the deeply unwell who are likely to attack on sight, if you’re luckly. They usually turn up dead in the halls come morning, although sometimes it’s just bits of them that I come across. Strips of skin floating on the brackish water that floods the basement stairwell, or bloodied fingernails embedded in the ceiling plaster. Weirdest one was a single tooth in a lightbulb, bloody gum still attached to the root, the glass all around it somehow intact.\n\nMany of them come here with business, something a little like the philosopher’s. Rituals. Bargains. Things like that. It’s not a good idea to interrupt them, or to give them even the slightest hint you might be a problem. Every night I lock my door and wait for Annedale’s business to finish and come morning I do a sweep, floor by floor, and clean up whatever’s left of the tower block’s strange pilgrims.\n\nMost of the rituals don’t look real to me. In fact, I reckon a lotta people who come here just end up as victims of something or someone else. There are a *lot* of reasons to stay out of Annedale at night, and most of its visitors strike me as a little naïve. Most of what I see looks like it got stolen from a bad death metal album. I once found a book called “Satanism and Witchcraft in the 21st Century”. It’s hard to imagine that the secret inner workings of the universe can be found in something with an ISBN number and 3000 Amazon reviews. Of course, not all attempts at exploiting Annedale’s energy are so hackneyed. I had one guy turn up at my door and pay me three grand in cash just to show him the darkest corner in the building. I wasn’t sure what he meant at first. Thought he meant light and shadow.\n\n“Sort of,” he replied when I explained this to him. “Darkness like that can be part of it. But I’m looking for a corner, has to be a right angle or more acute. Ideally, more acute. You understand that term right?”\n\nHe’d seemed arrogant and that last sentence confirmed as much. Good looking guy in his late twenties, nice suit. Looked like the stereotypical banker. Acted like one too.\n\n“Plenty of places like that,” I said. “Lots of funny rooms in Annedale. People trying to make the most of limited space. Sometimes the walls meet at tight angles, sure. But I don’t know what you mean about dark. There’s the basement. It’s flooded. Can’t think of anywhere darker than that.”\n\nHe bit his lip and hesitated for a second or two, as if he was actually contemplating it.\n\n“Not a bad suggestion actually, but no, too difficult to reach. And I don’t just mean dark as in the absence of light. I mean dark like under the bed. Dark like that one chip in a wall that leads to a hollow space between the bricks and as a child you can’t help but wonder what lives there. Somewhere that just inexplicably feels… like it’s not got as much of God’s attention on it as everywhere else.”\n\nI thought about this for a second. His words were vague but damn if I didn’t know what he meant.\n\n“A corner?” I asked. “Has to be an acute corner?”\n\nHe nodded.\n\n“I think I know the place,” I said and he smiled like real creep.\n\nI took him to a flat on the eighth floor. It was rundown like everywhere else but there was still enough of its old furniture lying around. You can pull open random drawers in there and still see the cutlery people once used. There’s even an old analogue TV on an old stand. You can perch on what’s left of the sofa and stare at that TV and get the feeling you knew the people who lived there once. Run your thumb over the dials on the toaster, the handle of the fridge, or the yellowing plastic of a light switch, and feel an aching loss that creeps up on you out of nowhere.\n\nLook up and you’ll see that the light fixture has been torn out of the ceiling, like someone had tried swinging from it.\n\nNot a big place, by the way. Three rooms. A bedroom with a double bed all rumpled up. A living room slash kitchen. And a tiny little spare room that looked like it once would have been used for storage, or a washing machine maybe, *if* you were single and childless. A slither of space, a triangle carved out of whatever room was left over when other more important walls had been put up. That sofa I mentioned, the TV, they were all placed so whoever was sat down could always keep an eye on that room and its contents.\n\nYou see they’d put a cot inside and it’s still there, bluebottle flies circling overhead. You can’t see inside the cot, not unless you went in and actually pulled the blankets out but it’s been decades and no one has managed it yet. It’s dark behind those old blankets, a heavy shadow that dissuades a closer look, like there’s something in there no one needs to see and it’s spent a long time sat there eating what little light there was. Even with a window in that room, daylight doesn’t really filter down.\n\n“Perfect,” the businessman said when he saw it. He gazed around the flat one detail at a time, his head pausing for a moment and a smile creeping across his face as he laid his eyes on the broken light fixture. And the cot, the sight of it, the flies that still circled above faded Winnie the Pooh blankets, it made the breath catch in his throat.\n\n“Oh this is… *yes* this is good,” he told me. “Dark like under the bed. You’ve earned that money. I could have had a dozen men sweep this place and they wouldn’t have understood the brief as well as you have.”\n\n“Thank you,” I replied even if that wasn’t really how I felt.\n\nQuietly the man sat down and began to unpack his leather satchel. No pentagrams to be found, although he did unpack seven strange looking candles. He caught me looking at them and smiled.\n\n“Home made,” he said. “Each one shaped by my hands. I’m not a good artist, but it’s the effort that counts. Took forever to rend the wax. Of course that was the easy part. The hard part was getting the fat to make it. Did you know there can be a surprisingly high level of security around a hospital’s medical waste department?”\n\n“I didn’t,” I replied as he took out some flimsy bits of wood and a few small nails. He oh so carefully began to nail the splinters of wood together into what looked like random shapes.\n\n“Oh well,” he sighed after a few quiet moments, his fingers nimbly gripping the tiny hammer as he tapped away. Already he’d put together at least six of the strange little wooden polygons, and with each new one I felt a strange sensation. “Would you like to stay and watch?” he asked.\n\n“Absolutely not,” I answered.\n\nHe stopped tapping and smiled once more.\n\n“Oh you’re clever,” he said. “That’s the correct answer, by the way. And if I’m to respect it, I should inform you that now is the safest time to leave.”\n\nI made my way to the exit just as he lit the first candles, but not before I looked towards the cot one last time. I was surprised to see a hollow blackness that extended beyond the doorway, like a curtain had been draped across it, only there was depth to it that drew the eye. The businessman paid it no attention, but after a few more seconds he eventually looked up at me expectantly.\n\n“Can I ask what is it you want?” I said. “Everyone who comes here, I don’t get the sense it ever works out for them.”\n\n“I’m looking for a new kind of afterlife,” he replied.\n\n“Do you need one?”\n\n“We all need one,” he said with a wry chuckle. “But only those of us willing to take a few risks will get a better deal. Everyone else…” He grimaced. “It’s worth the bother. But look who I’m speaking to.”\n\nHe looked to the darkness that enveloped the doorway. Shapes could be seen floating past.\n\n“You should leave now,” he said.\n\nI pulled the door shut and, noticing that the sun was rapidly setting, ran to my apartment where I knew the walls would keep me safe.\n\nWhen I returned the next day the man’s satchel was still where I’d last seen it, propped against one arm of the sofa. The candles had burned down to the very end of the wicks and left a lingering smell that’s still there all these years later. And of the man himself, well in the room with the cot—which still has bluebottle flies orbiting overhead—there is now a shadow burned into the wall. It’s blurry and diffused, but vaguely recognisable as a man on his knees, his head pressed to the floor in a gesture of supplication.\n\nI’ve known it to occasionally move, to turn its head and look towards me at which my point my temples throb, my ears pop, and a darkness begins to encroach upon the edges of my vision. I never exactly considered that flat to be Disneyland before, but now I avoid it like the plague.\n\nStill, it could be worse. Not every ritual ends so cleanly and at times I’ve had to personally intervene, something I hate bitterly. If people want to go poking around in the universe’s undercarriage that’s their business. It’s one thing if I’ve got to sweep what’s left of them up afterwards but at least that’s a one and done job. Sometimes it isn’t so clean. One guy turned up and told me he’d be a new “resident”, my neighbour, and we’d get to know each other. A bumbling old man with an upper class accent and the look of a professor who was down on his luck. He set up in the room next to mine and no matter how little I spoke to him, he never really got the hint and kept trying to act like a good friend. Few times I did initiate conversation it was to tell him the place he’d chosen didn’t have much in the way of protection. He pointed to some funny little rashes and told me *they* were his protection.\n\nOver the next few weeks I’d bump into him from time to time, always on his hands and knees, scraping some dank corner or mouldy pile of bumpy growths. He collected fungi, told me on the first day, and I’d often see him wiping his samples onto petri dishes that he whispered quiet words to whenever he thought I wasn’t around. I don’t think he was sane, but he probably wasn’t completely barmy because he lived long enough to get a sense of Annedale and only come out in the day. Meanwhile his apartment filled up with a growing collection of chittering terrariums and pickle jars, their specimens hidden by murky fluids. All over, he planted and cultivated strange mushrooms and moulds. Encouraged them to soak up the darkness of Annedale and set them to grow in the rife conditions he’d cultivated.\n\nTowards the end his living room had mushrooms growing out the walls. Plaster crumbling beneath microbial armies until there was only concrete and rebar, and even then mould continued to grow and thrive. A few times I peered in and found him feeding meat to the frilly growths that exploded out of the old furniture. During this time the symbols on our shared wall would often grow hot, and I found myself having to replace them on a nearly daily basis as he tinkered away on the other side. I asked him once or twice to tone it down.\n\n“This is important work,” he growled, an unseen darkness creeping into his voice. “I’m not some ditzy crackhead trying to summon the Baphomet! I’m not looking to get *high*. This is science. Progress! That is what I am working towards.”\n\n“Yeah well your progress is trying to eat its way into my flat. Can you ask it to stop?”\n\nHe stopped, froze in mid gesture like I’d said something either profoundly stupid or insightful, or likely a bit of both. He looked at the rashes on his arms that had, by now, started to sprout some of their own strange fruit. When he finally spoke again it was sly, like a lecherous old man propositioning a nurse.\n\n“This fungi,” he said. “They had samples of it in the university for thirty years! Can you imagine? They never even realised what they had until I found it and unlocked its potential. Now I’ve finally found the source and I can do things no one else thought possible. This entire time my thesis has depended upon the idea that the fungus has… a capacity for information processing way beyond anything we’ve considered before. And your idea is a good one, you know? Asking it just might be an option…”\n\nHe scuttled off without another word and for the next few days he set about the building like a furious little honey bee in Spring. Poking and prodding, setting trap after trap and cleaning them vigorously of any rats or mice he caught. When I did my morning sweeps I’d find him hovering over Annedale’s latest victims, scraping what was left of them into transparent bags for his own purposes.\n\n“Don’t mind me,” he’d mutter. “It’s worthless to you, but these poor souls could help me achieve great things.”\n\nThis persisted for another month. He no longer scraped mould or mushrooms off old apartments. He became interested only in meat, and by the time it came to an end I can say confidently that I have never smelled anything worse than the prickly musty odour that wafter out from under his locked door. It became so bad that I began to wonder if I might have to ask for police help and have him removed when, finally, he simply disappeared from Annedale’s halls. One morning he was there, annoyingly shooing me out of the way as he lowered jars into the flooded basement, and then the next he was gone and Annedale’s halls were silent once more.\n\nBut that didn’t mean he had moved out. Far from it, actually.\n\nIt took two days before I decided to just go ahead and break his door down. I kicked at it with a short sharp blow only to find my leg immediately disappeared through wood that had the texture of sodden cardboard. I freed my foot and tried a different tactic, grabbing the handle and pulling so hard that it simply *popped* right out of the rancid wooden frame. Free to move, the door swung open with an eerie creak and fetid air, hot and damp, blew out of the room.\n\nInside I found that the man’s specimens had gone wild. Terrariums had shattered, their contents spilling outwards. Frogs as large as footballs glared at me from behind furry fronds, and insects with human eyes scuttled away before the amphibians could snatch them up. In one corner rats had built a hive out of old cardboard, their backs covered with fungal growths that resembled human fingers and other appendages. In another corner something that looked a little like a black rubber sheet slapped furiously at passing vermin and it took me a few seconds to realise it was a slime mould. When it finally caught something it dragged the strange creature squealing into the dark corner where it grew and constricted around its meal like a fist. I stared at it horrified until one by one black orbs unveiled itself from within the strange mass and I realised it had eyes to stare right back at me.\n\nIt was a cacophony of God awful terror, so gripping that it kept me from hearing the muffled noise of a human struggling to speak. Eventually it did reach my ears and I used my torch to light up the far wall without having to actually step inside.\n\nI found the scientist half-grown into the wall. Algae and moss coated him head-to-toe so that he was no longer recognisable, but I had to assume it could be no one else. Wide eyes glared at me with terror and pain as nasty little critters nibbled away at what was left of his shins, meanwhile strange tendrils probed at his ears and head, never resting for a moment. He kept trying to speak, but the algal growths kept driving their way into his mouth until, one-by-one, they pushed too far and something snapped. His eyes went wider still, his squeals became hysterical, and his jaw slowly slid further down his chest until it hit the floor with a sodden thump.\n\n“Finally made contact?” I asked. “An awful idea if I’ve heard one. What would a mushroom have to say even in the best of circumstances? Let alone one that was grown in the ruins of Annedale? I can only assume you never got around to telling it to stay off my wall, did you? No you probably had your own reason or doing all of this and that’s what took priority.”\n\nThat made me wonder what it was he’d asked for. As the thought entered my head I took a quick look around and tried to see if anything particular stood out to me. Something was growing on the sofa that looked strangely human-shaped. It might have been just my imagination, but in the dark it seemed to turn towards me. Meanwhile the scientist continued to shiver in agony, his eyes focused on me and begging for help.\n\n“I’ll see what I can do,” I said before slamming the door. Something about that strange pile on the sofa had deeply unsettled me.\n\nI put the word out, asked for a gun, but got a crossbow instead a few days later. A nervous looking sixteen year old boy ferried it to my door. I was surprised he’d entered the building, but who knows who’d ordered him to do so. I’ve acquired a strange sort of respect amongst the locals and it comes in handy. This boy looked like he would have stamped on my head and robbed me blind any other day, but when he spoke to me he did so with more respect than I ever imagined I deserved. I thanked him, took the crossbow, spent an afternoon practicing with it, and then used it to kill the scientist the next morning.\n\nTook a few hits, but in the end one thumped into his forehead and shut down his whimpered moans. I didn’t see anything on the sofa this time, at least not anything human-shaped, which I was thankful for. After that it was a simple case of calling the police and beginning a long chain of events that ended with half-a-dozen men in hazmat suits spraying the room with noxious chemicals. For a while there I’d been worried that they’d find a corpse and ask questions, but by the time anyone actually entered the room there was nothing left of the scientist save a splotch on the floor.\n\nI never did figure out exactly what it was he was after, although it is not uncommon for my morning sweep to turn up a body (or part of) covered in fungal growths. And I have been known to occasionally catch glimpses of a strange person lowering themselves into the floodwater of the elevator shaft. Of course I might just be making connections that aren’t really there. All sorts of things live in that water. The entire level is flooded and if something was down there, it’d have free reign over quite a large space.\n\nIt's a strange world down there. I should know on account of one visitor who gave me a very bad time. I’ll call him the fisherman since he came to Annedale because of the flooded basement. Saw a photo that’s been circulating around for a while now, if you know where to look. God knows who took it and how, but it shows the flooded stairwell leading to the basement and beneath the brackish surface is a hand that’s all out of proportion. Fingers splayed with perfect symmetry like a starfish, it is reaching up out of the depths and resting gently on the third step below the water.\n\nWhen I first met him he was sitting happily with his feet over the edge of the flooded shaft, water up to his knees, with a rod and line set up beside him. It was quite a surprise at first, seeing him there with a little fly-fishing hat. A chubby but healthy looking man in his forties with an egg mayo sandwich in one hand and a phone playing candy crush in the other. I called out to him as I approached because, in my experience, startling someone in Annedale is bad for your health no matter how sane the visitor appears.\n\nHe looked up when I caught his attention and smiled amiably.\n\n“Hello,” he waved with his sandwich. “You’re the caretaker?”\n\n“Yes I am,” I answered. “And you are?”\n\n“Just a tourist,” he smiled. “Care to join me?”\n\nThe sun had risen only moments ago.\n\n“You weren’t here when it was dark, were you?” I asked more than a little suspicious.\n\n“Oh no you’ve only just caught me, been here barely ten minutes before you showed up. I was told you’d be willing to help in exchange for a small fee.”\n\n“What sort of help?” I asked.\n\n“Oh just give me a nudge if any of the lines start moving,” he said while pointing to a rod he’d set up beside the basement stairs. The door was propped open and the line led down into the darkness below, water gently lapping just out of sight. Another line had been set up in a corner of the lobby where the floor had been torn away revealing a hole straight down into the basement. “I can’t keep an eye on them all at once, you see. I have bells ready but, well, two heads are better than one.”\n\n“What is it exactly you’re hoping to catch down there?” I asked.\n\n“Are you familiar with the primordial ocean?” he said. “The abyssal waters that God split into light and dark, all that? It’s not a physical location, per se, but it does connect to certain bodies of water depending on the time and place. Last recorded manifestation was in a glass of old whiskey underneath a forgotten bar in Mexico City. Some poor fellow knocked it over and didn’t notice until the following day when half the bar was suddenly underwater. Quickly rectified but some of the things swimming in that water were something else, and all from at the bottom of a glass no wider than my wrist. Imagine what we can do with this!?” he said while gesturing at water by his feet.\n\n“You think there could be fish alive down there?” I asked.\n\n“At least,” he replied. “I’d be willing to pay for any reliable information, of course. Do you have any idea what might be down there?”\n\n“Not really,” I shrugged. “But I’d guess it wants to be left alone.”\n\n“Hmmm you might be right there,” he said while looking at his other rods. “I didn’t exactly put down any old lure, you know?”\n\nHe reached into his pocket and took out a strange tuft of fur and ivory, holding it up for me to squint at.\n\n“A tooth from a man who drowned in the sea. A drone collected it off a shipwreck near the Norwegian coast. The fur is actually red algae that was found growing on his bones. I have plenty of these and, well, other things that might appeal to what’s on the other side. My research was thorough and expensive. Come on, take a seat. Flat fee, one thousand, just sit here until the sun starts to set.”\n\n“I just have to sit?” I asked.\n\n“And let me know if you hear or see anything.”\n\nI groaned and sat beside him, folding my legs instead of letting them dangle in the water below. Despite my reticence, we stayed like that for several hours. He’d brought lots of food, good homemade stuff, along with plenty of cold beer. We sat there and spoke very little, but we did eat and drink a tremendous amount. Not the kind of thing I do normally, but I was being paid to be there, and I didn’t really have anywhere else to be. It was, all in told, a very pleasant afternoon.\n\nUntil I fell asleep.\n\nWhen I awoke it was with a terrible gasp. My chest was tight like something had been sitting on it, and judging from the terrible giggling and scampering feet I heard running off into the darkness, it might not have been *just* a feeling. Already panic was setting in as my eyes darted to the open doors and saw that the moon was out and had been for hours. I fumbled for my torch and turning it on saw that there was no sign of the fisherman. All his stuff had been left behind yet all that remained of him was his hat that still floated on the water. Even as I watched, a smooth glistening shape curled beneath the water and plucked it off the surface.\n\nI recoiled and crawled away from it as fast as I could. This was bad, I knew deep in my heart I’d never been as at risk I was in that moment. The open doors that led outside were tempting, but just beside them were the stairs that led downwards and I swore I could hear something approaching. I couldn’t help but picture the fungal man I’d seen in the scientist’s flat. Then again, that basement was huge and who knows what lay down there.\n\nI decided to go for the stairs. The entire time my heart was in my chest. I had never been caught outside my room at night, not since my first night when I’d slept in the lobby with my coat pulled over me. You don’t get lucky twice, not with Annedale, so I knew had to be careful. I had to be quiet. My only hope was to go unnoticed. I took to stealth, climbing each floor in perfect silence, hiding in well known spots at the slightest hint of footsteps, human or otherwise.\n\nAnnedale comes alive at night. Whispered mutterings from strange children who descend from air vents, living there for God knows how long. Other times I saw apparitions including one, a toddler, the sight of whom made my stomach growl with an insatiable hunger that hurt just to contemplate. She stared at me with pleading eyes as I slunk away from her open door. I might have been tempted to help her were it not for the sight of the moon peering through her translucent image.\n\nAnd yet, despite all this, I somehow made it to the fourteenth floor alive. Only it was there right at the final hurdle, so close to safety, that I came across something out of my worst nightmare.\n\nA woman stood outside my apartment door. Silent. Pale. Dirt covered fingernails. It was all too often I’d open my door and find muddy impressions on the floor made by a woman’s bare feet. Now I knew who left them every night. I couldn’t see her face from where I hid, but something about her seemed profoundly familiar.\n\nWhen she finally turned towards me I remembered. I recognised her, even though most of her face was missing. It was the philosopher’s wife. He had succeeded, it seemed. But I couldn’t imagine at what God awful price, because the woman who stared at me had clearly weathered some years in the grave. It was only the poor lighting and her long hair that had covered up just how bad a state she was in. A lipless grin stared back at me below sunken cheekbones and hollow eye sockets. And yet, I could tell that in another life she had been beautiful which only made the sight all the more gut-wrenching.\n\n“My darling,” she whispered, and there was something about her voice that I found hard to stay sane in the face of. I don’t know why. Over a decade in that place and I’d borne witness to living nightmares, but it was *this* walking corpse that pushed me to my limits. The inescapable feeling of loss weighed me down and without realising it I found myself taking steps towards her even as my knees buckled. By the time I reached her I was crawling until I could clutch her grimy icy leg, and that was the last thing I remember before I woke up in my bed the following morning.\n\nEverything seemed normal, so completely mundane that I could’ve written the whole thing off as a bad nightmare. But there were footprints leading from my bed to the door. And later on I found the fisherman’s things much as he left them, although when I finally reeled his lines in I found the lures gone and replaced with bits and pieces of the man who’d first set them up. I threw it all into the water below and decided it would be best to forget him.\n\nEvery now and again, of course, I can’t help but check my peephole at night. I never did before that, but now I do. I see her every single time. She looks sad. Hurts me to think of her out there. It ought to be terrifying but it’s more like someone’s ripped out my stomach and heart and let all my insides fall out the bottom.\n\nEach time I see her I wonder what exactly was it he did to bring her back?\n\nHe leaves only one hint. A final letter, I think. It’s not like he dated them. In it he says he would give everything to have her in his arms once more. Not only his life, but everything he’s already lived. Every sunset. Every good dream. Every nightmare. Every victory. Every loss. Every little memory that makes him who he is, he’d give it all just to save her.\n\nSometimes I wonder about him, figuring we’d probably be about the same age. I’d like to think back and imagine what it would have been like for the two of us to meet as young men, but for some reason whenever I try to remember what my life was like before I came to this city, before I woke up with that coat pulled over me… well, I don’t know…\n\nIt’s just hard, that’s all.\n\nIt's almost like there's nothing there. Like something reached in and took all the years away. I guess it's just one of those things I'm better off not dwelling on.",
    "comments": [
        {
            "level": 0,
            "comment": "I hope you don’t think me an annoying tourist of the Annedale but I’m very curious about your life there as it’s caretaker and would like to hear more about it.  Hoping you write more.",
            "score": 1348,
            "author": "Justsayit_Goos_Fraba",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seconded. I want to know more about this place and how you interact with it.",
                    "score": 296,
                    "author": "Gitdupapsootlass",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 24,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You mean… philosopher?",
                    "score": 87,
                    "author": "Rhinoaf"
                },
                {
                    "level": 1,
                    "comment": "Me too!",
                    "score": 19,
                    "author": "finalina78"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This recounting of your experiences is truly one of the best I've read on Reddit; and despite the light (if a bit macabre) tone of the rest, it's heartbreaking at the end.\n \n\"Golly gee I wonder\" who that woman outside your door could be, but I have a suggestion that may help you both sleep better - Set a low wooden table (like a telephone stand) outside your door, and every evening leave a glass of beer and a plate of fresh fruit or bread on it.\n\nI have a curious sense that will help her (and as a result you) feel ever so slightly less sad.  And I'd be willing to bet that table is never so much as scuffed in the night, though the food and drink will always be gone in the morning.",
            "score": 962,
            "author": "ribnag",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fantastic! And then come back to us with an update.",
                    "score": 106,
                    "author": "gussiejo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "OMG! \"Every little memory that makes him who he is, he'd give it all just to save her.\" My mind is blown. Bravo!",
            "score": 701,
            "author": "sip615",
            "replies": [
                {
                    "level": 1,
                    "comment": "My heart sank when I read that! How incredibly sad!",
                    "score": 64,
                    "author": "alexandriaofwar"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is the single best piece of writing I’ve seen on Reddit. You may not remember your life before, but you can certainly remember how to write beautifully.",
            "score": 1030,
            "author": "kasakavii",
            "replies": [
                {
                    "level": 1,
                    "comment": "Completely agree. I was a mentor for the writer's guild (screenwriting) where I'd offer help to aspiring writers. I think this is the best piece of unpublished work that I've ever read. It's like William S Burroughs set in the world of I Am Legend. Really great stuff. Bravo.",
                    "score": 299,
                    "author": "Dominate_on_three",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It reminded me of “How to Survive Camping”, I loved that one.",
                            "score": 63,
                            "author": "samjam8088",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh my gosh I wish I could go back in time and rediscover that series.",
                                    "score": 14,
                                    "author": "dead_PROcrastinator"
                                },
                                {
                                    "level": 3,
                                    "comment": "I just found this last week and read it all in two days. I can’t stop thinking about it because it was so captivating.",
                                    "score": 2,
                                    "author": "Forsaken_Article_295"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’d tell you to move out but… well you know what would happen.",
            "score": 944,
            "author": "Infamous2005",
            "replies": [
                {
                    "level": 1,
                    "comment": "What would happen?",
                    "score": 98,
                    "author": "LCDRformat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd love to know as well",
                            "score": 65,
                            "author": "Destroyerbot20",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He'd forget and the cycle would probably repeat over again.",
                                    "score": 243,
                                    "author": "Aquamarine_ze_dragon"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Was the philosopher a very good writer? Because all of his writings must have rubbed off on you! This was incredible read. Great structure and pacing and with a perfect set-up and payoff.\n\nPlease stay safe so you can continue to keep us posted on your eerie encounters!",
            "score": 578,
            "author": "Cinderstock",
            "replies": [
                {
                    "level": 1,
                    "comment": "I uhhh, I think he's the philosopher and the caretaker",
                    "score": 201,
                    "author": "jbouser_99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, was just trying to be a bit subtle.",
                            "score": 286,
                            "author": "Cinderstock",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I realized that when I went to -2 votes. Sorry about that mate! Twas I that couldn't see over the ledge.",
                                    "score": 141,
                                    "author": "jbouser_99"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Holy shit I have shivers from your story. What a life you've lived, even if you can't remember all of it",
            "score": 149,
            "author": "SadisticRainbows"
        },
        {
            "level": 0,
            "comment": "Something about the juxtaposition of the philosopher being alive but having lost all his memories and the wife he lost it all to bring back…even if she’s back they’re still separated by the divide of memory. This is going to stick with me for a long time.",
            "score": 143,
            "author": "storiesti"
        },
        {
            "level": 0,
            "comment": "This is one that’s going to stick with me.",
            "score": 139,
            "author": "researching4worklurk"
        },
        {
            "level": 0,
            "comment": "that’s your wife! let her in!!",
            "score": 139,
            "author": "bi_ochemist",
            "replies": [
                {
                    "level": 1,
                    "comment": "She knows she can’t go in because she is the one that is protecting him. The markings on the wall is meant to trick the caretaker, who lost his memory, into thinking that the markings are what is keeping him safe. That’s why his wife Carrie’s him to the bed and then leaves when he passes out. They cannot be together, but she can be there for him",
                    "score": 166,
                    "author": "DoggishPrince",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They cannot be together for now. Just give it a few more years. Then maybe he can be reunited with his wife and perhaps toddler?",
                            "score": 47,
                            "author": "brittwithouttheney"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "OP, I think you may be the Philosopher, and you awoke your wife. I think she's keeping you safe. Good luck.",
            "score": 760,
            "author": "Query8897",
            "replies": [
                {
                    "level": 1,
                    "comment": "He found the key to the apartment in his own pocket the next day after he arrived!",
                    "score": 162,
                    "author": "glassisnotglass",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh shit, I got that he's the philosopher, but I didn't even catch that!",
                            "score": 39,
                            "author": "dead_PROcrastinator",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same!",
                                    "score": 5,
                                    "author": "moosewhippets"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -131,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This was absolutely fantastic to read, bravo! 🎶\n\nI don’t know how you’ve stayed sane this entire time",
            "score": 557,
            "author": "TriskitManaged",
            "replies": [
                {
                    "level": 1,
                    "comment": "He hasn't. He's the philosopher. Now he's the caretaker.",
                    "score": 368,
                    "author": "ProfessionalSilent17",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oooohhhhh shit. Wow",
                            "score": 70,
                            "author": "Personofstupid"
                        },
                        {
                            "level": 2,
                            "comment": "Omg this!!!! You’re totally right. I didn’t even realize until now",
                            "score": 52,
                            "author": "vcuriousone83",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\n\nBruh it is so obvious that he traded his memory for his wife to be able to return.",
                                    "score": 68,
                                    "author": "duypro247",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No need to be a dick",
                                            "score": 108,
                                            "author": "Smoolz"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "So many people not realizing he's very much dead, from the moment he woke up with that coat over his head.",
                            "score": 18,
                            "author": "andouka",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How can he be dead when he interacts with the police? He has just lost his memory but is alive",
                                    "score": 50,
                                    "author": "ema2324",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Being dead doesn't mean you're ***dead*** when you're an Annedale resident. It's dwellers can even go out of the building.",
                                            "score": 7,
                                            "author": "TheRhythmZ"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got so lost in this, I was surprised to see the end. I absolutely loved this.",
            "score": 105,
            "author": "LegendOfDeku"
        },
        {
            "level": 0,
            "comment": "This is an absolute beautiful story, Philosopher. I hope to hear more of your strange visitors",
            "score": 90,
            "author": "Cresala0613"
        },
        {
            "level": 0,
            "comment": "May you both continue to care for each other.",
            "score": 76,
            "author": "Another_Opinion_Here"
        },
        {
            "level": 0,
            "comment": "OMG you're the philosopher!! Everything makes so much sense! Such profound love amongst so much despair.",
            "score": 436,
            "author": "iddhis4991"
        },
        {
            "level": 0,
            "comment": "So, how's it feel to be a philosopher with no memory of philosophy?  Must really be something.",
            "score": 164,
            "author": "conundorum",
            "replies": [
                {
                    "level": 1,
                    "comment": "He’s doing pure philosophy, one of pure experience. A bout of memory loss is the closest you will ever get to being a naive child who is just experiencing the world for the first time. Actually, it might not be entirely pure experience because he still remembers how to use language, but its close. Especially since he is learning the in’s and out’s of the world by means of living in it. Doing philosophy is an everyday action that is natural to anyone, studying it comes by means of reflection. Basically, he is the philosopher doing philosophy without any distractions and I find that very cool. He is living the dream without knowing it.",
                    "score": 23,
                    "author": "Jkd212"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is so lush to read. I'm there with you. I wish I weren't, but you brought me to Annedale.",
            "score": 53,
            "author": "LaserAntlers"
        },
        {
            "level": 0,
            "comment": "YOU'RE HER HUSBAND OH MY GOD",
            "score": 46,
            "author": "999demonspawn666"
        },
        {
            "level": 0,
            "comment": "I think, like a lot of people, you may be the Philosopher.",
            "score": 30,
            "author": "allaboutwanderlust"
        },
        {
            "level": 0,
            "comment": "Maybe you are the Philosopher?",
            "score": 133,
            "author": "Wolf-en-stein"
        },
        {
            "level": 0,
            "comment": "Wow OP, your travels in that building are crazy, and the people you encounter crazier! Can you keep us updated when more stuff happens?",
            "score": 118,
            "author": "DeerStalkr13pt2",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -6,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "She called you with an endearment. I think you might be the Philosopher, OP. Hope you can share more stories with us!",
            "score": 23,
            "author": "BellaAngelaDiTerra"
        },
        {
            "level": 0,
            "comment": "at the end the most profound thing you wrote was despite the fear you still walked towards her as if you knew it was safe with no evidence of that fact",
            "score": 23,
            "author": "leenpaws"
        },
        {
            "level": 0,
            "comment": "I wish I had an award to give right now... (I will have to come back once I get one!). It's been such a long time since I was enthralled by a story here. Thank you! This conjured so much in my mind, beautiful, vivid, and haunting.\n\nEdit: I have now returned with my (humble) wholesome award.",
            "score": 22,
            "author": "nellise11"
        },
        {
            "level": 0,
            "comment": "Such a carefully constructed, beautifully written testimony of your life…and what you’re experiencing now.  Thank you.",
            "score": 61,
            "author": "Meatbasketbingo"
        },
        {
            "level": 0,
            "comment": "A very compelling story. Made me glad there is an ocean between us. Do you wonder if you were called by something in the Annedale?",
            "score": 17,
            "author": "wuzzittoya"
        },
        {
            "level": 0,
            "comment": "this is some of the most fantastic storytelling i’ve seen on this sub. i really hope you’ll share more of your experiences in this place.",
            "score": 17,
            "author": "maridaz3"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 21,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Please tell us more",
            "score": 15,
            "author": "BeardDrago0n"
        },
        {
            "level": 0,
            "comment": "Absolutely the BEST writing I've seen on Reddit to date. What a rich &amp; amazing life you've led, Philosopher...truly a shame that you can't recall any of it. Please tell us more!! Love your writing style 😳🧐",
            "score": 16,
            "author": "Which-Dare"
        },
        {
            "level": 0,
            "comment": "Just for shits and giggles, try to spend some time with her. Let us know what happens. She certainly doesn’t seem to be out to harm you. And your protection symbols didn’t keep her from entering but I might be overthinking. Either way, can’t wait to see what happens!",
            "score": 13,
            "author": "gynazumab"
        },
        {
            "level": 0,
            "comment": "It's quite clear you are the philosopher OP, otherwise you wouldn't have found the key in your pocket, and corpse lady wouldn't have called you her darling. Really enjoyed this. Waiting for a part 2.",
            "score": 41,
            "author": "dalma19"
        },
        {
            "level": 0,
            "comment": "The Annedale is not unique. Every place where humans crowd together in squalor and misery, there it grows. Before the Chinese dynamited it to Hell, *all* of Kowloon was the Annedale. Every big city has one, and most small towns have a hidden, forbidden place that they fear will grow. We have one here on Sint Maarten. Not much, four stories, and a basement. But the hurricanes can't, *or won't,* pull it down.",
            "score": 56,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Oh, OP. This is just devastating.",
            "score": 11,
            "author": "lettiestohelit"
        },
        {
            "level": 0,
            "comment": "This was amazing to read and also to find out how you went from a travelling man to a caretaker of the building that time clearly forgot, where gods seem to have fun be that they might be evil ones doing the night partying, I for one cannot wait for more writing from the care take of Annedale",
            "score": 9,
            "author": "jumpingelf"
        },
        {
            "level": 0,
            "comment": "This is so wonderfully complete as is that I hesitate to even say it, lest more just water it down, but with such compelling, moving writing I have to say that if you ever were inclined to share more about your experiences in Annedale, I'd love to read it.",
            "score": 10,
            "author": "idiotequed"
        },
        {
            "level": 0,
            "comment": "Goddamn, this is the best Nosleep writing I've read for a while. Please tell us more about your experience, caretaker.",
            "score": 9,
            "author": "Azrielmoha"
        },
        {
            "level": 0,
            "comment": "This is the best thing I’ve ever read here!!!!!!!!",
            "score": 9,
            "author": "ElAyYouAreAy"
        },
        {
            "level": 0,
            "comment": "One of the best reads ive had in ages!",
            "score": 9,
            "author": "FriedShrekels"
        },
        {
            "level": 0,
            "comment": "This is Great its  as good as that ranger who talked about his experiences please tell more of your experiences.",
            "score": 9,
            "author": "slimysnail321"
        },
        {
            "level": 0,
            "comment": "So narrator is the philosopher.",
            "score": 21,
            "author": "JoelMB12"
        },
        {
            "level": 0,
            "comment": "Would love to hear more about other residents of Annedale 🖤",
            "score": 7,
            "author": "SirToothy"
        },
        {
            "level": 0,
            "comment": "You’re the philosopher and that’s your wife.",
            "score": 7,
            "author": "Cimorenne"
        },
        {
            "level": 0,
            "comment": "I grew up in a place like that, an old motel I believe it was. Not old but oddly abandoned, we stumbled upon it once, not quite desperate but close, and we stayed, I can't remember my siblings, most of them didn't make it, too many rules for small children. But the ones who made it through, we carry the weight of their stories, and probably more than just stories.",
            "score": 7,
            "author": "Dry_Army8248"
        },
        {
            "level": 0,
            "comment": "I was wondering if anybody could tell me what this type of horror writing is? i so enjoy the stories in which it is set in one (larger) haunted area with lots of different stories with different people all being told by one person. i love these because they entertain me so much with all the mystery but i can only find them on reddit by pure luck.",
            "score": 18,
            "author": "ItsRandomX",
            "replies": [
                {
                    "level": 1,
                    "comment": "OP unfortunately ended up in an abandoned building where he got lucky in a safe space. Some people truly get the short straw in where life takes them. Real life is the horror!",
                    "score": 5,
                    "author": "copuser2",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 12,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "ok but i need to know more about the fingers. the damn hand. the damn gripper. the thing that’s been throwing people off the roof",
            "score": 6,
            "author": "Damptruff1"
        },
        {
            "level": 0,
            "comment": "the second you said “figuring we’d be about the same age” i was soooo hoping that’s where this would go, kudos!",
            "score": 6,
            "author": "glucose390"
        },
        {
            "level": 0,
            "comment": "Your strength is admirable and your dread is palpable. Another masterpiece of courage.",
            "score": 5,
            "author": "kingdomscum"
        },
        {
            "level": 0,
            "comment": "Amazing stuff caretaker.",
            "score": 5,
            "author": "clownind"
        },
        {
            "level": 0,
            "comment": "Stunning and creepily ethereal. Thank you",
            "score": 5,
            "author": "Ninja_Flower_Lady"
        },
        {
            "level": 0,
            "comment": "My god, I would love to hear more of Annedale.",
            "score": 5,
            "author": "cooleug"
        },
        {
            "level": 0,
            "comment": "This is great OP, I’d love some updates on anything new you happen upon. You should try communicating with the Philosophers wife! She seems to be protecting you",
            "score": 5,
            "author": "clutzbucket"
        },
        {
            "level": 0,
            "comment": "Finally, something on here that gave me complete chills. This will stick with me. Your account was beautifully conveyed. I felt I was there, another shadow on the wall. Thank you, philosopher.",
            "score": 5,
            "author": "anzbrooke"
        },
        {
            "level": 0,
            "comment": "This was beautiful. And bittersweet. Even the things that go bump in the night need someone to take care of them. And, from the sound of it, you might have someone taking care of you as well. More stories about your time as caretaker would be much appreciated.",
            "score": 5,
            "author": "capmack"
        },
        {
            "level": 0,
            "comment": "Ohhh the reason you had the key in your pocket the first night was because you are the philosopher",
            "score": 5,
            "author": "Citrusaurio91"
        },
        {
            "level": 0,
            "comment": "You being the philosopher the entire time .. wow. &amp; that's why you crawled to her and felt so sad. Also, probably why she didn't hurt you that night. This was amazing. I would love more Annedale 'adventures'",
            "score": 5,
            "author": "BittersweetAki"
        },
        {
            "level": 0,
            "comment": "Black mold can cause memory loss ;)",
            "score": 13,
            "author": "HornyCapricornWeed"
        },
        {
            "level": 0,
            "comment": "This was awesome! Stay out of the basement!",
            "score": 3,
            "author": "thebigbossyboss"
        },
        {
            "level": 0,
            "comment": "Keep a dog and name him courage.",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I still don’t understand why you don’t just do squats at the gym",
            "score": 3,
            "author": "mackenzor"
        },
        {
            "level": 0,
            "comment": "5 stars. I would definitely visit again.",
            "score": 5,
            "author": "VivelaVendetta"
        },
        {
            "level": 0,
            "comment": "Your account was riveting.  Amazing.  I'm sorry for your loss. But you chose to live it...",
            "score": 5,
            "author": "PM_me_your_fears2"
        },
        {
            "level": 0,
            "comment": "I fucking loved this. Read it three times and I've been thinking about it all day!",
            "score": 3,
            "author": "Hiyakitty1990"
        },
        {
            "level": 0,
            "comment": "Saving this to my favorites, thanks for sharing! I do wish someone with a better spatial understanding would draw a depiction of the layout of the flat with the dark, acute, corner. I can't figure out how to picture it. Actually, maybe it's better that I don't. I think that part spooked me the most.",
            "score": 5,
            "author": "thykarmabenill"
        },
        {
            "level": 0,
            "comment": "my brother, i think you are the philosopher. you gave your memories to have her back. that's why she seems sad, is because you've forgotten her.",
            "score": 4,
            "author": "GatorScrublord"
        },
        {
            "level": 0,
            "comment": "This is honestly one of the most interesting experiences I've heard about on here. Especially the random psychological effects, like insanity, hunger, and random other things caused by seeing some of the apparitions. You mind if I move in next door?",
            "score": 5,
            "author": "Regretless0"
        },
        {
            "level": 0,
            "comment": "OP, I just wanted to say that your account of events was the first in ages that managed to make me feel genuinely uneasy (and I read it in the morning!). You write beautifully and the ending took me by surprise. \n\nPlease, keep this one going! I would love to see how this develops!",
            "score": 5,
            "author": "mollycha"
        },
        {
            "level": 0,
            "comment": "It's a banger lads",
            "score": 5,
            "author": "CSSFLEXBOX"
        },
        {
            "level": 0,
            "comment": "Even though you have zero memory of being the Philosopher - given time and the few clues you possess ( like your sadness at seeing her) you can still work out the main points. Your wife is probably sad because of the price you paid and that importantly - you no longer know her.  I could be crazy but maybe she'd feel a little peace just knowing you had worked it out. Perhaps that understanding would help you both.  God I hope so!\n\nSomebody please....  make a movie of this poor man's story!",
            "score": 5,
            "author": "spiderfalls"
        },
        {
            "level": 0,
            "comment": "You got the No Sleep part right cause I’m too busy crying 😭",
            "score": 3,
            "author": "Responsible_Cause531"
        },
        {
            "level": 0,
            "comment": "I want more! I want a series! I want a team up with Kate from Goat Valley Campgrounds!",
            "score": 4,
            "author": "s3lene"
        },
        {
            "level": 0,
            "comment": "Damn. Was going to suggest calling up a Witcher but it seems you’re doing a good job taking care of this place 👍🏼",
            "score": 3,
            "author": "SteelRazorBlade"
        },
        {
            "level": 0,
            "comment": "A brilliant read! Thank you for sharing it",
            "score": 3,
            "author": "fuzzykat72"
        },
        {
            "level": 0,
            "comment": "This was so interesting! I would love to draw or see drawings based off of Annedale and it’s oddities",
            "score": 3,
            "author": "MarisaMakesThings"
        },
        {
            "level": 0,
            "comment": "Brilliant account of the Annedale! You should write a Lonely Planet guide for the place, and create a TV series out of every person who visits there. Bravo!",
            "score": 3,
            "author": "Fluffles-the-cat"
        },
        {
            "level": 0,
            "comment": "I'm reading this at work and shivers are crawling up and down my spine. I was not expecting to encounter such a masterpiece today. Bravo, philosopher...",
            "score": 3,
            "author": "Citruseok",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This is absolutely wonderful, please share more of your experiences... Caretaker",
            "score": 3,
            "author": "satanrulesearthnow"
        },
        {
            "level": 0,
            "comment": "W wife for still staying with you and keeping you safe after death. Glad she lookin out for you bro.",
            "score": 3,
            "author": "elitodd"
        },
        {
            "level": 0,
            "comment": "i cried",
            "score": 3,
            "author": "AutiSpasTacular"
        },
        {
            "level": 0,
            "comment": "Oh my gosh. I sure hope the children who kept vanishing weren't sacrifices the philosopher made to the unknown gods to try and get his wife back.",
            "score": 3,
            "author": "dead_PROcrastinator"
        },
        {
            "level": 0,
            "comment": "This was a really good trip, more mr philosopher",
            "score": 2,
            "author": "Worth_Bandicoot809"
        },
        {
            "level": 0,
            "comment": "Love how you told this story, very matter of fact but definitely creeped me out plenty. You are hella brave and glad you got out!",
            "score": 5,
            "author": "IdiotMaav"
        },
        {
            "level": 0,
            "comment": "Gripping read. Fantastic and moving in every line, almost as if the caretaker wrote it himself...",
            "score": 3,
            "author": "praveenzid"
        },
        {
            "level": 0,
            "comment": "For anyone who, like me initially, didn’t understand how OP could be the philosopher if OP killed what was left of the philosopher: I think what was left was merely a fungal construct of all that which was given up.",
            "score": 1,
            "author": "DrustanAstrophel",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah, I don't think they were the same person. I may be misunderstanding your point as to the moment OP killed who would have been the philosopher (sorry if so), but if I' I think the mushroom scientist guy came later, who wanted to ask things of the fungae, and that's who OP killed in the wall. As for the humanoid thing that was in the room before he came back with the crossbow, unsure, but I figured it was a result of the scientist's experiments.",
                    "score": 12,
                    "author": "idiotequed"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}