{
    "id": "108009a",
    "score": 14,
    "title": "How easy is it to find internships?",
    "author": "Educational_Mood4022",
    "date": 1673323547.0,
    "url": "https://www.reddit.com/r/georgetown/comments/108009a",
    "media_urls": [],
    "other_urls": [],
    "postText": "Is it really competitive? I'm interested in history, government, and international relations. I know it's probably a rhetorical question. Of course, it's going to be competitive. How does the whole process of finding one work?",
    "comments": [
        {
            "level": 0,
            "comment": "Easiest way: either your parents or one of your friends' parents hook you up. This being Georgetown, actually not very uncommon.\nOther way that isn't pure luck: go to your professors' office hours, show interest in the class, and ask them for guidance in finding an internship.\nThird way: hop on Handshake and start searching, then reach out to alumni at the company and ask if they have 15 mins to speak with you on the phone",
            "score": 12,
            "author": "aSadEconBoi"
        },
        {
            "level": 0,
            "comment": "It’s easier (especially in those fields) at Georgetown than many schools because you’re already in DC. So you can intern during the school year when there’s less competition from people trying to come in from all over the country, and you will have in person networking opportunities in DC as well. \n\nAnother tip is to ask older students who have had the types of internships you want for advice, and in some cases they can recommend you directly.",
            "score": 4,
            "author": "Ccvl09"
        },
        {
            "level": 0,
            "comment": "There is an internship in DC for anyone who wants one. Whether it's paid, gives you real responsibility, at an interesting organization, is less certain. But one of the biggest advantages of going to college in DC is the sheer number of government offices/companies/NGOs with offices here that need interns. If you want an internship you'll find one. Networking and well written applications can help you get a good one.",
            "score": 3,
            "author": "marcusissmart"
        },
        {
            "level": 0,
            "comment": "Go on agency websites and apply",
            "score": 1,
            "author": "geointguy"
        },
        {
            "level": 0,
            "comment": "I used Handshake to get my internship and think it's a great system. There's so many opportunities on there and would definitely recommend scrolling through every once and awhile and seeing if you find anything that interests you. Apply to any and everything that does (you can always say no if you get the offer; if you don't, everything is good practice). Maybe this is rare, but I didn't network within my company/have an \"in\" beyond just applying thru Handshake. Cawley has great resources for interview prep as well, it may seem silly but try a mock interview with them before any real interview--definitely helped me develop stronger answers and have more confidence going into it.",
            "score": 1,
            "author": "Jazzlike_Actuary_247"
        },
        {
            "level": 0,
            "comment": "If you want an internship on the hill (or any other government/think tank) during the semester (not summer), it can be relatively easy to get in given that you are at Georgetown (nearby, good reputation) and given that you have time to. Once you get that first internship, you can network your way to the next.",
            "score": 0,
            "author": "WhichButterscotch456"
        }
    ]
}