{
    "id": "12k18j4",
    "score": 7,
    "title": "Recommendations for classes for SFS Freshman?",
    "author": "Temporary-Hat3845",
    "date": 1681337244.0,
    "url": "https://www.reddit.com/r/georgetown/comments/12k18j4",
    "media_urls": [],
    "other_urls": [],
    "postText": "How many classes should I take? Which classes do you recommend and don’t recommend? Any classes that are overly hard or have bad professors? Thanks?",
    "comments": [
        {
            "level": 0,
            "comment": "Less specific but more of a general piece of advice I wish I’d had when I joined. When looking at ticking off core requirements, try and find classes with multiple attributes. That way you can tick off multiple requirements in a single class (I’ve taken a class which fulfilled 3 core requirements attributes in 1 class for example). You can do this by narrowing down by attribute when looking at registration on MyAccess.\n\nJust in general I’ve found the most interesting ones are also the ones with the most reading/toughest grading. So it’s a trade off between easy &amp; interesting most of the time. \n\nOh and whatever you do don’t take GOV-2400 with Joel Simmons. Avoid it like the plague. Take anyone else for CPS.",
            "score": 7,
            "author": "Euler2-178",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much for your insight. I was also wondering, for SFS, are classes graded on a curve or by your score like in high school? Or does it vary by class? I saw that MSB got rid of the curve, but couldn’t find much on SFS.",
                    "score": 1,
                    "author": "Temporary-Hat3845",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh and for professors and certain classes, do I get to choose the professor I prefer or is it whoever they give me?",
                            "score": 1,
                            "author": "Temporary-Hat3845",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Depends. \n\nLarge generalised classes which everyone has to take are taught by a number of professors who each have an expertise but will teach general classes as well. For example ISec is taught by Prof Kroenig who is an expert in nuclear strategy. So if you want to take a class specifically in nuclear strategy you’ll take it with him, but he’ll also teach the general one as an expert in the overall field of international security. \n\nMost classes are taught by the specific experts though. So if you take a class in International Trade Law and the WTO you’ll get Busch who’s an expert in that. Or immigration and conflict you’ll get Brown who’s an expert on that field etc etc.",
                                    "score": 1,
                                    "author": "Euler2-178"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Depends on the class. A lot of mine have been on a curve.",
                            "score": 1,
                            "author": "Euler2-178"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "don’t be afraid of the intensive language courses! idk where you are in your language study or which language you’re planning on taking but personally i’ve taken 12 credits of intensive language this year and i’ve loved it, has taken me from rusty and out of practice to having intelligent discussion in the language",
            "score": 1,
            "author": "rudekids"
        },
        {
            "level": 0,
            "comment": "Do yourself a favor and take macro. 600 other student lecture always suck, but for freshmen trying to make friends are a godsend.",
            "score": 1,
            "author": "Fritzer_"
        }
    ]
}