{
    "id": "b0asms",
    "score": 22,
    "title": "Felicity Huffman and Lori Loughlin among dozens charged in alleged college cheating scam",
    "author": "summerofsmoke",
    "date": 1552413267.0,
    "url": "https://www.reddit.com/r/georgetown/comments/b0asms",
    "media_urls": [
        "https://www.cnn.com/2019/03/12/us/college-admission-cheating-scheme/index.html"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Email (relevant):\n\n&gt; Dear Members of the Georgetown University Community:\n\n&gt; Earlier today, we were deeply troubled to learn that former Tennis Coach, Gordon Ernst, is alleged to have committed criminal acts against the University that constitute an unprecedented breach of trust. Mr. Ernst was charged alongside more than 40 other individuals, including coaches from Stanford, UCLA, the University of San Diego, USC, University of Texas, Wake Forest and Yale. The indictments allege a nationwide conspiracy whereby a for-profit college preparation company, The Key Worldwide, helped facilitate cheating on college entrance exams and bribed coaches to propose students as athletic recruits. The United States Attorney’s Office for the District of Massachusetts has identified Georgetown as a victim in the criminal case. You can read more about the case here.\n\n&gt; Mr. Ernst has not coached our tennis team since December 2017, when he was placed on leave after the Office of Undergraduate Admissions identified irregularities in his recruitment practices and the University initiated an internal investigation. The investigation found that Mr. Ernst had violated University rules concerning admissions, and he separated from the University in 2018. The University was not aware of any alleged criminal activity or acceptance of bribes by Mr. Ernst until it was later contacted by the U.S. Attorney’s Office, with whom we fully cooperated in its investigation. Mr. Ernst’s alleged actions are shocking, highly antithetical to our values, and violate numerous University policies and ethical standards.\n\n&gt; Now that the government’s investigation has detailed the extent of the alleged fraud, we are reviewing the details of the indictment and will be taking appropriate action. We have no indication that any other Georgetown employees were involved. While Georgetown has always maintained a policy to ensure that recruited athletes have the academic credentials to be successful at the University, we established a new policy in 2018 to strengthen the recruitment and admissions process for potential student athletes. In addition, our Department of Athletics and Office of Undergraduate Admissions now perform audits to determine whether any recruited student-athletes are not on the roster of the sport for which they were recruited.\n \n&gt; All employees of Georgetown University are responsible for maintaining the highest ethical standards and for complying with relevant laws, regulations and policies at all times. We encourage all members of our community to report any suspicious activity to our Office of Compliance and Ethics through our Compliance Helpline.\n\n&gt; Sincerely,\n\n&gt; Lisa Brown\n\n&gt; Vice President and General Counsel\n\n&gt; Erik Smulson\n\n&gt; Vice President and Senior Advisor to the President\n\n[**Follow-up Hoya article**](https://www.thehoya.com/georgetown-parents-former-coach-face-bribery-charges-admissions-cases/)",
            "score": 1,
            "author": "summerofsmoke"
        },
        {
            "level": 0,
            "comment": "Expecting a Hoya editorial tomorrow looking to expel the students involved, tbh\n",
            "score": 9,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "&gt; Athletic coaches from Yale, Stanford, the University of Southern California, Wake Forest and **Georgetown**, among others, are implicated in the case. The indictment accuses defendants of committing crimes between 2011 and 2019.",
            "score": 2,
            "author": "summerofsmoke",
            "replies": [
                {
                    "level": 1,
                    "comment": "J E S U I T V A L U E S",
                    "score": 7,
                    "author": "DontKillTheMedic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol. You know, I hope we are not involved in this - sadly, it would not surprise me if so.",
                            "score": 2,
                            "author": "summerofsmoke",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I wouldn't be shocked if Georgetown was indeed participatory in facilitating these backdoor admissions (rather than just 'being a target'). \n\nCura wallet",
                                    "score": 2,
                                    "author": "DontKillTheMedic",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[Hoya $axa](https://i.imgur.com/uByXZKr.png)",
                                            "score": 4,
                                            "author": "summerofsmoke"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly what should happen to the students involved here?",
            "score": 2,
            "author": "estachica"
        },
        {
            "level": 0,
            "comment": "As an alumnus (SFS '94) and 4 year letterman of the crew team, I certainly hope she will be expelled and all of her credits voided.",
            "score": 2,
            "author": "muckbeast"
        }
    ]
}