{
    "id": "gnzl78",
    "score": 24,
    "title": "georgetown vibe",
    "author": "123ugh1234",
    "date": 1590077068.0,
    "url": "https://www.reddit.com/r/georgetown/comments/gnzl78",
    "media_urls": [],
    "other_urls": [],
    "postText": "i just got off the waitlist at georgetown (msb) and i’m really considering going. the one thing holding me back is the competitive vibe that everyone keeps mentioning. i was hoping someone could describe the overall vibe of the school for me. also how are the people? is everyone pretty open and friendly or would u say it’s more competitive and cliquey??\nthank you sm!!",
    "comments": [
        {
            "level": 0,
            "comment": "The MSB has a curve, so in your MSB classes you are competing with your classmates for a good grade. This isn’t the case in non-MSB classes though. \n\nThe other competitiveness you’ll hear about is the club culture. There are some clubs on campus that are pretty tough to get into, but there are plenty more that are not competitive and/or allow anyone to join. \n\nThe overall campus vibe is not competitive imo. People are friendly and collaborative in my experience.\n\nThe MSB is one of the best business schools in the country. I’m not sure what your other option is, but all of my MSB friends have enjoyed their time here and have gotten really solid jobs right out of the gate.",
            "score": 26,
            "author": "tyrannosaurus_racks",
            "replies": [
                {
                    "level": 1,
                    "comment": "are SFS classes also on a curve?",
                    "score": 1,
                    "author": "meatpr29",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No",
                            "score": 8,
                            "author": "tyrannosaurus_racks",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Some. Economics department, which you have to take at least three in, is strictly curved.",
                                    "score": 4,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Tbh tho I feel like the econ curve only helps, never hurts",
                                            "score": 2,
                                            "author": "dolphinsonsaturn"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Well yeah of course some classes/departments are curved as is the case in every school at every university, but the MSB is the only Georgetown school with a universal curve like they have",
                                            "score": 1,
                                            "author": "tyrannosaurus_racks"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "hoya sasa",
                    "score": 4,
                    "author": "DrAculasPenguin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They changed the curve last year to a 3.5 which really helps (before it was a 3.0/3.3). Definitely recommend attending, the alumni network is very strong and there are amazing opportunities you won’t get elsewhere. There is a huge emphasis on group projects and I would say that people somewhat competitive when it comes to certain things but it’s not cutthroat or anything. Some classes have participation grades but quality was emphasized over quantity. \n\nKeep in mind that you’ll take classes in the other schools and join clubs, 99% of which don’t have a low acceptance rates. This will give you some perspective of life outside the MSB and potentially boost your GPA if you’re worried about that. I met some of my best friends at GU in both the MSB and in the other schools. Feel free to PM me with other questions.",
            "score": 5,
            "author": "tofubreadpizza",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you!!!",
                    "score": 1,
                    "author": "123ugh1234"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The MSB might be a bit more competitive than other part of the school, in terms of academics and related clubs, but most people are really friendly and caring. There are a lot of people who are \"competitive\" in the sense that they have strong personal ambition-but competitive isn't necessarily the right word for that since most people are \\*not\\* aiming to knock others down on their way up. Georgetown as a whole is more collaborative than competitive, and I've found that the vibe on college admissions forums/among incoming students makes the school seem more competitive than it really is.\n\nCurrent student.",
            "score": 9,
            "author": "Ccvl09"
        }
    ]
}