{
    "id": "hnux4o",
    "score": 31,
    "title": "Most Haunted Spots on Campus?",
    "author": "adriangump",
    "date": 1594261718.0,
    "url": "https://www.reddit.com/r/georgetown/comments/hnux4o",
    "media_urls": [],
    "other_urls": [],
    "postText": "Georgetown gets cited for the Exorcist all the time, but where's the /real/ scary stuff? With a university several centuries old, an in-house exorcist priest, and two graveyards on campus, there has to be some creepy stuff around. Anyone know of anything?",
    "comments": [
        {
            "level": 0,
            "comment": "In the attic of Kennedy there's a mock hospital setup. Like cardboard walls for hallways and individual rooms and lots of bizarre props. I have a bundle of fake grapes I took from there during one drunken exploration. Super creepy",
            "score": 28,
            "author": "DrAculasPenguin",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have been up there before and didn’t see any of this. Was this recent that you saw the mock hospital?",
                    "score": 5,
                    "author": "scottstots6",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Back in 2016 I think",
                            "score": 5,
                            "author": "DrAculasPenguin"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How do you get up there?",
                    "score": 2,
                    "author": "VinnieTheHorse",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I got to it by taking the elevator in Kennedy, but this was back when I had a \\*special\\* GoCard that allowed me to go pretty much anywhere on campus",
                            "score": 2,
                            "author": "DrAculasPenguin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Top floor of Reiss is a destroyed and abandoned science lab. Broken glass, flickering lights, graffiti, the whole shebang. Very creepy. \n\nFor bonus points, go to the tunnels underneath the building. The entrance is on the ground floor, you just have to snoop around to find it. It giant, pitch black, and probably filled w/ asbestos so you’ll need a respirator. The tunnel used to connect into the old medical center, and led through a old graveyard from Gtown’s slaveholding days. From what I hear though, it no longer connects, and is a dead end.",
            "score": 23,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are tunnels beneath Village A as well - as you noted, I believe it was more of a network at one point in time.",
                    "score": 8,
                    "author": "summerofsmoke"
                },
                {
                    "level": 1,
                    "comment": "Reiss is terrifying. It starts out normal and then just gets more decrepit the higher you go.",
                    "score": 2,
                    "author": "UshankaCzar"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Exorcist was based upon events that occurred at SLU, or so I was told.",
            "score": 8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Has anyone noticed how many people go missing in the ICC, never to be seen again?\n\nSpooky",
            "score": 7,
            "author": "travod",
            "replies": [
                {
                    "level": 1,
                    "comment": "They were probably victims of the many ICC petty robberies, simply snatched away in the night",
                    "score": 2,
                    "author": "adriangump",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“There were no signs of forced entry. Please remember to lock your doors”",
                            "score": 2,
                            "author": "mynameis__Ozymandias"
                        }
                    ]
                }
            ]
        }
    ]
}