{
    "id": "krmtl5",
    "score": 11,
    "title": "Financial aid for international students",
    "author": "Silent_Cry666",
    "date": 1609935612.0,
    "url": "https://www.reddit.com/r/georgetown/comments/krmtl5",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello\n\nI am considering applying to GT but I am an intl student who will prbbly need full financial aid.\n\nDoes GT cover the full-need? Are there any intl students here who would be willing to tell me abt it?",
    "comments": [
        {
            "level": 0,
            "comment": "From the Office of Student Financial Services:\n\n&gt;Financial aid for international students is extremely limited. To be considered for one of these awards, you must indicate your interest on your application for undergraduate admission and complete the CSS PROFILE. If you do not receive a scholarship in your first year, you will not be offered a scholarship in future years and you should plan your finances accordingly. If you were offered financial aid your first year, you must reapply for financial aid every year and will be re-evaluated based on the information on your financial aid application.\n\nI wouldn't necessarily count on major financial aid as an international student.  Having said that, I wouldn't let this keep you from applying.",
            "score": 4,
            "author": "shingdao"
        },
        {
            "level": 0,
            "comment": "Suggest getting in touch with a Counselor at GU. They will provide you with the information",
            "score": 2,
            "author": "oranjebean"
        },
        {
            "level": 0,
            "comment": "I’m an international and I got significantly more aid than I was expecting, we are quite well off and my family contribution was only around 20,000. Idk if application strength plays into it, because I’d consider myself a pretty decent applicant too, but I’d be cautiously optimistic.",
            "score": 1,
            "author": "SuperNinja741"
        },
        {
            "level": 0,
            "comment": "Assume you will get zero aid and be very pleasantly surprised if that's not the case",
            "score": 1,
            "author": "Ccvl09",
            "replies": [
                {
                    "level": 1,
                    "comment": "This ^\n\nFinancial aid exists for very competitive undergraduate applicants but definitely nothing to rely on.\n\nIf funding your education in the US is a concern, I would suggest finishing your bachelor's in your country of origin, excelling at that, then taking the GRE or GMAT and acing it in order to apply to Graduate School where there are many more merit-based scholarships.",
                    "score": 1,
                    "author": "darknus823"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No clue m8",
            "score": 0,
            "author": "ExpensiveExplanation"
        }
    ]
}