{
    "id": "l0uyii",
    "score": 10,
    "title": "Cycling at Georgetown",
    "author": "ProfuTofu",
    "date": 1611095200.0,
    "url": "https://www.reddit.com/r/georgetown/comments/l0uyii",
    "media_urls": [],
    "other_urls": [],
    "postText": "Quick question for any cyclists on this sub. Although I’m not coming to campus this spring, I’m still trying to iron out the logistics of bringing my bikes on campus in the future. I’m thinking about bringing a race bike and a cheap beater bike on campus, but don’t know how exactly to do so. I live in NY/CT, so driving down is sort of a pain and flying is pretty cumbersome with two bikes as checked baggage. Any suggestions? (obvious answer is to not bring that much stuff but I can’t bear being out of the saddle for more than a few days) \n\nAlso, is bike theft a big issue here in DC? If so, are dorm rooms large enough to store your bike during the year? Are there indoor racks to lock your bikes up? My bike is insured, but the claims process is annoying and I’d like to avoid going though that if possible.\n\nLastly, if any of y’all are on Strava, let’s connect! Just PM me whenever.",
    "comments": [
        {
            "level": 0,
            "comment": "Bike theft is an issue in every city, sadly.\n\nMost of the (double) dorm rooms are probably a bit too small to accommodate a bike without annoying your roommates. There are no indoor bike racks but a plethora of outdoor ones across campus (including outside of each dorm).\n\nI would suggest bringing the beater and a good lock. Worst case, you wouldn't lose your \"good\" bike.\n\nEDIT: To clarify, I have used my bike on campus without any qualms. Just make sure it’s locked and you’ll be fine.",
            "score": 9,
            "author": "summerofsmoke",
            "replies": [
                {
                    "level": 1,
                    "comment": "Solution: find another cyclist as roommate ;)",
                    "score": 3,
                    "author": "Zhang_Yao"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know there is a road cycling club thats being made that was posted a couple months ago. Do you do cyclocross at all?",
            "score": 1,
            "author": "FooForLife",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nah I don’t do CX and thanks for the info. I reached out to the guy who posted about cycling and have checked out the GroupMe he created",
                    "score": 1,
                    "author": "ProfuTofu"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's a pain. I wish I could have a bike on campus but it's just really hard to find a place to keep one, especially in the winter when you don't want to leave it out in the snow, etc",
            "score": 1,
            "author": "Ccvl09"
        },
        {
            "level": 0,
            "comment": "Bike theft is ridiculous here. Plan on keeping them in your dorm. If it's left outside for any reasonable length of time there's a good chance it will get stolen.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I did the same back in the day and drove from CT with two bikes on the back of my parents' car (you can buy super cheap racks that attach to the trunk). I was lucky and lived in Henle sophomore and junior year so my roommates and I all stashed our bikes in the living room. Bike theft was definitely a big thing when I was there (a friend had his lock cut with a torch when he lived across from Saxbys...) especially if you lived off campus or at the edges (think Darnell or back of Henle). If you live in VCE/W parking the bikes on the patio is pretty safe (same with Harbin). Keep the beater outside, and you can probably squeeze your road bike in your dorm if you're worried.",
            "score": 1,
            "author": "awkward-bud92"
        }
    ]
}