{
    "id": "l5s6qy",
    "score": 6,
    "title": "Transferring from MSB to Col",
    "author": "ThrowawayGtown",
    "date": 1611708183.0,
    "url": "https://www.reddit.com/r/georgetown/comments/l5s6qy",
    "media_urls": [],
    "other_urls": [],
    "postText": "TL:DR - MSB Freshman conflicted about MSB Finance/OPIM vs COL Econ/CS. Long-ish rant below.\n\nHi all. I'm a current freshman in the MSB, and after 1 semester in the MSB I feel very unsatisfied with its offerings. Sure, the core MSB courses are fine and interesting, but I generally felt much more engaged when I took my electives in the College, especially during my CS and math courses. I am still very interested in breaking into banking/consulting and am currently involved in one of the major finance organizations, but will transferring into the College for CS and Econ have a negative effect on recruiting? I'm also concerned about job security in the future, so I would also like to open doors to programming/technical careers as well. \n\nAs for graduating on time, I'll have 60 credits completed by the end of this year due to AP credit coming into GTown. The only thing I'm worried about is the COL language requirement, which I may need to expedite by placing out of either French or Chinese.\n\nRegarding culture fit, frankly I feel more connected to COL people vs MSB people. Sure, the MSB guys I've interacted with are nice and sociable, but my current social circle, though limited by virtual learning, is almost entirely comprised of people in the COL. Idk if this should be an important deciding factor on whether to transfer, but I thought that this may be important to include in this post.\n\nHas anyone here been in a similar situation? Is it worth it to stay in the MSB and forgo opportunities in tech? I know there's an OPIM major, but that seems like an awfully watered down CS minor for us MSBros. Any advice would be appreciated, especially from recent grads!\n\nplease overlook grammar/spelling issues in this post. im really in a rush to finish some readings for tomorrow.",
    "comments": [
        {
            "level": 0,
            "comment": "\"Sure, the core MSB courses are fine and interesting, but I generally felt much more engaged when I took my electives in the College, especially during my CS and math courses.\" This is the BEST reason to internal transfer, which is more of an academic switch than anything else.\n\n\"Will transferring into the College for CS and Econ have a negative effect on recruiting?\" No. \n\nCulture fit, you can hang out with whoever you want no matter your major/school.\n\nYou should switch to the college. This one seems clear.",
            "score": 5,
            "author": "Ccvl09"
        },
        {
            "level": 0,
            "comment": "I made the switch for the same reasons as you, OP, and I couldn't be happier. It didn't affect me for finance recruiting, although I was also in a few professional clubs which helped a lot in regards to networking and prepping for technicals. If you're already in one of these clubs, then you should be fine. You could also reach out to other folks in your club who are college majors to get their take. \n\nIf you're interested in technical roles like SWE though, OPIM is pretty worthless imo without taking additional courses in the CS department. The pitch I heard from the head of the department is that it is supposed to prepare you to \"manage\" engineers and actual technical folks, so it seems like it'll give you just the bare minimum of technical knowledge needed to work in a techy field.  If you're interested in going this route, switching to CS seems like a no-brainer.",
            "score": 4,
            "author": "richardfromrickand"
        },
        {
            "level": 0,
            "comment": "TLDR: Switch sounds like that's where your heart is at\n\nOk so this is a bit of dated advice (COL 14), but I can speak to finance CS roles (spent three years doing algorithmic trading at large hedge fund) and now CS PhD student. If you want job security take classes in databases and data engineering (lucrative career options, small community). Nazli Goharian has taught some great classes, I learned a lot from her. \n\nAdvantage of MSB are classes like accounting which you'll have to learn in most finance jobs, but a lot of places will teach that stuff to you. I know a lot of people who are successful in finance and consulting that were COL and SFS, most of it comes down to how hard you are willing to work once you are out of college. OPIM is a joke from my understanding and not something that gets you into a technical role really. \n\nLanguage requirements in the college are also easy to get through (you can bang it out in a year if you really want by taking intensive), and if you can place out then I would so you can take more interesting high level classes.\n\nAlso breathe, you're way too stressed it sounds like. Enjoy your time on the Hilltop. Take random classes that sound interesting but might not have relevancy (at least from an initial glance). If you want to be effective  in roles in finance or consulting it's about putting together pieces of a puzzle in an interesting way rather than being a worker drone. \n\nAll this being said I'm super biased about the college, I think it gives you a tonne of flexibility that you can't get in MSB. Don't worry also about declaring as a double major straight away, I would take classes in CS, math, and Econ see what speaks to you. You can always add another major later or minor, it will give you less stress than saying I need to get both of these majors done in the next three years.",
            "score": 1,
            "author": "awkward-bud92"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, this is one of the worst takes I've read on this sub. \n\n1. The MSB has its fair share of nincompoops just like the other three schools - if you think there aren't any grade-A morons in the SFS, I have a bridge to sell you. I say this having taken classes across all schools (including NHS) during my time at Georgetown.\n2. All of the OPIM majors I know who are actually interested in programming/compsci are also CS minors (and interning/working at Facebook, Uber, Hulu, etc.). The rest are legitimately more interested in supply chain/logistics or just wanted to pair something with Finance/Accounting/Marketing.\n3. Proportionally, more SFS students recruit for consulting each year, so this shouldn't be at all surprising.\n\nYou just sound like a bitter sophomore who didn't have any friends in the MSB, didn't get into BGA, and decided to transfer to the SFS. For your own sake, I sincerely hope you don't carry this attitude into interviews. No chance you're getting an MBB offer if you're this insufferable, even if you are in one of the pre-professional clubs.",
                    "score": 2,
                    "author": "Justice4Zuckuss",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}