{
    "id": "ldci8h",
    "score": 2,
    "title": "McDonough vs SCS",
    "author": "SmokelessSubpoena",
    "date": 1612546708.0,
    "url": "https://www.reddit.com/r/georgetown/comments/ldci8h",
    "media_urls": [],
    "other_urls": [],
    "postText": "I've been receiving outreach for Master's programs at the SCS school at Georgetown.\nI just wrapped up their initial informational meeting and I didn't realize the SCS was seperate from the McDonough school.\n\n\nI'm not looking to bad mouth either school, as both are obviously integral to Georgetown. But I'm wondering if the reputation is both the same for both schools.\n\n\nNot trying to blow 50k on a Master's from the SCS if the reputation is not the same as having it come from McDonough. \n\n\nCan someone assist? Would love both objective and subjective feedback, all is appreciated!",
    "comments": [
        {
            "level": 0,
            "comment": "To be honest, the SCS is not \"integral to Georgetown.\" It exists as the money making school, mostly offering masters degrees and summer programs. \n\nThat's not to say a SCS masters could never be worth it, if you know what you wanted to get out of it, but it would not carry quite the same weight as a MBA from the MSB, for instance. This also depends on who's looking. If it's an academic, a SCS masters will mean very little, if it's a random person who sees \"Masters from Georgetown University,\" your degree being from the SCS vs any other Georgetown school will be impressive all the same.",
            "score": 7,
            "author": "Ccvl09",
            "replies": [
                {
                    "level": 1,
                    "comment": "Spoken like a non-SCS grad. The school is designed for working professionals with years of working experience, not some kid that went into a MBA program fresh out of undergrad. \n\nMy SCS degree in Cybersecurity Risk Management has opened plenty of doors for me. It also allowed me to credit 30 out of 61 credits in my doctorates program due to the quality of program and institution. \n\nOh, all schools exist to make money. Law school is a great example.",
                    "score": 4,
                    "author": "SirSuaSponte",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;That's not to say a SCS masters could never be worth it, if you know what you wanted to get out of it\n\nAs I said, \"That's not to say a SCS masters could never be worth it, if you know what you wanted to get out of it\" - sounds like it was for you, which is a good thing!",
                            "score": 2,
                            "author": "Ccvl09"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is exactly what I was looking for. Thank you!\n\nI wasn't sure if this was more of a great opportunity, or more of a way for them to bring in the cashflow. \nOnce I was made aware of the differences between the schools, much of which they didn't want to discuss during the informational meeting, it made me realize this wasn't as great of an opportunity as I had anticipated.",
                    "score": 2,
                    "author": "SmokelessSubpoena",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tbh if ur stats are in line, I would try to push higher than gtown for MBA. Our undergrad program &gt;&gt; mba.",
                            "score": 1,
                            "author": "St0mb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ahhh, thats an interesting insight. Even if we're talking McDonough vs SCS?\nAny suggestions on a better MBA?",
                                    "score": 1,
                                    "author": "SmokelessSubpoena",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Push for T10/M7. Outside of that, MSB competes very well. It’s ranked #23 or something, but def holds its weight against  / beats any of the schools #20-#11 imo (especially for investment banking.)",
                                            "score": 1,
                                            "author": "St0mb",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My only concern for T10/M7 is I'm not sure where I currently sit overall and I'm not sure if I'm personally able to compete in T10/M7. \nBackground:\n\n\nMSU - SCM Undergrad (with additional education in Engineering, likely not a benefit in this situation)\n\n\n3.51GPA\n\n\n6+ yrs of professional SupplyChain/Ops experience\n\n\nHaven't taken my GRE/GMAT yet,\n\nLikely going to opt for the GRE, as I had a tough time studying for the GMAT a year back, but I also wasn't in a stable position, so honestly I was likely wasting my time studying, but I suppose I did gain some useful knowledge from it. \n\nI am highly proficient in mathematics though, so maybe the GMAT is better than GRE? I've just heard from previous friends the GRE is generally easier overall.",
                                                    "score": 1,
                                                    "author": "SmokelessSubpoena",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Most MBA programs require GMAT, don’t do GRE",
                                                            "score": 1,
                                                            "author": "St0mb",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah, I know that's the standard, but I've been seeing more and more programs accepting both, and from what I've gained from recruiters it seems that they don't technically care if either. \n\nDo you feel that's not necessarily true?",
                                                                    "score": 1,
                                                                    "author": "SmokelessSubpoena",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I think GMAT is advisable fs. Recruiters say one thing but then think another privately.",
                                                                            "score": 1,
                                                                            "author": "St0mb",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yeah that's kinda what I was thinking, likely would accept a lower gmat over a higher gre, as long as they're not egregiously different. Or maybe I'm just thinking too much about the biases",
                                                                                    "score": 1,
                                                                                    "author": "SmokelessSubpoena"
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You also mentioned you are math-proficient, and you are saying GMAT is more rigorous than GRE (i know less on this, haven’t looked a ton into the tests since again i’m a UG), but that would imply to me that a high gmat is a “bigger flex” than a high GMAT.",
                                                                            "score": 1,
                                                                            "author": "St0mb"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Depending on how u do on GMAT, you could be competitive for t10. Outside of t10, put some consideration into what regions you want to be in / ultimately work in / what sector or industry you are trying to push into and make decisions on that basis.\n\nAlso, defer to wallstreetoasis.com for these types of questions. Good resource.",
                                                            "score": 1,
                                                            "author": "St0mb",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Awesome! Yeah I've been looking for a good resource, ill check that out. Thanks for all the help btw!",
                                                                    "score": 1,
                                                                    "author": "SmokelessSubpoena",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Of course!",
                                                                            "score": 1,
                                                                            "author": "St0mb"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "MSB &gt;&gt; SCS though no question. If you were gonna do a non-business masters, you’d definitely want the graduate school of arts/sciences or MSFS over SCS.",
                                            "score": 1,
                                            "author": "St0mb",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah when I was going through the intro to SCS Masters Project Management program I could tell they didn't want to reference McDonough. Didn't seem like a good sign for the SCS school, I mean, obviously it's still a highly presitgious program, but I could tell there's still a divide amongst the McDonough graduate body and SCS graduate body and how each perceives each other.",
                                                    "score": 1,
                                                    "author": "SmokelessSubpoena",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I mean i’m an UG, so i haven’t experiences the dynamics, but i agree w the other poster insofar as SCS is mostly a cash cow school.",
                                                            "score": 1,
                                                            "author": "St0mb"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}