{
    "id": "m8qd3w",
    "score": 5,
    "title": "Living in McLean and Commuting to Georgetown for Grad School",
    "author": "[deleted]",
    "date": 1616185932.0,
    "url": "https://www.reddit.com/r/georgetown/comments/m8qd3w",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi all, I was just recently accepted into SFS for grad school but I'd like to live at home to save money if possible. Is anyone familiar with the best commuting options to get to Georgetown from McLean. \n\nI know commuter grad students can park after 5pm for $5, but I'm wondering what the best course of option metro-wise would be. \n\nAnyone have experience commuting from the NoVa suburbs into gtown for classes?",
    "comments": [
        {
            "level": 0,
            "comment": "If you can find a garage to park in in Rosslyn, it's an easy and free GUTS (shuttle) ride across the river and up the hill to Georgetown campus.",
            "score": 5,
            "author": "Ccvl09",
            "replies": [
                {
                    "level": 1,
                    "comment": "I entered the lottery for parking at the Rossyln lot but I wasn't trying to count on it!",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Doesn't have to be Georgetown official. That area is full of garages.",
                            "score": 3,
                            "author": "Ccvl09",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, I know Colonial Parking and a few others operate a ton of them near campus, paying a private parking garage will be my backup plan.",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "people in riverplace frequently have parking available for rent as well",
                            "score": 3,
                            "author": "ansoniK",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Great! I appreciate the lead :)",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you have a car, you could find a senior undergrad renting out a parking spot right off campus",
            "score": 4,
            "author": "tyrannosaurus_racks",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are there specific forums for this or will I just have to scour craigslist?",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Craigslist usually has spots. You can also check the [Buy/Sell Georgetown](https://www.facebook.com/groups/784186548627190/?ref=share) Facebook group or the group for your class year, people sometimes post them.",
                            "score": 1,
                            "author": "zinababble"
                        },
                        {
                            "level": 2,
                            "comment": "No major forums, definitely no craigslist. Mostly though word of mouth. It's not \\*technically\\* legal.",
                            "score": 1,
                            "author": "Ccvl09"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Also an admitted grad student to SFS, commenting to follow the thread for more commuting advice",
            "score": 2,
            "author": "MikeBlaesing",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh gosh I just checked your profile and saw your post in /r/GWU commuting from Stanford/Fredericksburg? That’s crazy! F.y.i. I emailed about the parking lottery and they said it wouldn’t open until concrete plans for the fall return to campus are announced",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Haha yeah my wife and I were considering living there until I got the instant accept offer from Georgetown. Since GU is much less accessible by public transport than GWU; we’re looking more like Gaithersburg/Germantown area to be close to the red line",
                            "score": 2,
                            "author": "MikeBlaesing"
                        },
                        {
                            "level": 2,
                            "comment": "Here's a sneak peek of /r/gwu using the [top posts](https://np.reddit.com/r/gwu/top/?sort=top&amp;t=year) of the year!\n\n\\#1: [Sneak Peak at the GW Minecraft server, still looking for people to help finish various buildings.](https://i.redd.it/i5hdzl2t4eb51.png) | [20 comments](https://np.reddit.com/r/gwu/comments/hsta1c/sneak_peak_at_the_gw_minecraft_server_still/)  \n\\#2: [Hello! I made a chrome extension that displays Rate My Professor ratings directly on the GW schedule of classes. Hopefully it isn't too late to help some people pick classes!](https://chrome.google.com/webstore/detail/ratemygwu/cpbecdacgjgpnpehjgkhddiancbonija?hl=en) | [9 comments](https://np.reddit.com/r/gwu/comments/jvgbir/hello_i_made_a_chrome_extension_that_displays/)  \n\\#3: [GWU to go fully virtual for the Fall semester](https://coronavirus.gwu.edu/) | [52 comments](https://np.reddit.com/r/gwu/comments/hyzc9y/gwu_to_go_fully_virtual_for_the_fall_semester/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/joo7mb/blacklist_viii/)",
                            "score": 1,
                            "author": "sneakpeekbot"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I did that commute for a year, from somewhere near kent gardens park. I could get from there to/from main campus via kirby, chain bridge then canal in 20 minutes or less if between 8:30am-4:00pm or after 7:30pm. Peak rush hour could be 50 minutes, but most often 30-35 minutes. Going through Arlington and Rosslyn works fine, but that anyways was a solid 20 min + waiting for bus + bridge traffic. \n\nSo, it depends on how much your time is worth to you and whether you could find something very near campus. Personally, I'd use some of the saved money from not paying rent for private parking on DC side, either in burleigh or Georgetown.",
            "score": 1,
            "author": "blasimon",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've done the Kirby -&gt; Chain Bridge Road -&gt; Georgetown commute a few times at 7am while dropping off a friend at a conference at the university and I was able to get from my front door to Healy Hall in ~15 minutes. I definitely don't expect that to be the case for commuting so the additional input helps. I might try to see if I can out a parking spot from someone else near campus. I'm just admittedly crap at parallel parking and I currently drive a somewhat large SUV so the idea of street parking scares me lol.",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hello there Rayotap!\n\nSorry to bother you, but SFS is kind of my dream for grad school and I'm wondering if you'd be down to chat  about it with me so I could learn some tips.",
                            "score": 1,
                            "author": "Shevik",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah sure just pm me",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "For some reason I get an error message when I try! Would you initiate and see if that solves the problem?",
                                            "score": 1,
                                            "author": "Shevik"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}