{
    "id": "mri14s",
    "score": 7,
    "title": "student health insurance/birth control",
    "author": "violentfruit",
    "date": 1618503313.0,
    "url": "https://www.reddit.com/r/georgetown/comments/mri14s",
    "media_urls": [],
    "other_urls": [],
    "postText": "Ok so I'm seeing in Georgetown's health insurance policy that they don't do birth control so - where do people go for it? Aside from the obvious reason I have pretty debilitating menstrual pain that's helped by birth control, so I really don't want to have to stop taking it while I wait for their people to decide it's medically necessary. Any tips? What have other people done for this?",
    "comments": [
        {
            "level": 0,
            "comment": "[https://www.hyasforchoice.com/faq-s](https://www.hyasforchoice.com/faq-s)\n\n[https://studenthealthinsurance.georgetown.edu/benefit-highlights/faqs/](https://studenthealthinsurance.georgetown.edu/benefit-highlights/faqs/) (Q13)\n\nYes, it is covered now, they just use garbled language to explain that it is.",
            "score": 12,
            "author": "Ccvl09",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you!!",
                    "score": 4,
                    "author": "violentfruit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi! H*yas for Choice member here! Basically georgetown will only cover birth control on their insurance if it is for a medical purpose and not a contraceptive purpose. You will probably need a note from your doctor, and it's kind of annoying but they have committed to covering it.",
            "score": 10,
            "author": "chloconut42",
            "replies": [
                {
                    "level": 1,
                    "comment": "https://www.hyasforchoice.com/faq-s",
                    "score": 5,
                    "author": "chloconut42",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "thanks!!",
                            "score": 3,
                            "author": "violentfruit"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "also, if you ask for it at the Student Health Center, many of the doctors will be like \"you have 'painful' menstrual cramps, right \\*wink wink\\*\"",
                    "score": 6,
                    "author": "resemble"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are you an undergraduate? And are you under age 26 and eligible to be on your parents’ insurance?\n\nAre you on health insurance right now?",
            "score": 2,
            "author": "tyrannosaurus_racks",
            "replies": [
                {
                    "level": 1,
                    "comment": "grad student &amp; will be 26 when i start. i've been on my own insurance through my employer so I'll definitely be on Georgetown's student plan in the fall",
                    "score": 3,
                    "author": "violentfruit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sad. Is there any way you can get your current provider to front load your prescription right before you switch insurance? And then try to get seen at student health immediately when you get to campus and get a prescription for non-contraceptive purposes?",
                            "score": 2,
                            "author": "tyrannosaurus_racks"
                        }
                    ]
                }
            ]
        }
    ]
}