{
    "id": "mvlnrq",
    "score": 5,
    "title": "Physics vs Phil/Theo in Summer for Pre-Med student",
    "author": "MoniCoff1",
    "date": 1619028611.0,
    "url": "https://www.reddit.com/r/georgetown/comments/mvlnrq",
    "media_urls": [],
    "other_urls": [],
    "postText": "My daughter is pre-med, Class of 2024. She has a great work ethic but this year has been challenging. I’ve encouraged her not to give up on pre-med just yet, until she can experience in-person learning. Unfortunately, sophomore year will be a doozy with Organic Chemistry - but being in the classroom and able to study in groups will help a lot, I think.\n\nAnyway, we are trying to use the SHIP session strategically. Would you take Philosophy and Theology or would you take Physics I plus Lab? Is Physics too challenging to take over the summer? Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "Physics is actually usually better over the summer because it’s the only thing you’re taking so you can focus on it more, and if Cothran is teaching it you’ll probably actually get better instruction than you would otherwise. But knocking out some GEs over the summer is great too. Can’t really go wrong, it’s more about cost.",
            "score": 10,
            "author": "tyrannosaurus_racks"
        },
        {
            "level": 0,
            "comment": "I think it really depends on what your daughter is trying to accomplish using the SHIP session. If she is planning to do other pre-med activities or have a life beyond academics this summer, taking philosophy and theology would be a good idea since they are not super intensive and will most likely leave her significant amounts of time to do other things during the day. Also, she gets to knock out some gen EDs.  I took physics I and II lec+lab last summer and I agree that Professor Cothran is wonderful for physics lab. In addition to that, I would also say that lab is a guaranteed A+ for everyone since it is really just a completion grade. The unattractiveness of Physics I lecture in the summer really comes from the professor and the intensity of science courses in the summer. In order to really do well on the exams, your daughter would pretty much have to use 100% of her great work ethic to understand the fundamental concepts covered in physics I lecture and then do tons of practice problems to make sure she actually understands them. Lab is going to take 2-3 hrs every day at least and lecture is guaranteed to be 90 minutes/one chapter a day so there won't be any time left to dabble into research or volunteering or having a life outside of physics. The professor for Physics I lecture is a good person but not a great professor. Her lectures were confusing and she often did not cover all that she wanted to during lecture so we would have to watch an extra 20-30 minutes of lecture on our own time. The worse part was that examples in class were nothing compared to questions on the actual exams. In my opinion, I think it would be better to wait until junior year to take physics since both semesters will be taught by Professor Johnson and he is just a super caring, understanding, and wonderful professor. If you have any questions just pm. Hope this helps in your decision making.",
            "score": 6,
            "author": "nakmagehai",
            "replies": [
                {
                    "level": 1,
                    "comment": "That is super helpful, thank you!",
                    "score": 2,
                    "author": "MoniCoff1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Definitely Physics over the summer. Phil/Ethics classes with the right teacher are probably the easiest classes you can take at georgetown and offer a great buffer during the year. Also, for orgo, if your daughter is nervous, she can seek out a tutor. She can either go through chem club, which is free or get a chem grad student private tutor for more one-on-one help.\n\nI saw the comment talking about \"stop using 'we'\" and I have to say, although it doesn't address your question and you found it offensive, the sentiment is very good. As a pre-med student especially, your daughter needs to be able to manage her academics and scheduling with some autonomy. Advice from parents is great, as well as general support. I think that what the commenter was getting at is not to be a helicopter parent as this can be detrimental if she's going to be an independent adult that becomes a doctor, does her own taxes, etc... Too often you see parents micromanaging everything when it comes to adult life and the kids don't know how to function without them. The commenter just picked up on the \"we\" and was cautioning against it generally speaking. I think that within the scope of this questioning it wasn't necessarily over-reaching unless you are scheduling everything for her.",
            "score": 5,
            "author": "WhichButterscotch456",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for your comment about the course selection; I appreciate it! In terms of your other feedback regarding allowing my daughter to chart her own course (no pun intended), I do understand. I am a Georgetown alum and was the first in my family to graduate from a 4 year college. I went on to earn a JD and MBA from Berkeley. Not bragging; rather, my point is that as a 1st generation college student, I did *everything* myself. And while it’s wonderful to be able to pat myself on the back, there was a lot that I missed out on/wasn’t aware of because I was always going it alone. \n\nMy intention is not to make decisions for my daughter. I am helping her gather information so she can reach her own conclusions. She decided to forego taking Bio 2nd semester freshman year - that was her decision that she made independently and I was 100 percent fine with it when I found out (after the fact). No opinion one way or the other! \n\nI’m only more involved now because my daughter is contemplating whether to continue pre-med. She asked my opinion and that began a discussion of how she might best leverage the SHIP program (which she had previously decided not to do) in order to make the program more manageable. I did offer her my opinion that beginning a pre-med program in a 100 percent online environment is very challenging and quite extraordinary. I have suggested that she give in-person learning in the pre-med program a try. Note that she has also consulted with her academic advisor but had not yet asked about leveraging the SHIP program.\n\nTBH, if she had been on campus in a normal year, we might not have ever had this conversation. I have no desire to be a helicopter parent. These decisions rest with my daughter because this is her life. But I am - and always will be - a resource to help along the way. Thank you again for taking the time to respond! I greatly appreciate it.",
                    "score": 2,
                    "author": "MoniCoff1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your daughter is a college student. It's time to stop using \"we\" when making academic decisions and let her make decisions for herself.",
            "score": 20,
            "author": "Ccvl09",
            "replies": [
                {
                    "level": 1,
                    "comment": "I take it that you have nothing constructive to offer? My daughter has asked for my help in dealing with this matter. She has also consulted with her academic advisor and WE are figuring this out collectively.",
                    "score": -8,
                    "author": "MoniCoff1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "definitely physics! took it over the summer after freshman year and my junior year + MCAT studying was a breeze.",
            "score": 2,
            "author": "ramen-noodles333",
            "replies": [
                {
                    "level": 1,
                    "comment": "physics is also totally doable with research and volunteering if its the only class you are taking",
                    "score": 2,
                    "author": "ramen-noodles333"
                },
                {
                    "level": 1,
                    "comment": "Thank you! In the end, she decided to take Calculus and Philosophy 🙂",
                    "score": 1,
                    "author": "MoniCoff1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you - that’s helpful!",
            "score": 1,
            "author": "MoniCoff1"
        }
    ]
}