{
    "id": "osigzx",
    "score": 5,
    "title": "How burdensome is PoG or Writ-015?",
    "author": "No-Dog-1989",
    "date": 1627372692.0,
    "url": "https://www.reddit.com/r/georgetown/comments/osigzx",
    "media_urls": [],
    "other_urls": [],
    "postText": "Would it be fine to add one of these to a courseload of an intensive language+three 3-credit courses or is that too much?",
    "comments": [
        {
            "level": 0,
            "comment": "PoG and WRIT-015 are both entry level courses and not intense at all.\nHowever, PoG professors change and vary, so do your research (ratemyprofessor, etc.) and you should be just fine.\n\nThat said, intensive languages are a big commitment. I have personally enrolled in several 18-credit semesters (same as you are proposing: five courses total, one intensive language course and the rest as three-credit courses). It is a lot of work.\n\nHowever, I want to reassure you that it is a viable schedule. Use the Add/Drop period to figure out if you can handle the workload and go from there. Worst case, you can withdraw, get a W, and move on. One of two Ws will not hurt you unless you plan to go to medical school or another competitive graduate field (and even then, one or two is alright).",
            "score": 9,
            "author": "summerofsmoke",
            "replies": [
                {
                    "level": 1,
                    "comment": "When is add/drop? Would I really have a fell for my courseload by then? Also I don’t know if you or anyone else would know this but can I drop my intro linguistics class if I don’t like it (I applied for the major so I’m preregistered but my interests may have changed a little)",
                    "score": 3,
                    "author": "No-Dog-1989",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[Here you go](https://registrar.georgetown.edu/registration/registration-schedule/#fallbutton). Yes, you can add or drop any courses you would like during the A/D period.\n\nYou may want to reach out to your academic advisor or peer advisor - they are readily equipped to answer these types of questions. You would get more reliable responses than from a bunch of Redditors. A lot of your inquiries are subjective, but they would be able to help you map out a plan that works best for you.",
                            "score": 2,
                            "author": "summerofsmoke"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "is there any negative effect socially or with clubs if I did this first semester?",
                    "score": 2,
                    "author": "No-Dog-1989",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That is really on you. College is all about time management and making an independent effort to discover and manage new experiences.\n\nPersonally, I had little trouble making new friends (typically those in your dorm and/or NSO group) and participating in the club sports program. As a first year, you will have to try and see what works for you and your schedule.",
                            "score": 2,
                            "author": "summerofsmoke"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think it depends on you and how well you can manage a heavy courseload. Intensive language is no joke and if you fall behind it gets really stressful really fast. Are you an incoming freshman? If so, I would ease up and take fewer courses your first semester (aim for 15 credits) and see how well you can manage that and take some time to adjust to college coursework. It also depends on what your other classes are, if you placed out of intro Micro/Macro and you're taking intermediate or itrade/ifinance, or if you're taking a hard science or something, that might be more difficult to manage than if your other classes will be easy. \n\nAlso it's been 5 years since I was a freshman but don't you have to take both PoG and Writ-015 your freshman year? I had to take PoG in the Fall and Writ-015 in the spring because of where my name fell in the alphabet, but maybe that's just an SFS thing. If you don't take either this semester are you going to take both next semester?",
            "score": 4,
            "author": "cay1eigh",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Are you an incoming freshman? If so, I would ease up and take fewer courses your first semester (aim for 15 credits)\n\nAgreed. For a first year, first semester student, 18 credits is a lot.\n\n&gt; Also it's been 5 years since I was a freshman but don't you have to take both PoG and Writ-015 your freshman year? \n\nWRIT-015 is mandatory for first years; PoG is not.\n\nAdvisors typically encourage students to take PoG early, but you can fulfill your theology requirements whenever. I took BibLit as the lone senior in my class lol.",
                    "score": 2,
                    "author": "summerofsmoke",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I took Writ-015 Sophomore year, I'm pretty sure you have more freedom of when to take it. Most kids in my class were sophomores, writing is hard to get freshman fall.",
                            "score": 2,
                            "author": "WhichButterscotch456",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Interesting. Either that was an exception or the policy has changed. A few years ago, WRIT-015 was mandatory for first years.\n\nThe course is meant to help adjust students to college-level writing, so it is best taken earlier.",
                                    "score": 1,
                                    "author": "summerofsmoke"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Especially if your PoG or Writ professor is on the easy side it won’t add too much to your workload. I’d recommend going on rate my professor",
            "score": 3,
            "author": "lemmehiturjuul"
        },
        {
            "level": 0,
            "comment": "Majority of POG profs suck, so tread lightly. Someone like Sanders or Slater you can get away pretty decently on. Avoid Lamm at all costs. My suggestion is wait to take POG until you have better selection.",
            "score": 3,
            "author": "WhichButterscotch456"
        },
        {
            "level": 0,
            "comment": "PoG and Writ-015 aren't bad on their own, especially if you look at rate my prof and find an easy prof. That being said, as others have said intensive languages are no joke and you should expect \\~2 hours a day just to keep up. I took intensive Japanese for 2 years and by the end I was struggling to maintain a B- (thank god for the covid pass/fail option). I took 18 credits with PoG and Writ-015 my freshman spring and felt that it was too much for me personally - not because of PoG and Writ-015 specifically, but just by virtue of taking 18 credits + an intensive language.",
            "score": 1,
            "author": "TreekoMudkip"
        }
    ]
}