{
    "id": "t6uqnw",
    "score": 12,
    "title": "Prospective Student",
    "author": "Party-Competition-1",
    "date": 1646433015.0,
    "url": "https://www.reddit.com/r/georgetown/comments/t6uqnw",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello Hoyas! I am a prospective student from southeastern Europe to be attending the 22/23 academic year LLM at Georgetown Law. This is going to be my first time in the United States, and I was thinking of getting accommodation closer to GULC campus. I wanted to ask whether anybody could give me some insight regarding the law school, campus, housing, and just living in DC generally? I'd be happy to hear about your experiences and insight. Thank you in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "Public taransportation in DC is actually decent especially the metro and the ciculator. One thing to consider for housing around the law center is your budget. DC is relatively an expensive city, so definiely look at areas close to metro stations although farther from the campus. Me and many of my friends lived in Pentagon City in Arlington, super nice area, great prices, we took the yellow line metro to go to the law center and if we wanted to go to the main campus, there was the Georgetwon shuttle just one metro stop away from the Pentagon city metro station. Feel free to message me if you have any more questions. Hoya Saxa and welcome to one of the best law programs in the world.",
            "score": 7,
            "author": "amir_rez",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks a lot for the information. This is very reassuring! I was thinking of using a bicycle to navigate through the city, but I definitely look forward to using the metro and finding a nice warm place to stay!",
                    "score": 3,
                    "author": "Party-Competition-1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The law campus is on the other side of the city from the main campus. The public transit isn't as good as it is in many places in Europe but the law center is very close to the red line and Union Station in DC, and only a short walk from the green line.\n\nEdit: the law center campus itself does have housing I'm not sure if it's just for first year students or not.",
            "score": 4,
            "author": "sultav"
        }
    ]
}