{
    "id": "zk8hmz",
    "score": 7,
    "title": "Bearish on Georgetown’s Future in the Next 25 Years",
    "author": "GradSchoolGrad",
    "date": 1670872723.0,
    "url": "https://www.reddit.com/r/georgetown/comments/zk8hmz",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am a proud Georgetown grad, but when I talk to my fellow alums, it often ends up about how Georgetown is going into the future as the only top 30 school without an engineering school/program, and how it hurts the school, students, and alums to lose to the competition.",
    "comments": [
        {
            "level": 0,
            "comment": "Class of 2020 here. \n\nI definitely wouldn’t be bearish about our future. In fact, I’m very bullish. Yes, we are lacking in the hard sciences, but that is only a small/niche group of people. Our premed/natural sciences (bio, human science, etc) programs are very strong and will continue to attract great candidates. Our business/Econ programs will continue to feed into great finance jobs. Our location in DC will always be a pull, and given gen z’s growing interest in politics, will be even more of a factor in the future. As an elite Jesuit school, we will still attract people who are interested in religion/spirituality/theology/philosophy (and I think Georgetown needs to grow this more). And our name is elite. While we are only ranked ~22 or whatever, our name has a lot of history/status behind it. Try to count how many US presidents have came to campus and how many elite speakers we get (we literally had pence and Hillary Clinton in the same semester)!\n\nAlso, think about this- our basketball team was literally 0-20, we were just online/masked for 1.5+ years, and our facilities are/were absolute trash. Despite this, we literally got the most applicants we’ve ever gotten! Once Ewing is fired and we get a real coach and our team does ~decent, that will add another aspect to this school. \n\nGeorgetown is a great place!",
            "score": 15,
            "author": "Right_Leg_3679",
            "replies": [
                {
                    "level": 1,
                    "comment": "As to the most applicants we ever gotten, most top 30 schools got the most applicants ever due to an abnormally large number of high school students taking a gap year during COVID to start later, and students transferring for a post-COVID experience. That is a short term post COVID bump, and I wouldn’t exactly call it a indicator of success.",
                    "score": 0,
                    "author": "GradSchoolGrad",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even before COVID we were getting more applicants. \n\nAnd even though every school got a bump, I wouldn’t exactly say that’s evidence for a ‘bearish’ future.",
                            "score": 3,
                            "author": "Right_Leg_3679",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "those are actually minor reasons on the increase.    While there is less students in the overall pool of HS kids going to college the total number of schools per applicant has skyrocketed.",
                                    "score": 2,
                                    "author": "PopOk1207"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Bearish if you categorize Pence as elite. Otherwise you are correct, location alone will keep GU relatively strong.",
                    "score": 0,
                    "author": "FastPlankton",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can disagree with someone politically (I disagree with him on a lot of things too) but still think that he’s a prominent speaker for Georgetown to bring in.  My point is that we literally had a former US Vice President and former First Lady/presidential candidate/secretary of state in one semester.",
                            "score": 8,
                            "author": "Right_Leg_3679",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Georgetown's guest speakers are pretty unreal. Even just thinking about the ones I've been lucky enough to see in-person this semester, it's a really impressive list... Bill Clinton, Hillary Clinton, Mike Pence, Pete Buttigieg, Linda Thomas-Greenfield (US Ambassador to the UN), Jake Sullivan (Biden's National Security Advisor), John Kirby (National Security Council Spokesman), NC Governor Roy Cooper, AZ Governor Doug Ducey, Rep. Ro Khanna, and Maggie Haberman. And there were still a ton of events I didn't get to attend, in addition to all of those",
                                    "score": 6,
                                    "author": "theOGyug"
                                },
                                {
                                    "level": 3,
                                    "comment": "Agreed, it’s impressive. When I was there John Kerry stopped by to speak, and Bradly Cooper! He’s an alum.",
                                    "score": 1,
                                    "author": "FastPlankton"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "ok",
            "score": 33,
            "author": "travod"
        },
        {
            "level": 0,
            "comment": "Yeah the lack of a really comprehensive STEM program has been rough. I had the choice to go to UCSB as an environmental biology major (one of the absolute best schools in the country for that subject) or Georgetown, where I'm one of about a dozen (?) EBIO majors in my year. I ended up going to Georgetown for the name recognition, but it's definitely nowhere near the quality of STEM education I could get elsewhere. Georgetown urgently needs to invest in expanding its STEM horizons.",
            "score": 21,
            "author": "crazycatnerd",
            "replies": [
                {
                    "level": 1,
                    "comment": "kinda agree. georgetown's location is FANTASTIC for stem majors after school (national institutes of health, national library of medicine, us dept of health, cdc washington, tech industries, other federal agencies, etc) and the school is near the top of my list even tho their stem programs could be stronger &lt;/3",
                    "score": 17,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "funny enough I graduated from ucsb before coming here, surprised to see the shoutout. can confirm our ebio program is fantastic, met a lot of great people in the program.",
                    "score": 8,
                    "author": "ChiefSaid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "LMAO sam fellow guacho here didnt there were other ucsb to Georgetown here too! :o",
                            "score": 3,
                            "author": "SilverOak98"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ya the school seems behind on the times",
            "score": 2,
            "author": "aaronburrrrr"
        },
        {
            "level": 0,
            "comment": "why do your conversations end up like that, please talk about other things",
            "score": 3,
            "author": "DrAculasPenguin"
        }
    ]
}