{
    "id": "147tkvx",
    "score": 2461,
    "title": "If your spouse passed away, would you maintain a relationship with your in-laws? Why/why not?",
    "author": "TLMoore93",
    "date": 1686593421.0,
    "url": null,
    "media_url": null,
    "comments": [
        {
            "level": 0,
            "comment": "Yes, so they could continue to have a relationship with their grandchild.",
            "score": 3744,
            "replies": [
                {
                    "level": 1,
                    "comment": "Absolutely this. In addition, I trust my in-laws alone with my child more than I trust my father, to the extent I have listed custody arrangements in my will. In-laws definitely go before my dad in custody line. I have every expectation that in the event of the worst, they would absolutely still be there for me and my child.",
                    "score": 319,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow funny I’m thinking exactly that, my in-laws have a much more stable homes and relationships. Strange how a shitty childhood bc of parents or family can mold normal level headed humans",
                            "score": 81
                        },
                        {
                            "level": 2,
                            "comment": "Same exact boat. My in-laws are the parents I wish I had. My parents weren't physically abusive or anything, but neglectful and gaslighting, plus they're into Q Anon now.",
                            "score": 17,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm right there with you. My in laws aren't the greatest, but I think they've grown to accept me. My own parents, on the other hand...",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The most level-headed answer.",
                    "score": 397,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Right!  I don’t understand how you couldn’t.   I have 4 kids and they would die if their grandparents weren’t around.",
                            "score": 72
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My inlaws provide a ton of child care. If anything I'd have to lean on them more which I'm sure they'd do.",
                    "score": 105,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I feel this big-time. My in-laws are a godsend",
                            "score": 15,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Feel this. My mom was so excited to be a grandmother. Apparently she just wanted the title. My inlaws don't care about the title, they just want a relationship with the kids.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same, as long as nobody pulls some stupid shit lol.\n\n\nTwo of my in laws don't get along (his sibling and one of his parents). My husband has already told them basically \" don't be assholes if im dying\". He does have a disease that can but isn't guaranteed to end his life earlier than average ... anything can happen . We are in our 30s, he was told he wouldn't live past his teens. He's good right now, all things considered. \n\nThat being said I can fully see my MIL either being an angel or a thorn in my side if he passes before she does. Hope it's the former. Either way I know what he wants, and that's no drama or disrespect.... but if someone's being an asshole he doesn't want to be involved. So I'd be following that.",
                    "score": 7
                },
                {
                    "level": 1,
                    "comment": "And to ensure the grandchildren remain in the Grandparents Will lol.",
                    "score": 85,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Spending time with grandparents is more important than inheriting their money.",
                            "score": 91,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That really depends on the grandparents. In **MY** kid's case, 100% true. I'd want them to stay close to my in-laws even if there wasn't a dime involved. They are good people and loving grandparents. Hell, my in-laws are the kind of people that I'd still want to go to holidays there with my new spouse if that was the case, and not just drop my kids off. In other cases..... as long as people aren't abusive and the money is big enough, sometimes it's worth making nice 3 times a year.",
                                    "score": 55
                                },
                                {
                                    "level": 3,
                                    "comment": "That depends entirely on the grandparents. For example, my fiancés grandparents are most definitely not the type of people you would want your child to spend time with. But they do happen to be very wealthy.",
                                    "score": 22
                                },
                                {
                                    "level": 3,
                                    "comment": "It’s cute you think that’s true for everyone.",
                                    "score": 18
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My wife committed suicide 6 years ago today - June 12, 2017. I don't keep in touch with her father because she didn't (she went low contact before we even started dating), but her mother and I reach out to each other every few months to catch up.",
            "score": 403,
            "replies": [
                {
                    "level": 1,
                    "comment": "I've done much the same since my husband's suicide nine years ago.  \nI haven't talked to his father in a long time, but I never did. He and I just didn't have a relationship and I never thought he wanted one. But I do keep up with his mother and we exchange cards/texts often.",
                    "score": 52
                },
                {
                    "level": 1,
                    "comment": "2017 sucked",
                    "score": 7
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes, they're nicer than my parents.",
            "score": 3074,
            "replies": [
                {
                    "level": 1,
                    "comment": "Same, well she's nicer than my mom anyway. No way I wouldn't be there for her, she's worked so hard to provide for my Fiancé, no way I could not keep her in my life.",
                    "score": 441,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Isn’t it amazing how wonderful nice people often seem to come from wonderful nice families?\n\nIt’s not always the case, but I’ve found it to be this way more often than not.\n\n\n—\n\nYes I know a few very nice people from absolutely awful families, and even the nicest family can have its weird quirks.  I also know some awful people from seemingly nice families.",
                            "score": 72
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 106
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I know I've become a better person as an adult so I'm probably easier to get along with now but the immediate acceptance and love I received from my fiance's family just endeared them to me a million times more than anything I've felt for my own family. He has also encouraged me to be closer with my own, which is great.",
                    "score": 52
                },
                {
                    "level": 1,
                    "comment": "Reverse with my spouse. She has no relationship with her mother but I know if I somehow passed she'd still be around my parents a lot",
                    "score": 52
                },
                {
                    "level": 1,
                    "comment": "You too? That’s great",
                    "score": 8
                },
                {
                    "level": 1,
                    "comment": "Same. I basically have no other family and they have taken me in since day one.",
                    "score": 15
                },
                {
                    "level": 1,
                    "comment": "Same",
                    "score": 4
                }
            ]
        },
        {
            "level": 0,
            "comment": "The second I started dating their son, my in laws took me in and treated me like one of their own. I didn't know what a kind, loving family or parents were really like before, experiencing it was a huge revelation.\n\nI would absolutely maintain a relationship with them, and I know they would want the same.",
            "score": 2083,
            "replies": [
                {
                    "level": 1,
                    "comment": "We aren't married (yet) but I refer to my boyfriends parents as my in-laws. And in turn they introduce me to others as their daughter in law. My boyfriend's mom is my best friend. I absolutely love her to bits. We hit a rough patch a couple of years ago and she took me for coffee to talk about it and assured me that even if the worst happened, she would *always* be there for me and in my life whether he liked it or not, because she loves me. \n\nI didn't know what a real family was supposed to be like until I met them either. For my 18th birthday - the first birthday I spent with him - my boyfriend asked me what I wanted to do, and I had never really celebrated my birthday since I was a child because we either couldn't afford it or my mom and I were fighting over one thing or another. He knew this, because I told him. So, on my birthday my boyfriend picked me up, took me to McDonald's to get a mcflurry, then took me to dominos to pick up the pizza he ordered for us. When we got to his house, his mom had most of the lights off and she was standing in the kitchen with a cake, candles lit, and a gift bag on the counter. They started singing happy birthday when I walked in. To say I cried is an understatement. They have done this every single year since then. \n\nChristmas is regularly celebrated in my family because we save up for it. But man, that first Christmas I spent with my boyfriend I cried *again* because when I got to his mom's house there was a stocking with my name on it and it was *full*. His whole family got me gifts. I wasn't prepared that year, but the next year I went ALL out on gifts for him and his family. His mom includes me in absolutely everything. And when I can't make it to something, I know damn well she'll be phoning me on her drive home to tell me all about it and give me all the gossip.",
                    "score": 65
                },
                {
                    "level": 1,
                    "comment": "My partner’s parents did the same with me. To feel unconditional parental love for the first time was surreal. \n\nMy partner passed away five years ago and I am still close with his mom especially, she brings me so much comfort and I am so happy we have continued our relationship. We desperately needed each other in the early days of our grief and now I don’t think either of us could imagine it any other way.",
                    "score": 269,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So sorry for your loss, and glad you have comfort in each other. That is a strong human bond we should all strive for and hope to have someday.",
                            "score": 27
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My in laws were like this before we were even officially dating, they are absolutely WONDERFUL people and I love them to death, I’m so happy you have such a great family",
                    "score": 175,
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I had a very similar experience. I met my partner in our late 30s, both having been divorced before.  She is from the Scottish Islands. Until I met her and her family I had no idea what a family was supposed to be like.  Both of her parents have passed now, but I would never give up contact with my family of her brothers, neices, uncles, aunts, cousins.",
                    "score": 42
                },
                {
                    "level": 1,
                    "comment": "My boyfriend and I celebrated out 8 year anniversary last month.\n\nThrough these 8 years, his father and sister died suddenly from undiagnosed diseases. His grandparents on both sides are still alive, but deteriorating both mentally and physically. In my family, I only regularly talk to my grandmother, cousin, and sister while talking to my brother and father rarely. I do not have contact with any other members of my family. \n\nEven though we're not married, I still call his mom my mother in law and she calls me her daughter. Her and I get along together so well... I honestly can't imagine my life without her. She's an amazingly beautiful human being. Every time my boyfriend and I have run into rough times in terms of our relationship one of my first thoughts is always, \"I can't lose my family.\" It's so weird but I fear losing his family more than I fear losing our relationship.",
                    "score": 45
                },
                {
                    "level": 1,
                    "comment": ".My  inlaws were wonderful people,  unlike my parents. It was nice knowing I could call for anything.  I continued to visit the mom after we divorced. She was so sweet.",
                    "score": 13
                },
                {
                    "level": 1,
                    "comment": "Similar situation however in my case ‘treated like one of their own’ isn’t a good thing.",
                    "score": 23
                }
            ]
        },
        {
            "level": 0,
            "comment": "My oldest sister passed away in 1989 before I was born 1994. My whole life I've had this guy named Vince in my family. He's the nicest sweetest funniest dude and has always been like a really fun uncle to me. He basically lived with my parents for years after my sister died. My Dad took him in as his pseudo son and even after he started dated this wonderful woman years later he would still come on family vacations with us.\n\nHe asked my dad permission to marry his new girlfriend back in the 90's as a sign of respect. Of course he said yes. Unfortunately two years ago or so she was diagnosed with Alzheimer's and today her condition is getting worse and worse to the point he can't leave the house anymore. He has experienced unimaginable pain for a man to now go through what is essentially two deaths of wives in his life. Again, nicest guy ever and the positivity he's always carried about himself. But yes if you have a good relationship with in-laws, keep it. Chosen family is forever.",
            "score": 157,
            "replies": [
                {
                    "level": 1,
                    "comment": "This is a really cool comment, thanks for the story and i hope uncz is doing well",
                    "score": 3
                }
            ]
        },
        {
            "level": 0,
            "comment": "My wife died, in my arms, on May 13th of cancer complications.  Her dad called me last night to check in on me and her mom called the day before for the same reason.  I call them Mom and Dad, and they will be that for the rest of my life.",
            "score": 1431,
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm so very sorry for your loss.  We found out on May 25th that my wife has brain cancer. No cure...  just have to treat it and deal with it as long as possible. I have been an absolute mess inside, but trying to hold it together for my two boys.  She is the eternal optimist of the family , and is ready for whatever comes next. We find out the biopsy results tomorrow.  \n\nHer family is my family, and I know that we will have each other.  \n\nI hope that you are ok and that you can find some peace.  This is the worst.  If there's anything I can take from this, it is that I will never waste a day... or the opportunity to help someone that needs it. My circle has been amazing, but I know not everyone has that.",
                    "score": 279,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m sorry you are all are experiencing this, it doesn’t mean much but I hope you get great news tomorrow.",
                            "score": 48,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you very much.  She is a real fighter, and she keeps me positive, even now. She is thankful she has more time, even though we don't know how long. We're going to make the best of whatever we've got.",
                                    "score": 19
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm so sorry to hear that. Cherish every single second.  Make recordings of her voice, of simple everyday moments.  Save voicemails, take lots of pictures.  I have a few recordings of my beautiful wife's voice and I have them backed up in 3 or 4 different places.",
                            "score": 6
                        },
                        {
                            "level": 2,
                            "comment": "Damn. I’m sorry you’re going through this. I’m rooting for you and your wife. \n  \nIf she feels up to it, have her write various letters to the boys and do some videos of everyday things (like her laughing or maybe the way she sings while making dinner for example) or video recordings of telling some stories about her life. Looking at storyworth prompts might be helpful. It will be tough but you’ll all be glad you have those memories. Hopefully she can be comfortable during all of this.",
                            "score": 4
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I lost my dearest wife a couple of years back thanks to that dreadful disease too. I found that them continuing to care about you is a testament to how much you cared about their daughter, and how much you showed and proved it to them.",
                    "score": 38
                },
                {
                    "level": 1,
                    "comment": "I’m sorry for your loss.  My mom died in 2003 shortly before my parents 25th wedding anniversary.  My dad is still close with my grandmother and calls her mom.",
                    "score": 21
                },
                {
                    "level": 1,
                    "comment": "so very sorry for your loss.  I am in in the same stinking club having lost my wife 2 year ago.  I am actually out visiting her family (they live 1,030 miles away) as my great niece (yup I am getting old) just got married.  I called her parents Mom and Dad, they have also passed.  I make this trip out here twice a year - so nice in the summer - and so much snow in the winter.  But they are my family.  And my own family back home is pretty awesome as well.",
                    "score": 78,
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I'm sorry for your loss.",
                    "score": 15
                },
                {
                    "level": 1,
                    "comment": "I’m so sorry for your loss",
                    "score": 9
                }
            ]
        },
        {
            "level": 0,
            "comment": "Happened to me. Recently.\n\nMy ex passed away on dec 18 2022 from a sudden case of severe pancreatitis due to a reaction from a chemotherapy drug she was told to take by her doctors to treat potential return of adrenal cancer. There was no sign of the cancer as of her latest scan but they said take it anyway. The drug was Mitotane.\n\nShe died in horrible pain and extremely scared. It was a traumatic experience. Her family appreciated me being with her through all of it. They said I will always have a place with them.\n\nI talk to them every couple of weeks. I plan to continue to do so, even when I have a new relationship.\n\nEdit: people asking me some questions in DMs. I am detailing the events of this here now. I also want everyone to know that I’m doing a lot better now. I’m sharing this in case anyone wants to know or has a similar experience with trauma to know you’re not alone. This is not a happy story, but I’m really doing much better now. Really. I appreciate the kind words.\n\nWe were not married but we were engaged.\n\nDec 9 2022, my gf called me at 7am saying she felt sick. I initially was like, upset and frustrated with her. At the time it was the first day of the new season for the game I play and I thought \"Ugh she's sick on league start day, what a bummer.\" I had no idea what was to come. Unfortunately, this quickly became a much worse, much larger issue. \n\nShe said the stomach pain she had was progressively getting worse, so after about 15 minutes we rushed to the ER. I was obviously concerned and felt bad but still was not that worried, i thought maybe she has an internal cyst burst or appendicitis or something. Sure it will be bad, but she'll recover. Unfortunately this was not the case. She was diagnosed with Pancreatitis from a complication due to a drug she was told to take from her doctors. Initially I did not worry because, I mean, she's young and healthy, so she'll be fine, right? I mean she’s 36… she’ll be fine. I went home from the hospital, sat down to play my game and did so for like 30 mins but I was quickly becoming more worried and I couldn’t enjoy it or focus on it. The next day, I was becoming increasingly worried as the doctors were talking about how they \"could not stabilize\" her and she was experiencing \"Multiple organ inflammation.\" This quickly became unimaginably scary. How can you go from being totally fine to organ failure as a young healthy 36 year old? I was very very worried, but still I thought she would be okay. I couldn’t play my game, couldn’t eat, couldn’t think about  anything. I was way too nervous and anxious and was spending most of the day in the hospital.\n\nBy the next day, Saturday night, she was heavily sedated. I went to see her, she woke up, and the last thing she said to me was \"Baby, I don't want you to see me like this, I'm suffering so much.\" She was in agony. She said her insides were twisting and burning and stabbing and aching. She could not be consoled. I just told her it's ok baby, you'll be fine. This was by far the most traumatic part of the whole experience. \n\nShe was not fine. About 8 hours later at 2am they said she is crashing and they have to intubate her to try to save her life. The next morning they said she could not be stabilized and will die that day. I was in disbelief. How is this possible? So I waited with her all day. I was in shock. \n\nAnd she... didn't die. Yet. Her body was young and was trying to recover. \n\nI stayed up in the hospital everyday with her for 8 days as she was breathing through a ventilator, hooked up to dialysis in the ICU. Tubes everywhere, it was a terrible thing to witness. The doctors said the chance she recovers is almost minimal but they've \"seen miracles before.\"\n\nIt was without a doubt the longest days of my life.\n\nOn Dec 18, 2022, she passed away as the CT scan showed that her pancreas was far too inflammed and multiple organs were affected. She had swelling in the brain. We took her off of life support and watched her pass.\n\nI thought I had been through many rough experiences in my life. I thought I understood stress. In 2013 I found the dead body of my best and closest friend who died at 26 with an undiagnosed heart condition (rip /u/ahd887) . In 2018 my father had a heart attack and dropped dead in front of my family. I've seen a lot... but staying up watching your gf cling to life and not knowing if she will recover or if she recovers will she be disabled or have brain damage... **THAT** is stress. And the loss was immeasurable. For a week straight I was just unable to do anything. I have a regular schedule of gym, Jiu Jitsu, work, gaming, and my gf. I could not do anything. At all. It was like a TV where they show a time lapse of someone standing there totally still as the days go by behind them. Then we had to do the funeral, I had to give the eulogy because her parents weren’t capable of it, and I mean yeah. It was hell.\n\nI could not rely on my family because the situation was unbelievably complex. My mother hated her; absolutely fucking hated her due to my mother’s own biases and prejudices, and I chose to not even tell her what was happening because I know my mom and she would have said something that would have made me unable to ever forgive her.\n\nI relied very heavily on my sister and my best friend. He was as empathetic and helpful as possible. I was more or less living at his house for 8 hours a day, talking when I needed to, crying when I needed to, smoking a ridiculous amount of weed, and staying completely away from any and all other drugs and alcohol. I don’t suggest relying on any substance to deal with trauma, but I did, and I’m just being honest. Thank fuck I no longer drink alcohol.\n\nAnd I mean… in time… you start to heal. There’s nothing else in the world that will help but time. \n\nA few months went by and eventually you find yourself able to find joy in things again. It took several months. I finally got back on the mats and found joy in training again. I finally got back into the gym and lifted again. Eventually I started playing my videogame again.\n\nI will never ever fully let go of the trauma; that’s with me for life. But you will move on from it. We don’t have a choice. \n\n\nI will get better, but her parents will have a loss that is likely *far worse* than mine. I owe it to them to check in on them every now and then. \n\nI am 38. Getting older is loving things, then losing them, then finding new things. You can’t experience love without knowing that at some point you will experience loss of that thing. Everything you love will be lost. Your pets, your family, your car, your loved ones, even the universe itself will eventually die. \n\nI’ve come to learn that this truly is the human condition. But it’s not as depressing as it sounds. Because The loss doesn’t erase the love, it’s just part of it. It’s what makes it special. And as you experience more of the loss, we’ll it doesn’t get easier, but you just get better at dealing with it. The world will keep spinning, and you find new things to love. It’s all we can do.",
            "score": 2337,
            "replies": [
                {
                    "level": 1,
                    "comment": "That last paragraph was beautiful and a fantastic perspective to take. It honestly made me tear up a little.",
                    "score": 114
                },
                {
                    "level": 1,
                    "comment": "I'm so sorry for your loss. My thoughts are with you.",
                    "score": 362
                },
                {
                    "level": 1,
                    "comment": "Jesus. I had acute pancreatitis last year, had no idea it could kill you. No one made it seem like anything crazy. So sorry for your loss.",
                    "score": 95,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Depends on the severity. Mild can be recovered from. Severe acute pancreatitis has an 80%+ mortality.",
                            "score": 67,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It was mild thankfully. I appreciate the input though",
                                    "score": 26
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Same. I spent three days in the hospital with it, and none of the nurses ever even hinted that it could potentially be life threatening.",
                            "score": 27,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same exact experience. 3 days and not a soul said it could be fatal. Didn't even know it could be until I read this honestly",
                                    "score": 20
                                },
                                {
                                    "level": 3,
                                    "comment": "That's because most floor nurses never see pancreatitis go that far south. Usually, if it starts to get bad the patient will end up in the ICU, so the nurses on the main floor have no idea what it looks like.",
                                    "score": 4
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My 54 yr old husband died from it in 2021.",
                            "score": 15,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I am so so sorry for your loss. I couldn't even imagine. I hope you're doing well now.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you. It's getting a little easier. Watching the amount of pain he was in was horrible.",
                                            "score": 9
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Oh yeah. A friend of mine lost her boyfriend this way. Young guy in his 30s.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You don't have to answer this if you find it intrusive, but don't you feel a level of resentment at life that your fiancé died as uncontrollably as she did? I mean I'd feel absolutely enraged that someone like that was taken away from me like that. Regardless, I'm glad you could grieve and eventually go back to your hobbies to nourish your spirit again. That's really tough.",
                    "score": 16,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have unfortunately had sort of dealt with something like this before so I had some experience with it. My best friend passed suddenly on thanksgiving in 2013. I found his body in his apartment and did CPR on his corpse. He was 26. The body was cremated so the autopsy was limited. It came back months later saying he had a cardiac arrest which came from an unknown cause, but almost certainly an undiagnosed heart condition or brain condition. \n\nAt that time I was just transformed into a new person. It took maybe a full year for me to process it. It’s like “how is he gone… and I’m still here?” I don’t know if that makes sense. Part of that was a deep resentment of life and the fragility of it. \n\nLike anything else, with time you eventually come to terms with the reality of it. And you gain new perspective.",
                            "score": 13
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is fucking horrible I’m so sorry. \n\nI once heard a saying “grief is the price we pay for love”.\n\nIt is so fucking true.\n\nSorry for your loss OP.",
                    "score": 34,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;I once heard a saying “grief is the price we pay for love”.\n\n&gt;It is so fucking true.\n\nMy personal favourite is \"grief is just our love for them that has nowhere to go\"",
                            "score": 32,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Grief is just love without a home. Yup",
                                    "score": 15
                                },
                                {
                                    "level": 3,
                                    "comment": "That is also a good one.",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m so sorry for your loss, I can’t imagine how hard that must have been for you, I’m glad your in laws have been so supportive and continue to keep in touch",
                    "score": 81
                },
                {
                    "level": 1,
                    "comment": "I experienced something similar over 10 years ago. A sudden unexpected death when she was 29.\n\nLike you said the pain never really goes away... and it doesn't really lessen... you just learn to live with it. For me, the pain is just a reminder of how great things were... a kind of flame to keep her memory alive.\n\nI'm glad you're holding up. I'm married with a kid now but thinking back I probably could've asked for more help/support back then... I just didn't realize it.",
                    "score": 12
                },
                {
                    "level": 1,
                    "comment": "This was devastatingly beautiful to read. I have no comment other than hand in there ❤️",
                    "score": 8
                },
                {
                    "level": 1,
                    "comment": "you express difficult emotions well, all the best. also, and this is just my ocd acting up, what’s the video game? my apologies, it’s just one of those things that will pick at me…",
                    "score": 2,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Path of Exile. I played it since open Beta in 2012 and it’s only gotten better. I still love it. it is very deep but at times not friendly to new players. They are announcing Path of Exile 2 on July 28 so that’s something I’m looking forward to. She knew how much I loved it and would set aside a full weekend for me on season launch so I could binge it haha",
                            "score": 8,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Reading your story especially the end made me think your game was Final Fantasy XIV Endwalker which came out at about the same time, because the words you say are almost the same as what we're told at the end of our story there [\"You gather pieces of happiness, precious and fragile, only to lose them. Then start again. On and on it goes, until death takes you into its gentle embrace\"](https://youtu.be/n2pYJl2c_S8?t=1104).\n\nI'm so sorry for your loss, wishing you the best! &lt;3",
                                    "score": 4
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I just got married and reading your story just makes me want to hold my wife and never let her go. I'm so sorry for your loss. You never know when someone is going to leave you.",
                    "score": 8
                },
                {
                    "level": 1,
                    "comment": "Sorry for your loss. I nearly lost my wife twice because of sudden medical issues so you have my sympathy and condolences.",
                    "score": 15
                },
                {
                    "level": 1,
                    "comment": "I'm really sorry this happened to you and her. Hang in there, buddy.",
                    "score": 16,
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This is gut wrenching. What a tragic loss.",
                    "score": 3
                },
                {
                    "level": 1,
                    "comment": "This really hurt me to read. I’m really sorry you had to go through all that. But, as you said, we get better at dealing with things as they happen to us. I hope the way you were dealt this trauma (and your wisdom) allows you the emotional intelligence to move on to greater things. Some of the most wonderful people I’ve met have had the most difficult lives. Sending all the good vibes your way.",
                    "score": 3
                },
                {
                    "level": 1,
                    "comment": "This post is the exact reason why I hope everyday that I die before my wife and kids. I've had a lot happen in the last few years and if I lost them I would immediately eat a bullet. Without them my life has zero meaning. I am so sorry for your loss but im glad you have been able to find happiness",
                    "score": 12
                },
                {
                    "level": 1,
                    "comment": "I’m so sorry for your loss",
                    "score": 12
                }
            ]
        },
        {
            "level": 0,
            "comment": "Absolutely not. I would never talk to them again. They are horrific people",
            "score": 80,
            "replies": [
                {
                    "level": 1,
                    "comment": "I can't believe I had to scroll this far down to find a post of not all lovey-dovey in-laws. Although mine aren't horrific, they are definitely not my favorite people in the world. I have little to no interaction with them now so having no interaction at all sounds wonderful.",
                    "score": 35,
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I can get behind this. I’m shocked by all the yes’s I’ve seen so far. \n\nI’ve had my MIL question my children’s paternity, my motives to being with him (he’s not rich or any other shallow reason people throw around), among other fun things over the years. \n\nWhile the MIL has mellowed a bit, it’s due to my ‘fuck you’ attitude. I won’t be pushed around and apparently, when you’re like my MIL it’s not fun when people match your energy. Who knew?",
                    "score": 3
                }
            ]
        },
        {
            "level": 0,
            "comment": "I genuinely can't stand my mother in law but she would deserve to see and spend time with her granddaughters.",
            "score": 514,
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I’m in the same boat.",
                    "score": 68
                },
                {
                    "level": 1,
                    "comment": "This is how I feel about my father in law. I like my husband’s siblings and some of his extended family. And my kids are already attached their their aunt, uncle, and cousins.",
                    "score": 28
                },
                {
                    "level": 1,
                    "comment": "I barely see them, but kids are not pawns, and I would be ok with them seeing them. (Supervised because my FIL is sketchy as shit)",
                    "score": 36
                }
            ]
        },
        {
            "level": 0,
            "comment": "Absolutely.  I have two kids under 10, and they are wonderful grandparents and aunts and uncles and cousins. Most live halfway across the country, but I would go out of my way to keep them involved in our lives.",
            "score": 236,
            "replies": [
                {
                    "level": 1,
                    "comment": "this, just one kid though",
                    "score": 17
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would. I like my wife's parents and extended family, and they'd certainly want to know how our son is doing. On top of that, my wife's side of the family is African-American, and I feel like my son should have some sort of connection to that heritage.",
            "score": 84,
            "replies": [
                {
                    "level": 1,
                    "comment": "I love this ❤️",
                    "score": 12
                }
            ]
        },
        {
            "level": 0,
            "comment": "depends if there are kids. When my mom passed, I'm thankful my dad maintained contact with her family, so I could grow up around them",
            "score": 124
        },
        {
            "level": 0,
            "comment": "I don't know. I really like my in laws and consider them family, but aside from  the fact that I married their daughter we have no common ground. I think hanging out with them would ultimately just be painful",
            "score": 25,
            "replies": [
                {
                    "level": 1,
                    "comment": "Thats what I am thinking. I would totally keep contact with them especially cause my nephews from her side would be even more confused if I wouldn't visit anymore and I love them but I cannot picture how you can continue life if you stay too close to them. \n\nHonestly, I wouldn't know what to do when my wife passed all of a sudden. Besides losing my grandparents when I was 18, I have never faced a tragic loss and have no idea how I would react.",
                    "score": 3
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe, but probably not. We don't have kids right now. The only one I would probably still speak to is her little brother, he's a good kid, and her parents are kind of crappy to him. Her sister and brother in law use him for free baby sitting and chores. His mom takes money out of his account to get her nails done and shit, and his dad is old school religious. When he comes to our house we let him relax and chill cause everyone else is constantly demanding things of him.",
            "score": 74,
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s horrible",
                    "score": 16
                }
            ]
        },
        {
            "level": 0,
            "comment": "My inlaws are amazing. I would expect to maintain a close relationship with them, but hopefully that never happens. My family isn't terrible, but I have felt closer to my marriage family than my own since we started dating.",
            "score": 105,
            "replies": [
                {
                    "level": 1,
                    "comment": "Man, the 3 years I’ve been around my wife’s parents has been IMMENSELY greater than the 20+ years I spent around my own parents, I totally understand how it is",
                    "score": 28
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve never actually met my in-laws so there would be nothing to maintain.",
            "score": 131,
            "replies": [
                {
                    "level": 1,
                    "comment": "Why?",
                    "score": 28,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My husband is an ex-Jehovah's Witness. Step out of line in that religion, including just by leaving it, get shunned. It's pretty vicious and I'm happy I've never met them, I would have **a lot** of words to say if I did, none of them kind.",
                            "score": 230,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah it's for the better",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Definitely, I have no space for abusive individuals in my life and my husband has grown *so much* away from their abuse.",
                                            "score": 19
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Similar situation with me. My GF has a mentally abusive mother growing up, and a father that left before she was born. If I ever meet that bitch of a mother in person, I'm probably gonna have the cops called on me with how much I'm gonna make her ass cry.",
                                    "score": 7
                                },
                                {
                                    "level": 3,
                                    "comment": "Sounds very familiar to my experience. I’m quite glad I haven’t met them, actually.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m sorry to hear you’ve experienced something similar. Some people really are disgusting and don’t deserve to know us, or anyone, for that matter.",
                                            "score": 3
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not passed away, but I got divorced almost 20 years ago and still see my former MIL and SIL when they're in town. And I stay with them when I'm in their town. Love them!",
            "score": 94,
            "replies": []
        },
        {
            "level": 0,
            "comment": "No. I hardly have any contact with them now.",
            "score": 54,
            "replies": []
        },
        {
            "level": 0,
            "comment": "When I got divorced, I couldn't WAIT to get the fuck away from her family.\n\nI miss my stepdaughters more than a drowning man misses air, but other than that, I can't wait to read the rest of their obituaries.",
            "score": 99,
            "replies": [
                {
                    "level": 1,
                    "comment": "Damn that's hardcore",
                    "score": 15
                },
                {
                    "level": 1,
                    "comment": "That's exactly why if I became single ever again l couldn't date a woman that has small children. Because I'd get super attached to them and if the relationship with their mother somehow fails I'd be in mourning.",
                    "score": 3
                }
            ]
        },
        {
            "level": 0,
            "comment": "Absolutely.\n\nI’m closer to them than I am my own family. \n\nIf my spouse died it would cripple me. My heart’s broken for anyone who’s had to go through that.",
            "score": 15
        },
        {
            "level": 0,
            "comment": "No fucking way",
            "score": 14
        },
        {
            "level": 0,
            "comment": "Not widowed but divorced. I made sure my son, who decided on no contact with his dad, kept in touch with his paternal grandma. Went to visit her at Christmas and her birthday, which  is more than my ex did. No reason why she should miss out on a grandson entirely, just because we were not together anymore.",
            "score": 13
        },
        {
            "level": 0,
            "comment": "No, they are beyond annoying",
            "score": 60
        },
        {
            "level": 0,
            "comment": "That would depend on my relationship with them while my spouse was still alive.",
            "score": 70,
            "replies": [
                {
                    "level": 1,
                    "comment": "I would say this hits pretty close to my thoughts. We have kids too and their relationships with their grandparents, aunts and uncles and 8 cousins on that side of the family shouldn’t be severed. Same thing if something happened to me and our kids’ relationships with my side of the family. My wife and I have been together well over 25 years at this point so that’s certainly a factor too.",
                    "score": 11
                }
            ]
        },
        {
            "level": 0,
            "comment": "Today is actually my 5-year angeliversary\n\nI do keep in contact with her family, they have been my family for 19 years before she passed away. They are still my brothers and sisters\n\nThey are still my children's aunts and uncles, and grandmother.\n\nI still love them like I always have.",
            "score": 46
        },
        {
            "level": 0,
            "comment": "I probably wouldn't ever talk to them again.",
            "score": 60
        },
        {
            "level": 0,
            "comment": "Not much of one. Except for my wifes siblings, we rarely see the nephews and nieces. My 2 BIL's and SIL, we only see a couple times a year, usually one holiday or another, and a summer BBQ. \n\nIf my wife passes away, the funeral would probably be the last time I'd see any of them. Our son and his family see's them less than I do, so there wouldn't be a big draw to continue.",
            "score": 8
        },
        {
            "level": 0,
            "comment": "I would, they are fairly nice and I would still want them involved in our kids (their grandkids) lives",
            "score": 10
        },
        {
            "level": 0,
            "comment": "My ex - no way!  First time meeting my former MIL she told me to stop trying to take away her son from her.  They only cared about him and I was just used goods.\n\nCurrent hubby - yes!  The whole family is amazing and loving.  I can text MIL or FIL or SIL.  They can see how we help each other out.  No tests or tricks.",
            "score": 11,
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel the same way about my in laws as you do about your current in laws, I love how accepting they are, and they really are amazing, I’m glad you found such a wonderful family",
                    "score": 5
                }
            ]
        },
        {
            "level": 0,
            "comment": "No. My ilaws are intrusive, overbearing, and manipulative. I would cut ties immediately. The fil Braggs about how he \"works\" people to use them. Every encounter is a struggle to be polite.",
            "score": 9
        },
        {
            "level": 0,
            "comment": "I would prefer not to, but I would have to because of my son.",
            "score": 11,
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah same, I don’t really along with my inlaws, but if their child just passed then I’d keep in touch so they could see their grandson",
                    "score": 5
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes. My husband and I  have 3 adult children... And I have really no parents.  I had a mom. She died 28 years ago. But I do not have a relationship with my dad. Never really have. Even when my husband and I almost divorced at one point they were still very good to me. And most importantly they are wonderful to my children.  Even though they are 77 and 79....when they found out our daughter was a lesbian they couldn't wait to meet her girlfriend.  When our son was little and took forever to warm up because he has ASD...they were patient and kind.  They are just good people.  They are not my parents and we don't have that relationship...but I respect them as my kids grandparents.  And they appreciate all I do for my husband.  He had two strokes a few years ago. After we had some tough years. He has a lot of health issues now. But they appreciate that I take good care of him. We have a very honest relationship between me and them.",
            "score": 10
        },
        {
            "level": 0,
            "comment": "I would totally cut them out of my life. They are horrible people who think only of themselves. They've ruined every holiday, birthday and special occasions where I've included them. This is my 2nd marriage and I'm closer to my 1st in laws then these posers. I only tolerate them occasionally for my husband but basically I avoid them now.",
            "score": 41,
            "replies": [
                {
                    "level": 1,
                    "comment": "How did you do this? \n\nI’ve been separated from my ex-husband for two years in December. His family was… not great. And it sucked. It was really hard to have in-laws that just weren’t good people, that weren’t kind, that didn’t feel like an extension of family to me. Whether or not I’d take his last name was a big fight for us, and I returned to my maiden name pretty quickly. \n\nMy partner’s parents are amazing. He brought me “home” for the first time in February, and they’re like… the single nicest family I’ve ever met. I’ve told them both that they’re like lottery in-laws. They’re the kind of family you dream of being welcomed into when you think of marrying someone. \n\nHow did you go in the opposite direction? How was it not a deal breaker? I don’t think I could ever do the monster in-laws again if my life depended on it.",
                    "score": 5
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes, we’re living in their basement and I’m pregnant with their grandchild. Also, my parents are on the other side of the country and my in laws have brought me in as their own daughter. Pretty sure my MIL likes me better than her own son lol",
            "score": 22,
            "replies": [
                {
                    "level": 1,
                    "comment": "I joke to my wife that I’m her parents’ favorite child 🤣🤣 it’s great being loved so much by people who came into your life like this",
                    "score": 10
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nope, fuck them fuckers",
            "score": 24,
            "replies": [
                {
                    "level": 1,
                    "comment": "Here here!",
                    "score": 3
                }
            ]
        },
        {
            "level": 0,
            "comment": "Probably not, her parents live 2 states away and I get the feeling they really don't like me but are never mean about it. We have a 1 year old right now so I would want her to still maintain a relationship with her grandparents but that would probably only consist of Facetime calls and an invite out to her birthday every year. I know for a face I would never set foot back in their house tho if my wife died",
            "score": 6
        },
        {
            "level": 0,
            "comment": "Absolutely, I love my in laws, they’ve personally helped me so many times, I honestly don’t know where I’d be without them, when my wife and I were still in the talking stages before we officially started dating, I had gotten kicked out of the place I was living, in the middle of winter, they had no clue who I was, but after my wife asked if I could stay with them for a few days, they immediately agreed, I owe them so much I can never hope to repay, any and everything they need help with, I immediately agree to help. Honestly I feel I’d probably be dead if not for these wonderful people",
            "score": 6
        },
        {
            "level": 0,
            "comment": "Truth be told, no. They would probably remind me too much of her and would only make things worse for me. If it provides them some kind of solace, sure, I’ll keep in touch. But for me? Not likely.",
            "score": 19,
            "replies": []
        },
        {
            "level": 0,
            "comment": "Nope. I got lucky...inlaws were dead before we were married. Poor husband on the other hand had to deal with my toxic, insane blood relatives...for a while. We actually cut all of them out about 4 years into the marriage when he discovered I wasn't exaggerating about how bad they were",
            "score": 30,
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m sorry to hear that, I hope your marriage continues to grow stronger",
                    "score": 7,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I couldn't hold it against my husband, he's the guy who will help anybody. He really did not understand why I said helping this family was a terrible mistake. He learned 🤣\nThanks for the wishes, we celebrated 42 years last month 😊",
                            "score": 12,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s awesome congratulations",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "As I’m scrolling through this thread, there is lovely message after lovely message from you. Just writing to say that you seem like a sweetheart.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you so much, I just like to spread as much love as possible",
                                                    "score": 6
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "100% \nI adore my inlaws. They are the best people I have ever met, genuinely kind and loving people with no agenda. \n\nI have no relationship with my own family and my inlaws have been amazing at taking me under their wing and ensuring I still feel family support.",
            "score": 7,
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yes, because I won’t deprive my kid of a relationship with her grandparents, if she decides she doesn’t wanna be around them when she’s older that’s her decision.",
            "score": 6
        },
        {
            "level": 0,
            "comment": "Yes. My mother in law is also our neighbor…",
            "score": 4
        },
        {
            "level": 0,
            "comment": "Absolutely! One, I love my in-laws they’re fantastic people. Two, I have a young son, and I’ll be damned if I would ever deprive him of two people who love him more than anything",
            "score": 5
        },
        {
            "level": 0,
            "comment": "My wife died in 2020. Her mom, who lives in another state, called me a lot at first. My wife was her main emotional support person and I think she was trying to replace her in that role with me. But thankfully that faded over time, now we basically just text a bit around holidays, birthdays, death date, etc.\n\nHer dad died before I even met her so no contact there obviously. I like her dad’s side of the family a lot and have talked to them some but they live halfway across the country so not really much of a relationship there.\n\nHer brother is in prison and has been the whole time I knew her so I hadn’t spoken to him much. We wrote a couple letters back and forth the first few months but that didn’t last long.\n\nI went no contact with her abusive sister very quickly and hope to never see her or speak to her again.",
            "score": 5
        },
        {
            "level": 0,
            "comment": "My dad, not me. Even though my mom has been gone over 3 years now, we are still close with a few from her side of the family. Her youngest brother flies out every summer to spend time with us, and even though my dad grumbles a bit about it we always have a great time. I don’t think he had ever considered fully cutting contact.",
            "score": 4
        },
        {
            "level": 0,
            "comment": "Absolutely not. There would be no reason to.",
            "score": 5
        },
        {
            "level": 0,
            "comment": "I divorced my husband, I still take the kids all the way to Europe to visit her every year from Australia. She’s the textbook grandma and they absolutely adore her.",
            "score": 3
        },
        {
            "level": 0,
            "comment": "My aunt died of cancer in 2009, and I’m grateful her widowed husband is still in my life. He’s family and I love him",
            "score": 6
        },
        {
            "level": 0,
            "comment": "Bearly ever spoke them in 20 years.   Wife talks to them daily.",
            "score": 4,
            "replies": []
        },
        {
            "level": 0,
            "comment": "Haha absolutely not.\n\nLost a pregnancy at 20 weeks. The weekend I lost it, SIL called my husband asking if she *had* to talk to me (husband said to leave me alone for for the first few days). My birthday was 2 weeks later - she sent me a champagne picnic basket.\n\nThen 2 weeks after that she texted me telling me what she was up to the weekend I lost my pregnancy. I mentioned oh yea, that was the weekend I lost a wanted baby and she just ignored it and went on about what she did, ending the conversation with a giggle emoji.\n\nMIL defended her actions saying the champagne was just a mistake and SIL just didn’t know what to say at the time. Excuse you, an insincere “I’m sorry for your loss” would’ve been the bare minimum. But apparently I should be the bigger person and understand SIL’s perspective.\n\nEdit - I guess I should clarify. SIL was given a chance to right this wrong by just apologizing. Instead she told my husband she’s done nothing wrong and has nothing to apologize for. So we are NC with her and LC with my MIL. I expect in 4-5 years time we will also be NC with MIL for reasons that I won’t elaborate here.",
            "score": 40,
            "replies": [
                {
                    "level": 1,
                    "comment": "Fuck that shit, if people are shitty to you, it’s totally ok to cut them the fuck off, I’m honestly sorry for your loss, I’ve been there twice with my wife, before we were married, it seriously hurts like hell, I hope you’ve since had many strong, beautiful babies",
                    "score": 10,
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Tell them to fuck themselves in text, block them, and go NC. You don’t need these assholes in your life. Sorry for your loss.",
                    "score": 3
                }
            ]
        },
        {
            "level": 0,
            "comment": "My wife died when our boys were 1 and 3.  There was no way I would be cruel enough to keep them from their grandparents.  Simple as that.  And having both sets of grandparents available to give me a break every once in a while was also quite handy.",
            "score": 12
        },
        {
            "level": 0,
            "comment": "No.  But both of my in-laws died in the last 5 years.  80's and 90 something years old.",
            "score": 17,
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m sorry for your loss",
                    "score": 7,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you.",
                            "score": 3,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You’re welcome… btw I love your username, my last name is Gregory lol",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same.",
                    "score": 3,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've always gotten along with her parents from the start in 77.",
                            "score": 6
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe initially. I like them ok, but I don't have a super strong relationship with them to begin with. We don't have kids so there would be no real need to maintain a relationship.",
            "score": 4
        },
        {
            "level": 0,
            "comment": "I sincerely doubt it. \n\nWith a few exceptions, (I can literally count on one hand) the people in her family are mostly assholes that I don’t get along with because after I came in the picture as her boyfriend, I don’t tolerate them treating her poorly. \n\nI personally witnessed her own brother literally turn his back and ignore her when she pleaded for help. And that’s just one example.\n\n\nHer Dad is a good guy, so is her younger brother, one of her older sisters was my friend before I met my wife (funny story) and her boys think of me as the cool uncle. I’ll always talk to them, but the rest are going to be fortunate if I even let them into the funeral home.",
            "score": 4
        },
        {
            "level": 0,
            "comment": "I don't think so. Our kids are grown and can maintain a relationship with them if they wish, but honestly they are not close to their grandparents.  \n\nFor me, I occasionally see them now because of my spouse, but they are very very different from me, and our values do not align.  They would not be my choice to keep in touch with.",
            "score": 3
        },
        {
            "level": 0,
            "comment": "HELL NO. We moved almost a thousand miles away from our home town. They were one of a small number of reasons... Always on the crazy end of right wing political BS, now QAnon hook line and sinker. Visits are fun.",
            "score": 4
        },
        {
            "level": 0,
            "comment": "Absolutely not with the exception of one or two people.  And my wife is probably reading this and I bet she doesn't blame me!",
            "score": 3
        },
        {
            "level": 0,
            "comment": "Nope! We’ve been married 15 years; they still call me “the foreigner” because I’m not Lebanese. They don’t acknowledge that our son has special needs and asked my husband why he didn’t want a child who looked more like him. If my husband passed - there would be no reason to keep in touch.",
            "score": 4
        },
        {
            "level": 0,
            "comment": "My spouse died, and I still am in contact with my in-laws. They are lovely people.",
            "score": 4,
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry to hear that.  I am in the same stinking club.  I am out visiting her family (they live 1,030 miles) away for the month as my great niece got married this past weekend. \n\nIt sucks what happened - but if I did not have these folks, or my family it would suck even more.",
                    "score": 3,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m sorry you’re in this lousy club, too.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not yet married, but engaged. I would probably maintain a relationship with my future brother-in-law, but not my future MIL and FIL. My future MIL and FIL are overall decent people, but their backwards views on same-sex marriage have given my fiancée a lifetime of grief and confusion. I know that her parents believe she's going to hell for being gay and if my fiancée passes away before me and her parents, I don't think I would be able to overlook that just to maintain appearances.",
            "score": 25
        },
        {
            "level": 0,
            "comment": "Yes. Someone needs to watch these dang kids while I’m out trying to find a new wife.",
            "score": 7
        },
        {
            "level": 0,
            "comment": "Depends on the relationship with them. If they actually treat me like I became their child, and in a manner similar to my own actual parents (like how I know my own parents would treat my spouse). Then absolutely. Especially if children are in the mix also and they want access to their grandchildren. If they treated me like I was just that person that happened to also be in a relationship involving their child, then no.",
            "score": 3
        },
        {
            "level": 0,
            "comment": "Most definitely.  We have 2 kids and they absolutely adore their grandparents and their grandparents dote on them so much, it would be pretty cruel for both parties if I didn't maintain a relationship.  I actually really like them too for the most part and I don't have a super close relationship with my own parents so I would want them to stay in our lives.",
            "score": 3
        },
        {
            "level": 0,
            "comment": "Yes. I would want our kids to still have a relationship with her parents. I also love them and We have our own relationships we have built. I Couldn’t imagine just not talking to them anymore especially after something as devastating losing my wife/their daughter.",
            "score": 3
        },
        {
            "level": 0,
            "comment": "Yes cause they love and care for their grandchildren, which is more than I can say for their daughter/my ex-wife.",
            "score": 3
        },
        {
            "level": 0,
            "comment": "Wife’s family all live over the Atlantic from me or in India but I’m very close with them and massively enjoy their company. \n\n100% I’d carry on just like I do now",
            "score": 3
        },
        {
            "level": 0,
            "comment": "Not married, but I have a long-term partner (over 20 years).    I wouldn't keep in contact - we aren't close, my only current contact with them is through my partner (I don't call or text them myself), no kids.    I wouldn't have any reason to maintain a relationship with them.",
            "score": 3
        },
        {
            "level": 0,
            "comment": "Maybe, they live in the same town as me. I wouldn't with my father in law, i barely see him like 4 times a year as is and he has the emotional range of a slug, so i don't really care for him. My mother in law is nice though. But she's very religious whereas i am very not. I think she might find comfort in gods arms with a passing of her daughter whereas i would never and would probably seek psychological council to cope with the loss.",
            "score": 3
        },
        {
            "level": 0,
            "comment": "ABSOLUTELY. \n\nI’ve got two wonderful in-law parents, two brilliant sisters-in-law and both of their husbands. I share so so much in common with all of them and maintaining my close relationship with them keeps me close to my spouse, should the unfortunate occur. \n\nThey’re the family I got to choose and they will forever have a place in my life.",
            "score": 3
        },
        {
            "level": 0,
            "comment": "No because we currently don't.",
            "score": 3
        },
        {
            "level": 0,
            "comment": "They might start a foundation in their name so I have to maintain a relationship",
            "score": 3,
            "replies": []
        },
        {
            "level": 0,
            "comment": "Death or no death. It just depends on how good they are as people and how they treated you. I dated a girl from 19-23 and I'm currently 34 and still in contact with them. She's been married, divorced, now engaged, and her mom and dad still wish me a happy birthday every year.",
            "score": 3
        },
        {
            "level": 0,
            "comment": " Yes, I have given birth to their grandkids and they deserve to be in contact with them.  It also helps that they are the sweetest people I have ever met.",
            "score": 3
        },
        {
            "level": 0,
            "comment": "Nope. My mother in law told me I’m going to hell because I haven’t been saved 🙃 and she’s made disgusting comments about how she said my husband was still in love with his hs sweetheart. All because he was checking in with her when she had terminal cancer and I’m not going to tell him no it was sweet he cared enough to check in with her.",
            "score": 3,
            "replies": []
        },
        {
            "level": 0,
            "comment": "I already know the answer to this through past experience.\n\nIt's a no from me. The reason is because when I experience loss, my very first step is hard distance from any and everything that involved that lost loved one. I lost my boyfriend and went no-contact with all of his family and friends immediately after because I couldn't handle it. We had been together 2 1/2 years. I lost him in a motorcycle accident that we were both a part of. When I was discharged from the hospital, I went radio silent for 3 whole years with everyone but my own mother.\n\nI know that if I lost my husband, who I just married this past memorial day weekend, I wouldn't be able to hold contact with his family or friends either. I need space to grieve and work through it all. Other people find comfort in memories and sharing stories. I find pain and heartbreak instead.",
            "score": 3
        },
        {
            "level": 0,
            "comment": "Absolutely not, my girlfriends family lives in another state",
            "score": 11
        },
        {
            "level": 0,
            "comment": "I would. I love them and they’re good grandparents",
            "score": 4
        },
        {
            "level": 0,
            "comment": "Nope!  \nHer family is a bunch of self-righteous, double-standard, MAGA assholes.  \nI wouldn't talk to them now if I didn't have to.",
            "score": 7,
            "replies": []
        },
        {
            "level": 0,
            "comment": "Definitely, they're practically my parents now too",
            "score": 3
        },
        {
            "level": 0,
            "comment": "not if they killed her",
            "score": 4
        },
        {
            "level": 0,
            "comment": "No, but only because they are dead.",
            "score": 2,
            "replies": []
        },
        {
            "level": 0,
            "comment": "We have a kid, so definitely.",
            "score": 2
        },
        {
            "level": 0,
            "comment": "I would",
            "score": 2
        },
        {
            "level": 0,
            "comment": "My brother in laws would be trying to hook me up. \n\nMy wife is their only sister, so we get along pretty good.",
            "score": 2
        },
        {
            "level": 0,
            "comment": "Yep, I like them a lot.",
            "score": 2
        }
    ]
}