{
    "id": "148f373",
    "score": 540,
    "title": "What screams \"insecure\" in a person?",
    "author": "Joeyniles9",
    "date": 1686661739.0,
    "url": null,
    "media_url": null,
    "comments": [
        {
            "level": 0,
            "comment": "body language can be a giveaway. Also, 'one-uppers'.",
            "score": 737,
            "replies": [
                {
                    "level": 1,
                    "comment": "If you went to California, they went to Califivenia.",
                    "score": 398,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A nice twist on the \" if you went to Tenerife they went to Elevenerife\"",
                            "score": 154,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I've always known it as \"If you've been to Timbuktu, they've been to Timbukthree\"",
                                    "score": 125,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You went to Taiwan? Well they went to Taitwo.",
                                            "score": 42,
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That rolls off the tongue best, I like it",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You've got forearms? He's got fivearms!",
                                                    "score": 5
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Well screw you I went to Calififtynia 😎",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh god, that just gave me PTSD. I had a \"one-upper\" as a girlfriend at one point. It was fuckin maddening.",
                    "score": 56,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, well I had a two-upper for a girlfriend.",
                            "score": 111,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "One time I was dating 2 girls at the same time that were 3-uppers. That's like 6 uppers bro.",
                                    "score": 40,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What's an one upper?",
                            "score": 14,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's when you tell a person something, they try to one-up it. So if you tell them something that happened to you that was good, they'll tell you something that is \"better\". If you had something bad happen to you, they'll have something \"worse\". \n\n Basically Kristen Wiig's character on SNL called Penelope.",
                                    "score": 68,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The only time i ever one-up is if were dealing with crazy shit and i have a story that relates and in the context of the convo ill be like alright sorry i gotta one up ya on the this one (only with people im close with and know that im not doing it maliciously of course and of course giving them time to finish the whole story) \n\nMost recent example is me and some buddies were at the bar and one guy was talking about how cops were all over his street today and i was like dude theres no way we had full riot police and a mobile intelligence centre suiting up at my park today it was nuts",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's just normal/relevant conversation. That's to be expected.  A true one-upper will find a way to do that in damn near every conversation and you can never just have your own story or whatever.",
                                                    "score": 21,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Of course, not be confused with someone just trying to share a similar experience. There's a difference, and it's pretty noticeable.",
                                            "score": 7
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "*You’re taking five classes this semester; they are taking six*\n\n*You only get six hours of sleep; they only get five*\n\n*You have a part time job after class; they have two part time jobs and they volunteer*\n\n*You have a cold; they have strep plus a blown knee*\n\n*You went to X school; they went to X plus Y to get a credential*\n\n*You graduated in three and a half years; they technically graduated in three years but did one semester abroad to teach English*\n\nNo matter how good you do, they do it better. \n\nI actually met a girl like this. My coworker brought a date to a happy hour and she “was a PhD and doing residency while sitting on an advisory board of her third tech company” according to her. \n\nNo matter what you said, she had her own personal story of doing that but better. \n\nYou ski double black diamond? She got bored of skiing public resorts and now does helicopter skiing. \n\nYou do database stuff? She got a triple major in her undergraduate, one of which was doing database stuff for IBM. \n\nShit like that.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I hope you could get one up.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I had a coworker who was fucking awful to me. We didn’t get off on the right foot but I tried to be cordial to her in order for a nontoxic work environment. But to no avail. She was also in a higher position than me but not technically my supervisor.\n\nOne time it was our break period and she was talking to another coworker (who was actually a sweetheart) about her classes and I guess one of them was a debating class of some sort. She mentioned that the class was really intense but she always was the best at it in comparison to the other students. In my mind I was like “You’re almost 30 and bragging about how you’re the best in a community college debating class. That’s fucking pathetic.”\n\nIt took me a while to realize that she was probably a miserable and insecure person and I was just an unfortunate target for whatever reason (I have my personal theories but I digress). If you’re reading this Divina, get fucked! Also get therapy.",
                    "score": 50,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh wow, you met my mother's long lost twin. She went to college in her 40's, and was constantly in competition with everyone over it. I was in 6th grade when she started, and at the end of every semester (my school's schedule was similar) she would compare our grades and be like, \"Well I made all A's and I'm in college, so what's your excuse?\" I remember once being like, \"I'm 11 years old and algebra is new for me??\"\n\nLooking back, that was one of the more pathetic things I've seen in my life. I do not understand grown adults who want to be competing over grades and stuff. It's so dumb. They need to just get theirs and be happy with it like everyone else does.",
                            "score": 21,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "When my younger cousin got her results from the high school entry exam, she was very excited because her results, 110/128, guaranteed entry to any school she wanted.\n\nMy older cousin said \"I'm sure I could get better results\" to which the younger one answered \"I'm sure, but you're already twice my age and halfway through med school.\"",
                                    "score": 8
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Got off on the wrong foot?  Did you not hear her whisper 'hi' when being introduced to the whole office and she never got over the snub?\n\nI don't get those instant grudge for life women.  I want to know what's going on in there.",
                            "score": 8
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "ahh. I think I may have been a 'one-upper' for a lot of my younger years.  \n\nI thought it was a way to relate to the speaker, but turns out there were underlying insecurity issues that manifested all weird.  \n\nThank you therapy and weed.",
                    "score": 8
                }
            ]
        },
        {
            "level": 0,
            "comment": "Badmouthing others constantly.",
            "score": 846,
            "replies": [
                {
                    "level": 1,
                    "comment": "Major sign.",
                    "score": 74,
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "And feeling the need to bully and judge and criticise other",
                    "score": 25
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not apologising ever\n\nSome people will embellish the truth, alter the course of events, and retell the tale so convincingly that you'll accept their gibberish, but they'll never offer an apology.",
            "score": 345,
            "replies": [
                {
                    "level": 1,
                    "comment": "toxic insecure people do this, as someone insecure myself, all i ever say is sorry lol",
                    "score": 69,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"Don't say sorry. Say thank you.\" \"Right, sorry.\"",
                            "score": 17
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I feel like this also goes into “can’t ever be wrong”. They can’t be wrong, can’t be the bad person in a situation, etc. Being secure in yourself means you can recognize when what you did/said was bad, you apologize and mean it, learn from it, and take responsibility.",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Always trying to one-up other people when sharing stories.",
            "score": 169,
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree, but I've also seen people fail to differentiate between \"oh! I have a similar story!\" and one-upping. A lot of autistic folks get accused of \"one-upping\" when they're just trying to \"me too! we have a thing in common!\"\n\nSo if you think someone is one-upping, it could be insecurity or it could just be a social skills issue.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Being unable to admit that you were wrong/made a mistake",
            "score": 56
        },
        {
            "level": 0,
            "comment": "Caring too much about what other people think about them",
            "score": 517,
            "replies": [
                {
                    "level": 1,
                    "comment": " Memphis Black rapper.",
                    "score": 19,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "lol any drill rapper. they are killing each other over nothing",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Elaborate?",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Posts everything they do online",
            "score": 233,
            "replies": [
                {
                    "level": 1,
                    "comment": "I knew a girl like this. Hate to say it but she didn't have anything better to do.",
                    "score": 31,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She had nothing to do, so she constantly posted online that she wasn’t doing anything?",
                            "score": 10,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Pretty much. She was one of those people perpetually in school, dad paid for everything, never had a job, finally got a job but hated it, never had hobbies and only seemed to like to post on social media about what she did, which wasn't much, or politics.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Having to be the center of attention 24/7 when you are over 8years old.",
            "score": 304,
            "replies": [
                {
                    "level": 1,
                    "comment": "Also how a grown adult does their birthday.\nLike damn Sarah, you're 37, you need a crown, a sash and servers to sing to you with a candle cake? For your birthday *month* ? Grow up.\n\n(People who have birthdays after serious illness or traumatic years get a 100% pass to wild out though. You beat cancer? You survived an awful accident? I crown thee birthday royalty!)",
                    "score": 171,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I died on my 18th birthday but got resuscitated. I’m 29 now and every birthday I have I celebrate bc I was legit dead and came back. 🤷🏻‍♀️",
                            "score": 21,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nothing wrong with this.\n\nThis isn't drunk woo girl behavior where you pout if there's no free cake or free shots at a restaurant.\n\nKeep celebrating your triumphant return to this plane :)",
                                    "score": 11
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Completely agree. I’ve got a coworker that actually had a registry and a black themed birthday party because she was turning 30 and over the hill now. \n\nMeanwhile I just turned 20 and if my mom hadn’t thought to make me some cupcakes I wouldn’t have worried about it. I almost forgot actually.",
                            "score": 40,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "40 is over the hill and hol up, a *registry* ? For their birthday?  What on earth is that narcissist nonsense, I mean I get it for weddings or first babies but a birthday? Queeeennnnn pleaseeee......\n\nI hope I don't come off as having a black themed everything-- it's just my go to color and I'm a spoopy lady by nature.",
                                    "score": 26,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Always trying to prove you're better than the people you hate or dislike.",
            "score": 128,
            "replies": [
                {
                    "level": 1,
                    "comment": "This is a huge one people don’t often talk about. If you’re secure in yourself, you feel like the qualities in the people you dislike speak for themselves. When you’re insecure, you’re constantly trying to show people how you don’t have those qualities and you don’t do this or that and *look at me, me, me.* Especially if the group they dislike is their own demographic.",
                    "score": 24,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;the qualities in the people you dislike \n\nKinda related: If I don't like someone bc of their qualities (qualities that aren't of any real negative consequence to others) I think really hard about why and how much I relate to having those qualities.\n\nLike a decade or so ago I would eyeroll so hard at name droppers when I was, in fact, a name dropper. when that shit dawned on me I was like hm. welp. I feel fckn stupid.. \n\nNow I check myself a lil when someone's inconsequential characteristics rub me the wrong way. It's sometimes amusing but sometimes it's so cringy how blind I can be to my own bullshit lol",
                            "score": 19
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Anyone who claims to be an \"alpha.\"",
            "score": 39,
            "replies": []
        },
        {
            "level": 0,
            "comment": "Couples with a shared social media account",
            "score": 390,
            "replies": [
                {
                    "level": 1,
                    "comment": "That usually means somebody cheated. LOL",
                    "score": 217,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Either that, or they’re very old and can barely use a computer.",
                            "score": 73,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why not both",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Grandma doesn't know to use a computer, but can work a hog like no other.",
                                            "score": 34,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "When a guy goes on and on about how much his family is his life and how much he misses them (if said on camera).\n\nThere's always something shady going on.",
                            "score": 10
                        },
                        {
                            "level": 2,
                            "comment": "Or someone is possessive",
                            "score": 10
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Seems to be the death knell of the relationship in my anecdotal experience",
                    "score": 26
                }
            ]
        },
        {
            "level": 0,
            "comment": "Repeatedly opening every thread about \"what screams insecure\" on askreddit, scanning every comment and finding a way to make it about you.",
            "score": 279,
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm feeling really judged right now.",
                    "score": 63,
                    "replies": [
                        {
                            "level": 2,
                            "comment": " Making jokes that lift themselves up rather than self deprecating jokes.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I was about to say.. I'm feeling personally attacked over here XD",
                            "score": 3
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You just saved me scrolling through all the replies to know I'm one",
                    "score": 8
                },
                {
                    "level": 1,
                    "comment": "Is this me",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cannot spend any time alone",
            "score": 233,
            "replies": [
                {
                    "level": 1,
                    "comment": "After my divorce, and being an empty nester after having 6 kids, I have a hard time being alone. At first it was like breathing fresh air for about a week or two, then the lonliness set in. I hate it",
                    "score": 17,
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Kind of a tricky one. I know some BIG TIME extroverts who feel drained from spending time alone. Hard for me to grasp as I like if mix of time with friends and time alone to feel fully energized/myself.",
                    "score": 56,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's codependency!",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm insecure. Do people think that being insecure is an intentional negative trait?",
            "score": 230,
            "replies": [
                {
                    "level": 1,
                    "comment": "No.  You can be insecure and a good person, and you can also be insecure and reactive and lash out to people.",
                    "score": 26,
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Yeah idk bro this new trend of treating insecurity like a toxic or bad trait is kinda nasty. Insecurity often links back to trauma or something,  it by no means makes someone an undesirable person",
                    "score": 227,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think it's that some people handle their insecurities badly and it results in toxic traits, so people think toxic=insecure",
                            "score": 41
                        },
                        {
                            "level": 2,
                            "comment": "Everyone is insecure in their own little ways. It’s perfectly healthy to have a little insecurity.",
                            "score": 23
                        },
                        {
                            "level": 2,
                            "comment": "seen more toxicity in people with confidence than insecurity. I find insecurity to be self damaging mostly whereas confident and over-confident can be pretty mean",
                            "score": 71,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Many times though that toxic confidence or arrogance is a mask for their insecurity and that's where a lot of people find the negativity in it. \n\nYou don't speak up in a party because you're insecure about how people judge you? Totally understandable and relatable, you shouldn't feel bad about that in the slightest. You yell a lot and treat people like shit and claim to be an alpha because you're insecure in yourself? Fuck off Chet.",
                                    "score": 17
                                },
                                {
                                    "level": 3,
                                    "comment": "I’ve seen toxicity in arrogance more than insecurity. Insecurity can manifest in ugly ways but some of the comments in here are ridiculous. \n\nLike “not wanting to be alone” is a sign of insecurity now?",
                                    "score": 17,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think people think that if you're insecure that means you're a bad person who wants to harm others but it's a misconception because a lot of us are internalizing it",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "A lot of the comments in this thread is what a lot of normal, flawed people do.",
                            "score": 5
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "insecurity often manifests itself outwardly as arrogance or hostility towards people it perceives as threatening or superior. I don’t think people think it’s intentional but the outward version this thread is discussing is a very negative trait that should be recognized and called out. theres also insecurity that can be shyness or indecisiveness which I don’t think too many people have as much of a problem with.",
                    "score": 18
                },
                {
                    "level": 1,
                    "comment": "Honestly bro it depends on the insecurity. If you’re insecure you’re not good enough for your girl, and it consequently makes you jealous and maybe overprotective. Then yeah it can be bad trait that should be quickly overcome.",
                    "score": 7
                },
                {
                    "level": 1,
                    "comment": "I feel like your own insecurity hurts you more than anyone. Feeling like you can't connect with others, so you skip events you're invited to, which furthers your disconnection with others. Or not trying out new things because you tell yourself you've failed before you've even tried.",
                    "score": 6
                },
                {
                    "level": 1,
                    "comment": "Not necessarily a negative trait. Depends on how you let it show though. I get that insecurity can stem from social anxiety and that's perfectly valid, but the moment you try to drag down others, manipulate people through pity, prove to everyone how great you are constantly, or others, then yeah it's outwardly negative. If not, it's just bad for you but that's perfectly fixable.",
                    "score": 11,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sounds more like narcissistic personality disorder. Not related to being insecure. I think people are becoming increasingly agressive towards people with mental health issues. If someone is feeling insecure it probably means they need their friends and family to let them know how valued they are. Seems odd to run people further down.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "People suck. That's all that boils down to.",
                    "score": 3
                },
                {
                    "level": 1,
                    "comment": "Yes, and you should feel bad about it /s",
                    "score": 3
                },
                {
                    "level": 1,
                    "comment": "Lmao every single person is insecure about something.  What most people are describing here is just straight up narcissism.",
                    "score": 15,
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Depends whether you take it out or impose it on others. I’ve known some insecure people who do a variety of things, like demand constant reassurance, project it onto others (“I’m insecure about this and I’m making it your problem”), get angry when they feel insecure, etc. that’s a problem. Having insecurities is very normal and not inherently bad. It’s bad when you let it take over your life and how you interact with the world and those around you.",
                    "score": 6
                },
                {
                    "level": 1,
                    "comment": "“Insecure” is one of those words or phrases that kind of lost all meaning on social media, like “narcissism” or more recently “woke”\n\nAt this point it just means someone who does something we don’t like.",
                    "score": 6,
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Now imagine if a person had trauma growing up and became insecure because of it. Now everyone will try to stay away from you or ignore or treat you different because you are negative. That's pretty sad so now that insecure individuals life is all messed up for like and nobody is willing to help them",
                    "score": 9
                }
            ]
        },
        {
            "level": 0,
            "comment": "Always talking about how great you are",
            "score": 86,
            "replies": [
                {
                    "level": 1,
                    "comment": "Old friends of mine would always go on and on about how hot they are. I mean it wasn't as if they were unattractive but they sure felt entitled to their bragging rights.",
                    "score": 6
                },
                {
                    "level": 1,
                    "comment": "Like the other person or talking about themselves?",
                    "score": 3,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was thinking about themselves when I wrote that but now that you mention it if someone is constantly praising you there’s a possibility they’re either insecure or trying to scam you somehow. \n\nOr they love you in which case congratulations!",
                            "score": 4
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sometimes I refer to myself as FIGJAM in a mocking way when I’m around friends.",
                    "score": 3
                }
            ]
        },
        {
            "level": 0,
            "comment": "Always needs a crowd, even in their dreams.",
            "score": 12
        },
        {
            "level": 0,
            "comment": "Anyone that uses the term Alpha male seriously.",
            "score": 12
        },
        {
            "level": 0,
            "comment": "Worrying too much about what others think not wanting to change because of fear of being perceived as stupid or cringy. Purposely changing behavior and actions to try to be like others",
            "score": 49,
            "replies": [
                {
                    "level": 1,
                    "comment": "Me most of my life. Turned 40 and stopped caring. No idea why. Maybe I woke up and realized I'm about halfway through my life and might as well enjoy it with the people I really love.",
                    "score": 12,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I feel blessed to have turned the corner on this at age 27. Best thing I could’ve done for myself.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think this is unfair only because some people really want be in relationships but can't seem to form them.  After so many failed attempts there's really only 3 outcomes, defeated and no longer caring what people think (not the stoic \"I'm fine with myself\" variant), becoming so paranoid every little thing they do will piss off someone that's actually talking to them it's almost paralyzing, or copying someone that seems to be exponentially more successful at it.",
                    "score": 3
                }
            ]
        },
        {
            "level": 0,
            "comment": "That weird fake overconfidence",
            "score": 28
        },
        {
            "level": 0,
            "comment": "One ups manship.\n\nIf you've been to Tenerife, they've been to Elevenerife.",
            "score": 72,
            "replies": [
                {
                    "level": 1,
                    "comment": "Ahahahahah!!!",
                    "score": 6
                }
            ]
        },
        {
            "level": 0,
            "comment": "They're always parroting about being an \"alpha.\"",
            "score": 48
        },
        {
            "level": 0,
            "comment": "habitual lying",
            "score": 7,
            "replies": [
                {
                    "level": 1,
                    "comment": "That's what you get from being raised by strict parents",
                    "score": 11
                }
            ]
        },
        {
            "level": 0,
            "comment": "Refusing to let something drop. Always needing to have the \"last word\" in an argument.",
            "score": 22
        },
        {
            "level": 0,
            "comment": "Peacocking.\n\nEither in terms of clothes or behavior.",
            "score": 7,
            "replies": []
        },
        {
            "level": 0,
            "comment": "Saying sorry all the time. Sorry.",
            "score": 64,
            "replies": [
                {
                    "level": 1,
                    "comment": "Sometimes that is just super politeness.",
                    "score": 20,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or they might be Canadian",
                            "score": 23
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Isn't that part of trauma response?",
                    "score": 6
                },
                {
                    "level": 1,
                    "comment": "Sorry not sorry",
                    "score": 7
                }
            ]
        },
        {
            "level": 0,
            "comment": "Constantly stating, reinforcing, and comparing themselves to others by a certain metric. Income, for example, always talking about money, jobs, promotions that will get more money, how much they have, etc etc. Some people do it with fitness levels, or body count, or books read, or whatever. It's not that these things are completely meaningless but they just won't shut up about it because they're constantly trying to not feel unworthy and want the reassurance.",
            "score": 19,
            "replies": []
        },
        {
            "level": 0,
            "comment": "When someone gets defensive about everything and they continuously feel the need to argue",
            "score": 18,
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for calling me out but I think you're wrong!",
                    "score": 9
                }
            ]
        },
        {
            "level": 0,
            "comment": "Guys like andrew tate",
            "score": 16
        },
        {
            "level": 0,
            "comment": "Lack of eye contact, I’m guilty of this too.",
            "score": 111,
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't get the idea behind constant eye contact while talking. I'll keep it for periods, then I might look away while I'm thinking, then come back to it. They say it makes you look like you're lying, but I think people that are really trying to convince you of a lie will stare into your soul to try to make you believe them. Either way, stop staring at me so much, damn!",
                    "score": 15
                },
                {
                    "level": 1,
                    "comment": "Either that, or autism.",
                    "score": 35,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Either that, or you were bullied for an eye defect.",
                            "score": 11
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Look just below their eyes! You will get comfortable not looking away, but also don't have to stare into their eyes the entire time.",
                    "score": 28,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, but then I start thinking too hard about looking at their eyes/face and can’t focus on what they’re actually saying.",
                            "score": 39,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "are you me? i think you might be me",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don't judge people for eye contact. Many autistic people struggle with eye contact, and many, many autistic people will never be diagnosed simply because of how well they mask or how incorrectly older doctors tend to believe that autism cases must be very similar rather than how they truly vary from person to person.",
                    "score": 31,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It can also be a cultural thing. Some Native American tribes consider direct eye contact as disrespectful.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Welp.......I just discovered something new about myself 😭",
                            "score": 5,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Any chance you tell people random facts?\n\n\nThat seems to be an autistic thing as well, or so I've been told..",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I......☹️💔",
                                            "score": 4
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m autistic… If I stare at you the way I stare at somebody I love deeply… You will become incredibly uncomfortable… So looking people in the eye all the goddamn time is really difficult for me",
                    "score": 20,
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Also guilty. It just makes me feel awkward and uncomfortable. I try to glance at their eyes for a second at a time at least, but any longer than that I can't do.",
                    "score": 13,
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Like, being autistic isn’t insecurity",
                    "score": 21
                },
                {
                    "level": 1,
                    "comment": "It's cultural. In some cultures eye contact is rude.",
                    "score": 3
                }
            ]
        },
        {
            "level": 0,
            "comment": "Posting to r/rateme",
            "score": 5
        },
        {
            "level": 0,
            "comment": "Those who ghost because they’re too insecure to tell someone that things aren’t working out and it would be best to move on.",
            "score": 14
        },
        {
            "level": 0,
            "comment": "Constant social media activity. Memes, \"profound\" sayings falsely attributed to famous/historical people, all with some kind of underlying theme that they have been wronged by others.",
            "score": 13,
            "replies": []
        },
        {
            "level": 0,
            "comment": "my 'tistic ass looking at a good quarter of this thread:",
            "score": 21,
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah. The post about the endless talking gave me pause. I assure you that's the tism and not insecurity, I forget people don't love architecture or [insert topic I hyperfocus] and want hours of infodump. \n\n*but infodump is my love language*",
                    "score": 8,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Esp if it's infodump about a topic you are particularly passionate about. I am someone without the tism (so idk if I'm allowed to say that?) but I wouldn't mind listening to passionate infodumps if it's someone's passion :)",
                            "score": 6,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You can say it to me because this was so nice. :)\nI cannot speak for my ND siblings.\n\nMy husband and I share infodumps on our opposite interests, it's the best bonding time. Sometimes I infoseek for him if I feel like he's out of new info. I don't read it myself and he tells me about it.\n\nIf I get bummed out he'll go sit in my favorite building with me and let me ramble, or he also sends me articles or photos of things and I yammer on about them.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Awwww that's so sweet!!! You sound perfect for each other 🥰 I reckon you'd both like that game \"don't get me started\", the one where the other person gives you a topic and you have to ramble/complain about the topic (jokingly is allowed) for as long as you can :). Also is ND neurodivergent? Does that mean people with autism and similar (\"conditions\"?) ?",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There are many things that can scream insecurity in a person. Examples could include constantly seeking validation from others, being highly defensive or easily offended, overcompensating or exaggerating achievements, constantly talking about oneself, or being unable to take constructive criticism. It's important to remember that everyone has their own issues and insecurities, and it's important to approach others with empathy and understanding.",
            "score": 90,
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks ChatGPT!",
                    "score": 96,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Identifying comments generated by a large language model (LLM) like ChatGPT on Reddit can be challenging because there is no foolproof method to determine if a comment was written by a human or an AI. However, there are some indicators that might suggest a comment was generated by an LLM:\n\n1. Unusual or nonsensical responses: LLMs can sometimes produce responses that are out of context or don't make sense. If a comment seems irrelevant, contains strange phrasing, or lacks coherence, it could be an indication that it was generated by an LLM.\n\n2. Rapid and constant responses: LLMs can generate responses quickly and consistently. If a user seems to be responding rapidly to multiple threads or generating comments without breaks, it could be a sign that they are using an LLM.\n\n3. Repetitive patterns: LLMs tend to exhibit certain patterns in their responses, such as overusing certain phrases or structures. If you notice a user consistently repeating certain phrases or exhibiting a robotic writing style, it might suggest the involvement of an LLM.\n\n4. Lack of personal or contextual information: LLMs don't have personal experiences or emotions, so their comments often lack personal anecdotes or contextual details. If a comment appears to be generic or lacks specific information related to the topic being discussed, it could be an indication of an LLM-generated response.\n\nIt's important to note that these indicators are not definitive proof of an LLM-generated comment. Some human users may exhibit similar patterns, and LLMs are continually improving, so they can sometimes produce more convincing responses. When in doubt, it's best to approach every comment with a critical mindset and consider multiple factors before making a judgment.",
                            "score": 6
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This seems very similar to ChatGPT's response hmm, especially with that \"it's important to\" \n\nHere is what it says\n\n\" Prompt : What screams \"insecure\" in a person?\n\nChatGPT : There are several behaviors or traits that can indicate a person's insecurity. It's important to approach this topic with sensitivity and understanding, as everyone has moments of insecurity from time to time. Here are some common signs that may suggest insecurity in a person:\n\n1. Constantly seeking validation...\n\n2. Excessive self-criticism...\n\n3. Overcompensating...\n\n4. Difficulty handling constructive criticism...\n\n5. Overly defensive behavior...\"",
                    "score": 9,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It literally is a bot just look at the account damn",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Big lifted trucks - truck nuts for extra insecurity points",
            "score": 11
        },
        {
            "level": 0,
            "comment": "The use of Facebook to document their fantastic lives. Experiences/purchases/houses etc.",
            "score": 18,
            "replies": []
        },
        {
            "level": 0,
            "comment": "Generally Indecisive",
            "score": 33,
            "replies": [
                {
                    "level": 1,
                    "comment": "or someone with ADHD",
                    "score": 25,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lmao, I’m extremely indecisive, I don’t believe I’m insecure though, I thought the whole ADD-ADHD thing also when I read the comment, I’ve had a few people tell me I probably have ADD, or because I’m a Libra….",
                            "score": 7,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "i have adhd and im a library or whatever the fuck you call it",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I have ADHD and am very indecisive by nature. No idea how this correlates though, I'm very secure with myself.",
                            "score": 4
                        },
                        {
                            "level": 2,
                            "comment": "I can’t even pick a movie to watch so I watch no movies",
                            "score": 2
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Could just be anxiety, tho I suppose the two can be linked?",
                    "score": 5
                }
            ]
        },
        {
            "level": 0,
            "comment": "They use the term \"real men\" frequently.",
            "score": 5
        },
        {
            "level": 0,
            "comment": "Inability to apologise. Plus there's nothing wrong with being insecure. Most of us are about one thing or another. It's not a flaw. It's a reaction.",
            "score": 4
        },
        {
            "level": 0,
            "comment": "Competitiveness.\n\nIt’s one thing when competition is appropriate such as playing a sport or game.\n\nIt’s another when someone is constantly one-upping you and using you as a template for them to consistently try to outdo.",
            "score": 3
        },
        {
            "level": 0,
            "comment": "People who make their entire personality and social media posts about Trump. Good or bad.",
            "score": 5
        },
        {
            "level": 0,
            "comment": "Controlling who your partner spends time with or how they spend money. \nIf you've got that little trust,  why are you with them?",
            "score": 4
        },
        {
            "level": 0,
            "comment": "Communicating ideas of masculinity in the lens of \"betas\", \"alphas\", \"sigmas\", etc. \n\nThe need to feel 'special' and the overcompensating is very telling",
            "score": 4
        },
        {
            "level": 0,
            "comment": "Using all caps on Truth Social to attack a prosecutor and the rule of law.",
            "score": 5
        },
        {
            "level": 0,
            "comment": "Walking around with your arms at 30 degrees or higher for no reason, aka imaginary lat syndrome.",
            "score": 4
        },
        {
            "level": 0,
            "comment": "An unnecessarily giant truck. An unnecessarily loud sports car.",
            "score": 4
        },
        {
            "level": 0,
            "comment": "Those toxic dads with \"rules for dating my daughter\" shirts",
            "score": 1
        },
        {
            "level": 0,
            "comment": "dang. you specified 'in a person'.\n\notherwhise i would say 'http//'",
            "score": 10
        },
        {
            "level": 0,
            "comment": "Anyone thats uses the terms “alpha” “beta” or “omega” when referring to people (especially themselves).",
            "score": 9,
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m more of a Lambda.",
                    "score": 2
                }
            ]
        },
        {
            "level": 0,
            "comment": "when they always make fun of people who are obviously doing better than them",
            "score": 3
        },
        {
            "level": 0,
            "comment": "Tries to convince other ppl that they’re insecure",
            "score": 3
        },
        {
            "level": 0,
            "comment": "Being unable to admit you were incorrect about something no matter how big or small it is.",
            "score": 3
        },
        {
            "level": 0,
            "comment": "Saying they are alpha/beta 🥴🥴",
            "score": 3
        },
        {
            "level": 0,
            "comment": "\"I'm an alpha, you beta cuck!\"",
            "score": 3
        },
        {
            "level": 0,
            "comment": "Defending Jordan Peterson on Reddit.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Referring to themselves as an alpha.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Truck Nuts.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Red MAGA ball cap.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Red Maga Hats, and 10 giant flags on a lifted pickup.",
            "score": 35,
            "replies": []
        },
        {
            "level": 0,
            "comment": "Making jokes that lift themselves up rather than self deprecating jokes. \n\nExamples: Making jokes about having a big dick, or that you have a lot of sex or something. \n\nAnd I'm talking like unironic, I've made big dick jokes with my friends but it usually hyper exaggerated for ironic effect. What I'm referencing is dudes who are tryna make it seem like they're packing 💀",
            "score": 10,
            "replies": [
                {
                    "level": 1,
                    "comment": "This one's probably true. Every straight woman I know has said at some point that joking about being tiny is a sign that the dude is above average. LOL I can imagine the inverse is also true!",
                    "score": 3,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I joke about it because it's true 💪💪",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Extremely loud car",
            "score": 32,
            "replies": []
        },
        {
            "level": 0,
            "comment": "The Toms",
            "score": 4,
            "replies": []
        },
        {
            "level": 0,
            "comment": "Checking their partners phone. Or even expecting to be allowed to.",
            "score": 5
        },
        {
            "level": 0,
            "comment": "Constantly having to prove a point.\n\nFeel threatened or become territorial around the same or opposite sex.\n\nBoasting or overvaluing their accomplishments, or try to claim someoneelse’s accomplishments as their own.\n\nFeeling like they always need to fit in.\n\nPeople pleasing.\n\nLooking down on someone they perceive as inferior. Only associating with people they believe to be on their level or superior.\n\nSelf-loathing/deprecating behavior or humor.\n\nGossiping. Spreading Rumors.\n\nDoomscrolling.\n\nLack of self awareness.\n\nBecoming enraged or borderline violent, when something doesn’t go their way\n\nCan’t take no for an answer.\n\nEtc.",
            "score": 5
        },
        {
            "level": 0,
            "comment": "Lifted truck with tRump flags.",
            "score": 11
        },
        {
            "level": 0,
            "comment": "Calling people insecure for having preferences in a potential mate that they, or their friends do not possess.",
            "score": 2
        },
        {
            "level": 0,
            "comment": "People who label themselves as an  'Alpha'",
            "score": 2
        },
        {
            "level": 0,
            "comment": "Hating gay and transgender people.",
            "score": 2
        },
        {
            "level": 0,
            "comment": "When someone sees you succeed or improve in some way and their first reaction is to mock or make fun of you, it truly betrays immediate jealousy.",
            "score": 2
        },
        {
            "level": 0,
            "comment": "having something bad to say every time someone else achieves success. Sayings like \"Oh, you're going to hate that new job\" or \"They should have done x instead\" come to mind. Just enjoy the fact that someone else is content!",
            "score": 2
        },
        {
            "level": 0,
            "comment": "Everything #45 did/does.",
            "score": 2
        },
        {
            "level": 0,
            "comment": "Talking bad about others, constantly comparing things about themselves and their own lives with others, spouting off about alpha mindsets, etc.",
            "score": 2
        },
        {
            "level": 0,
            "comment": "Always one-upping",
            "score": 2
        },
        {
            "level": 0,
            "comment": "Picking fights with people about politics. Being opinionated is fine, I'm talking about the people who are always saying troll-y things to try to get someone to argue with them.",
            "score": 2
        },
        {
            "level": 0,
            "comment": "People who throw personal insults",
            "score": 2
        },
        {
            "level": 0,
            "comment": "Constantly pointing out your physical flaws. They are probably hella insecure about themselves and want to make you feel bad about yourself just so that they can feel better.",
            "score": 2
        },
        {
            "level": 0,
            "comment": "“ my ex did this so that’s why I’m accusatory and not trusting “",
            "score": 2
        }
    ]
}