{
    "id": "148hyrm",
    "score": 1049,
    "title": "People of Reddit, what's something us Canadians aren't ready to hear?",
    "author": "Thehalohedgehog",
    "date": 1686669947.0,
    "url": null,
    "media_url": null,
    "comments": [
        {
            "level": 0,
            "comment": "Your geese are giving you a bad name.",
            "score": 2655,
            "author": "attorneyatslaw",
            "replies": [
                {
                    "level": 1,
                    "comment": "We've renamed them 'Cobra Chickens'.",
                    "score": 789,
                    "author": "whopperman",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Canadian here from the west coast.   \nWe refer to them as the 'G-Rex'.",
                            "score": 290,
                            "author": "Marksideofthedoon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "West coast Canadian geese are soft af. I lived there for years before moving back to Ontario and they don't cross the street and attack you, they just hiss. They are 0-100 from 50 yards away in other parts of Canada and I don't know why it's different in b.c.",
                                    "score": 108,
                                    "author": "AcrobaticDig5710",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Better weed in bc? Geese more chill with a contact high",
                                            "score": 81,
                                            "author": "Inner_Importance8943",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "*Canada geese",
                                            "score": 7,
                                            "author": "entarian",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I call the geese at my house cobra chickens now",
                            "score": 42,
                            "author": "nryporter25",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Every year Canadians all get together and put their hate and spiteful ways into the goose.",
                    "score": 30,
                    "author": "ScotiaTailwagger",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Nothing like bringing the kids to the park and have them roll around in goose shit",
                    "score": 137,
                    "author": "eguez780",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fuck you shoresy!",
                            "score": 80,
                            "author": "TheEvilTwin1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "FOR WHAT!?",
                                    "score": 22,
                                    "author": "PachucaSunrise"
                                },
                                {
                                    "level": 3,
                                    "comment": "If you have a problem with Canadian Goose's, you have a problem with me and I suggest you let that one marinate!",
                                    "score": 54,
                                    "author": "Blazanar",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think we all ought to take a good look in the mirror , and asks ourselves,  where would we be without Canada gooses",
                                            "score": 18,
                                            "author": "Waz2011",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "🎵 Stopped in my tracks\n\nThat bird’s to blame\n\nYour geese are giving you\n\nA bad name.🎵",
                    "score": 81,
                    "author": "544075701",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "If you've got a problem with Canada gooses you've got a problem with me, and I suggest you let that one marinate!",
                    "score": 210,
                    "author": "Drxgue",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Let’s take about 20% off there squirrely Dan.",
                            "score": 92,
                            "author": "kazeno95",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, yep. Oh look, grass!",
                                    "score": 48,
                                    "author": "moslof_flosom",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Wish you weren't so fuckin' awkward, bud.",
                                            "score": 50,
                                            "author": "NTXGBR",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I knew someone would post this quote and I absolutely was not disappointed",
                            "score": 25,
                            "author": "saturdayis4football",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Majestic and barrel-chested! The envies of all ornithologies!",
                            "score": 7,
                            "author": "doctor-rumack"
                        },
                        {
                            "level": 2,
                            "comment": "Sounds like someone's got a problem with Canada gooses taking Canada deuces!",
                            "score": 6,
                            "author": "Bloodricuted"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm convinced they secretly are trying to use their geese to take over the lower 48, lol.",
                    "score": 8,
                    "author": "shhhOURlilsecret",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Okay I think I’m just gonna rip the bandaid off and say it to you Canadians, and I hope you are sitting down for this:\nMost of y’all’s RCMP aren’t mounted. Like at all. They are in vehicles like all the other police.",
            "score": 1063,
            "author": "theWildBore",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can't just be giving away secrets like that.",
                    "score": 256,
                    "author": "whiskeynbacon"
                },
                {
                    "level": 1,
                    "comment": "Mounted in a car",
                    "score": 139,
                    "author": "PoochusMaximus",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "If you think *that's* ripping off the band-aid, then you don't know much about the RCMP. It's a lot more Dudley George than Dudley Do-right",
                    "score": 39,
                    "author": "AIHumanWhoCares",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shits on fire yo",
            "score": 1524,
            "author": "Razorray21",
            "replies": [
                {
                    "level": 1,
                    "comment": "cough cough True that.",
                    "score": 195,
                    "author": "DocHolidayiN",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "As a west coast Canadian it's kinda funny seeing Americans in the east coast talking about Canadian wild fires in the news,  when every summer for like the past half a decade I've been choking on smoke from Washington, Oregon, and California while it literally blocks the sun for a whole week.",
                    "score": 322,
                    "author": "SappyCedar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When I saw it on the news it just said \"Canadian wildfires causing smoke pollution in the US.\" and my brain immediately said, \"Like it does every year?\" and then I read the article and my brain went \"Oh, Ontario. *Ontario?*\" When you live in the western end of the US, you just expect everything up the Rockies and to the west to be on fire at some point during the year.",
                            "score": 88,
                            "author": "silver_tongued_devil",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Oregonian here. Sorry 'bout that.",
                            "score": 39,
                            "author": "Dangy_D",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol all good, B.C. burns down all the time but for whatever reason the smoke doesn't pool here as much as the smoke from the U.S. where I happen to be.",
                                    "score": 30,
                                    "author": "SappyCedar",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sorry, in hind sight this was a bad time to drop my new mixtape",
                    "score": 65,
                    "author": "pm-me-racecars",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Most Canadians live within 100 miles of the US border. Spread out a little, eh!",
            "score": 1048,
            "author": "SlowOnTheUptake",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's cold up there in the North.",
                    "score": 361,
                    "author": "Cerraigh82",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A barren wasteland where every moment is a struggle for survival. Last time I ever visit Newmarket.",
                            "score": 261,
                            "author": "thefinalcutdown",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Most of Newmarket is far closer to full blown alcoholism than the US border, and it’s still less than 100miles. \n\nSource: I happen to drink** here.\n\n**live",
                                    "score": 18,
                                    "author": "joshmeow23"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Over 70% of Canadians live SOUTH of Seattle.",
                    "score": 275,
                    "author": "LevTolstoy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Holy shit.  I just looked that up.  I am not stupid when it come to geography but I didn’t realize it was that big a percentage (although most sources say 60%+) but still a hige number which really puts it into perspective.  And 90% lives within a 100 miles of the US border.  Get away from us with your Canadian germs!  Personal space!!  (Joking around of course)",
                            "score": 81,
                            "author": "Drachenfuer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Most of Canada is similar to Siberia, in that it is a brutal, frozen wasteland in the winter and a marshy, impassable morass infested with mosquitoes and black flies in the summer.  I know that there are dozens of large settlements in Siberia, but the Soviet authorities didn’t really factor in peoples’ preferences when they ordered them to move there.  Given a choice, Canadians wouldn’t voluntarily live in a frozen tundra that is literally colder than Mars some years.  So we hug the border.",
                                    "score": 49,
                                    "author": "I_Framed_OJ",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Speak for yourself.  I live in Northern Alberta, and I'd only move further north.\n\nMy dream retirement is to live off the grid somewhere that you can only reach with a float plane.  Just putter around out there with zero stress until I get too old to cut firewood, and then just let nature run it's course.",
                                            "score": 7,
                                            "author": "ErikTheAngry",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "70% of Canadians live in the south all the time",
                            "score": 29,
                            "author": "uprightsalmon",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Have you *been* farther north?? \n\nIt's cold up there, no thank you! \n\nSource: Grew up in northern Alberta.",
                    "score": 26,
                    "author": "rileycolin"
                },
                {
                    "level": 1,
                    "comment": "Canada, getting ready to invade, has amassed 90% of its population along its border with the United States. The longest unprotected border in the world, stretching from the Atlantic Ocean to that other one.",
                    "score": 23,
                    "author": "nanomolar",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Try building a metropolitan city on Tundra and then get back to me. Also the US-Canada border is huge so we are pretty spread. \nAlso, many countries populations live close to the border of another country (*cough* *cough* Europe), it's only the US that makes it look like it's unique to Canada.",
                    "score": 9,
                    "author": "Internal-Hat9827",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Canadian mining companies are destroying Mexico's ecosystem.\n\nAnd for how much some Mexicans think that the Spanish took all their resources, Canada has taken more silver and gold in 5 years than Spain in 300.",
            "score": 1391,
            "author": "Dallas_Spawnatron",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mining companies headquartered in Canada for stock listing purposes.",
                    "score": 299,
                    "author": "herefortheanon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And tax purposes",
                            "score": 103,
                            "author": "Citoyendeneige",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And extremely lax regulations. They're given pretty much carte blanche as long as the mining is occuring outside of Canada.",
                                    "score": 8,
                                    "author": "MnkyBzns",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The TSX is the world's leading resource company exchange and Canada leads the world in many fields of resource exploration and discovery.",
                            "score": 23,
                            "author": "zzy335"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He found us out. Send In the flying squirrels!",
                    "score": 131,
                    "author": "AcrobaticDig5710",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Beaver 6 going dark",
                            "score": 30,
                            "author": "jacob_russell",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We know.\n\nWe hate it, too.\n\nAnd, sadly, it's not just Mexico:\n\nhttps://jacobin.com/2021/05/canada-mining-industry-justin-trudeau/",
                    "score": 94,
                    "author": "ohz0pants",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "You have a weird thing going on with your residential real estate being bought up by foreigners for speculative and investment purposes.",
            "score": 233,
            "author": "Helicopter0",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's absolutely correct and a huge issue.  I live in basically a dual income home with no kids, and we can't afford to buy a house in one of the cheapest places in the country.",
                    "score": 63,
                    "author": "Fallen311",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I find it extremely frustrating/depressing that I am surrounded by people who got houses as a single income family or below $70K a year family and own homes on acreages and they bought in the 00s, not 1900s, 2000.\n\nNow we can't get close at $120K without a minimum of $100K down in a smaller city. A place on a small lot is at least $550 asking (selling above). An acreage is $1.2M+. Not lower mainland, not Golden Horseshoe. It's nuts.",
                            "score": 20,
                            "author": "NewtotheCV",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Y’all can be plenty racist.",
            "score": 838,
            "author": "Awesome1296",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are only two things I can't stand in this world: People who are intolerant of other people's cultures, and the Dutch.",
                    "score": 349,
                    "author": "gusbmoizoos",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Carnies. Nomads, you know. Smell like cabbage. Small hands.",
                            "score": 74,
                            "author": "Rfisk064"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Some of the US's best racists and bigots are Canadians. We export all our best ones to you guys",
                    "score": 131,
                    "author": "Grimdire",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Isn't it an exchange program?",
                            "score": 28,
                            "author": "LegendHunter77",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh fuck yeah bud.\n\nThe most \"concrete\" action we took in decades to atone for indigenous genocide was to declare Truth and Reconciliation day. \n\n... It's a bank holiday in most of Canada. Nothing like a paid day off for our government workers to make us reflect on what we did wrong.",
                    "score": 67,
                    "author": "ketamine-wizard",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'll start as a Canadian myself: We probably have a lot more in common with the USA than we'd like to admit.",
            "score": 1630,
            "author": "Thehalohedgehog",
            "replies": [
                {
                    "level": 1,
                    "comment": " You're the only people from an Anglophonic country where I don't immediately notice you're a foreigner.",
                    "score": 122,
                    "author": "Yak-Fucker-5000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks, Yak Fucker 5000",
                            "score": 76,
                            "author": "ObiRyaNKenobi",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We're just US lite",
                    "score": 510,
                    "author": "oliferro",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“Canada? Why should we leave America just to visit America Jr?” - Homer Simpson",
                            "score": 310,
                            "author": "gate_of_steiner85",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I've literally been saying this for the past 20 years. It's true. Canada is a less angry and fat version of the U.S. I say this as an angry, fat American.",
                            "score": 203,
                            "author": "Shark_Leader",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh we’re getting there",
                                    "score": 125,
                                    "author": "euaeuo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's the Poutine and Maple Syrup, maybe not together, but then again...  ;)",
                                            "score": 6,
                                            "author": "RedditVince",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Diet America",
                            "score": 26,
                            "author": "RetroRocket80",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "One of the biggest barriers to progress in Canada is how easy it is to point at the US and say \"at least we're better than the US\". Thinking specifically of worker's benefits. For instance, we get 2 weeks vacation minimum which is at least better than the US, but terrible compared to the UK.",
                    "score": 362,
                    "author": "Interesting_Pudding9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We may have free health care but ERs all over the Vabcouver area are on the verge if collapse. A 9 hour wait to see a doctor is nothing unusual",
                            "score": 149,
                            "author": "MelbaToast604",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As a Québécois myself, I prefer to huff the copium that my province at least tries to distinguish itself from our southern neighbours.",
                    "score": 68,
                    "author": "DrJuanZoidberg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My possibly controversial statement is that Canadian identity is more based in not being the US than they'd like to admit.",
                            "score": 55,
                            "author": "pgm123",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The one and only time I went to Canada it just looked like another part of the US, there were bigger cultural differences going from the Midwest to the South.",
                    "score": 98,
                    "author": "Vegan_Harvest",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I often think it’s better to look at North Americans from east to west. I really don’t see myself (Vancouver) too different from Californians and those living in Seattle, Portland (especially Portland), etc.\n\nI’m sure those living in Toronto are more similar to those in New York.. and those in the coast provinces probably have more in common with those in Maine.\n\nWe don’t have much to compare with the American South though, I think. And Alberta on the west.. well, that’s basically Texas.\n\nBut across the board, we share many similarities. And I think certain politics topics like anti-Trumpism are overblown, although I still doubt 46% of this country would vote for a figure like Trump. We have a lot of MAGA types as you move further and further away from the big cities as well.\n\nConservative views exist, and that’s normal and fair. I think everyone is entitled to their own views and opinions. We have our share of covid-deniers, anti-vaxxers, rights advocates, anti-abortionists, etc., just probably less extreme. A lot of people seem to see Canada (as well as other European countries) as super liberal bastions when really I think we are just slightly more reasonable. The biggest thing though is that we probably aren’t as bible-thumping and religion plays less of a role in our lives. We do not hold the constitution as the end-all-be-all with very outspoken views on 2nd amendment rights. And we definitely do not recite a pledge of allegiance before each start of the school day which I find a bit offputting for a modern, democratic, Western country.",
                            "score": 70,
                            "author": "lhsonic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;I still doubt 46% of this country would vote for a figure like Trump\n\nIn fairness that hasn't happened in the US either. 46% of *voters* maybe, but we get shit voting turnouts, so far below 46% of Americans made that call.",
                                    "score": 27,
                                    "author": "Fuduzan",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I actually was going to post “you’re not that quirky and charming and different”. \n\nBut living in Europe as a Canadian, there’s been a lot of crazy surprising differences between us and Americans that I never even realized.  For instance, they don’t call pencil crayons pencil crayons. \n\nAnother thing is our Canadian content laws warped us in a good way very very subtlety away from Americans.  It’s probably a wash these days with satellite tv, but with only Canadian content on TV and 50% on radio, our humor is…..different. 😅\n\nBut I stand by that Canadians aren’t as quirky and charming as they think, esp the men with your constant wearing of baseball caps and shorts down to the knees STILL obsessing about The Tragically Hip and your BBQs and loaded Caesar’s.",
                    "score": 56,
                    "author": "frenchdipsandwiches",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;For instance, they don’t call pencil crayons pencil crayons.\n\nWhenever I mentioned pencil crayons, my kids are like \"Do you mean colored pencils?\"",
                            "score": 9,
                            "author": "ClownfishSoup"
                        },
                        {
                            "level": 2,
                            "comment": "I really like the tragically hip tbh",
                            "score": 16,
                            "author": "Madelei-"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tim Horton's ain't nothin' special",
            "score": 1093,
            "author": "DocTerhouse",
            "replies": [
                {
                    "level": 1,
                    "comment": "Most Canadians would agree with you",
                    "score": 445,
                    "author": "BrovaloneCheese",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's nothing more Canadian than hating Tim Hortons and buying it anyway",
                            "score": 24,
                            "author": "funkyjiveturkey"
                        },
                        {
                            "level": 2,
                            "comment": "Good god yes. Their coffee tastes like tobacco water, it's no wonder why people need double cream and sugar to make it palatable.",
                            "score": 14,
                            "author": "Mr_ToDo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s been shit since they switched coffee suppliers \n\nIIRC McDonald’s uses the old supplier and their coffee is surprisingly good now",
                                    "score": 9,
                                    "author": "vagabonne",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Quality went to shit when they sold to Burger King. I'm convinced people go there out of sheer convenience (they are EVERYWHERE even my small town had 3 of them) and nostalgia from when it used to be decent stuff for the price.",
                    "score": 288,
                    "author": "RBNrando",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think a lot of people go there because they've swallowed timmy's nationalistic marketing hook, line, and sinker. It's the same type of people whose truck brand is a core part of their identity. Y'know, the \"I'm a Ford guy\" types.",
                            "score": 74,
                            "author": "Interesting_Pudding9",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Tim Hortons used to be special.  Fresh store baked donuts and decent coffee.  In the late 90’s I used to drive overnights and always stopped at small town Timmies staffed by older women that treated you like a hungry son returned home from the war.  I ate decent Chili, soup and sandwiches all the time.\n\nThen capitalism happened and now I’d rather rim a homeless guy that drink Tim Hortons coffees or eat their food.",
                    "score": 169,
                    "author": "Throwaway7219017",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I worked at Tim’s in the early 90s (for like 8 mos) back when they used to make Black Forest cake and birthday cakes and cream pies and the bow ties and eclairs and the strawberry tart was a big deal and now…ugh.",
                            "score": 38,
                            "author": "NicInNS",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Do you roll up his rim first?",
                            "score": 47,
                            "author": "whiskeynbacon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A gentleman never kisses and tells.",
                                    "score": 32,
                                    "author": "Throwaway7219017"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We already know! Since it got bought by Burger king, it went to shit.",
                    "score": 23,
                    "author": "werfu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Let's be honest here. It started well before that, when they stopped making donuts in-house.",
                            "score": 8,
                            "author": "MrIntegration",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s truly terrible. They have to stop selling their terrible hot food, and refocus on doughnuts and coffee. There’s no reason their drive thrus should be backed up in the morning by people ordering 3 awful chicken wraps, it’s a coffee shop.",
                    "score": 19,
                    "author": "friedpicklebreakfast"
                },
                {
                    "level": 1,
                    "comment": "It used to be, then they sold to a Brazilian hedge fund company. It's honestly the worst coffee you can get now,  and the food is awful. Before the coffee was excellent and the donuts were baked fresh, so you could show up at 6 am and get everything fresh, it was a little touch of heaven to start your day.",
                    "score": 48,
                    "author": "moosecakems",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The decline started when Wendy’s owned the chain.",
                            "score": 16,
                            "author": "0110110111",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As a Canadian, Tim Horton's is hot garbage.",
                    "score": 14,
                    "author": "Kaurie_Lorhart",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "We know, it sucks.",
                    "score": 10,
                    "author": "TheAsian1nvasion"
                },
                {
                    "level": 1,
                    "comment": "You ever crave hospital or airplane food? Do you like your sandwiches soggy fresh from a microwave? Why not try our dry overly sweet doughnuts, and grab a shitty cup of coffee.",
                    "score": 24,
                    "author": "eguez780",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I remember Tim as a long haired Sabre. I remember the chrome stools at the counter. I remember the smell and taste of fresh baked donuts. \n\nAnd I remember the haze and smell of cigarette smoke.",
                            "score": 10,
                            "author": "badpuffthaikitty",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice and passive aggressive aren't the same thing.",
            "score": 236,
            "author": "beavisknowsbest",
            "replies": [
                {
                    "level": 1,
                    "comment": "My friend from South India says this drives him nuts. People here will never just tell you when you have wronged them, they'll just let you carry on but secretly be fuming about it. Like if someone cuts in line at the grocery store nobody says anything but everyone might loudly discuss how rude it is lol.",
                    "score": 52,
                    "author": "bear-necessitease",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pointing fingers at other countries stances on the environment while hardly doing your own part is a bit of a douche move tbh",
            "score": 696,
            "author": "TSN_88",
            "replies": [
                {
                    "level": 1,
                    "comment": "As an Albertan, I think we’d be doing better as a country if it weren’t for Alberta’s constant bitching.",
                    "score": 32,
                    "author": "burf",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "You're not as nice as stereotypes believe.  \n\nProbably on the higher side of the nice scale, though.",
            "score": 183,
            "author": "BrettSetsFire",
            "replies": [
                {
                    "level": 1,
                    "comment": "Polite and nice aren't the same thing. We just have manners when we tell people to fuck off",
                    "score": 75,
                    "author": "Neutreality1",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "We are the world's leading exporter of passive aggression.",
                    "score": 31,
                    "author": "redditslim",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think it's about time Canadians realise that not everyone wants to be their buddy, their guy, or even, their friend.",
            "score": 120,
            "author": "Just_Understanding90",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh, dude man bro. We don't want to be friends, we just can't remember your name.",
                    "score": 48,
                    "author": "ishouldbefolding",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I’m not your buddy, guy!",
                    "score": 5,
                    "author": "HanAszholeSolo",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "You've been just as bad or worse towards the indigenous peoples as the USA",
            "score": 881,
            "author": "nasandre",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ya....the residential schools were not a high point for us",
                    "score": 165,
                    "author": "northraider123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not just the schools but the doctors that starved indigenous children in the 40s-50s to figure out how much vitamins affected us and how much we need to survive. So many children starved and died.",
                            "score": 19,
                            "author": "Difficult-Tip7928"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'd say worse. Canada had residential schools up until the 90s. People shit on America for the way we treated natives . But completely overlook Canada and Australia",
                    "score": 312,
                    "author": "nwtacoeater",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh good fucking lord, Australia has to take the cake here.",
                            "score": 204,
                            "author": "boltswinagain",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Australia saw what a “good” job Canada was doing and modelled their system after the Canadian one.",
                                    "score": 14,
                                    "author": "dm_pirate_booty"
                                },
                                {
                                    "level": 3,
                                    "comment": "Residential schools are/were largely considered the most successful \"non-violent\" genocide in history.\n\nProbably depends on how you measure but I wouldn't be so sure that Australia doesn't have some strong competition here.",
                                    "score": 54,
                                    "author": "Xianio",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I just read in the NYTimes a few weeks ago that some parts of Australia still ban aboriginal people from buying alcohol. So like white people can buy beer but if an indigenous dude walks into the same shop he gets turned away.\n\nBlew my mind. I know alcohol is a problem for a lot of indigenous groups but that’s so absurdly… parental.",
                                    "score": 27,
                                    "author": "CactusBoyScout",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not that it's a competition anyone wants to win",
                    "score": 55,
                    "author": "nwtacoeater",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had a bunch of Canadians on my college soccer team and you guys are MUCH more similar to Americans than you’d like to admit..\n\n(Unrelated but thank you for Crosby. The guy has brought my city immeasurable joy for the past 18 years lol)",
            "score": 186,
            "author": "yinzerthrowaway412",
            "replies": [
                {
                    "level": 1,
                    "comment": "He did his junior years in my hometown (Rimouski) and he just crushed the league",
                    "score": 28,
                    "author": "vinnybawbaw",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I used to play COD with Canadians back in the day and for a while I just thought they were Americans with funny accents.",
                    "score": 25,
                    "author": "SatisfactionSenior65"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Canadian bureaucracy is fucking maddening if you're trying to get anything done in a timely fashion.",
            "score": 38,
            "author": "bluescluesss",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unless it’s a bill raising pay for congress, I don’t see much of a difference down here.",
                    "score": 6,
                    "author": "Rfisk064"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Canada's health care system isn't nearly as good as others think it is",
            "score": 582,
            "author": "nwtacoeater",
            "replies": [
                {
                    "level": 1,
                    "comment": "I find a lot of Canadian identity / pride comes from comparing ourselves to the US, especially when it comes to health care. So we pat ourselves on the back and be like ‘we have health care good job’ without being willing to acknowledge the issues within our own system. Which is really to our own detriment. \n\nWe should be comparing ourselves to countries that have better socialized health care to strive to do better.\n\nEdit: point in case after I posted this I refreshed and noticed two comments stating something along the lines of “better than the US”.",
                    "score": 110,
                    "author": "SoranoKotori",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Not in Ontario, for sure",
                    "score": 119,
                    "author": "Snoo57787",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "That's largely intentional. Certain provincial governments are working to sabotage the health care system to create an acute need for private players to fill the gap they created through deficient policies.",
                    "score": 249,
                    "author": "spartiecat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is their endgame to completely get rid of the public health care system?",
                            "score": 10,
                            "author": "loverofcfb08",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "*Quebec has entered the chat",
                            "score": 57,
                            "author": "vinnybawbaw",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey from Alberta.\n\nIt's to the point that if I had a serious medical issue I'd be worried about dying before being treated.",
                                    "score": 15,
                                    "author": "Splyushi",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It isn't I waited 18 months for a colonoscopy. They found two polyps, non-cancerous. \n\nMy doctor retired, been on the waiting list two years so far for a new one. Ran out of my heart meds, so I tried going to the public cliniques  was there at 9 and was there too late.  You have to get there and camp out in line hours before it opens to get  your name on a list it turns out.\n\nI said fuck this shit, made an appointment with a private clinic. Had an appointment in 4 days, was on time, so was the doctor 30 minutes later had my script for meds. Best 200$ I ever fn spent, and the place was busy. But it ran like how it is suppose to run.",
                    "score": 96,
                    "author": "SoloPogo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A similar thing happened to my grandpa. He was on a waiting list for a new hip transplant for over 7 years. By the time he got a new hip, his other hip was ruined and they put him on another waiting list for a few more years. He died before he got his second hip transplant. He spent the last decade of his life in tremendous pain and could barely walk because he couldn't get the care he needed. But hey, it was \"free\".\n\nThe American healthcare system is horrible, but Canada's is just as bad. Just in a different way.",
                            "score": 51,
                            "author": "Propellant-King",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm a Canadian who lives in the US and for some reason get shit from Canadians about it. Canadians define their entire identity by smug, superior contrast to the States despite being two of the most similar nations on the planet and basically living off the US economy and culture (and obsessively consuming US news for some reason).",
            "score": 187,
            "author": "LevTolstoy",
            "replies": [
                {
                    "level": 1,
                    "comment": "American of Québécois descent who grew up in New England here. While my experience of Canadians has been 100% Quebec only, you really made me laugh with the consuming US news bit. \n\nWhenever i am in Montreal, and someone hears my Quebec-Paris hybrid French with my American accent (i learned French from my Canadian grandparents as a child, then took actual French in school, and of course, English was my first language...so my way of speaking french is....special), literally all they want to do is talk about....American politics. \"I saw on the news that Bush/Obama/Trump/Biden said ______. Can you defend that?\"\n\n It's always worse and more tense when a republican is president, but the desire to spark up a conversation about American politics ALWAYS HAPPENS. Like..dude...I'm here to get away from America and her politics. Can I just enjoy the comedy fest this week?",
                    "score": 32,
                    "author": "ImperatorRomanum83",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your bacon is ham.",
            "score": 402,
            "author": "Allenrw3",
            "replies": [
                {
                    "level": 1,
                    "comment": "Something Americans aren’t ready to hear is that Canadian Bacon is not a thing in Canada. We eat regularly bacon and we also eat ham.",
                    "score": 151,
                    "author": "some-guy-someone",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean... It is though.. it's peameal bacon.. usually loin, wet cured, and rolled in cornmeal. More common in eastern Canada but available in most places. \n\nBut when we refer to bacon, we just mean bacon like this guy 🥓🥓",
                            "score": 26,
                            "author": "iamcolbear",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Tom Green informed some of us in the 90s about this.\n\nhttps://www.cc.com/video/yig1ij/the-daily-show-with-jon-stewart-tom-green",
                            "score": 21,
                            "author": "whitepepper",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It is good ham though.",
                    "score": 154,
                    "author": "Thehalohedgehog",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What a great Canadian response. It is good ham",
                            "score": 93,
                            "author": "poopapat320",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, we don't actually eat that shit.  That's an American bastardization of Peameal back bacon.",
                    "score": 55,
                    "author": "CaptainDrunkBeard",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "this is the answer here",
                            "score": 15,
                            "author": "Hey_look_new"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "At least where I live on the west coast, bacon is bacon. The only time in my life that I've heard the term bacon used for ham was when I worked at McDonald's and they called the ham on the egg Mcmuffin \"Canadian bacon\" and I was legitimately confused because I'd never heard that term in my life.",
                    "score": 16,
                    "author": "Interesting_Pudding9",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I have never seen Canadian bacon in Québec. So it's either an American thing of something weird from English Canada",
                    "score": 35,
                    "author": "LordOibes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I live in BC, and I've never seen it. Maybe it's a maritime thing?",
                            "score": 20,
                            "author": "Amazing-Cellist3672",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not from the Maritimes but am from Newfoundland.  As far as I can tell, it isn’t a thing here.  I’ve seen it on menus as a specialty order, but not common.",
                                    "score": 17,
                                    "author": "No_Gur1113",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "You can get it here (also B.C.) but it's called back bacon or peameal bacon. If you look for it you'll find it I'm sure. \n\nI used to buy this stuff https://www.saveonfoods.com/sm/pickup/rsid/1982/product/harvest-sliced-back-bacon-00057393800120",
                                    "score": 12,
                                    "author": "SappyCedar",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Nova Scotian and I rarely ever see it mentioned, except maybe the odd breakfast place.  Regular bacon is more common.",
                                    "score": 7,
                                    "author": "JMacPhoneTime"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The supposed Mexican food I had in your country should be considered an international crime.  Maybe my expectations were too high, but can't you at least put canned sauce on your enchiladas instead of something that's closer in taste to marinara sauce?\n\nAlso, the people you put to staff immigration are assholes.",
            "score": 222,
            "author": "jurassicbond",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would rather have salsa then marinara.\n\nAt least the flavor profile would match.",
                    "score": 28,
                    "author": "chocki305",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Montreal has a huge Latino community and excellent mexican restaurants as a result",
                    "score": 14,
                    "author": "ketamine-wizard"
                }
            ]
        },
        {
            "level": 0,
            "comment": "hockey is pretty awesome",
            "score": 110,
            "author": "xzty_889",
            "replies": [
                {
                    "level": 1,
                    "comment": "Found a Canuck alt account.",
                    "score": 45,
                    "author": "Ravenid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Most Canucks fans aren't happy about hockey these days.",
                            "score": 18,
                            "author": "Mamrocha",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Canadians are actually not nice. They’re just more polite than Americans but alot of them are just as much asshole as the good old USA. They just have universal healthcare &amp; have a lot less guns.",
            "score": 293,
            "author": "munchiemunch73",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm Canadian, this is accurate. There may be a general politeness that we're known for, but that's not the same as being nice. So many assholes here. Just like anywhere else.",
                    "score": 51,
                    "author": "creptik1",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "We're not nice.  \n\n\nWe're passive aggressive.",
                    "score": 122,
                    "author": "runtimemess",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Yes, I've met asshole Canadians and really nice Americans... I've lived in Canada and learnt a lot about racism as directed towards me.",
                    "score": 48,
                    "author": "bunganmalan",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "You'd be surprised how many guns we have",
                    "score": 17,
                    "author": "eskimoeddie",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a Canadian I have to admit that the way we treated our Indigenous Population was wrong and super messed up.",
            "score": 47,
            "author": "GroundbreakingFall24"
        },
        {
            "level": 0,
            "comment": "Poutine isn’t readily available in the US.",
            "score": 26,
            "author": "Sonnysdad",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sounds like we've got some work to do then",
                    "score": 19,
                    "author": "Thehalohedgehog",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I work at a company that primarily services truck stops in the US and we have some locations in Canada too.  Canadian store employees as well as the few drivers I've spoken with in the last 11 years have taught me one thing:\n\nThe Canadians who are not the nicest people you've ever met? They're the worst people you've ever met.  There is not one iota of middle ground.  Literal angels swimming in a sea of the orneriest most ungrateful motherfuckers in the northern hemisphere.",
            "score": 51,
            "author": "trident042",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Your country, it seems to be on fire \n\nStay safe y'all",
            "score": 32,
            "author": "ResurgentClusterfuck",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I love how almost every answer in this thread is \"You think you are better than the USA, but you are actually worse\".",
            "score": 98,
            "author": "SwingJugend",
            "replies": []
        },
        {
            "level": 0,
            "comment": "We have the worst of both worlds. We’ve adopted the toxic US work culture but don’t get the benefit of US dollar or comparable wages.",
            "score": 63,
            "author": "Vidofnir_KSP",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Many of your favorite policies only work because you're able to outsource their downsides to the US.\n\nYou're able to spend next to nothing on your military because you live in the shadow of a friendly global hegemony.\n\nThe public resistence against your medical system's long wait times is quashed because people can just hop the border and get care immediately if it's important to them.\n\nYour pharmaceutical price caps are only workable because the US consumer pays the difference. Check out public pharmaceutical profit margins - they're actually fairly reasonable, despite the astronomical price tags charged to US consumers to make up for low caps elsewhere.\n\nYou're able to wax ideological about immigration because you're a continent away from any impoverished groups that would try to sneak into your country - you scold the US while letting it absorb all of the issues associated with poverty, desparation, and cartel violence.\n\nOverall, you are a caricature of the \"limousine liberal\" who's happy to propose liberal solutions while being completely insulated from the practical fallout.",
            "score": 281,
            "author": "The_Law_of_Pizza",
            "replies": [
                {
                    "level": 1,
                    "comment": "Best one here. Close the thread",
                    "score": 41,
                    "author": "krigskiks"
                },
                {
                    "level": 1,
                    "comment": "Holy shit",
                    "score": 10,
                    "author": "zzy335"
                },
                {
                    "level": 1,
                    "comment": "Omg...the US is just a buffer country!",
                    "score": 30,
                    "author": "umanouski",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The military spending comment would also be valid on a “what are Europeans not ready to hear.” They shit all over the US for our issues, but you can afford your social programs because you aren’t spending trillion on your military and expected to be the world police.",
                    "score": 58,
                    "author": "Reeftankz10000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Something that’s always fun to see in international threads when people lampoon the USA for their military spending, as if an incomprehensible amount of that money isn’t being send overseas as foreign aid to NATO countries to pay for their militaries.",
                            "score": 20,
                            "author": "LGmeansBatman"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well I have been meaning to tell you all in Canada this for a long time. I am VERY jealous of your fishing in Ontario . I have been to 5 fly in fishing trips in Ontario. 2 times were to lake Kabinakagami lake in Ontario above Sault sSt. Marie and goose lake above international falls MN. In the red lake region and couldn't believe how good the walleye fishing was . And your ring perch and Northern pike fishing. I am jealous and won't stand for it anymore. You guys pass me off with YOU GREAT fishing and us down in Cincinnati Ohio have blah fishing!! YOULL GET YOURS ONE DAY CANADA!! MARK MY WORD!!!!",
            "score": 6,
            "author": "IndividualSong9201"
        },
        {
            "level": 0,
            "comment": "American students spend about 2 days learning about Canadian history and there is virtually nothing about Canadian current events in the news unless it is some disaster.",
            "score": 7,
            "author": "druscarlet",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You’re not less racist than the US, and some of your racists are even more bizarre.",
            "score": 150,
            "author": "TerribleAttitude",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've noticed a trend all my life when talking about racism in Canada vs. America. a lot of ppl here view racism as only being toward black people. Canadians think that because we didn't have systematic racism toward black people, we've had none at all(not like those dumb Americans!). but then those same ppl turn around and start bashing Asian/Indian/Indigenous people; like, where do you think you live my dudes?",
                    "score": 61,
                    "author": "wanachangemyusername",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m Floridian and my wife’s family lives in the Midwest near a reservation. One of her family members got a little sharp toned with me about how us southerners are so racist towards black people and how we treated them. He then later in the trip went on a tirade about lazy alcoholic natives……",
                            "score": 18,
                            "author": "Reeftankz10000",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Trudeau faced less consequences for admitting to participating in blackface multiple times than the governor of a southern state.",
                    "score": 79,
                    "author": "jw1917",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "How have you been getting consistently outclassed by the state of Florida in *hockey* of all things?",
            "score": 152,
            "author": "boltswinagain",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are 15 Canadians on the Florida Panthers",
                    "score": 124,
                    "author": "JohnnyAD23",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We know what we’re doing lol.",
                            "score": 13,
                            "author": "Reeftankz10000"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Most american teams have Canadian players does that count ?",
                    "score": 82,
                    "author": "vinnybawbaw",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "~43% of NHL players in the 2019-2020 season were Canadian born\n\nPretty wild considering we're 1/10th the size of the US",
                            "score": 26,
                            "author": "ketamine-wizard",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Now how many were Minnesotan? I live in rural MN and there are more hockey rinks within a 70 mile radius of me than all of California",
                                    "score": 12,
                                    "author": "Reybacca",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My numbers could be wrong, but it looks like 59 out of 1123 players are from MN, or a little over 5%. \n\nWith 5.7 million people vs Canada's 38 million, that means you're actually pretty comparable on NHL players per capita. Go figure!",
                                            "score": 17,
                                            "author": "ketamine-wizard",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, I saw some stats on Canadian players, Canadian team captains, etc. Canadian players are SO DOMINANT in international competitive hockey it's bonkers. If you adjust for population size then even Russia and USA are WAYYYYY behind.",
                            "score": 11,
                            "author": "AIHumanWhoCares"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As a Tampa bay lightning fan, I find it shocking that someone who grew up where it’s freezing a good part of the year would want to live in a state where it’s always sunny",
                    "score": 9,
                    "author": "C00T3RIFIC",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "South Florida, here - your compatriots that vacation, or, God forbid, have a second home here are, with very few exceptions, some of the most annoying snowbirds that plague us. Nice, kind, courteous, and utterly infuriating. They are among the worst drivers and most egregious line-skippers imaginable, many act as though they're completely unaware that our service workers make a living off tips (morality of that aside, it's something you should be aware of when vacationing here), and the constant complaining about how everything here is worse than Canada confuses us deeply. If our healthcare, food choices, traffic, people, cleanliness, and *weather* are worse than Canada, why spend the money and time to travel to the opposite end of the continent? The driving part is particularly troubling, since we Floridians aren't exactly known for our obeyance of traffic laws - but we at least know that you don't go 20 under the limit in the fast lane before swerving through three lanes of traffic with no indicator. If it were just Quebec I'd give you a pass, but I'm seeing a lot of Ontario plates down here right now, and it's making our already Mad Max-esque traffic issues significantly worse. \n     \n     \nWe are a state devoted to tourism as our source of income and I can say without hesitation or reservation that we'd rather you lot just vacation somewhere closer to your natural environment. With all the folks here from New York and New Jersey, I assume they have some space available.",
            "score": 38,
            "author": "Pr0xyWarrior",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The way your indigenous population has been treated in the past several decades is sickening and the fact that it's being ignored for the most part doesn't mean it didn't happen. People are still being taken on moonlight tours to this day, including children, and pretending it's not an active problem in your country is the main reason it still happens. \n\nIf this is genuinely news to you, then some education is needed.",
            "score": 30,
            "author": "TheTastySpoonicorn",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Canadian here!\n\nWe are a nation of pushovers whose whole identity is thinking we are better than the US because we have (a falling apart) semi-universal health care system. Despite the other countries, including the US, doing many things a lot better than us.   Like housing - the worst in the western world",
            "score": 52,
            "author": "Citoyendeneige",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You owe much of your peace and prosperity to your fat neighbor with the big guns.",
            "score": 200,
            "author": "WantAllMyGarmonbozia",
            "replies": [
                {
                    "level": 1,
                    "comment": "And the US is still far richer than us on average, taking home literally 2-3x the average Canadian income in many fields and having houses that people can actually afford.",
                    "score": 25,
                    "author": "throwaway4t4",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "We are well aware of this...and thank you for it",
                    "score": 55,
                    "author": "northraider123",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 19,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t think any Canadian thinks it’s the most popular sport in the world, just in Canada.",
                    "score": 27,
                    "author": "Stick_of_truth69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don’t criticize Americans for bad treatment of natives when you’ve treated your natives just as bad. It’s hypocrisy",
            "score": 73,
            "author": "Rearandeasq",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, any Canadian with an ounce of self-awareness isn't doing this. We know.",
                    "score": 49,
                    "author": "PreviousTea9210",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "You are getting FUCKED on just about everything financially. Low wages, high taxes. Home prices. Varying interest rates. Absurdly high phone, internet, tv, insurance, food costs. Everything costs more and we make less than our American neighbours. It lowers our quality of life. We are very tolerant of immigrants who are intolerant to many of our shared values on things like sexual identity, orientation etc. don’t get me wrong, I love immigrants, most of them are great, but we’re bringing in too many. Our entire economy is propped up by a growing immigrant population. Many are now realizing life here ain’t as promised, and work 3 jobs to make ends meet. Mass immigration is suppressing wages and increasing home prices. \n\nJust my thoughts…",
            "score": 89,
            "author": "goldreceiver",
            "replies": []
        }
    ]
}