{
    "id": "148igee",
    "score": 486,
    "title": "Forget millions of dollars. If you won $10,000, how would that impact your life?",
    "author": "fiveironfreshy",
    "date": 1686671281.0,
    "url": null,
    "media_url": null,
    "comments": [
        {
            "level": 0,
            "comment": "We could pay off our credit card and it would free up 250/mo.",
            "score": 534,
            "author": "Desirai",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd knock out 2/3rds of mine, probably saving a similar amount",
                    "score": 76,
                    "author": "KillerOs13"
                },
                {
                    "level": 1,
                    "comment": "Yeah similar.",
                    "score": 15,
                    "author": "Evolutionpassedmeby"
                },
                {
                    "level": 1,
                    "comment": "you have a 10k credit card debt? dayum!",
                    "score": 30,
                    "author": "R-e-s-t",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I lost my job in 2020 and we basically had to live off it until I found one",
                            "score": 55,
                            "author": "Desirai",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "props on being able to get that large credit line",
                                    "score": 25,
                                    "author": "R-e-s-t",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s a fairly small limit in the grand scheme of credit cards, which is why people can get themselves into a lot of trouble very quickly with credit card debt and associated interest rates. \n\nThis is why an emergency fund is so important. Carrying a balance on a credit card gets expensive fast if you have to rely on it.",
                                            "score": 37,
                                            "author": "hipsterasshipster",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah I’ve realized as I get older that like the majority of people I thought were even a little rich growing up were actually just slowly getting deeper in credit card debt",
                                                    "score": 19,
                                                    "author": "CaptnKnots",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This is often correct and why it’s not healthy to compare yourself to others. They might have a nicer house or newer cars, but you don’t know if they have a healthy savings accounts, if they are on track in their retirement portfolio, how much CC debt they are carrying, etc. \n\nI’ve known people first hand who seem very wealthy, but I’ve found out they have almost zero retirement savings in their 30s and couldn’t cover a couple thousand dollar expense without going into debt.",
                                                            "score": 7,
                                                            "author": "hipsterasshipster",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Many people don't make enough to start saving until they are in their late 20s early 30s and can do just fine.",
                                                                    "score": 2,
                                                                    "author": "GetReelFishingPro",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Well, I’ve known plenty of those people driving pretty fancy cars for not being able to save.\n\nIt doesn’t mean they will be financially devastated from it - I’ve made plenty of poor decisions and am doing just fine - but that’s why I don’t compare myself to them, because you never know.",
                                                                            "score": 1,
                                                                            "author": "hipsterasshipster"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The thing is, if you make enough to save and instead buy fancy shit, that's what's irresponsible in my book. If you don't make enough to save, you just don't. No amount of fiscal responsibility is going to fix that one.",
                                                                            "score": 1,
                                                                            "author": "LibertyPrimeIsASage"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Seriously I had 44k when I was a dumb 24 year old and I only made 50k a year",
                                                    "score": 1,
                                                    "author": "KingQuong"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm not sure if the same goes for your country. But in mine, credit card interest rate is around 10 to 20 percent. While getting another 'normal' loan from the bank is around 4 percent. So you have to be either very lazy or very stupid to borrow money from a credit card company.",
                    "score": -3,
                    "author": "Lectere",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Often times people can get credit cards with higher limits than other forms of unsecured loans. If you have high credit card debt, it ruins your credit, making it hard to get a lower interest loan to pay off your credit card debt.",
                            "score": 1,
                            "author": "LibertyPrimeIsASage"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "10k would almost clear off a car loan. That would give me an extra 550$ a month and help pay down other bills. 10k would be huge for me. I always tell people I don’t care about winning the lotto if he happy with enough to pay off a large debt. Even if I had nothing leftover it’s still better then having debt.",
            "score": 227,
            "author": "The_Real_DaBsTeR",
            "replies": [
                {
                    "level": 1,
                    "comment": "Getting a loan for a car is like the dumbest thing to do financially",
                    "score": -20,
                    "author": "PrettyQuick",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Idk about that. I’m on a 6 year 1% interest. My truck will still be running when it’s paid off. I can pay it off now but why? 1% interest is cheap to borrow.",
                            "score": 1,
                            "author": "Mr_Welp"
                        },
                        {
                            "level": 2,
                            "comment": "That’s a pretty stupid over generalization",
                            "score": 1,
                            "author": "PM_ME_UR_SEX_VIDEOS"
                        },
                        {
                            "level": 2,
                            "comment": "Sometimes it's the only choice. Your car craps out in you, and you need a car to get to your job, but you need to get to your job to save money for a car. The solution there is a loan. \n\nI personally don't ever see myself buying a new car, though. They lose thousands of dollars in value once you drive them off the lot, usually. I'd rather buy it from a dude who just drove it off the lot lol",
                            "score": 1,
                            "author": "LibertyPrimeIsASage",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Why did you get a car loan when you cound get a cheap old car?",
                    "score": -22,
                    "author": "valms",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "cheap old cars still cost money",
                            "score": 24,
                            "author": "whatdontyousee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not 550 dollars a month money. If you can't afford it, paying that much for a car is crazy. \n\nUnless I'm misunderstanding the comment.. and 550 is not the monthly payment.",
                                    "score": 1,
                                    "author": "oJUXo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It might be a shorter term loan to avoid paying tons of interest. I know I'd do that if I could even just barely afford it.",
                                            "score": 1,
                                            "author": "LibertyPrimeIsASage"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "As somebody who already had a cheap old car that was costing me a couple hundred a month to keep running anyway, using the money I used for a down payment on my new car would give me a very high chance of buying another lemon that'd end up in the same spot a couple years from now, except by then I wouldn't have my down payment money anymore. At least now my new car doesn't stall in intersections.",
                            "score": 1,
                            "author": "StrikerX1360"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pay off all my loans and fix my teeth. So it would completely change my life.",
            "score": 184,
            "author": "KhaoticGraylien",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m in the US. 10k wouldn’t put a dent on what most people need to fix their teeth. \n\nI had surgery on my gums 3 years ago and paid $6500 out of pocket. I can’t remember the amount insurance paid toward it. It was a minor procedure and a fraction of what friends of mine have paid for other dental procedures.",
                    "score": 36,
                    "author": "foldinthecheese99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I live in the U.S too but know about 6k would completely fix what I need after my insurance. I know this bc I've been working on fixing them and my dentist gave a plan of what will need to be fixed. I paid like $600 out of pocket for a dental implant back in December.   But I live in a poor area in one of the poorest states so..",
                            "score": 18,
                            "author": "KhaoticGraylien",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "For 10.000 in Serbia you can get your teeth foxed and get extra pair of perfect teeth. And free accomodation, all inclusive, in a 5 star hotel for those days. Maybe it covers your travel expenses from US and back as well.",
                            "score": 5,
                            "author": "Certissa"
                        },
                        {
                            "level": 2,
                            "comment": "People have insurance",
                            "score": 1,
                            "author": "telr",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Why won't you rather travel to other country where it is cheaper and get them fixed?",
                            "score": 3,
                            "author": "kamiiskami",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My teeth are fine, it was just one surgery I needed. It would cost me more to travel to another country than just do the surgery here. I’m lucky enough that I can afford to do procedures needed. It’s just insane how high they are and how little dental insurance covers here.",
                                    "score": 7,
                                    "author": "foldinthecheese99",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Wow. That's wild. I expected it to be cheaper to get a return flight and probably the expenses wouldn't come close to 6.5k which was 3 years back. Idk tho, don't live in the US",
                                            "score": 2,
                                            "author": "kamiiskami",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "With you on the teeth thing brother/sister/theyther. Hope you make it.",
                    "score": 11,
                    "author": "HanzoHoliday"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Save it for a down payment on a house honestly. Not much else.",
            "score": 144,
            "author": "A-Wall1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same. Wouldn't change my life at all, which I guess means I'm doing alright, so that's nice. But I'm now in my 40s and don't own my own home. Not so nice. I'm saving though, and hopeful...",
                    "score": 22,
                    "author": "creptik1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It seems like this would significantly change your life then.  If you are able to afford your down payment 2-4 years earlier in your life, you now have a lot more control over when and what you buy.  Let's say the market dips in two years and rates are low while house prices have either flat lined or even decreased by a couple percentages.  Putting the control in your own hands to leverage those situations could mean a thousand dollars difference on your mortgage payment.  It also could be the difference between a a house you love and a house you like.  \n\nIt is likely to significantly change your life, just not your present.",
                            "score": 1,
                            "author": "MavetheGreat",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd have a lot more records",
            "score": 28,
            "author": "staggere"
        },
        {
            "level": 0,
            "comment": "My mortgage would be $10,000 less.",
            "score": 126,
            "author": "VVillyD",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t know what your interest rate is but unless you just closed your loan you’re almost certainly better off in a savings account or money market than paying down mortgage debt.",
                    "score": 33,
                    "author": "FrankRandomLetters",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My rate is 5.88% and floating.\n\nIf I won 10k, a portion would definitely go on the mortgage.",
                            "score": 19,
                            "author": "banjo_electric",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah you have a particularly shitty rate. I agree with you",
                                    "score": 12,
                                    "author": "FrankRandomLetters",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s shitty? Damn I’d kill for that rate considering the national average is around 7.5%",
                                            "score": 5,
                                            "author": "TheMisterTango",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Most people closed their loans a while ago and are still enjoying the low rates from then. For example my mortgage is fixed for 20 years at 2.875%\n\nI am getting 4%+ in a savings account. There’s no way people in a similar situation should pay down their mortgage. Especially when you consider potential tax write offs for mortgage interest.",
                                                    "score": 3,
                                                    "author": "FrankRandomLetters",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "In my jurisdiction there is no tax credit for mortgage interest. If I earned 4% interest on an investment it would be about 2.2-2.4% after taxes. Just renewed a few weeks ago so now paying down my mortgage is a guaranteed return of 4.19% after taxes. I would have to earn around 7% returns before tax to break even. Anything that would offer enough return is almost certainly going to carry some risk so for me paying down my mortgage is one of the best investments that they can make.",
                                                            "score": 1,
                                                            "author": "Steelringin"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It’s actually a good rate within my country - it’s discounted by 2.5% from the standard floating rate because we bought a new build off the plan.\n\nNew Zealand doesn’t allow massively long terms for fixed rates. The longest you can fix a rate for is 5 years.",
                                            "score": 4,
                                            "author": "banjo_electric"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I understand the logic, but personally I want to get out from under the mortgage payment.  This is by far my largest monthly bill and it would considerably increase my cash flow if it were paid in full.",
                            "score": 11,
                            "author": "MithandirsGhost",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nah. Just do some math. If $10,000 pays off your loan 6 month sooner then just pay yourself an amount equivalent to the monthly payment from your savings beginning 6 months before the loans paid off. \n\nThat way you’ll enjoy both the cash flow and the extra interest earned.",
                                    "score": 2,
                                    "author": "FrankRandomLetters",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "For some people it's better for their mental state to just see the debt disappear. That's more valuable than any extra $ you can make by keeping the debt to some.",
                                            "score": 11,
                                            "author": "Pixel2_Bro"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It will pay it off far quicker than 6 months sooner if you’re applying it to principle only. If you make 13 payments a year instead of 12 the 13th is only principle and collectively it knocks about 7 years off your loan by saving you front interest charges.",
                                            "score": 1,
                                            "author": "xElemenohpee",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Hot take- paying off your mortgage early has a larger emotional benefit than the potential financial benefit of investing elsewhere",
                            "score": 11,
                            "author": "akkopec",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Absolutely a real benefit. If ridding yourself of that burden is worth the extra cost there’s no shame in paying it off early.",
                                    "score": 6,
                                    "author": "FrankRandomLetters"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Assuming anything under a 4% interest rate, not savings, maybe money market, probably investment, definitely CD.",
                            "score": 5,
                            "author": "JADW27",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Im getting 4.15% at Apple. And 4.65% at Robinhood and those are regular old savings accounts.\n\nYou should check what’s out there. Those aren’t even the best.",
                                    "score": 2,
                                    "author": "FrankRandomLetters",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It means more money sooner, if they are paying 800/month or smthin, they could get that a year sooner, and that is alot",
                            "score": 1,
                            "author": "HazardousCarrot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not really. They could simply deposit the $10,000 into a higher earning account, pay themselves an amount equal to the monthly mortgage payment out of that account and still be ahead.",
                                    "score": 10,
                                    "author": "FrankRandomLetters"
                                },
                                {
                                    "level": 3,
                                    "comment": "Also, Peace of mind…",
                                    "score": 3,
                                    "author": "Thortsen"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not much.\n\nI would have $8 000 more in my equity fund and $2 000 more in my buffer/savings account.\n\nAnd that feels so crazy to me. I am by no means \"rich\", I have a very median income, and yet money that doesn't matter much to me is life changing for others.\n\nIt really puts different classes into perspective.",
            "score": 30,
            "author": "Barneyk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sounds like you’re relatively rich, man. $100 would change my life completely. Hope to get there someday!",
                    "score": 1,
                    "author": "Davidsilak",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Sounds like you’re relatively rich, man. \n\nComparatively I sure am! And that is what's so crazy. The majority of people in my country, Sweden, make more money than I do.\n\nAnd yet, I am so well off that I wouldn't even really notice $10 000 if I wasn't paying attention.\n\nIt really is disgusting how massive the income gaps are...",
                            "score": 12,
                            "author": "Barneyk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you don’t mind me asking, what % of your NW (excl primary residence) is 10k that you won’t even notice. Even if you have 250k savings, 10k is 4% of that and certainly noticeable. I can’t imagine an average person in Sweden having 250k+ in savings accounts but maybe I am wrong",
                                    "score": 1,
                                    "author": "ForwardInstance",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "How would $100 change your life? Btw asking out of curiosity not to be judgemental!",
                            "score": 6,
                            "author": "kratosfan101"
                        },
                        {
                            "level": 2,
                            "comment": "In my opinion, rich is when you don't have to work to live a middle class life. The situation where 10k doesn't cause an immediate change is what I call being well-off, I consider myself to be that. 10k is an amount of money where if I didn't for some reason want to save it, I'd start looking at whether it'd be financially smart change my 2005 Opel Astra out before I spend too much to keep it running. But nothing immediate.",
                            "score": 1,
                            "author": "PhantomAlpha01"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "probably not at all.",
            "score": 270,
            "author": "Ill_Literature2240",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same. I’m 44 with a decent career, I’d just save/invest it. Allocating it to something would just be mental gymnastics since we’ve got a good bit saved up already.",
                    "score": 64,
                    "author": "IdaDuck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To me it is basically \"would you like $500-1000/yr going forward?\"\n\nYeah sure\n\n\"Is it going to change how you live your life?\"\n\nIt shouldn't",
                            "score": 8,
                            "author": "bos_boiler_eng"
                        },
                        {
                            "level": 2,
                            "comment": "Yea, same. I have zero debt. Don't need anything. $10k not really close to any dream purchases. Honestly, probably just give that money to my dad.",
                            "score": 4,
                            "author": "jglenn9k",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "All of my debt is at such low interest rates that it makes no sense to pay it off. Better to invest any extra money to let it grow.",
                                    "score": 7,
                                    "author": "RahvinDragand",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same for me.  I could pay off 10k of almost 30k of student loans, but that's about it.",
                    "score": 4,
                    "author": "leese216"
                },
                {
                    "level": 1,
                    "comment": "Same here. Maybe buying something I want but dont need (New gaming PC) the rest put aside. We are not rich but we arent poor either. 10000 (euro) is a little less of what I earn in 4 months.",
                    "score": 3,
                    "author": "19Thanatos83"
                },
                {
                    "level": 1,
                    "comment": "Yeah, I'm honestly in a pretty good spot and simultaneously no where near where I need to be for the next step, so I'd basically take a nice vacation and throw like 5k into the bank.",
                    "score": 2,
                    "author": "Somethingmorbid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably the same for me. Pay off my recent hospital visit but that'll be all the bills I really owe",
                            "score": 3,
                            "author": "Senrakdaemon"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It wouldn’t. I’d just have a bit more in savings.",
            "score": 86,
            "author": "Squirt_memes",
            "replies": [
                {
                    "level": 1,
                    "comment": "^This.",
                    "score": 0,
                    "author": "Witty_Razzmatazz_566"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Would clear up some debt",
            "score": 11,
            "author": "Fists_full_of_beers"
        },
        {
            "level": 0,
            "comment": "I could get new shingles for my roof.",
            "score": 12,
            "author": "distortedzipper"
        },
        {
            "level": 0,
            "comment": "I could leave and start-over.",
            "score": 31,
            "author": "LaVieEnAzalea",
            "replies": [
                {
                    "level": 1,
                    "comment": "Leave what?",
                    "score": 5,
                    "author": "cataids69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Earth",
                            "score": 1,
                            "author": "Vexation",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don't think 10k is enough",
                                    "score": 1,
                                    "author": "cataids69",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Rope isn't *that* expensive.",
                                            "score": 1,
                                            "author": "gujiasi"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice vacation somewhere Ive never been for a week or two probably.",
            "score": 10,
            "author": "jiggetty",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think it would be almost enough for a week for both me, my wife and our three sons.",
                    "score": 4,
                    "author": "jbergens"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would end up putting it on my mortgage so I would pay it off several months earlier than planned. It wouldn't be a life changing amount though, tbh.",
            "score": 21,
            "author": "peanutthetreenut"
        },
        {
            "level": 0,
            "comment": "Pay off most of my student loans",
            "score": 7,
            "author": "GoingMenthol"
        },
        {
            "level": 0,
            "comment": "I could finally get a driver's license. Buy a car. Get to have a better job.",
            "score": 26,
            "author": "ujythrsgfdd",
            "replies": [
                {
                    "level": 1,
                    "comment": "How does 10 grand preclude a drivers license?",
                    "score": 10,
                    "author": "Trekintosh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In my country acquiring a driver's license can easily rack up to 2500 dollars.",
                            "score": 17,
                            "author": "ujythrsgfdd",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Holy shit! Is this like one of the Scandinavian countries where you have to basically get training like a rally racer?",
                                    "score": 14,
                                    "author": "Trekintosh",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You actually don't explicitly have to take driving lessons. There are two mandatory things to do through, one is to drive on slippery road (they have a track they make slippery and it's under controlled situation) and hear a lecture on driving under influence.\n\nAs long as you've done those, you can take the license tests.",
                                            "score": 9,
                                            "author": "fearswe",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I had to drive around maybe 1\\\\4 a mile in a relatively small town.   No special parking, no crazy test.",
                                                    "score": 3,
                                                    "author": "goetzjam"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Honestly, I wish the slippery road was part of the Canadian test/education. We have to deal with it so often! I still absolutely hate driving in winter.",
                                                    "score": 3,
                                                    "author": "MrsMaiselsBrisket"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Pretty normal price range for Germany too. There is a minimum amount of hours you have to practice with a qualified driving teacher (+ theory lessons) before you can even take the test.",
                                            "score": 7,
                                            "author": "h311fi5h"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Nah in guessing Singapore. They have ridiculous laws",
                                            "score": 2,
                                            "author": "FantasticSeaweed9226",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Which country??",
                                    "score": 3,
                                    "author": "SingleAstronomer888"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm in the fortunate position to say, not a lot. It would either just go towards my mortgage or into savings. It's not life changing so it won't pay off the mortgage or we could retire, it'd just make me $10k but compounded interest better off in retirement.",
            "score": 18,
            "author": "rose636"
        },
        {
            "level": 0,
            "comment": "Pay for my dogs ACL operation.",
            "score": 42,
            "author": "Crystal_Clear_Gin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok so hot take. I get that dogs are great support animals and all but like 10k just to keep it living is honestly not gonna happen from me. Downvote me all you want but I’m just being real. 10k could help me or another human way more than that dog. But correct me if I’m wrong. Just my opinion",
                    "score": 19,
                    "author": "ALP1N3SN1P3r",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's not even to keep it living. Dogs can survive fine with an injured leg.",
                            "score": 1,
                            "author": "RahvinDragand"
                        },
                        {
                            "level": 2,
                            "comment": "Ok so hot take. I get that people are great support animals and all but like 10k just to keep it living is honestly not gonna happen from me. Downvote me all you want but I’m just being real. 10k could help me or my dog way more than that person I don't know or give a shit about. But correct me if I’m wrong. Just my opinion",
                            "score": 0,
                            "author": "accountonbase",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dude a human life is far more important than any dog.",
                                    "score": -3,
                                    "author": "ALP1N3SN1P3r",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My dogs are *family members*, and they automatically have more weight in my heart than any random human.",
                                            "score": 1,
                                            "author": "DoggoToucher"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I can name a dozen humans off the top of my head less valuable than any stray dog, let alone *my* dog.",
                                            "score": 17,
                                            "author": "accountonbase",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Wow man I’m really sorry you feel that way then. Must be a sucky way to live.",
                                                    "score": -9,
                                                    "author": "ALP1N3SN1P3r"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "what a disgusting opinion that nobody asked for. have some empathy ffs",
                            "score": -2,
                            "author": "whatdontyousee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m sorry man. Look I love my dogs a lot! More than a lot of people. But at the end of the day if it was 10k for my dog or some random human the human lives. Every time. It’s love and  kindness to other humans rather than hate towards dogs or any animal",
                                    "score": 2,
                                    "author": "ALP1N3SN1P3r",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "this isn’t about you! this is what u/crystal_clear_gin would do with their 10k. keep your shitty opinions to yourself.",
                                            "score": -6,
                                            "author": "whatdontyousee",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I mean it’s Reddit man. All opinions are allowed to be expressed. Sorry you don’t like mine. I don’t like yours",
                                                    "score": 1,
                                                    "author": "ALP1N3SN1P3r"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pay off some debt",
            "score": 4,
            "author": "thr0aty0gurt"
        },
        {
            "level": 0,
            "comment": "All in on red.",
            "score": 4,
            "author": "oceanwaiting",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I would be able to put down a downpayment on a small apartment and stop throwing 60% of my income down the drain each month.",
            "score": 5,
            "author": "Four_beastlings"
        },
        {
            "level": 0,
            "comment": "Not much, I invest it in my retirement plan and that is that. So in other words, I don't need it.",
            "score": 5,
            "author": "Skav-552",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I would immediately invest it into a higher paying dividend stock and pretend I never got the money.",
            "score": 4,
            "author": "hegui"
        },
        {
            "level": 0,
            "comment": "I'd just deposit it into my savings account and keep on as usual.",
            "score": 3,
            "author": "DavisCabbage01"
        },
        {
            "level": 0,
            "comment": "I'd get a much needed break which would let me apply at other jobs without stressing and worrying so much, especially about how my current job affects my mental health and feeling of self worth.",
            "score": 5,
            "author": "Mugwumpen"
        },
        {
            "level": 0,
            "comment": "I'd be slightly less in debt.",
            "score": 4,
            "author": "ZenyaLayah"
        },
        {
            "level": 0,
            "comment": "I’d be able to live without working for a year",
            "score": 4,
            "author": "somedayiwillbesoil"
        },
        {
            "level": 0,
            "comment": "Not at all. I have zero debt so it would just be invested into a taxable VTSAX and chill account. All non earmarked funds in my budget that I receive go there.",
            "score": 4,
            "author": "maledependa"
        },
        {
            "level": 0,
            "comment": "Paint our house. Way overdue.",
            "score": 4,
            "author": "HUP"
        },
        {
            "level": 0,
            "comment": "I could probably finish my last 2 semesters of college with zero debt, or knock out about 80% of my remaining car loan",
            "score": 1,
            "author": "StrikerX1360"
        },
        {
            "level": 0,
            "comment": "I could get my mouth finally fixed.",
            "score": 1,
            "author": "khadmon"
        },
        {
            "level": 0,
            "comment": "Nothing of real consequence. I’d just stick it in with the rest of my investments since I already have a secure emergency fund.",
            "score": 23,
            "author": "Mental_Bookkeeper658"
        },
        {
            "level": 0,
            "comment": "I could pay off the two loans that are slowly bleeding me dry and my car. Go from -$600 per month to about +$300. Would be nice to be able to buy real groceries again.",
            "score": 3,
            "author": "DehliaNasro"
        },
        {
            "level": 0,
            "comment": "Either kill off about 1/8th of the remainder of my mortgage, or take a trip to Scotland.\n\nNice perk, but far from life changing.",
            "score": 3,
            "author": "No-Patient1365"
        },
        {
            "level": 0,
            "comment": "Pay off my bills get my car fixed properly and get some much needed dental work done.",
            "score": 3,
            "author": "Yrrebnot"
        },
        {
            "level": 0,
            "comment": "I'd use if for a downpayment on a nice bicycle.",
            "score": 3,
            "author": "jncc"
        },
        {
            "level": 0,
            "comment": "Not much. Would be just an extra paycheck. Would probably take the family to a vacation somewhere remote.",
            "score": 3,
            "author": "JayFi-"
        },
        {
            "level": 0,
            "comment": "I'd have less debt to pay :&gt; Better than nothing",
            "score": 3,
            "author": "kamiiskami"
        },
        {
            "level": 0,
            "comment": "That's my mortgage payment for almost a year. It would give me a chance to build a savings account for the first time in my life and pay off some medical debts",
            "score": 3,
            "author": "No_Tension8376"
        },
        {
            "level": 0,
            "comment": "My student loans would be 10K less. That's a great help for me.",
            "score": 3,
            "author": "Creative_Goal317"
        },
        {
            "level": 0,
            "comment": "It would offset my income enough so that I could stay in a hotel every day, instead of sleeping in my car, for the next year.",
            "score": 1,
            "author": "Lord_Grimm88"
        },
        {
            "level": 0,
            "comment": "It would help pay for my dogs cancer treatment. I make just above minimum wage, but after his last and final procedure (which won't save him but it will make the last parts of his life dramatically more comfortable), I'll be out about 12-14k. \n\nThere hasn't been anyone to love me like him. It's a strange thing to feel like I'm buying time with him, but as long as he's not suffering, I'll do whatever I can to make his final moments nice.",
            "score": 1,
            "author": "jivenjune"
        },
        {
            "level": 0,
            "comment": "It would single-handed my solve almost all of my issues.\n\nI can’t afford medicine (BPD, ADHD, Major Depression) or Therapy.\n\nI have a baby on the way with $34 in my checking account and nothing in savings.\n\nI’m drowning in Medical Bills\n\nGod, 10k would be insane. I hope I’m able to get to a spot in life where I’m not struggling financially, I’m sure it’s adding to my mental dismay.\n\nWith all of that said, I have a healthy body that functions, a reliable job that (even just barely) covers most of the bills, a vehicle to get back and forth to work, I’m already way better off than a lot of other people.",
            "score": 1,
            "author": "jf0ssGremlin"
        },
        {
            "level": 0,
            "comment": "I’d buy my four year old son with cp a medical feeding chair to support him as he eats. It’s close to a grand and insurance won’t approve it. American health care is cruel. I’d pay off a credit card, and I’d get tie downs installed on our vehicle for my sons wheelchair/adaptive stroller. 10k would change our life. My son deserves the world and more. It’s sad how expensive it is to have disabilities :(",
            "score": 1,
            "author": "BIueberryCheesecake"
        },
        {
            "level": 0,
            "comment": "Not at all. That's only a third of my debt.",
            "score": 11,
            "author": "child-of-old-gods",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hear what you were saying, but I really do think eliminating a third of your debt is a pretty big impact.",
                    "score": 45,
                    "author": "444unsure"
                },
                {
                    "level": 1,
                    "comment": "If you pay a third of the debt you can ease the monthly cost or the time you would be paying it... its a big difference",
                    "score": 12,
                    "author": "TheNadademais",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd take my wife out for a semi-nice dinner, and pay off some debts.",
            "score": 5,
            "author": "UnoriginallyGeneric",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Wouldn't be a huge impact, but it *would* pay for fixing up my garage and turning it into a home gym.",
            "score": 5,
            "author": "Hrekires",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's a big impact. I'd love a garage so I could fit a home gym!",
                    "score": 3,
                    "author": "Accomplished_Bake904",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can finally pay off my dental debt",
            "score": 4,
            "author": "midnight-king18"
        },
        {
            "level": 0,
            "comment": "I would pay off enough debt to have at least 600$ freed up a month.",
            "score": 2,
            "author": "Various-Woodpecker51"
        },
        {
            "level": 0,
            "comment": "I’m a student at 30, so fairly positively.",
            "score": 2,
            "author": "PariNyana498"
        },
        {
            "level": 0,
            "comment": "I could get a place to live",
            "score": 2,
            "author": "Thug_Life187"
        },
        {
            "level": 0,
            "comment": "Pay off my credit card and be able to pay for almost an entire semester of grad school.",
            "score": 2,
            "author": "Glittering_Pink_902"
        },
        {
            "level": 0,
            "comment": "It would pay for most of my wedding and allow us to focus on saving for the future.",
            "score": 2,
            "author": "Jcnathan"
        },
        {
            "level": 0,
            "comment": "Credit card debt gone",
            "score": 2,
            "author": "GreatMillionDog"
        },
        {
            "level": 0,
            "comment": "For people who can’t decide what to do, put it in an I-bond. 6.35% APY",
            "score": 2,
            "author": "never-declaw-a-cat"
        },
        {
            "level": 0,
            "comment": "it'd save my existence as it is",
            "score": 2,
            "author": "frozensepulcro"
        },
        {
            "level": 0,
            "comment": "Honestly not much at all",
            "score": 1,
            "author": "NoMoreFishfries"
        },
        {
            "level": 0,
            "comment": "Not a whole lot. Would let me finally replenish my emergency fund, so I'd have some peace of mind. I'd throw the rest in my roth and forget about it.",
            "score": 1,
            "author": "kingrazor001"
        },
        {
            "level": 0,
            "comment": "To be honest, 10k is what I need to pay everything I own, so basically 10k would solve my life. It might even be less than 10k, prob 7-9k, so if a billionair would offer me money I'd take 10k and not be greedy.",
            "score": 1,
            "author": "PerryTheH"
        },
        {
            "level": 0,
            "comment": "Would add it to my savings and immediately forget about it",
            "score": 1,
            "author": "456852456852"
        },
        {
            "level": 0,
            "comment": "Shit would wipe out my debt and honestly change my life. I don't want millions, just enough to pay off my crippling debt thats shackled me for years",
            "score": 1,
            "author": "stayh1ghh"
        },
        {
            "level": 0,
            "comment": "It wouldn't in any way have a meaningful impact on my life. I might get a few extra dollars a year in interest, but that's it.",
            "score": 2,
            "author": "Ratnix"
        },
        {
            "level": 0,
            "comment": "$10k isn't much yall.",
            "score": -5,
            "author": "RedditGuy032389",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is to a lot of people though",
                    "score": 15,
                    "author": "Bubblebutt322",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It's literally a life changing amount of money for most people. Far more than they'll ever have at once",
                    "score": 3,
                    "author": "I-mnotgivingmyname",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would be able to get a jaw reduction surgery and a nose job, so I'd probably never struggle with my mental health ever again and could finally experience so many things I'm unable to now.",
            "score": 0,
            "author": "sadsledgemain",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m not against plastic surgery, but it wont fix your mental health. This is coming from someone who’s had cosmetic surgery before.",
                    "score": 5,
                    "author": "ModernSun"
                },
                {
                    "level": 1,
                    "comment": "Hey it’s not what you look like it’s who you are friend. Who cares if you think you have flaws everyone does. Whoever judges you on that aspect of your life has an opinion that is not even worth wasting your time hearing. Befriend people who can see who you are as a person because those are the people you want in your life to motivate you and help you through tough times.",
                    "score": 1,
                    "author": "The_Real_DaBsTeR"
                }
            ]
        },
        {
            "level": 0,
            "comment": "greatly",
            "score": 1,
            "author": "TrailerParkPrepper"
        },
        {
            "level": 0,
            "comment": "It wouldn’t change anything at all.",
            "score": 1,
            "author": "knovit"
        },
        {
            "level": 0,
            "comment": "Like many other I'd be able to settle my debts. That way I'd be free of the idiocy that past me saddled present me with and I wouldn't just be working to pay off stuff and would be free to...well be free.",
            "score": 1,
            "author": "votemarvel"
        },
        {
            "level": 0,
            "comment": "I could pay off a couple of small debts but it wouldn't have much impact on my life.",
            "score": 1,
            "author": "ScottishRajko"
        },
        {
            "level": 0,
            "comment": "Keep it around for student loan repayment in October.",
            "score": 1,
            "author": "antonmnster"
        },
        {
            "level": 0,
            "comment": "Zero. It would pay off some credit card debt, that's about it.",
            "score": 1,
            "author": "doctor-rumack"
        },
        {
            "level": 0,
            "comment": "Might help me retire a bit earlier I suppose.",
            "score": 1,
            "author": "revtim"
        },
        {
            "level": 0,
            "comment": "Very little. It would mean I can retire ever so slightly sooner.",
            "score": 1,
            "author": "onetwo3four5"
        },
        {
            "level": 0,
            "comment": "Honestly not much immediately. I'd put it into a savings account as an absolute last-ditch emergency fund.",
            "score": 1,
            "author": "RipCurl69Reddit"
        },
        {
            "level": 0,
            "comment": "Pay my bills for a few months\n\nor buy 10,000 pounds of pasta. Whichever lends itself to the moment better",
            "score": 1,
            "author": "IvoryLila"
        },
        {
            "level": 0,
            "comment": "I'd only have 17000 of student loans left instead of 27000 of student loans left.",
            "score": 1,
            "author": "JysanhaEva"
        },
        {
            "level": 0,
            "comment": "It would make me not have to save as much money to buy a house.",
            "score": 1,
            "author": "Caseyo456"
        },
        {
            "level": 0,
            "comment": "I'd be slightly less in debt.",
            "score": 1,
            "author": "GiadaFayth01"
        },
        {
            "level": 0,
            "comment": "It wouldn't because that's not that much, lol. It'd just go straight into VOO probably.",
            "score": 1,
            "author": "BramptonBatallion"
        },
        {
            "level": 0,
            "comment": "I'm not doing too bad financially, so I'd probably pay it forward.",
            "score": 1,
            "author": "AiUiPinkeye4023"
        },
        {
            "level": 0,
            "comment": "Finally Big Ern is above the law!",
            "score": 1,
            "author": "Noobeaterz"
        },
        {
            "level": 0,
            "comment": "Pays off my various debts.",
            "score": 1,
            "author": "EdgelordZeta"
        },
        {
            "level": 0,
            "comment": "I have a loan that I'd clear. Could tuck the rest away into savings or s nice holiday away with herself. It would honestly be pretty sweet.",
            "score": 1,
            "author": "Randomdickjoke"
        },
        {
            "level": 0,
            "comment": "Time for a surfing vacation!",
            "score": 1,
            "author": "positive-oceans"
        },
        {
            "level": 0,
            "comment": "Tremendously",
            "score": 1,
            "author": "Jaytweak37"
        },
        {
            "level": 0,
            "comment": "Clear off all my debt then start again also fix my roof",
            "score": 1,
            "author": "Niceandpeaceful117"
        },
        {
            "level": 0,
            "comment": "I’d have enough to move out from home and in with my girlfriend finally",
            "score": 1,
            "author": "Thatoneguywithasteak"
        },
        {
            "level": 0,
            "comment": "Invest it all in an index fund. I have no debt so I'm good.",
            "score": 1,
            "author": "adhesiveToaster"
        },
        {
            "level": 0,
            "comment": "it’d more than double my current savings, but i would probably go and get a relatively recent used car, one without a touch screen that plays CDs. at my age a Toyota with 40k on the clock would last the rest of my life.",
            "score": 1,
            "author": "dubkitteh1"
        },
        {
            "level": 0,
            "comment": "So this happened to me. I filed my taxes 6 years ago and I put in a note asking for retroactive payments to apply to a benefit I didn’t know I was eligible for. I didn’t know if they would or wouldn’t. \nLong story short - I woke up one morning with a 10 year retroactive payment having been deposited in my bank account. Total amount was $10k. My life has never been the same since. I was able to invest $9k and pay off debt. That money has lasted me, mostly in savings, but also those tight weeks between pay checks aren’t life threatening anymore. I can borrow $100 or $500 out of savings to survive if I need to.",
            "score": 1,
            "author": "Graceland1979"
        },
        {
            "level": 0,
            "comment": "It would depend which currency it was.",
            "score": 1,
            "author": "therealolliehunt"
        },
        {
            "level": 0,
            "comment": "Definitely credit cards being paid off freeing capital.",
            "score": 1,
            "author": "thuynj19"
        },
        {
            "level": 0,
            "comment": "Depends on the currency",
            "score": 1,
            "author": "FranzAllspring"
        },
        {
            "level": 0,
            "comment": "I’d have an extra 10k in a savings account for when I find the next property to rehab.",
            "score": 1,
            "author": "UnsuspiciousCat4118"
        },
        {
            "level": 0,
            "comment": "That is pretty much an every day event for me, up or down, depending upon stock market closing prices.",
            "score": 1,
            "author": "NealR2000"
        },
        {
            "level": 0,
            "comment": "I could pay my debt, at least the debt effecting my credit score. I actually don’t know how much medical debt I have.\n\nBut I’d pay my loans and stuff and then I’d use the left over to fix my floor",
            "score": 1,
            "author": "draugyr"
        },
        {
            "level": 0,
            "comment": "I would spend it on friends.",
            "score": 1,
            "author": "never-declaw-a-cat"
        },
        {
            "level": 0,
            "comment": "I'm self employed the taxman will take it all.",
            "score": 1,
            "author": "boo1881"
        },
        {
            "level": 0,
            "comment": "I would have a fun weekend in Vegas",
            "score": 1,
            "author": "fuber"
        }
    ]
}