{
    "id": "148itvp",
    "score": 5,
    "title": "What is the best advise for someone who will be living completely on their own for the first time?",
    "author": "TheRealLanAmore",
    "date": 1686672255.0,
    "url": "https://www.reddit.com/r/AskReddit/comments/148itvp",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Get a toilet plunger now before you need one",
            "score": 10,
            "author": "Tripperfish-",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha I have one already!",
                    "score": 1,
                    "author": "TheRealLanAmore",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sweet! When I first moved out I spent like 50 at the dollar store on basic things like that (sponges, broom, mop, first aid, soaps, kitchenware, foil, etc) and ugraded as things broke or noticed I used some things more than others and warrented an upgrade",
                            "score": 3,
                            "author": "Tripperfish-"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Put things away in the right place the first time. Don’t just leave a thing out on a counter or shelf thinking you’ll put it away later. You won’t. A month will pass and the thing will still be there. The only thing that happens is your standards of clutter falls.",
            "score": 8,
            "author": "PrayForMojo_",
            "replies": [
                {
                    "level": 1,
                    "comment": "My kitchen is my sanctuary. It is nearly spotless. My bedroom on the other hand… needs work. This is good advice for when I get more furniture and trinkets as well",
                    "score": 1,
                    "author": "TheRealLanAmore"
                }
            ]
        },
        {
            "level": 0,
            "comment": "budget",
            "score": 5,
            "author": "saltysaltedsal",
            "replies": [
                {
                    "level": 1,
                    "comment": "Absolutely my biggest priority is saving. Fortunately my job allows me to save a ton of money on vehicle expenses",
                    "score": 3,
                    "author": "TheRealLanAmore"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Get a routine. It becomes MUCH easier to manage the little mundane things you have to do on a regular basis when you have a set routine. Try to always wake up at approximately the same time. Try to eat meals at approximately the same time (this will also help you regulate your weight and not gain a bunch of weight). Try to shower, gym, work, etc at the same time.\n\nPretty quickly it becomes second nature and you just do it by rote rather than having to actually think about it. That gives you time to think about the non-mundane things you need to focus on (like school work, or your social life, or your job, or whatever).",
            "score": 3,
            "author": "VVillyD",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah right now my biggest struggle is doing laundry lol. My gym/work/hobby schedule is pretty consistent",
                    "score": 1,
                    "author": "TheRealLanAmore",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Again, find a way to make it routine. Personally, I do laundry on Sundays. I start loads in the morning, then fold laundry after the kids go to bed while watching TV.",
                            "score": 2,
                            "author": "VVillyD",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m actually enjoying doing my laundry right now as I just moved a bunch of my clothes from the 2 bed to my new 1 bed and first thing I did was start a cycle. My plan is to start fresh and then do exactly what you recommended",
                                    "score": 2,
                                    "author": "TheRealLanAmore"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Meet and greet the neighbors so they don’t complain about you to management, the city, etc. \n\nI live a loud life and when I was first on my own, I had a lot of noise complaints and random things that could have been easily avoided.",
            "score": 3,
            "author": "FiremanBillBradley",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oooo this is good. My previous neighbors never came out much but I did make an effort to introduce myself",
                    "score": 1,
                    "author": "TheRealLanAmore"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Learn how to cook for yourself, most grocery portions are for families, so strategic purchasing can either save or break your bank.",
            "score": 3,
            "author": "Phiam",
            "replies": [
                {
                    "level": 1,
                    "comment": "I cook almost every meal I eat and have been for the past 4-5 years",
                    "score": 2,
                    "author": "TheRealLanAmore",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Food costs aside from housing are usually the most challenging. Most of what is in store is for 4 people. \n\nYou're already doing great, keep going. 😎",
                            "score": 2,
                            "author": "Phiam"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Enjoy",
            "score": 3,
            "author": "sceez"
        },
        {
            "level": 0,
            "comment": "The lonliness may be hard at first but it won't kill you, in fact it's likely to be beneficial for building your character and independence in time (if you allow it to.)",
            "score": 2,
            "author": "Sharpest_Edge84",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah this is my biggest concern. I’m 4 months completely sober and generally try to distract myself with social media and video games (nothing wrong that too a point) but I’m trying to break that cycle and focus more on being outside, learning and starting a hobby. I’m thinking of doing lego projects or some kind of art setup.",
                    "score": 2,
                    "author": "TheRealLanAmore",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well done for your efforts so far and you are doing precisely what needs to be done. Find a hobby/hobbies that allows you to be creative. That's a huge help for me, that will also really help your mind and keep you occupied. I like woodworking and metalworking. I also paint from time to time, restore old furniture and build the occasional project. Keeps you sain and the mind off temptation.",
                            "score": 2,
                            "author": "Sharpest_Edge84"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Besides setting a daily routine, set a routine for cleaning your bathroom ( shower and toilet) monthly or bi monthly. Never mix bleach and ammonia based cleaners.",
            "score": 2,
            "author": "Arli3nn",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oooo this is a big one. I tend to keep it pretty clean but have definitely let it get away from me in the past",
                    "score": 1,
                    "author": "TheRealLanAmore"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Treat everyday like you're going to have company later. That's the only way I can keep from turning my house into a pigsty",
            "score": 2,
            "author": "bubdubarubfub",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is great advice. My general living area is always pretty clean. My kitchen is my sanctuary and I’ve always kept it spotless. My bedroom is where I’ll reall have to employ this mindset",
                    "score": 1,
                    "author": "TheRealLanAmore"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Unless you’re in a place that you will be for a few years, don’t waste money on expensive furniture. I would honestly suggest trying to get used furniture that’s only a few years old from OfferUp or Facebook market place. Make sure it’s from a pet and smoke free home and always pick it up with someone else (safety first). The only exception for me would be a bed. Get a new bed.",
            "score": 2,
            "author": "Miamimommy91",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have a queen size mattress and box spring which I carried on my back. I have literally no other furniture lol. Marketplace is great advice. Mostly I just want a decent couch and a coffee table",
                    "score": 2,
                    "author": "TheRealLanAmore",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Perfect! And yes. That’s really all you need. The less stuff the better.",
                            "score": 1,
                            "author": "Miamimommy91"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wash all your plates and utensils the moment you are done using them. Do not allow anything to go in the sink for \"later\". It makes everything much less work and avoids stuff building up. You'll thank me later.",
            "score": 2,
            "author": "WardenWolf",
            "replies": [
                {
                    "level": 1,
                    "comment": "I always kept my kitchen immaculately clean. I am an avid cook so I need my work space to be spotless. But this is good advice nonetheless",
                    "score": 1,
                    "author": "TheRealLanAmore"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Learn to be frugal. Saving 25 or 50 cents here and there WILL at some point mean the difference between eating and going hungry.",
            "score": 2,
            "author": "AiUiPinkeye4023"
        },
        {
            "level": 0,
            "comment": "Plan meals out by the week, pre cook stuff in batches on the weekend and eat it through the week.",
            "score": 2,
            "author": "SomeRandomUser00"
        },
        {
            "level": 0,
            "comment": "Start good habits asap. Get into a routine of cleaning for yourself and seriously, you'll never regret it.",
            "score": 2,
            "author": "swanson_skim_milk",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve been out of my parents house for 4-5 years now. This is my first time living without any roommates. I’m typically very tidy aside from sometimes the laundry gets away from me",
                    "score": 2,
                    "author": "TheRealLanAmore"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Learn to cook a few basic meals, remember to lock up and keep some money in your bank for emergencies.",
            "score": 2,
            "author": "Mundane_Recover1970"
        },
        {
            "level": 0,
            "comment": "Make your meals at home; fast food is convenient but very expensive over time and definitely unhealthy.",
            "score": 2,
            "author": "ToasterOven31",
            "replies": [
                {
                    "level": 1,
                    "comment": "I very rarely eat out besides if I’m going on a date or meeting friends. Although I’ve seen some people recommend meal planning which I’m definitely going to look into",
                    "score": 1,
                    "author": "TheRealLanAmore"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stock your medicine cabinet with all those things you don’t need now but will be very happy to have. Some examples \n- Band aids and other bandages and medical tape (maybe a good first aid kit too)\n- Some sort of rash/skin cream\n- Neosporin for Burns\n- Some sort of disinfectant\n- Your preferred Advil/Tylenol/Motrin etc painkiller\n- Allergy/Decongestants like Dayquil or Aleve",
            "score": 2,
            "author": "azure275",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am notoriously bad at keeping over the counter medicine and medical supplies in stock. It’s always when I get a cold I have to go to the pharmacy which is obviously the worst for everybody. This is one of the best recommendations so far",
                    "score": 1,
                    "author": "TheRealLanAmore"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Buy in bulk",
            "score": 1,
            "author": "amane_cat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you recommend big bill stores Costco Even for just a single person? I typically cook at home but I don’t snack at all. Like I don’t eat chips, or cookies or cereal and I thought that was the big draw for thos",
                    "score": 1,
                    "author": "TheRealLanAmore",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The problem with Costco is not that you can’t easily save 60$ in theory - I do. You can save on anything from meat (as long as you can separate and freeze it’s still good if single) to cleaning products to clothes or food prep stuff. I have a 2 part rule: I can only buy something if it’s individually packaged in manageable sizes *and* it doesn’t have a short term expiration date\n\nThe problem is you’re very likely to blow more then those savings on impulse buys lol. Costco in particular is notorious.",
                            "score": 1,
                            "author": "azure275"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Get into the habit of a daily shopping trip. Cub after work or a target drive up order. The amount of money you'll waste getting  things in bulk and wasting them will cripple you, where if you plan a day ahead and just grab what you need the day before, your always ahead with fresh food.  Its a time investment each day but is really well worth it",
            "score": 1,
            "author": "Player4our",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol this directly contradicts what someone else said and I’m leanin log towards this advice more",
                    "score": 1,
                    "author": "TheRealLanAmore",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I recommend it.  The biggest thing is buying in bulk is fine for everyday things, like cleaning supplies or toilet paper. Even canned stuff is fine. But produce, bread, milk, etc. Buy smaller quantities, it's tough for a single person to get through everything and a lot of stuff will sit forgotten and go bad. You don't want to throw away money",
                            "score": 2,
                            "author": "Player4our",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I agree, but every day seems tiresome. Every third day is fine.",
                                    "score": 2,
                                    "author": "PrayForMojo_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You can customize it I just recommend what I do. I pass a target in my way home from work, so I do a drive up order in the morning on break and make a pit stop to pickup on the way home. Takes just a few minutes, but that works for me",
                                            "score": 2,
                                            "author": "Player4our"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This is probably gonna be my speed. I used to do like 1 every week or every other week when I had a roommate.",
                                            "score": 1,
                                            "author": "TheRealLanAmore"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just to clarify I’ve lived out of my parents house for about 4 years now, this will be the first time I have no roommates and living completely by myself.",
            "score": 1,
            "author": "TheRealLanAmore"
        },
        {
            "level": 0,
            "comment": "Safety - Check all your windows and doors. Do they open, do they close/lock/rattle...for sliders, use a pole in the sill to stop the windows/door being forced open.",
            "score": 1,
            "author": "AutomicBish"
        }
    ]
}