{
    "id": "148koza",
    "score": 49,
    "title": "What did you learn at an embarrassingly late age?",
    "author": "Lazy-Aerie7437",
    "date": 1686677152.0,
    "url": null,
    "media_url": null,
    "comments": [
        {
            "level": 0,
            "comment": "I didn’t learn to ride a bike till I was 13. I’m 44 and still don’t drive a car.",
            "score": 48,
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, at least you have an excuse to never be the designated driver.",
                    "score": 18,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So true. I used that all the time when I was partying in my 20s.",
                            "score": 12
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not embarrassing at all. I don't know how to ride a bike either. Not all parents teach it to their kids and many people don't ride bikes or drive either (hence the existence of public transportation).",
                    "score": 6,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The house I grew up in was at the bottom of a steep hill and my driveway was gravel. It was not ideal for bike riding. Unfortunately the public transportation in my city is almost non existent but, my husband works from home so he drives me to and from work. All of my friends know if they want to hang out they have to pick me up or come to me. 🤷🏻‍♀️",
                            "score": 4,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why don’t you get a car?",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's not bad really",
                    "score": 4
                },
                {
                    "level": 1,
                    "comment": "i didn’t learn how to ride a bike until i was 15. my dad refused to take my training wheels off as a kid so i never learned. at 15 my friend wanted to steal some bikes so we could get back to his house faster and i told him i didn’t know how to ride one. He stole 2 bikes and took me to an empty parking lot and taught me how to ride for like an hour before we went back to his.",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Now that’s a good friend.",
                            "score": 1
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I learned to ride a bike at 30.",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "I taught my friends to ride a bike in their late 20s/early 30s. No shame!",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "The crust under your eyes when you wake up isn't called sand (my parents told me my eyes where crusty because the sandman gave me good dreams) and I still called it sand",
            "score": 29,
            "replies": [
                {
                    "level": 1,
                    "comment": "In Dutch its actually called slaapzand, \"sleep sand\", and I believe it has a similar name in German too at least.",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In german it's \"Schlafsand\" which means exactly the same",
                            "score": 1
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The technical term is \"eye boogers\"",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "I’ve always called it “sleep”. As in “I’ve got sleep in my eyes.” Seems common among those I know in the UK, anyway.",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "Rheum",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "The technical name is eye-boogers.",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "In Persian culture  the term for eye boogers is \"sharbati,\" which translates to \"sandy.\"",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "I couldn't snap my fingers until I was 18. I just didn't understand the mechanics of it. I still don't know how to whistle properly or loudly.",
            "score": 20,
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm 37 and I can't snap my fingers or whistle. I tried so many times when I was younger but I just couldn't ever do it and I eventually stopped caring enough to try anymore.",
                    "score": 4
                },
                {
                    "level": 1,
                    "comment": "Just FYI on the whistling, cause I struggled for a long time too, the sound comes from the damp part just slightly on the inside of your lips, and moving your tongue forward or back in your mouth (to change the volume in your mouth, volume as in size not loudness) adjusts the pitch.",
                    "score": 3
                },
                {
                    "level": 1,
                    "comment": "Same",
                    "score": 7
                },
                {
                    "level": 1,
                    "comment": "Christ you're basically paraplegic",
                    "score": 2
                },
                {
                    "level": 1,
                    "comment": "just go like this:\npffffffffffffffffff",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "It took me forever to learn to snap because I always thought the sound came from your middle finger and thumb rubbing together instead of using your thumb to build up tension and have your middle finger loudly slap your palm and ring finger. Once I realized that it was easy to do.",
                    "score": 2,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Holy shit you literally just made me learn something new",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That organism and orgasm were two different things",
            "score": 14
        },
        {
            "level": 0,
            "comment": "I was 56 before I learned that many African-American women use hair weaves, wigs, etc. to create different styles.",
            "score": 13,
            "replies": [
                {
                    "level": 1,
                    "comment": "Don’t feel bad; I didn’t know this either. Found out in my early 20’s. Worked alongside some fantastic black women who would seemingly change their hair on a dime and I couldn’t figure out how. I figured some of it had to be extensions or something, but I honestly had no idea how realistic wigs can be (my only experience prior with wigs was those shiny neon ones for Halloween).  \n\nI remember always complimenting them on their hair and commenting how I loved how they changed it so frequently; like to match an outfit or something. I asked how long it would take them (I was picturing hours in a salon after work) and they rightfully laughed at my stupid ass and showed me that many of them were wearing wigs. I was just floored. Couldn’t believe the realistic hair-parts in the wig hair that looked like it was down to their scalp. We had a good laugh about it!",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "Lol I find this hilarious, as a Black woman!",
                    "score": 6
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was 16 years old when I learned ho babies are made\n\nBefore that I thought 2 people get married they pray to god for a baby and get one\n\nEdit: and I learned it in a very embarrassing way. I will never forgive my parents for this😑",
            "score": 60,
            "replies": [
                {
                    "level": 1,
                    "comment": "This is fucking awesome",
                    "score": 21
                },
                {
                    "level": 1,
                    "comment": "That’s better than me! Up until I was about 12 I thought women became spontaneously pregnant. I remember asking my mum once when I was little what happened if nuns became pregnant",
                    "score": 3
                },
                {
                    "level": 1,
                    "comment": "Catholic highschool?",
                    "score": 11,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Coming from a catholic middle and high school that’s definitely not the reason.",
                            "score": 9,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "yea there are some christian denominations where they might ignore the existence of sexuality but catholicism is not one of them\n\ni mean how can they make you feel guilty for having sexual impulses if you dont know what they are?\n\nalso kinda diminishes the significance of the immaculate conception if thats how you teach how all babies are made\n\nthis seems more like sheltered homeschooler shit",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "More than likely not a catholic school. The bulk of the time you hear stories of a school not teaching biology or something like that it is some small independent Protestant offshoot no one has ever heard of.",
                            "score": 1
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "babies come from [storks](https://youtube.com/shorts/aUvMQpGgG-A?feature=share)",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "I thought that the color of the baby was random and that in movies when two people had a baby with a different skin color than they were; they were upset because the baby was a different color and didn't realize they were upset because someone cheated.",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "Omg same I was like 14 I think but when I was in middle school I thought you got pregnant by making out naked under the covers. And I thought babies came out the belly button",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "Dont be angry with them.  Being innocent is not a bad thing.  Now you know.  I think its nice that you got to 16 without knowing things that children really don't need to know. I hope you have a wonderful life.",
                    "score": -37,
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I thought that girls pee from their butthole until I was like 16.",
            "score": 12
        },
        {
            "level": 0,
            "comment": "Didn't know how to pronounce hyperbole until my mid 20's.\n\nI used that word a lot.",
            "score": 14,
            "replies": [
                {
                    "level": 1,
                    "comment": "hyper bowl?",
                    "score": 16,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The hyperest of bowls",
                            "score": 13
                        },
                        {
                            "level": 2,
                            "comment": "Nah, hyper ball.",
                            "score": 1
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I live in fear at 39 of having to pronounce macabre in front of other adults.",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "hi per bowl lee",
                    "score": 3,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "there is no \"w\" sound in the word.  Hi-per-buh-lee or Hi-per-bo-lee",
                            "score": 1
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Imagine my chagrin",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "Also, I learned that men also have nipples at around age 8 or something.\n\nHow? I have no clue. Just one day in the changing room in PE at school I noticed that my friend has them. Then I looked at my chest, and I was like, oh, I also do?\n\nI still don't know how didn't I notice that. I knew that girls have them because I've been to a car mechanic and I saw the posters, lmao.",
            "score": 11,
            "replies": [
                {
                    "level": 1,
                    "comment": "Lmaooo this is the funniest thing ever",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "Babies come out of the vagina.  I was a c-section so I thought all babies were born by cutting into the stomach.\n\nThanks, Darryl, for eloquently pointing out how stupid I was and that (direct quote) “babies come out of the cunt, dickhead!”",
            "score": 12
        },
        {
            "level": 0,
            "comment": "I'm 29. I can barely tie my shoes and I cant drive",
            "score": 28,
            "replies": [
                {
                    "level": 1,
                    "comment": "Tying shoes is DIFFICULT. how do people do it so easily",
                    "score": -8,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Muscle memory tbh",
                            "score": 16
                        },
                        {
                            "level": 2,
                            "comment": "Do you do 1 bunny or 2 bunnies?",
                            "score": 4,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Loop swoop and pull",
                                    "score": 1
                                },
                                {
                                    "level": 3,
                                    "comment": "2 for activities, 1 for sitting",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It comes naturally to some, difficult to others, myself included.",
                            "score": 1
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I forgot how to tie my shoes once when I was 12 or 13. \nI spent the whole summer slipping on my old shoes that were already laced and tied, then I got a new pair of shoes for school.",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "I didn't know I was supposed to wash my lady bits until I was in bootcamp and saw other women doing it.",
            "score": 7,
            "replies": [
                {
                    "level": 1,
                    "comment": "Like you wouldn't scrub it with soap? Or do women clean *inside* the vagina when showering?",
                    "score": 5,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’re supposed to wash the outside with gentle soap and rinse thoroughly. The inside cleans itself and if you put soap in there it will mess with the ph balance.",
                            "score": 20,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And STING!",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I was raised by very conservative parents. We never talked about that kind of thing and I never thought to wash there.",
                            "score": 9
                        },
                        {
                            "level": 2,
                            "comment": "The vagina is a self cleaning organ. You can wash the outside but don't ever put soap or anything like that inside. It's not good",
                            "score": 1
                        },
                        {
                            "level": 2,
                            "comment": "[This works best.](https://sites.create-cdn.net/siteimages/20/4/5/204569/15/0/5/15057714/1000x1000.jpg?1489940110)",
                            "score": 5,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh God 😳",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same for me with my belly button. I was always squeamish about my belly button and so did my best to just ignore it. My first boyfriend is the one that kindly asked if it was always like that (just plain dirty lol)",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "What?!! How? Like wouldn't you just wash it like any other body part? I can't wrap my head around not knowing this!",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "you have to buy 2 rings",
            "score": 8,
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol same here, l learned that when a friend of mine got engaged and married a year after and he told me about the wedding ring. l thought people just swap from one hand to another.",
                    "score": 4,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My Fiance fully believed this until he proposed to me and was shocked that we had to buy me a wedding ring as well as an engagement ring.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm 30 and I don't know how to flirt. Or kiss. Or dance with women.",
            "score": 35,
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, this is Reddit, so everyone has this problem too. Nothing to be ashamed of, we're all virgins here.",
                    "score": 23,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Storks need to chill with their dropping off then.  I’ve got 2 kids. No clue where they came from.",
                            "score": 2
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No worries, it's about the same as dancing with men.",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "Try it with men instead.",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "I am 34, married 4 years now. I have no idea how it happened. I don't know why she puts up with me. I will keep her as long as she is misguided enough to stay.\n\nThat said she thinks its cute because apparently women flirt with me all the time and I'm completely oblivious to it. I can recognize flirting when I see anyone else doing it, but direct it at me and I see it as clearly as Stevie wonder can read sheet music",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm happy for you bro. At least one more of us could find love",
                            "score": 1
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And I also can't dance, or flirt, and apparently I'm a terrible kisser",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't know if this counts, but I was really sheltered all through high school. I used to love the Aerosmith song \"Big Ten Inch Record.\" I kind of forgot about the song for almost 15 years; I listened to it again at age 30 and suddenly realized that the whole song is a double entendre for a 10 inch penis. The song literally contains phrases like \"whip out my big 10 inch... record.\" Like how sheltered was I that it never even crossed my mind back then.",
            "score": 6
        },
        {
            "level": 0,
            "comment": "The word \"lackluster\" literally means to lack luster",
            "score": 6
        },
        {
            "level": 0,
            "comment": "Orange red yellow and green bell peppers are the same",
            "score": 16,
            "replies": [
                {
                    "level": 1,
                    "comment": "Wait until you hear about black, green, and white tea!",
                    "score": 8,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wait… I can’t tell if you’re joking lol",
                            "score": 3,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "All \"tea\" is made from the same plant, it's just harvested and/or treated differently.\n\nExcept herbal tea. Herbal basically means \"not made from tea plant.\"",
                                    "score": 5
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I disagree.  The greens are nowhere near as sweet as orange, red, and yellow.",
                    "score": 7,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They're the same plant but at different stages of maturation which is why they taste different.",
                            "score": 16,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That the Undertaker's manager Paul Bearer was a play on words.",
            "score": 5
        },
        {
            "level": 0,
            "comment": "That pickles are just brined cucumbers.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "I was nearing my 30’s when I figured out some people in a professional environment will actually refuse to do their part , even if the result is less pressure and more pay.",
            "score": 13,
            "replies": [
                {
                    "level": 1,
                    "comment": "30s here. I think this may kinda apply to me. I always do the best of my ability to fulfill the responsibilities of my job, but find it super strange when those around me go above and beyond \"for the company.\" The last place I worked, many employees held a weird fear/reverence whenever the company founders would come around, or were even mentioned in conversation or memos. I was often made to feel guilty for not putting in extra work above my pay grade. Out of that environment now and have never been happier.",
                    "score": 6
                }
            ]
        },
        {
            "level": 0,
            "comment": "That adults don't actually have their shit together most of the time, and generally don't know shit.",
            "score": 11,
            "replies": [
                {
                    "level": 1,
                    "comment": "Learned this during adulthood. Like…we’re really all just out here winging it? Noted.",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "Best response!",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "I never knew people had sex simply for fun. I thought it was strictly for procreation purposes only. I think I was in my late teens when I came to this realization. For those wondering \"how?!\" I'm an asexual.",
            "score": 11,
            "replies": []
        },
        {
            "level": 0,
            "comment": "My radio station had people calling in on the theme of \"Lies your parents told you\". One woman said she was 12 before she learned that the ice cream truck didn't give kids shots.",
            "score": 3
        },
        {
            "level": 0,
            "comment": "I was 11 when I learned vagina isn’t bagina. For the first 11 years of my life I was just saying bagina and when someone said it started with a V I didn’t believe them",
            "score": 1
        },
        {
            "level": 0,
            "comment": "That there’s absolutely no meaning to and no purpose in life.",
            "score": 12
        },
        {
            "level": 0,
            "comment": "Women having a separate opening near the vagina that they pee from, instead of just the same hole us bro use to piss and jizz",
            "score": 5,
            "replies": [
                {
                    "level": 1,
                    "comment": "did somebody watch orange is the new black",
                    "score": 4
                }
            ]
        },
        {
            "level": 0,
            "comment": "you’re not supposed to eat the tails off of fried shrimp 🍤",
            "score": 5,
            "replies": [
                {
                    "level": 1,
                    "comment": "You can though! I love the crunch",
                    "score": 9
                },
                {
                    "level": 1,
                    "comment": "I always eat the tails off of fried shrimp. They are so damn good and crunchy.",
                    "score": 5
                }
            ]
        },
        {
            "level": 0,
            "comment": "I started skating at 24",
            "score": 4,
            "replies": [
                {
                    "level": 1,
                    "comment": "that’s not embarrassing- skating is commonly a hobby and not something everybody can do.",
                    "score": 3
                },
                {
                    "level": 1,
                    "comment": "I'm 32 and Canadian as well...and I still can't skate..",
                    "score": 2
                },
                {
                    "level": 1,
                    "comment": "Not embarrassing at all if you ask me",
                    "score": 2
                }
            ]
        },
        {
            "level": 0,
            "comment": "Knowledge is power, but France is not bacon.",
            "score": 5
        },
        {
            "level": 0,
            "comment": "Self care. I am just now learning to prioritize my own, health, needs, wants etc. I am in my early thirties.",
            "score": 4
        },
        {
            "level": 0,
            "comment": "How sex works",
            "score": 2,
            "replies": []
        },
        {
            "level": 0,
            "comment": "Riding a bike, it was in a kid’s box bike when I was 14-15. All my friend were driving bikes years before me.",
            "score": 2
        },
        {
            "level": 0,
            "comment": "The word cupcake = just a cake, in a cup.",
            "score": 2
        },
        {
            "level": 0,
            "comment": "I only learned to tie my shoes properly in my late 20s, by googling it.\n\nI'd been doing the bunny ears for DECADES.",
            "score": 2,
            "replies": [
                {
                    "level": 1,
                    "comment": "Bunny ears are good too tho..",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was 60+ when I learned that the sun visors in my car slide over when the sun is in an awkward place.",
            "score": 2,
            "replies": [
                {
                    "level": 1,
                    "comment": "Q only had time to explain the most important gadgets and features in your car, Mr. Bond.",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "Baby powder on your balls.\nDoes wonders to keep you dry and smelling nice",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "Careful, modern science is showing the body powders may cause cancer!",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "How to tell when someone is just being nice vs when they actually wanna hang out",
            "score": 1
        },
        {
            "level": 0,
            "comment": "That it is namby-pamby, not mamby-pamby.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "That I'm autistic.",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "Same here.",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A lot of things suddenly made sense, yeah?",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That lamb and sheep are the same animal. This was 2 years ago when I was 43.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "I thought women peed out of their butts until like 13, as I was repeatedly told they don't actually pee out of their vaginas, but that turned out to be bullshit, they pretty much do.\n\n\"No, they pee out of a different hol...\"\n\nYeah, no shit, of course I knew they didn't pee out of that same main hole, but the hole they do pee out of is 100% part of what is colloquially referred to as the vagina. Sure, medically it isn't, but c'mon.",
            "score": 14,
            "replies": [
                {
                    "level": 1,
                    "comment": "If it makes you feel any better\n\nI thought the same\n\nAnd guess what? I'm a girl",
                    "score": 8
                },
                {
                    "level": 1,
                    "comment": "Truth\n\nsource: vagina stretches from the anus to the belly button",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "People here seem to be very pedantic with that.",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "&gt;but the hole they do pee out of is 100% part of what is colloquially referred to as the vagina.\n\nVulva. Referring to the whole thing as the vagina ends up confusing people. The whole thing is called a vulva. You don't say \"my foot is broken\" when you mean your leg.",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s referred to as a vagina in modern parlance.",
                            "score": 0,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And? That doesn't make it any less incorrect.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So, to say \"No, women don't pee out of their vaginas!\" when someone says it is just being an annoying pedant.\n\nIt's like hearing someone say \"I can see that one of that dude's organs!\" and saying \"You can always see someone's organ, the skin.\"",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It must be men who are saying this. Women know we have 3 separate holes. We pee out of our urethra just like men do.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Exactly. Calling it all the vagina is...idk how to put it. Inaccurate? Like I said before, like calling your entire leg a foot. It'll just cause problems.",
                                                            "score": 1
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "totally false. there is nothing annoying, pedantic, or modern at all to any if it. it's just chatting the simple truth. you're pretending to gatekeep conversation, which is categorically literally annoying and puerile. \n\nexcept no, the whole thing is not called the vulva but the genitalia. part is vulva, part vagina, all genitalia.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "\"The vulva is the global term that describes all of the structures that make the female external genitalia. The components of the vulva are the mons pubis, labia majora, labia minora, clitoris, vestibular bulbs, vulva vestibule, Bartholin's glands, Skene's glands, urethra, and vaginal opening.\"\n\nhttps://www.ncbi.nlm.nih.gov/books/NBK547703/#:~:text=The%20vulva%20is%20the%20global,%2C%20urethra%2C%20and%20vaginal%20opening.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "that my penis would shrink and my balls can now fill a Mason jar.\n\nI'm 58 y/o",
            "score": 3,
            "replies": [
                {
                    "level": 1,
                    "comment": "Go check that out, not the shrinkage.",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "When I was in like primary school, I learned about European conquests and colonisation. I learned that when Europeans came to the Americas, there were indigenous people there. When they came to Australiaz there were people there. When they came to Africa, there were people there. When they came to Greenland, there were people there. \n\nIt took me until middle school to realise that the same did not apply to Antarctica. My kid brain was just assuming that Antarctica used to have a bunch of Inuits in it before Europeans came and made it a wasteland.",
            "score": 3
        },
        {
            "level": 0,
            "comment": "My wife just figured out why surf and turf is used for describing seafood paired with steak at 30 years old.",
            "score": 2
        },
        {
            "level": 0,
            "comment": "That exit numbers on the highway correspond with the nearest mile marker, I never paid attention for about 20 yrs of driving lol.",
            "score": 2,
            "replies": [
                {
                    "level": 1,
                    "comment": "But not in the UK.",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "People generally dont like ultra conservative ideology except for ultra conservative people",
            "score": 1
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -6,
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm pretty sure it's an anti-humor and not a suicide joke.",
                    "score": 15
                },
                {
                    "level": 1,
                    "comment": "Not a suicide joke",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pickles, I don’t like them so I never bothered to know where they came from, always thought it was a different type of vegetable/fruit but no, it’s just pickled cucumber.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "I got my first driver's license at 37.",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "I got my license at 36.",
                    "score": 2
                }
            ]
        },
        {
            "level": 0,
            "comment": "cooking",
            "score": 1
        },
        {
            "level": 0,
            "comment": "That ASAP stands for as soon as possible.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "I was about 12 when I learned Easter was a religious holiday.  I asked friends why they had to go to church on Easter instead of looking for candy and colored eggs.  Yes, raised in non religious household.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "So yknow a map. When you look at a map you can see every single country. Well when I was younger up until 12 or so I wondered what was on the other side of the map lmao. I seriously thought that maps only showed half of the world and the other half was on the other side. Idk why I thought this cause I understood globes perfectly well and knew the earth wasnt flat",
            "score": 1
        },
        {
            "level": 0,
            "comment": "At 24 I realized I fucking suck at being an artist and I need to give up on my dreams of making comics. I should have quit way sooner.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Money Changer is not a place where you can swap large bills for coins so that you can make a call on a public payphone.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Don’t flush tampons",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Learned how to drive at 27 🫣🫣🫣",
            "score": 1
        },
        {
            "level": 0,
            "comment": "I used to think my great grandmother was some nice lady we invited to family events. I didn’t figure it out until my grandma passed away when I was 16. My great grandmother is still alive and kicking it at 98. I love spending time with her.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "When Lil Wayne says \"real G's move in silence like lasagna' like??? There's no way that long floppy noodle is the quietest one out there. Didn't realize until I was like 22 what he was actually referring to.",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "I have no idea what that means.",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was in my mid-20s before I realized that the clouds and bushes in Super Mario Bros were the same graphic with different colour palettes. I grew up with that game.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "I recently learned how to whistle, I'm 33.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "I didn't know about oral stds til i was a college freshman in sex ed. Holy f*ck. Nasty stuff. 27 now n i was 20 when i learned about em. \"",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Your eyes will not stay crosseyed if you do it alot or for too long. I just annoyed my parents doing it all the time. I learned this at age 27",
            "score": 1
        },
        {
            "level": 0,
            "comment": "How to tie my shoes or how to tie anything",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Didn’t learn to tie my shoelaces until 13.",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "Yikes?  How?",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "I didn't realize I was circumcised until I was a Junior/Senior in high school. My parents never told me. It sort of clicked extremely randomly one afternoon when Asriel in one of the Golden Compass books mentions 'Intercision' and makes a direct comparison to circumcision. I wasn't unfamiliar with porn at that point, but dicks were always hard and never looked TOO different. For some reason, I thought ALL the shaft skin was removed or something. But I googled comparison images on Google a few minutes later and that settled it. \n\nI'm the oldest male cousin in my family and didn't have any guy friends that I ever saw naked so I didn't really grow up around any other nude guys. Still haven't seen another penis in person.  \n\nI didn't realize I was circumcised until I was a Junior/Senior in high school. My parents never told me. It sort of clicked extremely randomly one afternoon when Asriel in one of the Golden Compass books mentions 'Intercision' and makes a direct comparison to circumcision. I wasn't unfamiliar with porn at that point, but dicks were always hard and never looked TOO different. For some reason, I thought ALL the shaft skin was removed or something. But I googled comparison images on Google and that settled it.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "What love is, or that it actually exists.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "I learned yesterday that donuts are fried",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Didn’t learn to write a lowercase q until I was like 14, just never had a teacher mark it wrong ig",
            "score": 1
        },
        {
            "level": 0,
            "comment": "that pussy doesnt get loose after lots of sex",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "I just love how people think this, but don't think anything happens to dicks from repeated mechanical forces. Nobody is worried about developing noodle dick syndrome lol.",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "That I'm suppossed to wash my scalp and not my hair.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "35. Excellent Chess player. Zero idea how to play poker. So I guess I never learned which doesn't qualify.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Emotional regulation. Not until about 41 for that. That's embarrassing.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "That English isn't a Romance language. My Spanish textbook said it was.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "I was 19 before I learned that fine China are actual dishes you eat off of (I learned that watching the Sopranos). Before I always thought fine China were just fancy dishes you bought to show off in some hutch or cabinet or something, never to be used.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "I didn’t know penises existed until I was in middle school. I just thought everyone had vaginas and sex was basically just scissoring each other. I finally found out through porn and really changed my view of the world after that.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "It wasn't me but I have a pretty solid story for this:\n\nSo I wrestled in high school and cutting weight was a big thing back then(it's been culled, and rightfully so) so we used to have a tradition of going out to eat at a buffet after we made weight and wrestled our matches; and during this, we ate as much as we possibly could. \n\nSo one time, we went to a chinese buffet after a pretty successful match and one of my wrestling buddies took all of the shrimp that were left so none of us could have any. He had a whole plate of shrimp and I jokingly said \"Ugh, I don't know how you eat that shit, knowing it's whale sperm and all\" after that, he acted disgusted and shoveled the shrimp to all of us, which we gladly ate. \n\nFast forward 7 years, this guy called me and said he hadn't been eating shrimp for 7 years because he thought it was whale sperm and just looked like an idiot for mentioning it in a business meeting.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "I thought mustard was made from worms until my mid 20’s",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Kars-for-kids does not in fact, give the cars to children. I was in my mid 30 when I mentioned what a terrible idea this was to my gf after seeing a billboard, she was speechless. It made much more sense when she explained it...",
            "score": 1
        },
        {
            "level": 0,
            "comment": "I dint learn what co-dependency was until it was way too late.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Ctrl-z",
            "score": 1
        },
        {
            "level": 0,
            "comment": "I was probably 25 before I realized that the reason people drink coffee is because it’s loaded with caffeine which gives them energy for the day. I thought it was just a drink that people liked and got addicted to like anything else.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Basic financial and legal stuff like probate, property law, dividend stocks vs. growth stocks, tax strategies, etc.  The knowledge they never teach in high school, in other words.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Alabama and Louisiana don’t border each other.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Masturbation stinks.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "26 knows to drive a car but still bit scared\nOh dont know to parallel park \n\n\nAlso dont know to reverse a motobike if im going against a slope",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Okay please don’t judge me. I don’t listen to his music or know him at all, really. \n\n\nThat Bob Marley is the Jamaican guy on those shirts. \n\nFor whatever reason I didn’t put two and two together. \nBob Marley is such a generic white guy name to me. And when I hear about him (which I rarely do), it goes along with talk of marijuana and “hippy” vibes. So I picture “white hippy guy who does music”. \n\nI’d see his face plastered on clothing and know “oh hey, that’s guy who does reggae music - he’s a famous singer”. Like, my brain was on the cusp of putting things together, but not quite. 😂",
            "score": 1
        }
    ]
}