{
    "id": "148n3l4",
    "score": 259,
    "title": "What has you mentally fucked up right now?",
    "author": "Aware_Warthog6071",
    "date": 1686683497.0,
    "url": "https://www.reddit.com/r/AskReddit/comments/148n3l4",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Recently got divorced and \"Restarting\" so many facets of my life has been pretty rough. Having a 15 year routine suddenly derailed is not easy to navigate.",
            "score": 112,
            "author": "Nhtechie112",
            "replies": [
                {
                    "level": 1,
                    "comment": "Feel that one. Divorce after 14 years with a closet narcissist. Moving back in with family and losing my 'forever home' of 8 years is not fun. Wondering where the fuck to go from here. Travel adventures and new persuits/social groups are generally feeling like a mere band-aid... But it's nice to be discovering my own wants and feelings instead of deferring all to the narcissist. Silver lining.\n\nDifficult adjustment.",
                    "score": 33,
                    "author": "Delamoor",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just found a turtle in my garage. I have no idea as to how it got in there.",
            "score": 75,
            "author": "Sea_Ganache620",
            "replies": [
                {
                    "level": 1,
                    "comment": "The turtle chose you.",
                    "score": 1,
                    "author": "Leather-Rice5025"
                },
                {
                    "level": 1,
                    "comment": "Turtles are very perceptive of people - I suspect it was observing you from afar, liked what it saw, and decided it had found a new home. This turtle is now your responsibility.",
                    "score": 1,
                    "author": "Notorious_Fluffy_G"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Finally coming to terms that I straight up have ADHD and I need to do something about it, it's affected my life long enough.",
            "score": 197,
            "author": "93M6Formula",
            "replies": [
                {
                    "level": 1,
                    "comment": "Best of luck to you with that, it's been 3 years since I learned I had ADHD in my thirties and I'm still having little personal revelations about how it's shaped my whole life without my knowing. But on the other hand, medication has improved my quality of life drastically. I hope you are in a place where assistance is easy to come by!",
                    "score": 46,
                    "author": "thefifthdentist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you, just turned 33 and yeah it has recently hit me like a ton of bricks. I've always been conscious of it but I just now realized like you said how it has absolutely shaped my life and daily tasks. It's an absolutely stressful way to live and I officially can't take any more. I finally made the call today actually to hopefully get help.",
                            "score": 19,
                            "author": "93M6Formula",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "49 here. Diagnosed a few months ago, haven't started medication yet.\n\nMy wife and I have been evaluating how much it's affected me without realizing it. From physical altercations with other people, insomnia, lack of focus to hyper focusing on chaotic situations.\n\nIt's mind-blowing and down right sad how much better my life could have been if my parents had bothered to check on all the signs that have been there my entire life.",
                    "score": 9,
                    "author": "Jherek7373",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "The murder of my younger sister. The abusive boyfriend who killed her was never charged. Our youngest sister died randomly in her sleep a few years after that.",
            "score": 56,
            "author": "mike_hellstrom",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry man that’s horrendous sending you and your family love not sure how but hope you find some peace 💖",
                    "score": 1,
                    "author": "Additional_Ninja_255"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Found out I was being cheated on, became unemployed, lost my flat and had to move 200 miles away to live with my parents in the space of a month last year. \n\nStill not recovered.",
            "score": 285,
            "author": "KezzaJones",
            "replies": [
                {
                    "level": 1,
                    "comment": "just leaving a heads up, you are not alone.",
                    "score": 68,
                    "author": "aooreki"
                },
                {
                    "level": 1,
                    "comment": "Shit, I thought I was having a rough go.. Hope life gets better, stranger.",
                    "score": 20,
                    "author": "FkdUp2020"
                },
                {
                    "level": 1,
                    "comment": "Maybe a blessing in disguise. Sucks horribly about losing your job, I’m glad you found out you were being cheated on. Sucks to say that but hopefully it saved you from wasting years or time in your relationship.",
                    "score": 1,
                    "author": "YT_ToxicNinjaGaming"
                },
                {
                    "level": 1,
                    "comment": "When one.. or in your case.. many doors close then more opens up.. go find it, life isnt fair and its unexpected,  get up, brush yourself off and start over.. time waits for no one , life keeps on going no mattet what happens ... you might be 100X happier soon.. you never know",
                    "score": 1,
                    "author": "juniorboo239"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm having high school type romantic problems while I'm almost 30. I'm not a fan.",
            "score": 331,
            "author": "Chicken_Alphredo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can relate. I’m butt hurt over being ghosted by someone I met on Reddit.",
                    "score": 118,
                    "author": "Aware_Warthog6071",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just being ghosted in general. I’m 34 and divorced, that’s literally all I come to expect anymore.",
                            "score": 41,
                            "author": "ezaharko",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm 27 and still get hurt when ghosted",
                                    "score": 23,
                                    "author": "throwawayy509",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "31 and it still hurts but I always bounce back in a day or so.",
                                            "score": 15,
                                            "author": "Repulsive_Look_5843"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That sucks. I actually met this gorgeous girl last year from Reddit. She helped me through a lot in person. Sweetest, funniest girl you could ever meet. Really switched on and just awesome in every way. \n\nShe ended up killing herself about six months later, and left a video on YouTube which she linked to her Facebook profile explaining that she wouldn’t tell anyone why she was doing it and basically to please just respect her privacy and that she was sorry for not reaching out for help and leaving everyone in the dark. After a bit of digging around, we worked out where she was and the police found her body the next day. \n\nIt was such a mind fuck and a year later I still haven’t really processed it. I still think about her every day. Amazing how random strangers from the internet can affect you in such a big way eh.",
                            "score": 1,
                            "author": "doxjq",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I know right? Reddit people are the best and just when you think they are your next best friend, they ghost you.",
                            "score": 6,
                            "author": "someoldman63"
                        },
                        {
                            "level": 2,
                            "comment": "Haha same here, very bizarre feeling",
                            "score": 14,
                            "author": "In_Too_Deep69"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I just ended a 9 year relationship because someone was so selfish they stayed out till 230 or later on the eve of interviews when they had been unemployed since February. \n\nMy advice, if it's that bad, just get them out of your life. It's not easy but neither are selfish shitty people. Be free",
                    "score": 10,
                    "author": "ronculyer"
                },
                {
                    "level": 1,
                    "comment": "i just got out of a long lasting relationship, my romantic experience with new people is the same as what i had when i was 17, which is almost nothing \n\ni'm having issues too",
                    "score": 16,
                    "author": "danipao01"
                },
                {
                    "level": 1,
                    "comment": "I'm 38 and right there with you.",
                    "score": 4,
                    "author": "musket85"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Social anxiety got me fucked up",
            "score": 116,
            "author": "Zestyclose-Salt-2491",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same👍. 4 years and counting and Ill never get them back.",
                    "score": 8,
                    "author": "Pro4791"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wondering what the fuck just happened and why my whole world has gone to shit, stressing on the outcome and how it's going to affect my son.",
            "score": 103,
            "author": "Salty_Blueberry_1214",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hang in there. I was in the same mindset but turned it around.",
                    "score": 18,
                    "author": "AnaDingoDD"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My anti depression dosage was just doubled today haha, physically I'm good and sober for +5 months now but mentally I'm just a trainwreck atm lol",
            "score": 33,
            "author": "ravendarkangelx",
            "replies": [
                {
                    "level": 1,
                    "comment": "The first time I got sober I was seeing all these other sober people having these great lives and talking about how great recovery is.  I kept thinking, \"ok, just hold on, things are going to get better...\".\n\nI think those people didn't have mental health issues that affected them like mine do.  I'm a little over 5 years sober this time and I'm so tired and frustrated from trying to do everything 'right' to manage my depression.  \n\nMental illness is a bitch.  Don't get hard on yourself if you're not where others in recovery are.",
                    "score": 13,
                    "author": "can-i-live-there"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Social anxiety. Depression. Not be able to cry. Scars on my arm. Family problems. My idc mindset. Etc",
            "score": 80,
            "author": "the_one_walnoot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are you me?",
                    "score": 7,
                    "author": "SirFluffyBear"
                },
                {
                    "level": 1,
                    "comment": "Have you been tested for ADHD? I was recently and I have a lot of what you mentioned. More research shows how so many things stem from it.",
                    "score": 4,
                    "author": "Jherek7373"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The feeling that I should have achieved more by now. The feeling that I missed out on many things. The feeling that I'm not enough. The feeling that I may not like myself if I ever met me.\n\nIt's fucked up, I know.",
            "score": 29,
            "author": "MithrandirLXV",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My body mind and soul are disconnected :/",
            "score": 22,
            "author": "SpaceBarPirate",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Life",
            "score": 22,
            "author": "Oryp7"
        },
        {
            "level": 0,
            "comment": "PC broke itself, car broke down and totaled itself, fiance left me, had to move in with my parents, have to sell the house, and my job is eliminating my position so I'm being laid off.\n\n\nIt's a struggle right now. A reeeeaaaaal struggle.",
            "score": 53,
            "author": "blackninja4",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow, my life's been shit since january. Girl left me too, business is bad.. Now one of my legs is hurt.. but yours is fuck8ng shit",
                    "score": 9,
                    "author": "Charlitosquad"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Met a girl for some days, got pretty close pretty quickly and now, out of nowhere, i think she's avoiding my texts/not answering as often as she did.\n\nMy head is all over the place if something went wrong and i didn't notice or if she just doesn't want to get attached",
            "score": 110,
            "author": "danipao01",
            "replies": [
                {
                    "level": 1,
                    "comment": "Feel you. I was in a relationship that lasted a few months, she had introduced me to her friends and fam (confirmed they “loved” me), and then went on our first trip together. \n\nEverything felt so perfect, I had never felt so secure and comfortable with a partner this quickly. Normally it takes me 6 months to get to point where I know I am “in love”, but I was there. Sex was amazing, we never got into any big fights and the small disagreements we had were sorted out and resolved quickly.\n\nThen the trip happened and she felt cold all weekend. Get back home and she breaks up with me. Talk about whiplash. Still sorting it out in my head. \n\nAt the end of the day we had a lot of big differences, none of which were dealbreakers for me, but I guess they were for her…",
                    "score": 1,
                    "author": "Notorious_Fluffy_G"
                },
                {
                    "level": 1,
                    "comment": "Call her but I'd say she's either not interested anymore or she's going through a lot. Either way, she has to communicate with you. If she doesn't, swallow that hard pill and move on.",
                    "score": 15,
                    "author": "2babayaga",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yeah, i'm waiting for the dust to settle a little bit, maybe she's just not having her best days, gotta give her time too",
                            "score": 5,
                            "author": "danipao01"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Loneliness",
            "score": 17,
            "author": "theunitedguy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Only if we lonely guys came together...",
                    "score": 5,
                    "author": "FunkyMoth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Grindr has you covered.",
                            "score": 1,
                            "author": "CommissionerOfLunacy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe it sounds dumb but I put myself out there for my husband by being really open and vulnerable about what I want from him sexually and he either pussied out or just isn’t interested idk. I have a vulnerability hangover and I feel mad and let down and embarrassed",
            "score": 14,
            "author": "Happy-Sprinkles8138"
        },
        {
            "level": 0,
            "comment": "Theres a bat somewhere in my house and i cant find it",
            "score": 15,
            "author": "billyjoelschilibowl",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cover yourself completely when sleeping. Sometimes you can’t even feel their bites - don’t wanna take that chance. Contact a professional to get it out",
                    "score": 3,
                    "author": "v_for__vegeta"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Aliens probing me with their long fingers for answers to the crossword puzzle...",
            "score": 35,
            "author": "Damn_it_billy",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hate when that happens",
                    "score": 11,
                    "author": "Aware_Warthog6071"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Crippling romantic loneliness and the fact it's my own fault because of my lack/fear of socializing in my younger years so now I'm just not worth it anymore.",
            "score": 40,
            "author": "AMistakeWasMade0",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same here",
                    "score": 6,
                    "author": "throwawayy509"
                },
                {
                    "level": 1,
                    "comment": "Can I join this forever alone party?",
                    "score": 4,
                    "author": "can-i-live-there"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Resignation from job, follow by mother dying and month later my cat dying.",
            "score": 12,
            "author": "FinalBoysenberry1031"
        },
        {
            "level": 0,
            "comment": "A patient of mine was in a car accident unrestrained, ejected from the windshield, and is now quadriplegic (paralyzed from neck down.) He has said nothing since he's been able to communicate other than \"I don't want this. I can't live like this. Let me be in hospice care.\" He had Do Not Resuscitate orders signed and filed.\n\nThen his family came in and BERATED him, and I mean fucking *berated* him to not give up, not be selfish, start thinking straight, he has so much to live for, etc. The paperwork was switched back. He coded this morning. We got him back.\n\nThat could have been it. He could have made his peace in the days since he woke up and been past his suffering this morning. But no. He'll continue to live and be dependent on machines and nurses for the rest of his life in some nursing facility, and it was never what he wanted. Don't be selfish, guys. I know it's hard to see your family members hurt, but don't forget that DNR orders and Goals of Care discussions are about the *patient's wishes,* not the family's.",
            "score": 11,
            "author": "not_quite_a_lung_doc",
            "replies": []
        },
        {
            "level": 0,
            "comment": "that the Mormon Church has successfully fought to keep confessions of sexual offenders \"private\" and \"a sacred trust\", in the case in Tempe AZ\n\nThey used their billions to have the privilege to protect abusers.its got me super fucked up.",
            "score": 63,
            "author": "mshoneybadger",
            "replies": [
                {
                    "level": 1,
                    "comment": "Randomly placed flyers can just appear out of nowhere. Laundromats, grocery store carts, salons, etc. Its like magic, pic of offenders and name.",
                    "score": 8,
                    "author": "HunnyBear66",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh I want to create a roving murder gang",
                            "score": 1,
                            "author": "mshoneybadger",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is unacceptable.",
                    "score": 12,
                    "author": "MonkeyJones42069",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know… I’m low key crying inside every minute",
                            "score": 3,
                            "author": "mshoneybadger"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They all do it, look at the Catholics.  Rules for thee but not for me.",
                    "score": 4,
                    "author": "GEM592"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I told my boss I can't afford to buy our products and he got pretty mad. It even came up naturally. Fuck me for being honest I guess.",
            "score": 11,
            "author": "WillyShankspeare"
        },
        {
            "level": 0,
            "comment": "Divorce.",
            "score": 10,
            "author": "Chrisbee223",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel you brother, time heals :) if it gets unbearable please talk to somebody. \nFac fortia et patere :)",
                    "score": 5,
                    "author": "ticoarcos"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That humankind can't live cohesively. That they aren't trying to achieve more as a species. It's always fighting to be the leader. They can't just come together to take care of one another. \n\nThe human race will eradicate itself from existence and not even think twice about it.",
            "score": 25,
            "author": "jprause",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My dad’s death",
            "score": 8,
            "author": "Bittibitsbite",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My fucking stomach ache",
            "score": 7,
            "author": "crumblerbread"
        },
        {
            "level": 0,
            "comment": "My life",
            "score": 8,
            "author": "Eckkbert"
        },
        {
            "level": 0,
            "comment": "the fact that the mother of two of my children would rather continue to keep in contact with her ex in prison over matching my energy to keep our relationship going.",
            "score": 7,
            "author": "antisocial-avarice",
            "replies": []
        },
        {
            "level": 0,
            "comment": "There’s a 200,000 ha fire less than 2 km from my house",
            "score": 5,
            "author": "HurtsmithTV",
            "replies": []
        },
        {
            "level": 0,
            "comment": "dealing with retirement and and the boredom and lack of social interaction that comes with it.",
            "score": 6,
            "author": "bipedalnakedape"
        },
        {
            "level": 0,
            "comment": "I am pregnant",
            "score": 7,
            "author": "Parking-Economist-67",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Cost of housing.",
            "score": 5,
            "author": "Hashtagworried"
        },
        {
            "level": 0,
            "comment": "I feel like I’m doing everything right, I’m fit, decent job, a friendly and caring person, not particularly ugly as far as I’m aware, and I am entirely unable to find a relationship, I haven’t been on a date in over a year. It makes me feel like there’s something wrong with me that only I can’t see, and it really gets in my head",
            "score": 7,
            "author": "Guilty-Package6618"
        },
        {
            "level": 0,
            "comment": "I have broken my foot to the point that my foot is separated from my leg. The doctor called it a \"freakishly weird\" injury and it's serious.\n\nTwo years ago I lost my big left toe in an accident and it resulted in a serious infection that I battled for months because....\n\nPrior to that for years I battled an incredibly rare disease that causes bacteria to wreak havoc in my body. I was told I was terminal twice in ten years. \n\nI am tired. \n\nMost days I have a sense of humour about my very messed up life - and i am actually a very positive person - I could give even more examples of forced resilience - but this time around I am close to giving up. \n\nIt's just too hard and I am losing even my dark humour about it all. My ability to laugh in the face of life is my saving grace and I am losing it. \n\nThat is what has me fucked up. I don't know what the point of life is if I can't laugh at myself.",
            "score": 6,
            "author": "Lindsey-905"
        },
        {
            "level": 0,
            "comment": "My mom just lost her battle with cancer while I’m doing two full time school programs and working full time simultaneously.",
            "score": 16,
            "author": "JWrither"
        },
        {
            "level": 0,
            "comment": "How successful right wing propaganda is…",
            "score": 15,
            "author": "Repulsive-Sort-9621",
            "replies": []
        },
        {
            "level": 0,
            "comment": "There's a decent chance I'm going to have to go back to the office, despite the fact that my job doesn't require me to interact with anyone physically in my location. I'll literally sit in an office and be on webex meetings all day long.\n\nEverything about my life improved when we started work from home, and I'm *pissed* about going back. It's all about the bullshit \"we think people think better in groups\" nonsense they peddle elsewhere.\n\nOn top of that, one of my dogs is getting quite old and the thought of leaving him alone for 9+ hours a day breaks my heart.\n\nI say all this knowing full well I have a job that's rather privileged to be able to be a W@H job...on the other hand, I worked fucking *hard* to get where I am, and to have it taken away because some manager with no balls thinks they know better pisses me off.\n\nIt's bullshit. It's all fucking bullshit all the way down.",
            "score": 5,
            "author": "lessmiserables"
        },
        {
            "level": 0,
            "comment": "The possibility - however remote - that Donald Trump will escape his crimes and be elected to the White House again.",
            "score": 23,
            "author": "First_Drive2386",
            "replies": [
                {
                    "level": 1,
                    "comment": "your doomed",
                    "score": 3,
                    "author": "ClearFail130",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lack of sleep, the longest has been 6 hrs I think in the last 6 months , usually around four . Neighbour is insane. It’s actually abusive and I’m not the only person with a flat under or beside ,he is banging around to keep awake.Somedays I fantasize about dying because at least I would be at rest…..Finally should be moving soon,but it’s been a living nightmare .So tired. Just so tired.",
            "score": 4,
            "author": "Rave0n-",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My gaslighting manipulative ex",
            "score": 4,
            "author": "Liquesrodrigo"
        },
        {
            "level": 0,
            "comment": "Having manager who is as smart as a cookie 🥴",
            "score": 4,
            "author": "Accomplished-Owl-90",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Where do I start. I bought a shitty used car that was supposed to be saftied when I bought it, it wasn't so we had it checked at another shop and then brought it back to the original shop to get it fixed.  3 days later the gas company sends me a bill for 2k saying we've been undercharging you for a year and a half. Then the government sends us a letter saying we've been overpaying your baby money so they will be stopping payments for 3 months to recoup that. Our family dog had an infection and needs 500$ in meds to fix.  The nest egg we've been saving for 2 years is now almost gone. \n\nOn top of all this my current employment is so far away I drive 2.5 hours a day, I'm currently looking for something close to home but to no luck. Also the coworker I have been working with for 2 years has lately been insulting me, yelling at me when I make a mistake (even if it wasn't my mistake), and generally making me feel like a piece of shit while at work. My anxiety from all this is skyrocketing and I can't get to see a Dr until the end of the month. \nAll this happend within 3 weeks.",
            "score": 4,
            "author": "milk16"
        },
        {
            "level": 0,
            "comment": "That I'm contemplating leaving my wife, but love the home I've built for my kids and genuinely can't comprehend anyone wanting me otherwise.",
            "score": 4,
            "author": "bryntastic10"
        },
        {
            "level": 0,
            "comment": "I have a full time job in IT that required a degree, certificates, and past experience to obtain.\n\nIf I wasn't married I would be homeless working this job.\n\nI will never own a home, I will never be financially secure, and I will work until I drop dead.",
            "score": 4,
            "author": "KhaosElement"
        },
        {
            "level": 0,
            "comment": "My mom is about a week from death and I have cancer.",
            "score": 1,
            "author": "Leadfoot39"
        },
        {
            "level": 0,
            "comment": "Insomnia",
            "score": 8,
            "author": "aalouparatha",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can relate",
                    "score": 5,
                    "author": "Aware_Warthog6071",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just Gender Dysphoria and hatred towards myself for being trans.",
            "score": 3,
            "author": "confused-as-f-boi",
            "replies": [
                {
                    "level": 1,
                    "comment": "Please don’t hate yourself, and please find someone to talk to. You are perfect for being exactly who you are. 💙",
                    "score": 2,
                    "author": "_DirtyFingernails",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Luckily I got a tight knit support group &lt;3 \nIt's just so fucking exhausting, and most of what I see online is people loving their identity, openly and as happy as they can. \n\nI ain't open, I'm terrified. It's tiring",
                            "score": 2,
                            "author": "confused-as-f-boi"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nothing really. I think this is probably the first time in my life I’ve ever been able to say that. I don’t mean to sound braggy and if you’re in a bad place I get comments like this can be annoying. But this is honestly the first time in my life where nothing really is wrong, I mean things aren’t perfect, my ex could be a bit less of a control freak and I could be a bit better off financially and my health could be better. But I’m happy, I’m good.",
            "score": 3,
            "author": "Intox_Em"
        },
        {
            "level": 0,
            "comment": "The loss of my son on June 2 ,2023. He was my whole world. I miss him so much. If you or someone you know is struggling with mental health please reach out and seek help.",
            "score": 3,
            "author": "Mykidsdad35"
        },
        {
            "level": 0,
            "comment": "My new job..I feel like I took it just to take it. Starting to realize I’m not passionate about my work, or the industry I’m in.\n\nJust kind of have to suck it up and go through the motions I guess.",
            "score": 3,
            "author": "BjornBjornovic",
            "replies": [
                {
                    "level": 1,
                    "comment": "Relatable",
                    "score": 2,
                    "author": "Aware_Warthog6071"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Allstate Insurance. Specifically the total loss department. Fuck them.",
            "score": 3,
            "author": "retired_punk"
        },
        {
            "level": 0,
            "comment": "The fact that Ron DeSantis might become President. I’ve shit on Biden, and the Democratic Party, for their ineptness. But I am honestly afraid of what he might try to do if he became President.",
            "score": 3,
            "author": "Inside-Big-8158",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m a little worried about that too because DeSantis is truly evil. However being president is not like being governor - there are ways of keeping much of his fascism in check.",
                    "score": 2,
                    "author": "DMT1984"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How people will never be able to collectively agree or organize themselves in such a way to change their own destiny. Politicians in the stock market, PPP fraud, Panama papers, Epstein. We will never see justice because the evil in this world has learned how to navigate us. I wish we had more heroes.",
            "score": 3,
            "author": "SprinklersSprinkle"
        },
        {
            "level": 0,
            "comment": "My cat died 😞",
            "score": 3,
            "author": "jdzerofive",
            "replies": []
        },
        {
            "level": 0,
            "comment": "All of my fav subreddits going private!",
            "score": 3,
            "author": "Intstnlfortitude"
        },
        {
            "level": 0,
            "comment": "The housing market.",
            "score": 3,
            "author": "Dangerous-Crab-1148"
        },
        {
            "level": 0,
            "comment": "Marriage and spouse manipulation",
            "score": 3,
            "author": "Economy-Station4577"
        },
        {
            "level": 0,
            "comment": "My girlfriend and I watched someone get brutally killed by a bus almost a week ago. She saw much more than I did, but we’ve both been freaked out walking around town since then and honestly, nothing feels quite the same.",
            "score": 3,
            "author": "shittyfakejesus"
        },
        {
            "level": 0,
            "comment": "Depression, loneliness and boredom. 51 years old. Just started recovering from a long and rough illness, lost my job and I'm single. Sigh. It's all suck now.",
            "score": 3,
            "author": "produkt921"
        },
        {
            "level": 0,
            "comment": "Had to rush my dog to the vet today due to water intoxication. It scared the hell out of me, and I'm still shivering. It was a life-threatening situation but the vet just called me and said that he will do fine. So now I changed from mentally fucked to less mentally fucked up rn. \n\nBe careful if your dog loves to swim. Too much water intake can kill your dog. Go to the vet immediately if your dog suddenly has a lack of coordination, lethargy, nausea, difficulty breathing, collapsing and loss of consciousness. Don't wait! My dog probably wouldn't have survived if I didn't go to the vet immediately. It really freaked me out!",
            "score": 3,
            "author": "attrib"
        },
        {
            "level": 0,
            "comment": "I realized I wasted my life away in hiding due to anxiety",
            "score": 1,
            "author": "ClockNational3099"
        },
        {
            "level": 0,
            "comment": "The never ending list of shit that needs fixing, updating, cleaning, renewing. Just when you feel like your catching up, the check engine light comes on, the ac stops working, water starts running down the inside of the chimney, the toilet doesn’t stop filling. Urgh",
            "score": 1,
            "author": "DonBocUlosis96"
        },
        {
            "level": 0,
            "comment": "I’m taking care of an 84 year old grandma with dementia. A couple months ago she fell asleep on the couch and defecated herself. This woman who took me in when I was 13 (now 40) is falling apart. It really breaks my heart, and all the while, taking care of a wife and a 2 year old. All of this started around the time the pandemic began. Mental overload.",
            "score": 1,
            "author": "xionshift"
        },
        {
            "level": 0,
            "comment": "Dad of 3 under 6. Life is chaos and tiredness. I worry about my children. About my spouse. Sometimes, I just want to be an independent person again. It's never-ending",
            "score": 1,
            "author": "seven_of_four"
        },
        {
            "level": 0,
            "comment": "People keep offering me unsolicited life advice now that I’ve finished college. Please, I’ve already heard this speech five times over. Please, for the love of everything holy, can we talk about something else. Literally *anything else.*",
            "score": 6,
            "author": "nightcoreangst",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Being mistreated essentially all my life, along with existing in a society inherently hostile to me.",
            "score": 6,
            "author": "BJ_Blitzvix",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Being sexually frustrated",
            "score": 4,
            "author": "Powwerrs",
            "replies": [
                {
                    "level": 1,
                    "comment": "99% of people masterbate, 1% lie about it.",
                    "score": 6,
                    "author": "spylife",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Adhd 🫠",
            "score": 5,
            "author": "Eline_bieber"
        },
        {
            "level": 0,
            "comment": "How many people believe a protest will turn back all API changes",
            "score": 4,
            "author": "zippoiii"
        },
        {
            "level": 0,
            "comment": "I have to take 5 college classes this semester and my university is far away, on top of a full-time job. I have friends, but I also feel very a lone, with little emotional support.",
            "score": 2,
            "author": "Caseylightning",
            "replies": [
                {
                    "level": 1,
                    "comment": "It gets better. Hang in there!",
                    "score": 2,
                    "author": "spylife",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Something from my past I’d rather not discuss. I genuinely feel like I don’t deserve to live anymore because of it.",
            "score": 2,
            "author": "Empoleon777",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I had existential crisis since last november (im in my early twenties, so it was due) but for some weeks now, I'm finally feeling better.",
            "score": 2,
            "author": "Wooden_Potential_699"
        },
        {
            "level": 0,
            "comment": "Watching to see what the hell my old narcissist father is going to do to fuck up my life a little bit more.",
            "score": 2,
            "author": "mosquitohater2023"
        },
        {
            "level": 0,
            "comment": "That my brother got a second cancer confirmation, only 7 months after stopping chemo from the first one.  I'm worried sick.",
            "score": 2,
            "author": "WeasersMom14"
        },
        {
            "level": 0,
            "comment": "School and the fear of falling into that hole again",
            "score": 2,
            "author": "Original_A"
        },
        {
            "level": 0,
            "comment": "I don’t know how to have a healthy relationship so even though the reason the person I’m seeing has been distant is logical, the complete flip in communication has me assuming he’s met someone else and is only texting me because he either feels obligated or wants to keep me around just in case. (Don’t worry, I’m waiting on a call from a therapist office lol)",
            "score": 2,
            "author": "CrowCelestial"
        },
        {
            "level": 0,
            "comment": "Stress fracture in my foot. I’m a dancer so this is tough. 10 weeks of no dancing. The longest I’ve gone is 2 weeks. It’s been around 10 days and my mental health is on the floor",
            "score": 2,
            "author": "Millie141"
        },
        {
            "level": 0,
            "comment": "My past, I’ve moved forward from it but like I’ve said in other posts some scars are like salt in the ocean it becomes apart of you, you carry it with you. It’s great when you can use it to remind yourself to be a decent human. But it’s the same reminder that’ll haunt you for not being this way in the beginning.",
            "score": 2,
            "author": "forex_1911"
        },
        {
            "level": 0,
            "comment": "Everybody lies. It's part of the human condition. Despite my best efforts with a new woman after my divorce, I have been lied to. Again. \n\nAll I've ever asked of a woman is for her to be heself.  I usually say something like, You be you, I'll be me, if it works great, if not, you can walk away knowing you were your authentic self and we move on to find someone who fits. Why would you play yourself to be one thing when you are fully aware you aren't that thing?",
            "score": 2,
            "author": "Skergio"
        },
        {
            "level": 0,
            "comment": "Years of previous trauma and bullshit and my failure to treat any of it.",
            "score": 2,
            "author": "Lokasathe"
        },
        {
            "level": 0,
            "comment": "My step brother died from pancreatitis, my half brother has had it for years in and out of hospital and now his pancreas has stopped working.",
            "score": 2,
            "author": "XenomorphXx121"
        },
        {
            "level": 0,
            "comment": "Milk actually makes your bones weaker.",
            "score": 2,
            "author": "Karnezar",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I have to leave my gf alone for 2 months in order to earn money for living for us (im going to iceland). And yes, im a student and my parents dont give me any money.",
            "score": 2,
            "author": "panniepl"
        },
        {
            "level": 0,
            "comment": "Being stabbed and almost being dead",
            "score": 2,
            "author": "Morwen_Marduk"
        },
        {
            "level": 0,
            "comment": " I’ve been stalking a dead girls life for almost two years now, only because she’s the only person I’ve been able to find who has my my first, middle, AND last name. My name isn’t common, I won’t say my full name obviously but I’ll use a fake one for example: her name is Mara Louise Bordeaux and my name is Marah Louis Bordeaux. Our names are only two letters different, only thing spelled the same is our last. I was skeptical at first because she lived on the other side of the United States. But I knew she probably had family linking back to Haiti because that’s where most people with my last name are from. \n I found her Facebook page and clicked through her friends list and typed my last name, then I found her dad. I went through his friends list and found my cousin…I clicked through my cousins friends list who also shared the same last name as my aunt. My dads sister. During that time that I was stalking that girl, I didn’t know we were cousins. Worst thing is that we almost look the same…\n  The thing is I wasn’t purposely named after her, my mom unknowingly decided to give me the first name I have now last minute before I was born. And my mother gave me my middle name after her dead sister…she died moments after birth…in the 1980s. \n  The girl who I share the same name with was born in the late 90s, I was born in the early 2000s. \n  Also know that my mother is unaware of this girl who I share the same with, she doesn’t know who she is. I’m pretty sure my dad isn’t as familiar with her either, but I haven’t asked him yet. He’s never brought up to me.",
            "score": 2,
            "author": "Choice-Arachnid-8254"
        },
        {
            "level": 0,
            "comment": "Was working in what felt like a great job. Found out two weeks ago the boss has run the business into the ground when we found out he had missed health insurance premiums. How does someone do that? \n\nNow I’m stressed about making the switch to a competitor and feeling very vulnerable with a family and no insurance.",
            "score": 2,
            "author": "MikeCalledCraig"
        },
        {
            "level": 0,
            "comment": "Watching White Lotus",
            "score": 2,
            "author": "Express-Towel1423"
        },
        {
            "level": 0,
            "comment": "Me and my partner are going to be in the street and will probably die or be arrested. Our lives are ending.",
            "score": 2,
            "author": "Odd-Guarantee3557"
        },
        {
            "level": 0,
            "comment": "Having manager who is as smart as a cookie 🥴",
            "score": 2,
            "author": "Accomplished-Owl-90"
        },
        {
            "level": 0,
            "comment": "Finding a way to fuck things up with this girl from Utah I’ve been chatting with for almost 3 years. I DM’ed her right during the pandemic but I was being too pushy about meeting up and now it’s to the point where we don’t even talk regularly. I think a big part of it is her job and also because she’s upset at me for an off-comment I made about her being a catfish, which fucked with her head royally\n\nThat, trying to get back on track in life, worried about being a disappointment to my family, and not having any sort of real motivation to pursue a writing career",
            "score": 2,
            "author": "ManOfMystery84"
        },
        {
            "level": 0,
            "comment": "The gal I’ve been seeing keeps saying things that make me question a future with her. I’ve been ignoring big red flags for a year. I’m over it, just can’t do it anymore and my heart is fucking broken.",
            "score": 2,
            "author": "AnaDingoDD"
        },
        {
            "level": 0,
            "comment": "No sleep at all and 120mg of adderall",
            "score": 2,
            "author": "TanktheUnstable"
        },
        {
            "level": 0,
            "comment": "I haven’t had a romantic connection with anyone since I was about 12. And even then I find myself questioning if that could be counted. \n\nIn addition to the loneliness, I’ve encountered some live changing perspectives about how I treat others, and really they’re very minute but they’re effecting me greatly. \n\nI’m having some financial troubles to garnish the shit cake that is my life currently lol",
            "score": 2,
            "author": "Miiakuzii"
        },
        {
            "level": 0,
            "comment": "Alcoholism. Six years of sobriety and it’s my wedding on Saturday and our families are insisting we have alcohol everywhere even though my fiancé doesn’t drink either (albeit by choice). It’s so traumatic and difficult but our families will absolutely not let us have a dry wedding. It fucking sucks.",
            "score": 2,
            "author": "ed_mayo_onlyfans"
        },
        {
            "level": 0,
            "comment": "Life bro. Life.",
            "score": 2,
            "author": "2babayaga",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Not knowing if the psychiatrist im about to see because I have to switch mental health providers is about to change up all my medication for years and thus fucking with me mentally when I'm already pretty fucking depressed. It's terrifying having your mental health in the palm of someone else's hand like that.",
            "score": 2,
            "author": "Zombebe"
        },
        {
            "level": 0,
            "comment": "Got out of an abusive relationship a couple months ago. She's also pregnant with my daughter. I haven't been happy living in my current state and city for a long time and want to move away. I still want to be a part of the child's life. I don't know how I'm going to do it.",
            "score": 2,
            "author": "Durma12"
        },
        {
            "level": 0,
            "comment": "I lived and worked with malignant narcissists for so long I dont know whats worse my self loathing or my anger",
            "score": 2,
            "author": "wakebakey"
        },
        {
            "level": 0,
            "comment": "I am going to be a mom, I guess between being told it would be extremely difficult to get pregnant and having nursing school start in two months has messed me up. I am still fairly early, so also the fact there is a whole baby in there!",
            "score": 2,
            "author": "Ad-starchild343"
        },
        {
            "level": 0,
            "comment": "Not being able to get a job, while running low on savings.",
            "score": 2,
            "author": "Muny30"
        },
        {
            "level": 0,
            "comment": "My car. I’m in over my head on repairs needed and it seems like more and more keep popping up. I’m financing too and haven’t even paid it halfway off.",
            "score": 2,
            "author": "TheRemanentFour"
        },
        {
            "level": 0,
            "comment": "I am ethically liable for my life but living as if I am not in control of it due to the restrictions imposed on us by internet companies that remain out of touch.",
            "score": 2,
            "author": "draghead"
        },
        {
            "level": 0,
            "comment": "Despite having the right password I can't access my old email address cause I changed phone numbers",
            "score": 2,
            "author": "draghead"
        },
        {
            "level": 0,
            "comment": "i just broke up with my gf and i have the most important exam of my life this saturday. I cant focus on anything rn",
            "score": 2,
            "author": "Lud0vic0"
        },
        {
            "level": 0,
            "comment": "the thing inside my skull probably lol",
            "score": 2,
            "author": "onespreadaday"
        },
        {
            "level": 0,
            "comment": "A mix of my closest grandma having just passed away and also that I became fast friends with a woman recently and accidentally fell for them. They're moving away soon and closure never really came from the very complicated friendship we had. Pretty sure she wants nothing to do with me, but honestly don't know. Not sure how to deal with either of those losses. I feel like shit.",
            "score": 2,
            "author": "Diedguy0"
        },
        {
            "level": 0,
            "comment": "39 and too nervous to date after a really bad ex. Trusting someone to not be angry and controlling is difficult to overcome.",
            "score": 2,
            "author": "Sharpshooter188",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good luck",
                    "score": 2,
                    "author": "Aware_Warthog6071"
                }
            ]
        },
        {
            "level": 0,
            "comment": "During my last session, my therapist asked me to create a self portrait of sorts using little toys and figures and arrange them in a sand tray. After I completed it she literally said “this is the saddest self portrait I’ve seen.”\nSo…not really sure how to deal with that until the next session",
            "score": 2,
            "author": "PetiteFeet"
        },
        {
            "level": 0,
            "comment": "My mother passed away in janurary by cancer. My dad is on a second bout of cancer,  going through a separation that involves 3 kids and preping for a job interview at the local university. Little stressed 👍",
            "score": 2,
            "author": "wzc8437"
        },
        {
            "level": 0,
            "comment": "Finals. Holy fuck i hate finals",
            "score": 2,
            "author": "RoteCampflieger"
        },
        {
            "level": 0,
            "comment": "My nicotine addiction I'm trying to break but can't",
            "score": 2,
            "author": "theredditor445"
        },
        {
            "level": 0,
            "comment": "It's hard for me to sleep on hot summer nights which prevents me from having energy to do anything during the next day. Not even caffeine is helping anymore.",
            "score": 2,
            "author": "Js_On_My_Yeet"
        },
        {
            "level": 0,
            "comment": "Sexual frustration.",
            "score": 2,
            "author": "Jaxson___",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The Nitro Pro PDF reader that I use which is essential for my job stopped working today for no reason. I've tried uninstalling and reinstalling, running in administrator mode, rebooted PC, nothing. Their help service sucks too.",
            "score": 2,
            "author": "FishLampClock"
        },
        {
            "level": 0,
            "comment": "My father was diagnosed with cancer (high grade glioma ) and he can no longer speak now.",
            "score": 2,
            "author": "Nutezmsk"
        },
        {
            "level": 0,
            "comment": "Some dude",
            "score": 2,
            "author": "doonieburg",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Irish curse",
            "score": 2,
            "author": "christyfan11"
        },
        {
            "level": 0,
            "comment": "Well....i'm addicted to marijuana in a unhealthy way.  I think thats my #1 problem. Most others issues would be lesson if I were to slow down my consumon in weed.",
            "score": 2,
            "author": "iminlovewithyoucamp"
        },
        {
            "level": 0,
            "comment": "Two weeks of insomnia. I'm not doing well lol",
            "score": 2,
            "author": "HELLOhappyshop"
        },
        {
            "level": 0,
            "comment": "I've been celibate most of my adult life. Really fucks with your self esteem. I miss the cuddling and intimacy more than the sex.",
            "score": 2,
            "author": "BoringRecipe2458"
        },
        {
            "level": 0,
            "comment": "My gf attempted suicide a few days ago. She's currently at a psych ward for a minimum 72hr eval, probably till Friday. Can't call her or visit. Luckily she called me today and she's doing okay and is excited for our trip we had planned for the weekend, as am I. I want to take her away from here and show her a fun weekend full of love and kindness. I can't wait to hold her in my arms again, and I'm so glad that I'll be able to.",
            "score": 2,
            "author": "Alternative-Sock-444"
        },
        {
            "level": 0,
            "comment": "I had an embarrassing moment at work last week and I'm constantly reliving it in my head and gritting my teeth as I think about how stupid I looked.",
            "score": 2,
            "author": "Rodby",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hate when that happens",
                    "score": 2,
                    "author": "Aware_Warthog6071"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Loneliness.\nI am living in a country far away from my origin country. I have a shit ton of friends, but at the end of the day, I am going to bed by myself. There is a girl in my team at work which I fancy since the day I met her, but I was never able to gather up my courage to do anything about her. We are okayish friends and I am pretty sure that she is aware that I like her. I don't know what to do.\nBesides, I am bored of work now. I guess it is a nice time to use my PTO.",
            "score": 2,
            "author": "FunkyMoth"
        },
        {
            "level": 0,
            "comment": "Feeling sucked back down into a black hole of depression and existential dread and wanting to hurt myself again to feel real. Ya know the normal stuff.",
            "score": 2,
            "author": "itshaileyk"
        },
        {
            "level": 0,
            "comment": "I lost a business partner/boss who was a mentor, a friend who I'd always talk with and do things with, and a person who raised me. It sounds like I'm speaking of multiple people, but it was only one person, and this person is all of those things to me. \n\nWork isn't the same without the witty banter. It feels like I have no one to talk to sometimes. I keep trying to do things I like but it isn't the same when I really have no one to share those things with. I just feel alone, I guess.\n\nThen on top of all that, I have to deal with someone else threatening me and harassing someone I care about who's sick. \n\nBut that's life. Humans are resilient, and we have to get back on track eventually.",
            "score": 2,
            "author": "Reamed"
        },
        {
            "level": 0,
            "comment": "Unexpected break up.",
            "score": 2,
            "author": "la_winky"
        },
        {
            "level": 0,
            "comment": "Loneliness",
            "score": 2,
            "author": "Jeepguru",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s a bitch",
                    "score": 2,
                    "author": "Aware_Warthog6071",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "The fact I cried until I couldn’t anymore about my ex gf. Meanwhile, she’s fucking another dude and told me she doesn’t care.",
            "score": 2,
            "author": "al0516"
        },
        {
            "level": 0,
            "comment": "Dealing with ongoing post concussion symptoms. It’s really doing a number on my mental health.",
            "score": 2,
            "author": "lojo71"
        },
        {
            "level": 0,
            "comment": "Having to let go of romantic feelings I had for someone. We have truly grown apart",
            "score": 2,
            "author": "Both-Musician4222"
        },
        {
            "level": 0,
            "comment": "GCSE exams are keeping me up at night and the fact that I'm finishing secondary school on Friday is making my anxiety skyrocket.",
            "score": 2,
            "author": "bananachip868"
        },
        {
            "level": 0,
            "comment": "Intense sense of undesirability because of a string of rejections and bad relationships",
            "score": 2,
            "author": "Malbranch"
        },
        {
            "level": 0,
            "comment": "Going through a break up and friends are to busy being dads",
            "score": 2,
            "author": "No-Post5801"
        },
        {
            "level": 0,
            "comment": "My 5 yr old. He does not listen. When given a choice, he inevitably chooses the wrong thing. We have him in therapy, but it is expensive and slow going.",
            "score": 2,
            "author": "Exciting_Ad6532"
        },
        {
            "level": 0,
            "comment": "Realizing I may have a severe mental illness that is exacerbated by alcoholism.  \n\nBad shit. Hopefully long term sobriety may patch all that up. But, the brain is fragile.",
            "score": 2,
            "author": "ThemChecks"
        },
        {
            "level": 0,
            "comment": "Not being able to access most subreddits",
            "score": 2,
            "author": "OkAioli7382"
        },
        {
            "level": 0,
            "comment": "Overthinking",
            "score": 2,
            "author": "Super_Mixture_222"
        },
        {
            "level": 0,
            "comment": "Too much regret",
            "score": 2,
            "author": "JB-Blue_Master55555"
        },
        {
            "level": 0,
            "comment": "Not finding a job for 6 months",
            "score": 2,
            "author": "Swift_Sexy_Samurai"
        },
        {
            "level": 0,
            "comment": "My ex broke up with me after 13 years and 5 days later was staying with my old best friend and almost step brother from high school.",
            "score": 2,
            "author": "st3v30kin3v0"
        },
        {
            "level": 0,
            "comment": "Rare, incurable, debilitating disease. 🤷🏼‍♂️",
            "score": 2,
            "author": "Interesting_Mouse"
        },
        {
            "level": 0,
            "comment": "Company is downsizing and my job might be affected.",
            "score": 2,
            "author": "DMT1984"
        },
        {
            "level": 0,
            "comment": "Lack of sex",
            "score": 2,
            "author": "Femaleboss48"
        },
        {
            "level": 0,
            "comment": "I will not be paid in June or July because my contract expired in May and will be renewed in August.",
            "score": 2,
            "author": "theriddlerjoker12"
        }
    ]
}