{
    "id": "148nfu2",
    "score": 10,
    "title": "Guys, what kind of side jobs have you started outside of your full time job to bring in some extra money? Hobbies or trade jobs?",
    "author": "Super_kev_mor22",
    "date": 1686684415.0,
    "url": null,
    "media_url": null,
    "comments": [
        {
            "level": 0,
            "comment": "I'd fix computers networks, it paid well just a bit inconsistent on the demand",
            "score": 3
        },
        {
            "level": 0,
            "comment": "Dog grooming! Got my certificate in college and can make good money on the side with tips and commission",
            "score": 2
        },
        {
            "level": 0,
            "comment": "Mostly I just sell off things I don't need on facebook.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Metal scrapping",
            "score": 1
        },
        {
            "level": 0,
            "comment": "I've been trying my hand at writing music / producing / mixing music on upwork and fivver.  Haven't made a ton, but it's a fun hobby even if I never make any real money doing it.",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "Nice! I used to mess around with different instruments as well. DJing would be my best avenue, but I don’t really care to put in time to make that a job. It’s def a fun hobby and I’d love to keep it as such.",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "Door work and gigging in a tribute band.",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "Sweet.",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got into sports betting a couple months ago.. actually hit pretty big on a few of them parlays I had.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "probably like going to liquidation stores that sell everything for like 50 cents or something cheap and like digging thru stuff and finding stuff i can resell for more on like ebay. great side hustle.",
            "score": 1
        }
    ]
}