{
    "id": "148o88a",
    "score": 29,
    "title": "When a U.S. president goes to prison what happens to their secret service detail?",
    "author": "MagicalGoldRush",
    "date": 1686686541.0,
    "url": null,
    "media_url": null,
    "comments": [
        {
            "level": 0,
            "comment": "It's not clear. This hasn't happened before, so I'm not sure there's a process for that. Trump could dismiss his detail, like Nixon did, but he won't.\n\nMy guess is that the Secret Service would contract out to the prison to protect the former President. The Secret Service would then have to fund that contract, so this could get quite lucrative.",
            "score": 39,
            "replies": [
                {
                    "level": 1,
                    "comment": "This seems the most plausible",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "Mar-A-Lago suddenly applies for a federal prison contract….",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "Well, I guess the Secret Service will finally learn what it feels like to be locked up with their former boss.",
                    "score": 1
                },
                {
                    "level": 1,
                    "comment": "Fuck it, I'll do it. Wait, are the protection units disallowed from taunting their client?",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "Surely it will be house arrest??",
            "score": 1
        },
        {
            "level": 0,
            "comment": "They go to jail too. It’s in a constitution I think. Not ours, but a constitution.",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "Believe it or not? Straight to jail.",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "Unfortunately, you will probably not find out. I can see him filing appeal after appeal and running out the clock. He is and overweight 76 year old who does not exercise. He only has to stall this for 8-10 years, right?",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "I think it's more likely that he'll delay any trial, win the 2024 election and immediately pardon himself of all crimes.",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He can’t pardon himself from state crimes, no matter what.",
                            "score": 1,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah but thr republican Georgia governor can and the NY state charges probably will not result in prison time",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They all will end up with prison time.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Both of you are speculating",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’s an unprecedented thing. \n\nThere’s no way we can know lol",
            "score": 1
        },
        {
            "level": 0,
            "comment": "It will probably look like Pablo Escobar’s prison.",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "Definitely",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "Trumps such a megalomaniac he probably wants to be *buried* with his secret service detail.",
            "score": 14,
            "replies": [
                {
                    "level": 1,
                    "comment": "And with my crack ss team by my side.\n\nYikes indeed",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "They become his cell mate",
            "score": 1
        },
        {
            "level": 0,
            "comment": "I say make a small single person prison just for him, and staff it with his SS detail.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "It's never happened before and most like won't happen soon.  But if a future president ever saw jail time, they'd likely be isolated and still have secret service protection, unless congress passed some sort of act against it.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "normally he would lose it, but I think its possible republicans can do some weird bureaucratic red tape nonsense and figure out a way to let him keep it. Its kind of hard when the whole party is helping him and aiding and abetting his crimes.",
            "score": -6,
            "replies": [
                {
                    "level": 1,
                    "comment": "There is no \"normally.\" It has never happened before. By law ex-presidents get secret service protection at all times. The law would have to be changed in order to take away his detail.",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "he loses it when gets impeached and removed.... or really just not being total weirdo would probably deny taking it at all..... Nixon has to feel really shitty giving up so early huh? didn't plot or a coup or nothing just threw up peace signs and flew away in a helicopter",
                            "score": 1,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How can he be impeached? He's not in office.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "yeah but he was never \"removed\" or whateverbullshit legal term... just like clinton so that means he keeps all his gold and bodyguards",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes he was.  That's literally what happened when he lost election and left the White House.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Clinton didn't lose his when he was impeached",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Clinton was impeached by the house but the inquiry was ultimately unsuccessful and did not lead to him being removed from officer. In order for. an ex-president to lose status \\[protection/pension\\] they need to be removed from office. Obviously Trump is no longer in office, so there is no legal precedence either way.",
                                            "score": 1
                                        },
                                        {
                                            "level": 4,
                                            "comment": "nobody was going to send clinton to jail for a blowjob thats not a crime",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That’s also not what Clinton was impeached for lmao",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "he was impeached for being a democrat and the republicans gaining enough votes in the midterms to impeach him for the stupidest fucking thing they could find",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "What in the wide world of sports is that word salad?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "if i just play dumb and pretend I dont undertsand what words mean I can say any stupid thing I want and people will think I'm just a harmless moron",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "He was impeached for lying to Cngress and obstruction of justice. Those *are* crimes.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "how about this? pretend trump was being brought up on the same charges and then direct your phony outrage back at yourself and just see how long you can go back and forth like that before you pass out",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Um. . .what?",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "“Normally according to pure imagination…”",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "boy for people who constantly shout about the constitution none of you seem to know a damn thing in it",
                            "score": 1,
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Who is “people”? You’re replying to me. I’m a person. \n\nAre you hallucinating?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think someone coded the bot wrong.",
                                            "score": 1
                                        },
                                        {
                                            "level": 4,
                                            "comment": "you know who I mean the people with the guns and the red hats who chant about jews replacing you in the woods you guys whatever your called.... space jew hunters idk",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "So you’re just ranting to …. Space Nazis?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "is that the new name? I thought you were calling yourselves the cereal boys or something?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Once again, who are you talking to?",
                                                                    "score": 1
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Try actually making a lucid point instead of this weird shit.\n\nBefore you rant, I’m not from America so hold off the silly red hat shit.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "are you from germany?",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "But what are *you* shouting about?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "cornbread?",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I honestly don't see how trump gets out of this, I mean I'm fairly moderate but trump took enough classified documents that its pretty clear he did it for his advantage, I seriously think he is guilty and should be charged after looking into the court documents.",
                    "score": 1,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "idk i mean back in the old days the president could murder whoever they wanted... seems like old ways were better",
                            "score": 1
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -6,
                    "replies": [
                        {
                            "level": 2,
                            "comment": "no im not!!!! who said nobody said I did!! Did I say I was a rapist? did you look through my profile? nobody said anything about me and eric trump going on vacations to 3rd world countries and raping young male prostitutes nobody said that so why are you bringing it up?!!! you must be the rapist here hey hey hey!!! this guys a rapist everyone!! he just confesssed aaaahhh Im not listening anymore ahhhhhhh police!",
                            "score": -4
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They would contract protection out to one of the many white nationalist gangs. Or for the sheer entertainment value, the Bloods or the Crips, or better yet MS13.... \"build that wall\".",
            "score": 1,
            "replies": [
                {
                    "level": 1,
                    "comment": "Not how it works at all, but I like where your head's at.",
                    "score": 1
                }
            ]
        },
        {
            "level": 0,
            "comment": "IF, and that’s a big IF because that spray painted buffoon gets away with everything, he’d be in a restrictive housing unit for his whole bid in whatever federal prison he goes to. I think he’d lose his right to secret service if convicted, maybe, it sounds right but I don’t know.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "They are reassigned to desk jobs reading his mail",
            "score": 1
        },
        {
            "level": 0,
            "comment": "He'll have his own wing with his SS detail present I expect.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "I assume they continue to guard him while he's in exile. I hear Elba is as nice as ever.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Well if it were the Ming dynasty they'd be lightly killed and buried under his prison cell, as a sign of respect.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "It would likely be a house arrest situation except on an estate.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Will a president have to bend over to pick up their soap, or will the Secret Service do it for him?",
            "score": 1
        },
        {
            "level": 0,
            "comment": "I thought he dismissed their services after he lost.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Double Secret Service Detail",
            "score": 1
        },
        {
            "level": 0,
            "comment": "They just execute them.. lol jk. I dunno",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Sending a sitting or former POTUS to jail would be far too much of a security concern regardless of what they were convicted of.  \n\nI would assume if Trump (or any subsequent POTUS) is convicted then he'll be sentenced to house arrest.",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Suddenly, mar-a-lago is now a private prison complex.\n\nView the prisoner for $200k. Talk to him for $500k",
            "score": 1
        },
        {
            "level": 0,
            "comment": "they  help him drop the soap",
            "score": 1
        },
        {
            "level": 0,
            "comment": "\"If he dies, he dies.\"\n-Ivan Drago, Rocky IV",
            "score": 1
        },
        {
            "level": 0,
            "comment": "Anyone that thinks he's going to prison is an idiot. You live in the real world, no way thats happening.",
            "score": 1
        }
    ]
}