{
    "id": "148omgi",
    "score": 10,
    "title": "What's your opinion about astrology and why?",
    "author": "xerxexa",
    "date": 1686687633.0,
    "url": "https://www.reddit.com/r/AskReddit/comments/148omgi",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "In a University astronomy course I took, the professor walked us through the math about how the nurse in the delivery room had more gravitational impact upon you than all the stars in the astrological constellations combined.\n\nThe other fundamental forces in the Universe can’t operate over those distances, so gravity was really the only one we had to do the math for.\n\nIt’s all absolute nonsense.",
            "score": 15,
            "author": "Kesselya"
        },
        {
            "level": 0,
            "comment": "Complete nonsense unless you're an attractive woman and then sure let's talk about it",
            "score": 7,
            "author": "Sanity_LARP"
        },
        {
            "level": 0,
            "comment": "It is complete bullshit, but being an Aries I am naturally skeptical...",
            "score": 21,
            "author": "Empereor_Norton"
        },
        {
            "level": 0,
            "comment": "It’s pretty fucking stupid. Stop basing your life off of this nonsense",
            "score": 12,
            "author": "DeadByDawn93"
        },
        {
            "level": 0,
            "comment": "Don't believe in it",
            "score": 5,
            "author": "TelevisionFeeling649"
        },
        {
            "level": 0,
            "comment": "Just any other religion with a different packing.",
            "score": 8,
            "author": "ContributionDismal79"
        },
        {
            "level": 0,
            "comment": "its kinda fun to see what it has to say, but I don't believe that it's true",
            "score": 7,
            "author": "ContractCrazy5743"
        },
        {
            "level": 0,
            "comment": "Silly.  Not how the universe works.  Why?  Because science.  How can the random arrangement of stars, where some groups vaguely like things, influence the lives of humans?  It's just plain ol' nonsense.",
            "score": 3,
            "author": "glisteningdinkus"
        },
        {
            "level": 0,
            "comment": "It's total BS. I have this opinion because it's total BS.",
            "score": 3,
            "author": "gredr"
        },
        {
            "level": 0,
            "comment": "It’s kinda sad to learn how many people believ it is real. Will make u lose faith in humanity",
            "score": 4,
            "author": "cosmograndpa"
        },
        {
            "level": 0,
            "comment": "I don't like it, because people tend tu use it to justify their shitty behaviour",
            "score": 2,
            "author": "noecrrr"
        },
        {
            "level": 0,
            "comment": "Boring nonsense. Period.",
            "score": 2,
            "author": "livkellner"
        },
        {
            "level": 0,
            "comment": "I think this is pseudo-science and a good way for fraudsters to make money.\n\nObserving the astrology enthusiasts around me, I was convinced that it is simply shifting responsibility for their own lives and decisions to the position of celestial bodies.",
            "score": 2,
            "author": "piureshka"
        },
        {
            "level": 0,
            "comment": "It’s out of this world man",
            "score": 2,
            "author": "sk8ter99"
        },
        {
            "level": 0,
            "comment": "ci puoi credere solo se sei femmina o il maestro",
            "score": 2,
            "author": "Pristine-Noise-2665"
        },
        {
            "level": 0,
            "comment": "Being as astrology was invented and the charts created when everyone thought the earth was central in the universe, I call bullshit....",
            "score": 2,
            "author": "jnemesh"
        },
        {
            "level": 0,
            "comment": "I have a friend that's into it, I try to keep an open mind.",
            "score": 2,
            "author": "virtualpig"
        },
        {
            "level": 0,
            "comment": "It goes great with my essential oils. By the way, can I interest you to become a distributor?",
            "score": 2,
            "author": "das1000k"
        },
        {
            "level": 0,
            "comment": "It’s stupid. Because it’s stupid.",
            "score": 4,
            "author": "MeyerholdsGh0st"
        },
        {
            "level": 0,
            "comment": "Trash, literally trash shit, it's literally nonsense and idk why ppl care about astrology",
            "score": 2,
            "author": "Ailat1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Large amounts of human history have been shaped by people believing in space wizards.",
                    "score": 2,
                    "author": "Aubear11885"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I go back and forth between \"it's really stupid\" and \"it's really fucking stupid\".",
            "score": 4,
            "author": "TallEnoughJones"
        },
        {
            "level": 0,
            "comment": "I don’t care but the people who make it about their personality are the most annoying people in the WORLD.",
            "score": 2,
            "author": "0_0Mp"
        },
        {
            "level": 0,
            "comment": "It's nonsense, and I lose massive amounts of respect for anybody that claims to believe in it.",
            "score": 2,
            "author": "flamewarsarefun"
        },
        {
            "level": 0,
            "comment": "Don't care.. must be because I'm an asparagus and my moon is in Capri sun rising",
            "score": 2,
            "author": "ominous_oricle"
        },
        {
            "level": 0,
            "comment": "kinda weird",
            "score": 2,
            "author": "dontswiminglue"
        },
        {
            "level": 0,
            "comment": "Even if it was a thing, why just our planets and these specific constellations?  Surely *every* celestial body in existence would have an effect on it.  I'm not sure humanity has a supercomputer big enough to calculate all of that in real time.",
            "score": 2,
            "author": "Callec254"
        },
        {
            "level": 0,
            "comment": "If someone takes it with a grain of salt, whatever. If someone tries broad stroking someone's entire character, don't talk to me -- I have no patience for such thinking.",
            "score": 2,
            "author": "Ratakoa"
        },
        {
            "level": 0,
            "comment": "I don’t believe in it, but it is entertaining.",
            "score": 2,
            "author": "Chismosalady"
        },
        {
            "level": 0,
            "comment": "It's an incredibly interesting philosophy that has been absolutely demolished by people who have no idea what they're talking about. There is no such thing as \"oh he's a Gemini we can't be in the same area code\" bitch the rest of the chart is there for a fucking reason",
            "score": 1,
            "author": "InsertGamerName"
        },
        {
            "level": 0,
            "comment": "Either ignorant or egotistic, the vast cosmos and it's celestial bodies don't have anything to do with your life.",
            "score": 1,
            "author": "LaCiel_W"
        },
        {
            "level": 0,
            "comment": "Vedic astrology I’ve found to be deep and accurate",
            "score": 1,
            "author": "Happy-Sprinkles8138"
        },
        {
            "level": 0,
            "comment": "Seems a little silly.\n\nIf it makes someone happy as an interest, great. If they're effectively preying on vulnerable credulous people, I have objections.",
            "score": 1,
            "author": "Ok-Control-787"
        },
        {
            "level": 0,
            "comment": "I worry about how many young folks are into it unironically, and use it to find and define their personalities. Cultural fortune-telling things can be fun and aesthetic, but I think it's pretty bad for people's brains to be uncritical about it. They're just preparing themselves for being prey to a scammer later on in life. \n\n&amp;#x200B;\n\nPeople need to learn to accept that there's no big secret of consciousness, and there's no mystical path to being special, and to treat those things as anything but fun escapist diverstions is to buy someone's bullshit at their own expense. You need to develop yourself and work to be a good person and no amount of Mercury in Retrograde will help with that.",
            "score": 1,
            "author": "furbylicious"
        },
        {
            "level": 0,
            "comment": "It’s horseshit. Cause it’s horseshit.",
            "score": 1,
            "author": "grondfoehammer"
        },
        {
            "level": 0,
            "comment": "It’s complete and utter bullshit",
            "score": 1,
            "author": "hyrulian_princess"
        },
        {
            "level": 0,
            "comment": "Being that it's based on objects we know to exist, I'd say it's at LEAST as reliable as any religion, if not more so.",
            "score": 1,
            "author": "JustChuteMe"
        },
        {
            "level": 0,
            "comment": "1) The patterns that we see in the sky are random; the human brain just likes to make patterns.\n\n2) The stars in question are millions of light years apart and have nothing to do with one another.\n\n3) As Neil DeGrasse Tyson explained, due to the expanding universe and everything being in motion, the Zodiac has rotated a full sign in the last few hundred years.\n\nBasically, Astrology is like any other belief system: it's an attempt by humans to explain something without using actual science and it requires believing that we are vastly more important than we actually are.",
            "score": 1,
            "author": "SomeNumbers23"
        },
        {
            "level": 0,
            "comment": "I new a person that wrote horoscopes in a news paper, that was his second job there; his main job was caricaturist. It’s all made up nonsense.",
            "score": 1,
            "author": "PabloZissou"
        },
        {
            "level": 0,
            "comment": "People just trying another way to give their life cosmic relevance.",
            "score": 1,
            "author": "Hank___Scorpio"
        },
        {
            "level": 0,
            "comment": "It just makes me sad, the amount of stupidity and gullibleness. I used to be someone who was into astrology but I woke up one day and realized none of it made any sense…, so I ventured out into something else that would explain human behaviors: trauma, attachment, and mental health❗️",
            "score": 1,
            "author": "HazelnutRocher"
        },
        {
            "level": 0,
            "comment": "There are some truths to it anecdotally....",
            "score": 1,
            "author": "Bertybassett99"
        },
        {
            "level": 0,
            "comment": "It’s 100% not real. But sometimes when you’re in a bad spot and you look it up.. it gives you some small sort of relief that everything is going to be okay. Using the idea that the universe is on your side to get yourself out of a funk is one thing.. but using that idea to glide through life and never put any effort in bc “everything happens for a reason” is another. \n\nI think everything has to do with how much effort you put in to it and you create your own destiny.. but love reading it from time to time just for fun. Very fine line there. People can get too roped in.",
            "score": 1,
            "author": "Ok-Mechanic9136"
        },
        {
            "level": 0,
            "comment": "In reality Astrology has nothing to do with the stars. It's merely a set of glasses we use to take a look at ourselves and think about ourselves.\n\nDouglas Adams (rather: one of the characters in his books) describes it much better, obviously, but that's more or less the gist of it.\n\nWhether you're for or against it - as long as you don't take it too seriously, it doesn't worry me at all. Knock yourself out.",
            "score": 1,
            "author": "st0pmakings3ns3"
        },
        {
            "level": 0,
            "comment": "Compete bollocks designed to take money from the gullible.",
            "score": 1,
            "author": "MurderBeans"
        },
        {
            "level": 0,
            "comment": "Same as religion:\n\nIf it makes you feel better, go ahead and believe it.\n\nBut I don't wanna hear about it.",
            "score": 1,
            "author": "ErwinsDog"
        },
        {
            "level": 0,
            "comment": "I think it's outta this world",
            "score": 1,
            "author": "HVAC_instructor"
        },
        {
            "level": 0,
            "comment": "It’s nice to know when the meteors are showering and what color it’s burning.",
            "score": 1,
            "author": "forex_1911"
        },
        {
            "level": 0,
            "comment": "It's exactly like religion.\n\nReligion is interesting and shockingly many people base their lives around it but still proven wrong.\n\nI like the story behind it and find it interesting but dislike people that judge others because of it. Interestingly my zodiac sign is 100% true. Does not mean I believe it tho.",
            "score": 1,
            "author": "Klexobert"
        },
        {
            "level": 0,
            "comment": "It’s absolute nonsense",
            "score": 1,
            "author": "Orion43410"
        },
        {
            "level": 0,
            "comment": "Needed, but we need to study the ocean more without polluting it. We typically destroy everything we touch 🙄.",
            "score": 0,
            "author": "Whole-Researcher93"
        }
    ]
}