{
    "id": "148pw19",
    "score": 4,
    "title": "How do you deal with someone who just won't shut up?",
    "author": "flippingsenton",
    "date": 1686691061.0,
    "url": "https://www.reddit.com/r/AskReddit/comments/148pw19",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\"Would you kindly shut your face hole, please.\"",
            "score": 2,
            "author": "unhinged-baker"
        },
        {
            "level": 0,
            "comment": "If they truly won’t stop I eventually begin to ignore them. Not on purpose. It just gets too boring to listen to one person talk at me constantly.",
            "score": 2,
            "author": "slipoutside"
        },
        {
            "level": 0,
            "comment": "Be nice on the way out and disappear, sadly.",
            "score": 2,
            "author": "CelifrogToo"
        },
        {
            "level": 0,
            "comment": "I typically deal with them by leaving. Avoid them, minimize impact/interaction, and try to learn from whatever unhappy feelings they made me feel.",
            "score": 1,
            "author": "BabyBlue906"
        },
        {
            "level": 0,
            "comment": "The only thing that's worked for me is avoidance (from non aggressive/insulting options that is)",
            "score": 1,
            "author": "Zatknish007"
        },
        {
            "level": 0,
            "comment": "I just repeat back to them what they said.  Like so you think such and such cool.",
            "score": 1,
            "author": "LavishnessOk3439"
        },
        {
            "level": 0,
            "comment": "It's probably circumstantial, like do you have to be around this person, orvis there a method to avoid them?",
            "score": 1,
            "author": "SameSeas",
            "replies": [
                {
                    "level": 1,
                    "comment": "I literally *have* to be around this man.\n\nHe is literally incapable of not talking. He has to fucking narrate his actions as he goes for some reason.",
                    "score": 1,
                    "author": "flippingsenton",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sounds difficult, ngl.\n\n\nIf you know him good enough, it depends if he has any ability to accept criticism, because it could go so many different ways. Maybe he accepts it, maybe he acts passive aggressive, but sulks &amp; goes quiet, maybe he does it even more to be annoying.\n\n\nIf it's workplace stuff, maybe send an anonymous email to your boss/HR. I was around someone who non stop talked pure shit all day, criticised everyone &amp; made the environment into a mini dictatorship for her, so I know how annoying it is.",
                            "score": 1,
                            "author": "SameSeas"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Depends if they're annoying or not.",
            "score": 1,
            "author": "What_is_that_shite"
        },
        {
            "level": 0,
            "comment": "Ignore them, pretend they don’t exist and let them look crazy",
            "score": 1,
            "author": "Horizon-Wireless"
        },
        {
            "level": 0,
            "comment": "I ain't got time for your jibba-jabba!",
            "score": 1,
            "author": "cbrewer0"
        },
        {
            "level": 0,
            "comment": "I have noise cancelling headphones, quite effective really. Tested on my younger siblings",
            "score": 1,
            "author": "DarthStormborn"
        },
        {
            "level": 0,
            "comment": "I don't waste words.  I just quietly do an about face (turn around). Walk away.  They usually get the point.",
            "score": 1,
            "author": "These_Confection_271"
        },
        {
            "level": 0,
            "comment": "if you say politely, “stop talking, or I will murder you with an ax” - well, that’s always been helpful to me.\n\n/s",
            "score": 1,
            "author": "Quinquilharia"
        }
    ]
}