{
    "id": "148q7uw",
    "score": 3,
    "title": "What's the scariest theory you know?",
    "author": "W00lfe_",
    "date": 1686691937.0,
    "url": null,
    "media_url": null,
    "comments": [
        {
            "level": 0,
            "comment": "There's a theory about the universe dying called vacuum decay. Some scientists believe that the the universe is in what is considered in an artificially high energy State and one day it might slip down into a lower energy state which would make atomic bonds impossible and create a vacuum decay bubble that expands at  the speed of light basically annihilating all matter in the universe.\n\nThe scary part is because of how big the universe is it could have already happened and a low energy State bubble of annihilating space decay could be speeding toward our solar system at the speed of light as we speak",
            "score": 1,
            "author": "Mono_Clear",
            "replies": [
                {
                    "level": 1,
                    "comment": "Really scary theory...",
                    "score": 1,
                    "author": "W00lfe_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That there are these two places we can go to when we die and one of them is great but the other is like the worst place ever full of pain and misery and you are there forever. What kind of maniac even comes up with this stuff?",
            "score": 1,
            "author": "spiderclouds",
            "replies": [
                {
                    "level": 1,
                    "comment": "The power hungry maniacs. Making a game of Simon says just on the grater scale. \"Oh yeah Simon said you are not supposed to do that. Or you will burn forever\" Wonder how it catched on, really .",
                    "score": 1,
                    "author": "Majestic_Bus_6996"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Roko's basilisk",
            "score": 1,
            "author": "AudibleNod"
        },
        {
            "level": 0,
            "comment": "That everything we know is all just VR.",
            "score": 1,
            "author": "CyborgPoo"
        },
        {
            "level": 0,
            "comment": "Exodus",
            "score": 1,
            "author": "Mouterma-48"
        },
        {
            "level": 0,
            "comment": "Simulation theory",
            "score": 1,
            "author": "420Eski-Grim"
        },
        {
            "level": 0,
            "comment": "The world is controlled by the Rothchild's and Co.",
            "score": 1,
            "author": "chutchy50"
        },
        {
            "level": 0,
            "comment": "Women are loyal",
            "score": 1,
            "author": "Brilliant-Ant-2001"
        },
        {
            "level": 0,
            "comment": "I personally know one.\n\nIf you time travel to the future, then your body remains in time and continues to live its own life while you change the future.",
            "score": 1,
            "author": "W00lfe_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Certainly not a real theory, but who said that the theory should be real?",
                    "score": 1,
                    "author": "W00lfe_"
                }
            ]
        }
    ]
}