{
    "id": "148rz52",
    "score": 48,
    "title": "What bothers you the most about life aside death?",
    "author": "HRbeats5946",
    "date": 1686696771.0,
    "url": "https://www.reddit.com/r/AskReddit/comments/148rz52",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "The life part bothers me more than the death",
            "score": 1,
            "author": "Objective_Past_5353",
            "replies": [
                {
                    "level": 1,
                    "comment": "The actual death part doesn’t suck but the fact that you have to grind your whole life just to avoid death just to inevitably die is the shitty part lol",
                    "score": 1,
                    "author": "DeezNuttery"
                },
                {
                    "level": 1,
                    "comment": "Well, life is like a box of chocolates...you never know when you're going to get a nougat-filled one.",
                    "score": 1,
                    "author": "xlsauvayz4"
                }
            ]
        },
        {
            "level": 0,
            "comment": "People",
            "score": 1,
            "author": "Xv_ili"
        },
        {
            "level": 0,
            "comment": "The death part is the best part though…..",
            "score": 1,
            "author": "ineedtoknow707"
        },
        {
            "level": 0,
            "comment": "How hard it is to meet someone, and then we not even talking about meeting the right one 🙈",
            "score": 1,
            "author": "Marolkon"
        },
        {
            "level": 0,
            "comment": "just how structured it is. go to high school, go to college, be a corporate slave until ur 65, move to florida and die of old age, or at least that's how it seems to me. \n\nim 22 and started my first real job just this week, and it's occurred to me that ill be doing this for the rest of my life. no more aspirations, no more dreams, no more goals. just wake up, sit at a desk for 10 hours, then go to sleep.",
            "score": 1,
            "author": "NarwhalAnusLicker00"
        },
        {
            "level": 0,
            "comment": "Having to navigate the constant negativity and still finding a way to be positive about life. It can get exhausting. Some days it can feel like everything is aimed at being negative. The people you work with, the family you love, the friends you have, the issues you see in social media, or the news you read about events in the world. It can be hard not to have a very bleak outlook on life. It's so critically important to appreciate the good - no matter how small - or else you are going to drown in the bad.",
            "score": 1,
            "author": "DreamOnNeon"
        },
        {
            "level": 0,
            "comment": "Not living it. Don't even know how to. But what do most people do? Work and get drunk, is that it? Party, and \"party\" if they're attractive enough or have low enough standards.\n\nLots of people have drinking friends, but are the friends, or just alcoholics, who aren't really friends other than drinking together.",
            "score": 1,
            "author": "NoEggbert"
        },
        {
            "level": 0,
            "comment": "How expensive everything is",
            "score": 1,
            "author": "PM_ME_SOME_LUV"
        },
        {
            "level": 0,
            "comment": "The overwhelming cruelty that comes with it",
            "score": 1,
            "author": "Tycho923"
        },
        {
            "level": 0,
            "comment": "Honestly - the \"good\" doesn't always feel as rewarding as you think it should.  When I've accomplished something significant, I mostly just feel relieved that the lead-in struggle is over rather than any real sense of accomplishment.",
            "score": 1,
            "author": "Bigtsez"
        },
        {
            "level": 0,
            "comment": "Living",
            "score": 1,
            "author": "pogiguy2020"
        },
        {
            "level": 0,
            "comment": "Working.",
            "score": 1,
            "author": "Apart-Republic-3415"
        },
        {
            "level": 0,
            "comment": "The pointlessness. Why struggle your whole life to make ends meet only to grow old and watch everyone you care about die around you, everything you care about fade away, before finally dying yourself?\n\nSeems like a lot of pain for nothing.",
            "score": 1,
            "author": "zublits"
        },
        {
            "level": 0,
            "comment": "Capitalism",
            "score": 1,
            "author": "Express_Let8362"
        },
        {
            "level": 0,
            "comment": "Life is suffering.  Death is a gift.  In between we do the best we can.",
            "score": 1,
            "author": "Razaelbub"
        },
        {
            "level": 0,
            "comment": "That we fundamentally cannot consent to it. We are not asked if we want to be created. I view this as such a fundamental issue that I refuse to have children for that reason alone.",
            "score": 1,
            "author": "throwlegalaway12358"
        },
        {
            "level": 0,
            "comment": "That mankind has been around for 10000 years, and this is best we could do.  This fucking cesspool of shit that we call \"life\" is absolutely fucking awful.",
            "score": 1,
            "author": "Fearless747"
        },
        {
            "level": 0,
            "comment": "Inflation and stagnant wages.",
            "score": 1,
            "author": "kalel1980"
        },
        {
            "level": 0,
            "comment": "Having to deal with nasty people and toxic societies.",
            "score": 1,
            "author": "Common_Sense_Dudd"
        },
        {
            "level": 0,
            "comment": "Getting old",
            "score": 1,
            "author": "XqueezeMePlease"
        },
        {
            "level": 0,
            "comment": "That we have to work in order to live",
            "score": 1,
            "author": "nae2021dublin"
        },
        {
            "level": 0,
            "comment": "Mosquito's really suck",
            "score": 1,
            "author": "MindfulWonderer_"
        },
        {
            "level": 0,
            "comment": "That I won’t be able to experience all of it. I might never the country let alone go to some states.",
            "score": 1,
            "author": "Karmaqqt"
        },
        {
            "level": 0,
            "comment": "Working when you don't want to",
            "score": 1,
            "author": "spinaltap862"
        },
        {
            "level": 0,
            "comment": "fucking bullies. Bullies are still the ones that haunt me.",
            "score": 1,
            "author": "Get_me_Billie"
        },
        {
            "level": 0,
            "comment": "How violent men are and how violent they have made the world. There is no need for the world to be the way it is.",
            "score": 1,
            "author": "Any_Coyote6662"
        },
        {
            "level": 0,
            "comment": "simply the unknown",
            "score": 1,
            "author": "Fruitithink"
        },
        {
            "level": 0,
            "comment": "Being in jail. I hate being locked up.",
            "score": 1,
            "author": "Remarkable-Pepper647"
        },
        {
            "level": 0,
            "comment": "Born to work.",
            "score": 1,
            "author": "SteakJuices"
        },
        {
            "level": 0,
            "comment": "Physical limitations. \n\nIt is what it is, but that doesn't mean it's fun.",
            "score": 1,
            "author": "CrunchyTeatime"
        },
        {
            "level": 0,
            "comment": "bugs and insects like they are so aggravating",
            "score": 1,
            "author": "natetheslayer80"
        },
        {
            "level": 0,
            "comment": "Death doesn't bother me at all. I have full confidence of eternal life through Jesus Christ. This 80-90 years if you're lucky is just a drop in the bucket compared to eternity.",
            "score": 1,
            "author": "NorskChef"
        }
    ]
}