{
    "id": "148rien",
    "score": 3,
    "title": "Which dumb as hell rule exists at your work?",
    "author": "JustHereToHangOut",
    "date": 1686695454.0,
    "url": "https://www.reddit.com/r/AskReddit/comments/148rien",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "“We need you to come back into the office”",
            "score": 10,
            "author": "webosite",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lmao yes. This.",
                    "score": 2,
                    "author": "franklegend69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i work in an ecommerce department at a non profit. we have thrift stores and healthcare and group homes and workplace training etc. but because my department is grouped with retail, we have to follow the retail dress code despite the fact that the customers don't see us.",
            "score": 4,
            "author": "katiebear716"
        },
        {
            "level": 0,
            "comment": "Updates 4-5 times a day, two 1:1’s a week, required team meetings that are a waste, required cross training 1 per quarter, a Director who never says no to a project despite everyone being tapped out and professional dress despite never meeting clients",
            "score": 3,
            "author": "happy_meow"
        },
        {
            "level": 0,
            "comment": "Apparently I have to put on a shirt for Zoom calls or something",
            "score": 2,
            "author": "BikinisByDay"
        },
        {
            "level": 0,
            "comment": "You can legally get payed less than minimum wage some days",
            "score": 2,
            "author": "Brilliant_Tap6051"
        },
        {
            "level": 0,
            "comment": "You can only have a single coffee from the coffee machine.",
            "score": 2,
            "author": "TimeRuin5144"
        },
        {
            "level": 0,
            "comment": "I work at a high school, so there are too many dumb as hell rules to count.",
            "score": 2,
            "author": "checksoutfine2"
        },
        {
            "level": 0,
            "comment": "Fairness\n\nThey asked me to come into work Saturday (something only I can figure out apparently). I was pretty upset about coming in on the weekends.\n\nThey also asked my co worker to come in. I asked her why she's here because she knows nothing about what I'm doing and she does something else. She said the bosses said \"it wouldn't be fair for \\[myname\\]\" so they asked her to come in too like asking her to come in is going to make me feel better wtf. Either pay me for saturday (I'm salary) or give me a day off to compensate me for the lost personal time.\n\n&amp;#x200B;\n\nWhy the fuck did they tell her to come in because it's unfair for me.",
            "score": 2,
            "author": "SteakJuices"
        },
        {
            "level": 0,
            "comment": "Nurses can't smoke weed or consume THC products in California. As long as I don't show to work high what difference does it make .",
            "score": 4,
            "author": "dermlvl"
        },
        {
            "level": 0,
            "comment": "Do not play in your poop.",
            "score": 1,
            "author": "ThePeapod420"
        },
        {
            "level": 0,
            "comment": "The kids have the power to control how the teacher teaches, behaves or runs the class. If they don’t like one aspect of it, your contract is cancelled.",
            "score": 1,
            "author": "Kamikaze_Monkey1986"
        }
    ]
}