{
    "id": "148s43z",
    "score": 0,
    "title": "For those who were around in the 90s and early 2000s, what was the world like before smart phones and social media?",
    "author": "stevedooner96",
    "date": 1686697176.0,
    "url": "https://www.reddit.com/r/AskReddit/comments/148s43z",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Terrible. Every day was a struggle for survival. We had to scavenge for food, we were constantly running away from dinosaurs, and worst of all *Achy Breaky Heart* by Billy-Ray Cyrus was still occasionally being played on the radio!",
            "score": 4,
            "author": "Improvedandconfused",
            "replies": [
                {
                    "level": 1,
                    "comment": "Confirmed, all true.",
                    "score": 1,
                    "author": "Skiboy712"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The mall was the ultimate hang-zone. 1-800-COLLECT was also a thing.",
            "score": 1,
            "author": "bytes311",
            "replies": [
                {
                    "level": 1,
                    "comment": "Who shot Mr. BURNS!?",
                    "score": 1,
                    "author": "Synchro_Shoukan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was blamed on Maggie, but I would argue that a baby of her age wouldn’t have the strength or dexterity to hold and operate a loaded revolver. There must have been a second shooter hiding somewhere amongst the bushes, and frankly in my opinion Wayland Smither’s alibi of being drunk and watching daytime television in his apartment doesn’t hold mustard.",
                            "score": 1,
                            "author": "Improvedandconfused"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you wanted to meet up in the evening with friends you had to agree the time and place already in school. For example let's meet up at 20:00 for some soccer at the playground. Fast forward and you had no idea who would show up and how many before you actually arrived. But always good times!\n\nIn 1997 and the years after we started to get internet and ICQ. It helped a lot that you could communicate with instant messaging (or SMS on phones)",
            "score": 1,
            "author": "InsideDK"
        },
        {
            "level": 0,
            "comment": "I wasn't very old at the time. But I did remember having a pager.",
            "score": 1,
            "author": "DeltaSolana",
            "replies": [
                {
                    "level": 1,
                    "comment": "Terrible but at the same time thanks to online flash games I made great memories with random strangers",
                    "score": 1,
                    "author": "Bitbatgaming",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Indeed, same here. I remember playing Raft Wars, Pandemic II, Thing Thing, Clear Vision, etc. Definitely was some good times. \n\nYou might look at downloading Flashpoint. It's an archive of every flash game they could back up before it got yeeted.",
                            "score": 1,
                            "author": "DeltaSolana",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Btd5 flash was the goat for me",
                                    "score": 1,
                                    "author": "Bitbatgaming"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It was so nice when you actually had to go out of your way to meet up / interact with people.  Or not go out of your way and be impossible to reach.  Liberating.",
            "score": 1,
            "author": "K1rkl4nd"
        },
        {
            "level": 0,
            "comment": "Way less stressful. When I went out in college, I put my expected itinerary on AIM and left the house. \n\nI could disconnect from my job because my email only worked at work. \n\nI could take the phone off the hook if I didn’t want to talk to someone and they just assumed I was on the internet. \n\nI didn’t constantly have to worry if every photo of me doing something dumb would be in the internet for the world to see. \n\nI pooped a lot faster.",
            "score": 1,
            "author": "jjinrva"
        }
    ]
}