{
    "id": "etcyd6",
    "score": 92660,
    "title": "78% of suicide rates world wide are men, what can we do to help them?",
    "author": "awihsoj",
    "date": 1579884552.0,
    "url": "https://www.reddit.com/r/AskReddit/comments/etcyd6",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Don't expect men to be \"manly\". We have worries, we have fears just like anyone else. Sometimes we don't want sex, we just want someone to hold us and tell us everything is going to be be ok. The modern world shouldn't expect someone to be anything other than a contributing member of society, be it any way. Men like power and feeling looked up to, but like women and children, we need someone to love us and someone we can fall back onto. When a man, or even a woman is shutting people out and isolating themselves, they need your love the most. I know this will get buried but I hope someone can take something from this.",
            "score": 1016,
            "author": "TrevastyPlague",
            "replies": [
                {
                    "level": 1,
                    "comment": "Both men and women expect men to be manly.\n\nHowever, it's really women who are truly influential in reinforcing \"manliness\". Men don't give a shit what other men think. They feel the need to be that way because of how much importance women place on it.",
                    "score": 81,
                    "author": "Cyclone619y2j",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "An uncle in law shot himself to death this week. The guy was screaming for help and threatening to do it for days. He was 48. \n\nWhat are the options? If i was dealing with heavy depression and just wanted to talk to someone where do i go? Ive sought independent counselors and they usually turn out to be nutcases themselves. Seems like this just adds to the overall feeling of hopelessness.",
            "score": 1294,
            "author": "Staffordmeister",
            "replies": [
                {
                    "level": 1,
                    "comment": "In the US, people apparently call suicide hotlines like 211 pretty frequently “just to talk.” They’ll always listen if you don’t have anyone else even if you’re not having any sort of suicidal ideation.",
                    "score": 227,
                    "author": "Can-Apple",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Treat their mental health seriously. When they are struggling with a problem the only advice that is given to them to 'man up'. Which, in my opinion, they have and they just need actual help.",
            "score": 10109,
            "author": "CriesWhenBlinking",
            "replies": [
                {
                    "level": 1,
                    "comment": "absolutely. getting help should be seen as a way to “man up” because it’s the strong thing to do.",
                    "score": 1713,
                    "author": "likearealreptile",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Treat us like humans. I was sexually assaulted as a child and frequently tried to harm myself but whenever i talked to someone about it they scoffed and said i was telling fibs.\n\n&amp;#x200B;\n\nEdit: Thank you for all the kind words. Please if you're thinking of hurting yourself please seek help don't go it alone.",
            "score": 24148,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's why I struggle to open up, because I always think someone will tell me I'm doing it for attention",
                    "score": 1735,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you need someone to vent with send me a PM or discord i'm willing to help you.",
                            "score": 121,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think I'm okay right now, I was just talking about when I actually have heavy stuff on my plate. It's just loneliness and emptiness, but I've always had to deal with that. But I'm okay, thanks a lot for asserting yourself for me, it means a lot!",
                                    "score": 48,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I told my wife that I was molested as a child.  It took me nearly ten years to work up the courage to talk about it.  Her response was “Well, I can understand why she did it,” and that was it.  My beautiful children are all that keep me going at the moment.  You better believe I won’t be talking about it again to people face to face.",
                    "score": 1250,
                    "author": "TheAssholethrowaway",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yup, told one my past partners my history when she was enquiring why I wasn't as sexually active as her past.  \n\n\nWhere I was tied up as part of a game by a female friend who was 14 when I was 10 and forced to have sex before I even knew what it was. And then when her father walked into the barn, beat the shit out of me while I was still tied up blaming me for seducing his daughter.\n\nHer response was, \"Oh so you got to have sex early, bet the guys loved that\".  \n\nYeah because I was going to brag about that shit.\n\nTo this day I still have the thought in the back of my mind that someone is going to pop up and beat the shit out of me for having sex.  \n\n\nWhich is honestly why I don't pursue partners that often, which in turn means a ton of time in singledom.\n\nShit's fucked, I know at no point was it my fault, but stuff is messed up, and working though those issues with a person who actually is understanding of that in a relationship just seems like too big of a fucking stretch. Therapy helps but at the end of the day having relationships end because I can't get over my shit, just makes it feel like it's not worth the hurt that comes when they end.",
                            "score": 535,
                            "author": "TowerFlame",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; I was tied up [...] when I was 10 and forced to have sex [...] then her father beat the shit out of me while I was still tied up blaming me for seducing his daughter\n\n&gt; Her response was, \"Oh so you got to have sex early, bet the guys loved that\".\n\nJesus fucking Christ.\n\nImagine telling a woman who at age 10 was immobalized, raped, beaten and then blamed for the rape that she has a great bar story.",
                                    "score": 414,
                                    "author": "Arschfauster",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm sorry. Be strong i'm here for you. being assault and having someone joke about it is horrible.",
                            "score": 293,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you!  I think she was dead serious about understanding the motives of the person who did it too me.  I appreciate the the thoughts, my children are my everything and they keep me strong.  The person is still in my life but I never leave my kids alone with them.",
                                    "score": 208,
                                    "author": "TheAssholethrowaway",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What did she mean by I can see why they did it ? It sounds like she wasn't taking what you said seriously. I would have told her I didn't appreciate the joke if I were you. Sorry that happened to you.",
                                            "score": 59,
                                            "author": "KratomRobot",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It doesn't even make sense because this is when u/TheAssholethrowaway was a child. I was also a child when I was molested/raped by my babysitter who forced me to perform in front of a camera with bondage ropes and when I was in college, someone sent me a text asking if the kid in the video was me and sent me a screenshot of that video. Had my face, my hands and feet tied, and I'm like a limp brain-dead person doing whatever she asked me all out in the nude and the worst thing about it all is not just the fact that now I know for sure that the video is somewhere out there on the internet, but that in that time of my life, I was blindly willing and going along with the abuse because I didn't realize it was abuse. I even wanted to do it sometimes.",
                                                    "score": 138,
                                                    "author": "crzypplthinkthysaner",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That's so fucked up dude, I'm sorry you went through that :( it always leaves me shellshocked that people would do this shit to kids. I've gone through it myself as a kid and I'll never understand it\nHow/why did that person even have the video though? That's fucked up in itself.",
                                                            "score": 69,
                                                            "author": "gene_parmesan_PEYE",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 4432,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The problem is the lack of social groups and support for male sexual assault victims. I was lucky to have someone i could share my pain with and trust but some people lack this all they have is the demons that fill their heads.",
                            "score": 1327,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A few people, in years past, *did* try to set up battered men's shelters and such.\n\nThey were picketed and protested aggressively, and were forced to shut their doors.",
                                    "score": 823,
                                    "author": "The_WandererHFY",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "One of those people who tried to set up a male DV shelter, and got attacked for it, was [Erin Pizzey](https://en.wikipedia.org/wiki/Erin_Pizzey).\nShe's also the one who **first gave us Domestic Violence shelters in general**.",
                                            "score": 47,
                                            "author": "angry_cabbie"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Which asshats got their jimies in a twist from that?",
                                            "score": 157,
                                            "author": "Zeebuoy",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The best part about being a man is the anonymity. The worst part about being a man is the anonymity.",
                            "score": 515,
                            "author": "7evenCircles",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 71,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dont shame us for asking for help or appearing weak",
            "score": 34271,
            "author": "yeahman925",
            "replies": [
                {
                    "level": 1,
                    "comment": "Was here for this: stop calling men “pussies” for having feelings. \n\nHumans feel feelings and it’s normal and expressing them doesn’t make them less of a person (no matter their chromosomes).",
                    "score": 9493,
                    "author": "Tirannie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It seems like men are only allowed to have the shallowest of feelings and then expected to move on right away.\n\nOften anger and if its depression or sadness you are allowed one tear or to look away then move on.",
                            "score": 2961,
                            "author": "binkerfluid",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was raped by a couple, with the woman taking control. When I finally was able to not only utter the word \"rape\" to myself, but also to others, the first comment I got from one of the male figures in my life was \"men can't be raped by women, so if you want to be a real man, you'll suck it up.\" I was 18 or 19, had been a virgin before, and got two STDs from the assault. I have never forgiven that. I was literally not allowed to discuss what happened to me. It wasn't until several years later that I ever heard another man actually understand instead of call me unmanly. And I can say as a fact, since I'm a trans man, that this expectation is not the same in women. I was allowed to be a victim as a woman, but as a man I was expected to never feel and just get over it, or worse, enjoy it.\n\nFuck that noise. I'm tired of seeing my friends suffer in silence or drown in a bottle. There are so many men in my life who have substance abuse problems because their social networks refused to allow them to be in pain. I've had a Devil Dog stumble into my home at 2am to cling to me and cry, and sleep in my bed just so he's not alone with his nightmares, because his girlfriend wouldn't be there for him. She thought he was weak. I've watched my father slowly retreat into himself behind a cloud of pot smoke because no one let him say \"a man molested me\" without calling him gay or weak. I'm tired of watching men suffer. It's fucked up.\n\nThe worst part for me was how many of the men in my life I looked up to that pushed me towards alcohol and burying my feelings. Therapy was for girls. Real men don't talk about feelings. Those same dudes wondered why I became an alcoholic. Society is so hostile to the pain of men in so many ways, because it's seen as weakness.\n\nEdit; Holy shit, for a comment I posted offhand in a coffee shop, this blew up. Thank y'all for the comments and support. I hope that me sharing this has helped some of y'all feel less alone or like you can make it through whatever you're dealing with. You're not alone. No matter how lonely and isolating this kind of thing feels, you are not alone. Please never hesitate to reach out if you need it. You are deserving of love and help.",
                                    "score": 4777,
                                    "author": "blackfox24",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My boyfriend was literally raped his entire chicldhood by a cop.  And now he absolutely loses his shit when the police are involved.  But this isn’t seen as something that should be taken into account he’s just violent. He can’t face his emotions or rape. He just fell into drugs. It destroyed our lives",
                                            "score": 1308,
                                            "author": "jax9999",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "So many people shame my dad for having fathered 8 children and abandoned most of them, but no one wants to talk about him watching his daughter die as an infant, or losing me to adoption after being tricked into making me, or the fact that he was pushed to sleep with women by the constant insinuations that he was gay and less of a man because a male relative took advantage of him. No, he's just an absent father and an asshole. The dude is FAR from perfect and I'm never gonna say he's a great dad, but he's doing the best he can given his circumstances. It's so fucked up that men can't have trauma that causes their behavior - they're just \"bad\".",
                                                    "score": 819,
                                                    "author": "blackfox24",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Fuck, that's a harsh life he's lived. I hope you've had a happy life and have tried to make up for the negative by being a better person yourself.",
                                                            "score": 73,
                                                            "author": "D1G1T4LM0NK3Y",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I try to be the man he wanted to be, and be a good uncle to my nephews, and a good brother to my sisters. It's all I can do. I want my dad to know that at least one of his kids will be okay.",
                                                                    "score": 82,
                                                                    "author": "blackfox24",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My best friend and boxing partner and general hard drinking tough guy was raped at a party I was at and it was super fucked up and then his attacker stalked him and threatened him and eventually effectively ran him out of town. It was super fucked up, and he didn't tell me most of this, I was just there and it was completely crazy and made me realize I had seen a man raped by a woman  before, at a music festival, in public and  no one did anything and I didn't even realize what I was seeing at the time because we're so conditioned against the concept.",
                                            "score": 600,
                                            "author": "boggart777",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Some years ago I watched a show about date rape, with some hesitation as it was done to me many years ago. They set up an experiment in a bar: a couple walks in, noisily engage in conversation that lets everyone else at the bar know they are just meeting for the first time, then, while one of them heads for the restroom, the other spikes their drink.\n\nWhen it was the women being drugged, everyone at the bar was saying \"when she gets back we need to tell her\", which they then did. Sometimes they verbally or physically confronted the man, or called the police.  When it was the man being drugged, they all laughed and said \"well, *he's* going to have an interesting night\", then just sat there suppressing giggles as the woman returned and led the 'drugged' guy out of the bar.\n\n(I just tried to find this on youtube to link the video, couldn't find it in the hundreds of \"date rape social experiment\" videos that now exist, a few of which have descriptions like \"enjoy the funniest pranks\".)\n\nIt's not a contest, anyone can be violated. But when we (men) talk about it, we get buried under an avalanche of \"women/trans/etc have it so much worse\", as though I am diluting their experience by sharing mine. It feels like... going to the hospital with burns over 30% of my body, and being told \"quit your whining, that person over there has burns over *40%* of their body\". Yeah, but... it still burns.",
                                                    "score": 77,
                                                    "author": "BennyPendentes",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I've been told to man up my entire life... I'm not even sure what it takes to make me cry. My empathy has been whittled down to children and old people.",
                            "score": 454,
                            "author": "Distortedhideaway",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "edit: ^( i’ve received a ridiculous amount of support for this comment. reading through other threads on this post makes me realize how sad it is that the mental health of men is so utterly overlooked. THAT NEEDS TO CHANGE. now back to my original comment: )\n \ni’ve been called a snowflake at my new electrical company because i try not to cuss and i don’t smoke or drink and i try to be a nice guy and i apologize when i say or do something inconvenient or rude, even if it wasn’t a huge deal. i don’t get mad at people for being dicks - tats just how they are. and yet they insult me and mock me and poke at my frankly fragile person to the point that i’ve thought about leaving... but can’t because then i really am a snowflake.",
                            "score": 794,
                            "author": "Burritos_ByMussolini",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You dont have to tolerate that kind of attitude, that's psychological harrassment.   Be proud of who you are and find a better place to work.",
                                    "score": 527,
                                    "author": "mathiosox69",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Even joking about it is bad for us",
                    "score": 1225,
                    "author": "sacanudo",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I wish more people would understand that letting yourself appear to be weak is realy just showing how much strength you actually have. It takes strength for people to admit something is wrong and no one should be belittled for it.",
                    "score": 445,
                    "author": "Saorren",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stop telling them to man up or grow a pair because men suffer too",
            "score": 10078,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This\n\nWhen I got a knee injury which the 911 crew said I normally should be passed out fron the pain, the only thing I was worried about was wether people would notice I had a tear coming out of my eye",
                    "score": 684,
                    "author": "epicoliver3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Shit man, that reminds me of a story.\n\nWhen I was a kid I broke 4 bones in my foot, and that's out of 5. Only the thickest one, connected to the big toe, didn't break. Metatarsals I think they're called.\n\nI was like 12 or 13. \n\nThis incompetent doctor put a small, worthless foam shoe on my foot, a foam shoe that I later found was only for use in conjunction with a plaster cast to give you some traction. \n\nAnd this bastard just told me to walk it off, that it wasn't broken. That was literally his advice. Walk it off. \n\nI did that for 2 weeks, trying to \"be a man.\" \n\nKnowing my foot was broken because I had heard the sound of thick sticks snapping when I fell on it wrong. And of course the pain, once the adrenaline wore off.\n\nHe didn't even give me crutches.\n\nI came back for a check up 2 weeks after the injury because obviously this quack's instructions did not help me, so he *finally* took x-rays and they were put up on this light up board in a hallway, and I happened to be sitting by them on a chair, when a different doctor came by, he walked by, then did that backwards walk thing when you're so focused on something you can't leave the room and start moonwalking.\n\nHe had noticed me and the x-ray, and he asked me if that was an x-ray of my foot. He also noticed my stupid little blue foam shoe on my foot with no cast on underneath.\n\nI told him yes, that's my foot.\n\nAnd I saw something I still can't believe.\n\nIt was like an episode of a hospital show. \n\nHe went in a room and grabbed the quack by the throat and slammed him against the wall! And just said one thing \"this is my patient now.\" \n\nAnd then he shoved him by the throat and came back to me and told me he would be taking over my care.\n\nHe studied my x-rays and then I had to \"be a man\" again.\n\nHe took me aside and he goes \"I know your family can't afford surgery. The surgery to fix this will cost at least $5,000. But if you can handle it, I'll rebreak your bones and put them back into place with my hands. You can never tell anyone or I'll get fired.\"\n\nSo I was like \"okay. lets do it.\" And it sucked. But he crammed my foot bones back in line and put a plaster cast on and gave me crutches and now I'm still walking around today, 20 years later. He's probably retired by now.\n\nThanks, Dr. L., for helping me and my family. I still don't know how to be a man but I will always keep trying to be more like you.",
                            "score": 264,
                            "author": "PM_ME_SEX_PICTURES",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That is METAL AF man! Glad to hear you can walk around, now that you've grown in to those huge balls you had that day!",
                                    "score": 94,
                                    "author": "etthat"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Awww...😔",
                            "score": 124,
                            "author": "TexasRose25"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hugs, compliments and cuddles. Men does not get enough of these things",
            "score": 6030,
            "author": "Trylletrold",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, this hits home, pretty much to the point that when I actually do get these things, I become internally uncomfortable. Almost don't feel worthy of them unless I've literally saved a life or done something amazing.",
                    "score": 1224,
                    "author": "cuckreddit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "People think I'm weird because I don't like being touched but the truth is that I do want to be touched. It's just that I've become so accustomed to not being touched that I find the feeling so foreign and when it does somehow happen it makes me uncomfortable.",
                            "score": 759,
                            "author": "Koto_otoK",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's sad how much I can relate to this comment",
                                    "score": 250,
                                    "author": "Aeruthael",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I feel the same.\n\nIt's also a major reason why I self sabotage so much when trying to improve things in my life, I've become so familiar with being miserable that whenever I'm not it feels wrong and deeply uncomfortable, like I'm trespassing or something.",
                                            "score": 120,
                                            "author": "yunivor",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Why tf is this so relatable ?",
                            "score": 150,
                            "author": "alphainfinitus",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "not abandon your best friend of 10 years after he begged you for help.\n\nfuck you, sam.",
            "score": 4755,
            "author": "rocknin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fuck you, sam, on this guy’s behalf",
                    "score": 2098,
                    "author": "PhoneyB0i",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "wait fuck that's my name, sorry :/",
                            "score": 776,
                            "author": "LolwhatYesme",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fuck the other Sam then.",
                                    "score": 872,
                                    "author": "alphainfinitus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Idk this Sam might have done something",
                                            "score": 533,
                                            "author": "The-Duke-of-Delco",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, fuck that other sam, and maybe this one too depending on what they've done.",
                                                    "score": 498,
                                                    "author": "onodriments",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's okay he'll compensate. Just go help out a bro emotionally Sam, we're here to help.",
                                                            "score": 147,
                                                            "author": "alphainfinitus",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fuck you, Kris.",
                    "score": 259,
                    "author": "Hamburger-Queefs",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 286,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ass-turd",
                            "score": 46,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fuck sam\n\nEdit : if anyone feeling like talking with an internet stranger hit me up, I really suck at advising and such. But I can listen to you all day long",
                    "score": 140,
                    "author": "hamidfatimi",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Compliment them, even if its something small. \n\n\"Wow that's a nice shirt, it looks good on you.\"\n\n\"Your hair looks nice today.\"\n\nA girl complimented my nose 4 years ago (weird I know), but I STILL remember that compliment.",
            "score": 13701,
            "author": "StayGoldBronyBoy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Two girls have complimented my teeth in the past six years, I remember their names. Compliments matter.",
                    "score": 2257,
                    "author": "GordonFreeman1998",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well I bet you have nice teeth",
                            "score": 1343,
                            "author": "StayGoldBronyBoy",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nice dick homie.\n\nEdit: Never thought complimenting a strangers dick would lead to my reddit medal cherry being popped, thank you for it :)",
                    "score": 8121,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow thanks! You too!!",
                            "score": 1548,
                            "author": "StayGoldBronyBoy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "i’m 100% not gay but if there was ever a dick that i’d want in my ass it’d be yours u/staygoldbronyboy",
                                    "score": 1366,
                                    "author": "MyNameIsUrMom",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He will remember this compliment for years to cum",
                                            "score": 849,
                                            "author": "IlllIIIIlllll",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Don't know why you got downvoted, but this could help a bit. It's incredibly easy to feel invisible and like you don't matter when you receive absolutely zero positive attention.",
                    "score": 226,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Provide more opportunities to form communities and activities that cater to different men's needs. A lot of us don't have friends or intimate platonic relationships, and we're in desperate need of that.",
            "score": 44284,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm a 34 yo married man who is also a father and I have no friends that I see or socialise with on the regular. I think this is a part of ageing and of having a family that needs me.\nThe same can also be said for my wife, she is the only person in her circle of friends who is a working mother and is married so she pretty much never sees any of her friends.  Sometimes things like family duties can just bury all your free time outside of work.",
                    "score": 3128,
                    "author": "Behold_the_Bear",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd bet a lot of money though that while your wife may not see her friends often that she talks to them very regularly. I mean it's telling that you start off saying you have no friends that you see or socialize with but then describe her as having a circle of friends. \n\nThe primary issue is in how men bond versus how women bond. Women can maintain very close relationships by simply talking over the phone. I'm obviously generalizing here, not every woman likes to spend 2 hours on the phone, some prefer texting, blah blah, the point is that they bond through TALKING. \n\nMen on the other hand bond through ACTIVITIES. It's pretty fucking hard to do an activity over the phone. Online gaming and voice chat has actually helped A LOT with this problem but most of the men suffering through this are going to have a hell of a time convincing their wife to let them game for 2 hours a night with their buddies. I mean you ever walk into a bar with two old dudes? They're barely even looking at each other, they're usually sitting on the same side watching whatever game is on the TV. \n\nSo yes the same can be said for your wife but it's not nearly the problem it is for her as it is for you and we need to stop pretending that there are no differences between men and women and we're all the same. Loneliness will fucking kill you and while it makes you feel like an asshole for even thinking that you might be lonely while you live in a house with a loving wife and your child(ren) it doesn't mean it's not true.",
                            "score": 4399,
                            "author": "Mlrkey",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The way I've heard it put is women bond face to face but men bond side by side.",
                                    "score": 2348,
                                    "author": "Tarantula_1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "A couple months ago my friend, who I hadn't even seen for a couple years.  Came over to my place while my fiance was out of town and we just played video games together.  For about 6 hours we just chilled and played video games.  When my fiance came home she started asking what we \"talked about\", if we talked about \"her or our relationship\" or basically anything else.  When I told her \"no, we barely talked unless it was about the game, but mostly just played games\". \n\nShe actually got upset about this, not to an extreme level or anything but she didn't think it was a good use of our time.  She just didn't like it really, so much so that she doesn't really believe all we did is play video games and did not talk about deep personal issues.\n\nThe thing is, it was what I really needed.  We talked about the games, he got to try VR for the first time.  Shit, I didn't even give him a tour of my house that he's never been in before, we just went straight to the game room and started playing.  We didn't even drink, it was just good to play video games with someone who doesn't ask so many damn questions, or needs help understanding the concepts. \n\nWhat I don't understand is we have 2 boys, the 5 year old lives with us full time and has his friends over a lot.  When his friends are over they are not having \"conversations\" they are playing or playing video games.  She sees that and doesn't question why him and his friends are not talking to one another about school or what their other friends said, they are simply spending time together.  \n\nYet suddenly the fact that my friend and I didn't play a round of 50 questions was not time well spent.  She can and does talk to her friends for hours on the phone, I don't.  What little time I get to spend with my friends we are doing something; even if its basically just work (working on a car or project).",
                                            "score": 1125,
                                            "author": "BannanasAreEvil",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 678,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Interestingly, this difference has been shown to be true with how men and women bond with their children as well.",
                                            "score": 277,
                                            "author": "rubBeaurdawg",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Well said. The bonding through activities is 100% accurate. As a married 33yo it’s how I stay up to date with friends. It’s embarrassing how much I enjoy Fortnite, but the social aspect of the game is why I love it. I get to stay up to date with some of my best friends regularly by logging on a few nights a week. My wife loves it because she hears me laughing all the time.",
                                    "score": 546,
                                    "author": "Don-Tron",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's tough man. Like I've made new friends over the past 5 years but when I think about how often I see these people? I can't even remember. I'll meet dudes that I think are pretty cool and I could see myself hanging out with but where does it go? So you reach out let's say and see if they wanna do something. Busy. They do the same. Now you're busy. They reach out again and \"eh... I don't really feel like it, I've been so busy, I kind of just wanna chill out at home and beat this game\" and it goes on and on until you both just give up and see each other whenever your girlfriends hang out or if they shop at your store or whatever the case is. \n\nI've got a good buddy of mine that I talk to pretty regularly through fb chat but I have literally never hung out with him outside of work related things where he will help me with a trade show or he'll pass by to pick something up or drop something off and we'll chat a big. Like now that I think of it I have literally never once hung out with this guy outside of situations like I just described. He has 2 kids, he basically can't do shit. He usually helps me with trade shows but he had to pass on the one coming up this weekend (and I couldn't find anyone else in time to go) because saturday he has basketball and there was no way his wife was going to let him have 2 days outside of the house even though the sunday with me would involve him working and making money. \n\nWhen I really noticed it was when my group of online friends started to get busy and not game as often but when they would game they played a game I didn't enjoy. I didn't realize how much I was getting out of those sessions until they were gone and I was left thinking \"why the fuck am I so lonely? nothing's change?\"",
                                            "score": 175,
                                            "author": "Mlrkey",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "meetup helps.\n\nBest I can think of is a video game group.",
                    "score": 9865,
                    "author": "nybx4life",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Me and my friends have recently started a video game book club. We pick a game a month, everyone plays it, then we meet up and talk about what we liked or didn't like about it. It can be hard to pick a game especially sense everyone needs to buy it, but there are a ton of great steam/indie games out there or old used games you can pick up for cheap. \n\nIt's been a hit and I can't recommend it enough.\n\nObligatory blow up edit:  \nThis thread blew up and I had a lot of people that expressed interest in joining. Given the nature of this thread I really feel like I need to give back. Someone made a subreddit /r/steamgameclub in response to this thread. Please join it if you feel like you need people to play games with. I’ll be there to help organize discord groups, discussions, and whatever I can do help get everyone together.",
                            "score": 12342,
                            "author": "ken_jammin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This sounds awesome",
                                    "score": 2355,
                                    "author": "wasteofleshntime",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "So you guys actually play games you buy/ have in your steam library this way, unbelievable!",
                                    "score": 1372,
                                    "author": "yisoonshin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We actually called it Shame of the Month, in an attempt to make some progress on our ever growing steam backlogs.",
                                            "score": 1063,
                                            "author": "ken_jammin",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No idea what you're talking about. Backlogs??\n\n*Sees 600 hours on Civ 6*.\n\nAh... yes. Now I get you.",
                                                    "score": 694,
                                                    "author": "Raffles7683",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Only 600? Those are chump numbers, gotta pump those numbers up!",
                                                            "score": 409,
                                                            "author": "OneTrickRaven",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Have you all tried to use humble bundle so you can get them as a subscription?",
                                                    "score": 141,
                                                    "author": "RnG_Hazed",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Board games, you're there with people, you're learning from them and playing in person. Not that you can't do that with video games but they've become too focused on online gaming and couch co-op has gone the way of the arcade. \n\nSo my suggestion, respectfully in contrast to yours, is board games.",
                            "score": 803,
                            "author": "TheDood715",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "D&amp;D gang rise up",
                                    "score": 698,
                                    "author": "2010AZ",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The biggest thrill of D&amp;D is actually finding a date/time that actually works for the whole group.",
                                            "score": 524,
                                            "author": "Skrivus",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Then you spend half the sessions catching up, play for an hour then do it again in 1-28 months",
                                                    "score": 374,
                                                    "author": "RayseBraize",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "My group played last 20 years and one month ago. I think we might hold a record.",
                                                            "score": 106,
                                                            "author": "dustirc",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There's absolutely nothing on Meetup that interests me where I live.",
                            "score": 166,
                            "author": "movezig5",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I DM for Dungeons and Dragons for 3 dudes and a gal including my brother who is on the autism spectrum. It has massively helped him come out of his shell and is now good friends with the people we play with. Been going on almost 2 years now.",
                    "score": 486,
                    "author": "The_Writer",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "we like hugs\n\n&amp;#x200B;\n\n&amp;#x200B;\n\njust hug pls\n\nI want a hug\nEdit\nWow that’s a lot of hugs\n*hugs everyone who saw this*",
            "score": 20259,
            "author": "CableTV112",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'll hug you.\n\nIt's a dude-hug, hands above the waist.  Big fat guy, so it's like a duvet.\n\nAnyone else want one?",
                    "score": 9871,
                    "author": "xaeromancer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd die for one of your hugs",
                            "score": 2579,
                            "author": "Chromshvoss",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don't do that!  That's what the hugs are meant to stop!\n\n[Sorry, I did the \"everyone on reddit is a dude\" assumption.  You might be a lady; still, don't die.]",
                                    "score": 1252,
                                    "author": "xaeromancer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Roger that Sir! :) But damn do I need that hug",
                                            "score": 376,
                                            "author": "Chromshvoss",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "＼( ^ - ^ )／\n(Reddit's crazy formatting needs a few extra spaces)\nhttps://blog.emojipedia.org/emojiology-hugging-face/",
                                                    "score": 160,
                                                    "author": "xaeromancer",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No kidding. Last year I was feeling super depressed and kind of had a rough day. I genuinely felt awful, and was basically crying to myself alone for a while. Just a load of stresses piled onto each other and I snapped.\n\nI was about to go home, when I passed by a group of friends. I nearly avoided them, but decided to go over and see them. And noticing that I was sad, one of my mates gave me a hug.\n\nAnd I burst into tears.\n\nI cried like a baby on his shoulders and let it all come out. I felt loved in that moment, and those few minutes in his arms helped take all my stress away.\n\nLove yourself and others peeps.",
                    "score": 1170,
                    "author": "Chocolate-spread",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; And noticing that I was sad, one of my mates gave me a hug.\n\nHe's a good one. Keep him around.",
                            "score": 272,
                            "author": "EverythingIsNorminal",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "That was a good friend and a decent human being.\n\nWhen I cried my friends were like, \"Is he CRYING? LOLOL\"\n\nI had a teacher make fun of me in front of the class for looking like I was going to cry when he kicked me out of class for being late (I had social anxiety.. that made it a lot worse)\n\nI've been called \"creepy\" and \"depressing\" for looking sad, let alone crying. There's a severe, severe double standard against men when it comes to showing emotions. Be happy or die, is the message I get from society (both other men and women).",
                            "score": 75,
                            "author": "NearbyNefariousness5",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Last time I had any physical contact with an adult is December 2018. I traded drugs for some cuddling.",
                    "score": 274,
                    "author": "BabbleBeans",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dude, people *need* physical contact. Some people might scoff at my recommendations, but they do help.\n\nHaircuts (at a decent barber) will have someone running their fingers through your hair for 20 minutes for $20-30. Massage therapy sessions are an hour, and are like $60 (I'm taking about a completely normal massage, btw.)\n\nI get a haircut about once a month and same for a massage. I space them out to have one or the other every two weeks. Absolutely worth it.",
                            "score": 146,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I see a childhood friend for the first time in 10ish years and I hug her goodbye.\n\nShe says, “why do you hug so awkwardly?”\n\nBecause I haven’t hugged anyone for literal years bro:( I don’t know how",
                    "score": 216,
                    "author": "thesausagegod",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; She says, “why do you hug so awkwardly?”\n\nIt's sad that the response to this is \"I need practice, is that okay?\"",
                            "score": 71,
                            "author": "Mithlas"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can't count how many times I've tried to approach friends about what I'm going through and gotten cold fucking receptions. I've been ghosted by friends on more than one occasion for doing little more than having feelings. Men are meant to act like nothing ever bothers them at all, and so we end up bottling it up till it comes out in the worst ways. For me, it's often alcohol.",
            "score": 323,
            "author": "MethSC",
            "replies": []
        },
        {
            "level": 0,
            "comment": "\\- Stop using expressions such as \"man up\", \"stop being a pussy\" when a man expresses any sad emotions. \n\n\\- Lead by example. For so long, men have been taught that they always have to be hard and tough to be \"real men\". It's time to break that cycle and have fathers show their sons and daughter that it's okay to feel all da emotions. That it's okay to cry, it's okay to be vulnerable and open up about your struggles. \n\n\\- Accepting that men can also be victims of physical/emotional abuse and rape, and providing as much support for them as we do for women. \n\n\\- LISTEN TO EACH OTHER, it's pointless telling men to open up about their feelings if no one is there to take them seriously.\n\n\\- Body shaming is just as bad when it's directed at a man. Men receive so little compliments, tell them they're looking fit!\n\nEdit: thank you so much for the gold! I’m finding the discussion in the replies so interesting and am so glad to be a part of it. You people raised some great points, I’ll reply later but just to clear up a few things...\n\nWhen I say let men cry and show feelings, I do not mean they need to start crying and mull over every little thing. All I’m saying is that there needs to be a healthy balance between expressing and regulating your emotions. Everyone has different coping mechanisms. Yes, at times it’s necessary to “just suck it up”, to do what you gotta do. However, it’s not healthy to just suppress every negative emotion (Something that’s still often encouraged in our society). Not only does this cause things to build up, eventually destroying your mental health, but also, it inhibits you from learning how to communicate your feelings (good and bad) to people. \nIf something hurts, then it fucking hurts. If it upsets you to the point of tears, that’s okay! Let it all out, there’s no shaming here! Girlfriend broke up with you and you need to just talk it out? Call up your friend! Tell them how this really sucks and how they can support you. Don’t feel like talking to anyone about it? That’s okay too! Let your friends know that you’re going through a hard time and you can fill them in later if you want to, after you’ve had your time alone. \n\nIn short, let’s break down those outdated gender norms and start using those healthy coping mechanisms, cheers!",
            "score": 834,
            "author": "TopClassTrier",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Probably do something about the male homeless problem. Last stat I saw was around 85% of the homeless  population was male.",
            "score": 17792,
            "author": "gravydavid",
            "replies": [
                {
                    "level": 1,
                    "comment": "In my town, there is exactly one homeless shelter that will admit men, even when it's below freezing outside.  The rest have a very strict women- and children-only policy.  They'll turn away entire families unless they're willing to split up and send the father back out into the cold.",
                    "score": 10401,
                    "author": "scottevil110",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why? Doesn’t anybody protest?",
                            "score": 5190,
                            "author": "TNTom04",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Unfortunately, I doubt the homeless make a powerful voting block.",
                                    "score": 7429,
                                    "author": "mpinnegar",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I just don’t understand why a homeless shelter exists that ignores 85% of the people they should be helping. People should protest otherwise things like this keep happening.",
                                            "score": 3504,
                                            "author": "TNTom04",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Men aren’t seen as a vulnerable population while women and children are. Men who end up homeless are often seen as either failures (at best) as well as pedophiles, rapists, mentally ill, or drug addicts (see all the people who justify not giving any money to the homeless guy at the corner because they assume it will just be spent on a bottle of booze) while women and children are seen as victims of circumstance and need to be given resources. It’s not fair but that’s how it is in my experience.",
                                                    "score": 2649,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Frostbite don't care.  Everybody is vulnerable to freezing.",
                                                            "score": 722,
                                                            "author": "misterrespectful",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Frostbite advocates equality more than a charity organization. Who knew?",
                                                                    "score": 369,
                                                                    "author": "JustinJakeAshton",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "An english professor of mine told a story about when he saw a bum outside a bar and gave him money, and his friend turned to him and said, “you know he is just going to spend it on booze right.” And my professor said, “we’re walking into a bar right now! *That* guy has a much better reason to drink than we do.” And then he said to the class, “I’d rather have a bottle in front of me than a frontal lobotomy.”\n\nMy point is, who gives a flying fuck what they spend it on! Now I’m going to go drink a beer.",
                                                            "score": 276,
                                                            "author": "TurintheDragonhelm",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I was temporarily homeless.. every woman in the shelter was crazy as fuck and full of addictions. Im no exception.",
                                                            "score": 399,
                                                            "author": "LetsStayAwake",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Because society doesn't really feel bad for men who have been deemed failures. It does worry about women and especially children.",
                                                    "score": 3304,
                                                    "author": "Killbot_Wants_Hug",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Also men have always been considered disposable. We're the ones that do the dangerous work we're the ones that go to war. Kind of a natural evolution but it is still shitty.",
                                                            "score": 104,
                                                            "author": "Crotalus_rex",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Generally you need a registered address to be registered to vote\n\n[https://giphy.com/gifs/culture--think-hmm-d3mlE7uhX8KFgEmY](https://giphy.com/gifs/culture--think-hmm-d3mlE7uhX8KFgEmY)",
                                            "score": 158,
                                            "author": "pixel_of_moral_decay",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 2584,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That's the norm. Not just your town. I've done volunteer work, that was outreach based, in couple of the places I've lived over the years and none of these places had anywhere for men to go. One of these cities was a major city too, of about a million people. Nothing for men.",
                            "score": 249,
                            "author": "Slayer562",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Same here. We have about 3-4 womens/children shelters but 1 men's shelter.",
                            "score": 115,
                            "author": "Schmeisterr"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Statistically speaking men work more, work longer hours, work in more dangerous professions and consume more drugs (alcohol and other). In addition men, on average, have fewer close friends and feel lonelier than women. I think the fatigue of such a life can be quite draining. \n\nI don't think the problem is that men do not talk about their feelings. I think the problem is that they often don't have someone to talk to. \nIn addition, it can be quite hard to make new friends. Especially when you are past your twenties. You know, people you are potentially interested in are married and have kids. They are preoccupied with their own lives. \n\nI felt very lonely and sad after my last long term relationship ended. It took me over 6 months to find new friends and I'm a hardcore extrovert. Still, I made a bunch of new friends within the past year or so. \n\nI'd like to encourage anyone who feels lonely to put yourself out there. Talk to people. If you like them, ask them if they like to hang out with you. Do you know how I became friends with one of my best friends? I straight up told him that I felt lonely and that I like him and would like to become friends with him. \nAnd for those of you who already have plenty of friends and a busy life: Maybe make some room for people in your community who aren't as blessed as you are.",
            "score": 13807,
            "author": "reddish4radish",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm 40 and confirm that it's very hard to find/make new friends after mid twenties. Toss in the fact that I'm not into watching sports and it's just that much harder to even jump into a conversation let alone make a connection.",
                    "score": 192,
                    "author": "gimmehotcoffee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lack of interest in sport is such a big obstacle. I've never been interested in football and when I was standing next to friends talking about footballers, matches from years ago, remembering every action was such a bummer, I've felt so out of place...\n\nLast season I started to watch Formula 1 and got interested again in other motorsports and suddenly with some friends I have very limited contact I could talk about it and even meet with them to watch races. It's crazy how important sports are in men's life and how difficult it can be for guys that don't like it.",
                            "score": 42,
                            "author": "p1en1ek",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "kill us yourselves. that way the suicide rate is lower.",
            "score": 4455,
            "author": "ToazterWafflez",
            "replies": [
                {
                    "level": 1,
                    "comment": "“I’m something of an activist myself”",
                    "score": 2194,
                    "author": "TheKillerSloth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for the laugh, was kinda tough reading this thread and the joke made it easier. Cheers!",
                            "score": 302,
                            "author": "xavima24",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Give us one compliment!! Just one!!\nA girl once said I had really pretty eyes. That shit was 7 years ago and I remember it perfectly because its all I've gotten in 7 years.",
            "score": 10755,
            "author": "nickooto",
            "replies": [
                {
                    "level": 1,
                    "comment": "I had a patient tell me my eyes were \"a lovely shade of shit stain green\" and I still remember it 6 years later. Not only because it was a good burncompliment but because men just don't get any form of compliments often.\n\nI generally make it a point to compliment my wife several times a week. We're going out? 'you look fantastic' she just got back from the gym? 'booty on point, babe' etc. She also can't walk 5 feet without some rando complimenting her.\n\nI get about 1 or 2 compliments a year at most from her, generally I have to solicit them, too. I've even discussed it with her several times. Hasn't changed anything.\n\nEdit* don’t like to edit but, 1.) I love my wife, and my wife loves me. This was only highlighting the men compliment issue. 2.) people using this as an antiwoman redpill nonsense jumping off point need to chill the fuck out, and self reflect why all the advice I’m getting to passive aggressively or gaslight my wife into thinking I don’t love her or don’t find her attractive any more as a way to elicit compliments from her is the source of your interpersonal relationship issues with the women in your life.",
                    "score": 1548,
                    "author": "NM_NRP",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Gonna need some proof of these lovely shit stain green eyes, my dude.",
                            "score": 565,
                            "author": "PM_ME_SEXY_MONSTERS",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It's called a complisult: one part compliment, one part insult. He invented them, and I coined the term.\n\nSee what I did just there? That was an explanabrag.",
                            "score": 808,
                            "author": "HolycommentMattman",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Shit stain green is my favorite colour!",
                            "score": 74,
                            "author": "Dark_Gnosis"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 1994,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Literally didn't get a compliment once after I got told I smell nice 10 years ago. Got the same compliment recently and it is was like \"damn, has it really been that long?\"\n\nAnd no, I did wash regularly and keep myself clean.",
                            "score": 773,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "You should also compliment other men. I grew up with a lot of internalized homophobia, and have been getting over that for a while and I think it's also important for other men to give compliments to each other.",
                            "score": 448,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Women compliment each other often. I didn't realize that was a thing men don't normally do.\n\nHow sad.",
                                    "score": 278,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Well, ahem, I think your eyes are nice, too.",
                    "score": 353,
                    "author": "GordonFreeman1998",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Do male friends compliment each other at all? I  feel like good female friendships involves a ton of compliments and emotional support to build each other up, like *way* more compliments than the average woman would ever get from men (especially  genuine ones since a lot of the time women will just assume you've  only complimenting them to get in their pants)",
                    "score": 303,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Allow men to express sorrow without shaming them and instead supply support. The 'real men dont cry' idea kills.",
            "score": 764,
            "author": "drjamesbarry",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Probably ease all of the pressure our society puts on men. We don't talk about the emotional toll of social pressure on men nearly enough",
            "score": 2015,
            "author": "gr8prajwalb",
            "replies": []
        },
        {
            "level": 0,
            "comment": "People's reaction to men that commit suicide: \n&gt;Omg that's so tragic. If only he had gotten help! How could anyone think they're that alone? \n\nPeople's reaction to men on the verge of suicide: \n&gt;Omg, he's so creepy. He's such a downer. Stay away from him, he's such a freak! Eww, can you imagine even living like that? Pathetic. What a loser. So cringe... \n\nIt's pretty much this.",
            "score": 1424,
            "author": "NothingCrazy",
            "replies": [
                {
                    "level": 1,
                    "comment": "For reals. I attempted suicide and was called a lil bitch and everyone was like wtf dude, but I was thinking what about all of the people who actually died? You treat them like victims, but you treat people who’ve attempted like attention seeking creeps. Even people who are only attention seeking have a problem that’s being tossed to the wind. Suicide only matters if you’re successful.",
                    "score": 389,
                    "author": "AbyssalKraken",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yoooooo I feel this. A Colombian guy I used to live with told me white girls say “creepy” but what they really mean is X person is filled with negative energy. They could be actively working through a trauma/tough time or are just trying to survive the day. \n\nIt really doesn’t help to just label someone like that. I believe that guy does need self love, but it’s natural for anyone going through a rough time to seek help outside of themselves. No one wants to help anyone deal with their negativity at least for men. \n\nWomen have lots of support.",
                            "score": 55,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3123,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "His name was Ari Behn. He was married to princess Martha Louise, the daughter of king Harald. Ari and Martha divorced a few years ago. He was an author and artist. He lived in NYC alot because he thought that's where he actually belonged. He left two young daughters behind, one held an ulogy at the funeral that brought the whole country to tears, pleading people to reach out for help instead of ending it all. Hit the country like a ton of bricks during Christmas.\n\nEdit. Included a link for the English speaking here:\n\nhttps://en.m.wikipedia.org/wiki/Ari_Behn",
                    "score": 805,
                    "author": "FluffbucketFester",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Behn achieved early literary success with his 1999 short stories collection Trist som faen (\"Sad as hell\"), which sold about 100,000 copies.\n\nSeems like this was going on for a while...",
                            "score": 227,
                            "author": "ThePlumThief",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Did I just read what I thought I just read.",
                    "score": 773,
                    "author": "cryptidhunter101",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes sir. Unfortunately.",
                            "score": 331,
                            "author": "ichor159"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah. A guy from the royal family killed himself, so we need to invest in better mental health for girls",
                            "score": 356,
                            "author": "monsoy",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; Some times I hate politics. We are failing our precious boys.\n\nStudies have also shown that modern schooling, from kindergarten through grad school, disproportionately favors styles more beneficial to women. Younger boys for instance aren't given the recess time to properly burn off excess energy, which leads to difficulties focusing in class and over-medication of young boys. Colleges are seeing women graduating at increasingly higher rates over men as well. None of that is bad to be clear, but we shouldn't ignore that men are falling behind.\n\nI think what society has been able to do to empower women is excellent and needs to continue, but that we need to start working to make similar improvements for men as well. \n\nIt's a hard subject to discuss without facing opposition claiming sexism, but the reality is that this is not a zero sum game. Society can do better to provide modern solutions for men's problems without compromising on what we're doing already for women. We should work to maintain the growth rates women are seeing in graduation numbers while also working to bring men up to those same rates for instance.\n\nIssues like the lack of (and even public push back against) battered men's shelters highlights that as a society we're failing to acknowledge the issues that men face have evolved and need to be acknowledged in the same way we do so for women's issues. As women take a more equal role in society it should be expected that men begin to face issues traditionally associated with women and vice versa.",
                    "score": 1063,
                    "author": "Urbanscuba",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I had teachers throughout elementary school that for YEARS would try to label me as a mischievous little shit at every turn.  One teacher (notoriously popular with all of the girl students and seen as the devil by all the boys) tried to convince my parents to have me held back because of this, despite the fact that my test scores were among the highest in the class and i clearly was among the smarter kids.  Why? Because I had a ton of energy, asked too many questions, and spoke to much.  IMAGINE TRYING TO LABEL SOMEONE A PROBLEM BECAUSE THEY ASK TOO MANY QUESTIONS AS AN 8 YEAR OLD KID.  \n\nAnyway, years later my life is great, went to a top school and have a job i love, and that bitch ended up with triplets - all boys too - so I sure hope she adjusted to young boys. \n\nPoint is yes, many schools and teachers are not equipped for adolescent boys.",
                            "score": 414,
                            "author": "yosoydorf",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm one of the ones who never quite made it out of this. To this DAY as an adult I'm punished for asking too many questions at new jobs. WHY? Why is curiosity an undesirable trait for men? I'm not this silent brick slave-robot that knows how to do everything automatically.",
                                    "score": 126,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stop teaching them to suppress and bottle up their emotions.\n\nIf you know how to actually *feel* the things you're experiencing then when shit gets hard you can deal with it easier. Otherwise you're left with a sense of discomfort, a nauseating sickening twisting in your gut and a sense that *something* is wrong. You're not sure what, just that things aren't right and you need it to stop right now. You drink, you punch the wall, you hurt yourself. You try to cry but tears don't come because all you know about crying is, \"Man up.\" \"Grow up.\" \"Boys don't cry.\"\n\nYou try to tell people you're not okay, a shrug when they ask how things are going. Telling people who care about you, you're not feeling so great or are having a bad week. But the lacklustre way, that is the only way, you feel comfortable talking about how you feel doesn't draw the help it needs, and why would it.. or should it? You're a man, you shouldn't ask for help, or even *need* it. You deal with these things alone because you're a rock, a pillar of support, the one who stays calm when things go wrong.\n\nSo instead of unloading, or dealing with the issues they get carried, bottled up, pushed down, hidden. You desensitise yourself to them however you can and remain stoic. But eventually even stone crumbles and when it does it's too late. There's too much, it's overwhelming. You don't even know where to start, the only thing you know is you want it to stop, *need* it to stop. And admitting you need help now would only make it hurt more, but you're sure you can't stand another ounce of pain, so you take the only option available...",
            "score": 700,
            "author": "fur_tea_tree",
            "replies": [
                {
                    "level": 1,
                    "comment": "This last paragraph really hits the nail on the head. \nThat’s exactly what it feels like.",
                    "score": 99,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Both fuck you and thank you. Out of all the comments in this thread, your comment is the one that made me cry. I don't think any other post has quite gotten it like this. And I don't think i'd've been able to express how I've felt about this like you have",
                    "score": 59,
                    "author": "AKA_Toad"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not turn them away when they tell us what they’re struggling with.\nOH MY DOG THIS BLEW UP!!! Anyway I’m so sorry to everyone who posted here sharing their cases of being turned down. I hope you all find someone who is gonna listen and help you. 💙💖",
            "score": 36489,
            "author": "Hackie-Puff",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s always the same. “Oh man that sucks, but you wouldn’t believe how hard it is for ME!”\n\nEdit: This is not just about women saying to men, but also men to men. thank you for all of your kindness!",
                    "score": 14321,
                    "author": "zskultety",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lmao yeah, I hope people don’t make it an argument as to who has a harder life woman vs men, those type of people just want to argue that men have it harder or woman do, trying to cancel things like movements for woman or such, but I wish we just closed it off as to we all have problems, but we all just have different problems. :) in the end we’ll all try to help each other and make the world a better place.",
                            "score": 4728,
                            "author": "ZukusCatHeaven_Art",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I find it easier to manage my depression when I’m helping other people. Honestly I wish I could talk to people about mine but helping other people is really the best I can do at the moment.\n\nEdit: I’m gonna be that guy,  but thanks for all the awards! I’m not trying to be a hero or anything, I’m just trying to give other people what I never had. Stay strong everyone.",
                                    "score": 4291,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;but helping other people is really the best I can do at the moment.\n\nHey dude, it's enough. Thanks for your effort and your thought for others. When you're ready to talk, someone will be there for you, they'll just be paying it forward because someone like you helped them. \n\n&gt;I find it easier to manage my depression when I’m helping other people.\n\nBecause that's what heroes do.",
                                            "score": 1432,
                                            "author": "Steampunk_flyboy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well said!",
                                                    "score": 161,
                                                    "author": "tree_mitty",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "very well said indeed. made me teary",
                                                            "score": 94,
                                                            "author": "buddybroman"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It helps to type it all out even if people aren't going to really listen I've found. It's a form of therapy for me anyway. I don't like to burden people with my issues even if they're an anonymous person on the internet. So, when I collect my thoughts and type everything out, I can kind of see what's really troubling me and think about ways to fix it or at least cope with it.",
                                            "score": 135,
                                            "author": "zebracakes64",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "yeah its hard, if a guy says he feels bad, in most cases its because he reached his limits.. its sad :/",
                    "score": 1792,
                    "author": "PenguinsTrain",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is sooooooooooo true, i just recently starting telling people i'm really depressed,stressed,angry,etc.. its because i don't know what else to do, its absolutely killing me inside now..",
                            "score": 1343,
                            "author": "djamp42",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I started having panic attacks recently and have only told two people and it was insanely difficult. I thankfully have never had suicidal thoughts, but I do sometimes think it'd be okay if I just died randomly. Like, at least then I wouldn't be feeling bad, and my family wouldn't have to wonder why I was gone.\n\nNever actually put that out there before. Feels bad. Really bad.\n\nEdit: Thank you guys, everyone. I don't have it worse than most people. I don't know why I feel this way. I just want things to change, and I really appreciate everyone here who posted. Like I said, I don't have any truly suicidal thoughts, but it sounds like what I have is adjacent. I promise I'll keep posting. Thanks guys, really.\n\nEdit: And please keep doing what you're doing, silent counselors of Reddit. I want to have the strength to help people but I don't right now. You guys really do make a difference, even if the people you respond to don't reply. I've done that a lot, gotten a reply that meant a lot to me, but I didn't write back. It's just hard to know what to say, but you really do help so much.\n\nThanks guys. You really make a difference here.",
                                    "score": 658,
                                    "author": "Stickguy259",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Good on you for putting it out there, though, I hope it helps to say it.  I've felt that myself: like, if I died in some tragic accident or a heart attack in the night, my family wouldn't hate me and they'd get community support, life insurance, etc.  If I could go out a hero, like jumping in front of a bullet meant for someone important to me, that would be amazing.\n\nI have felt that way when I was really low, pushed past my limits and stressed/scared/etc and nobody really wants to hear about my problems.  They just tell me I'll \"get through it\" and nod and change the subject.",
                                            "score": 143,
                                            "author": "uniformon",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I told my committed gf of 5.5 years I was feeling depressed and lost and like I wasn't ever going to get where I wanted to go (lots of personal stuff involved here, but that's the gist). She dumped me because I wasn't stable enough for her - the girl who is living with her parents and having her mom and dad do all her chores and run all her car errands and grocery trips for her while she books Europe trips and dumps her serious boyfriend. Fun stuff feeling like even in the most unconditional love I've ever experienced, I shouldn't have been open about myself and my own mental state.",
                            "score": 1042,
                            "author": "Idontcommentorpost",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No. You absolutely should have opened up yourself because it enabled you to dodge a fucking bullet.",
                                    "score": 1424,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My thought exactly, almost verbatim. He definitely dodged a bullet. Better to find out now, than later, that she is self-centered.\n\nEdit: corrected a misspelled word. Thank you for pointing that out. :)",
                                            "score": 374,
                                            "author": "Richski069",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You'll look back on that moment someday and think \"Bullet fucking dodged\"",
                                    "score": 328,
                                    "author": "TiaxTheMig1",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My best friend (we've been friends for more than 20+ years and we're 26 years old, so I know how he is) once told me he was done with life and wanted to walk away. Went after him and had good talk about his feelings and that he should get some help. Men aren't used to talk about their feelings, because it's ''not done'' or ''girly''... It's so weird!\n\nEdit: My friend is in a much better place now! He learned to talk about his feelings and is more open about it, which is great.\n\nEdit 2: No, he's not dead... I meant mentally!",
                    "score": 707,
                    "author": "MartySpecial",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Destigmatize men talking about their feelings and thoughts",
            "score": 7626,
            "author": "bscelest",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not only that, but make men's resources a normal thing. When I was finishing high school and visiting colleges, I noticed that almost all had a Women's Resources Center, but none (that I saw) had a Men's Resources Center. I definitely think that colleges making their campuses a safe, healthy place for women is extremely important, but they should be doing it for men as well. I realize men don't have to deal with sexual assault and other issues nearly to the same extent as women, but there are many other factors that can contribute to a student's well-being. I think, especially in the formative years while young men and women are in college, they should be given resources to deal with whatever is causing them to feel anxious, depressed, alone, etc.",
                    "score": 1231,
                    "author": "Andrado",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah. Guys are more likely to deal with alcoholism and other addictions during university, last I checked. Men are also more likely to get into fights and seriously injured, or to engage in binge drinking. \n\nHaving a campus center that pays attention to that would probably be very helpful.",
                            "score": 281,
                            "author": "Eager_Question",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Work towards fixing the fact that most men have some form of depression",
            "score": 5273,
            "author": "emeraldkma",
            "replies": [
                {
                    "level": 1,
                    "comment": "As Thoreau said, \"the mass of men lead lives of quiet desperation.\"",
                    "score": 3059,
                    "author": "Ordinary_Mycologist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1097,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ugh Thoreau always annoyed me. Wrote a whole book about how men should “live solitarily with nature and have few friends” but in reality, he took up his friend’s backyard and had money to go out to the town and do some shopping.",
                                    "score": 417,
                                    "author": "unkemptjellyfish",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think the point is that more people would be happy if they had that level of freedom.",
                                            "score": 76,
                                            "author": "madeup6",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes. You are indeed correct.",
                                    "score": 296,
                                    "author": "Ordinary_Mycologist",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "But as Pink Floyd said, \"Hanging on in quiet desperation is the *English* way.\"",
                            "score": 299,
                            "author": "Aredhel_Wren",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The worst part of getting older is \"Time\" making more and more sense.",
                                    "score": 119,
                                    "author": "MauPow",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This whole time I thought Pink Floyd made that up but it was an allusion to Thoreau",
                            "score": 102,
                            "author": "Girth_Soup"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stop assuming anyone concerned about men's issues is a misogynist",
            "score": 2780,
            "author": "thardoc",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Actually listen to their problems and not yell at them and say \"you're a man don't be such a wimp\"",
            "score": 186,
            "author": "Incocnito_bunny",
            "replies": []
        },
        {
            "level": 0,
            "comment": "funding for mental health, and understanding as a society. \n\neasier said than done, especially in certain cultures.",
            "score": 243,
            "author": "dourdan",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I think a big part of it is a sense of purpose.\n\n\nIncreasingly, the work we do doesn't produce such apparent results.  For instance, a man used to go into the woods and hunt an animal.  It was very difficult, but when he came home with meat, his family could eat and everyone was thankful that they aren't eating soup again.  Everyone loves dad.\n\n\nBut today, a man might go into the office, input some data, crunch some numbers, sign some paperwork... But what is he doing?  Does his wife and kids appreciate it?  Not as much.\n\n\nAnd it's not just work.  Men used to mow their lawn, change their oil, repair things around the house, etc.  But now all of that stuff is hired out to others.\n\n\n\nThe result is that they don't feel useful or appreciated.  And if they aren't useful, what is their purpose?\n\n\nIt's kind of like generating vs consuming content.  If you sit and watch YouTube all day every day, you will start to feel like a pretty worthless piece of shit.  But if you *create* YouTube videos, you would feel like you're doing something.  Like you have a purpose.  That applies to life in general.  People are increasingly consuming more and creating less.\n\n\n\nI have noticed that when I start to feel down and depressed it's because of this.  It's usually when I haven't had any little \"wins\" in my life and I have just been kind of floating through and going through the motions.\n\n\nIf I let that go for too long, I could see how it could lead to deep dark depression.\n\n\n\nSo what can we do?  Women, show your men affection and appreciation.  Even if they don't do much good, at least show appreciation for the little good they do to motivate them to do better and grow.  And men, do something.  Help out around the house, fix something, draw something, do something nice for your partner or your kids, learn another language, learn a musical instrument, build something..... Just be productive and try to limit the time you are *consuming*. (TV, video games, browsing the internet, reading fiction, social media, etc)   You'll feel much more accomplished and healthy when you have more to offer the world, those around you, and yourself.",
            "score": 3805,
            "author": "B0h1c4",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 520,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As a data puncher who isn't completely happy, I'm curious what is your job in \"natural resources\"?\n\nWhats your background and education?",
                            "score": 106,
                            "author": "cheerl231",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 79,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thank you for this commentary.  There's a discussion on a different board about skilled &amp; unskilled labor....your post articulated something that was on my mind but I hadn't been able to convey.  The sense of work that is purposeful, healthy, and makes a tangible, better difference in the world.  I think that was lost in the discussion (e.g. confusing pay/how long it took to acquire skills, etc. with the doing a job/whatever the pay that adds value to the world).",
                            "score": 49,
                            "author": "carnivalmapletree",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What you explained is actually one of the criticisms of industrial society mentioned in the Unabomber's manifesto: how quickly modernization has changed what Kaczynski calls the \"power process\", goal-setting, and artificial fulfillment of needs.\n\n&gt;Human beings have a need (probably based in biology) for something that we will call the “power process.” The power process has four elements. The three most clear-cut of these we call 1) Goal 2) Effort and 3) Attainment of goal. Everyone needs to have goals whose attainment requires effort, and needs to succeed in attaining at least some of his goals. When people do not have to exert themselves to satisfy their physical needs [because they are already provided for in modern society] they often set up artificial goals for themselves. We use the term “surrogate activity” to designate [these activities] that people set up for themselves merely in order to have some goal to work toward, or let us say, merely for the sake of the “fulfillment” that they get from pursuing the goal. [These surrogate activities can prove unfulfilling and give us a false sense of accomplishment or leave us constantly wanting more without ever feeling satisfied or as if we have done something worthwhile]. \n\n\n&gt;The fourth element is more difficult to define and may not be necessary for everyone. We call it autonomy. Their efforts must be undertaken on their own initiative and must be under their own direction and control. Yet most people do not have to exert this initiative, direction and control as single individuals. It is usually enough to act as a member of a small group. \n\n\n&gt; For most people it is through the power process—having a goal, making an AUTONOMOUS effort and attaining the goal—that self-esteem, self-confidence and a sense of power are acquired. When one does not have adequate opportunity to go through the power process the consequences are (depending on the individual and on the way the power process is disrupted) boredom, demoralization, low self-esteem, inferiority feelings, defeatism, depression, anxiety, guilt, frustration, hostility, spouse or child abuse, insatiable hedonism, abnormal sexual behavior, sleep disorders, eating disorders, etc.\n\nIf you're interested in the idea, *Finite and Infinite Games* is an interesting book that uses game theory to explain how we sustain ourselves and set goals.",
                    "score": 390,
                    "author": "kralcleahcim",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Although we are \"allowed\"  encouraged to be open about how we feel or think, we can't. If something is a genuine problem and we verbalise it, the reaction is almost always others jumping down our throat as we have no right to complain, or mocking as we have supposedly been living privileged.  \n\nIt's become worse in recent years as we literally have to tiptoe around while being blamed for everything generations before us supposedly did. Most men alive today had no part in anything that was done to others. We were born into a different world where we have always been on the back foot, yet carry a lot of the blame and stigma from things we had nothing to do with.  I'm expecting this post to get mass downvoted purely for openly saying what I personally live and experience.  We don't talk about that shit because it get's hammered back at us, so we shut the fuck up and just keep going until we break, then everyone is like \"oh you should have said something\" No, we shouldnt as it just creates more stress and makes things more difficult. \n\n&amp;#x200B;\n\nYou want to help, then create an environment for men equal to that of everyone else instead of dwelling on the doings of long dead people and putting men seperate and last.  The thing about equality is that EVERYONE is equal regardless of gender, sexuality and age etc.\n\nPeople want to know what can be done to help, but when they know it just gets buried again. It's easier to just not bring it up so we don't face all the BS and drama about how hard everyone else has it as if we live in golden castles. Too many people see the world through decades old rose tinted glasses. Things need to change.",
            "score": 4284,
            "author": "Ninerism",
            "replies": [
                {
                    "level": 1,
                    "comment": "A-fucking-men. People that say \"open up\" actually hasn't had anyone open up to them(generalizing here). You go from feeling bad about whatever, to feeling bad about whatever and telling so and so about it. It didn't help, it made it worse and now it's fucking awkward. No thanks.",
                    "score": 224,
                    "author": "sweezey",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This is exactly correct, we’re being told that we can open up, but when we do we’re shot down in the most horrible ways which makes us close off even more than we did before. And I’d go so far as to say sometimes when we open up people tell us that maybe we’re actually a woman, when we’re just upset. Masculinity being so harshly murdered and criticized is another problem, because as men what the fuck else can we be if we can’t be masculine?",
                    "score": 895,
                    "author": "GreenSockNinja",
                    "replies": []
                }
            ]
        }
    ]
}