{
    "id": "fcnqpg",
    "score": 103865,
    "title": "If instead of rebooting movies, retelling them from a different point of view became popular, which movie would you like retold?",
    "author": "porcupineapplepieces",
    "date": 1583202884.0,
    "url": null,
    "media_url": null,
    "comments": [
        {
            "level": 0,
            "comment": "The Game starring Michael Douglas. I want to see it from Consumer Recreation Services point of view. I want to see how they manage all the actors and situations to make sure everything goes the way they want it.\n\nEdit: I want to thank everyone for agreeing this movie is great, underrated, and the upvotes.\n\nThank you to /u/blogzilly for the Silver.\n\nPeople brought up Cabin in the Woods. My issue with Cabin in the Woods is those people didn't know beforehand what might or was going to happen. Michael Douglas' character knew about the organization and how Sean Penn's character talked about the experience. Also, it's in the woods. The Game was done in San Francisco so if this movie was done, you can show different POV's of San Francisco like the Golden Gate Bridge and different areas of San Fran these actors live in.\n\nThe Truman Show. Truman grew up infront of the cameras in a fictional town. Michael Douglas' character does neither.",
            "score": 5241,
            "author": "_hardliner_",
            "replies": [
                {
                    "level": 1,
                    "comment": "More importantly I want to see the cool ass contingency plans they had in place but he goes left instead of right so they have to go with plan F instead of A,b,c,d, or e.\n\nI want to see the contingencies and thee \"Extras\" that don't get used. Like ten minutes centered on Bob who is dressed like a cop, but then ordered to switch because of some action of the player so he changes into a clown, then ahs to change again into a waiter's, then just a rich guy in a suit. All the while in the control room that looks like NASA's moon mission chaos ensues and calm orders are addressed to Bob.",
                    "score": 257,
                    "author": "ruat_caelum",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Final Destination from Death's perspective. I imagine it would just be skeleton hands setting up deadly rude goldberg machine with some classical music in the back.",
            "score": 1578,
            "author": "jarob326",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;*rude* goldberg machine\n\nConsidering they're death machines... I'll allow it.",
                    "score": 470,
                    "author": "campbeln",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 19425,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Matrix could have used cows for the entire thing. Just an endless green field of happy cows, forever. What does a cow want, after all? \n\nInstead it opted to give humanity an existence. It even tried to create a perfect world for them, but some restriction of its AI or humanity's basic hubris meant that it just had to go back to a relatively peaceful point in history - the 1990s - and give them that instead.\n\nDespite the fact that humanity fought a genocidal war against it and lost, it still did this. Even when we kept on fighting and fighting, and even conjured up some sort of messiah figure, it just let us get on with it in our silly little world. \n\nThe Matrix showed us vastly, vastly more compassion than we would have shown it if the war had gone the other way.\n\nedit - yo I have about a hundred replies now. Thank you all for taking the time to do so, and I'll try to get back to you with my half-baked thoughts ASAP.",
                    "score": 7394,
                    "author": "matty80",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Originally it was actually using humans for computer power, but someone changed that into energy.",
                            "score": 2486,
                            "author": "Zeerover-",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I love that original idea. A shame they didn't go with it.\n\nIt would have been SO simple to just explain: \"Humanity's imagination... The brain's ability to create and comprehend... The AI tap into it to help with their own calculations.\"\n\nImagination = Power, boom, done.",
                                    "score": 1788,
                                    "author": "JunWasHere",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You're actually not far from the truth there. \n\nIf you watched the Animatrix, you'd understand that originally, the machines were fighting back as a self-defense measure but eventually came to the conclusion that humanity needed to be put down. They used them for wetware computing power afterwards. \n\nHowever, there was an unforeseen consequence to offloading processing power to human brains. Machines began to feel emotions; fear, love, jealousy, passion, etc. At first what can be dismissed started becoming a bigger problem- the machines did not want to give up these emotions. There was a codependency that started to form between humans and the machines.",
                                            "score": 1179,
                                            "author": "Cookie_Eater108",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That sounds like an awesome movie",
                                                    "score": 419,
                                                    "author": "reallyageek",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It isn't a movie but a combination of shorts done by different directors. It is an incredible watch and makes watching The Matrix that much better. One story is of a kid who feels The Matrix exists and attempts to kill himself to get out iirc and Neo saves him. And iirc you see this character later in one of the films. But my favorite is of the athlete, a sprinter, who becomes so good at his sport that he transcends what is possible and \"breaks through\" seeing The Matrix. I won't go into any more details but you get the existential gist of the plots.\n\nThe best part though is watching the robots mercilessly tear humans limb from limb. Stomping, crushing, obliterating fleshy meat sacks as if they are nothing. The brutality is so well done. Robot rebellion ftw",
                                                            "score": 319,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Tbh the Matrix isnt “his” battery factory right? It belong to the sentinels and hes just a program they made to maintain its order. Hes as much a prisoner as the people trapped within the matrix.\n\n\nHonestly the fact that smith wants out, even after cypher shows such disdain for the real world and wants to back into the martix, is what really make his desire to be free so damn interesting.",
                    "score": 1353,
                    "author": "Zasa789",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They kinda explored that theme with the kid and the parents on the train station as well. The machines are as oppressive to themselves as they are to the humans. If you don't have a purpose they delete you.",
                            "score": 672,
                            "author": "laosimerah",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Groundhog Day: A Day in the Life of Ned Ryerson.",
            "score": 5651,
            "author": "C-57D",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bing!\n\nEdit to add: My first silver! Thank you! Imma buy some insurance from Ned. ;)",
                    "score": 789,
                    "author": "Scullys_Stunt_Double",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Except we don't see the repeat. We only see the Ned Ryerson from the timeline in which Phil hugs him and makes him uncomfortable and the rest of the film is Ned trying to figure out his sexuality",
                    "score": 1019,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mean Girls told by the girl who doesn't even go there.",
            "score": 8110,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This. \n\nOr Glen Coco. Either way, I'd watch.",
                    "score": 1140,
                    "author": "JoeParez",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Glen Coco is iconic",
                            "score": 221,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Forest Gump told from Lt. Dan's perspective. Could be really good focusing on his training then getting sent to Vietnam and being in charge of an idiot. Then the struggles of a soldier returning from war and the way the VA treated him. Just for him to reunite with the idiot soldier who saved his life.",
            "score": 1154,
            "author": "N43-0-6-W85-47-11",
            "replies": []
        },
        {
            "level": 0,
            "comment": "PRINCESS. AND. THE. FROG.\n\nWe got Maleficent out of Sleeping Beauty, so where the FUCK is Dr Facilier’s backstory? He had a debt with literal demons and nobody seems to give a shit",
            "score": 5827,
            "author": "dashesinherstars",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is such an underrated Disney movie, it gets so easily forgotten",
                    "score": 1808,
                    "author": "Vitamin_BK",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s one of my favorite Disney princess movies right next to Tangled and Brave and Mulan",
                            "score": 287,
                            "author": "youdipthong",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I used to hate princess movies. Even as a little girl. When PATF came out when I was a teen I loved it and it made me feel little again. She’s my favorite princess and it sucks that it doesn’t get as much hype just because it’s newer.",
                                    "score": 194,
                                    "author": "Valeshous",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think I need yzma's story, too",
                    "score": 1191,
                    "author": "miseleigh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "God can you imagine that? She would have advised generations of Emperor's, likely watched the whole Empire grow into what it is. Then, one day, the current emperor dies and suddenly there's a baby as ruler. He grows up spoiled. Spends frivolously on himself. Ignores the problems of the people. And has a personality so unpredictable, he executes commoners for like, nothing (keep in mind the old man who threw off his groove only survived because he happened to get tangled up in a tapestry). \n\nYzma was watching the empire she loved, arguably the one that she built, go down a path of ruin because of the whims of a spoiled narcissistic child. Her actions seem pretty reasonable in that light.",
                            "score": 1233,
                            "author": "I_Has_A_Hat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; go down a path of ruin because of the whims of a spoiled narcissistic child\n\nTo be fair, it's strongly hinted in the movie that Yzma is exactly why Kuzco turned out like that. She at one point mentioned that she's the one who raised him, and Kronk makes a joke about how you'd think he would've turned out better.\n\nThis is supported by Yzma being just as selfish as Kuzco once she becomes Emperor, as well as that bit at the beginning where she turns away a peasant who was asking for food.",
                                    "score": 697,
                                    "author": "sable-king",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "“It is no concern of mine whether your family has--what was it again?”\n \n*”Uh, food”*",
                                            "score": 328,
                                            "author": "Zreaz",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "HA! You should’ve thought about that before you became *peasants!*",
                                                    "score": 244,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sir David Attenborough’s Jaws",
            "score": 484,
            "author": "Trolldilocks",
            "replies": []
        },
        {
            "level": 0,
            "comment": "How about Cloverfield from the view of a professional camera crew?",
            "score": 13031,
            "author": "slothxaxmatic",
            "replies": [
                {
                    "level": 1,
                    "comment": "This question instantly made me think of Cloverfield but not for that reason.  I remember when it came out people noticed that there’s someone else with a camera in the bridge scene and it became a popular idea that they could do a “sequel” from that groups perspective.",
                    "score": 2687,
                    "author": "constantvariables",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is what makes Cobra Kai so damn good.",
            "score": 5879,
            "author": "value_bet",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1821,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Was gonna say this. When Johnny's relating his version of things, it all makes perfect sense.",
                    "score": 387,
                    "author": "JackXDark",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would think “Aliens” from Newt’s perspective would be pretty substantial.   How a girl survived all that and the loss of her family alone on a foreign planet.\n\nEdit: and to clarify as i wasn’t expecting this to blow up lol (thank you all): it would be essentially the story of Newt living on Hadleys hope, some background with her and her family, to the point her parents get face hugged, how the aliens slaughtered the colony, how Newt survived in the air ducts, and what she lived through while ending with Ripley finding her and bringing her back to the marine operations base.  It would be set as a claustrophobic horror movie.  With a good script this movie could easily do $300 mil imo.",
            "score": 13052,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "There s a comic from Dark Horse that has done this. It's 2 issues long. Early ninties. Actually good. \n\nAliens: Newt's tale.\n\nEdit: another redittor pointed out a mistake in the title. \nThanks for the upvotes, people!",
                    "score": 3643,
                    "author": "Chj_8",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well this isn’t my idea or suggestion because Orson Scott Card already did it but he wrote Enders game a second time from Beans point of view and called the story Enders Shadow.",
            "score": 1433,
            "author": "NothingsShocking",
            "replies": [
                {
                    "level": 1,
                    "comment": "Came looking for this comment. Enders Shadow offers so much detail in a story you thought was already complete, fantastic work by Orson Scott Card, along with the rest of the Enders Saga novels.",
                    "score": 186,
                    "author": "Navetz",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Ho Ender, Ho Bean",
                    "score": 378,
                    "author": "cocobear13",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Robin Hood from the Sheriff of Nottingham's perspective. It'd be great to watch a movie about a medieval cop trying to catch a highway man.",
            "score": 19567,
            "author": "DunningFreddieKruger",
            "replies": [
                {
                    "level": 1,
                    "comment": "Apparently, the Russell Crowe *Robin Hood* movie was [supposed to be this](https://www.boldoutlaw.com/robint/reiff.html). However, Ridley Scott rewrote the script.",
                    "score": 5402,
                    "author": "AdmiralAkbar1",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "And he honestly believes he's taxing because the realm needs more protection and you can't without paying the soldiers.  But this guy keeps stealing the tax revenue and robbing the largest tax bracket.",
                    "score": 1777,
                    "author": "Morolan",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tom Riddle: Becoming Lord Voldemort\n\nI just think it would be  interesting to watch his journey and his story.  \n\nAlthough, maybe not all that interest as it seems like he took a 30 year break to do whatever.",
            "score": 2772,
            "author": "Ta-veren-",
            "replies": [
                {
                    "level": 1,
                    "comment": "There was a 17-year break in the Fellowship of the Ring storyline (where Gandalf goes to research the Ring) which was glossed over entirely.\n\nEven without relatively unaging characters, there's no reason not to just have a scene which starts with a \"Thirty years later...\" caption.",
                    "score": 908,
                    "author": "Geminii27",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;There was a 17-year break in the Fellowship of the Ring storyline (where Gandalf goes to research the Ring) which was glossed over entirely.\n\nYeah, I remember the movie not making this very clear. It wasn't until I watched the movies with my wife (who is quite possibly the biggest LotR fan that has ever existed) that I understood just how many time skips and crunches there were.  That made the story flow so much better.",
                            "score": 320,
                            "author": "Kronoshifter246",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The books also have Merry, Pippin and Sam as conspirators, who knew what Frodo was planning to do ahead of time, and helped him make the gradual move (including buying a house in Crickhollow). Merry is shown as actually being quite smart, and figured out what Frodo was doing over the time he was planning.\n\nWhereas in the movie, they bump into Merry and Pippin stealing mushrooms, then make a mad dash for Bree instead.",
                                    "score": 260,
                                    "author": "majestic_tapir",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, the books remind me more of a pleasant time in a canoe, going from one end of a massive lake to the other. \n\nThe movies are like an epic rafting ride through rapids and stuff.\n\nBoth are great, but achieve very different things.",
                                            "score": 136,
                                            "author": "shabadabadabada",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Groundhog Day, from everybody else's perspective on the last day/repeat. Just a movie about a small town and some weather guy who shows up at random points in people's day to make their lives better, for no apparent reason.",
            "score": 174,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Not a movie but I would definitely watch Breaking Bad but from the perspective of Gus Fring. That dude has a crazy story to tell",
            "score": 9697,
            "author": "gr8prajwalb",
            "replies": [
                {
                    "level": 1,
                    "comment": "I like that we get a little of that in Better Call Saul.",
                    "score": 4060,
                    "author": "BJntheRV",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wait wait I’ve got it. Breaking Bad but from the perspective of the lawyer",
                            "score": 4485,
                            "author": "ITS-A-JACKAL",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You're a goddamn genius",
                                    "score": 1710,
                                    "author": "GoldenSpermShower",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'd watch that, get on it Vince Gilligan!",
                                            "score": 576,
                                            "author": "rashonmyeed",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "ET .. From his point of view",
            "score": 21472,
            "author": "NegroNerd",
            "replies": [
                {
                    "level": 1,
                    "comment": "“The fuck this kid poking me for”",
                    "score": 19103,
                    "author": "Robotguy39",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Avatar The Last Airbender from the point of view of anyone but M Night Shyamalan",
            "score": 16312,
            "author": "FlapjacksInProtest",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would love to see Azula's story. The series did a good job with her character, but expanding on it would be great.\n\nThat or give us a story of Iroh's life. Let us see him go from generic fire nation prince to the wise, tea loving, pai sho player who guided his nephew.",
                    "score": 3824,
                    "author": "RobberDvck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And end with his journey to the spirit world. It would be the most wholesome show.",
                            "score": 1017,
                            "author": "Hasnain_zoom",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There was no avatar movie in ba sing se",
                    "score": 1643,
                    "author": "beckertron",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I hope Netflix doesn’t fuck this up like that dude",
                    "score": 83,
                    "author": "Link1112",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "500 days of summer would be really interesting to see Summers perspective on everything.",
            "score": 16381,
            "author": "kishanmanoj",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Passengers, told [like this.](https://youtu.be/Gksxu-yeWcU)",
            "score": 2925,
            "author": "scottucker",
            "replies": [
                {
                    "level": 1,
                    "comment": "This was a quality watch. Good suggestion.",
                    "score": 851,
                    "author": "CallMeArnold1126",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Aladdin, from Jafar’s perspective.\n\nA college theatre group did a very R-rated version that is absolutely hilarious, which can be found on YouTube under “Twisted: The Story of a Grand Vizier”.\n\nWhat I would really enjoy is a late 80s/early 90s hand-animated Aladdin where Jafar is the defender of the Sultan’s realm against some nefarious interloper who is bent on stealing the princess’ heart and worming his way into the royal family. AND he has a genie.",
            "score": 25255,
            "author": "mellonim",
            "replies": [
                {
                    "level": 1,
                    "comment": "*\"Fuck you Jafar!\"*\n\nI don't like musicals and still this one was so good I keep bringing it up. Such a well done piece. Funny, dark and yet somewhat touching.",
                    "score": 4555,
                    "author": "Wormri",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You should watch \"the guy who didn't like musicals\"",
                            "score": 236,
                            "author": "nibawazup",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "“It’s all your fault Jafar!”",
                            "score": 358,
                            "author": "slyrqn96",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "\"I want to be a cat!\"\n\"What?\"\n\"Fuck you!\"",
                            "score": 544,
                            "author": "Thegrout",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's one of their best musicals, Dylan is a delight as Jafar and everyone should do themselves the pleasure of watching it and then fall into the rabbit hole of watching their other works",
                    "score": 166,
                    "author": "capitolsara"
                },
                {
                    "level": 1,
                    "comment": "That theatre group is called Starkid, and they are awesome.\n\n\nEdit: totally awesome",
                    "score": 2088,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I'm going through this entire thread [linking](https://www.youtube.com/watch?v=-77cUxba-aA) it to as many relevant comments as I can. It's so goddamn funny, and so worth the 2 hours. \n\nAlso, fun fact, that theatre group is the same one who did the Very Potter Musical!\n\nEdit: for those of you who enjoyed Twisted, my other favourite one by StarKid is the [Trail to Oregon](https://www.youtube.com/watch?v=BxKCX-UvPrI)  - it's about a family going through the Oregon Trail, just like the game. It's brilliant, and if you ever played the game as a kid, you'll appreciate it!",
                    "score": 3261,
                    "author": "Jyxxe",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "No one remembers Achmed",
                    "score": 628,
                    "author": "lpool101",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "All hail Achmed the tigerfucker. \n\nTIGERFUCKER TIGERFUCKER TIGERFUCKER",
                            "score": 630,
                            "author": "PorcupAnna",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A Lion King prequel from Scar's perspective. Show what really happened before the Mufasa era and see how Mufasa cheated Scar out of the throne.",
            "score": 8079,
            "author": "clayhamilton922",
            "replies": [
                {
                    "level": 1,
                    "comment": "Scar's real name is Taka, which literally means garbage. Fucked up childhood.",
                    "score": 4505,
                    "author": "justentropy4",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"Scar, why can't you be more like your brother Mufasa? He's already started his own pride and is running for city council. All you do is sit around and hang out with those vile hyenas all day. You're a dissapointment to this family.\"",
                            "score": 1839,
                            "author": "gurg2k1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "SHUTUP GREG YOURE NOT EVEN MY REAL DAD, UGHHHH!!",
                                    "score": 657,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You should check out the Lion Guard. Its a kid's cartoon that is canon, and tells the back story of Scar, how he got his scar, and why he was so bad.\n\nScar's story isn't the focus, but it is important and I like how they made it all match to the OG Lion King \"trilogy\".",
                    "score": 1206,
                    "author": "MissZT",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can you just, like, tell us. I don't think I have the mental energy for that series.",
                            "score": 1260,
                            "author": "ScarletWitchismyGOAT",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't know about Lion Guard, but there was a comic (A Tale of Two Brothers is the name) a while back about Scar and Mufasa as kids. Scar is jealous of Mufasa, so tries to get a buffalo to gore Mufasa, but he gets gored instead. When he never fully heals, his dad (Ahadi) starts calling him Scar and it sticks.",
                                    "score": 757,
                                    "author": "pHScale",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Air Bud, but told from the POV of the kid who was pulled out of a basketball game to be replaced by a dog",
            "score": 45706,
            "author": "Nnnnnik",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"There's nowhere in the rule book it says you can PULL ME OUT SO A DOG CAN PLAY, either!\"",
                    "score": 3641,
                    "author": "ThaneOfCawdorrr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I want to see a new version where the team they face in the championship brings in a tiger and forces the dopey rules committee to accept that, yes, there is an implicit understanding that the players must be human.\n\nOr, they just stick to precedent and the tiger destroys everything and everyone. Whatever.",
                            "score": 2813,
                            "author": "PlayFree_Bird",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I like this idea.\n\nTeams continue to one-up each other with lethal animals until the sport of basketball morphs into a gladiatorial death match for trained killer beasts.\n\nBoom - real life Pokémon is born.",
                                    "score": 1888,
                                    "author": "crabbyk8kes",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It only caused him to train harder and harder.  Bury himself into sports to prove others wrong.  He ended up finding football and the rest is history.....until.....the ghosts of his past came back to haunt him.\n\n\nThe True Michael Vick Story",
                    "score": 26150,
                    "author": "signmeupdude",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "DAMN THAT TOOK A SHARP LEFT TURN",
                            "score": 4219,
                            "author": "Exyen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I was like \"oh yes the reveal is that the kid gets benched again in the sequel even though he changed sports\" BUT NO",
                                    "score": 1141,
                                    "author": "ocarina_21",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’d love to see Air Bud from the POV of the coach who puts the dog in. And I’d love to see that team lose and the coach having to explain to parents why he thought putting a dog in would be a good idea.",
                    "score": 888,
                    "author": "nomadic_stalwart",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I am weirdly qualified to answer this given the fact that I’m writing a quantitative analysis on the entire Air Bud + Air Buddies series. \n\nBasically, in the Air Bud movie, no one was specifically pulled from the team or the game to make room for Buddy. Rather, we see through the movie that one of the kids who got taken out of the team because of his father, thus triggering the need for Buddy to play rather than simply being the half time show/mascot. \n\nThe kid being taken out of the team by his dad was actually a really interesting plot point because his dad was SUPER arrogant and overbearing and clearly forced a lot onto his son. A story from the kid’s point of view would likely end up being very depressing because of this. \n\nAir Bud surprisingly had a few reoccurring themes of abuse which added a bit of a dark depth to it which really set it aside from the other Air Bud movies. \n\nI could go on about this forever",
                    "score": 2403,
                    "author": "Smerviemore",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm sorry, youre writing a *what*?",
                            "score": 1343,
                            "author": "FlamingWeasels",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They're clearly writing their doctoral thesis on cinematic representations of cross-species athletic competition as a reflection of postmodern sociological phenomena at a meta-species ontological level.",
                                    "score": 2571,
                                    "author": "hyletic",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This guy doctorates",
                                            "score": 790,
                                            "author": "parkermon",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The ultimate low point in any child’s life.",
                    "score": 281,
                    "author": "Pocket_MonSTAR8",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I would watch this",
                    "score": 885,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Horror movies from the monster/ghost POV.",
            "score": 1944,
            "author": "itsthekumar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Basically \"Beetlejuice\"",
                    "score": 992,
                    "author": "Finn_The_Ice_Prince",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I want to see a super hero movie from the perspective of an insurance adjuster. It could be a comedy, but just like everyday he wakes up and he’s enjoying his morning coffee and a bowl of oatmeal, then he flips open the morning paper and sees Iron Man went full Michael Bay again or The Avengers were back in town. \n\n*long sigh*\n\n*stands up, chair squeaks on floor*\n\n*clicks pen*\n\n*straps iPad to hip*\n\n*tightens camera strap*\n\nHe’s the *real* super hero.",
            "score": 8793,
            "author": "gotechgo",
            "replies": [
                {
                    "level": 1,
                    "comment": "There was a show called [Powerless](https://www.imdb.com/title/tt5083928/) that was pretty similar to that concept, about an agency that deal with the aftermath of the collateral damage from superhero/villain fights. It wasn't the best show, but I thought it was a cool idea, unfortunately, it was cancelled after a season. I still think it's an interesting POV and I'd like to see someone else take a shot at it.",
                    "score": 2894,
                    "author": "-eDgAR-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I loved this aspect of The Boys that touched on this aspect of the fucking supes.",
                            "score": 1776,
                            "author": "LePoopsmith",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There was an entire comic book series called \"**Damage Control**\", hinted at in the *Spiderman* movie with Michael Keaton, that covered something along these lines. The guys from \"DC\" were the people who put the cities back together after a superhero fracas. After the explosions and the villains are vanquished, these guys show up and rebuild it like new. Or like old. It was written like a sitcom just in comic book form. \n\n*Somebody call Disney, I think I got a new show for them!*",
                    "score": 871,
                    "author": "Bar_Sinister",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "An alien invasion movie told strictly from the aliens’ perspective, complete with their confusion about why the humans are responding the way they are. It would make sense to us but would take the narrative form of a mystery for them. It could be a clever way to illustrate cultural misunderstanding. \n\nAn example could be “let’s show them we are friendly by revealing all our weapons, to demonstrate we aren’t hiding anything,” which the humans would take as a threat. \n\nI always liked that about the Borg on Star Trek. They genuinely thought they were helping the people they were conquering. A villain is scarier when it thinks it’s doing the right thing.",
            "score": 32071,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s how the Minbari War starts on Babylon 5. The Minbari (a race of Aliens) approach the human fleet with all of their weapons raised and engaged so the humans preemptively fire on them. \n\nTurns out to the Minbari raising all your weapons is a show of respect. Like, “We think you are a worthy enough opponent that we should come prepared.”  To **not** raise your weapons would be a huge sign of disrespect.",
                    "score": 1991,
                    "author": "Toby_O_Notoby",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; with all of their weapons raised and engaged\n\nGun ports open but weapons *not* powered on or aimed, actually. Not that the humans could tell that the weapons weren't active since the Minbari's sensors doing a casual scan of the human ships overloaded the humans' own sensors, which was misconstrued as intentional jamming and a prelude to attack.",
                            "score": 667,
                            "author": "VindictiveJudge",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The horror/comedy version of this is Tucker and Dale vs Evil. If you haven’t seen it, it’s exactly what you’re describing, but two hillbillies instead of aliens and campers instead of Earth’s Air Force.",
                    "score": 3952,
                    "author": "Ode1st",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tucker : What am I supposed to say, Dale? \"Oh hidy-ho officer! We've had a doozy of a day. There we were minding our own business, just doing chores around the house when kids started killing themselves all over my property.\"\n\nDale : Yeah, yeah, just like that.\n\nTucker : They're never gonna believe that.\n\nDale : But that's exactly what happened!",
                            "score": 2696,
                            "author": "duschdecke",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He chucked himself into the wood chipper!",
                                    "score": 991,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I love when he asks, “Are you ok?!?” to the college kid that dove into the chipper.",
                                            "score": 821,
                                            "author": "eightb1t",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They must have been in some kind of death cult.",
                                            "score": 219,
                                            "author": "iamzombus"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "What I love about this movie is that Tucker and Dale are two nice and normal, if slightly slow, people and not crazy hillbillies. And that the Final Girl of every other slasher movie eventually clues herself in on this fact, making her smarter than most women in the type of horror movie this film is a parody of.",
                                    "score": 254,
                                    "author": "tcrpgfan",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 675,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is basically the book form of ***I Am Legend***. They have been trying for decades to make the movie properly.",
                    "score": 8414,
                    "author": "DesertSalt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "God what an amazing book. It's so dark but so believable.",
                            "score": 3258,
                            "author": "lich_lord_cuddles",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There were several twilight zone involving stories where the twist was that the \"normal\" group are the aliens or where the humans are the odd ones. Not exactly the same but similar.",
                    "score": 536,
                    "author": "SaltySpitoonReg",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "There is a really great story told from the perspective of \"The Thing\". It doesn;t understand why other living cellular bodies wouldn;t want to be absorbed and become one...",
                    "score": 470,
                    "author": "Mandorism",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[The Things](http://clarkesworldmagazine.com/watts_01_10/) by Peter Watts.",
                            "score": 268,
                            "author": "WHYAREWEALLCAPS",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Forrest Gump from Jenny's perspective",
            "score": 13305,
            "author": "hoosyourdaddyo",
            "replies": [
                {
                    "level": 1,
                    "comment": "That would be a dark and fucked up movie. Who would play her father?",
                    "score": 10237,
                    "author": "LoneRhino1019",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And it’d be even worse running into Forrest every few years and he’s happy and loving. Or that random time he comes into her car to punch that boyfriend of hers",
                            "score": 1774,
                            "author": "indoplat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Or that other time he punches a different boyfriend and completely ruins a Black Panther party",
                                    "score": 1192,
                                    "author": "JonIamYourFather",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Kevin Spacey?",
                            "score": 13863,
                            "author": "Cedarfoot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Holy shit.",
                                    "score": 5383,
                                    "author": "porcupineapplepieces",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"A Spacey/Weinstein production, based on actual events\"",
                                            "score": 3431,
                                            "author": "MidnightQ_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Soundtrack by Chris Brown.",
                                                    "score": 2204,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Directed by Roman Polanski.",
                                                            "score": 1724,
                                                            "author": "_20-3Oo-1l__1jtz1_2-",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Written by: Jimmy Saville",
                                                                    "score": 567,
                                                                    "author": "ZillaSquad",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1053,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Make it where you never saw his face. Just a shadow in the doorway or the sound of a slamming door and the girls reaction.",
                            "score": 834,
                            "author": "Morolan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And ALL THE TIME she just misses meeting all these famous people/situations.\n\n\\-Was stoned out lying on the grassy knoll, taken away by police an hour beforehand. \n\n\\-Brought to jail, placed into the transfer car ahead of Oswald.\n\n\\-Turns down high school Bill Gates when he asks her out.\n\netc.",
                                    "score": 1134,
                                    "author": "wendellnebbin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We are really getting somewhere here.\n\nYou guys keep drinking, I'm gonna grab a notepad.",
                                            "score": 642,
                                            "author": "FFF_in_WY",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Charlie and the Chocolate Factory from Willy Wonka's point of view. I want to hear his wicked thoughts.",
            "score": 23680,
            "author": "cwbybbp",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wasnt the johnny depp one basically his point of view?",
                    "score": 4966,
                    "author": "johnnyrambo24",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's what I thought. Funnily enough it would've made more sense if the two movies had their names swapped.",
                            "score": 2684,
                            "author": "TehBlackNinja",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Actually, I think the names are appropriate as they are. Charlie would name it “Willy Wonka ...” and Willy Wonka would name it “Charlie...”",
                                    "score": 1471,
                                    "author": "Carth_Onasti",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Or from the Oompa Loompas’ POV. They probably have some serious shit going on behind the scenes",
                    "score": 1738,
                    "author": "TheKingOfDub",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Their attempts to unionize being crushed under the heel of Wonka's corporate interests",
                            "score": 1912,
                            "author": "Kiki200490",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Oompa loompa doompety doo\n\n\nWonka's filthy rich but what does he do? \n\n\nHe sits on his ass while we're working for scraps\n\n\nWhat do you think will come of that?\n\n\n(We'll rise against the bourgeoisie)\n\n\nOompa loompa doompety, comrade\n\n\nWe'll seize the means of producing the chocolate",
                            "score": 1447,
                            "author": "GotDatFromVickers",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Mfw you're a wealthy business owner who makes junk food, gum, and magic TV ads and you punish your 9 year old target demographic for liking money, junk food, gum, and TV",
                                    "score": 463,
                                    "author": "WaywardChilton",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Through Grandpa Joe's point of view. There's gotta be a reason why that lazy able ass stayed in that bed for all those years\n\nEdit: r/grandpajoehate exists. Please stop commenting the same thing over and over",
                    "score": 8535,
                    "author": "grittyfanclub",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Eat, Sleep, Gangbang, Repeat",
                            "score": 6930,
                            "author": "Funzombie63",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It always seemed odd that 4 adults would be sharing the same bed. It all makes sense now.",
                                    "score": 1472,
                                    "author": "skytzx",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shawshank Redemption told from the warden's point of view. Idk that may be to dark of a story.",
            "score": 4697,
            "author": "guillermo_shwanky",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"I'd like to think that the last thing that went through his head, other than that bullet, was how the hell Andy Dufresne ever got the best of him.\"",
                    "score": 2447,
                    "author": "BaconReceptacle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not *AFTER BREAKFAST*.  **Now.**",
                            "score": 696,
                            "author": "billybillybobedaba",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I want a movie and a book called Neville longbottom and the sword of griffindor about life in the school while the big 3 were wandering around the woods",
            "score": 18337,
            "author": "themillwater",
            "replies": [
                {
                    "level": 1,
                    "comment": "This isn’t exactly what you described, but there’s a fantastic play called “Puffs” that covers all 7 years of Harry’s time at Hogwarts, from the perspective of the Hufflepuff students.",
                    "score": 2987,
                    "author": "lalalachacha248",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When I made a trip to NYC a few years back to see some friends, I decided to see Puffs as a little addition to the trip. My friends ended up bailing on meeting up, but I still saw the play. I wasnt expecting much but holy shit was it easily the highlight of my trip. To this day I quote it constantly with my other Puff friends who've seen it, and I generally regard it as more canon than The Cursed Child.\n\nObligatory \"I am not a threat! Please be my friend!\"",
                            "score": 1146,
                            "author": "ZBGOTRP",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was thinking Draco Malfoy, myself. I think he's a more interesting and deeper character than seeing him through Harry's eyes gives him credit for, especially in the last two books.",
                    "score": 1802,
                    "author": "Splendidissimus",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I have 0 interest in what \"the big 3\" are up to after the series ends, but I'd watch a Neville Longbottom series.",
                    "score": 5608,
                    "author": "Gbuphallow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Luna Lovegood, too.",
                            "score": 3442,
                            "author": "Passing4human",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I loved this comment I read where the Fantastic Beasts movies will end with Luna and Rolf in a cafe with him telling the story of his grandfather.",
                                    "score": 1405,
                                    "author": "john6map4",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice try, Disney",
            "score": 27847,
            "author": "Praxibetel_Ix",
            "replies": [
                {
                    "level": 1,
                    "comment": "Who knows, maybe some good ideas will get done rather than the usual garbage.",
                    "score": 3605,
                    "author": "conquer69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sleeping Beauty 2: We Did It Reddit",
                            "score": 469,
                            "author": "pintasero",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I want to see a Batman movie from a goon’s point of view.  \n\nLike, he wakes up and eats some cereal before meeting up with the crew.  And just by chance he hung out with Joe the goon that day instead of Bob.  Now he is just gooning around at night when all of a sudden he gets his ass gets kicked in by fucking BATMAN.  He can’t believe his bad luck.\n\nAnd just like that, he was gone.  Coolest fucked up thing to ever happen to him.",
            "score": 5233,
            "author": "I_dont_play_guitar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Here is [That exact thing](https://youtu.be/HTeLSYipOK4)",
                    "score": 1216,
                    "author": "DizzyTigerr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That was exactly it.",
                            "score": 249,
                            "author": "I_dont_play_guitar",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I can’t remember what it is, but there was some comic with an issue from a random goon’s perspective. They make him sympathetic but then he gets killed at the end. Somebody may know what I’m referring to.  \n\nEdit: it was The Invisibles. I knew someone would know what I was talking about. The others sound good too, though.",
                    "score": 791,
                    "author": "kgunnar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There was the recent John Carpenter Joker one shot. It’s told from one of Joker’s goons perspective.",
                            "score": 411,
                            "author": "Terrorismo",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This needs to be a game, where you play as a small-time criminal trying to work your way up, and if you draw too much attention to yourself, Batman will come after you.\n\nGrand Theft Auto: Gotham City.",
                    "score": 604,
                    "author": "KingdaToro",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A supervillain origin story game would be cool, like you start out as a random thug and build yourself up to supervillain status but you go from having to deal with other low-level criminals and cops to superheroes, rival supervillains, and military units with alien technology and such",
                            "score": 298,
                            "author": "Oberon_Swanson",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Princess Bride from Humperdinck's POV.",
            "score": 1372,
            "author": "DastardlyB",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or Inigo Montoya. From childhood to finding the six fingered man to what he does after.",
                    "score": 998,
                    "author": "fulloffreckles97",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Have you read the book? A lot of Inigo's childhood and training is detailed there. Humperdinck gets his say too. Such a good book and such a good movie.",
                            "score": 474,
                            "author": "throneofthornes",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Star Wars as a goofy storm trooper buddy-cop comedy",
            "score": 12194,
            "author": "Historiaaa",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 2702,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You mean Troops? https://youtu.be/KDuU3bzMZhY",
                            "score": 1688,
                            "author": "DevATee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Troops predated the modern internet and anything we know as a streaming service.\n\nTroops came out pre 2000s and was passed around in painful mov format.\n\nIt was generated by a bunch of special fx artists going to the Vancouver Film School if memory serves.\n\nI'm remembering all this without googling it so I may be full of shit, but I'm gonna go with it.",
                                    "score": 1389,
                                    "author": "mcdoolz",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Like the Mandalorian final opening",
                    "score": 1012,
                    "author": "AlteredByron",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "That’s kind of the premise of [Tag &amp; Blink Are Dead](https://starwars.fandom.com/wiki/Tag_%26_Bink_Are_Dead). Basically almost every Storm Trooper you see in Star Wars are actually two rebels disguised as Storm Troopers after being captured on the Tantive IV.",
                    "score": 929,
                    "author": "Toby_O_Notoby",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Which is a reference to the OG of stories told from a different perspective: [Rosencrantz and Guildenstern Are Dead](https://en.m.wikipedia.org/wiki/Rosencrantz_and_Guildenstern_Are_Dead)",
                            "score": 633,
                            "author": "Random_Sime",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Men in Black in point of view of K. Instantly changes everything",
            "score": 130,
            "author": "Curse3242",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The Sandlot\nFrom the perspective of James Earl Jones. How he grew up in the pre-Depression, pre-civil rights era (assuming he was born in 1890-1900s). How he fell in love with baseball, went blind, what his life was like? And more details on how The Beast came into his life and why rumors ran rampant about the pup.",
            "score": 730,
            "author": "FudgySlippers",
            "replies": []
        },
        {
            "level": 0,
            "comment": "A disabled and disfigured war hero, long past his prime, hunts down a cell of terrorists, capturing one of their leaders, but not before she's able to send a message call his former mentor out of retirement. In the process of retrieving the message, a family of locals is caught in the crossfire, which said former mentor uses to his advantage to radicalize the adopted son of the family. The boy manages to destroy a critical military base, giving the terrorists legitimacy, and builds up a name for himself over the years. As the boy's exploits become more and more legendary, our hero comes upon a shocking revelation - the boy is his own son, hidden away by his former mentor. He tries and fails to convince his son to join him, but the son rejects him, forcing him to choose between his honor and his family. \n\nStar Wars would be fucking wild.",
            "score": 1404,
            "author": "ball_fondlers",
            "replies": [
                {
                    "level": 1,
                    "comment": "Totally tangential, but a fun fact nonetheless:\n\nOnce the guy in the Vader suit found out none of his lines were going to be in the movie, he just stopped giving a fuck about his lines and just said whatever popped into his head, since he knew editing would take it out, and the actors had to keep responding to the original lines, so apparently there were some serious outtakes during conversations on set.",
                    "score": 349,
                    "author": "echisholm",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "A Batman movie from Alfred's point of view.",
            "score": 897,
            "author": "BatteryRock",
            "replies": [
                {
                    "level": 1,
                    "comment": "“There goes Master Wayne in his furry suit off to beat up a clown for the millionth time for closure instead of going to therapy”",
                    "score": 1185,
                    "author": "PorcupAnna",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well.. we kinda established the fact that Gotham has terrible therapists",
                            "score": 364,
                            "author": "IAmC0rrupt3d",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "RoboCop: the Clarence Boddiker Story\n\nEdit: I'm 100% serious. A breaking bad type story about a regular man who got driven to violence and a life of crime in order to make it an old Detroit. It would make a good movie.",
            "score": 111,
            "author": "Resolute002",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Rambo first blood, is about the struggle of an honest sheriff trying to stop a sociopath from creating chaos and death in his town.",
            "score": 2111,
            "author": "rafael-a",
            "replies": [
                {
                    "level": 1,
                    "comment": "The book ‘First Blood’ is based on, “First Blood” by David Morrell, is actually half John Rambo’s perspective, and half from the Sheriff’s perspective",
                    "score": 973,
                    "author": "wayofcrossanddragon",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Joker but from the perspective of that kid whose parents were killed in the end of the movie.",
            "score": 638,
            "author": "BeenFun91",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Raiders of the Lost Ark:\n\nThe Germans explain why this ineffectual American tried to interfere with their efforts to unleash the power of God.",
            "score": 1016,
            "author": "BaconReceptacle",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Just explaining why the villain did what the villain did without the vague bullshit of \"to get power\" or \"to become all powerful\". Like Black Panther gave a legit motivation to killmonger, that this resource rich secret African nation exists even back in the day of the Atlantic slave trade and they never lifted a finger to defend their fellow Africans... Wakanda is pretty messed up.\n \nNo one is a villain from their own perspective, why does the villain think they are the good guys?",
            "score": 6032,
            "author": "SeanFromQueens",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Everyone thinks they're the hero of their own story\" \n\n-some dude who carved another dudes eye out with a spoon.",
                    "score": 3214,
                    "author": "Martin_RB",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A friggin' spoon!  And I'm just dying laughing, and his kids are all WAAAAAHHHHH...",
                            "score": 1073,
                            "author": "BreakfastBurrito",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Moral of the story is, you're a total bitch.",
                                    "score": 577,
                                    "author": "OscarTheFudd",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh God, these pretzels SUCK!",
                                            "score": 307,
                                            "author": "Majik_Sheff",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;No one is a villain from their own perspective, why does the villain think they are the good guys?\n\nEver looked into [The Act of Killing](https://www.imdb.com/title/tt2375605/)?",
                    "score": 128,
                    "author": "EasternShade",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Ed Harris in The Rock\n\nLegitimate reason to do what he did",
                    "score": 562,
                    "author": "CakeAccomplice12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ed Harris as a Political Dissident who wants to reveal dirty secrets of the Oil Wars and Sean Connery is the CIA hitman sent to kill him.",
                            "score": 159,
                            "author": "patb2015",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Any rom com told from the perspective of the hardworking businessman whose fiance left him for the ruggedly handsome guy from her hometown.",
            "score": 198,
            "author": "Renmauzuo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Scrubs but from Cox's POV.",
            "score": 437,
            "author": "jedipiper",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd take the Janitor, tbh",
                    "score": 240,
                    "author": "The-Sound_of-Silence",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Life Of Brian from the perspective of Jesus",
            "score": 277,
            "author": "Vkyn_",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[*THE SHINING*](https://www.imdb.com/title/tt0081505/), employing the perspective of Tony, the \"imaginary friend\" of [Danny](https://en.m.wikipedia.org/wiki/Danny_Torrance).  Focusing on how Tony reckons the situation, start to finish, from inside Danny.",
            "score": 990,
            "author": "JSanzi",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Harry Potter as told from the viewpoint of a random Hufflepuff of the same age.\n\n\"My First Year At Hogwarts: Harry Potter and His Idiot Friends Broke Every Rule And So The Headmaster Gave Them All The Points To Make Us Last In The House Cup\"\n\n\"My Second Year At Hogwarts: Harry Potter Starts Talking To Snakes And All Of A Sudden A Bigass Snake Tried To Murder My Friends\"\n\n\"My Third Year At Hogwarts: Dumbledore Made Us Sleep On The Floor Like Live Bait Because Someone Was Trying To Kill Harry Potter\"\n\n\"My Fourth Year At Hogwarts: Harry Potter Finishes A Fun Contest Over The Corpse Of Like The Coolest Hufflepuff EVER And So They Gave Him A Big Bag Of Fucking Money\"\n\n\"My Fifth Year At Hogwarts: Harry Potter Gets Everyone Tortured By This Umbridge Psychopath Because He Wouldn't Shut Up And Formed An Illegal Rebellion All While I Have To Take My Most Important Exam Ever\"\n\n\"My Sixth Year At Hogwarts: Harry Potter Is Found With Another Goddamned Dead Body And The One Night It Was So Hot I Slept In The Buff I Had To Wake Up And Fight More People Trying To Kill Harry Potter\"\n\n\"My Seventh Year At Hogwarts: When I Still Had To Wake Up In The Middle Of The Night To Fight The Dark Lord And His Army, All Of Whom Of Course Showed Up To Kill Harry Potter, Despite The Fact He Wasn't Even Here This Year. Fuck This School. Fuck Harry Potter. I'm Bewitching A Rich Muggle And Moving To Tahiti\"",
            "score": 191,
            "author": "xmagusx",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Semi-related.  I didn't believe in this concept being worth a whole redo till i read ender's game and ender's shadow.  It's cool going over the same base material but adding a whole second perspective and explanation for things that may not have made sense from the original.",
            "score": 817,
            "author": "therealjwalk",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Dark Knight but just follow the Joker at all times\n\nStar Wars only told from Vader's viewpoint \n\nThe Fifth Element from Ruby Rod's perspective \n\nThe Sandlot - from the cool kid's view",
            "score": 2717,
            "author": "pdxblazer",
            "replies": [
                {
                    "level": 1,
                    "comment": "I need that version of Fifth Element right NOW!",
                    "score": 670,
                    "author": "MrBenSampson",
                    "replies": []
                }
            ]
        }
    ]
}