{
    "id": "m1iyga",
    "score": 99335,
    "title": "How would you feel if Reddit added a feature where you could still use your normal account, but then have an option to press a button on your account and post anonymously rather then creating a throwaway?",
    "author": "quakes19",
    "date": 1615331126.0,
    "url": "https://www.reddit.com/r/AskReddit/comments/m1iyga",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I wouldn't trust them with it.",
            "score": 39854,
            "author": "Beleynn",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, think of all the snarky advertising that would go on now that we can't pinpoint which users are making all those comments...",
                    "score": 10986,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Reddit Executives: \"Clever girl.\"",
                            "score": 4732,
                            "author": "Frumundahs4men",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you kind redditor!",
                                    "score": 1690,
                                    "author": "n1nj4_v5_p1r4t3",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 194,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Did you know that Ninjas make S tier pirates but pirates cant even rate as ninjas? I only bring this up because your name implies the vastly superior combination and I felt a kudos was necessary.",
                                            "score": 30,
                                            "author": "NinjaRage83",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "As long as the downvotes and reports pointed towards their actual account, would it matter? Can still downvote to oblivion and blow up inboxes with replies.  \n\nAs they post more and more incognito, and/or get downvoted in that mode, the tag could change from \"anonymous poster\" to \"cowardly shitstain\".",
                            "score": 2278,
                            "author": "Bogsnoticus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I like that compromise.",
                                    "score": 729,
                                    "author": "Fullyverified",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Okay then *cowardly shitstain*",
                                            "score": 589,
                                            "author": "SpadeHAZE",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There should be a gradient from cowardly poster to anonymous shitstain first.",
                                                    "score": 239,
                                                    "author": "GiantPurplePeopleEat",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Okay then *anonymous cowardly shitstain*",
                                                            "score": 124,
                                                            "author": "SpadeHAZE",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "No one would use the feature if it worked like that. To play devils advocate, what if it allowed people to express how they really feel, even if it’s a not very kosher thought, and get peoples actual opinions. Everyone has ideas that need to be bounced around, that how you find out if they are good or bad, and get feedback that helps you get different viewpoints, helps your perspective on said thing mature",
                                    "score": 306,
                                    "author": "PMmeimgoingtoscream",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "See that sounds good in theory, but it's not in practice. When people can't be associated with the things they say, they just use it to spew hate, not ideas. Nothing matures and instead it just it devolves into a cesspool of everyone trying to bring down everyone else.\n\nExamples: 4chan - Voat",
                                            "score": 455,
                                            "author": "Dexilles",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "But Reddit is already anonymous and you can already make a throwaway? The idea is just to make it less of a hassle to do.",
                                                    "score": 214,
                                                    "author": "HomingSnail",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I mean, with fingerprinting (and even just IP logging) they can make those associations anyway, but at least they have to work for it.",
                            "score": 118,
                            "author": "Penguinfernal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Reddit would know, but users don't have that same access to info, no?",
                                    "score": 50,
                                    "author": "DewmrikBot",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Right, though in theory the same could be said for this system if it were implemented that way.",
                                            "score": 21,
                                            "author": "Penguinfernal"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They already know your alts. I got into a heated argument with an admin years ago and he brought up my “numerous sock puppet accounts”. Problem is I had never used an alt account at that time. The accounts he accused me of using all belonged to co-workers. Our corporate network shows all outgoing traffic as coming from a single IP address. But that proved that they can link main accounts to alts.",
                    "score": 1138,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also cookies.  I'm sure many people creating throwaways don't at least clear their cookies first",
                            "score": 409,
                            "author": "mansdem",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep, this is what you’re signing up for when you click that “accept cookies” on those stupid banners sites have lately.",
                                    "score": 224,
                                    "author": "68696c6c",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They got some other stuff they're doing too. I've been suspended from reddit before and it was extremely difficult to create another account that wasn't flagged and suspended the next day.",
                                            "score": 84,
                                            "author": "zznf",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If you have enough data about a user’s behavior, you can recognize them anywhere. If you spend a lot of time on Reddit I’m sure they have when they need.",
                                                    "score": 60,
                                                    "author": "68696c6c",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Tell me more... 🤔",
                                                            "score": 17,
                                                            "author": "AL_12345",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "We use a fingerprinting system called Matomo for that and I don’t work with it so I’m afraid I don’t have more to tell you. I just develop the content production tools. But we collect an unbelievable amount of data and have data science, data analytics, and decision science teams that do a lot of work with that data. Exactly what, I’m not sure, but it’s somehow related to getting you to buy AT&amp;T, Comcast, and other shitty telecom shit.\n\nEdit:\n\nwhat I do know is that people can be recognized even with anonymous data. Anonymous data basically just means everything about your behavior and demographics that doesn’t actually identify you, so basically everything besides things like your name or confidential information like medical stuff. Marketers don’t care about identifying you, they care about trends in the data. For example, people of certain demographics or living in certain places are more likely to buy certain things. So that you can focus your marketing efforts on those more easily converted leads and waste less time bothering people who aren’t interested.\n\nThings like your IP address are part of that, like others have mentioned. But it’s more than that too. For web apps like Reddit, patterns in where and when and on which device you log in can be enough to recognize you, or at least make a confident guess. For a marketing site like the trash I work around in my job, they aren’t showing ads so identifying individuals is less relevant than the bigger picture of how people in general react to the site. Things like, visitors always call to buy after visiting this page, or visitors often visit this site before visiting that one, or how many pages on a site people visit etc. This data is used to optimize the marketing experience of the sites and to attribute conversions to different sources like certain ad campaigns or affiliates.",
                                                                    "score": 51,
                                                                    "author": "68696c6c",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Theoretically, couldn't that be subverted using a VPN?  Or arent there programs that can mask your IP address?  I'm not too much of an expert on that type of thing but I feel like I've heard that if you don't want to be traced, you can make it pretty fucking hard.",
                            "score": 90,
                            "author": "finallyinfinite",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, but that requires explicitly logging out of your primary, clearing cookies, connecting to the VPN, logging into your alt, posting, logging out, clearing cookies, disconnecting the VPN, logging back into your main, and *never looking* at your alt's post thereafter (without doing the same things). Skipping any one of those steps even once would provide at least a strong correlating signal between those two accounts.\n\nBetter to use a browser like Brave, which has a \"Private window with Tor\" option which does basically all of this in one step.",
                                    "score": 195,
                                    "author": "archbish99",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "A step more overkill on the infrastructure, but a VM would also be a decent solution.  The VM can stay happily logged in to the alt and on VPN, while the host system does its own thing.\n\nThis has the side benefit of providing the human with a context-switch -- you can intentionally choose a different desktop UI to help remind you where you are.",
                                            "score": 87,
                                            "author": "zebediah49",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I can dig this.",
                                                    "score": 19,
                                                    "author": "0xFFFF_FFFF"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Brave leaks tor dns requests",
                                            "score": 32,
                                            "author": "Catlover790",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "First, present tense isn't warranted here. They had a bug, which had already been fixed in nightly when it was found by someone else. Once it was announced, the fix was pushed broadly.\n\nSecond, Reddit isn't a .onion domain anyway, so it doesn't really matter for this specific discussion. (Though a browser's general stance on security is definitely worth considering.)\n\nWhich kind of highlights the point of just how easy it is for this to break. Not only does the user have to do everything perfectly, there have to not be any active bugs that screw up their perfect actions.",
                                                    "score": 10,
                                                    "author": "archbish99"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Even in this case, browser profiling can deanonymize you.  Use a completely different browser for this exercise.",
                                            "score": 23,
                                            "author": "AOCMarryMe",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Admins can trace IPs, mods cannot.",
                            "score": 67,
                            "author": "YodasChick-O-Stick"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I wouldn't trust ME with it. Forget to toggle it one time and you out yourself. I'd rather it be per post.",
                    "score": 240,
                    "author": "ihwip",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As a gay black man, I have to agree with you",
                            "score": 229,
                            "author": "Nonconformists",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, as buggy as reddit can be I wouldn't want to trust it to post something like a personal advice post using the anonymous mode and then some glitch happens and all of a sudden everyone can see my account.",
                    "score": 557,
                    "author": "Sententia1309",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wouldn't be worried about a glitch. But if your anonomous post is connected with your main username with nothing but a digitally toggled veil then someone somewhere can get past it.",
                            "score": 306,
                            "author": "Iheardthatjokebefore",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; digitally toggled veil\n\nI like these words.",
                                    "score": 161,
                                    "author": "Sharingtheplanet",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Really is some \"brand new sentence\" material.",
                                            "score": 37,
                                            "author": "Officer_Warr"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I’ll be honest, I don’t think this is what “I don’t trust” Reddit meant. :)",
                            "score": 66,
                            "author": "macgart",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I wouldn't trust anyone with it.",
                    "score": 62,
                    "author": "joe_mamasaurus"
                },
                {
                    "level": 1,
                    "comment": "They’d sell that shit straight to the highest bidder.  Probably the rest of the bidders too",
                    "score": 76,
                    "author": "Mr-Penderson",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It would be like the times Facebook \"accidentally\" changed everyone's privacy settings. Because you know, we really wanted personal stuff only visible to a small group open to everyone, including our abusive parents.",
                    "score": 115,
                    "author": "mycatisamonsterbaby",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "My first thought as well, but since Reddit already tracks users by IP and other metrics throwaways aren't as anonymous as people assume.",
                    "score": 64,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Took me too long to find this comment. Needs to be higher",
                            "score": 11,
                            "author": "Tim_Buckrue"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": " And you shouldn't. Reddit admins have been skeevy at just about every time I've ever observed them. When the admins come out to play and/or post its never because something GOOD has happened.",
                    "score": 66,
                    "author": "King_of_AFK_",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Even with an anonymous account, I, as a gay black man, feel the need to sprinkle fake facts about myself.",
                    "score": 44,
                    "author": "BackIn2019"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awful idea. People would reply to their own comments to set up jokes for karma.  \n  \nEdit: Woke up to some very serious and aggressive responses. [You missed the joke.](https://www.reddit.com/r/AskReddit/comments/m1iyga/how_would_you_feel_if_reddit_added_a_feature/gqegl7v/?context=3)",
            "score": 13886,
            "author": "Zeruvi",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol yeah good point dude",
                    "score": 4435,
                    "author": "Zeruvi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks man",
                            "score": 3851,
                            "author": "Zeruvi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No problem",
                                    "score": 473,
                                    "author": "archiminos",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "r/notopbutok",
                                            "score": 198,
                                            "author": "xPS13x",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm sorry. Won't happen again.",
                                                    "score": 124,
                                                    "author": "EwoDarkWolf"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Lmfao",
                                    "score": 14,
                                    "author": "C0II1n"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Was hoping for this and not disappointed",
                            "score": 261,
                            "author": "WhenwasyourlastBM",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just wanna say to you and anyone else whose immediate thought was \"this guy replied to himself, didn't he\" - you're my kind of people. Always looking for the gag",
                                    "score": 215,
                                    "author": "Zeruvi",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Reminds me of when [the presidential candidate in Kenya debated himself after his opponents boycotted the debate.](https://www.reddit.com/r/nottheonion/comments/6oum2k/comment/dkkhoac)",
                                            "score": 27,
                                            "author": "TitaniumDragon",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is what is wrong with reddit. u/zeruvi comes in with an excellent point and rightfully gets up votes, but then u/ zeruvi comes in and makes no meaningful contribution, but because they commented on a popular thread they get plenty of karma. Dude at least give credit to zeruvi for this success.",
                            "score": 144,
                            "author": "tjdavids",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Looks like we’re back in business.",
                    "score": 3623,
                    "author": "potatoeslinky",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I really wanted this to be OP replying to himself",
                            "score": 2829,
                            "author": "billgates1v1me",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Everyone on the internet is OP except you.",
                                    "score": 2063,
                                    "author": "alasassin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Fuuuuuck",
                                            "score": 586,
                                            "author": "0nlyhalfjewish",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Wait until you find out about tungsten",
                                                    "score": 167,
                                                    "author": "arcaneresistance",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh yeah? Wait till you see *internet tungsten*...",
                                                            "score": 7,
                                                            "author": "1701Person"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Whoops, I shouldn't have told you that",
                                            "score": 92,
                                            "author": "Kenley",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "In retrospect I feel a little dumb.",
                                                    "score": 44,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Is that you, Unidan?",
                            "score": 95,
                            "author": "AmethystZhou",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Here's the thing",
                                    "score": 45,
                                    "author": "worstsupervillanever",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thanks for a new strategy.",
                    "score": 101,
                    "author": "PurpleHawk222",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not really a new strategy and it could actually get you banned. It happened to a Reddit-famous scientist who was propping up his comments and then got his account banned. \n\nThe fallout was so bad that it seemed to kill off the concept of someone trying to be Reddit famous, which honestly, is probably a good thing.",
                            "score": 162,
                            "author": "Roller_ball",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Unidan?",
                                    "score": 72,
                                    "author": "ZeAltHealthAcct",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah.",
                                            "score": 31,
                                            "author": "Roller_ball"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "See, the thing about jackdaws...",
                                            "score": 29,
                                            "author": "TheOtherSarah",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I was being sarcastic but really? He got banned for that? What rule prohibits people from doing that?",
                                    "score": 11,
                                    "author": "PurpleHawk222",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "To be fair, it was less about 'setting up his own jokes' and more about 'wide-scale vote manipulation'...",
                                            "score": 36,
                                            "author": "FrigidFlames",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ah that makes more sense.",
                                                    "score": 7,
                                                    "author": "PurpleHawk222"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "To be fairer, most of the \"small business owners that started on reddit\" engaged in similar techniques. Upvotes get eyeballs on posts and comments, especially with how snowbally reddit is about early engagement traction.",
                                                    "score": 7,
                                                    "author": "comradecosmetics"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "People do this all the time. How boring their life are lol",
                    "score": 107,
                    "author": "bruh_bot_69420",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ikr? Take my free award here &lt;3",
                            "score": 98,
                            "author": "bruh_bot_69420"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I feel like they'd do it just for Updog",
                    "score": 14,
                    "author": "Beardygrandma",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What's updog?",
                            "score": 11,
                            "author": "Asmo___deus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nothing much, what's up with you dawg?",
                                    "score": 7,
                                    "author": "Beardygrandma",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Would tjat really happen?",
                    "score": 76,
                    "author": "Delliott90",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Of course it would. And your spelling is shit",
                            "score": 101,
                            "author": "Delliott90",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No your spelling is shit",
                                    "score": 79,
                                    "author": "Delliott90",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Your momma",
                                            "score": 73,
                                            "author": "Delliott90",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Dude you know how cringy you’re being?",
                                                    "score": 58,
                                                    "author": "Delliott90",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It’s reddit. Like he cares",
                                                            "score": 73,
                                                            "author": "Delliott90"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "4chan already exists",
            "score": 4762,
            "author": "dralcax",
            "replies": [
                {
                    "level": 1,
                    "comment": "yeah this is just 4chan with extra steps",
                    "score": 1552,
                    "author": "jordanManfrey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "LA DE DA...  someone’s gonna get laid in college",
                            "score": 358,
                            "author": "RiddleADayKpsBtmnAwy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's a pretty fucked up ooh la la right there.",
                                    "score": 132,
                                    "author": "Zep416"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "But this is already 4chan with extra steps. That would save us a few of those extra steps.",
                            "score": 9,
                            "author": "jml011"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This. Want anonymity? Go somewhere else. This place already has enough anonymous hate as it is.",
                    "score": 256,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "God, it would be terrible. Imagine how many trolls would be trolls if they weren't too lazy to make an account for their trolling.",
            "score": 16787,
            "author": "bowyer-betty",
            "replies": [
                {
                    "level": 1,
                    "comment": "Real trolls do so openly, with their main account!",
                    "score": 5076,
                    "author": "SpaceDave83",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Speaking of openly, I trolled your mom in her main account last night.",
                            "score": 4485,
                            "author": "-SHORSEY-",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Give yer balls a tug.",
                                    "score": 884,
                                    "author": "AlbumGuide",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You tit fucker!",
                                            "score": 376,
                                            "author": "Welliguesswewillsee",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Fuck you Shoresy!",
                                            "score": 59,
                                            "author": "Work-Safe-Reddit4450",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; So I tell the swamp donkey to sock it before I give her a trunky in the tradesman's entrance and have her lick me yarbles[!](https://youtu.be/rj4wjFcyaxE)",
                                            "score": 26,
                                            "author": "ISLITASHEET",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Fuck you Shoresy",
                                    "score": 506,
                                    "author": "rik1122",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Fuck you rik1122! Your mom moaned so much last night I thought she was Megan Markle talking to Oprah about the Queen. I’m not Prince Harry but last night at your mom’s I was the sixth in line",
                                            "score": 1393,
                                            "author": "-SHORSEY-",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "#FUCK YOU SHORESY",
                                                    "score": 563,
                                                    "author": "rik1122",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Fuck you rik1122! I want to support the calls for a $15 minimum wage but I don’t know if I could afford to pay your mom that much.",
                                                            "score": 818,
                                                            "author": "-SHORSEY-",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "This is God's work being fulfilled through you",
                                                                    "score": 185,
                                                                    "author": "EDrone29",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I feel a tad sorry for those who don't know Letterkenny",
                                                                            "score": 61,
                                                                            "author": "XAMOTA",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Damn! My man's going off lmaooo!",
                                                                    "score": 47,
                                                                    "author": "horizo3902"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "And obviously you have to read this like shorsey and it's way funnier",
                                                                    "score": 32,
                                                                    "author": "faultierr"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "This is fucking hilarious lmao",
                                                                    "score": 36,
                                                                    "author": "Cynikal818"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I mean, that *is* an hourly wage. We both know you'd wouldn't be on the hook for anything more than $15, and that's because of minimum rates lol",
                                                                    "score": 48,
                                                                    "author": "[deleted]"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Fuck you Shoresy!",
                                                                    "score": 8,
                                                                    "author": "[deleted]"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Jesus fucking Christ I found the only Reddit account I need to follow",
                                                    "score": 35,
                                                    "author": "Naevos"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Okay, that sixth in line comment was hilarious!",
                                                    "score": 27,
                                                    "author": "HydeNSikh"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 51,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "This is my favourite comment of all time",
                                                    "score": 60,
                                                    "author": "adynm8"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "He gets awards for talking smack like that? Dang! I've been doing it all wrong. I know he's gonna rip me a new one, but damn.",
                                                    "score": 11,
                                                    "author": "Beginning-Ad-9734",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes, my Mom told me she had a lovely chat with some young man about decorating with lavender chiffon",
                                    "score": 18,
                                    "author": "SpaceDave83"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Imagine how fewer 'active accounts' reddit could claim to have while speaking to advertisers if people didn't have to make alts",
                    "score": 301,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Great point.",
                            "score": 55,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "It’s not 1995; advertisers are hip to “unique users”.",
                            "score": 37,
                            "author": "davidestroy",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "But what if reports and bans still went to the account, just your name won't popup on anonymous posts but you also didn't get karma",
                    "score": 161,
                    "author": "MyDiary141",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is actually strikes an interesting balance and could kind of work. I think the anonymous posts should still have karma scores, but they aren't kept track of and they don't go to your account. Shadow Karma.",
                            "score": 116,
                            "author": "microwavepetcarrier",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; Imagine\n\nNo need to imagine, just go to 4chan.",
                    "score": 59,
                    "author": "aaaaaaha",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Pretty much.\n\nThis isn't 4chan, and people need to accept that.\n\nPart of what makes Reddit, Reddit, is the username / karma / public post history combination.\n\nGet rid of that, and make comment chains full of \"Anonymous\" responding to \"Anonymous\", and it's not Reddit anymore.",
                    "score": 136,
                    "author": "Halaku",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would fucking love a version of Reddit without karma but with all the other features that make it not 4chan, though.",
                            "score": 38,
                            "author": "PM_ME_YOUR_PIZZAPIC",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Only if banning the anonymous account bans the main account as well.",
            "score": 1789,
            "author": "ShepardRTC",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mods should be able to see a list of banned accounts, yeah? I'm no mod so I wouldn't know.",
                    "score": 200,
                    "author": "Officer_Warr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes subreddit mods can see the banneduser list",
                            "score": 55,
                            "author": "Dibs_on_Mario"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Exactly",
                    "score": 81,
                    "author": "Vocadofries"
                }
            ]
        },
        {
            "level": 0,
            "comment": "sounds like a magnet for trolls and harassment. otherwise cool.",
            "score": 5018,
            "author": "adelinaxe",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just make it so if you ban or block an \"anonymous\" post you actually ban or block the account itself.",
                    "score": 454,
                    "author": "EatTheBeez",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then it wouldn't be anonymous.",
                            "score": 119,
                            "author": "inspectoroverthemine",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It would for the viewer.",
                                    "score": 145,
                                    "author": "LucasRuby",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 765,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So completely negate the point of it?",
                            "score": 614,
                            "author": "APr0N00b",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ehhhhh I feel like if I’m making a post on relationshipadvice, I don’t want that being attached to my main account because I don’t want people seeing it on my page, but I also wouldn’t care if some mod knows I made the post.",
                                    "score": 376,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But what if I'm in a relationship with one of the mods?",
                                            "score": 203,
                                            "author": "TroubadourRL",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If that's the case it sounds like you have some greater life issues to work out",
                                                    "score": 296,
                                                    "author": "TimBroth",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Then make a throwaway",
                                                    "score": 55,
                                                    "author": "Vaan0",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "We've come full circle",
                                                            "score": 32,
                                                            "author": "bearmissile",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "But what if we had this feature to just go anonymous?",
                                                                    "score": 12,
                                                                    "author": "TroubadourRL"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I wouldn’t say they can see. Just that they can ban the throwaway and that would also ban the user’s main.",
                            "score": 114,
                            "author": "LandBaron1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And/or restrict their subs from allowing anonymous posting at all",
                                    "score": 26,
                                    "author": "fukitol-",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "oh, that’s a good idea. i didn’t think of it. isn’t it a lot of work for the mods and admins though?",
                            "score": 166,
                            "author": "adelinaxe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Trusting the mods, who do it for free? That's a bold strategy Cotton, let's see if it pays off.",
                                    "score": 20,
                                    "author": "metalbassist33",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 127,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "seems like it would just defeat the point. For really unpopular posts people could convince the mods to dox the poster.",
                                    "score": 60,
                                    "author": "zutari",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I assume that since it kinda counts as doxxing, it's not allowed on most subs anyway",
                                            "score": 29,
                                            "author": "FilthyRyzeMain",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah. Probably shouldn't be a mod if you easily dox someone.",
                                                    "score": 29,
                                                    "author": "Number__Nine",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah, but I'm sure there's plenty of shitty mods out there.",
                                                            "score": 16,
                                                            "author": "temalyen",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great idea! 4chan with even worse degenerates!",
            "score": 534,
            "author": "dummemaybe",
            "replies": [
                {
                    "level": 1,
                    "comment": "hey, you're talking about us!\n\nwait, you're talking about us...",
                    "score": 149,
                    "author": "Hi_Its_Matt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh shit. Hello fellow Matt.",
                            "score": 55,
                            "author": "TheMattMobile",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey Matt, what’s up",
                                    "score": 39,
                                    "author": "Hi_Its_Matt",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel we’d see a lot more awful comments. \n\nCall me a pessimist but I believe lots of people would say very shitty things if they were anonymous and didn’t fear repercussions",
            "score": 1059,
            "author": "Homeless_Alex",
            "replies": [
                {
                    "level": 1,
                    "comment": "...?\n\nThat already happens. Reddit is pseudonymous, which is enough to effectively be anonymous.",
                    "score": 403,
                    "author": "thesituation531",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The thing is, with the accounts showing the history of what you've posted, it is possible to see what user has been posting all these hateful/illegal/etc posts, and what they've been posting before. But with anonymous comments??",
                            "score": 211,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Would the anonymous account be able to be linked to the regular account by admins if there are harassment reports?",
            "score": 151,
            "author": "WineAndDogs2020",
            "replies": [
                {
                    "level": 1,
                    "comment": "For sure. There’s no way the platform would allow total unlogged anonymity. Event throwaway accounts are tied to something no matter how much a dead-end it would be.",
                    "score": 65,
                    "author": "potatoeslinky",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "The negative side effects would completely overwhelm anything positive. Creating a throwaway isn't that difficult and it's already abused enough. Now you're suggesting an easier way???",
            "score": 25,
            "author": "badhershey"
        },
        {
            "level": 0,
            "comment": "Nah, I just post all my nudes and random thoughts all on one account. I play a dangerous game",
            "score": 1110,
            "author": "SesameSeedBum",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ballsy. Literally.",
                    "score": 452,
                    "author": "Allegedlysteve",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lord knows I didn’t ask for’em ¯\\_(ツ)_/¯",
                            "score": 328,
                            "author": "SesameSeedBum",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "i could use an extra pair",
                                    "score": 70,
                                    "author": "Hyperiotic",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "four testicles can only hold so much pee, why not ask for three pairs while you're at it?",
                                            "score": 63,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You dropped this \\",
                                    "score": 31,
                                    "author": "idontknow2976",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not what I expected when I read that word. *sad gay noises*",
                            "score": 31,
                            "author": "WhereIsMyCuddlyBear"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "eh, nudes aren't as bad as Minecraft porn.\n\n(no, I'm not kidding)",
                    "score": 93,
                    "author": "FantasticCrab3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I respect your self-awareness.",
                            "score": 48,
                            "author": "Bristonian"
                        },
                        {
                            "level": 2,
                            "comment": "Gotta say, not the worst.",
                            "score": 24,
                            "author": "TakeShitsMuch",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Holy shit. I thought you were joking. Good for you.",
                    "score": 23,
                    "author": "darthspacecakes"
                },
                {
                    "level": 1,
                    "comment": "Nice",
                    "score": 14,
                    "author": "Zenabel"
                },
                {
                    "level": 1,
                    "comment": "Nice nudes yo",
                    "score": 26,
                    "author": "schapman22",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Hot.",
                    "score": 10,
                    "author": "Eskimoobob"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are people stupid enough to post \"throw away\" opinions on something linked to their main account.\n\nThis is how you get ads for furry sex dolls when you log in to linkedin.",
            "score": 163,
            "author": "zobd",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'd NEVER trust reddit on that.",
            "score": 61,
            "author": "Inevitable_Body_18",
            "replies": [
                {
                    "level": 1,
                    "comment": "You really shouldn't ever trust reddit as it is. Remember what's upvoted is popular opinion, not necessarily facts and good info.",
                    "score": 21,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "So... Tumblr asks?",
            "score": 80,
            "author": "quietfangirl",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Couldn't someone just reverse the effect of that button and out you?",
            "score": 10,
            "author": "TopScruffy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or when you share your edgy opinion and forget to hit incognito switch...",
                    "score": 8,
                    "author": "UncleIye",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You mean when you share your nudes and forget to hit incognito switch!\n\nAnd then you go to sleep, not noticing what you have done\n\nYou wake up the next morning hearing the voices of literally every relative, friend, colleague, classmate, etc you have at your door, informing you about your new status as an internet sensation.",
                            "score": 6,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How would you feel about the mods of this sub banning these types of shitty Reddit suggestion questions that aren’t really questions?",
            "score": 146,
            "author": "epicbigc13579",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lmao, some idiot gave the post a platinum. That's one way to throw $5.99 down the drain.",
                    "score": 50,
                    "author": "DeathSpiral321",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That costs real money? Like you could eat a meal for that amount",
                            "score": 7,
                            "author": "semitones"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would really like that. My account isn't exactly the most ambiguous, it wouldn't be hard for somebody who knows me to spot that this is me, in fact I'd be surprised if they didn't, so I often pass up on talking about more sensitive things because I don't want that being shared with everybody I know potentially and I don't want to go through the trouble of making a throwaway.",
            "score": 184,
            "author": "ParkityParkPark",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've thought this as well. If someone was that interested, not only would they know it's me, they'd know some other shit I don't necessarily want generally known.",
                    "score": 45,
                    "author": "Eternal_Nymph",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Reddit is kinda like walking around a busy city where nobody knows your name but you could try to interact with them in passing.\n\nFacebook is like a house party where you know or kind of know people or could find friends of friends etc.\n\nAnd Twitter is shouting out loud on top a building. Some people might hear you but you’ll be mostly ignored. Unless you’re really pulling people in with something crazy or something they’re in to.",
                    "score": 33,
                    "author": "potatoeslinky",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Like I was on Slashdot.",
            "score": 22,
            "author": "EveningPassenger",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wanna be AC again!!\n\n\nAnonymous Coward",
                    "score": 11,
                    "author": "mabhatter",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "So like quora",
            "score": 11,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Redditors would love it, but modds would hate it.  It would make cancelling users much harder.",
            "score": 152,
            "author": "PanzerDoggo14",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mods need to be regulated now more than the subs they mod anyway. I got banned from an art sub for saying that white pencil on black paper is a viable option.",
                    "score": 124,
                    "author": "the_gamer47",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You monster",
                            "score": 59,
                            "author": "Number__Nine",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "*heathen*",
                            "score": 17,
                            "author": "PraiseThePumpkins"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 16,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ahhh when atheism has more arbitrary rules than religion. Oh how the turntables!",
                                    "score": 15,
                                    "author": "sqb987"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I believe the correct term is \"paper of colour\"",
                            "score": 47,
                            "author": "PanzerDoggo14",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh shit thank you. I went through this entire day without laughing. Appreciate it man.",
                                    "score": 9,
                                    "author": "darthspacecakes"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}