{
    "id": "105by7z",
    "score": 6,
    "title": "What's your lowest grade at BYU?",
    "author": "Roughneck16",
    "date": 1673054915.0,
    "url": "https://www.reddit.com/r/byu/comments/105by7z",
    "media_urls": [],
    "other_urls": [],
    "postText": "In the civil engineering program, you can get a D in Math 303 and still get credit for it...so long as you don't get any more Ds.",
    "comments": [
        {
            "level": 0,
            "comment": "I'm also in civil engineering! I believe now you can have up to 9 credits of D's.",
            "score": 13,
            "author": "Main_Community2649"
        },
        {
            "level": 0,
            "comment": "You tell me which is lowest: E, W or UW.\n\nThere were some rough times in there, and sometimes I look back and wonder how I managed to actually graduate. (Do they still give out all those letters anymore?)",
            "score": 8,
            "author": "TomPastey",
            "replies": [
                {
                    "level": 1,
                    "comment": "UW is painful…I got one for being an idiot. Final exam was worth very little and I knew I would bomb it. 0% on final exam and I walk out with a C, 100% on final and I get a B. I no showed the final exam thinking I’d get a 0%. Nope. UW.",
                    "score": 3,
                    "author": "CJHoss"
                },
                {
                    "level": 1,
                    "comment": "What are E and UW? I have tons of Ws though. Is E incomplete? I've had a couple of those too. College has been a roller coaster for my mental health.",
                    "score": 1,
                    "author": "DontbegayinIndiana",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Back in the day 'E' was the equivalent of an F. BYU didn't give out Fs, it just went A, B, C, D, E. And UW stood for \"unofficial withdrawal\" which is when you get when half way through the semester you just stop going to a class and never tell anyone about it. (I had a few rough semesters.)\n\nI graduated in 2006, so things may have changed considerably since then.",
                            "score": 6,
                            "author": "TomPastey",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I may or may not be able to confirm that E is still used instead of F \n\nLet’s say I know a guy really well who got an E",
                                    "score": 6,
                                    "author": "00roku"
                                },
                                {
                                    "level": 3,
                                    "comment": "BYU still uses “E” instead of an F (which makes more sense to me, personally)",
                                    "score": 2,
                                    "author": "kwallet"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "D in CHEM105. Worst class I’ve ever taken at BYU. If you did fine in that class then I’m happy for you but that semester was miserable for me and that class was 90% of the misery. Call me stupid but that class was impossibly hard.",
            "score": 4,
            "author": "FailingMyBest",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah, yes the go-to weeder class for science and engineering. It stops freshmen dead in their tracks.",
                    "score": 1,
                    "author": "Roughneck16"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I graduated about a decade ago and then finished my masters last year (elsewhere) D- in calculus my freshman year. Had to retake it as a sophomore and get at least a B+ for my major (to average a C). Luckily, my time management and maturity have dramatically improved vs when I was 18-19.",
            "score": 3,
            "author": "el_guapisimo33"
        },
        {
            "level": 0,
            "comment": "W in ME 250",
            "score": 1,
            "author": "wabrahamgoshington"
        },
        {
            "level": 0,
            "comment": "Did any of you in the civil engineering program have professor Kevin Franke? Is he still teaching?",
            "score": 1,
            "author": "thebachelorbeast",
            "replies": [
                {
                    "level": 1,
                    "comment": "Never had him for a class, but I know of him. \n\nWhy?",
                    "score": 2,
                    "author": "Roughneck16",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He got so bad reviews on «rate my professor» from what looks to be only because of his YouTube channel, and not because of his work. So I was just wondering how he actually is as a professor ☺️",
                            "score": 1,
                            "author": "thebachelorbeast",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; because of his YouTube channel,\n\nI searched it. \n\nTIL!",
                                    "score": 2,
                                    "author": "Roughneck16",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s a big mess now 🫣 and I feel bad for him. Hope he is ok.",
                                            "score": 1,
                                            "author": "thebachelorbeast",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Why is it a mess? 🤨",
                                                    "score": 1,
                                                    "author": "Roughneck16",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I will message you.",
                                                            "score": 1,
                                                            "author": "thebachelorbeast"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I graduated in IS:\n\nI got a C+ in an introductory object-oriented programming class.\n\nI also got a C+ in Book of Mormon.\n\nThe C+ in Book of Mormon really frustrated me, because I had fairly recently gotten back from my mission and could recite large swaths of the Book of Mormon. If you read any sentence, I could tell you the book and chapter. I aced all the tests, but the teacher required us to write journal entries every day. I really didn't like to write journal entries, so I lost lots of credit on those. It definitely taught me to check the syllabus for a teacher a drop immediately if the teacher has a requirement like writing in a journal.",
            "score": 1,
            "author": "JohnBarnson"
        },
        {
            "level": 0,
            "comment": "I got a C in ECON 110 😭 man that hurt the GPA for sure but we coming back swingin baby 💪",
            "score": 1,
            "author": "lil_jordyc",
            "replies": [
                {
                    "level": 1,
                    "comment": "You and me both 🙌\n\nI took it my last semester at BYU, so just a drop in the bucket.",
                    "score": 2,
                    "author": "Roughneck16"
                }
            ]
        },
        {
            "level": 0,
            "comment": "B- on Book of Mormon. And B- in history 201 I believe. Man that professor for history was just dull and i couldn’t come up with a way to enjoy that class.",
            "score": 0,
            "author": "paolopoe"
        }
    ]
}