{
    "id": "108v9lc",
    "score": 5,
    "title": "Meal prep lunches?",
    "author": "sciguy456",
    "date": 1673410783.0,
    "url": "https://www.reddit.com/r/byu/comments/108v9lc",
    "media_urls": [],
    "other_urls": [],
    "postText": "What successful ways/ideas have you all had for packing easy, healthy lunches to bring on campus? Looking for ideas for make ahead meals, help meal prepping, easy frozen meals, etc. Thanks:)",
    "comments": [
        {
            "level": 0,
            "comment": "I do a lot of chicken, rice and vegetables. I filet and marinate 3lbs of chicken on Saturday and grill on Sunday. I make brown rice with quinoa and vegetables. I packaged all of that in meal prep constraints for each day of the week. I also make sheet pan egg sandwiches with ham and Sriracha mayo. I like them English muffins because they freeze better than normal bread. Get a insulated lunch box with a good ice pack and your good to go.",
            "score": 14,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Chili is super easy. Crock pot. Enchiladas. You can get a chicken at Costco and make several meals with it, like stir fry.",
            "score": 3,
            "author": "AeroStatikk",
            "replies": [
                {
                    "level": 1,
                    "comment": "I make crockpot lasagna",
                    "score": 1,
                    "author": "alethag"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Watch the Joshua Weissman \"but cheaper\" video serias in youtube. There are a ton of meals he makes that are cheap, fast, and easy to pack. And with a good variety so you don't get bored of the old plain chicken and rice.",
            "score": 3,
            "author": "Solid_Negotiation441",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes! I love that series. Great ideas for sure.",
                    "score": 1,
                    "author": "RoxWolf87"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I always took these five foods with me to campus along with a spoon and fork, and they got me through my day. Also really cheap and easy to prepare.\n\na-can of tuna or chicken chunks (eat straight from the can after adding mayo and relish from the food court!)\n\nb-apple or orange\n\nc-carrot or bell pepper (peel the carrot in advance or just buy carrot sticks/baby carrots)\n\nd-cup of yogurt\n\ne-pbj sandwich",
            "score": 3,
            "author": "tpmotd"
        },
        {
            "level": 0,
            "comment": "The Kodiak protein balls from Costco have been a lifesaver",
            "score": 1,
            "author": "taycroft99"
        },
        {
            "level": 0,
            "comment": "I try to have a starch, a vegetable, and a protein dish prepared. The starch is usually rice, but sometimes it's noodles. The vegetables are always just whatever stir fried vegetables I have that week. The protein can be anything from curry, to chili, to mapo tofu. By organizing my meals this way I minimize the amount of cooking I have to do at any one time since each part of the dish can be cooked in a large amount at different times and kept in the fridge. It also keeps my food diverse since I can switch each part every time I cook.",
            "score": 1,
            "author": "WiJaMa"
        }
    ]
}