{
    "id": "10gakvn",
    "score": 5,
    "title": "Applying to BYU",
    "author": "Real-Bodybuilder-128",
    "date": 1674156127.0,
    "url": "https://www.reddit.com/r/byu/comments/10gakvn",
    "media_urls": [],
    "other_urls": [],
    "postText": "Not sure if anyone has posted about this (I tried looking) But I live in Canada and i’m currently taking BYU-I online courses. What do y’all recommend that I should do if I wanna transfer and attend BYU?",
    "comments": [
        {
            "level": 0,
            "comment": "Take time with the essays and answer the questions in a way that demonstrates that you understand BYU’s mission statement.",
            "score": 10,
            "author": "brpajense"
        },
        {
            "level": 0,
            "comment": "If you have 24 credits or more you will be considered a transfer. If less you will be considered a new student. \n\nhttps://enrollment2.byu.edu/transfer-guides\n\nThis is a guide to transfer class and what is evaluated. If it is not evaluated you can always email the respective department with the syllabus and they will evaluate it. This is what I did. Let me know if you have any questions about the process.\n\nChoose your school from the above link and will till what can transfer.\n\nEdit: 24 Credits are needed to be considered a transfer not 30.",
            "score": 5,
            "author": "abdo9029",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s only 24 credits to be considered a transfer student so that they don’t consider high school record. https://enrollment.byu.edu/admissions/transfer-applicants\n\nThis is what I did. I got 24 credits and I never even took the ACT or SAT. Got into BYU with exactly 24 credits.",
                    "score": 2,
                    "author": "official_SammyB",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for clarification, I mixed it with another school.",
                            "score": 1,
                            "author": "abdo9029"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was told most BYU-I classes do not transfer over to Provo BYU. I would check with your major's academic advisor about classes that will move over. I think this is dumb that the same school doesn't transfer across scholols",
            "score": -3,
            "author": "GloriousBlackOps",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe it's because they're *not* the same school?",
                    "score": 8,
                    "author": "geekusprimus"
                },
                {
                    "level": 1,
                    "comment": "It's partially because of the rigor of the classes at the two schools being different.",
                    "score": 5,
                    "author": "True-Grab8522"
                }
            ]
        }
    ]
}