{
    "id": "119mfze",
    "score": 8,
    "title": "Easiest classes to get an A with minimal effort",
    "author": "CarsonPayne1",
    "date": 1677120973.0,
    "url": "https://www.reddit.com/r/byu/comments/119mfze",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am needing to do 12 credits to keep my scholarship and I’ll be working at the same time. Basically, all I need is 6 credits worth of classes that take basically no time or effort to get an A in. I don’t want to lose my 4.0 GPA by some random class so the more guaranteed of an A the better. Also, if I can take it as on-demand remote even better. Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "-Most of the student development classes are easy As. \n\n-One that comes to mind is Professional Etiquette where not only the class was super chill and easy, but you actually learned useful stuff for life. \n\n-Even if you aren’t planning to be a lawyer, law lectures is a good option as well, especially because the class is remote. \n\n-Eternal Families with Bro Duncan was remote and very chill.\n\n-Innovation Bootcamp is a 1 credit class that you only attend one Saturday and Thursday the entire semester. If you show up, you pass automatically.",
            "score": 8,
            "author": "Cui17",
            "replies": [
                {
                    "level": 1,
                    "comment": "I second the Eternal families with Brother Duncan. He easily was the most tender hearted professor I had the privilege to learn from",
                    "score": 5,
                    "author": "cfacoolchickenwrap"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Music civilization from Howard. He doesn't really care about grades, just that you learn. Super easy class and one of the best, if not the best, professors on campus. His lectures are amazing. I think it's Music 201 and 202. Gotta take it from him tho",
            "score": 4,
            "author": "joe-sephious",
            "replies": [
                {
                    "level": 1,
                    "comment": "He's a great professor and so far his 202 class is quite easy. That being said, it's not a 0 effort class and, especially exam week, do expect to dedicate a few hours to Music if you want to do well.",
                    "score": 1,
                    "author": "Main_Community2649",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "True, but it's an easy final because it's just the first two exams. Definitely the hardest part is identifying the art and music, but if you pay attention in class you should do fine",
                            "score": 1,
                            "author": "joe-sephious"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "stdev classes\n\nEternal families with dyer\n\nthere's an information systems class that isn't too hard\n\nIT101(?) isn't too bad if you know your way around a computer",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Since when is eternal families with dyer minimal effort? So much writing and reading",
                    "score": 0,
                    "author": "peachyflowerrz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "bruh literally the easiest religion class I ever took.\n\nhad it 2x, once as a credit filler.",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It may be easy but not minimal effort",
                                    "score": 0,
                                    "author": "peachyflowerrz"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Econ 110 is a great one",
            "score": 4,
            "author": "fuibo_in_germany",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s mean :)",
                    "score": 9,
                    "author": "kirtchristensen"
                },
                {
                    "level": 1,
                    "comment": "LoL my class average for spring 2020 was like a 67 for that class",
                    "score": 2,
                    "author": "Psychological-Yak776",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I have no idea, I am in chemical engineering and have not done anything with PSYCH but it is my recommendation to just take PSYCH",
                                    "score": 1,
                                    "author": "Psychological-Yak776"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Any lecture series class, like for Psychology. I think they're 1 credit, but they are very easy.",
            "score": 1,
            "author": "Temporary-Profit-643"
        },
        {
            "level": 0,
            "comment": "PWS 150 with aandereud (i probably spelled his name wrong but you get the idea). It counts for biology and global/cultural awareness and is literally the easiest A you’ll ever get, and it’s super interesting!",
            "score": 1,
            "author": "doritos_ice_cream"
        },
        {
            "level": 0,
            "comment": "SFL 461 Family and the Law by William Duncan. You’ll need to show up for class- but guaranteed A if you show up. (Open note tests) and like 2 “projects” that took maybe 30 minutes. Just email him beforehand and he’ll give you a link if you haven’t done any pre-requisites (they’re really not necessary).",
            "score": 1,
            "author": "Squash_zucchini5876"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "MUS111- it’s a basic vocal skills class that you essentially can’t fail. :)",
            "score": 1,
            "author": "Snortney13"
        }
    ]
}