{
    "id": "11v06be",
    "score": 6,
    "title": "Do I have a chance of getting in as a transfer?",
    "author": "[deleted]",
    "date": 1679172559.0,
    "url": "https://www.reddit.com/r/byu/comments/11v06be",
    "media_urls": [],
    "other_urls": [],
    "postText": "I graduated high school in 2018, and in early 2019 I did one semester at BYU-I, where I had a death in the family and my grades plummeted. I never did withdraw from those courses, and ended with a 0.88 GPA for those 13 attempted credits. Later that year I served a mission, and came home when the Covid pandemic started. I would then work full time, and attend a reputable Community College near home, where I now have a 4.0 GPA with honors and 34 Credits. This brings my total GPA to 3.14 between the two schools. Is there anything I should do or say on my application before trying to apply for fall?",
    "comments": [
        {
            "level": 0,
            "comment": "I got in as a transfer and some of my friends didn’t, the difference was I worked on my essays for months! I think you could have a chance if you write strong essays! You could even use that experience for one of the prompts.",
            "score": 9,
            "author": "panteramorada",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks, I’ll start working on those! Any suggestions on resources I can use the make them the best they can be?",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have a story exactly the same as yours and I got in. You definitely have a chance. Make sure you write really good essays.",
            "score": 3,
            "author": "Cool_Insect_2592"
        },
        {
            "level": 0,
            "comment": "You know you can petition to have your grades turned to W’s? Where there was a death I am 100% positive BYUI will change it.",
            "score": 2,
            "author": "swampogre626",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, but that statute of limitations has long passed for that. It has to be within one year. In my case it’s been nearly 4 years lol. \n\nWhat I am considering is doing the spring semester at Idaho online and retaking those failed classes, and petitioning for an academic renewal. This would nullify that semester since 4 years will have elapsed since.\n\nThe issue is the timing. The fall semester transfer application deadline for BYU is in late June, and that Idaho online semester wouldn’t end until mid-late July. So it would still show as Fs for that semester when I apply.\n\nSo now I’m wondering if it’d be best to do that Idaho online semester this summer, do the BYU Flex GE program this fall, while I formally apply for Winter 2024?\n\nI suppose I can always apply with my current GPA for the fall, and if that fails, apply for Winter 2024 in a much stronger position. Can’t hurt to try I guess.",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’d ask them anyways about the Ws. They’re fairly accommodating",
                            "score": 4,
                            "author": "malted_moo_milkshake",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You think they might 4 years later? I suppose it’s worth a shot",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You could have a good chance! Just make sure to write about it in your essays. Talk about overcoming hard experiences.",
            "score": 2,
            "author": "athena_blue9"
        },
        {
            "level": 0,
            "comment": "I applied as a transfer and got in but I applied for Winter semester. Not sure if that increases your chances",
            "score": 1,
            "author": "No_Grapefruit_3498",
            "replies": [
                {
                    "level": 1,
                    "comment": "What were your stats if you don’t mind me asking? Freshman or transfer?",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My advisor told me to write about the byu aims in my essays, which I did and got in as a transfer student. I’m not sure exactly what they are but if you just look it up I’m sure you can find the byu aims.",
            "score": 1,
            "author": "boncada"
        },
        {
            "level": 0,
            "comment": "You can improve your chances applying for the spring semester as well.",
            "score": 1,
            "author": "chapito96"
        },
        {
            "level": 0,
            "comment": "Did you participate in Institute? As this also shows up directly from ces system. If you didn’t I think you should explain that as well. Definitely write about your experience.",
            "score": 1,
            "author": "Designing-Good",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nope, no institute. I never had institute close enough for me, and I always worked full-time while going to school full-time. I may explain that I want to be active again, and that going to byu would be a great way to do so",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wouldn’t phrase it as want to be active but more like you have missed it and felt the loss and want the opportunity to access more religious education  but definitely address it or it will likely count against you",
            "score": 1,
            "author": "Designing-Good",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s a good point. Do you think that I get rejected for the Fall, that retaking that Idaho semester online and attending Provo for the Flex GE program for the fall would make me a stronger candidate for next Winter?\n\nIf I’m not mistaken, I only have to pay the $35 fee once. So I can just try each semester if need be, tweaking me essays if needed",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "well the BYUi is fairly old- i don't know how much rehabilitating it matters - I would ask a counselor on that-(it may help if you plan to go on to grad school etc- so you gpa doesn't always have the hit) I think FLex GE and taking religion could help- I would talk to an admissions counselor about your situation and see what they recommend- I would explain the situation and lack of institute",
                            "score": 1,
                            "author": "Designing-Good"
                        }
                    ]
                }
            ]
        }
    ]
}