{
    "id": "12kxarx",
    "score": 1,
    "title": "Weeding Photographers",
    "author": "Key-Conclusion-3897",
    "date": 1681408232.0,
    "url": "https://www.reddit.com/r/byu/comments/12kxarx",
    "media_urls": [],
    "other_urls": [],
    "postText": "I don’t really know if this could belong here but I gonna try anyways, I’m getting married in CA, so I need a photographer that understands the culture of getting pictures in the temple and the reception and all that stuff that is natural here in Utah. but it’ll be freaking expensive to pay one from here and make him/her travel to there and do the pictures for us. Is there a website or some ideas to deal with this kind of situation? I’m so naive with this so I hope Reddit will help me, thank you!",
    "comments": [
        {
            "level": 0,
            "comment": "A hybrid Gardener photographer really does sound like a big ask you might just want to hire both individually /s",
            "score": 23,
            "author": "RobAneebodyFeegle",
            "replies": [
                {
                    "level": 1,
                    "comment": "And it depends on which kind of weeding photographer you really need. Do you want a photographer to take a picture of you and your spouse weeding outside the temple and in the garden of the reception area?  Or do you want a photographer who can do some weeding on the side in between snapping some photos in order to keep things looking clean.\n\nAlso, make sure you and the photographer consult the farmer's almanac on being clear about noxious weeds that torment mankind.  My cousin's brother in law is still fuming about their weeding photographs from their special day.  After they had paid to get a favorite picture framed, they realized that the plant they were jointly pulling out by the roots wasn't a weed at all -- but a flower that had only formed the axillary buds and just looked like a weed. The hobby lobby framer had studied botany before dropping out of school, and could not hide her amusement at their faux pas.",
                    "score": 5,
                    "author": "HyrumAbiff"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There are a ton of Facebook groups with Utah based photographers, and I’m sure there would be some member photographers who live in CA that would be in those groups. Maybe try that?",
            "score": 8,
            "author": "bayes4days"
        },
        {
            "level": 0,
            "comment": "At first I thought you wanted someone to photograph you working in the garden. 😂",
            "score": 8,
            "author": "Pyroraptor42",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hahaha my bad, you can tell that writing is not my thing",
                    "score": 1,
                    "author": "Key-Conclusion-3897"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Look up the temple(s) in your area on Instagram and go to the photos that are taken at that location! Scroll through a ton of different wedding photos, look at if the photographer was tagged, and you should be able to find a bunch of photographers that way! That’s what I did and it worked great",
            "score": 8,
            "author": "womack1000",
            "replies": [
                {
                    "level": 1,
                    "comment": "@sophiajensenphoto is one I just found if that helps.",
                    "score": 3,
                    "author": "womack1000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There are so many members in CA, I’m sure you can find someone. Congrats!!",
            "score": 6,
            "author": "VeryLDS"
        },
        {
            "level": 0,
            "comment": "Say the temple location, and I might DM you a referral. I know one in L.A. and one in the bay area.",
            "score": 4,
            "author": "auricularisposterior"
        },
        {
            "level": 0,
            "comment": "If Southern California- https://templeweddingphoto.com/",
            "score": 3,
            "author": "Mr_Heckles_123"
        },
        {
            "level": 0,
            "comment": "Plugging my cousin. Local to Utah and does good stuff. \n\nhttps://instagram.com/_rachelleighphoto_?igshid=YmMyMTA2M2Y=",
            "score": 3,
            "author": "engineering_aaron"
        },
        {
            "level": 0,
            "comment": "What are you hoping to pay?",
            "score": 2,
            "author": "PostMalonalisa",
            "replies": [
                {
                    "level": 1,
                    "comment": "The less amount of money possible, hopefully under 5k",
                    "score": 1,
                    "author": "Key-Conclusion-3897"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is it a thing to \"weed\" outside the temple?  Don't they have people to do that?  Is it like symbolism to pull up a weed together?  I am so confused.  I didn't know this was a thing.",
            "score": 2,
            "author": "veggie_girl1111",
            "replies": [
                {
                    "level": 1,
                    "comment": "Weeding in this case is a misspelling of Wedding.",
                    "score": 1,
                    "author": "allegedalpaca"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly I would pay for someone to travel - you have one shot",
            "score": 1,
            "author": "thabigcountry",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm thinking that we will ending going that, a lot of money tho 😪",
                    "score": 1,
                    "author": "Key-Conclusion-3897",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It honestly might be cheaper than hiring someone that lives in CA.",
                            "score": 1,
                            "author": "anonusuer"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oof",
            "score": 1,
            "author": "FlySpiritual7311"
        }
    ]
}