{
    "id": "135x7ou",
    "score": 2,
    "title": "Independent study",
    "author": "Disastrous_Fig_6391",
    "date": 1683054553.0,
    "url": "https://www.reddit.com/r/byu/comments/135x7ou",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am thinking about taking an independent study for Physical Sciences this summer to get my last general done. I will be out of the country while doing it, does anyone know if it will count for a credit and if there are any issues of doing one abroad?",
    "comments": [
        {
            "level": 0,
            "comment": "I did Independent Study to finish my degree at BYU while living out of state, both GE courses and major classes. The credits should transfer automatically, but it might be helpful to meet with an advisor before you register so you can confirm you’re taking the right classes/meeting GE requirements. Also keep in mind that you have to finish the course work/final a month before your planned graduation date.\n\nAfter taking four IS classes, I can see absolutely no reason why there would be issues with taking it abroad as long as you have access to the internet. The only consideration is maybe if you have to get a physical textbook which might be easier in the US. But hey, if I could do it out of state, then you can do it anywhere remotely.\n\nI love IS and couldn’t recommend it highly enough!",
            "score": 1,
            "author": "shippingismypassion"
        },
        {
            "level": 0,
            "comment": "I took Independent Study classes in high school while living abroad, and I had essentially zero issues with the class itself. The only thing was the time difference made getting TA/teacher help a little difficult which is to be expected, and then taking the exams. I'm not sure what your classes would be like and if they would have online exams, but my classes required me to take a proctored final with a BYU IS approved proctor. If you're able to take the final after you get back to Provo that shouldn't be an issue, or it's not too difficult to get someone you know abroad to become an approved proctor, you'll just need to plan ahead. I took mine several years ago though, they may have changed the exam and proctor process or it might be different for college classes!",
            "score": 1,
            "author": "Altruistic_Gold6367"
        }
    ]
}