{
    "id": "13hit3m",
    "score": 0,
    "title": "“From the Wilk to the Tanner, banners read ‘Women in Law’ &amp; ‘Women in STEM.’ However, you would rarely, if ever, see a poster that reads ‘Men in the Humanities’ or ‘Men in Education.’” Oof. Ernest and Eldon who? Check the list of 300+ BYU buildings. It’s a permanent display of men’s names. SMH.",
    "author": "Chino_Blanco",
    "date": 1684087141.0,
    "url": "https://www.reddit.com/r/byu/comments/13hit3m",
    "media_urls": [
        "https://universe.byu.edu/2023/05/12/feminism-should-be-about-everyone/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I can't speak to education but in my experience, even if men don't dominate in the humanities by population, they still dominate conversations in the humanities. I think the op-ed misses this point because it's written by a STEM major who wouldn't be in a position to notice this. So in a sense I agree with your point that men kind of need to grow up and accept women's voices, but I also understand the point of view of the op-ed. Men simply aren't raised with feminist values, and this is exactly what leads to the attitudes you're condemning here.",
            "score": 9,
            "author": "WiJaMa"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's my problem with the op-ed. It's very well written (far and above what we usually see from the Daily Universe). I actually started out liking it from the first couple of paragraphs since I agree that young men that don't understand feminism could easily misinterpret it as a threatening movement and that's why they cling to charlatans and misogynists like Andrew Tate. \n\nIt starts making pretty odd claims though. He acts like celebrating women in STEM means ignoring men. There are whole departments without a single female tenured Professor. I've searched humanities and education majors, and I can't find any without a male tenured professor (not saying it doesn't exist, just that I couldn't find one). \n\nI think it's the author himself that fundamentally misunderstands feminism. I don't know any mainstream feminists that say you should reject masculinity (just toxic masculinity). The second to last paragraph is an argument almost no feminist would fight him on: that people should be as masculine or feminine as they please.\n\nThe \"kill-all-men\" radical feminists are a very tiny minority here. Go to Chicago, or the Bay Area, and you might find a group of them if you take a womens' studies course. Here at BYU, though, I'd be shocked to find one (not saying they don't exist, just that they'd be HARD to find). I'd argue they're not even a sizable group in the nation as a whole. \n\nLike you said, it's a conservative campus. BYU feminists know they are surrounded by thousands of people that believe with religious conviction what role women \"ought to have\". Feminism is already about everyone and aims to give everyone a choice in their lives regardless of their gender. I guess that's too hard of a concept for the author to understand though.",
                    "score": 5,
                    "author": "Main_Community2649"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The article was extremely reasonable and well written. The reason the buildings are named after who they are named after usually has to do with who donated extremely large sums of money to the school.",
            "score": 4,
            "author": "Cool_Insect_2592",
            "replies": [
                {
                    "level": 1,
                    "comment": "This rings true to you?\n\n&gt;Teachers commend female students on their handwriting, brilliance and behavior then turn to their male pupils and ask with venom why they can’t “grow up.”\n\nit’s r/thathappened fiction as far as I can tell.  An attempt to foment outrage over aggressions that sound made-up on the fly to drive the author’s storyline.  Pretty standard stuff, but odd to see *The Daily Universe* platform such pablum.",
                    "score": 0,
                    "author": "Chino_Blanco"
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://en.wikipedia.org/wiki/List_of_Brigham_Young_University_buildings",
            "score": -4,
            "author": "Chino_Blanco"
        }
    ]
}