{
    "id": "13zexbh",
    "score": 2,
    "title": "Seeking Advice and Encouragement as a Motivated Pre-Med Student at BYU",
    "author": "granolamad22",
    "date": 1685803367.0,
    "url": "https://www.reddit.com/r/byu/comments/13zexbh",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey everyone! I hope you're all having an amazing day! 🌟\n\nI am going to be starting my sophomore year at BYU as a pre-med student. Working in healthcare has always been my dream, and after carefully considering nursing and medicine, I've finally decided that becoming a doctor is my ultimate goal!\n\nNow, here's the thing. I took chem 105, and let's just say it was much more challenging than I anticipated. My high school chemistry classes didn't fully prepare me for it, and I ended up withdrawing. But, I'm not giving up! I am determined to take it again, this time after completing chem 101 in the fall. I would greatly appreciate any suggestions on the best chemistry professors at BYU.\n\nIn addition, I'd love to hear any general advice from all of you. As a slightly clueless (but totally motivated) pre-med girl, any guidance you can offer on excelling in chemistry and other pre-med classes would be greatly appreciated. Do you have any study tricks or resources that you can recommend? I'm also curious about any tips for preparing for med school. Are there any outstanding volunteer work or clubs that you would recommend? I want to make the most out of my time here and build a solid foundation for my future as a medical student!\n\nThank you so much for taking the time to read my ramblings and for any advice you can offer. Let's rock this pre-med thing together! 💖✨👩‍⚕️",
    "comments": [
        {
            "level": 0,
            "comment": "Just do your best with 105 and 106, but make sure you crush it in 107.   Lab makes it fun. \n\nEnjoy the journey! And make friends with upper level students and TAs in pre-med club.",
            "score": 6,
            "author": "grouchygaucho"
        },
        {
            "level": 0,
            "comment": "I can tell you are excited and motivated to take on the challenge, so sending you positive vibes and rooting for you internet stranger!\n\nAlso, you should check out Leland. It was started by some BYU grads and they have a bunch of free articles about getting into med school, they also have paid classes and coaches but that might be more than you need right now: https://www.joinleland.com/library/medical-school",
            "score": 2,
            "author": "jrang152637"
        },
        {
            "level": 0,
            "comment": "Get the military to pay for your med school.",
            "score": 1,
            "author": "Roughneck16"
        }
    ]
}