{
    "id": "em3vln",
    "score": 135,
    "title": "My experience meeting with an Associate Dean of Students about the beard policy",
    "author": "[deleted]",
    "date": 1578540375.0,
    "url": "https://www.reddit.com/r/byu/comments/em3vln",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/byu/comments/ex2jse/follow\\_up\\_to\\_my\\_previous\\_post\\_about\\_the\\_beard/](https://www.reddit.com/r/byu/comments/ex2jse/follow_up_to_my_previous_post_about_the_beard/)"
    ],
    "postText": "Hey everyone, I'm a sophomore at BYU who thinks he looks way better with a beard, and my wife and friends agree. So I let my facial hair grow and shave before tests. I hate doing this, because I want to let my beard grow out, so a couple weeks ago I met with the Associate Dean of Students Nathan Ward to discuss the issue of beards.\n\nA quick summary of our meeting: that sucks, there's nothing I or you can do, have an ice cream on us.\n\nIn all honesty, my meeting with Dean Ward was very cordial and respectful. I went in knowing that people would have spoken with him before and intended on getting some ideas on official ways I can go about appealing it to people in power. And that's where I hit a brick wall. While I got the feeling throughout the meeting that Dean Ward was on my side and in total agreement, he explained to me in no uncertain terms that there's no way for me to directly contact those in charge of the Dress and Grooming Standards.\n\nHe also explained to me who's in charge of them: the First Presidency, Twelve, and a handful of other commissioners who meet to talk about the entire CES once a month. He told me that they were aware of the issues and that they were aware that student sentiment had changed. I asked if he could bring it up, he said that while they do talk about student sentiment about many rules that not even President Worthen can make recommendations on changes to the Honor Code: only the board can ask for recommendations. ie the prophet, his counselors, and 3 or 4 other people. The last time they asked for recommendations? 1991.\n\nI asked him if he could see the policy changing while I'm at BYU (two-ish more years), he said he wouldn't be surprised, but that I shouldn't hold my breath.\n\nAfter 45 minutes of discussion, I said \"it appears we've hit a brick wall.\" Dean Ward chuckled sympathetically, and as a well-intentioned final act of placation, gave me two coupons for free ice cream from Cougar Eats, which I enjoyed with my wife.\n\nEDIT: here's a follow up on my experience writing President Worthen himself:  [https://www.reddit.com/r/byu/comments/ex2jse/follow\\_up\\_to\\_my\\_previous\\_post\\_about\\_the\\_beard/](https://www.reddit.com/r/byu/comments/ex2jse/follow_up_to_my_previous_post_about_the_beard/)",
    "comments": [
        {
            "level": 0,
            "comment": "This was a wholesome read. Thank you for sharing your experience with us and also not becoming angry or calling a witch hunt. I appreciate everything about this post and hope for more like it",
            "score": 55,
            "author": "stealingchairs"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 44,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The reasoning he gave me was that when they created it the church decided to apply it to all CES schools with little variation between them. When it became standardized it came under the control of the board, which happens to consist of the First Presidency and several members of the Twelve.\n\nI think that silliness is why the rule hasn’t been changed. The Board meets once a month for probably an hour or so. They don’t have time to talk about beards or leggings.",
                    "score": 10,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "It was ostensibly put in place by students but really was done by President Wilkinson, the student hater.",
                    "score": 6,
                    "author": "austinchan2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Alright everyone, start writing letters to the First Presidency and the Twelve!",
            "score": 26,
            "author": "ShinakoX2"
        },
        {
            "level": 0,
            "comment": "What's the point of being a university president when you can't even unilaterally relax the dress code?",
            "score": 9,
            "author": "yrdsl"
        },
        {
            "level": 0,
            "comment": "Are you able to get a beard card? If you can, I would definitely do it.",
            "score": 3,
            "author": "istopmotion",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is what I was going to recommend. Buy the cheapest, lousiest razor you can find (or better yet, use a butter knife), and shave and then go show a doctor your bad reaction to shaving. You can use this to get a special dispensation/exemption from the beard portion of the honor code. At least I had friends who did this when I was there 2012-2015.",
                    "score": 5,
                    "author": "jedwards55",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s too bad, but makes sense. \n\nIt seems like such a small thing to be so strict about.",
                                    "score": 2,
                                    "author": "jedwards55"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "While I think shaving probably irritates me more than the average person, I don’t have a condition beyond slightly sensitive skin. I think it’s dishonest to fake an illness to get a beard card.",
                    "score": 0,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you have sensitive skin, congratulations, you would qualify for a beard card. That’s not faking an illness. It’s not dishonest to pursue that option. It’s there for people who need it.\n\nSince you brought up dishonesty: I *do* think it’s dishonest to attend BYU, agree to living the honor code, and not shave unless taking a test at the testing center... it seems pretty backwards if you feel better about doing that than trying to get a beard card. Whatever you need to tell yourself man. 🤷🏼‍♂️",
                            "score": 6,
                            "author": "istopmotion",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I suppose you’re right, but I don’t want to make it more difficult for people who actually have pseudofolliculitis to get what they legitimately need. Disobeying the honor code affects me, faking an illness can affect others when they make the rules more strict.",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "First off, I never suggested that you fake an illness so you could have a beard card. I simply stated that if you are able to get one, you should do it. Literally all I suggested was that you look into it. Why tell yourself that you don’t qualify instead of asking a doctor for their opinion on the matter?\n\nSecondly, “disobeying a dumb rule” = not living by the honor code that you agreed to live by in order to go to BYU. BYU tuition costs are paid substantially by tithing money. It doesn’t matter whether you think the rule is stupid. You’re not living the honor code while still benefitting from adjusted tuition rates after tithing. The argument can absolutely be made that what you are doing is worse (than asking a doctor if you would qualify for a beard card).\n\nThere are certainly worse things you could be doing at BYU but it baffles me that you pulled the holier-than-thou card regarding looking into the beard card option while literally going against the honor code. 😂",
                                            "score": 1,
                                            "author": "istopmotion",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My intention wasn’t to be “holier-than-thou.” I stated my opinion and then you stated yours, which I admitted you’re right about.",
                                                    "score": 1,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's actually super hard to get though. If you don't have the condition they will reject you. They make you shave in front of their dr and measure reaction a few days later",
                            "score": 0,
                            "author": "Jordan-Pushed-Off"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You would think they’d want to hear it from students and leadership first, rather than from the newspapers as it gets out of control. Turns out they do listen to those newspapers tho. See: BYU I medicate fiasco.",
            "score": 3,
            "author": "austinchan2"
        },
        {
            "level": 0,
            "comment": "\"...only the board can ask for recommendations. ie the prophet, his counselors, and 3 or 4 other people. The last time they asked for recommendations? 1991.\"\n\nIt's guess it's like Jesus said ...  \"never ask for input if you are a leader\". /s",
            "score": 2,
            "author": "saladspoons",
            "replies": [
                {
                    "level": 1,
                    "comment": "I understand, they have a lot on their plate and the beard policy isn’t exactly a priority issue. I feel like the CES administration should be delegated to people who can actually be on the front lines so that the prophet can focus on being the prophet and so that BYU can be better at adapting to changing culture and circumstance.",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This reminds me of the time my trans little brother was told by our Bishop that he cannot attend priesthood meeting in church anymore. On my brothers behalf, my dad argued a very well prepared case to the bishop who \"sympathized\" with him but couldn't repeal his decision due to the \"policy\". Bishop told my dad he could talk to the stake president (who I know to be a good man). The SP also sympathized with my dad but said that it wasn't his decision to make exception to policy and that he'd be stepping on the bishops toes if he reversed bishops decision anyway. \n\nMy dad hit a dead end. Neither bishop or SP were willing to take responsibility over how the decision should be made. Furthermore, my dad couldn't climb the latter of command on the issue. Needless to say, this really upset my dad. It was understandable when my brother stopped attending church after being denied priesthood meeting, priesthood ordination AND a temple recommend (despite the fact that he was worthy). Worth mentioning that bishops in wards on the other side of the valley WERE oradianing and including transgender youth. Little bro was 14 at the time, and trying really hard to be a good member.",
            "score": 2,
            "author": "ehight225"
        },
        {
            "level": 0,
            "comment": "When you attend BYU, you must realize that it's basically like living in a communist country. You're told what to wear, how to wear your hair and beard, with whom you may live, where you may live, activities in which you may take part, etc. Of course, nearly every student endorses these strict rules to attend the Y.   \n\n\nI was involved in the Social Club scene in the early 80's at the Y and being part of a fraternity was one of the most positive experiences I remember from the Y.  Our 'club' was founded at the Y in 1917 and, in fact, two current Apostles were members when they attended BYU. In 2017, we celebrated our 100 year anniversary with a dinner and conference during Homecoming with several hundred members in attendance. Many were well into their eighties. We even heard a few inside stories about a certain Apostle from his former roommate. But social clubs were banned from BYU in the early 90's. The reason we were told was because we didn't allow universal admittance of anyone who wanted to be a member. I suspect the real reason was because BYU couldn't fully control clubs. But, as I said above, you play by BYU's rule when you attend...for better and worse.",
            "score": -5,
            "author": "JoeScuba"
        }
    ]
}