{
    "id": "jw291e",
    "score": 181,
    "title": "The Problems with BYU Contracted Housing",
    "author": "ProdigalPressProvo",
    "date": 1605649403.0,
    "url": "https://www.reddit.com/r/byu/comments/jw291e",
    "media_urls": [],
    "other_urls": [],
    "postText": "This month our team has been doing some research on the BYU housing market, talking to academics, emailing local real estate brokers, digging through off-campus housing rules, and looking through business records. Everyone knows BYU housing has problems, but it’s time we have a real discussion about the root causes.\n\nHere are a few excerpts from “The Provo Housing Racket” that summarize our findings pretty succinctly:\n\n—\n\nToo often, BYU students are over-charged, abused, and taken advantage of by their landlords. And, despite good intentions, BYU is one of the greatest culprits behind Provo’s broken student housing market.\n\nBYU places significant hurdles in the way of would-be landlords, limiting the supply of available housing and costing students more. First, BYU contracted apartments are required to physically segregate male and female designated units. Since most apartments in the U.S. are gender-neutral by default, a large chunk of housing is written-off on that basis alone. Second, BYU contracted apartments must be located within a certain distance of campus, limiting the geography for BYU housing to a mere 2.7 square miles. That area includes established businesses and married housing, as well as streets and greenspace.\n\nAs a result, many BYU apartments are thirty, forty, even fifty years old. Building new is expensive, and the pool of non-BYU contracted housing within the zone is limited. Most newer developments are on the premium side of the market (The Village, College Place, etc.). If students had a wider range of affordable options to choose from, rent would fall and quality would rise.\n\nIt’s bad enough that BYU has built a system primed for exploitation—a system where the rules of supply and demand no longer apply, and landlords can count on a captive audience of vulnerable renters. What’s worse is the way that BYU has abandoned its responsibility to protect students. Last winter, BYU moved classes online and told students to go home. Students on-campus were released from their contracts in the dorms without penalties. Students off-campus, however, were left to fend for themselves. BYU did little to pressure complexes to release students from contracts, even though the university could have threatened to rescind BYU approval for non-compliant housing. \n\nIf BYU is going to require students to live in BYU contracted housing with all of the drawbacks that entails—special rules, higher rents, lower quality—BYU needs to do more to protect students. This means:\n\nNo more 12-month contracts: require complexes to offer fall/winter contracts since most students leave Provo in April. \n\nNo more monopolies: limit the reach of companies like Redstone Residential that exercise unfair control over the housing market.\n\nFinally, pick sides: when crises like COVID-19 break out, BYU needs to side with students. The university has played neutral for far too long.\n\nOr better yet, BYU should let students live where they want and let the problems work themselves out.",
    "comments": [
        {
            "level": 0,
            "comment": "The downvotes must be from BYU approved landlords",
            "score": 63,
            "author": "spelcheckmaster",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a BYU approved landlord I agree. The system is terrible and predatory. I don’t think BYU can push their weight around like making up new rules mid-contract. But telling students where they have to live is a terrible system not fit for adults.",
                    "score": 38,
                    "author": "austinchan2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "BYU loves to treat the students like they are little children who can’t be trusted to make their own decisions. Hence the honor code and the OCH requirement for undergrads. They want control over as much as possible.",
                            "score": 15,
                            "author": "Ew_David640",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "With any luck the students will be married before they graduate and never need to learn how to make decisions on their own, ever.  Which is a good thing, because, as we all know, decisions are what leads people into apostasy.",
                                    "score": 16,
                                    "author": "austinchan2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ha! I’m dead. That last line is pure gold!",
                                            "score": 8,
                                            "author": "Ew_David640"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "What is och",
                                    "score": 1,
                                    "author": "blackchairwhitebrick",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Off campus housing",
                                            "score": 1,
                                            "author": "Ew_David640"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My former roommates and I once compiled a list of our off campus housing manager’s contract violations, submitted them to the BYU Off-Campus Housing office, and were then told by the person in charge we should just hope to “marry rich someday so we never have to rent again.”",
            "score": 76,
            "author": "smileandlaugh",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's horrible. We need to do something about this\n\nIf you're with me, dm me. I might make a Discord server so we can combine our efforts",
                    "score": 12,
                    "author": "MidnightSnAAck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This was when I was a student about 4 or 5 years ago. It was such a mess trying to navigate our housing issues that addressing the university rep’s comment and general reaction was a low priority. Being on the other side of it all now and having the life experience to understand how inappropriate a response that was, I would consider making a formal complaint. Or at least act in solidarity with any students trying to tackle the BYU off campus housing issues.\n\nThere was literally black mold along the apartment walls. I called the city inspectors and they ultimately placed heat on the housing manager.",
                            "score": 9,
                            "author": "smileandlaugh"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly, amen. My roommates and I drove past a nice new apartment building in Orem the other day and looked up the price just for fun. After doing the math, we realized that - were it not for BYU’s artificial monopoly on housing - we could be living somewhere much nicer (50 years newer) for less than we are each currently paying. Open up the market!",
            "score": 52,
            "author": "Jaboticaballin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Some friends and I did just that in the last year we were in school. If you only have a few semesters left, and aren't opposed to paying a small fine, it's a good option. Plus riding the bus down to campus from Orem is really quick and easy.",
                    "score": 17,
                    "author": "druzhok",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Any idea how much the fine is? Lol if you save enough money living outside their approval and get a better place maybe it would be worth paying it",
                            "score": 5,
                            "author": "MidnightSnAAck",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, it's $25 for the first semester, $150 for the second. That was in the last few years, so it may have changed. It should be updated on their site if it has. For us it was so worth it, but again it can only be for two semesters. On the third you'll get a hold put on your account and you won't be able to work or take classes. And this isn't just two in a row, this is two semesters total.",
                                    "score": 13,
                                    "author": "druzhok",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Holy cow. That's ridiculous. I'm thinking of calling in tomorrow and talking to them about this. Do you think that would help?",
                                            "score": 4,
                                            "author": "MidnightSnAAck",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Talk to them about what? There's no way that they'll make an accommodation unless you apply for and get a waiver. If you're single and attending BYU, you have to live in approved housing. I understand the two-semester-fine-rule to be a grace period for students that are put in a hard spot for one reason or another.",
                                                    "score": 5,
                                                    "author": "druzhok",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Maybe not a call. Maybe I need to like go in full guns a-blazing karen style, make a big fuss, flip a table or two, throw some papers, get in touch with the right people, show them enough of us are outraged, and get the policy adjusted to expand what housing we can live in.",
                                                            "score": 11,
                                                            "author": "MidnightSnAAck",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Just remember the off campus housing office is not your friend. Their jobs are dependent on the system staying the way it is.",
                                                                    "score": 11,
                                                                    "author": "austinchan2",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Who is above them then? I'll get in touch with my boi Kev if I need to. Who's with me??",
                                                                            "score": 8,
                                                                            "author": "MidnightSnAAck",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Not that I’m a skeptic or anything, but when BYU’s ballroom team almost got kicked out of whatever competitive system they were in the suddenly allowed same-sex couples, when the honor code office blew up in the news and social media there was reform, when students protested same-sex dating the honor code changed (kinda). Basically BYU doesn’t care about students who pay tuition, it’s more concerned with donors who fund the school and public opinion. Maybe we start by getting a price in the salt lake tribune? If that gets spread for wider coverage, maybe real change can happen? Maybe we just need to tweet our boi kev so that every time he gets on Twitter it’s a flood of upset students? Flood the world and all that jazz.",
                                                                                    "score": 11,
                                                                                    "author": "austinchan2",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Unleash the Karen",
                                                                    "score": 7,
                                                                    "author": "Jaboticaballin",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You with me? Lol",
                                                                            "score": 1,
                                                                            "author": "MidnightSnAAck"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think the real pain point to emphasize here isn't even really the typical college town real estate problems; I think students generally do a good job at managing their expectations in that regard. It's the fact that BYU is doing more harm than good in creating an artificial, geographically constrained captive market. And for what net benefit to students? We still deal with the same issues we would otherwise with landlords, aging properties, etc. Like others have said, BYU isn't a judge: their only leverage is their ability to pull approvals from landlords. As the COVID situation has proved, BYU doesn't really have the power to protect students in the way I think many student thought they did. What is the real benefit of the OCH program then vs. business as usual property rentals? Students are basically asked to sacrifice flexibility and freedom on the open market for what, a standard lease agreement? The option to use arbitration at BYU to resolve conflicts? Seems like a poor trade-off. Is BYU's implementation of OCH policy just a way to enforce HCO policy then? If so, it was doomed from the start as policing student behavior is an impossible task; we are pretty good at beating the rules if motivated enough.\n\n$400 a month can get you a decent apartment...if you are used to living in dingy, shared $300/month units. The nicer private units in Provo are trending towards $500+ and even decent shared units are trending $350+ now. My roommates (3 brothers) and I were lucky in that we were approved for a waiver. We moved to a townhouse Vineyard (i.e. MUCH nicer than 95% of housing in Provo) and pay $400/month each. We are so fine with a 10-minute longer commute in exchange for that and have honestly had fewer issues out of the property manager than we did in Provo, despite *gasp* not having the protection of BYU's standard residential lease agreement.",
            "score": 17,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You hit the nail on the head here. I strongly believe that the reason for the housing requirement is to allow BYU more control over enforcing the HC.",
                    "score": 3,
                    "author": "Ew_David640"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As an experiment, I took a look at 200 City View Apartments, the newer apartments south of center street. A 2-bed at these brand spanking new apartments is 1300/month. Between 4 people, that’s only 325 a month. There’s almost nothing that good as a student. Nothing. It’s such a racket. I would be okay with BYU housing creating the artificial monopolies they’ve created — as long as they also protected students by implementing price controls and prohibiting year-round contracts. BYU’s housing system harms BYU students.",
            "score": 13,
            "author": "dragonofthewest0"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 14,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Start by emailing the off-campus housing office and important decision makers in the BYU administration. Encourage your friends to do the same. If you don’t like the place you live, leave negative reviews online and be sure to get other residents to help out. Report your landlord for contract violations and badger them via email and phone. There is also a small group trying to form a BYU renter’s union you could join.\n\nOrganizing is key, we just haven’t hit critical mass yet.",
                    "score": 18,
                    "author": "ProdigalPressProvo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Reviews don’t really matter because of the monopoly. Students need to live in BYU housing, and once the good spots are filled the bad ones get filled. \n\nAlso the off campus housing office probably doesn’t want to hear complaints about how the system should be absolved as that would mean them loosing their jobs.",
                            "score": 9,
                            "author": "austinchan2"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; union\n\nWould that vibe well with in general libertarian/politically conservative leaning of the campus community?",
                            "score": 3,
                            "author": "coldcoldnovemberrain",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey, a lot of libertarians are for unions! They’re a capitalistic, nongovernmental way of answering the excesses of capitalism",
                                    "score": 5,
                                    "author": "dragonofthewest0"
                                },
                                {
                                    "level": 3,
                                    "comment": "I think the solution that is more likely to stick is to remove the BYU approved housing restriction altogether and open up the market. That's a much more conservative strategy.",
                                    "score": 5,
                                    "author": "Sw429"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Can you give any suggestions of names and their email addresses on who to contact. I have recently emailed the off-campus housing and even President Worthen about my son's situation with redstone. I guess I'm not too hopeful for any help. He did mediation. It did not go well. They brought three people with them against his one 20 year old inexperienced self.",
                            "score": 1,
                            "author": "mean_evil_woman"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I would suggest having a candid conversation with your landlord without being confrontational. You catch more flies with honey than vinegar. \n\nFighting and blaming will not help, come to the table with solutions and ask for feedback. I cannot reiterate enough that most managers want to help their residents. At least in my experience (obviously there are some bad managers out there, too.) \n\nI have personally expressed my concerns to BYU and they seemed very open to having a mutually beneficial conversation about the issues. Again, approach it with kindness and offer solutions and I think you’ll get much further than with threats and anger.",
                    "score": 4,
                    "author": "Ew_David640"
                }
            ]
        },
        {
            "level": 0,
            "comment": "BYU has supported this and created the mess but at some point a class action lawsuit will bring an end to it...I hope.",
            "score": 14,
            "author": "utahkennedys2020",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’d just love for them to lose their fair housing exceptions. If they can no longer enforce sex based discrimination in housing maybe they’ll give up and get out of the housing game altogether.",
                    "score": 9,
                    "author": "austinchan2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Amen!! BYU gets away with enforcing soooo many fair housing violations it makes me sick to my stomach. That was the biggest issue I had working as an off campus housing landlord. Hate hate hated enforcing rules that were so clearly in violation of FH.",
                            "score": 5,
                            "author": "Ew_David640"
                        },
                        {
                            "level": 2,
                            "comment": "If it leads to the end of BYU's ridiculous oligopolistic housing market, I'm all for it.",
                            "score": 5,
                            "author": "Sw429"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's not particularly likely. BYU is a private institution and can enforce whatever requirements they please. True, you can sue the management companies for violating fair housing standards (gender-segregated housing, students only, etc.), but literally no one will do it because that's the Provo market -- young, single students looking for gender-segregated housing. Why do you think there are so many UVU students living in Provo?",
                    "score": 2,
                    "author": "geekusprimus"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really want to see this fixed. I can email OCH and make a stink but I want to get involved with other students who are making progress. Any direction you can point me?\n\nIt would be great to get this figured out by next Fall if possible. That might be wishful thinking but it's unacceptable, the way things are right now. I was shocked as a freshman when I had to find housing. So much of what I saw online was not approved housing. And what was approved, what little there was, was way too expensive for such horrible living arrangements. This needs to change asap.",
            "score": 8,
            "author": "MidnightSnAAck"
        },
        {
            "level": 0,
            "comment": "I find it particularly dumb that the purpose of BYU signing off on housing is so that they can advocate for the student and demand better conditions, but the result ends up being quite the opposite. \n\nIf BYU is not going to advocate for students to get out of contracts when a pandemic strikes and students are instructed to go home if at all possible then I don't know when they will. Maybe we should reconsider whether BYU contracted housing should still be a requirement at all. I say hard no.",
            "score": 3,
            "author": "Dwight_Ignornt_Slut"
        },
        {
            "level": 0,
            "comment": "As someone who was born and raised in a college town with two large public universities, did an undergrad at BYU, and now does graduate work at another very large public university, you're placing waaaaaay too much of the blame on BYU.\n\n* Inflated housing prices are a feature of college towns, not something exclusive to Provo. In fact, you pay *more* at most other universities for housing than you do in Provo. I've yet to see anything less than $400 a bed at my current university, and most places are closer to $600. Unless something has changed substantially in the last six months, $400 a month can get you a pretty nice apartment at BYU.\n* Old dilapidated apartments with slumlord owners are a feature of college towns, not something exclusive to Provo. UVU gets away with nice, new apartments because UVU was literally a fifth of its current size twelve years ago. Give it twenty or thirty years and UVU's housing scene will start to look like Provo's.\n* BYU isn't a court. Unless there's a legitimate contract dispute, OCH doesn't have any authority to cancel a contract between a tenant and a landlord. The situation you're describing with landlords refusing to let student tenants out of their contracts after COVID sent people home was pretty much a problem everywhere, not just at BYU.\n* Every single one of my wards had a significant portion of UVU students and recent graduates. Apparently there's not enough demand to fill BYU-contracted apartments without letting some other people in.",
            "score": 16,
            "author": "geekusprimus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for your response. Let me address some of your points:\n\n1. We have spoken to students in a variety of different college towns, and we believe our assessment is fair. Let’s look at an example: a shared bedroom at Liberty on Freedom (one of the larger housing complexes) is $400/month. Each unit has two shared bedrooms, a total of four residents altogether. The four tenants share a small bathroom, the kitchens don’t have dishwashers, and the complex is generally quite dilapidated and run-down. I am happy to provide more examples.\n\n2. Crumby apartments are certainly a feature of college towns, but most colleges allow students to choose where to live. BYU students should be able to choose to live in those nicer Orem apartments, for example.\nEven Provo has better housing options if you look outside of BYU-approved housing. \n\n3. BYU isn’t a court, but the university writes most off-campus housing contracts. They also decide which landlords to approve as BYU contracted apartments. If BYU is going to force students to live in BYU contracted housing, then BYU should have forced BYU landlords to be more lenient with students attempting to be released from their contracts. That would be fully within their rights as a private institution. \n\n4. The fact that UVU students live in BYU housing is a negative for BYU renters. To improve conditions, BYU landlords need to be competing for tenants. Many of the largest BYU complexes boast 100% occupancy year-round, reducing the incentive to offer better deals for renters.",
                    "score": 10,
                    "author": "ProdigalPressProvo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The problem you are ignoring is rent. Provo rent is DIRT CHEAP compared to almost any other college town. You're 100% correct on the issue about the geographical limitations, but none of my friends that went to colleges across the US payed less than $500/mo for their housing - including the freshman on campus housing. I have a friend at Stanford, Penn state, and several at UF. They all were paying over $600 once they moved off campus, with one of my friends at UF paying $600 for a shared room, in a 4 person apartment, one bathroom, no laundry, no dishwasher, no utilities included. And it was A 30 MINUTE WALK to campus.\n\nBYU is absolutely limiting the range of locations we can look at for housing, with absolutely no reason to do so. HOWEVER, we are still paying next to nothing when compared to other college towns, and we are getting comparable or better housing for that money.",
                            "score": 8,
                            "author": "Tanzan57",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't know if I wanna compare Stanford and Penn State to BYU. The prices are vastly different. I bet that a student willing to pay $18,000 a year in tuition would also be willing to pay extra for housing. That seems like a demand issue. BYU prides itself in quality education for a low cost. \n\nBut even ignoring that comparison, I think the main point students are making is that if BYU got out of the way and allow for a more open market either living conditions would go up or cost would go down. If you have reasons to believe that wouldn't be the case I'd like to hear them.",
                                    "score": 4,
                                    "author": "Dwight_Ignornt_Slut",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Speaking as a current Penn State grad student, while tuition is quite a bit more (even for in-state students), the local market is not. As soon as you get outside of State College, housing prices plummet to among the most affordable in the nation. Think a nice 3-bedroom house for $725 a month. In State College, though, you can't find a studio for less than $800 a month. I haven't seen anything per bed that is priced less than $400 a month, and most things are $500+ a month.\n\nI think it's a valid argument to say that the BYU housing market is very fairly priced. If you don't like the examples of Stanford and Penn State, take my hometown in Texas -- the University of North Texas and Texas Women's University are not particularly expensive universities, but you'd be hard-pressed to find a shared anything for less than $500 a month. Getting away from college towns, I did an internship in Los Alamos one summer. I paid $600 a month for a bedroom in a house.",
                                            "score": 2,
                                            "author": "geekusprimus"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Even if the Provo student housing is better off than some other student housing markets, the fact is that Provo housing could be even better if BYU students weren’t bound to BYU contracted housing. Let’s not accept crumby housing simply because it’s less crumby than some other locales.",
                                    "score": 3,
                                    "author": "ProdigalPressProvo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm all for improving our housing, but we need to make sure we substantiate our claims with evidence that a large company, like Redstone, who has properties in other locations, won't be able to immediately refute. I think the big thing that needs to be changed with BYU housing is the geographical limit. The pricing for what we have is very fair, but we are limited in *selection*. That's the true negative here.",
                                            "score": 3,
                                            "author": "Tanzan57",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don’t believe we have made any immediately refutable claims. Just because some other student rental markets are more expensive than Provo’s doesn’t mean that BYU students are not overpaying for the quality of apartments they receive. Take a look at non-BYU contracted rentals in Provo and Orem. Campus might not be in walking distance, but there are much cheaper options in the market as a whole.",
                                                    "score": 2,
                                                    "author": "ProdigalPressProvo"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It's cheaper than other college towns, sure, but look at area prices. I moved out of  BYU approved housing without a waiver and am paying wayyyyy less for a private room w/ private bath in a townhome than I was before. When comparing to California prices, of course it will be cheap.",
                                    "score": 2,
                                    "author": "kimjongjuvie"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "1. My last apartment was $280 a month (shared bedroom) with a dishwasher, air conditioning, laundry facilities, and access to a swimming pool. Even including internet and utilities, I never paid more than about $310 a month. The complex was a little older, but it was very well maintained and regularly updated. In fact, I never paid more than $330 a month in rent and utilities for any apartment I stayed at in Provo, and I know a number of people who paid even less for their apartments. It's a pretty well known fact that if you want a pleasant housing experience in Provo, you stay away from the likes of Liberty (overpriced, rundown) and the Village (overpriced, packed with summer sales bros).\n2. Better? Sure. Cheaper? Not usually. There are a handful of complexes very close to UVU that offer competitive rent with BYU housing, but most of the places I see in Provo are still in the $400 to $500 range, even if you cram two people into every bedroom. And if you open up that market to students, I'm sure you'll see prices jump in those areas.\n3. BYU can choose not to renew an off-campus housing contract with a particular complex, but that is literally the extent of their legal authority, and it's more like a slap on the wrist -- as long as the complex keeps their apartments up to snuff, there's absolutely no reason I can think of that they won't get reapproved as suitable off-campus housing.\n4. You won't hear much argument from me here--less competition would mean better prices. But I still haven't seen anything in Provo that suggests apartments are any more expensive than apartments in any other college town.",
                            "score": 6,
                            "author": "geekusprimus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lmao where did you find to live in BYU approved housing for $280?",
                                    "score": 1,
                                    "author": "hnevels13",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The price went up to about $300 for this year, but Alta was $280 for a shared room.",
                                            "score": 1,
                                            "author": "geekusprimus"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know acecdotal evidence isn't real evidence, but I have friends who go to school in California and Colorado who literally pay 2-3 times as much as we do here for their housing for similar contracts. And guess what? A lot of their contracts were also year-long contracts that couldn't be terminated because of COVID. This type of behavior is not unique to the BYU housing market. \n\nIn my experience BYU students love to complain about BYU problems as if they were unique only to BYU when, in fact, they exist at literally every major university (yes, I know this is a huge overgeneralization, but it is true for a lot of things that BYU students complain about).\n\nAlso, even if BYU were to get rid of all of their OCH policies, I bet most students would still want to live close to campus in the same complexes they live in now, and I highly doubt it would decrease rent prices. The reality is that the \"monopoly\" of off-campus housing exists in Provo because of the proximity to campus and the social life of living in a student complex, not because of BYU's policies.",
            "score": 10,
            "author": "U8oL0",
            "replies": [
                {
                    "level": 1,
                    "comment": "I started graduate school at Penn State this year after doing a BYU undergrad. It's in the middle of rural Pennsylvania, where the cost of living is generally quite low... except at Penn State. You can rent a good 3-bedroom house for $725 a month in the town half an hour away, but an (unfurnished) one bedroom apartment in State College without air conditioning is $850.\n\nNo, the problem is not exclusive to BYU.",
                    "score": 8,
                    "author": "geekusprimus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe not but you have the choice of living 30 minutes away if you want better, more cost effective housing at the cost of a longer commute, yeah? BYU students (as you know) do not as a function of OCH policy. Of course supply and demand holds in college towns, just like everywhere else. But BYU students can't move down the distance to price/quality spectrum even if they wanted to without a waiver.",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sort of. You can drive the thirty minutes to class, but you'd better plan to come early to find parking, which is still a twenty minute walk from the main part of campus.",
                                    "score": 3,
                                    "author": "geekusprimus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Trash parking availability (especially after 9AM) and 10-15 minute walks to campus are pretty standard at BYU as it stands now too, albeit less so with lower on-campus volumes re: COVID.\n\nThe point is, if you are OK with the additional commute and time commitment, housing options  open up significantly. My hometown (a public college town) and probably many other college towns share this dynamic. That is literally not an option at BYU without risking a registration hold due to non-compliance.",
                                            "score": 3,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What is the fine for not living in student housing?",
            "score": 3,
            "author": "utahkennedys2020",
            "replies": [
                {
                    "level": 1,
                    "comment": "Living in non-BYU approved housing as a single student can get you in trouble with the Honor Code Office if you don’t get special permission. The trick is to do it anyway and just stomach the $50/semester fine for not updating your address so that they don’t know where you live.",
                    "score": 11,
                    "author": "ProdigalPressProvo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wouldn't try that. If they do check your old address and you're not there, you'll get the $175 fine for not living in approved housing ($25 the first semester, $150 the second) as well as being reported to the honor code office, although I'm not sure what the punishment for that would be. \n\nThe first two semesters in non-approved housing don't affect your standing in school. That would happen at the beginning of the third semester.",
                            "score": 5,
                            "author": "druzhok"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Note: no fine if you’re a grad student. Just FYI. I also had friends list their address as home addresses in the area, even if they didn’t live there (living at home is also an exception). It’s pretty common",
                    "score": 6,
                    "author": "bdjackson5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, the approved housing is, as I understand it, for undergrad single students only.",
                            "score": 4,
                            "author": "Sw429"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do many of the complexes still have a problem where if you move you might end up technically homeless for a week or two in between contracts? That was one of the dumbest things about BYU housing.\n\nI will say though. Even though a lot of things suck, BYU housing is actually still pretty cheap. Most students at other schools pay way more.",
            "score": 3,
            "author": "SEJ46"
        },
        {
            "level": 0,
            "comment": "Will this be published somewhere?",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The full story is a print exclusive in Issue No. 3, which you can order on our website. If cost is a prohibiting factor, feel free to shoot us a DM! We want to keep it accessible.",
                    "score": 7,
                    "author": "ProdigalPressProvo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I thought BYU housing was expensive until I moved out of state for internships &amp; post-grad job in somewhat similar markets. BYU housing is pretty cheap, people were always amazed that I had a single room in college for ~$400. Hop on Rentler and look at comps and you'll see. \n\nSame with the lease requirements too. In Provo you could find shorter leases or by semester like F/W or S/S whereas other cities you'll often only see 12 month leases. \n\nNot saying your analysis is incorrect, just throwing in some anecdotal experience from someone whos lived in a couple other cities as a college kid to compare it too.\n\nYou call for letting the free market regulate itself to benefit students but also call for the university to pressure/regulate suppliers to release contracts when Covid hits? \n\nAnd for regulation that suppliers only offer shortened leases to align with semsters? \n\nWith these additional regulations, Do you expect the current approved housing market to stick with the college market or will we see pivots to a different market like single families, young professionals etc. further suppressing housing supply in Provo?",
            "score": 6,
            "author": "PhilWham",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly. Add onto that, our rent prices will skyrocket as huge companies like Redstone now have to make one year's worth of rent in only 8 months. After they raise their rent, every other sensible landlord will follow suit, and then we will be paying the exact same amount in the course of a year, but now you also have to pay for a storage unit to tuck your stuff into when you go home for summer.",
                    "score": 3,
                    "author": "Tanzan57",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If it was more profitable for complexes to rent fall/winter and spring/summer, then the complexes would still be doing it. At the very least, residents should have the option.",
                            "score": 1,
                            "author": "ProdigalPressProvo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes exactly?? I don't understand if you're disagreeing with my point. They switched to year round contracts because it ensured a steady income throughout the whole year. If they were suddenly required to offer F/W contracts (which would be mostly full) and S/S contracts (which would be significantly more empty), they would charge us much more for the F/W contracts to compensate for the lost revenue during S/S. To avoid jacking up rents and getting everybody angry at them, they transitioned to a 'cheaper,' year round contract model. However if this was no longer an option they would start charging more money for F/W and we would still be losing. So, while a year round contract sucks, I'd rather pay that than have to pay a much higher rent 8 months a year.",
                                    "score": 1,
                                    "author": "Tanzan57",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The complex doesn’t have to make 12 month’s of rent in 8-months because there will still be some renters during the 4-month spring/summer period.\n\nOn a monthly basis, renting in the fall/winter would be more expensive. But renting for 8-months at a premium would still likely be cheaper than renting for 12-months at a lower base rate. Complexes would need extremely high spring/summer vacancy rates before a 12-month contract became cheaper than an 8-month fall/winter contract.",
                                            "score": 1,
                                            "author": "ProdigalPressProvo"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The point was that if BYU is going to require students to rent in a market where supply and demand no longer apply, then they also ought to intervene on behalf of students when something like COVID hits. Otherwise, what real benefit is there to BYU housing rules? BYU says it wants to protect student renters, but when push comes to shove, they stay neutral. \n\nThe BYU housing market was almost exclusively fall/winter and spring/summer as little as three years ago. There was enough housing to go around. \n\nIdeally, BYU would no longer require students to live in BYU contracted housing at all.",
                    "score": 1,
                    "author": "ProdigalPressProvo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Former off-campus housing manager here. Happy to answer any questions or give my input if it helps. I think it’s important to remember that you really can’t blame any one person or entity for the issues in BYU OCH. The properties are third-party managed for the most part and the contracts used are created by BYU. There’s a whole lot at play here, owners, management companies, investors, students, and BYU all play into the issues and need to work together for solutions.",
            "score": 7,
            "author": "Ew_David640",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m curious, which of the problems wouldn’t be solved by BYU removing its requirement for undergrad students to live in approved housing?",
                    "score": 6,
                    "author": "austinchan2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am fully onboard with BYU getting rid of their housing requirements for undergrads. I think it would help fix a lot of the issues all around.",
                            "score": 10,
                            "author": "Ew_David640"
                        },
                        {
                            "level": 2,
                            "comment": "I think we can't really get around the Utah valley housing crunch. People want to be here and growth comes with pain. Supply/demand means rents are likely to continue rising. That being said, let's not make it worse by inhibiting student access to the open rental market.",
                            "score": 7,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;I think it’s important to remember that you really can’t blame any one person or entity for the issues in BYU OCH.\n\nSure you can. You can blame BYU for creating a closed market through their approved housing system. If a landlord decides to rip students off (Which does happen, all the time, I promise you), students don't even have anywhere else to turn. There isn't anywhere else to live. As someone said in another comment, once the good places are filled, the bad places have to be filled. And they are always filled, because there is no competition. That's how I ended up living at Glenwood my first semester after my mission, where I don't think the clubhouse area had been cleaned in years. That's how students end up having nowhere to turn when landlords set quotas for their cleaning checks to guarantee a certain amount of income. Despite what the intentions are, the OCH office doesn't protect against these things, even though that is the intention. \n\nThe existence of BYU approved housing is the problem here. Everyone can see that. It's repeated every time this issue gets brought up on this subreddit. It is the thing to blame. If it disappeared, housing for students would improve tremendously.",
                    "score": 6,
                    "author": "Sw429",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh, trust me. I hate the BYU housing requirement too and fully agree it needs to be abolished. But I think it’s naive to blame every problem with the off campus housing industry on on BYU. Do they play a huge role in it? Of course. But are they solely responsible? I don’t think so (and that’s saying a lot because I have very strong feelings about BYU, and they’re not great.) \n\nI think that the issues are the fault of many - BYU, management companies, and property owners alike. \n\nThere is a lot of misinformation that is spread on this sub, and I think it’s important to address it. I no longer work in off campus housing so I have nothing to lose by talking about this stuff anymore. There are no quotas for cleaning checks, the complexes hate them as much as the residents. In fact we often would lose money because the cleaners were insanely expensive. We had one move in where we spent 21k on cleaning and we most definitely did not cover that in charges to the residents. BYU requires cleaning checks for contracted housing and it sucks all around. \n\nAlso, many complexes struggle to fill. Glenwood is still not filled and I know of many complexes (some of the Liberty props included) that struggle to fill. Lib Square is an anomaly, and that’s because people want to live there and will pay higher prices to do so. Most complexes run lots of specials and concessions at the end of the summer for that reason - they need to fill and have trouble doing so. So this whole idea that there’s a monopoly and that all the complexes can charge more because there are more BYU students than beds is just not correct.  Not trying to be disagreeable, it’s just fact. Again, I have many many of my own gripes with BYU and the management/owners of some of the complexes. But there’s a lot more to this than most students realize.",
                            "score": 2,
                            "author": "Ew_David640",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just a point of clarification, I’m not sure where you’re getting your data on vacancy at the Liberty complexes. The Liberty’s are at least partially owned by MHE Real Estate, and the MHE website boasts 100% occupancy in all three complexes.",
                                    "score": 4,
                                    "author": "ProdigalPressProvo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "A couple thoughts on that: A) most management companies want the narrative to be that their properties are 100% occupied at all times. It helps their property values and word of mouth advertising.  B) it’s quite possible they are currently 100% leased right now, but that doesn’t mean they were 100% by the beginning of fall semester. Especially with the updated BYU lease that allows for 120 days notice for early termination if you’re getting married, going on a mission, have an internship or are in the military. \n\nBasically, just because they reported 100% doesn’t mean they actually are.",
                                            "score": 5,
                                            "author": "Ew_David640"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Sorry, I didn’t answer your question. I have access to direct info from the properties because I have close contacts at many of them.",
                                            "score": 2,
                                            "author": "Ew_David640"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Every rental market has operating companies and investors, although we address those issues in more depth in the unabridged version. The reality is that BYU has developed a system where student renters are forced to choose from a small pool of BYU-approved landlords. As a result, landlords are almost guaranteed renters, which eliminates the incentive for many complexes to offer lower rent or better conditions.  \n\nJust compare the student housing options for BYU students against the student housing options for UVU students. If BYU creates the contracts, then they should modify the contracts to ban 12-month rental agreements.",
                    "score": 7,
                    "author": "ProdigalPressProvo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You definitely have a point, but about 40% of the renters in BYU off campus housing are UVU students or students of other schools. \n\nIve managed properties when they offered 8 month leases and when they switched to 12 month. The reality is that longer leases are cheaper. Even when we offered 8 month leases most people opted for a 12 month lease because it’s cheaper. \n\nI definitely agree that BYU needs to step up and stop trying to pass the buck. They could have clarified the 23b clause in THEIR contract but refused to do so even when asked to. As you said, they are trying to shift responsibility for the problems of the market they created.",
                            "score": 5,
                            "author": "Ew_David640",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What is your source that 40% of total BYU off-campus housing is taken by UVU students? Also, if that were true then it would actually compound the situation because there would be MORE students trying to live in BYU housing. In fact, there would be a deficit between the number of available beds and the number of unmarried students seeking housing.\n\nCould you elaborate on the 8-month vs 12-month cost difference? The Liberty complexes reported high vacancy rates in the spring/summer before the shift to 12-month contracts, and now they boast 100% occupancy year-round.",
                                    "score": 5,
                                    "author": "ProdigalPressProvo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I also just want to add that I think it’s great that you’re working on this. The students could use some advocates and like I said, I am happy to contribute what I can :)",
                                            "score": 4,
                                            "author": "Ew_David640"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Absolutely! As a side note I want to be clear that I’m not here to antagonize but to help because I agree that something needs to change. I just don’t think it’s as simple as a lot of people seem to think. \n\nMy source on the 40% number is my personal experience as the manager of 4 different off campus housing complexes in Provo. Every single one would not be full without UVU students coming in. Honestly I would have loved for BYU to get rid of the housing requirements all together. It would make my life sooo much easier in many aspects. It costs a lot of money to get a property to where it meets all of BYU’s requirements and that of course gets passed on to the residents. \n\nI often compare the housing leases to a car lease. It’s pretty straight forward - if you lease a car for 5 years instead of 3 your payment will be less because it’s spread over a longer period of time. It’s the same with housing contracts. \n\nAlso, if the complexes offer 8 month leases they will need to cover their costs for the summer months by increasing costs for shorter leases. You can’t expect the complexes to take losses over the summer and not try and make up for that somehow. It is after all a business and yes, the goal is to make a steady income like any other business.",
                                            "score": 5,
                                            "author": "Ew_David640",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I kind of disagree here from my experience. I lived in a small complex run by some old people, rent was $275 per month in fall/winter and went down to $135 in the spring/summer with semester contracts. After I left they were bought by redstone and the prices were bumped up to around $350 with year round contracts. They painted the building and did some general remodel. But it didn’t change the fact that the rooms were still shared and tiny and could only fit bunk beds. I had considered moving back but didn’t, instead I found another mom and pop complex with semester contacts and cheap rent, it’s probably one of the last ones in Provo too.",
                                                    "score": 4,
                                                    "author": "butt-hole-eyes",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "First off, your username is hilarious!\n\nFor sure the small, mom and pop places are usually going to be cheaper. In my own experience as an owner of my own rentals and as a third party manager, many things play into price. I was paying $350 a month for a 2 bedroom apartment simply because the owners were an older couple and hadn’t looked into local pricing and never bothered to raise the rent over many years. \n\nIn your example for instance, it’s quite possible that the first ownership had the property paid off or their mortgage was significantly lower than Redstone’s mortgage when they purchased it (assuming they purchased it and didn’t just take over management). Also, when a third party management company is hired the owner then has to pay management fees and may need to raise rent to cover those. \n\nOf course I don’t know the exact situation of the complex you’re referring to, but those are just some things that could have led to the increase in prices. Management companies aren’t going to come in an arbitrarily raise prices, they need to stay competitive to lease the units and do extensive market research to come up with rates.",
                                                            "score": 1,
                                                            "author": "Ew_David640"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t know about other university towns but in the real world no landlord offers Fall/Winter leases only. Almost every place you live requires a one year lease. You can guarantee that if off campus housing is required to start offering Fall/Winter contracts then prices will go up to cover the loss of income for Spring/Summer.\n\nBecause BYU had no real legal authority over off campus housing, they couldn’t really force landlords to let students out of their contracts. This definitely wasn’t a BYU exclusive problem, it happened all over the country. It even happened up north at Utah State. I know people that went home but continued having to pay rent.",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The idea behind the post is that if BYU is going to require students to live in BYU contracted housing, then BYU contracted housing should offer special protections to students--like the option to choose fall/winter or a 12mo contract. Prices would go up during the fall/winter term, but it would likely be cheaper to rent for 8-months at a premium than 12-months at the current rates, if Provo history is any indicator.\n\nAs far as releasing students from contracts during COVID, our argument is that BYU could have threatened to rescind BYU approval from complexes that are not flexible with students who need to get out of their contracts. \n\nBasically, if students can't gain access to the open market, then BYU should do more on behalf of students to compensate.",
                    "score": 1,
                    "author": "ProdigalPressProvo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m sure you know this already but landlords do not care who lives in their complexes. I was not a student living in a BYU approved complex. I knew several others that were the same. The landlords I’m sure communicate with one another and they know that BYU can’t rescind BYU approval from all of them. While BYU would like to have more control they really have none at all.\n\nThe situation with COVID was unfortunate but it was like that throughout the country (as well as in many parts of the world). Just because COVID hit shouldn’t require any landlords to release students from their contracts. Landlords have had enough of a problem when the government forced them to not be able to evict anyone.\n\nBYU will also never be able to keep monopolies from happening. They have no legal status to keep a company from buying up a lot of the properties. The same thing happens in if they lose their BYU approval then there’s not enough approved housing to go around. \n\nThe landlords will always have the power over BYU when it comes to major issues that affect the entire market or situations like COVID. The only time BYU will have control is if one complex decides to no longer segregate students. \n\nThe other issue that I see is that this only affects people for 2-3 years. Very few students deal with this for all 4 years. Most will live on campus for a year, live with family, transfer or drop out of school, or get married prior to dealing with off campus housing all 4 years. Trying to get anything to happen will take more than several years in my opinion. Therefore most students will just deal with it and move on with their life rather than fighting for change long after it no longer affects them. \n\nThe only way any of this changes is for BYU to no longer require living in approved housing.\n\nIf you want to continue to fight for students long after it affects you then more power to you. The chance of getting students that will really say or do much past the time it affects them will be minimal at best. Look at the protest regarding the Honor Code. They got maybe 100 people to walk around with signs for an afternoon and that was it. Most students are too busy with class and work and dating to deal with most of these issues. I mean the whole beard issue and shorts at BYU-I hasn’t been able to be changed and the issue with housing is a whole lot bigger than those. Good luck but I think you’re fighting a losing battle.",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I read recently that Redstone controls something like 80% of the BYU housing market and by property value is the fifth largest management company in the United States. Sounds like a regionally-locked monopoly to me.",
            "score": 2,
            "author": "reasonable_doubt1776"
        },
        {
            "level": 0,
            "comment": "I wouldn't count on BYU changing. You need to get the city on your side and have them start pressuring BYU or raise the standard of local code.\n\nOne thing to do is also to just start your own rental company, non-profit, or co-op and improve things. Doing research and acknowledging problems is great, but you have a lot of power to change it if you are willing to put in the work. Most (including myself) were not and just wanted to get an education and get out.",
            "score": 2,
            "author": "thebigmugamba"
        },
        {
            "level": 0,
            "comment": "This is great reporting.  I lived at the Elms (Liberty on 8th) in the late 90s and it was a dive then. \n\nI feel bad the poor part of my otherwise solid experience at BYU has become worse for current students.",
            "score": 2,
            "author": "mclintonrichter"
        },
        {
            "level": 0,
            "comment": "I get where you’re coming from with letting students out of contracts. But these apartment owners and management companies have bills too. How would they pay their employees, maintenance bills, insurance, and mortgage, if they had no income for months on end?",
            "score": 2,
            "author": "50stev",
            "replies": [
                {
                    "level": 1,
                    "comment": "Between landlords and student renters, I think BYU should favor student renters. A real estate investor with four apartment complexes in Provo isn’t going to go hungry if a few tenants are released from their contracts. Redstone Residential actually received $2-5m in PPP loans (which are effectively grants). Aspen Ridge received a few hundred thousand. \n\nThe mom-and-pop landlords that own a unit or two are a different story, and I think a balance would need to be struck.",
                    "score": 1,
                    "author": "ProdigalPressProvo"
                },
                {
                    "level": 1,
                    "comment": "It's simple, they raise the rent so that they get their projected yearly worth in the F/W contracts they are now required to offer. That way any S/S contracts they do manage to sell are just bonus money.",
                    "score": 1,
                    "author": "Tanzan57"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Suddenly all the people hating on Prodigal Press are converted to the cause",
            "score": 2,
            "author": "WiJaMa"
        },
        {
            "level": 0,
            "comment": "My first semester I filed a document with OCH saying I was living with family (my uncle) in Salt Lake due to hardship. It cost me $20 for approval, then I rented a basement in Provo with a mission companion.\n\nLived there over a year with no issue!",
            "score": 1,
            "author": "jjjjjjjjjj12"
        },
        {
            "level": 0,
            "comment": "Amen amen amen. \nAs a potential landlord looking buy an apartment or condo to rent out to myself and other students, the BYU codes and Provo city bylaws seem custom made to give a monopoly to shady massive companies",
            "score": 1,
            "author": "taycroft99"
        }
    ]
}