{
    "id": "pz7kv3",
    "score": 151,
    "title": "Line into the testing center yesterday afternoon, about a 75 minute wait",
    "author": "Scratchcube",
    "date": 1633093483.0,
    "url": "https://www.reddit.com/r/byu/comments/pz7kv3",
    "media_urls": [
        "https://v.redd.it/3s8pqhwu7uq71"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I have my first midterm next week and I'm so glad its in class.  Is this because of staffing issues, or covid spacing?",
            "score": 38,
            "author": "Dyllbert",
            "replies": [
                {
                    "level": 1,
                    "comment": "definitely not COVID spacing, it was packed in there",
                    "score": 29,
                    "author": "Scratchcube",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "COVID has been over in Utah since like June 2020. I just graduated USU this past May. Pretty much everyone is a Trumpee and thinks it’s all a big joke from what I saw.\n\nJust realized no one is wearing masks in this video either lol",
                            "score": -9,
                            "author": "Educational-Seaweed5",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The 7-day average for new cases in Utah is over a thousand still, so I'm not sure what you mean by \"COVID has been over in Utah since like June 2020.\"",
                                    "score": 9,
                                    "author": "theangriestant",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The tone of their post is exasperated and mildly sarcastic. They aren’t saying they think the pandemic is over.",
                                            "score": 7,
                                            "author": "xiao-rui-an"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Did you not actually read my post? Because I explained that.",
                                            "score": 0,
                                            "author": "Educational-Seaweed5",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don’t think you know what the word “explained” means.",
                                                    "score": 6,
                                                    "author": "Dr0n3r"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I didn’t realize what sub this was in until now, but it’s almost unfathomable that people are claiming not to have understood your point.",
                                                    "score": 5,
                                                    "author": "[deleted]"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You may want to rephrase then, because you literally said covid has been over since June 2020. Maybe you're missing a critical negating term? Perhaps covid has been raging since June 2020?",
                                                    "score": 3,
                                                    "author": "theangriestant",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They meant that people stopped following masking recommendations and social distancing around that time.",
                                                            "score": 8,
                                                            "author": "boboddybiznus"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Missing word: “COVID has been ALL over Utah since May 2020.”",
                                                            "score": 4,
                                                            "author": "ParticularPenguins",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Ahh, I think you're correct. That would make much more sense.",
                                                                    "score": 0,
                                                                    "author": "theangriestant"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "yeah I'm pretty sure % positive is literally worse now than in it was in June 2020 lol",
                                            "score": -1,
                                            "author": "Fruit_Monger"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Shut up",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think people are missing the /s of that first sentence by not reading the rest of the comment. \n\nRead, people. REEEEAAD.",
                                            "score": 2,
                                            "author": "Educational-Seaweed5"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Neither; that's just what midterm season at BYU looks like. You should always plan to go early in the mornings, right after devotional, or another off-peak time.",
                    "score": 39,
                    "author": "geekusprimus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've been at BYU for 6 years now (undergrad and now graduate school), and it normally is not this bad this early.",
                            "score": 26,
                            "author": "Dyllbert",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Uhhhhh yeah it’s never this bad. During finals week maybe, not for midterms",
                                    "score": 16,
                                    "author": "ElTigre-5"
                                },
                                {
                                    "level": 3,
                                    "comment": "I guess that's fair. Between the different dynamics at my graduate school and the fact that September has seemed so unbelievably long, I guess my timing for how things at BYU run may be off.",
                                    "score": 5,
                                    "author": "geekusprimus"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I agree that it always looked like this when I was a student.",
                            "score": 2,
                            "author": "someseeingeye"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I usually only see this at finals. Perhaps they can't open all the overflow due to their lack of staff?",
            "score": 16,
            "author": "Sw429",
            "replies": [
                {
                    "level": 1,
                    "comment": "I went through that line yesterday! The overflows were open and it was pretty full but it wasn't too hard to find a seat. I think the main issue is that there just isn't enough staff to check people in. They were getting each person that survived the line and got to the desk through in about a minute and that's pretty fast, but considering that there were 300 of us and only 3ish desks open at any given time the wait still built up to about 90 minutes when I was there.",
                    "score": 6,
                    "author": "atheistossaway",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Makes sense. If they can only process a person a minute, that definitely is the bottleneck. Usually they have all four check-in stations running at peak hours, so this would really limit it.",
                            "score": 2,
                            "author": "Sw429"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The. They should pay $20-30/hr for this position to get enough people on staff. It isn't right to waste hundreds of students time because they only want to pay 12/hr and only 3 desperate students want to take the job for that low wage.",
                    "score": 5,
                    "author": "rtowne"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Boy am I glad I finished my GEs and that my major doesn't do Testing Center stuff.  I salute these students.",
            "score": 9,
            "author": "MissingLink000"
        },
        {
            "level": 0,
            "comment": "Nothing new here. \n\nhttps://youtu.be/RLz8n_jv9kU",
            "score": 19,
            "author": "Roughneck16",
            "replies": [
                {
                    "level": 1,
                    "comment": "I remember sitting inside the Pendulum Court in the ESC working on a take-home final on a snowy December day, looking out the window, seeing the line for the testing center stretch out past the Kimball Tower, and getting this warm, fuzzy feeling inside because I *wasn't* in that line.",
                    "score": 20,
                    "author": "geekusprimus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;a take-home final \n\nWhy do professors assign those?!?\n\nThey're practically asking students to cheat.",
                            "score": -15,
                            "author": "Roughneck16",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It was open note, open book. Just wasn't open person.",
                                    "score": 13,
                                    "author": "geekusprimus"
                                },
                                {
                                    "level": 3,
                                    "comment": "Depends on what you're testing students on. Are you testing them on their ability to remember random facts, or to apply those facts and techniques in a way that demonstrates mastery of the material? \n\nThe real world is a take-home test. We have access to all the information, but we need to employ it. For many subjects, a take-home test is harder for the professor to write, but worth more.",
                                    "score": 10,
                                    "author": "Newcago"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Love this!",
                    "score": 2,
                    "author": "Scratchcube"
                },
                {
                    "level": 1,
                    "comment": "It looks like this was taken during a finals week. The line shouldn't be this bad for the midterm season. BYU did say that the Testing Center was changing its operating hours because they are short-staffed. I am guessing this massive line is due to the same issue.",
                    "score": 4,
                    "author": "ForTheLoveOfBYU"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is what happens when a bunch of sophomores spent their freshman year without ever going to the testing center and then freshman and sophomores both have to learn the hard way how much the testing center sucks",
            "score": 6,
            "author": "RowBowBooty"
        },
        {
            "level": 0,
            "comment": "I've always seen the line snake towards the Kimball Tower, never towards the Maeser Building. Oh how times change.",
            "score": 5,
            "author": "U8oL0"
        },
        {
            "level": 0,
            "comment": "I graduated five years ago, and even then I always felt like the testing center was too small. \n\nTime for an upgrade?",
            "score": 6,
            "author": "supernovamike11",
            "replies": [
                {
                    "level": 1,
                    "comment": "supposedly its one of the biggest testing centers in the nation..maybe just get rid of the outdated model of locking students in a room and forcing them to binge and purge random facts.",
                    "score": 33,
                    "author": "Sviribo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even better. So much better.",
                            "score": 13,
                            "author": "supernovamike11"
                        },
                        {
                            "level": 2,
                            "comment": "EXACTLY. What's the point of memorizing a bunch of random crap about art history and then forgetting most of it in 2 days? There isn't one (except for grade statistics). Neither is there a point to memorizing 50 mathematical theorems to use on an advanced math test. \n\nThe best courses I've taken don't lock you in the testing center but give you a take-home test or paper or project that test your ability to use the stuff you've learned. No point in wasting everyone's time by making them memorize everything",
                            "score": 2,
                            "author": "wetballjones"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Too bad that would mean hiring more staff to proctor, and they apparently can't afford that.",
                    "score": 8,
                    "author": "Sw429",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Literally why need a proctor. Never in the real world will we need to regurgitate information without resources. So why not just get rid of proctored exams?",
                            "score": 6,
                            "author": "eladhannah"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I went to Rick's in the 70s. I hated the testing center.  No limitations on how long a test could be, how long it took to complete and really no rules about what content the test covered. Transferred to a public university. There were rules around testing especially mid-term and final exams. No testing center. Was way bettet.",
            "score": 2,
            "author": "freebikeontheplains"
        },
        {
            "level": 0,
            "comment": "So I went to BYU and the testing center was the only thing I knew so I figured it was normal. Then I went to grad school and have now taught at three different universities and I’ve never seen anything like this. When I give a test… I just give it class. That’s the way it’s supposed to be. I don’t understand why BYU does the testing center thing.",
            "score": 1,
            "author": "Harmonic7eventh"
        },
        {
            "level": 0,
            "comment": "With online options like proctorio we shouldn’t even take tests like this anymore.",
            "score": 0,
            "author": "Acrobatic-Cupcake-34",
            "replies": [
                {
                    "level": 1,
                    "comment": "Who even needs Proctorio? (for ethical reasons the answer is nobody). Just design online or take home tests to be open note, no proctoring.",
                    "score": 8,
                    "author": "Simply_Epic"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The testing center is so controversial",
            "score": 1,
            "author": "byuboi"
        },
        {
            "level": 0,
            "comment": "https://testing.byu.edu/forecast\n\nUse this when plan into when to take a test. It is a forecast of how many people will be taking a test. Busiest times are always 1-6pm",
            "score": 1,
            "author": "Wellllby"
        },
        {
            "level": 0,
            "comment": "Guess you should have gone when the rest of us all went",
            "score": 1,
            "author": "WHATSupGoofBall"
        },
        {
            "level": 0,
            "comment": "There was one time during finals week that the like was past the JFSB and the testing center was only supposed to be open for a couple more hours. They ended up having to keep the testing center open for a few more additional hours so that students could take their tests.",
            "score": 1,
            "author": "lopachilla"
        },
        {
            "level": 0,
            "comment": "It's not fun or convenient. And the actual experience once you get in there isn't great either. But waah! If that's your worse complaint for receiving a world class education with a spiritual component and a 1/3 tuition scholarship from tithing, then you are doing all right. I had lots worse things to deal with than the ug! Testing center. I also believe that I am the only student who lost their pillow in the study room at the testing center. Yeah. Left my pillow. Well you know--sometimes you need a nap first.",
            "score": 0,
            "author": "23854855"
        }
    ]
}