{
    "id": "wb9s0b",
    "score": 6,
    "title": "How safe are bikes on campus?",
    "author": "jhnngu",
    "date": 1659113479.0,
    "url": "https://www.reddit.com/r/byu/comments/wb9s0b",
    "media_urls": [],
    "other_urls": [],
    "postText": "Would a nice ebike be stolen? What locking measures do I need to take?",
    "comments": [
        {
            "level": 0,
            "comment": "Yes, even normal bikes are periodically stolen on campus. You should use an appropriate lock to keep it safe and register you bike with BYU Police as all bikes ridden on campus are required to be registered. [https://bike.byu.edu/](https://bike.byu.edu/)   \n\n\nI'd research the best lock options you have because you don't want to be riding a $2K bike and locking it up with a $20 lock.   \n\n\nThis isn't to say that students are going to steal your bike but there are a lot of people who cross campus and may take advantage of the trusting nature of folks at BYU.",
            "score": 19,
            "author": "True-Grab8522",
            "replies": [
                {
                    "level": 1,
                    "comment": "All bikes used in Provo need to be registered (licensed), not just the ones on campus. I don't know how much it actually helps with bike theft but it's the thought that counts I guess.\n\nhttps://www.provo.org/provo311/licensing/bicycle-license",
                    "score": 4,
                    "author": "Brutal_Muffin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Iirc the registration of bikes has less to do with stopping theft and more to do with giving you a chance of finding it again if it is stolen. There are also national registries you can register your bike into for similar purposes.",
                            "score": 2,
                            "author": "Dyllbert"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I rode my bike around BYU for 4 years and never had issues, just lock it up with a good quality bike lock. Don't leave it locked up in the same spot for weeks at a time. If you are really worried you could put a gps tracker on it. You might consider keeping it in your apartment at night because it's more likely to get stolen outside your apartment in the middle of the night than it is during the day locked up on campus with crowds of people walking past regularly.",
            "score": 18,
            "author": "tenisplenty",
            "replies": [
                {
                    "level": 1,
                    "comment": "This comment has the best advice.",
                    "score": 3,
                    "author": "shinerlilac"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would double lock with a  wrapped chain and a d/u-lock. The d/u-lock (if it's good) would pretty much need an angle grinder to get through and the chain is good for locking the components and is more annoying with an angle grinder since it can bounce around. That's the most safe but you can decide how secure you want it. With an e-bike weight is less of an issue so I figured you might want to go all out.\n\nLike others have said, bike security is probably a bigger concern at your apartment at night. That's where my bike was stolen from with only a chain lock. Now I have my new bike in the apartment at night and locked with a chain while at school.\n\nMake sure to register your bike with byu/provo!",
            "score": 4,
            "author": "Brutal_Muffin"
        },
        {
            "level": 0,
            "comment": "Aside from safety concerns about being stolen you should know drivers in Provo aren’t great at watching for bikes (or pedestrians). \n\nSource: I was hit by a minivan in the RB parking lot /road out of there, and had several of other close calls.",
            "score": 2,
            "author": "VforValmont"
        },
        {
            "level": 0,
            "comment": "My brother and I we just started going campus on bikes, we invested on good ones so we’re also kind of scared, but U-lock is pretty safe. Also, I used the parking spot in the middle of the campus, it has a camera and it’s next to BYU police, so I feel safe there. Oh yeah, don’t forget to register it. It’s free!",
            "score": 2,
            "author": "Key-Conclusion-3897"
        },
        {
            "level": 0,
            "comment": "There’s a recent post on this page about bikes being stolen",
            "score": 1,
            "author": "A-LittleBitAlexis"
        }
    ]
}