{
    "id": "x6kp1h",
    "score": 0,
    "title": "A video is worth a million words - The term \"family friendly\" is not among those words",
    "author": "atari_guy",
    "date": 1662395890.0,
    "url": "https://www.reddit.com/r/byu/comments/x6kp1h",
    "media_urls": [
        "https://cassandrahedelius.substack.com/p/a-video-is-worth-a-million-words"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Video angles weren’t particularly good but none of the dancing seemed more sexualized than the some of cougarettes dance numbers but perhaps those scenes didn’t get filmed. Not that I read the blog more but I hope that the blogger devotes equal time to all groups dancing which “offends” the spirit.",
            "score": 34,
            "author": "True-Grab8522",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; I hope that the blogger devotes equal time to all groups dancing which “offends” the spirit.\n\nLol, you've given me flashbacks to Daily Universe editorials I remember reading twenty years ago. I recall one gem complaining about the immodest uniforms worn by the swim team.",
                    "score": 3,
                    "author": "Onequestion0110",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes 100% that’s exactly what the blog post sounded like. I wonder if she(I’m making an assumption there) wrote those editorials back in the day.",
                            "score": 2,
                            "author": "True-Grab8522",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I remember reading those and laughing. \n\nIn hindsight, I dunno how I should have responded, but I feel like I should have taken some of those attitudes more seriously. \n\nModesty complaints taken way to the extreme, complaining about caffeine-free Pepsi adds in the Marriot center, making it into an honor code violation to own playing cards, etc. I wish I'd been a bit more able to recognize extremism when I was there.",
                                    "score": 2,
                                    "author": "Onequestion0110"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is the author completely unaware of other sexualized forms of dance like swing, tango, samba, foxtrot, cha cha, hip hop, cheer, etc etc?",
            "score": 26,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "And that second video was amazing.  Just dropping in the position the performer did is extremely difficult.",
                    "score": 1,
                    "author": "thatgayguy12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Watching all three videos, I have to sincerely wonder what Cassandra is offended by?\n\n- Costumes are not overly revealing.\n\n- Dance is no more sexual than cheerleaders or dance teams at BYU sports events \n\nStandards were reviewed with Provo PD in advance and complied with. \n\nDon’t like drag shows?  DON’T ATTEND!\n\nIt was Lucifer’s Plan to force all to follow the rules, right?  Did you forget that?  Seems that little tidbit is lost on some.\n\nAlso, nice to see the Mormon protestors aligning with the Proud Boys and Patriot Front, who were standing with you in protest.  Nice company you are keeping these days…",
            "score": 27,
            "author": "swennergren11",
            "replies": [
                {
                    "level": 1,
                    "comment": "I haven't watched BYU cheerleaders in a while.  Do they roll around on the ground with their legs spread?",
                    "score": -1,
                    "author": "CountrySingle4850",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They usually are in the air but yes they spread their legs quite often.\n\nSince the destroyer doesn't ride on the face of the ground or the air I'm not sure the difference in location is material, doctrinally speaking.",
                            "score": 6,
                            "author": "LittlePhylacteries",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Haha. Don't get me wrong.  I have been at Suns games with my wife 10 feet from the dancers and it was uncomfortable to say the least.  Some dancing is more sexual than others.  I would imagine a cheerleader doing the splits in the air would be titillating to some, but doing it on the ground for prolonged poses is a step further. If you are saying all such public dancing should be less overtly sexual, I would second you.",
                                    "score": 0,
                                    "author": "CountrySingle4850",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Help me understand something. Did you attend the drag performance? If not, did you willingly watch a video of the drag performance?\n\nWhat exactly is your objection here? Should people be allowed to participate in a legal activity in public, even if it's one you personally disapprove of?\n\n&gt; If you are saying all such public dancing should be less overtly sexual, I would second you.\n\nI did not say that. And I'll thank you kindly to not put words in my mouth.",
                                            "score": 3,
                                            "author": "LittlePhylacteries",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I am specifically arguing the point that what I saw from the drag show was substantively different from what I've seen of BYU cheerleaders.  The clip of the Cougarettes i just saw did nothing to change my mind.",
                                                    "score": 0,
                                                    "author": "CountrySingle4850",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "So let's grant that they're different to move the discussion forward. Now what? It was a legal activity in public space, right?",
                                                            "score": 2,
                                                            "author": "LittlePhylacteries",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yes, perfectly legal.  I think finding common ground is a start,  followed by drawing some distinctions.  Drag shows are fine.  I won't be taking my kids to one but noone cares.  Where I would draw a line would be advertising for aforementioned show under the guise of BYU or church approved materials.",
                                                                    "score": 2,
                                                                    "author": "CountrySingle4850",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "And the reason you want to draw that line is?",
                                                                            "score": 2,
                                                                            "author": "LittlePhylacteries",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I picked that issue because of the recent kerfuffle over the student packet.  There are hundreds of lines that society needs to draw to one extent or another.",
                                                                                    "score": 1,
                                                                                    "author": "CountrySingle4850",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Whatever a person might think/feel is sexually suggestive in a dance routine should probably be calibrated against baseline dance routines from the BYU cougarettes (who are quite talented):\n\n* [ BYU Cougarettes D1A NDA Hip Hop National Champions 2022](https://www.youtube.com/watch?v=I9Fqg3ynOXM)\n* [BYU Cougarettes 2021 D1A NDA National Hip Hop Champions](https://www.youtube.com/watch?v=ssbW0m-A2ZY)\n* [BYU Cougarettes - 2021 timeout routine](https://www.youtube.com/watch?v=w_Oy-NQbG3k)\n\nHere's the first few I came across (I'm not even cherry-picking), but they post most of their routines online.\n\nIn general, good dance often incorporates things like hip thrusts and \"legs spread\".  This statement might offend the author of the posted article, but I'll say it anyway: humans *have hips and they are also sexual beings*.\n\nThere's obviously some element of cultural subjectiveness in what is regarded as overtly and implicitly sexual, but almost all dance forms (ballroom, swing, tango, hip-hop, modern) include elements that might be viewed as sexual from an ultra-sexually prude-ish perspective.  From a dancer's perspective (my wife danced in HS) legs and hips are just part of the toolbox of expression.  I concede that there is a continuum of sexual suggestiveness in dance, and I also concede that there are lines over which a dance might then become completely sexual and/or obscene according to accepted conventions of expression.  But are only straight people allowed to use the basic toolbox in their expression?  Are trans people not sexual beings with hips, too?\n\nFor the record, based on the videos posted, I would not have felt uncomfortable at all with my youngest children there (youngest daughter is 10 and youngest son is 12).  To me, that was within the scope of \"family friendly\".  I acknowledge that people can disagree on what constitutes family friendly--for instance, there are all kinds of stories in the Bible and Book of Mormon that are not \"family friendly\" that children should be protected from (e.g., human sacrifice, beheadings, cannibalism, forced circumcision, rapes, incest, genocide, etc, etc, etc).\n\nIf Cassandra Hedelius were also writing articles about the sexual nature of the BYU Cougarette dance routines, then we'd know she just has different ideas about what is appropriate dance expression in public.  Lack of outrage towards the Cougarettes suggests trans-phobia (driven by her religious ideology) as the ultimate root in this particular case [and I'm not saying anything surprising since her article explains her rationale].  It's not about the dance or its level of sexuality: it's about who is performing the dance.",
                            "score": 3,
                            "author": "bwv549",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This comment brought a tear to my eye. Thank you kind redditor.",
                                    "score": 3,
                                    "author": "LittlePhylacteries"
                                },
                                {
                                    "level": 3,
                                    "comment": "cc /u/atari_guy",
                                    "score": 2,
                                    "author": "bwv549"
                                },
                                {
                                    "level": 3,
                                    "comment": "Saved. Outstanding comment.",
                                    "score": 2,
                                    "author": "Stevenrushing"
                                },
                                {
                                    "level": 3,
                                    "comment": "I took a minute to watch your first Cougarettes clip. First of all, they are much more talented than the dude I saw in the 20 second clip from the drag show. Second, I saw little to nothing sexual from the Cougarettes. They were fast athletic movements. The dude slowly writhes on the ground and it is very sexual. He probably loses points from me for being a dude dressed like a woman, but I will own my bias there.",
                                    "score": 1,
                                    "author": "CountrySingle4850",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You didn’t see anything sexual *to you.* You are probably very used to women doing these kinds of hip hop routines and so it’s normalized for you. \n\nThe drop move that the drag performer did is difficult to do and impressive in its own right.",
                                            "score": 3,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, that last move in the second video is quite difficult. \nIt takes a lot of training, stretching, and practice. It is not sexual in my opinion.  I'm just impressed.  \n\nTry dropping immediately on the floor in that position like she did.  99% of people would end up in the hospital.",
                                                    "score": 2,
                                                    "author": "thatgayguy12"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "* [Here is a video](https://www.youtube.com/watch?v=3IhAQ_1JGLk) of a an LDS Missionary \"Freestyle Dancing\" in the New York City.  According to whomever posted it, this is \"build[ing] Connections with God-Given Talents.\"  This video is **NOT** *age restricted*.\n* [Here is the performer \"Sheri Don't\"](https://www.youtube.com/watch?v=SpL8OwRxYbo).  [The article](https://cassandrahedelius.substack.com/p/a-video-is-worth-a-million-words) describes this performance as \"pointless gyrating [that] was nothing more than misogynistic scorn for a beloved woman and church leader.\"  In any event, whomever posted the video thought that it deserved to be *age restricted*.",
            "score": 3,
            "author": "bwv549"
        },
        {
            "level": 0,
            "comment": "Lol, u/atari_guy really is out here thinking everyone’s “reading comprehension” is the problem.",
            "score": 27,
            "author": "larboy332",
            "replies": [
                {
                    "level": 1,
                    "comment": "And he went and deleted all his comments about as soon as he realized what everyone else's opinion was.",
                    "score": 5,
                    "author": "Onequestion0110"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"His open legs and shimmying were obviously sexual, evoking the pornographic cliche of a woman eager to be violated.\" \n\nYIKES. So much rape culture in one sentence. How is this not satire??",
            "score": 13,
            "author": "oxemenino",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol, for someone accusing everyone else of having reading comprehension problems you really missed the point of that comment.",
                            "score": 9,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't see anything wrong in those videos. It's just a bunch of beautiful people having fun and expressing themselves. None of you guys would have a problem with this if it was the byu cheer squad doing the same moves.",
            "score": 19,
            "author": "TreehouseInAPinetree"
        },
        {
            "level": 0,
            "comment": "That's the most disgusting article I've read in a while. It's amazing how much contempt and hate some church members hold for their brothers and sisters who have to deal with trials they never asked for.",
            "score": 35,
            "author": "h_allover",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was really hard to read. As a gay byu student I constantly feel out of place, unloved and not respected…",
                    "score": 7,
                    "author": "ZinkGaming314"
                },
                {
                    "level": 1,
                    "comment": "&gt;It was sick and disgusting and made my insides churn!\n\n&gt;all lovely people though 🥰",
                    "score": 3,
                    "author": "samwyatta17"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -27,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "OP, you get very defensive when people don’t agree with you.  That’s going to continue to be a problem for you.  Everyone else isn’t always wrong, my friend, nor is it in their inability to read…",
                            "score": 17,
                            "author": "swennergren11",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": -3,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I got plenty out of the article that was clearly there.\n\n- Bigotry toward LGBTQ+ community \n- Bias against that same group\n- Fear of things the writer in uninformed on\n- Assumptions that filled in many unknowns\n- Lack of Christlike Loveo",
                                            "score": 6,
                                            "author": "swennergren11",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": -3,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh I got the point very well indeed.  Bigoted writing is pretty obvious to pick out.  \n\nReally should heed Russell Nelson’s advice and show love and kindness, not politicized and half-truth attacks…",
                                                            "score": 6,
                                                            "author": "swennergren11"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": " I read the whole article my guy",
                            "score": 21,
                            "author": "h_allover",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": -21,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Apparently being Christlike and kind is a lost art",
                                            "score": 26,
                                            "author": "-lonely_rose-"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Try to use constructive criticism next time if you disagree with somebody. Insulting somebody like this rarely has a good effect.",
                            "score": 6,
                            "author": "mixelydian"
                        },
                        {
                            "level": 2,
                            "comment": "Say you’re scared without telling me you’re scared.",
                            "score": 4,
                            "author": "CountMC10"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"I’m very choosy about PG and TV-PG shows, and anything rated higher than PG is almost certainly not worth it, for either adults or kids.\"",
            "score": 16,
            "author": "howareyouprettygood",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, that sentence was very revealing.",
                    "score": 4,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have two thoughts:\n\na) the article uses a tweet from \"libs of tiktok\" which is a well-known account that literally just hates on people for being gay and/or not ultra-conservative all day, so I would take anything coming from there with several grains of salt\n\nb) boy with that intro to the article I was expecting the dancing to be something more \"sinister\" than something I have watched cosmo the cougar do at every single byu game lol. like if you don't think this is appropriate for your family that's fine, but then neither are most ward talent shows, byu games, or episodes of phineas and ferb",
            "score": 11,
            "author": "Newcago"
        },
        {
            "level": 0,
            "comment": "So Cassandra doesn't like gay people. Who cares?",
            "score": 25,
            "author": "puchamaquina",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -23,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I did, actually.",
                            "score": 23,
                            "author": "puchamaquina",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": -2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Man, she went to a pride event knowing she wouldn't like it, just to tell everyone how much she hated it. She ends with \"it's not a matter of hate\" but spent the whole article talking about how disgusted she was and how this never should be allowed to happen.",
                                            "score": 21,
                                            "author": "puchamaquina",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": -6,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Or maybe they thought some of these young adults (yes…BYU freshman are not children) could use an empathic ear amidst a culture that they feel a need to stay hidden. Hmmmm. Really, what are you so afraid of? If it’s not for you don’t go.",
                                                            "score": 15,
                                                            "author": "CountMC10"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Saying that you \"love\" someone and actually loving them are two different things",
                                            "score": 18,
                                            "author": "mikideharris"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's funny how the one dancer she didn't complain about being sexual, she decided to say has no talent instead. It seems they can't win whether they do a \"sexual\" dance or a non-sexual one. I guess she had to do whatever she can to express her hate of drag queens at an event she chose to attend.\n\nEdit: \n\nIn before \"say you didn't read the article without saying you didn't read it\", followed by a hateful comment about reading comprehension.",
            "score": 13,
            "author": "Cognitively_Absurd"
        },
        {
            "level": 0,
            "comment": "all I see is a dancing queen 🏳️‍🌈",
            "score": 17,
            "author": "-lonely_rose-"
        },
        {
            "level": 0,
            "comment": "Yikes, it's crazy that this kind of stuff is not only allowed in public but promoted to our kids.",
            "score": 2,
            "author": "TimponogosCoug"
        },
        {
            "level": 0,
            "comment": "This is a very sad article.  Especially the last part.  \n\nBYU and its zealous supporters have become modern day pharisees.  \n\nThey lack anything resembling the love Christ taught in the bible.  Just whited seplicures.",
            "score": 2,
            "author": "thatgayguy12"
        },
        {
            "level": 0,
            "comment": "The blogger could certainly have used different work choice to be kinder towards people she disagrees with.\n\nI do believe it is good to see both sides of the story however, so I'm glad this exists.\n\nWhile it probably wasn't as sexual as she made it out to be, some things, like a few of their names like \"anal leakage\" seemed designed to incite disgust. Someone with that name dancing even mildly provocatively, whether male or female, isn't something I would watch or encourage children to watch.\n\nSome of her points do hold some water, like having a booth for Thrive and a few others.\n\nOther things she said are poorly argued.\n\nOverall this event seems like it was held with good intentions, but like with anything religiously controversial, there were people there whose sole intention is to drag people away from the church.",
            "score": -3,
            "author": "Wellllby",
            "replies": [
                {
                    "level": 1,
                    "comment": "The performers only used first names at the show.  Even the poster was changed.\n\nIt’s perfectly fine for anyone to choose not to attend or watch.  Where the line is crossed is when those people choose for other people and their children.  THAT is what the protesters were arguing…",
                    "score": 6,
                    "author": "swennergren11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm glad.\n\nTo be fair, I don't know what the protesters were arguing. I wasn't there. I assume you were based on your comment? \n\nIt seemed to me, based on the tribune article and others, that the goal of the local protesters was to make it publicly aware that they disagreed with the vulgar sounding names and drag show. Yeah they seemed to be pretty uncompromising and not very understanding in their allegations of grooming, etc. but when it comes down to it they had a legal right to be there. \n\nI don't agree with the protesters' approach, but I would also be very uncomfortable if I was raising a family right next to Kiwanis park. I wouldn't participate though. By being in a public location, they probably knew they would get protesters, and played their political cards to make BYU look even worse because of these people. Both things were within the legal rights of both parties.\n\nWhat I personally find more disconcerting (assuming the drag show was rather friendly and didn't use the poster names) was the event both contained a multitude of suggestions against church policy as well as attempting to associate itself with BYU.",
                            "score": 1,
                            "author": "Wellllby",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I heard:\n\n- “No gays in heaven”\n- “Groomers”\n- “Pedophiles”\n- “God condemns Gays”\n- “Don’t protect the homos”\n\nNone of those were about the show, but about the nature of the people there.  Being LGBTQ+ is who they are, and attacking that is what most of the protestor yells I heard were about.\n\nAnd honestly, that is not in line with what Russell Nelson last said about the issue as I recall.\n\nAbsolutely everyone had a right to be there, and the Provo PD did a stellar job keeping things under control.  \n\nAnd I understand the issues people have with a public drag show.  That just seemed to be drowned out by other, more hate-filled diatribe.",
                                    "score": 8,
                                    "author": "swennergren11",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, I would never want my kids around the kind of people who were protesting",
                                            "score": 4,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Glad to see someone willing to post on this sub about how shameful it is that BYU sponsored this event (until several days before, when they pulled support after finding out about the drag show).\n\nI love all my BYU LGB friends, and none of them except me to wear a certain color for them, or support them in relationships I disagree with, etc. you can absolutely love people without condoning their lifestyle. Especially when there is a concerted focus to mutilate the genitals of a social group that definitionally cannot consent to sexual acts.",
            "score": -15,
            "author": "TheWardOrganist",
            "replies": [
                {
                    "level": 1,
                    "comment": "If your LGBTQ friends let you live your life the way you want, then maybe do the same for them. You don't have to participate, but do them a favor and don't try to dismantle and destroy what they love.\n\nAlso your last statement is way out of line and does not make any sense in this context. There was no \"mutation of genitals\" during this family friendly drag show.",
                    "score": 15,
                    "author": "TreehouseInAPinetree",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No such thing as a family friendly drag show. I do let my LGB friends live exactly as they please.",
                            "score": -1,
                            "author": "TheWardOrganist",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Of course there is. Just not for your family. Also, you're shortening that acronym in an interesting way. I wonder why that is.",
                                    "score": 4,
                                    "author": "MarcusShining",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Because LGB don’t involve pumping children with hormones that permanently stunt their development or mutilating their genitals. LGB are sexual orientations, T is not. I see them as completely separate movements.",
                                            "score": 1,
                                            "author": "TheWardOrganist",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh I know. I knew exactly what you were doing and exactly the well of ignorance you were drawing from. Luckily people of intelligence disagree with you rather sharply and you're in the minority. You always will be. :)",
                                                    "score": 0,
                                                    "author": "MarcusShining"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Apparently Lorenzo Snow thought it was family friendly enough for his own birthday party. \n\nhttps://twitter.com/calvinjburke/status/1568652717589172225?s=46&amp;t=dFPyX9Jt8pBn5hAgESU6iw\n\nhttps://newspapers.lib.utah.edu/details?id=2401115",
                                    "score": 0,
                                    "author": "larboy332"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So if your friends loved you but opposed your church, would they still be your friends?  \n\nI mean, if they did not condone your lifestyle of being Mormon, would you still stay friends with them?",
                    "score": 9,
                    "author": "swennergren11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s pretty much what it means to be friends with a non member. If they completely approved of the LDS church they’d be members would they not?",
                            "score": 8,
                            "author": "Blanchdog",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup.  Once my son came to understand he was gay we quickly realized there was not a place for him in the church.  It was not safe for him and also not a place we would stay either.",
                                    "score": 12,
                                    "author": "swennergren11",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not sure how you’re agreeing with me… what I’m trying to say is that it’s absolutely possible to be friends with someone who lives a lifestyle we don’t agree with. Whether that’s an atheist being friends with a church member or a church member being friends with with an alcoholic or a couple sleeping together out of wedlock or someone who leads an LGBT lifestyle. If total agreement were necessary for friendship then no one on earth could be friends with each other.",
                                            "score": 8,
                                            "author": "Blanchdog",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ok, I misunderstood you previous comment.  \n\nIn some situations that is true.  However, some it is not.  When the leaders of your church make statements directly opposing or attacking your friends, how do you defend that?  Like when Oaks pointed out last GC that the church will vigorously oppose laws gay marriage and transgender-affirming laws?\n\nThese are not lifestyle choices.  They are who people are, and when your church actively opposes their rights in a free society, it will be a difficult conversation.",
                                                    "score": 5,
                                                    "author": "swennergren11",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "By church doctrine, marriage is not an earthly institution that we get to define. It’s instituted by God between Man and Woman, and anything else doesn’t fit the definition. It’s an explicitly religious institution that government has no business getting into in the first place, and it especially has no business trying to take God’s place in defining it.\n\nAnd you’re conflating being LGBT and living an LGBT lifestyle. Being LGBT isn’t a choice (though there is strong evidence to suggest that in many cases there is a social contagion component), but living an LGBT lifestyle IS a choice. Just like the lifestyle of an unmarried but living together couple is a choice. They didn’t choose to be straight, but they did chose to behave in a manner contradictory to the commandments.",
                                                            "score": 2,
                                                            "author": "Blanchdog",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "First off your Bible doesn't matter,  it's a stupid book from barbarians. Marriage existed long before Christianity and in many other cultures.\nSecondly even if you wanted to use your Bible to define marriage that would mean marriage is between a man and however many women he can afford to own, as well as the young sex slaves he kidnaps after killing their fathers.\nYou're a bigot, plain and simple.",
                                                                    "score": 1,
                                                                    "author": "AcornOnTheTreeOfLife",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Who said anything about the Bible?",
                                                                            "score": 1,
                                                                            "author": "Blanchdog",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You did.",
                                                                                    "score": 1,
                                                                                    "author": "AcornOnTheTreeOfLife",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yep! As long as it wasn’t a point they routinely brought up. With my LGB friends, it literally never comes up, and I’m ok with that.",
                            "score": 0,
                            "author": "TheWardOrganist"
                        },
                        {
                            "level": 2,
                            "comment": "Basically all my friends growing up loved me but didn’t support my lifestyle. Sad that you don’t think you can be friends with people who choose different paths than you :/",
                            "score": 0,
                            "author": "TheWardOrganist"
                        }
                    ]
                }
            ]
        }
    ]
}