{
    "id": "x9wq4r",
    "score": 39,
    "title": "Squaw Peak to be Renamed \"Kyhv Peak\"",
    "author": "4ch3irpin5gsalut2ary",
    "date": 1662733087.0,
    "url": "https://www.reddit.com/r/byu/comments/x9wq4r",
    "media_urls": [
        "https://www.reddit.com/r/byu/comments/x9wq4r/squaw_peak_to_be_renamed_kyhv_peak/"
    ],
    "other_urls": [
        "https://www.ksl.com/article/50472582/feds-issue-new-names-for-50-utah-locations-that-previously-contained-offensive-slur"
    ],
    "postText": "The feds are clearly trying to clean up Squaw Peak's reputation for Mutual NCMOs. They can't stop us. 🙄\n\nhttps://www.ksl.com/article/50472582/feds-issue-new-names-for-50-utah-locations-that-previously-contained-offensive-slur",
    "comments": [
        {
            "level": 0,
            "comment": "How is that pronounced?",
            "score": 20,
            "author": "GroupEquivalent5314",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's pronounced like hive - Kive",
                    "score": 4,
                    "author": "RiotYeah"
                },
                {
                    "level": 1,
                    "comment": "I think the name is literally just made up. When I google how to pronounce it, all the results are about how to pronounce Kiev. Maybe it’s like a unique Utah way of spelling Kiev, and you pronounce it the same way. If not then idk.",
                    "score": 4,
                    "author": "schrodingers_cat42",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Kyivleigh",
                            "score": 24,
                            "author": "rockyruffian",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Kyhvmcchickenleigh Amberleigh Johnson",
                                    "score": 9,
                                    "author": "schrodingers_cat42"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It shares a name with a nearby lake now as well. The meaning is likely a shoshone or Ute name and could very well have been the name of Old Elk’s wife who died after falling in Rock Canyon following here husband dying in the canyon due to exposure after being chased out if their camp by the Nauvoo Legion who were under orders ti exterminate the men of the Timpanogos tribe. I’m sure more info will be revealed in the next few weeks from the local groups who suggested the name.",
            "score": 15,
            "author": "True-Grab8522"
        },
        {
            "level": 0,
            "comment": "This is part of an effort that has been under consideration for years.\n\nhttps://www.doi.gov/pressreleases/interior-department-completes-removal-sq-federal-use\n\nThere are about 650 name changes across the US. \n\nI don't know the origin of the new name, but the renaming process took input from local tribes. The mountain originally got its name after a couple of native women were murdered on the mountain in the 1800s. So not really something we should commemorate.",
            "score": 37,
            "author": "qleap42"
        },
        {
            "level": 0,
            "comment": "My understanding was that it was named after an unnamed Timpanogo woman who died in the foothills after a group of them were chased up into the foothills in early winter following a skirmish (battle of Provo River).  \n\nI'm all for changing the name, but it seems like they could come up with something better than Kyhv or at least explain what it means.",
            "score": 9,
            "author": "brpajense",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know I am late to this thread by a month, but I found this thread while trying to find out what kyhv means, so I thought I would report back. \n\nIt means mountain. It is a ute word. \n\nhttps://collections.lib.utah.edu/ark:/87278/s6xd3x5k/359787",
                    "score": 3,
                    "author": "Was_LDS_Now_Im_LSD",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for running it down.\n\nIt being a Ute or Shoshone word is definitely better, but the current mountain name was given for an unnamed woman who died from cold or exposure or hunger or falling after being chased into the hills with her family, and I hope there’s a way she can still be remembered.",
                            "score": 2,
                            "author": "brpajense"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Should make it Pregnancy Scare peak",
            "score": 5,
            "author": "Phuk_Racists"
        },
        {
            "level": 0,
            "comment": "It's not just Kyhv Peak, a bunch of other landmarks named \"Squaw x\" throughout the state are getting renamed as well.",
            "score": 15,
            "author": "Yikaft"
        },
        {
            "level": 0,
            "comment": "I’m glad it’s being renamed, but I wish it was to something that had connection to Provo, or indigenous culture. I’m not sure what Kyhv means and I doubt anyone will use it over squaw.",
            "score": 7,
            "author": "-_-xylo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Kyhv is a ute word for mountain. It was not on the original list of suggested names, and there were no public comments suggesting it, so it was probably suggested by the ute tribe.",
                    "score": 3,
                    "author": "Was_LDS_Now_Im_LSD"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lol\n\nOn the other hand, classic KSL comments completely ignorant of how words can be offensive and laying the blame of being offended on the victim. And yet, you'd never catch them dead saying a swear word. Curious...",
            "score": 18,
            "author": "MissingLink000",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, and the quickest to correct someone who says Mormon instead of The Church Of Jesus Christ of Latter Day Saints.",
                    "score": 22,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "oh for sure!",
                            "score": 2,
                            "author": "MissingLink000"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "All the same people wanting everybody to respect their not being called “Mormon” anymore.",
                    "score": 7,
                    "author": "BardOfSpoons"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I get the desire to rename it (cause we are sanitizing all references to native culture anyway, right?) but… why Kyhv? Why not something with actual ~~Irish~~ Utah relevance?\n\nEdit: whoops.",
            "score": -1,
            "author": "HoodooSquad",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why Irish?",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because I’m apparently physically incapable of proofreading, and my phone prefers the emerald isles to the beehive state for autocorrect.",
                            "score": 20,
                            "author": "HoodooSquad",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Haha fair enough, I was curious if the first pioneers in Provo area were from Ireland or something.",
                                    "score": 2,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "You can get the phone out of Ireland, but you can’t get Ireland out of the phone.",
                                    "score": 2,
                                    "author": "lopachilla"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I guess it went through the temple for its new name",
            "score": -1,
            "author": "Craigo4"
        },
        {
            "level": 0,
            "comment": "How we supposed to say “wanna go up to “cough” peak for a ncmo?",
            "score": 1,
            "author": "Dry_Butterfly_1571"
        },
        {
            "level": 0,
            "comment": "I heard this yesterday lol",
            "score": 1,
            "author": "Psychological-Yak776"
        }
    ]
}