{
    "id": "xbsn6s",
    "score": 139,
    "title": "Last night, Jaren Hall reminded me of why I love BYU.",
    "author": "thegetataycar",
    "date": 1662927731.0,
    "url": "https://www.reddit.com/r/byu/comments/xbsn6s",
    "media_urls": [],
    "other_urls": [],
    "postText": "I know the past few weeks have been rough for BYU and BYU Athletics (and, just as a caveat, I 100% agree with our recent statement that we all need to be better and work together to create a safe, inclusive environment at BYU).\n\nHowever, going to the BYU Baylor game last night reminded me of what makes BYU great—I believe that \\*most\\* BYU fans, at their core, are kind (if imperfect) people who want to make the world a better place. \n\nThere were so many things to love about last night—the enthusiasm in the stadium was insane, and I sat by a bunch of Baylor fans who told me that we were the nicest fanbase they've ever interacted with (which is so good to hear!)\n\nThe best part of the night, though, was at the very end, when Jaren Hall walked over to Jake Oldroyd, who was bawling his eyes out, and gave him a huge hug.\n\nFor context, Oldroyd had missed two field goals (one at the end of regulation, one in the first overtime) that would have won us the game. I'm sure he was absolutely devastated as we headed into the second overtime. That kind of mistake can weigh heavily on a player. \n\nWhen we won the game, you could tell Oldroyd was absolutely relieved. Jaren Hall walked over to him and held him. What a stellar leader and teammate!\n\nAlthough BYU fans aren't perfect and we definitely have lots of room for change and growth, I also believe that my time at BYU taught me how to be a better person, leader, and friend. I hope moving forward that we can all emulate Jaren's example, because that is the kind of BYU that I want to represent!!",
    "comments": [
        {
            "level": 0,
            "comment": "It’s a great story and exactly the kind of story BYU Athletics needs a national audience to see. If BYU Athletics is going to be an ambassador for the University and for the Church this is the kind of stuff we need to keep seeing! Love Jaren Hall!",
            "score": 46,
            "author": "Dodgeydogs",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree!! I would post something similar on the general r/sports subreddit, which has a much larger audience, but I'm not sure how it would be received. Heartwarming story, though!",
                    "score": 17,
                    "author": "thegetataycar"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I couldn’t have said it better. Thank you so much, and have a nice day!",
            "score": 13,
            "author": "Commander_Havoc_",
            "replies": [
                {
                    "level": 1,
                    "comment": "What a nice compliment! Thank you!",
                    "score": 3,
                    "author": "thegetataycar"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not sure if you saw or not, but BYU concluded their investigation and found no evidence of racial slurs at the volleyball game.",
            "score": 31,
            "author": "ndawghoodstar",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did see that! I am actually close friends with some people in the athletic department, and they truly undertook a massive effort to do a really thorough investigation. Took lots of steps during the game, too, to try and find the perpetrator, but you won't see that mentioned in the media ;) I am impressed with how they handled the investigation!",
                    "score": 31,
                    "author": "thegetataycar"
                },
                {
                    "level": 1,
                    "comment": "I would rather hear that from an independent investigation and not one sponsored and led by the church.",
                    "score": -12,
                    "author": "jornadamogollon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know which student Rachel accused and have watched the game footage a million times. He's on screen most of the time, and I never see him even say anything. He was on his phone for most of the second match, and after she notified BYU, they sent a police officer to stand by him (who never heard him say anything). Two of my friends were right in front of him and never heard him say anything other than regular BYU cheers. I think it's totally possible that the Duke volleyball player genuinely misheard the racial slur in the heat of the moment. She didn't play well, even before the match where she said she heard the slur, and our student section was very loud. I can see how it would be so easy to hear that word in a constant chant of \"Go Cougars.\" Two of her teammates (one of them who is Black) even went on the record to say that they never heard it (but that they stand by her). Our security team/ushers were on high alert after the second match, and we had a Duke administrator in our student section as well. I simply don't believe we could have multiple students chanting it over and over with no repercussions (or without someone filming it on their phone; it's 2022 for heaven's sake). Especially because a bunch of our Black basketball players were front and center in the student section the whole time. I think it was most likely a genuine mistake. Not sure how much more thorough this investigation could be, honestly. BYU has invited people to come forward multiple times and no one has.",
                            "score": 9,
                            "author": "thegetataycar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; Two of her teammates (one of them who is Black) even went on the record to say that they never heard it\n\nLike in interviews with the BYU athletic department? Is this information published anywhere?",
                                    "score": 1,
                                    "author": "HandwovenBox",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No, not from BYU. I think I read it from a local North Carolina news site that reached out to them for comment a few days after the incident. I can't seem to find the article anymore, but if I locate it, I will post it in a comment",
                                            "score": 1,
                                            "author": "thegetataycar",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'd appreciate it. I've read everything I can about the whole thing and I hadn't heard about any statements from any of the other players or Duke officials. Pretty crappy of the Duke administration to keep their mouths shut.",
                                                    "score": 1,
                                                    "author": "HandwovenBox",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I finally found an article! It’s not the article I read originally, but it does quote Barrows (a Black Duke player) saying that she never heard the slurs: https://www.thestate.com/sports/college/acc/article265127576.html. Sorry for the late response; it was pretty buried 😅",
                                                            "score": 1,
                                                            "author": "thegetataycar",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Thank you! I hadn't seen any quotes directly from any other Duke players, and that one is particularly telling.",
                                                                    "score": 1,
                                                                    "author": "HandwovenBox"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I just don't understand why anyone would trust the LDS church on any investigation.",
                                    "score": -12,
                                    "author": "jornadamogollon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I just don't understand why people would dedicate so much time to trolling and hating on organizations they don't like.\n\nDon't you have better things to do? I would hope so because if not that's depressing.",
                                            "score": 8,
                                            "author": "sandalwoodjenkins",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's an organization that whitewashes and lies about its own history and only values women as baby machines or potential spouses. Sounds great. Enjoy that celestial greatness.",
                                                    "score": -1,
                                                    "author": "jornadamogollon",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah we get it you don't like the church. That doesn't make your obsession any less weird and sad.",
                                                            "score": 1,
                                                            "author": "sandalwoodjenkins",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Why do you keep coming back for more? I feel no obsession bro. but I'm starting to take shine to you. Send me a pic? I bet you're a cutie pie.",
                                                                    "score": 0,
                                                                    "author": "jornadamogollon",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Why do you keep coming back? You seem pretty obsessed. You hate the church and BYU but you can't quit them. Need to spend time following them online and pointing out how much you hate them.\n\nIt's really weird.\n\nThanks, I am cute.",
                                                                            "score": 2,
                                                                            "author": "sandalwoodjenkins",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Cuz I can't quit you now Sandalwood! I'm so obsessively obsessed with obsessing over you. \n I do hope you guys beat Oregon this weekend.",
                                                                                    "score": 1,
                                                                                    "author": "jornadamogollon",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I just don't understand why people wouldn't come forward if it was so obvious it could be heard from the court. /s",
                                            "score": 3,
                                            "author": "geekusprimus"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Lol like that would even be enough for someone as  fervently anti-BYU/LDS as you.",
                            "score": 14,
                            "author": "sandalwoodjenkins",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You make a lot of assumptions with no facts.",
                                    "score": 1,
                                    "author": "jornadamogollon"
                                },
                                {
                                    "level": 3,
                                    "comment": "Why would I promote a school that teaches pseudoscience and false history? Those BYU archaeologists find any evidence of the book of Mormon yet?",
                                    "score": -13,
                                    "author": "jornadamogollon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Why would you spend your day obsessing over something you don't like?",
                                            "score": 11,
                                            "author": "sandalwoodjenkins",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don't like religious organizations hoodwinking their members. You can leave the church but never the culture.",
                                                    "score": -2,
                                                    "author": "jornadamogollon",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm sure you can, I believe in you.",
                                                            "score": 11,
                                                            "author": "sandalwoodjenkins",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Please don't . You believe in a fairy tale that tells you that you will be a god one day.",
                                                                    "score": -2,
                                                                    "author": "jornadamogollon",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "And you're wasting your apparent one blip of consciousness in an ocean of endlessness on a subreddit for something you don't like, making fun of people's beliefs. Sure, we'll listen to you lol  \n\n\nGo be about something, homie. It's your life. Why be held captive by something you dislike so much?",
                                                                            "score": 8,
                                                                            "author": "crashohno",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I am free and have seen the light. Join me.",
                                                                                    "score": -1,
                                                                                    "author": "jornadamogollon"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You are in luck, my friend! \n\nhttps://wccsports.com/news/2022/9/13/general-statement-from-the-west-coast-conference.aspx",
                            "score": 1,
                            "author": "HandwovenBox",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Word big bird",
                                    "score": 1,
                                    "author": "jornadamogollon"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jaren Hall = class act and a true leader. Loved that moment with Jake the Make.",
            "score": 4,
            "author": "ForwardImpact"
        },
        {
            "level": 0,
            "comment": "This is the sportsmanship I love to see. It reminds me of the kid that hugged a pitcher that accidentally hit him with the ball a few weeks ago.",
            "score": 10,
            "author": "spoilerdudegetrekt"
        },
        {
            "level": 0,
            "comment": "As a pregnant woman watching by the ending of that game at 2 something in the morning, that scene was just too much!! I was definitely crying. It was just such a raw moment on both player’s parts. I also loved that Hall stayed on the sidelines to sign little kid’s shirts after the game. What a great leader!",
            "score": 3,
            "author": "ekj1206"
        },
        {
            "level": 0,
            "comment": "Any of the complaints that you see listed against BYU is a 'people' problem, that you can find at college campuses all across America. Anyone remember the famous chant, \"No means yes, yes means ****\"? Yeah that wasn't at BYU and easily as bad as racism.\n\nAll individuals, cultures, and societies often have deep-seated flaws and weaknesses that they have to work through and those should be compassionately pointed out. On top of that, everyone's lives and experiences are unique and can't be generalized with the rest of a community or population.\n\nReligion bashing is very popular on Reddit and the exmormon/athiest user base is very active and many of them would love to watch the church burn and then have BYU secularized into a state school with a name change.",
            "score": 1,
            "author": "KURPULIS"
        },
        {
            "level": 0,
            "comment": "He is phenomenal",
            "score": 1,
            "author": "Phuk_Racists"
        },
        {
            "level": 0,
            "comment": "IT was a touching moment, for sure. BYU still needs a new placekicker. Saban wouldn't have given him a second chance.",
            "score": 1,
            "author": "NearbyAstronomer4023"
        }
    ]
}