{
    "id": "xdadvd",
    "score": 27,
    "title": "Is there anywhere in Provo where I can watch a BYU football game and order a beer?",
    "author": "Hg80_",
    "date": 1663082452.0,
    "url": "https://www.reddit.com/r/byu/comments/xdadvd",
    "media_urls": [],
    "other_urls": [],
    "postText": "I didn’t watch many football games while attending BYU, so I thought it would be fun to make up for those missed opportunities. I’d prefer to watch it down in Provo so I can take in the excitement of game day and I would enjoy it even more if I could order a delicious craft beer while watching.",
    "comments": [
        {
            "level": 0,
            "comment": "Nice try, Kevin Worthen",
            "score": 75,
            "author": "Ben_wheat",
            "replies": [
                {
                    "level": 1,
                    "comment": "*Definitely_not_the_HCO has entered the chat*",
                    "score": 32,
                    "author": "Hg80_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[https://www.reddit.com/r/Provo](https://www.reddit.com/r/Provo) might be an option to check.",
            "score": 25,
            "author": "KURPULIS"
        },
        {
            "level": 0,
            "comment": "Possibly texas roadhouse? The Orem one doesn't have a bar to sit at but the Spanish fork/north utah valley ones do. I wouldn't be surprised if they put on the BYU games when they play",
            "score": 15,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "ABGs maybe? Ask Owen",
            "score": 13,
            "author": "Chris_Moyn",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah this is the only place that's in Provo that you'd be able to order a beer. Provo's not big on the sports bars dry or otherwise.",
                    "score": 18,
                    "author": "True-Grab8522",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wingers and Red Robin at the mall both serve alcohol. Fat Daddy's should work for this, but they choose to show random YouTube videos on all their TVs instead of sports.",
                            "score": 6,
                            "author": "boardsandcords"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’ve never been inside ABGs. I assumed it was a scruffy dive. Maybe I should give it a chance.",
                    "score": 4,
                    "author": "Hg80_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It IS a scruffy dive. But it’s your only option in Provo. \n\nOtherwise there is wingers or Applebees in Orem",
                            "score": 17,
                            "author": "iscreamsunday"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wing Nutz near the mall in Orem",
            "score": 7,
            "author": "ShinakoX2",
            "replies": [
                {
                    "level": 1,
                    "comment": "This was going to be my rec for a sports bar environment in the area.",
                    "score": 3,
                    "author": "boardsandcords"
                }
            ]
        },
        {
            "level": 0,
            "comment": "People have actually given you decent recommendations. ABG's is probably the best place in downtown Provo, but they don't have very good TV's. Bout Time in Vineyard, Strap Tank in Springville, and WingNutz in Orem are my three go to spots for this kind of thing. \n\nBout Time is the most conventional sports bar and has a decent tap selection. Strap Tank actually is a brewery, so they'll have samplers if you're into that. I think the only TVs are behind the actual bar though, and I've only ever been for dinner. WingNutz is in the University Place mall, so it will probably feel most like you're back in Provo, but they don't have the best drinks or environment. \n\nI've also heard decent things about Callie's in Orem. Then you have the list of chains like BWW, Wingers, Chili's, Applebee's, and so on that serve beer and show sports.  You probably wouldn't be the only BYU fan drinking at any of these places. DM me if you want to meet up, I live right downtown.",
            "score": 4,
            "author": "boardsandcords"
        },
        {
            "level": 0,
            "comment": "Bout time, it’s in vineyard I go occasionally to watch an NFL game with some buddies, and it’s always packed super fun place to watch! \n\nNote: I don’t drink, so idk how prices/ the drinks but the food is pretty good!",
            "score": 13,
            "author": "Lucky-Gur4189",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good recommendation! I forgot about that place!",
                    "score": 5,
                    "author": "Hg80_"
                },
                {
                    "level": 1,
                    "comment": "I would second this as the best sports bar in the area, good tap selection and food",
                    "score": 2,
                    "author": "boardsandcords"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lol at asking the number one stone cold sober campus ever where to find a beer nearby.",
            "score": 8,
            "author": "Nevesnotrab",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey, Provo has evolved a lot in the last decade. When I started as an undergrad there was almost nowhere to order a beer. By the time I finished grad school there were at least half a dozen restaurants in downtown Provo alone where I could order a quality beer or a cocktail with my meal. I’m just not aware of an establishment that offers a more “sports bar” environment for watching football.",
                    "score": 13,
                    "author": "Hg80_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"evolved\"",
                            "score": 11,
                            "author": "fool_on_a_hill"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Chilis",
            "score": 2,
            "author": "joegant"
        },
        {
            "level": 0,
            "comment": "Sports nuts In Orem",
            "score": 2,
            "author": "Admirable-Stand9964"
        },
        {
            "level": 0,
            "comment": "I’ve been to that location about a dozen times and I never noticed that. Are you sure sure that’s right?",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Have an authentic experience and order chocolate milk and a Cougar Tail (maple donut) instead.",
            "score": 1,
            "author": "angela52689",
            "replies": [
                {
                    "level": 1,
                    "comment": "Too sweet for me, unfortunately. My racial background puts me at a higher risk of type 2 diabetes, so I try to avoid very sugary foods and drinks.",
                    "score": 1,
                    "author": "Hg80_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Good idea in general. Alcohol is also bad for those at risk for diabetes too, though, so the logic doesn't really hold up.",
                            "score": 1,
                            "author": "angela52689",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s a very true statement. Not drinking alcohol is almost always healthier than drinking alcohol. That’s why I limit my drinking to only with friends on special occasions to keep the cost benefit in favor or forging closer bonds with the people I love.",
                                    "score": 2,
                                    "author": "Hg80_"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just out of curiosity. I always wondered why people who don’t care for the lifestyle BYU promotes still cheer for BYU sports.",
            "score": 1,
            "author": "joegant",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s a great question, and the answer will vary from person to person. First of all, I think it’s important to recognize that BYU is often the only choice some people have when it comes to a college education. There are plenty of students who are at BYU because they won’t receive any financial support from their parents unless they attend a church-owned school. For me it was a combination of financial and social pressures that first lead me to BYU. I was born and raised LDS outside of the Mormon corridor, and by my senior year of high school most of my LDS friends where planning on going to BYU. I really wanted to stick with my church friends as well as live up to the ideal of being a BYU graduate which was very strong in my home ward. I also came from a very low income family, and BYU ended being one of the few options that I could afford. The problem was that I never actually believed in the truth claims of the church, and the fear of being ostracized from the only community I knew lead me to live a lie much of my adult life. Despite that challenge, I still really value my LDS upbringing and my time at BYU. My mission and church activities helped me overcome severe social anxiety and I ended up making a lot of good friends at BYU. I also received a wonderful education and now have an awesome career. Even though I find many of the policies and cultural practices at BYU to be problematic, and even harmful, I recognize that there’s a lot of nuance to take into consideration. So, despite being an atheist and “apostate”, I will always identify as a Mormon (but not LDS) and will be proud of my affiliation with BYU. I also think it’s important for active members and ex-Mormons be cool with each other because both groups can learn and grow a lot from each other’s experience.",
                    "score": 4,
                    "author": "Hg80_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for the great answer and I totally agree with you on many points. My problem is I always ended up hanging out with the strict Mormons at BYU and never had anyone admit that they were going through the motions or didn’t believe in some aspects of the faith. That’s why I  was always surprised to see people at Chillis cheering for BYU while drinking, but I never had the chance to talk to them.",
                            "score": 1,
                            "author": "joegant"
                        },
                        {
                            "level": 2,
                            "comment": "Thanks for sharing. Learned a lot!",
                            "score": 1,
                            "author": "Peter-Tao"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did anyone mention ABGs on Center Street? I know they have a good selection of craft beers.",
            "score": 1,
            "author": "Active-Sort7203"
        }
    ]
}