{
    "id": "xxij27",
    "score": 32,
    "title": "Footage of hit and run in Provo?",
    "author": "survivorsof815",
    "date": 1665096038.0,
    "url": "https://www.reddit.com/r/byu/comments/xxij27",
    "media_urls": [],
    "other_urls": [],
    "postText": "A motorist hit a bicyclist last night on the intersection of 600N and 200E. The bicyclist is relatively fine, but will need some additional care for things like a broken arm. Is there a chance that anyone has (or knows someone who has) a ring doorbell or other cameras? Or perhaps someone who is aware of a car with a new and suspicious dent?",
    "comments": [
        {
            "level": 0,
            "comment": "broken arm isn't fine, yikes",
            "score": 46,
            "author": "amaduli",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not even relatively fine, honestly. \n\nSadly, there likely won't be any footage of the incident. This kind of thing is exactly why people should push for better cycling infrastructure. The best way to stop hit and runs involving cyclists like this is to eliminate the possibilities for it to happen.",
                    "score": 14,
                    "author": "Sw429",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Provo recently tore up half of our main roads and invested millions in better bike infrastructure, making lanes smaller and turns more difficult (because the opportunities are now legally fewer). I hardly ever see anyone biking in any of these lanes.",
                            "score": -10,
                            "author": "TheWardOrganist",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I respect you u/TheWardOrganist, and am disappointed with the NIMBY take here. Consider walking or riding a bike around Provo to get more perspective.",
                                    "score": 7,
                                    "author": "willrunforjazz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I live in Springville and cannot bike to BYU. Rent went up 80% and I got priced out of the overpopulated hellhole otherwise known as Provo.",
                                            "score": -5,
                                            "author": "TheWardOrganist",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Have you ever tried?",
                                                    "score": 1,
                                                    "author": "willrunforjazz",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "To bike the 14 miles at 6:30 am? Yeah no. My crappy beach cruiser and I are good.",
                                                            "score": 1,
                                                            "author": "TheWardOrganist"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "One problem with these lanes that you might not realize if you don't use them, is that most of them don't connect with each other and it's hard to get to the right lane from the wrong side of the road without dieing. This makes it really hard to find a good use case for most of them, especially when you need to turn onto a road that has the same 45 mph speed limits but no bike lanes.",
                                    "score": 2,
                                    "author": "WiJaMa"
                                },
                                {
                                    "level": 3,
                                    "comment": "Are you talking about the bus lanes? Because that's not bike infrastructure.",
                                    "score": 4,
                                    "author": "puchamaquina",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Cougar blvrd comes to mind. But also, screw 700 N",
                                            "score": -4,
                                            "author": "TheWardOrganist"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Better than others. I met someone once who needed facial reconstruction from a similar incident in Provo.",
                    "score": 11,
                    "author": "survivorsof815"
                },
                {
                    "level": 1,
                    "comment": "Nah that's totally fine. It's just a flesh wound. Tis but a scratch...",
                    "score": 1,
                    "author": "A_Notion_to_Motion"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your best bet is probably to just walk the street and knock on doors that have cameras.",
            "score": 11,
            "author": "Blanchdog"
        },
        {
            "level": 0,
            "comment": "I'm assuming you already contacted the police right? Hit and run is a felony and they'd be a lot better of a resource to you than we ever could be. Good luck figuring it out!",
            "score": 18,
            "author": "peterbrownbyu",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s my understanding that that’s been done.",
                    "score": 5,
                    "author": "survivorsof815",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "hopefully they’ll actually do something about it. my friend who used to work at the health department knew someone who was in a hit and run, luckily he wasn’t too gravely injured but when he went to the police they basically just told him it would be too much work to pull traffic footage from the city(?) or something along those lines, so the lady who ran a red and hit him just got away with it…\n\nedit: forgot to mention this was near the health department across from center street in provo",
                            "score": 3,
                            "author": "_miraai"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Any idea of car color or make? First time I got hit, the driver took off, never found them. The second time, someone on the road luckily had a dash cam.",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You were hit twice??? And no, not really",
                    "score": 1,
                    "author": "survivorsof815"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a bicycle commuter, I beg everyone: PLEASE watch out for cyclists. Some of them are jerks, but there are people that love me and every other cyclist and giving us a little extra space or slowing down when you pass on the road means a lot. \n\nI lived right on that intersection. N-S traffic would always stop even though they didn't have a stop sign and E-W traffic never stopped even though they did have a stop sign. I was almost run over more than once there. Drivers in Provo are a plague, but the police are only concerned about how you park your car, not how you drive it.",
            "score": 9,
            "author": "engineering_aaron",
            "replies": [
                {
                    "level": 1,
                    "comment": "That entire region of city is so poorly planned in terms of stop signs. Consistently, people who should be stopping don’t, and those that shouldn’t have to do.",
                    "score": 1,
                    "author": "TheWardOrganist"
                },
                {
                    "level": 1,
                    "comment": "I agree provo drivers are TERRIBLE.... but as someone who has had to slam on my breaks many times because:\n\n\\- a cyclist (IN THE DARK without lights or reflective gear) was trying to bike across the middle of a road (with a 45mph speed limit) where there wasn't an intersection, light, or other crosswalk\n\n\\- cyclist randomly pulls into traffic with little to no warning\n\n\\- cyclist thinks they're a car and thinks they can go 45 uphill in a car lane\n\n\\- cyclist is barely in the bike lane and has a death wish\n\n\\- cyclist speeds across a crosswalk with blind corners (ie the cars can't see the cyclist until the cyclist is IN THE CROSSWALK and by then it's a little late)\n\nBut if you're a runner or a biker you can't take it for granted that other people see you. Even in a car this is true. I have avoided so many accidents just by realizing that other people don't pay attention. I'm not saying people shouldn't watch for bikers/runners, but bikers are the ones who will be injured in this scenario.\n\nThat being said I'd also like to mention that I have also seen someone hit a cyclist, almost hit many runners, and run red lights (I swear every time I'm at a light I watch at least 2 people run a red light by a solid 1.5-2 seconds).\n\nPersonally I have also been in two car accidents caused by idiots who didn't look/pay attention. So I get it. But you can't control what others do. You can control what you do.",
                    "score": 1,
                    "author": "zobug66",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Legally, the burden of awareness is on the car driver. But pedestrians and cyclists are also required to be predictable, which applies to many of your points. \n\nLike I said, there are idiots. Especially in Provo. I ride with a flashing front, back, and helmet light at night. I usually plan that cars are going to hit me and am pleasantly surprised when they don't. My #1 goal while riding my bike is to be predictable. If I need to leave the bike lane because I don't want to eat it whole riding over gravel or someone's parked in the bike lane, I watch traffic and signal my entrance. And yet, drivers still find a way to try to kill me.",
                            "score": 4,
                            "author": "engineering_aaron",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "first of all 10/10 phrasing.\nbut yeah, mostly my point was exactly that. even though the legal burden is on drivers, people pretending cars should watch out for them instead of them watching out for cars are just a tiny bit delusional and risking a lot.",
                                    "score": 2,
                                    "author": "zobug66"
                                },
                                {
                                    "level": 3,
                                    "comment": "I love how you brought up predictability, and I want to ramble a little just because I was thinking about this today. I agree that being predictable is very important when biking or driving although I will prioritize what I think will keep me safe over what I think a driver is predicting. I bike through the intersection of 700 E and 500 N. It is a four way stop, but I cannot think of an instance where I saw another biker make a complete stop. My memory is probably biased though. Just today, there were two bikers in front of me at the intersection that both went straight through as I was coming home. One of them almost hit somebody crossing the cross walk, and the other almost got hit by a car making a left. I am grateful I have never seen anyone get hurt, but there have been so many close encounters. This morning as I was biking to campus a car got to the intersection well before I did, and I think expected me to go straight through the intersection because they waited at the intersection. I got to the intersection and stopped. They looked annoyed and waved for me to go. I felt bad for making them wait a little, but I will always chose inconveniencing a driver at that intersection over risking getting hit.",
                                    "score": 1,
                                    "author": "Yrahaz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, with the law change that cyclists aren't required to stop at stop signs or traffic lights, some take that as meaning they are now unstoppable. It was clear to me, living in Provo, that there is just a general ignorance or carelessness around the laws of the road. Like your experience with the car at the intersection. It's nice if you yield to someone when the right of way could go either way. It's annoying when you CLEARLY have the right of way, others are obliged to let you take it, and you don't. I saw that driving, cycling, walking, running, and if I could fly I'm sure it would happen in the air too.",
                                            "score": 1,
                                            "author": "engineering_aaron"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've been hit twice in Provo while at BYU! This should be good, but it's terrible",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Police got access to ring camera recordings",
            "score": 3,
            "author": "abdo9029"
        },
        {
            "level": 0,
            "comment": "lol, “does anybody know somebody with a new suspicious dent in their car?” In a city with hundreds of thousands of people and a hundred and fifty more who commute in every day.",
            "score": -20,
            "author": "TheWardOrganist",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dick",
                    "score": 12,
                    "author": "Complete_Swing2148"
                },
                {
                    "level": 1,
                    "comment": "Obviously this is a long shot. Also, I’m asking on the off chance someone has a roommate who suddenly has a large dent in their front bumper.",
                    "score": 11,
                    "author": "survivorsof815",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "lol",
                            "score": -9,
                            "author": "TheWardOrganist"
                        }
                    ]
                }
            ]
        }
    ]
}