{
    "id": "y271wo",
    "score": 27,
    "title": "What are the biggest barriers LGBTQ+ students face on campus?",
    "author": "colormealive",
    "date": 1665588806.0,
    "url": "https://www.reddit.com/r/byu/comments/y271wo",
    "media_urls": [],
    "other_urls": [],
    "postText": "In the spirit of understanding and support. I am curious to know some of the barriers/challenges LGBTQ+ students face on campus, or in Provo in general.",
    "comments": [
        {
            "level": 0,
            "comment": "Finding safe housing and safe roommates",
            "score": 25,
            "author": "HurricaneLau",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think this is often overlooked by outsiders. Something as fundamental to human rights as housing is a matter of safety for queer people.",
                    "score": 7,
                    "author": "colormealive"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just get bugged when people say things that just aren't true.  \n\n\nLike one guy I talked to quoted Moroni 7:12 and said since same sex attraction prevents exaltation, it must come from Satan. Like, that doesn't track because emotions aren't sinful, just what you do with it. Attraction can be dwelled on to become lust, for example. Another is that anger can be used as an indicator that something needs correction or it can be used to stir up strife. Disagreements don't have to be contentious.  \n\n\nAnother conversation I was part of was about the reasons for the church leaving Boy Scouts, and one guy said we didn't need gay people in troop leadership. I asked why, and he backtracked on it saying people back then just felt threatened with a bunch of changes happening, and then he doubled down on how it likely made sense in context. Like, if I was an 80 year old from the south defending the Jim Crow laws for separating whites and blacks by saying they made sense in context, I think anyone today would sideeye that one.  \n\n\nI don't know if there's a solution for these besides just keeping on having conversations like the above. On some level I think it's better to be articulate and wrong because it at least opens up the opportunity for correction.",
            "score": 31,
            "author": "Yikaft",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Boy Scout one makes me so angry.  It's not only a perpetuation of the \"gay=pedophile\" myth,  but also ignores the role of the Mormon institution in the abuse that occured and went unreported in their troops.",
                    "score": 7,
                    "author": "Infinite_Garlic_3654"
                },
                {
                    "level": 1,
                    "comment": "&gt; said since same sex attraction prevents exaltation, it must come from Satan\n\nGod would never set us up to fail. If you believe that then you might as well believe Jesus Christ is a hoax.",
                    "score": 17,
                    "author": "iki_balam",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can think of instances where I would agree and disagree with that, but I’m also not sure how it addresses the point you replied to, which I’d admit was pretty brief.\n\n\\- - -\n\nThe plan of salvation would be a hoax if we weren’t set up to fail to return to God in that we’re reliant on grace for redemption from both physical and spiritual death. I think we’d agree that we’re set up for and chose the possibility of failure.\n\nIf failure is sin, I’d agree with a reference to Paul on handling temptation in [1 Cor 10:13](https://www.churchofjesuschrist.org/study/scriptures/nt/1-cor/10?lang=eng&amp;id=p13#p13)\n\nIf failure is feeling excluded or called out at church by incorrect ideas or hurtful opinions, I’d agree that God didn’t set queer members up to fail. The other members did. [Ben Schilaty has a great blogpost touching on this](http://benschilaty.blogspot.com/2020/08/how-to-avoid-being-jerk-to-gay-people.html).\n\nIf failure is a setback, then I’d reference [Wrong Roads](https://www.churchofjesuschrist.org/study/new-era/2005/07/wrong-roads-and-revelation?lang=eng)  quoted by Elder Holland who said we can be led down a wrong road to find revelation or confirmation of somewhere else to go.\n\nIf failure is unfairness, [Renlund’s Infuriating Unfairness](https://www.churchofjesuschrist.org/study/general-conference/2021/04/25renlund?lang=eng)  covers this pretty well in how Christ can help us not be bitter. I think that this can also be reduced to an equity versus equality argument, which I believe many people argue in circles over because they don’t nail down the difference between opportunity and outcome in a given context.\n\n\\- - -\n\nThere are lots of meanings of failure, but what is success then? Is it exaltation through marrying someone a person has no physical attraction to? Is it being faithful to the endowment through living a celibate life, and if so, what is the outcome in the next life?\n\nWould success involve being cured of same sex attraction? I think that unfairly pathologizes it, and just teaches people to unnecessarily hate a part of themselves. [Wordly attempts at curing it have been discussed elsewhere](https://www.reddit.com/r/byu/comments/xfvp6h/why_was_i_never_told_that_byu_used_electroshock/). I imagine there are many feelings we wouldn’t feel as resurrected, perfected beings, like worldly sorrow instead of godly sorrow, but why would that include same sex attraction?\n\nIf anything I think acknowledging our same sex attraction can strengthen our divine identity, like [when Elder Ballard said \"Our spiritual identity is enhanced as we understand our many mortal identities, including ethnic, cultural, or national heritage.\"](https://www.churchofjesuschrist.org/study/general-conference/2021/04/28ballard?lang=eng&amp;id=p15#p15)",
                            "score": 6,
                            "author": "Yikaft",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I really, really wish we could sit around a fire ring somewhere on 400N and go all in on these topics",
                                    "score": 2,
                                    "author": "iki_balam"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The fact that if I'm on campus I can't even as much hold someone's hand if we're both the same biological sex. I am not dating and I'm not planning on dating until I'm done with school for this reason. Also the fact of the matter of how I have a trans roommate, but she needs to be in dorms based on her birth assigned gender, is officially referred to as he/him, still referred to as her dead name despite changing it in my.byu, etc.\n\nThe barriers are from the lack of acceptance. Yes, we can exist on campus, but as soon as we \"act on it\" it's bad. There's no Title IX support because, as Oaks proudly said at the devotional, BYU is exempt from that portion of the policy.",
            "score": 41,
            "author": "Wifijoe"
        },
        {
            "level": 0,
            "comment": "Conversations at BYU are like 90% guaranteed to include : \"are you dating someome/married/engaged?\"  And every religion class and church meeting is 90% guaranteed to include a discussion on why marriage is the most important and most awesome thing to do in your young adulthood.  Then demanding that non-heterosexual students not date who they are attracted to may as well be psychological torture.",
            "score": 19,
            "author": "Infinite_Garlic_3654",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was torture for me, as a gay former mormon.  \n\nYou dating anyone?  \n\nMe: nope\n\nThem: \"Oh come on!  Marriage is so amazing, you'll find the right one and you'll be so happy.\"\n\nMe internally: *I know but I'll never have that, thanks for reminding me I am going to die alone and miserable*",
                    "score": 5,
                    "author": "thatgayguy12"
                },
                {
                    "level": 1,
                    "comment": "very true!",
                    "score": 2,
                    "author": "k88thegr88"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Our existence is considered political. Our existence is something that's discussed in a spirit of understanding. Straight people just get to exist, but we're a problem to be solved. \n\n I'm no longer a student but I stayed in Provo after I got married. For a while, I was still active but my wife wasn't. My bishop was very insistent that I *never talk about my wife.* The fact that I was gay was too divisive. Someone brought up fishing, and I couldn't share a story about my wife taking me fishing for the first time. Someone asked what my husband does, and I couldn't correct them. Have you ever tried to go a time without ever mentioning your partner's name or gender, not even a pronoun? Knowing that of you slipped up, it could mean possibly losing your membership in the Church?\n\n It's wild to me that a man can get up in testimony meeting and talk about how he and his wife struggle with infertility and no one cares. But if I introduce myself to someone before Sunday school and say \"I met my wife at BYU, we're both RMs, we've been married X years,\" suddenly no one can think about Jesus anymore I guess because everyone is thinking about gay sex now or something.\n\n We're totally written out of doctrine. According to the current understanding of doctrine, the only people living with God in the Celestial kingdom will be straight cis men and their one or more wives. At BYU where marriage and dating is such a big part of the culture, that doctrine bleeds into everything, especially in how we're talked about then treated. The fact is when you're queer at BYU, you're a target for people who are hostile, and those who are supposed to be there to protect you are too busy scrutinizing you and judging you to come up with solutions, so you can't trust them.\n\n It's just the general unsafe feeling of knowing that you're so unwanted that no one even believes God would ever let you into heaven. Not unless I'm \"cured\" from my relationship with my wife, forced to marry a guy and watch her married to some dude, having to repent of all the love and care I've given her in this life, and having our (future, we hope) children taken and sealed to another couple who's more worthy just because they were straight in this life. And when I have a problem with that, I'm just a faithless angry gay, and members would rather write me off because that's easier than mourning with me and maybe doing something about it. It's the gaslighting that if I just prayed more, I wouldn't feel sad about losing the woman I love in the next life. It's the constant abandonment in this weird, uncomfortable space by people who say they love me.",
            "score": 15,
            "author": "TenLongFingers",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for sharing your story. I certainly didn't mean to imply queer people were a problem to be solved. I wish you and your wife the happiest of lives, and even beyond this life, the heaven that I believe in is with you and your wife there.",
                    "score": 2,
                    "author": "colormealive"
                },
                {
                    "level": 1,
                    "comment": "Stories like this break my heart. The church is all false and can't be proven in any real way. There is no archeological evidence for any shred of truth in the Book of Mormon.  Leave now and save yourself much grief and guilt. Would you follow a \"prophet\" today who started a new religion and then started marrying teenagers?",
                    "score": 1,
                    "author": "jornadamogollon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My wife has removed her records and I rarely attend anymore. I'm a cafeteria Mormon and happy with it. I follow what I believe to be personal revelations (others may call it intuition) and I take what good I can. It was my dedication to my covenants to follow Christ's example that led me away from church activity. I'm very satisfied and confident with my current path, but I appreciate your heartfelt concern.",
                            "score": 8,
                            "author": "TenLongFingers",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I respect your decision and especially your decision to follow Christ's example. I'm a recovered Mormon but often find Christians of any denomination rarely follow that example. Good luck but join us in the void. We are happy and welcome all!",
                                    "score": 4,
                                    "author": "jornadamogollon"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would think simple things like holding hands with a same sex even if you are not sexually intimate with that person or even NCMO with that person. :)\nSame things that unmarried heterosexual temple bearing LDS couples are able to do on campus or in city of Provo.",
            "score": 21,
            "author": "coldcoldnovemberrain"
        },
        {
            "level": 0,
            "comment": "I'm not sure about systemic barriers besides the honor code, but there are students who are very openly disrespectful and homophobic towards them. For example, usually once a semester or so a student organization, with approval from the school, if I remember right, holds a rainbow day. Basically you wear rainbow things to show LGBTQ students that they are welcome and loved. Last year on that day, a group organized a sort of protest against it. They told everyone to carry around an umbrella and wear BYU gear to \"show support of the family proclamation and BYU\" or something like that. It was really depressing to see how many people were carrying around umbrellas that day (not rainy at all so it was easy to tell.) Just a month or so ago a student pride organization held a drag show (pretty sure that wasn't campus sponsored) and protesters showed up with some pretty awful signs. I heard some had guns but I for sure have not confirmed that. There's also a lot of really mean things that go on in online spaces like twitter. There's this whole group called Deznat that's made up of pretty extreme conservative members who say a lot of threatening things online.",
            "score": 17,
            "author": "k88thegr88",
            "replies": [
                {
                    "level": 1,
                    "comment": "What's so scary about this to me is that these anti-gay protesters are allegedly doing it in the \"name of God\". They would bring a gun to a drag show and potentially shoot another human being and all the while be delusional in thinking they're doing the Lord's work. On the other hand the root of LGBT+ rights is love. I'll let you decide which one is more Christlike.",
                    "score": 4,
                    "author": "colormealive",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "this",
                            "score": 1,
                            "author": "k88thegr88"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "...discrimination?",
            "score": 4,
            "author": "JustNoLikeWhoa"
        },
        {
            "level": 0,
            "comment": "I'm guessing the top responses with regards to campus will be about the honor code.\n\nBut I am curious what people say about the city of Provo.",
            "score": 7,
            "author": "spoilerdudegetrekt",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've lived in provo for 5 years, so not a lifetime resident, but I feel like I have a pretty good sense of what it's like, though I don't identify as LGBTQ+ myself. Despite what a lot of people think about Provo, it does have a decently sized more progressive community compared to a lot of places in Utah. I'd say it probably comes next after Salt Lake. So I get the sense that there is pretty good community for people who identify and allies, and a handful safe places. A lot of queer BYU students organize events to raise awareness and support such as the RaYnbow Collective and Cougar Pride Center. There's Encircle which is a sort of community center for LGBTQ+ youth, and I've recently seen some queer focused counseling places pop up.\n\nOn the other hand though, it is still Provo Utah. I've heard many stories of pride flags being ripped down and vandalized, seen pride related chalk art vandalized, and pretty much any pride related event will attract protesters and hecklers.\n\nThere's a lot of division here.",
                    "score": 11,
                    "author": "k88thegr88",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I flew a pride flag on our porch my last year at BYU and it was vandalized several times.",
                            "score": 12,
                            "author": "Wamafibglop",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I flew an American flag and it was vandalized by my downstairs BYU student neighbors (whose pride flag I always respected). Am I a victim too?",
                                    "score": 1,
                                    "author": "TheWardOrganist",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You're assuming it was your neighbors or you watched them do it? Either way if you want to call yourself a victim, be my guest. I never said anything about victimhood, just shared that my prominently-located apartment became a target of vandalism only after we hung a pride flag.",
                                            "score": 0,
                                            "author": "Wamafibglop",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I had two security camera angles that showed them and their friend do it at 2:32 am in a morning in July 2020",
                                                    "score": 0,
                                                    "author": "TheWardOrganist",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Congrats, you can call yourself a victim!",
                                                            "score": 0,
                                                            "author": "Wamafibglop"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stairs",
            "score": 5,
            "author": "Capable-Government76"
        },
        {
            "level": 0,
            "comment": "IMO being pulled into a direction of extremism. There are a lot of people who live off fear and anger. Exmo and Peter Preisthood alike. I've seen it with any cause or interest TBH. Beards, Veganism, flat earth, anti-vax, etc",
            "score": 0,
            "author": "iki_balam"
        },
        {
            "level": 0,
            "comment": "Too many. Leave byu, they don’t love you or appreciate you. This is a cult, learn to love yourself",
            "score": -15,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Well it's against the Honor Code, so 1. They should go seek therapy 2. Apply to a liberal school and be awarded a worthless degree.",
            "score": -32,
            "author": "SeanJoost",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bro, I think you might need therapy yourself considering your post and comment history…. Just saying",
                    "score": 25,
                    "author": "SheenTheMachine21"
                },
                {
                    "level": 1,
                    "comment": "You are the exact reason BYU has a bad reputation.",
                    "score": 7,
                    "author": "colormealive"
                },
                {
                    "level": 1,
                    "comment": "And there’s nothing wrong with therapy btw",
                    "score": 14,
                    "author": "SheenTheMachine21"
                },
                {
                    "level": 1,
                    "comment": "Sounds like the kind of empathetic, kind language Jesus would use /s",
                    "score": 18,
                    "author": "gingerreckoning"
                },
                {
                    "level": 1,
                    "comment": "It isn’t a violation of the honor code to simply be gay. It is to act on it, but the attraction is not. Respectfully, take your unkindness somewhere else. We can’t begin to imagine the difficulty of being a faithful member and being LGBT.",
                    "score": 11,
                    "author": "kwallet"
                },
                {
                    "level": 1,
                    "comment": "I literally had to go to grad school to scrub BYU off my transcript. Outside of Utah, BYU isn't respected the way you think it is. Students from there are a liability because of mentalities like yours.",
                    "score": 10,
                    "author": "Wamafibglop",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Could you please elaborate on that a bit? I've heard things to that effect before, but nothing really specific. Meanwhile the department I'm in (Math) sends tons of alumni each year to top-flight grad schools and Fortune 500 companies who are very impressed by them. For my field, at least, BYU is a well-respected undergraduate institution. \n\nGranted, this is one impression from one student of a single (albeit broad) discipline. I know my perspective is incomplete, so I'd love to hear yours.",
                            "score": 11,
                            "author": "Pyroraptor42",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think to some extent STEM programs are a little insulated since large chunks of the interview process is skills-based. But once you're working with a team and the manager realizes you don't work well people that don't look like you it can become a liability. And the thing is it's not always willful ignorance like the response above. If you're in a BYU STEM program you are surrounded by white men. You're simply not exposed to other people or cultures so you may not have the opportunity to develop certain people skills that are essential in the world outside of Utah County. \n\nI've had several interviews where I've had to qualify my BYU experience by pointing out I also took sociology classes on race, gender, etc, and was heavily involved in activism my last 2 years. In a lot of nonprofit spaces especially, BYU grads are not well respected and with good reason imo. If your nonprofit mission has anything to do with human rights it's not unreasonable to assume that a BYU alum harbors homophobic ideas that are incompatible with your organization's work.",
                                    "score": 9,
                                    "author": "Wamafibglop"
                                },
                                {
                                    "level": 3,
                                    "comment": "Attitudes are changing very quickly as they come under the spotlight.  People don't want to bring someone on who might say or do something homophobic, transphobic, or racist.",
                                    "score": 10,
                                    "author": "Infinite_Garlic_3654"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}