{
    "id": "zidi9n",
    "score": 6,
    "title": "Why isn't my ecclesiastical endorsement working?",
    "author": "derrick_schaefr",
    "date": 1670729943.0,
    "url": "https://www.reddit.com/r/byu/comments/zidi9n",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi all. The BYU application for Fall 2023 is due this Thursday. I've been working for so long to get my ecclesiastical endorsement finished, but things keep going wrong for me. At first the bishop claimed to not see my name, but I had it set to the wrong term. Then I made it so he would see it and he claimed that he figured it out, but when I tried to see my form to find my progress, it looks like that original form was deleted. I don't know what's going on, and I'm running out of time. I'll try to call BYU tomorrow or Monday, but I don't understand what's going on. If anyone can help me, that would be incredible. I'm running out of time!",
    "comments": [
        {
            "level": 0,
            "comment": "Schedule another meeting with your bishop for Monday if possible. Hopefully get him to finish your endorsement and submit it while you're there with him. It's a very straightforward process, it literally takes one button press. Good luck!",
            "score": 14,
            "author": "Trying_Trader"
        },
        {
            "level": 0,
            "comment": "BYU won’t answer on Sunday. Campus offices are closed on Sundays, because it’s the sabbath",
            "score": 2,
            "author": "kwallet"
        },
        {
            "level": 0,
            "comment": "Resubmit for it again, call your bishop or the first counsellor (they can approve them too), then call the registrar’s office. Deep breaths.",
            "score": 1,
            "author": "VulcanDiver",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't think the counsellors can anymore. They might have changed it again but the counsellors were only able to do the endorsements for a few months and then they changed the policy back. They could have changed it again though!",
                    "score": 3,
                    "author": "Brutal_Muffin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Whoa. The universe was looking out for me, in that case. If I hadn’t gotten that endorsement I was deeply considering ceasing to be alive because I couldn’t keep living a lie about my beliefs 👀",
                            "score": 1,
                            "author": "VulcanDiver"
                        }
                    ]
                }
            ]
        }
    ]
}