{
    "id": "cg195w",
    "score": 3,
    "title": "Colgate, Hamilton, and weed",
    "author": "batossatoss1234",
    "date": 1563728554.0,
    "url": "https://www.reddit.com/r/Colgate/comments/cg195w",
    "media_urls": [],
    "other_urls": [],
    "postText": "hey y'all, what's the campus's attitude towards pot? are they flexible or strict about that stuff? what about hamilton overall? like if i'm at a friends place off campus how discreet do we need to be?",
    "comments": [
        {
            "level": 0,
            "comment": "If you get caught by campo you’ll get 4 points, more than getting caught underage drinking. You can take classes to get points reduced. Definitely be careful, but there is quite a bit of usage on campus. Find a friend who lives off campus or in the sky suites to be safe",
            "score": 2,
            "author": "yohoothefirst"
        },
        {
            "level": 0,
            "comment": "NY's Senate just adopted a new law on marijuana use. It will: \n\nDecriminalize possession of small amounts of marijuana by reducing the penalty for unlawful possession of marijuana to a violation punishable by a fine.\n\nEstablish procedures for automatic record expungement both retroactively and for future convictions. \n\nRemove criminal penalties (since a violation is not a crime) for possession of any amount of marijuana under two ounce.\n\nReduce the penalty to a $50 fine regardless of criminal history for possession under one ounce, and a $200 fine regardless of criminal history for possession between one and two ounces.\n\nAdd marijuana to the definition of “smoking” under the Public Health Law so that smoking marijuana will be prohibited in any circumstances where smoking tobacco is prohibited by law.\n\nAs a proud alum of Colgate University, I was trained to find out such information. It's called a \"google search\". Come on, kid, you could learn how to do this, too.\n\nWhen I was at Colgate decades ago, use of marijuana was relaxed and somewhat common and no one seemed to care. But most people either didn't use it or used it rarely. Unless all my friends were unusual. But who knows about now? Can't you just wait until you get there to find out? Are you so desperate about using pot that you must know before you even arrive? The mind boggles. Generally, since it's not entirely legal (yet), yes you need to be cautious, using it only in private and not in university buildings. Personally, I would not do anything illegal in a university dorm since that's the place you'd get busted and held strictly accountable. But off campus living has much greater freedom. Try to follow the rules. This is a really freshman question, by the way.",
            "score": 2,
            "author": "Drew2248",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; As a proud alum of Colgate University, I was trained to find out such information. It's called a \"google search\". Come on, kid, you could learn how to do this, too. \n\nI was asking about the campus and off-campus culture and enforcement of the law. Something that’s not so easily googlable. And did you pause to consider that I *already googled it* and didn’t find a satisfactory answer? It appears not, and you just assumed I’m an idiot and you replied with condescension. \n\n&gt; Can't you just wait until you get there to find out? Are you so desperate about using pot that you must know before you even arrive? The mind boggles. \n\nAll I did was ask a question and you’re assuming I’m desperate to use it. It looks like Colgate didn’t teach you the critical thinking skills it was supposed to. And again, with the condescension. \n\n&gt; This is a really freshman question, by the way.\n\nAnd this is a really pretentious, snobby response. I really hope you’re not representative of Colgate alumni. Prick.\n\nEdit: just took a glance through your comment history and it confirms that you’re a real snobby asshole. It’s sad that you feel the need to shit on people so much over such petty things.",
                    "score": 4,
                    "author": "batossatoss1234"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Also, Hamilton is wonderful and I lived there for several years with my wife after graduating, and before grad school.",
            "score": 1,
            "author": "MacEnvy"
        },
        {
            "level": 0,
            "comment": "My experience was that there was some risk as a freshman, and you will get in trouble if you set the fire alarms off, but other than that, youre good. Go to the old golf course (field of dreams or whatever), be alert, and don't run, and you should be fine. It will get cold, but I advise you not to smoke in your room until you are off the hill, and these things are worth considering when dealing with housing in the future (dont live in drake/bryant as a sophomore, if youre crafty, you can get onto the balconies in cutten). Some of the other freshmen will feel compelled to call campo or complain, but this mostly dies away by your sophomore year. GL, have fun, go gate (attended 2010 - 2016 for reference, and yeah, I know that is a long time)",
            "score": 1,
            "author": "mastershake142"
        },
        {
            "level": 0,
            "comment": "For dorm use, I highly recommend finding a connection for oil cartridges. Eliminates the smell, most of the smoke, and easy to conceal. Most Campus Safety officers are also unaware of what they look like if you’re looking to dose in public. A battery to use it will only cost $10-20, and they can last even a 24/7 stoner 3-5 days, up to a week or more.",
            "score": 1,
            "author": "Not_A_Trombone"
        },
        {
            "level": 0,
            "comment": "Hamilton, NY has the highest per capita marijuana arrests in the nation, mostly because of naive students and bored cops. Get to know the townies. They know what’s up.\n\nPS: Campus Safety are real cops, not security guards. They will happily take you in to the station if you piss them off.",
            "score": 0,
            "author": "MacEnvy",
            "replies": [
                {
                    "level": 1,
                    "comment": "arrests?? i thought pot was decriminalized in NY? i have no priors so wouldn't a first time possession just be a fine and that's all? not surprised to hear that bored cops would get on a power trip tho...\n\nthanks for the heads up!",
                    "score": 1,
                    "author": "batossatoss1234",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s probably changed some since I was there fifteen years ago. And I was wrong about the arrest rate - the stat I read was from Hamilton County, NY, not Hamilton, NY. I actually grew up in Hamilton County and it’s not surprising, LOL. The cops are even more bored there than in Madison County.\n\nDecrim means your charges will be much less or dropped. Doesn’t mean they won’t take you in and book you in the meantime. Especially if you’ve got an ounce or something.",
                            "score": 1,
                            "author": "MacEnvy"
                        }
                    ]
                }
            ]
        }
    ]
}