{
    "id": "ivma9b",
    "score": 5,
    "title": "Prospective student with a few questions!",
    "author": "lotsofmasonjars",
    "date": 1600491992.0,
    "url": "https://www.reddit.com/r/Colgate/comments/ivma9b",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello! I’m currently a senior in high school, and Colgate is almost certainly going to be my ED. I still have some questions though...\n\n1) Can someone who is not interested in the Greek/party scene still find a few friends?\n2) Are there any job opportunities in Hamilton? It would be nice to earn a few extra dollars. \n3) Are the internship opportunities really as great as rumored? It just seems too good to be true! Also, are the opportunities equal among all majors?\n4) How bad are the winters? I’m from California, so I don’t really have a concept of extreme weather. \n5) How generous are the financial aid packages? I definitely need financial aid, but my mom makes a pretty good living. Even when our cost of living is factored in, I’m still worried that we’ll get a hefty bill. \n\nThank you so much!",
    "comments": [
        {
            "level": 0,
            "comment": "Current Sophomore here. Can't answer all, but I'll do my best.\n\n1. Yup. This is me. I try to stay away from Greek life and have a lively friend group here at Gate, and the only time I've ever heard of active social hindrances was in trying to go to the biggest parties as a (male) freshman.\n\n2. Absolutely, I have several friends who have worked in Hamilton. Usually restaurant stuff, at least among my circles, but I'm positive there's more - I just never went looking.\n\n3. This is what I meant by inability to answer; I haven't reached this part of the experience yet, haha.\n\n4. Many of my friends are international students from warmer climates, and they certainly aren't fans of the winter weather. I've never had an issue with it, but take my opinion with a grain of salt - I love the winter.\n\n5. Very generous. If you feel like what's offered isn't enough, don't be afraid to request a reevaluation and push for more: every time I've done this, Colgate has gone above and beyond the original number I was hoping for.\n\nFeel free to DM me any other questions you might have. I'm going to sleep now, but you'll definitely hear back from me within a day.",
            "score": 3,
            "author": "CJPIV",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, especially for the information about financial aid. That’s such a relief to read.",
                    "score": 1,
                    "author": "lotsofmasonjars"
                },
                {
                    "level": 1,
                    "comment": "Hey I have some questions, can I pm you?",
                    "score": 1,
                    "author": "isheetaborah2021",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "go for it!",
                            "score": 1,
                            "author": "CJPIV"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "1. The student body here is typified by friendliness.  It's very inclusive, Greek or not.  Everyone finds their group of friends.\n2. This depends.  There are a few farms looking for help, and my housemate worked at the Colgate Inn. I am not sure about on/inside campus (?).\n3. The loyal alumni networked is all it is said to be. There's even a formal program for those successful in their fields to be matched with a student to mentor.\n4. The winters are extreme, but fun. People slide down hills with dining hall trays.  The swans get captured and taken out of the pond before it freezes .  It looks beautiful, but it is no fun walking to class in - 12 degrees.  Most people ae petty outdoorsy and take the winter in stride. Think snow ball fights peppermint Schnapps , and warm wool socks\n5. Not sure about this one.",
            "score": 1,
            "author": "EsmeSalinger",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! Sliding down on dinner trays sounds so fun!",
                    "score": 1,
                    "author": "lotsofmasonjars"
                }
            ]
        },
        {
            "level": 0,
            "comment": "People have already answered a lot of your questions well so just adding some additional color:\n\n2.\tIn addition to town job opportunities, there are a ton at Colgate itself. I have a lot of friends that worked at the gym/library/other and they all enjoyed it.\n4.\tI was from California as well. The winters are brutal, no way around it, but its honestly just kind of part of the experience that you look back on fondly. Helps bond everyone that you’re all living in the cold together and slipping your way down the hill. Buy a warm coat and you’ll be fine!",
            "score": 1,
            "author": "DisgruntledWombat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! Did your working friends struggle to balance their jobs and schoolwork?",
                    "score": 1,
                    "author": "lotsofmasonjars",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No not at all! They seemed to be very flexible with the amount of hours worked. Some jobs are also very chill, I know my friends that worked front desk at the gym would frequently just do their homework during their shift since they were just checking people in.\n\nAlso, if you have any interest in science/research, there are a lot of opportunities to get involved with research early and most professors have funding to pay you from it. My sophomore year I think I made like $10/hour analyzing bugs under a microscope, was pretty cool!",
                            "score": 1,
                            "author": "DisgruntledWombat"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "1. Absolutely. Fraternities are a much smaller part of life at Colgate than they were when I was a student there. The majority of students do not belong, so you'd be fine if you weren't interested in joining. I did join a fraternity for the friends and social life, but mine was a fairly non-traditional fraternity with the highest GPA on campus, meaning smart people. \n\n2. Yes, you can ask around and might find a decent part-time job. Can you bail hay? That's a joke, son!\n\n3. I don't know, but yes I think they are. Colgate makes a big effort to provide internships, but you'd do best to ask the Admissions people and also contact the particular department you were interested in interning with -- if you know that already. I majored in English, and I don't think they had internships. Maybe reshelving books in the library? \n\n4. I'm from California, too! My daughter who grew up in California also went to Colgate a few years back and has since graduated. She now lives in SF and is making a ton of money (very common for Colgate grads, it seems). Forget all the endless weather worries. Having actual seasons to enjoy is a real pleasure. Fall is drop-deap beautiful with the leaves changing colors and the crisp fresh air. Winter is beautiful, too, with the snow everywhere though it does get a bit old after awhile. You know, kind of like the endless heat and forest fires in California get old! But I really like winter since I like colder weather. And so on. Embrace the seasons, and you'll find it's not so bad. You can always tell a California kid on campus. He's the one in the tee shirt, shorts, and flip flops in December. Oops! Forgot to bring a winter jacket. \n\n5. Colgate is very generous with financial aid. Again, ask the Admissions people and they can give you the details. If your family can pay tuition, you're likely to have to pay some tuition as financial aid is for those who need it the most -- naturally. We paid tuition for my daughter to go to Colgate, but then we never even asked for financial aid because our combined incomes were pretty high at the time. We didn't feel rich, but there you have it. \n\nGood luck. It's a great school that will change your life. And it's a beautiful campus, perhaps the most beautiful college campus in the country.",
            "score": 1,
            "author": "Drew2248",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi from California, too! My daughter who grew up in California also went to Colgate a few years back and has since graduated, I'm Dad👨",
                    "score": 1,
                    "author": "dadbot_2"
                },
                {
                    "level": 1,
                    "comment": "Thank you so much!",
                    "score": 1,
                    "author": "lotsofmasonjars"
                }
            ]
        }
    ]
}