{
    "id": "uh83rz",
    "score": 7,
    "title": "What’s social life like at Colgate, is it easy to make friends?",
    "author": "Mr_Mayhew_",
    "date": 1651551978.0,
    "url": "https://www.reddit.com/r/Colgate/comments/uh83rz",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m a transfer student who was accepted for fall 2022. Colgate is my top choice and I’ll likely be going here, however I’m concerned about the remote location. My previous college was in a major city with minimal Greek life, so I’d mainly go to bars/clubs downtown. \n\nWhat do you guys typically do on the weekends, and is there a good party scene? I’ve heard the jug accepts anyone with a Colgate ID, but I was wondering if there was anything else.",
    "comments": [
        {
            "level": 0,
            "comment": "Five star party school",
            "score": 5,
            "author": "whitewaterwoodworker"
        },
        {
            "level": 0,
            "comment": "Give frisbee a try, if you’re into casual exercise and a free tight-knit social group 🥏",
            "score": 4,
            "author": "frackboi"
        },
        {
            "level": 0,
            "comment": "Wild parties?",
            "score": 3,
            "author": "yoitsmewhatsup",
            "replies": [
                {
                    "level": 1,
                    "comment": "Some get a bit wild. I live close to a few party houses and they seem to have fun.",
                    "score": 1,
                    "author": "ComradeFlyer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How wild? What kind of fun?",
                            "score": 1,
                            "author": "yoitsmewhatsup"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a current student, look to join clubs if you’re into partying a lot of people go to the jug on the weekends to party. There’s also Greek life parties from time to time that you can also go to. Due to Colgate being so remote the jug is definitely a popular place to go.",
            "score": 3,
            "author": "Throwaway839221",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is it difficult getting into frat parties as a guy at Colgate? I didn’t have much difficulty getting into frat parties at my old school, but I’m assuming it’ll be more difficult since I don’t know anyone\n\nAlso, where would clubs typically party, since everyone is required to live on campus? In my experience you can’t really throw parties in the dorms cause of RA’s",
                    "score": 2,
                    "author": "Mr_Mayhew_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s kinda hard but they’ll sometimes throw parties for unaffiliated people so it never hurts to try. People can also live in apartments off campus so you can party there.",
                            "score": 2,
                            "author": "Throwaway839221"
                        }
                    ]
                }
            ]
        }
    ]
}