{
    "id": "12boqac",
    "score": 3,
    "title": "Film Minors",
    "author": "Huge-Analyst-7338",
    "date": 1680626487.0,
    "url": "https://www.reddit.com/r/Baruch/comments/12boqac",
    "media_urls": [],
    "other_urls": [],
    "postText": "Anyone minoring in film? For the liberal arts minor? Lmk if you took any of the required courses, love to hear your experiences with professors, coursework and workload",
    "comments": [
        {
            "level": 0,
            "comment": "Honestly it’s only fun if you’re really into film. I found that when you do heavy analysis on something you love you start to like it less. The professors are really good cause they understand the material and are able to reference hundreds of years of film history.",
            "score": 6,
            "author": "aliennatedkid",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know the courses are always a little later in the day. Did the timing of the courses compromise your schedule?",
                    "score": 1,
                    "author": "Huge-Analyst-7338",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well I love schedule builder because I was able to make my intro to film class it’s own day which is good cause then I could go sit there for three hours and not worry about what classes I would have after or before. So if you have that option I would take it otherwise it drags along with your other classes.",
                            "score": 3,
                            "author": "aliennatedkid"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm minoring in Film right now and am taking my first class out of the three which is history of film. It's a good choice if you like watching movies and analyzing the meaning behind them. However, the major downside to Film are the lack of available classes.",
            "score": 4,
            "author": "SSpSpoSpouSpout",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also, I noticed that the classes are schedule a lot later. I try to find classes so my day ends at around  12-2. How does History of film fit in your schedule?",
                    "score": 1,
                    "author": "Huge-Analyst-7338",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "9:55-11:30 synchronous",
                            "score": 1,
                            "author": "SSpSpoSpouSpout"
                        }
                    ]
                }
            ]
        }
    ]
}