{
    "id": "12nii8k",
    "score": 11,
    "title": "honest opinions Baruch vs Boston College",
    "author": "zekromy123456789",
    "date": 1681592472.0,
    "url": "https://www.reddit.com/r/Baruch/comments/12nii8k",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey guys im a prospective student to baruch macauly and want to study statistics and quantitative modeling. I have an offer from BC that will have me paying 47k a year. I have the macauly tuition scholarship from baruch but live too far away and will hopefully dorm for around 15k. I hope to work in quantitative economics in an investment bank, hedgefund, bank, etc. If i go to BC i will major in economics and hopefully double major in comp sci with a data science concentration. If i go to baruch i will probably major in stats and q modeling and minor in econ. I am extremely on the fence and literally have no clue which school to choose. Any help advice or recommendations would be appreciated. Thank you!!!",
    "comments": [
        {
            "level": 0,
            "comment": "as a transfer, i can say that campus life and \"the college experience\" are not for everyone. baruch has a great ROI and can help you out with some really great career outcomes, but both are great choices. also, it is totally possible to make friends and socialize here (despite what this subreddit may have you believe lol) but there is no greek life, so if you have always dreamt of being in a sorority/frat, baruch might not be the best option.\n\nthat being said, if you're really on the fence, you can think about which school would result in fewer loans so that you can graduate with minimal debt.",
            "score": 21,
            "author": "lynziesummer"
        },
        {
            "level": 0,
            "comment": "SQM from baruch won’t be enough if you want to do quantitative economics at an IB or or a hedge fund. SQM just isn’t rigorous enough compared to an Econ and comp sci double major at Boston college. If you want to go to baruch, might I suggest the financial mathematics major instead of SQM. The fin math major is the most rigorous major at Baruch, there’s maybe around only 30-40 fin math majors at Baruch and it has the best job prospects out of any other Baruch major. Prepare to do a lot of math whether you do fin math at Baruch or Econ &amp; comp sci at Boston college.",
            "score": 7,
            "author": "IDivineChaos"
        },
        {
            "level": 0,
            "comment": "Baruch is a great bang for your buck and ROI. Although, you will get caught up in the hustle culture here very quickly. Make sure to apply to IMG, FES, 50Five right away and find your place in the school. You will get an offer somewhere, but it will be an extreme uphill battle and often feel like your only motive here is to get that offer. Unfortunately, you will get 0 real college experience here. Baruch is strictly business for students looking to break into the industry. You can have your fun once you have that offer, but it will be a grind because many banks still don’t take the name of Baruch that seriously. If this does not sound like the experience you want to have, then go with Boston College.",
            "score": 5,
            "author": "melodiorrrr"
        },
        {
            "level": 0,
            "comment": "I’m a Macaulay student at Baruch and I think Baruch is worth it. Graduating without student loans is already a huge plus. Baruch has a great network of alumni in finance. If you leverage that network, get involved on campus, and do your best to prepare yourself for interviews, you can definitely break into IB or investing. Being in NYC is also a great plus. Networking events and other finance related opportunities will be more accessible to you. \n\nIt’s definitely not going to be easy and you’ll always have to “prove” yourself to people who don’t think anyone outside of a target school can work in finance. Also, the Macaulay requirements are a pain in the ass. Baruch is not a typical college experience either. Most of us are commuters and there’s definitely that vibe of hustling and ambition that can be really motivating. I dormed my freshman year and it helped slightly to be around other people. If you want to have a college experience you have to be very proactive and get involved. Otherwise, it can be really isolating. If you choose Baruch, I’d reccomend applying for IMG, it’s a great learning opportunity with an extensive network. Overall though, a Baruch degree will give you more value than alot of expensive private schools.",
            "score": 12,
            "author": "Gullible_Pen_8489",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well said! I went to CCNY for an undergraduate degree and had a great 4-year college experience.  I eventually pursued both a MSE and MBA for a top 5 graduate institution.  \n\nThe OP can supplement their Baruch degree with a Graduate Degree for a top business school.  Baruch is a well regarded business school inside and outside of New York City.",
                    "score": 3,
                    "author": "testing1992"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would almost always go to the campus school with name recognition in these situations. I learned all too late that the college experience is not something that you want to miss out on, and with Baruch you miss out on it entirely.",
            "score": 24,
            "author": "IceTheChilled",
            "replies": [
                {
                    "level": 1,
                    "comment": "Amen^",
                    "score": 1,
                    "author": "penelopejaneski"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Take into consideration: what major do you like better?, cost, do you want to go to a school with a campus or a commuter school, can you deal with the weather in Boston or not? Do you prefer a dorm that is close to campus(BC) or a dorm you have to commute to using mass transit(Baruch). Good Luck!",
            "score": 2,
            "author": "Opposite_Carrot_9546",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also check out Rate my Proffesor and look at each school ratings and student comments.",
                    "score": 1,
                    "author": "Opposite_Carrot_9546"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Get your ass to Boston college lol",
            "score": 2,
            "author": "Iamwillingtolearn"
        },
        {
            "level": 0,
            "comment": "BC has a better reputation in econ than Baruch. I would recommend going for BC.",
            "score": 4,
            "author": "Immediate-Ad-6412"
        },
        {
            "level": 0,
            "comment": "Can only offer my thoughts about SQM at Baruch since that's what I graduated with at Baruch. If you do end up with going with Baruch coupled with what you want to do in the future, SQM is a great start or Finance/Financial Mathematics major as well. And, if you decide to change your mind about your career choice as you attend Baruch like many do, SQM is still pretty flexible choice to go into other career like being a data analyst/data scientist/business intelligence analyst/marketing analyst rather than just IB/Quant at bank. I think a general question you should ask yourself is how you can into the career you want while minimizing your student loan debt post-grad? From there, think about whether BC or Baruch can offer you that choice",
            "score": 1,
            "author": "TheYellowThing"
        }
    ]
}