{
    "id": "12rwz9t",
    "score": 0,
    "title": "who is better for cis 2300 Albert Croker or Taoufik Ennoure",
    "author": "Inner_Novel_4612",
    "date": 1681917465.0,
    "url": "https://www.reddit.com/r/Baruch/comments/12rwz9t",
    "media_urls": [],
    "other_urls": [],
    "postText": "someone explain who is better out of the two and why based on homework's, tests, lectures when teaching in class and if they have any projects.",
    "comments": [
        {
            "level": 0,
            "comment": "I had ennoure, he’s chill in the sense that his lectures are quick and he’ll answer questions for the most part. Lectures include him pretty much speed reading slides and then going through a coding example for classwork. You just submit it at the end of class and the assignments due are based off the classwork. Sometimes they’re a little bit harder but overall, very easy class and professor. Attendance doesn’t matter but I’d recommend going to class to keep up, I believe he still teaches the 3hr sections, and his classes normally end earlier, they’re typically an hour, an hour and a half max. Exams are online, 20-25 mc &amp; true/false theory section and then a coding problem where you’d write a program.",
            "score": 1,
            "author": "baruchstudentt-away",
            "replies": [
                {
                    "level": 1,
                    "comment": "Was all the work done in class and handed in their weren’t taken at home to finish. How is the professor when he is teaching the material. Does the professor always make his exams online each semester?",
                    "score": 0,
                    "author": "Inner_Novel_4612",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The classwork (called labs) are done in class on laptops, nothing’s pen and paper. The solutions for the lab are given in class so if you’re really confused, you can wait till he goes over it but definitely try to get used to coding. When he’s teaching, he just quickly goes over the slides and materials, so be sure to ask questions if you’re lost and he’ll typically explain it. And all exams are online and open book.",
                            "score": 1,
                            "author": "baruchstudentt-away"
                        }
                    ]
                }
            ]
        }
    ]
}