{
    "id": "13d3ams",
    "score": 3,
    "title": "EXTRA GRAD TICKETS",
    "author": "redditbaruch11",
    "date": 1683660321.0,
    "url": "https://www.reddit.com/r/Baruch/comments/13d3ams",
    "media_urls": [],
    "other_urls": [],
    "postText": "HOW TO REQUEST EXTRA TICKETS FOR GRADUATION?",
    "comments": [
        {
            "level": 0,
            "comment": "https://studentaffairs.baruch.cuny.edu/studentlife/commencement/  \nGuest Tickets\r  \nTickets for admission to the Commencement Exercises are limited to guests of the graduates. The graduating student does not need a ticket. You cannot request guest tickets if you are not attending the ceremony.\r  \n\r  \nFilling out the Guest Ticket Request Form reserves your tickets, but is not considered complete until you have purchased your cap &amp; gown. Students who have completed their in-person order will be sent an email to claim their guest tickets at a later date, around May 22.\r  \n\r  \nEach graduate will receive four guest tickets for cap &amp; gown orders completed online by the April 30, 2023 deadline. After the deadline, you may receive a reduced number of guest tickets. If there are extra guest tickets after the initial distribution has been completed, these guest tickets will be distributed on a first-come, first-serve basis determined by cap &amp; gown purchase date. Guest tickets are subject to availability based on the number of students attending the ceremony.\r  \n\r  \nPlease note that guest tickets are free with the purchase of your cap &amp; gown. Guest tickets are not available for sale. Selling guest tickets is strictly prohibited.\r  \n\r  \nExtra Guest Tickets\r  \n\r  \nIf there are extra guest tickets available, they will be issued on a first come, first serve basis determined by when you have completed your order (i.e. purchased your cap and gown). You can request extra guest tickets on the Guest Ticket Request Form. You can request up to two extra guest tickets.\r  \n\r  \nNote: While we will try our best to fulfill your request, there is no guarantee that you will be able to get the extra guest tickets you request.\r  \n\r  \nDistribution\r  \n\r  \nGuest ticket distribution will occur electronically via Ticketmaster. Please go to the Guest Tickets page for full instructions.",
            "score": 1,
            "author": "mrhobby"
        }
    ]
}