{
    "id": "13dc4kt",
    "score": 4,
    "title": "What is the minimum # of credits you need to take per semester?",
    "author": "2Nawsty",
    "date": 1683681082.0,
    "url": "https://www.reddit.com/r/Baruch/comments/13dc4kt",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am currently attending BMCC and I will be transferring to Baruch in Spring 2025 instead of Fall 2025–this is because I am only taking 12 credits and I refuse to take any more. However, I’m curious as to what the minimum is in Baruch? Will I be able to get by if I only take 12 credits per semester as I am now?\n\nPS. I am diagnosed with ADHD so I am choosing my mental and physical well-being over anything else.",
    "comments": [
        {
            "level": 0,
            "comment": "Same as every CUNY school, 12 to maintain full-time student status",
            "score": 8,
            "author": "Effective_Pitch_2974",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay thank you. So my advisor won’t force me to take 15?",
                    "score": 0,
                    "author": "2Nawsty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They can't force you to do anything, they are named advisors for a reason.",
                            "score": 3,
                            "author": "Effective_Pitch_2974"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If full fin aid in a normal semester like the other redditor says 12 minimum, for summer 3 is partial covered 6 is full, winter I'm not sure never took. I also did 4 classes  on reg semester and then 1 or 2 during summer cause I feel that summer is too long even if you have internships you loose the feel of school and are lazy as the semester starts.",
            "score": 2,
            "author": "apalatnikov7491"
        },
        {
            "level": 0,
            "comment": "You can take one class per semester to maintain the status",
            "score": 2,
            "author": "mrhobby"
        }
    ]
}