{
    "id": "13e4urg",
    "score": 2,
    "title": "Dropping Pre-calc",
    "author": "dan8808",
    "date": 1683756343.0,
    "url": "https://www.reddit.com/r/Baruch/comments/13e4urg",
    "media_urls": [],
    "other_urls": [],
    "postText": "I just dropped pre-calc for the second time in my first two semesters at Baruch. I want to finally pass this class, so I was wondering if it is better to take pre-calc for a full term or as a summer or winter class where I can only focus on pre-calc. Also, what are some good professors that will make my life harder than it already is?",
    "comments": [
        {
            "level": 0,
            "comment": "You only get three tries or Baruch drops you. Be careful. Find the best professor with the best rating even if it means early morning class, Sunday class, or summer classes. You NEED to pass on your third try and pass both finals and the class with a certain grade.",
            "score": 8,
            "author": "ConfidentProfit4236B"
        },
        {
            "level": 0,
            "comment": "when i retook precalc, i chose to take it during the summer and not the spring so i could focus only on precalc. the class goes by quickly but personally, since it was 5 weeks of constant work and class was 4 times a week, i was able to retain the class material a lot better, compared to when i took the course during the fall. just remember that you’re only given 3 tries so try your best to find a good professor and do well in the class so you can pass both the final and the overall class. the practice finals that are given on blackboard were helpful for me so definitely look through those along with the video explanations for each chapter that the course goes over. good luck!",
            "score": 3,
            "author": "honeybubx"
        },
        {
            "level": 0,
            "comment": "Try taking it in another school if you can, if your having trouble.",
            "score": 2,
            "author": "Affectionate_Try2114"
        },
        {
            "level": 0,
            "comment": "Omg i literally dropped my precalc class 20 minutes ago, it’s my second time as well. I’m retaking it in the summer.",
            "score": 2,
            "author": "Individual_Panic1032"
        }
    ]
}