{
    "id": "13n13wp",
    "score": 7,
    "title": "Graduation ceramony",
    "author": "Tmrf1",
    "date": 1684604316.0,
    "url": "https://www.reddit.com/r/Baruch/comments/13n13wp",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey so I’m just wondering how the graduation goes. Do they announce your names? Do you walk across a stage? Do they post your name anywhere?",
    "comments": [
        {
            "level": 0,
            "comment": "This is how it goes, you show up there in your gown/cap and seat yourself...Then you listen for the next 3-4 hours of speakers baruch has selected. President Wu closes the ceremony congratulating you  &amp; confetti rains down the Barclay Center. You do NOT walk the stage, you do NOT get your name called and you do NOT get your diploma during that time.",
            "score": 22,
            "author": "Lifeisajourney19"
        },
        {
            "level": 0,
            "comment": "No. No. Yes",
            "score": 6,
            "author": "mrhobby",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would also like to add that you don't get your diploma that day either. It comes in the mail in a few months.",
                    "score": 7,
                    "author": "apalatnikov7491"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It has to be money laundering or making sure someone gets a little extra money via speaker fees. No one is asking to hear multiple speakers. I recall another poster stating it was because we have such a large graduating class. I’m not sure that is the main factor but could be a contributing one. They should let us walk.\n\nUSG should get to the bottom of it, 😂",
            "score": 6,
            "author": "lossandstatic",
            "replies": [
                {
                    "level": 1,
                    "comment": "Speakers at CUNY commencements are not paid. It’s not allowed.",
                    "score": 2,
                    "author": "lepidio",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh wow that’s great to know. Thanks for the info.",
                            "score": 1,
                            "author": "lossandstatic"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is the only moment we get after working hard for 4+ years and our names &amp; pictures does not appear in the ceremony. Neither we get to walk on the stage, they should at least consider using the screens to show our names, degree, and pictures while we listen patiently for those who we have been listening to for the past 4+ years.",
                    "score": 2,
                    "author": "ISITASS2022"
                }
            ]
        }
    ]
}