{
    "id": "13px9g6",
    "score": 4,
    "title": "Grades on CunyFirst",
    "author": "henrytsui03",
    "date": 1684868158.0,
    "url": "https://www.reddit.com/r/Baruch/comments/13px9g6",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was checking my academic records for my English class and I realize that my teacher put down a grade much lower than I expected and never gave me as reason why. I emailed him about what I was missing and how I was performing but never got an email back from him. Overall, I disagree with the grade I got and would like to appeal that. Do you know who I can ask?",
    "comments": [
        {
            "level": 0,
            "comment": "https://enrollmentmanagement.baruch.cuny.edu/undergraduate-advisement-orientation/appealsanddismissals/",
            "score": 3,
            "author": "mrhobby"
        },
        {
            "level": 0,
            "comment": "You should definitely appeal and fight it. Alot of professors know students are lazy and wouldn't bother appealing it since it's time consuming so professors feel like they can give whatever they want. Dont let these professors take advantage of you.",
            "score": 5,
            "author": "Lifeisajourney19",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do they end up in favor of the students most of the time?",
                    "score": 1,
                    "author": "henrytsui03",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Only if you have substantial evidence to prove why you deserve a higher grade, yes. I personally know a guy in my BPL class who went to the dean because he got a B- because his group was lazy and he did ALL the work, and his grade was changed to a A-  after showing screenshots that his group members ignored messages to meet to do group projects and he was forced to do all the work himself. After he met with the dean, a week later his grade on cunyfirst was changed when he had the meeting.",
                            "score": 3,
                            "author": "Lifeisajourney19"
                        }
                    ]
                }
            ]
        }
    ]
}