{
    "id": "13xmon6",
    "score": 2,
    "title": "Is this schedule doable?",
    "author": "Prestigious_Bad_91",
    "date": 1685638107.0,
    "url": "https://www.reddit.com/r/Baruch/comments/13xmon6",
    "media_urls": [
        "https://i.redd.it/wfjqxfwqqf3b1.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I loved Howard singer! Def a great guy and overall professor",
            "score": 2,
            "author": "penelopejaneski"
        },
        {
            "level": 0,
            "comment": "Also the professors are:\n\nCom 3021 - Benjamin Gillespie\n\nMgt 3120 - Sara Grant\n\nFin 2000 - Jian Hua\n\nPol 3314 - Howard Singer\n\nBus 2000 (Lec - Patrick Tormey), (Rec - Amanda Babb)\n\nFin 3000 - John Bowden\n\nOPM 3000 - Kenneth Globerman",
            "score": 1,
            "author": "Prestigious_Bad_91",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bowden doesn’t make attendance mandatory but I’d recommend you to still attend class &amp; learn how to use a financial calculator. Gillespie is very kind and helpful. Schedule is doable but if you’re working, you’d have to manage your time wisely!",
                    "score": 3,
                    "author": "artisiticnuances",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you for the insight, I will definitely do that!",
                            "score": 1,
                            "author": "Prestigious_Bad_91"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Its a lot of classes, but you got mostly all great profs. So, it’s definitely doable, but can be some work. My recommendation would be that if you have a job outside of school then you consider dropping one of the classes. However, if you’re ok with like working a lot then you’re good. If you’re thinking of dropping, I would recommend dropping opm, or pol. People usually take opm after they take mgt and when they are juniors around. Plus the class can prove to be pretty tricky and difficult. Pol is a simple class and honestly would drop only if you think you’ll be overwhelmed. It’s only if you don’t want to drop any of the harder classes. This class can be retaken later on if anything.",
                    "score": 2,
                    "author": "Living_Leading79797",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you, I will definitely consider either cutting down my hours at work from 15 to about 5-10 to make it more manageable. I appreciate it!",
                            "score": 2,
                            "author": "Prestigious_Bad_91"
                        }
                    ]
                }
            ]
        }
    ]
}