{
    "id": "13ydru4",
    "score": 0,
    "title": "Transfer credit evaluation",
    "author": "tayk2001",
    "date": 1685714757.0,
    "url": "https://www.reddit.com/r/Baruch/comments/13ydru4",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey everyone, sorry if this has been asked before but I was just wondering how long it usually takes for Baruch to evaluate transcripts so they can transfer credits over from my previous university. (I did not go to a cuny before so I’m wondering if the process is different)\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "ive transferred credits two times, one from a private university and one from a suny. for the private it took like like 2 days while the suny one took two weeks. emailing them helped speed up the process, when i emailed them about the suny one they evaluated it within 48 hours",
            "score": 2,
            "author": "Key_Contact_5234",
            "replies": [
                {
                    "level": 1,
                    "comment": "who did you email? i’ve been waiting for over a month now.",
                    "score": 1,
                    "author": "Elco1600",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I emailed Transfer.Center@baruch.cuny.edu, they forwarded it to freshmancreditevaluation@baruch.cuny.edu who responded to me and notified me of my credit evaluation when it was done",
                            "score": 1,
                            "author": "Key_Contact_5234"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I did Collegenow and AP classes, the AP classes were transferred in before the semester started, but some hiccups with the College Now classes caused them to be transferred in halfway through my first semester at Baruch, just in case, make sure that you are not taking any classes that you have already taken because then those credits might be nulled. Best of luck!",
            "score": 2,
            "author": "Prestigious_Bad_91"
        }
    ]
}