{
    "id": "n98ri0",
    "score": 91,
    "title": "Required Vaccinations for In-Person Learning",
    "author": "jlyny",
    "date": 1620662717.0,
    "url": "https://www.reddit.com/r/Baruch/comments/n98ri0",
    "media_urls": [
        "https://i.redd.it/ngob5kxsgby61.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Kind of expected this.",
            "score": 41,
            "author": "Villa39NYC"
        },
        {
            "level": 0,
            "comment": "Only students are required to have vaccines--not faculty and staff. Faculty and staff are NOT REQUIRED to be vaccinated, so the preventative safety measures are unbalanced. There are also some legal issue about forcing people to take a vaccine that has only emergency approval, so this may or may not actually be enforceable.",
            "score": 12,
            "author": "libby21212",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow. What an oversight if that’s true. How can you require one integral part of the school to get vaccinated and not the other?",
                    "score": 5,
                    "author": "Roxith"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So New York City schools will officially only offer in person classes this fall thus eliminating online options and forcing the vaccine on students but yet not their staff? Yeah ok. I'm the one that's crazy.",
            "score": 7,
            "author": "geoalvarez01"
        },
        {
            "level": 0,
            "comment": "Why do the people who don’t want the vaccine want to be on campus? You want to be around people yet you don’t want to protect them. \n\nStart getting used to public places being open to only vaccinated people. People don’t want to assume the risk by being around people who am spread a virus. \n\nAnd stop with the “young people can’t die from it” okay why would you even take the chance of having that virus affect you, your breathing, and your life.",
            "score": 49,
            "author": "mehedi7218",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great take. Completely agree. If you don’t want to take the vaccine because you are hesitant I get it and I’m sorry that the rest of the world is trying to move on with them assuming they are completely safe. Yes getting it is *somewhat* risky but the longer we get from the start of the vaccine trials and the start of actual vaccinations, the safer it seems. I don’t know of any side effects from getting the vaccine. I *do* know that there are a lot of people still suffering from long COVID and we have very little understanding of that still. Sure young people might not die if they get it but it can still affect your life and maybe permanently. I’ve read too many long COVID horror stories. Some people who got it early last year still haven’t recovered completely or still haven’t gotten sense of smell or taste back. It’s not something we can fuck around with and take a chance on. I trust the vaccine science. I do not trust people to be smart and stay COVID free on their own. As the number of vaccinations go up, the cases are dramatically shrinking. I’m graduating from Baruch but I’m glad that CUNY is implementing this.",
                    "score": 8,
                    "author": "BackgroundAd817"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Based on your conflict of interests, I believe that Moderna and Pfizer vaccines were FDA approved. As someone said in the review that safety and health are our top priority. It's a combination of online, hybrid, and in-person classes. If you don't like to get up and move your rear end, that's fine. But it's turning around, and we're not reversing back when the infection rates spiked. If any of the individuals you would like to get any of the vaccines, check what ingredients are inside the vaccine injection and check yourselves what you're allergic to based on your blood test results. It's not very hard to do.",
            "score": 5,
            "author": "Remote_Klutzy"
        },
        {
            "level": 0,
            "comment": "I'd bet cash that virtually everyone who's hesitant on this took multiple different vaccines as a kid to enter the public schooling system. But we can pretend this is the first vaccine ever &amp; we should \"totally wait\" for something...",
            "score": 9,
            "author": "sudosciguy"
        },
        {
            "level": 0,
            "comment": "It’s a balanced divide, I’m personally against the vaccine and I don’t want in person classes so I’ll settle for online, I just hope they won’t use any petty tactic and reduce online courses to force in person hence the vax",
            "score": 19,
            "author": "KO944994",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can tell you are a person who assumes a lot, i never said its not safe or not fully tested. I have my personal reasons why I'm against it and you could've chosen to respect my opinion and minded your business. But Tiny Toma always chooses violence.",
                            "score": 16,
                            "author": "KO944994"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good",
            "score": 8,
            "author": "NoMoreWhiteFerraris"
        },
        {
            "level": 0,
            "comment": "Good. Online classes aren’t for me.",
            "score": 12,
            "author": "DerivativeOf0",
            "replies": [
                {
                    "level": 1,
                    "comment": "The fall semester is my last semester so like I’d rather go in at least two days a week",
                    "score": 15,
                    "author": "jlyny",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same here. I’ll be part time so hopefully it’s a chill semester.",
                            "score": 4,
                            "author": "DerivativeOf0"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great news!",
            "score": 19,
            "author": "mrhobby"
        },
        {
            "level": 0,
            "comment": "This is just bs. Not only are they forcing students to get the vaccine but they dont realize that a vaccine wont do anything. I got my vaccine about 2 months ago and guess who got sick? If you place vaccinated people in a class of 30+ don’t expect everything to run smooth. If I get sick during class time that wont stop me from going to class. You guys forced us to get a vaccine now don’t try to close down the college if people start getting sick. I know damn well if people start getting sick after their vaccine CUNY will be in a big trouble. This sounds more like want an education? Well then get vaccinated.",
            "score": 3,
            "author": "ButterflyNew4068"
        },
        {
            "level": 0,
            "comment": "What a tragedy lol",
            "score": 5,
            "author": "nitoboy"
        },
        {
            "level": 0,
            "comment": "Meh kinda obvious that this was gonna happen. I've been looking at both sides of the argument and both sides make good points. I'm all down for this once it gets full approval and we see some more long term studies, but for now il hold off.",
            "score": 8,
            "author": "apalatnikov7491"
        },
        {
            "level": 0,
            "comment": "Amazing",
            "score": 5,
            "author": "drragonberry"
        },
        {
            "level": 0,
            "comment": "Education should be available to everyone regardless of their personal medical choices.  This is especially true for CUNY schools that serves many minority students. No one should have to sacrifice their education!",
            "score": 1,
            "author": "IllustriousLion4805",
            "replies": [
                {
                    "level": 1,
                    "comment": "There were already several vaccines required. Not doing this would put others at risk who would not feel safe going to school",
                    "score": 16,
                    "author": "Collegebored12"
                },
                {
                    "level": 1,
                    "comment": "“Sacrifice their education” you are not sacrificing your education, you are protecting yourself and the others around you. If you don’t like it you can transfer to other school that doesn’t require vaccinations, go to online school, take a gap year, or take online classes. You have plenty of educational options if you don’t want to get vaccinated",
                    "score": 11,
                    "author": "kookiesntae"
                },
                {
                    "level": 1,
                    "comment": "Nobody is sacrificing their education. Public safety and public health is a top priority, and if someone doesn’t feel comfortable getting the vaccine, that they have online classes as an option",
                    "score": 15,
                    "author": "jlyny"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What if we choose not to get it?",
            "score": -7,
            "author": "movement_33",
            "replies": [
                {
                    "level": 1,
                    "comment": "Then you do online learning.",
                    "score": 33,
                    "author": "jlyny",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "or you can go to a school that doesn't require it.",
                            "score": 23,
                            "author": "whtsabagginses"
                        },
                        {
                            "level": 2,
                            "comment": "Is it confirmed that there will be online learning?",
                            "score": 1,
                            "author": "Escaped_Philosphy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Some classes are online, hybrid or in person. It depends of the The course",
                                    "score": 1,
                                    "author": "jlyny"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Expelled",
                    "score": -10,
                    "author": "SteaknSalt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is not cool.  coercing students with these \"vaccines\" that are still undergoing clinical trials.  Especially when students are one of the least affected demographics.  What's the point of learning opportunity cost if we're not even allowed to make decisions for ourselves?",
            "score": -39,
            "author": "firewaterstone",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's only if students choose to go in person. Pretty sure they could still do online classes should they prefer not to get vaccinated.",
                    "score": 28,
                    "author": "celbuod",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Make sure you come back to this comment when Fall online classes are limited or barely given because of the ongoing cheating scandals, software issues, lack of control (than in person), and so many other things. Maybe then it will open others people's eyes.",
                            "score": 5,
                            "author": "geoalvarez01"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Pfizer and Moderna vaccines will most likely get full FDA approval by the end of the year. At that point all businesses and government entities that house large amounts of people will likely be requiring the vaccine.\n\nAs for the \"least affected demographics\" how many times must I explain, and you go to college so you should be able to think critically about these things, that while adolescents are not likely to die from COVID, they serve as a vector for transmission to those unvaccinated and vulnerable. Vaccines reduce the likelihood of transmitting COVID, so if you're looking at the big picture problem (AKA millions of people) it's a no brainer that we must get the most amount of people vaccinated.",
                    "score": 28,
                    "author": "whtsabagginses",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Furthermore, data is showing that more and more people, young and old, are suffering from post-infection symptoms. It's a no brainer and it's so crazy privileged that the US has free and available vaccines for it's citizens and people are refusing to take them. Meanwhile in the rest of the world, people are literally dying to get their hands on the short supply of vaccines. What a fucked up world we live in.",
                            "score": 17,
                            "author": "whtsabagginses"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Pfizer and Moderna vaccines will most likely get full FDA approval by the end of the year. \n\nso you admit they are not approved yourself.  Clinical trials end in 2023, so \"by the end of the year\" is inaccurate.  \n\nThen you present a utilitarian argument in your second paragraph.  It's a shame the billionaires pushing this \"get vaccinated\" agenda don't just use a fraction of their money to solve world hunger (and thus save a lot more lives than covid has taken).  \n\nPseudo-intellects like yourself parroting the corporate mainstream media are giving up the rights of everyone else.  And then a bunch of you label yourselves \"liberal\" yet can't see the hypocrisy.  \n\nIf you never belonged to a group who has been fucked over by the govt (Tuskegee syphilis experiment for example, or Japanese intermittent camps, or very recently migrant women being sterilized at the border....), who have EVERY RIGHT to be skeptical of the government, then it is **you who are privileged**.",
                            "score": -27,
                            "author": "firewaterstone",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "1. I don't know how you can make any assumption of my racial background through Reddit but ok, go off.\n2. I'm not gonna explain to you the differences between EUA approval and full BLA approval. If you're that interested in the FDA process you can do the research yourself.\n3. Just chill out dude. You anti-vaxx anti-government people always make personal attacks when I made a completely civil reply to your comment. Chill.",
                                    "score": 27,
                                    "author": "whtsabagginses",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You are making assumptions yourself.  You call me anti-vaxx because i am against this one specific, rushed special-interest-pushed \"vaccine\", with no regard to how I feel about MMR or the polio vaccine (actual vaccines that meed the required guidelines which include *concluded clinical trials*)\n\nRemember when that Gardasil vaccine was recalled, even though it was marketed for years and years?  \n\nSorry for being able to think independently, and for being able to use historic data to support the \"my body my choice\" side. \n\n You are a fellow college student.  You know it is easy to find data to support **either** side of this argument **from credible sources**.  \n\nAlso, if you've ever taken marketing and critical thinking, you'd also understand that this vaccine BS has been nothing but a very successful ad campaign in modern history.",
                                            "score": -17,
                                            "author": "firewaterstone",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; \"my body my choice\"\n\n😂🤦🏽‍♂️\n\naight. im done.",
                                                    "score": 19,
                                                    "author": "whtsabagginses"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Hey if you don’t want to take the vaccine just don’t come in person :).That be them rules. The people who are vaccinated took it to protect themselves and others on campus. If you don’t have the vaccine you’re highly likely to spread the virus to other students. And if people who aren’t vaccinated are still in public places and spread the virus, the pandemic will just be on for longer, which I assume you don’t want :). You’ll be considered a risk and you won’t be allowed in public places. There are going to be a lot of other things that are going to be open to people who are only vaccinated.",
                                                    "score": 12,
                                                    "author": "mehedi7218"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "omg bro take it or don't but arguing here on reddit isn't going to change the decision they made.",
                                                    "score": 6,
                                                    "author": "bbqueeen",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The point of college is for educated minds to have discussions.  For thesis's to be conducted, rebutted, and analyzed. \n\nI don't need to change the decisions of others.  But I don't need to be downvoted (which is censored) either for stating things that are objective. \n\nIt's ironic that you think I'm the one trying to force others to do something, when all I'm defending is the right for people to practice body autonomy.",
                                                            "score": 0,
                                                            "author": "firewaterstone",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "you long replies are falling on deaf ears. if you're really enraged about it, reach out to the dean or start a petition. \n\nIf you really want my opinion, I took that gardasil vaccine and lived to tell the tale, when I was admitted I had to provide documentation of vaccination for a plethora of things and was missing some shots so I took them to provide safety to myself and fellow students. if you don't want to take it, then don't and continue online courses or apply for another college that doesn't require it but all I see here is a big ego misdirecting anger at their classmates.",
                                                                    "score": 15,
                                                                    "author": "bbqueeen"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}