{
    "id": "ycqse3",
    "score": 88,
    "title": "THIEF AMONG US",
    "author": "Klutzy-Adagio-5477",
    "date": 1666656634.0,
    "url": "https://www.reddit.com/r/Baruch/comments/ycqse3",
    "media_urls": [],
    "other_urls": [],
    "postText": "So, at the beginning of the year, on a different account I put out a post saying if anyone wanted an access code to X class I got it, due to McGraw Hill sending me an extra one by accident. This code still worked and was unopened and unscratched. Currently, I am a senior I work in an internship that pays me pretty well, but I thought to myself why don't I just give this away for an extreme discount rather than free? I didn't give it for free because we as humans do not appreciate things that are just given to us for nothing, so I charged 20 dollars for a 100-dollar code. An 80% mark down even though I could have sold it to a third-party college prep store for 50 dollars because it was unused but I wanted to help out my fellow peers. So the day came when I had to give the code, I told the kid \"If it doesnt work, do not pay me\", a day later he messaged me and said it worked and was thankful about it and told me to wait a week before accepting payment which I did because I didn't care about the money. So a month goes by and I message him, the day after he deletes his Reddit account and vanishes off Reddit. Hey, a\\*\\* h\\*\\*\\*\\*, I didn't even care about the money but the principle of not being a dick head is something you never learned of. I gave you something at an extreme mark down because I thought I was doing you a favor. Remember karma is a bitch and to my fellow Baruch peers if you going to sell anything get the money upfront. Sometimes people take kindness as a weakness, and he is lucky I dont report him because I figured out what room his class is in and if I wanted to be petty I could inform the deans and I do have the receipts to prove I bought the code but I won't or will I?\n\n\\*15 UP VOTES AND I LEAK THE MESSAGES (I WONT REVEAL ANY PERSONAL INFROMATION, FOR HIS SAFETY)",
    "comments": [
        {
            "level": 0,
            "comment": "Leak the messages",
            "score": 15,
            "author": "Trainer8568"
        },
        {
            "level": 0,
            "comment": "Cash in my hand first. Then code. You can accept a fuck off if you don't agree.",
            "score": 7,
            "author": "Nervous-Passion-1897"
        },
        {
            "level": 0,
            "comment": "U kinda asked for it, still wrong tho",
            "score": 4,
            "author": "ciggywet"
        },
        {
            "level": 0,
            "comment": "leak the name",
            "score": 3,
            "author": "Several-Athlete-920"
        },
        {
            "level": 0,
            "comment": "don't be kind",
            "score": 7,
            "author": "Several-Athlete-920",
            "replies": [
                {
                    "level": 1,
                    "comment": "Learned that the hard way, practically was giving away a code that was worth more on the third party market because I wanted to help out a kid. People think being nice is a form of weakness now. I do not even care about the money but instead I care about the principal of not being a shitty person.",
                    "score": 12,
                    "author": "Klutzy-Adagio-5477",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "naw man, in the end, principles are all you have. Help people, bring some good in this world.",
                            "score": 0,
                            "author": "SighLetMeAnswerThis"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "u can be kind just dont be an idiot, transactions should be simple no extra steps.",
                    "score": 1,
                    "author": "ciggywet"
                }
            ]
        },
        {
            "level": 0,
            "comment": "📮",
            "score": 5,
            "author": "Collegebored12",
            "replies": [
                {
                    "level": 1,
                    "comment": "Amogus",
                    "score": 3,
                    "author": "meowmoomeowmoon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How is this going to impact lebron’s legacy?",
            "score": 2,
            "author": "fsiutf"
        },
        {
            "level": 0,
            "comment": "Tl;Dr bearcats/business students being bearcats/business students. Now wants upvote clout to “leak” this anon",
            "score": 2,
            "author": "Collegebored12"
        },
        {
            "level": 0,
            "comment": "Leak the messages and the class he's in",
            "score": 2,
            "author": "briant519"
        },
        {
            "level": 0,
            "comment": "Haha Among Us haha like the videogame haha Among Us",
            "score": 2,
            "author": "Jegg1358",
            "replies": [
                {
                    "level": 1,
                    "comment": "We to old for this bruh",
                    "score": 2,
                    "author": "Correct_Suggestion98",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "never too old to have fun",
                            "score": 5,
                            "author": "Several-Athlete-920"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Among us? Sus.",
            "score": 1,
            "author": "Lime_Singularity",
            "replies": [
                {
                    "level": 1,
                    "comment": "Amogus",
                    "score": 2,
                    "author": "meowmoomeowmoon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "that sucks but what will the dean do",
            "score": 1,
            "author": "meowmoomeowmoon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe he will call in the National Guard to ensure that this man gets his $20 for the code that he didn't rightfully own anyways.",
                    "score": 7,
                    "author": "JohnPaulJoeJack"
                }
            ]
        },
        {
            "level": 0,
            "comment": "$20 too immaterial. tbh if it were me I wouldn't pay you as well. not worth the time and effort. and it sounds to me like you don't want to transact with the fair market value anyway. \n\njust keep track of your losses --&gt;\n\nDr. Loss on subscription\n\nCr. Allowance for subscription losses",
            "score": -19,
            "author": "PuzzleheadedGolf4272",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hmmm interesting a fresh reddit account made today. If you are him I know what class you got QNT in, a friend of mine is in the same class as you. I might be petty and infrom the deans or I might be nice and not but remember life will give back what you give, only remember this if you are him.",
                    "score": 10,
                    "author": "Klutzy-Adagio-5477"
                },
                {
                    "level": 1,
                    "comment": "What about subscription receivable??",
                    "score": 4,
                    "author": "Collegebored12"
                },
                {
                    "level": 1,
                    "comment": "20$ is less than 100$, if someone is trying to give you a hand to lift up you shouldn’t turn around and say “you should’ve lifted me higher”. That’s ungrateful and you know it",
                    "score": 8,
                    "author": "Mrs_Awesome111"
                },
                {
                    "level": 1,
                    "comment": "You’re a P O S 🫡",
                    "score": 1,
                    "author": "IHaveaPforyourV"
                }
            ]
        },
        {
            "level": 0,
            "comment": "amogus",
            "score": -3,
            "author": "meowmoomeowmoon"
        }
    ]
}