{
    "id": "141keke",
    "score": 168,
    "title": "The three pillars of a balanced extracurricular resume",
    "author": "Ben-MA",
    "date": 1685983344.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/141keke",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/ApplyingToCollege/comments/vs2mgq/how_do_admissions_offices_actually_process_50k/),",
        "https://www.reddit.com/r/ApplyingToCollege/comments/v6bdz7/the_type_of_ecs_i_wish_i_saw_more_of_as_a/)"
    ],
    "postText": "What does the perfect extracurricular resume look like?\r  \n\r  \nFour years of research at successively more prestigious institutions? Robotics championship? Deep commitment to one area of \\~mastery\\~? National titles? Patents? Publishing a book?\r  \n\r  \nEh, maybe.\r  \n\r  \nAs an admission officer at Vanderbilt, I was often asked “what do you all \\*want\\* to see?” I know the question was asked earnestly because of [how competitive admissions is](https://www.reddit.com/r/ApplyingToCollege/comments/vs2mgq/how_do_admissions_offices_actually_process_50k/), but my honest response was “I dunno, what do you do? Do that and then tell us about it.”\r  \n\r  \nAOs don’t \\*want\\* to see one particular thing from the hundreds of thousands of high school students who apply to college each year. How would that even work?\r  \n\r  \nInstead, I want to share with you a balanced approach that our team uses with our students to approach extracurriculars in a way that leads with learning and fun while also leaving room for as much depth as you care for. It’s our three pillars of a balanced EC resume.\r  \n\r  \nSchool-based engagement, something altruistic, and something independent or creative.\r  \n\r  \n**#1 School-based engagement**\r  \n\r  \nThis is where just about everyone should start.\r  \n\r  \nPretty much every high school has clubs, organizations, and teams you can engage with. Probably starting in 9th grade you’ll engage with your school in some meaningful way that is of interest to you. Maybe that’s the chess club, orchestra, ski team, theatre, or debate.\r  \n\r  \nSchool-based engagement is a great way to make friends, try something new, and develop your interests. From an admissions perspective, it shows engagement with a school community. Remember, colleges aren’t just classrooms and labs for 18-22 year olds. In many cases they are living and learning communities that prioritize social and academic aspects in balance.\r  \n\r  \nI call this engaging within the four walls of your high school. It’s good for you and demonstrates to colleges that you might be an active community member.\r  \n\r  \nThat being said, I’ve written plenty that there is a ceiling to the engagement within the four walls of your high school. For your own learning and admissions chances, you should move beyond that into the next two pillars.\r  \n\r  \n**#2 Something altruistic**\r  \n\r  \nAs mentioned above, colleges aren’t just classes and labs, and students aren’t \\*just\\* students. They are community members of their school, their classes, their teams, their cities, their states… and members of a community take care of each other.\r  \n\r  \nSo, the next pillar of a balanced EC resume is to do something for someone else. Something altruistic.\r  \n\r  \nNow, there are levels to this.\r  \n\r  \nThere’s baseline volunteering which is a great way to start. Maybe that’s through a community organization, place of worship, or local non-profit. If you’re looking to deepen your engagement, check out my post on how to turn volunteering into a standout EC.\r  \n\r  \nJust like with the ceiling on school engagement in admissions, there can be a ceiling to altruistic engagement within the confines of a well-defined volunteer-type role. Part of that is addressed by the third pillar, but you might also look for ways to engage more deeply with the organizations you already have a relationship with.\r  \n\r  \nFinally, here’s the big one.\r  \n\r  \n**#3 Something creative or independent**\r  \n\r  \nNow, I want to make sure people understand the scope of what “counts” in admissions. Here’s my very first Reddit post about the [type of ECs](https://www.reddit.com/r/ApplyingToCollege/comments/v6bdz7/the_type_of_ecs_i_wish_i_saw_more_of_as_a/) I liked to see as an AO at Vanderbilt.\r  \n\r  \nThe long and short of it is, if you do something interesting to you outside of the classroom, it’s fair game in your college applications.\r  \n\r  \nNow, I say creative or independent. Anything that stretches and challenges your brain could fit in this category. If you are tempted to comment and ask if your thing counts, I can go ahead and tell you that yes, it does. No need to ask :)\r  \n\r  \nThis might be your band, your research, your art show, your internship, your care for family members, your podcast, your small business or non-profit… the possibilities are literally endless.\r  \n\r  \nThe idea here, again, is balance. Engage with your school, help others, and then challenge yourself. Do something other people aren’t doing.\r  \n\r  \nBy the way, **you will probably fail at this**. At least some. I hope you do. I hope you fall on your face and screw up and struggle. Seriously. Education is the process of not knowing, trying, learning, failing, trying a new strategy, and improving over time. So feel free to not get it right the first time.\r  \n\r  \nAnd parents, I implore you to support your kid (duh), but also let them struggle with the realities of failure without fixing it for them. I’ve met thousands of high schoolers, college students, and parents, and I can pretty quickly tell the kids who have developed the independence of a young adult from those who have been propped up for the past 17 years.\r  \n\r  \nBesides, you’ll have to write a supplemental essay about failure at some point 🙂\n\n\r(Side note--while a part-time job doesn't fit neatly into these buckets, it's a totally valid and helpful activity that colleges do want to know about! Whether you're supporting your family or earning some extra cash, you're also learning a lot, and that'll be good essay fodder too.)\n\n\rSo there it is! Whether you are gunning for a highly selective school or applying to your local state college, I believe if you do these three things you will find a lot to enjoy and learn in high school--and have success in admissions. As with everything I write about extracurriculars, I encourage you to take college admissions out of the equation, at least at first. Do what you like to do.\r  \n\r  \nPeace ✌🏻",
    "comments": [
        {
            "level": 0,
            "comment": "Agree with all of this.  Here's an example of how this breaks down for one student I know (not all of these may make it onto the college application):\n\nSchool based engagement:\n\n* sang in the school's optional \"select\" choir all four years (requires extra rehearsals and performances in addition to those related to the student's normal school choir)\n* top rating on highest classification piece at state vocal competition all four years\n* NHS\n* one of two students chosen to rep the choir program at their school's recruiting events\n* chosen to mentor incoming freshman as part of their school's mentorship program\n\nSomething altruistic:\n\n* volunteers to teach younger kids at their music school during summer day camps (only a few weeks each summer, though)\n* part of a mixed chorus featuring adults with cognitive disabilities and their friends &amp; family (student has a personal connection)\n\nSomething creative / independent:\n\n* plays electric guitar in a garage band with other students at their school; they've performed live shows at public venues (granted, mostly attended by other students from their school)\n* runs their younger sibling's at-home piano practice, serving as a sort of assistant instructor to the actual piano teacher.  Includes coaching during daily practices, creating a practice schedule, etc.\n* composes original works for piano and/or voice (may or may not translate into any sort of official recognition; yet to be determined)\n* multiple summers spent performing with a selective youth choir that's part of a regional music festival (granted, only 10 days each summer)",
            "score": 44,
            "author": "Ok_Experience_5151"
        },
        {
            "level": 0,
            "comment": "I’m not gonna read that but I’m assuming he’s spitten facts",
            "score": 71,
            "author": "Sufficient_Pumpkin90",
            "replies": [
                {
                    "level": 1,
                    "comment": "based comment",
                    "score": 35,
                    "author": "Ben-MA",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "based or cursed?",
                            "score": 1,
                            "author": "McNeilAdmissions",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "based",
                                    "score": 1,
                                    "author": "Blackberry_Head"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The three pillars gives you nice broad guidance on what you want to do but the problem is that, along with Aggravating_Humor’s comment is that it quickly devolves into “bring me a rock”.\n\nPillars 1 and 2 provides useful, actionable advice:  \n\nbe engaged at school and volunteering but there are rapidly diminishing returns when doing so.\n\nClub/SGA officer + sport is likely good enough baseline school engagement.  Some volunteering hours is likely good enough baseline altruism along with the service hours needed to graduate.\n\nPretty much every candidate will have this plus the usual NHS, robotics, blah blah blah.\n\nNo need to join a dozen school orgs if it’s just more of the same.\n\nGot it.  Makes sense and it’s good info.\n\nPillar 3…the important one that may help you stand out…unfortunately turns into “Bring me a rock”.\n\nhttps://powerof3leadership.com/challenges/unmet-expectations/bring-me-a-rock/\n\nOnly without the feedback loop where the boss tells you this isn’t the rock they wanted and gives you a little more information about the desired rock.\n\nYou get one shot at figuring it out.\n\nSo nobody has real clue what rock is desired except it probably should be a super unique rock different from the rocks everyone else is bringing to the boss because otherwise you look like everyone else…unless everyone is also bringing super unique rocks and you should just work at McD’s instead.\n\nMkay.  Great.  \n\nI know the post is intended to be helpful but it doesn’t really help in figuring out what rock to bring.\n\nWhich is why kids create non-profits, get a published paper or do other cargo cultly things because the last kid that created a non-profit with the same GPA and SAT scores got into Princeton. \n\nArguably figuring out what’s the right rock is part of the “challenge” for trying to get into a T20 but downplaying the difficulty of a “perfect” pillar 3 EC (ie work at McDonalds) doesn’t really help.\n\nCollege Vine and others have Tier lists for ECs.  \n\nhttps://blog.collegevine.com/breaking-down-the-4-tiers-of-extracurricular-activities\n\nInfo like rough percentage of admits have Tier 1 and/or Tier 2 ECs gives kids more realistic insight into the odds of getting into a school like Vanderbilt.  \n\nMy kid had, at best, high Tier 3 ECs…more mid than high.  With just 4.0 UW GPA and moderate SATs (that she didn’t submit) we burned her EDs on reaches (Vanderbilt was ED2) without a lot of insight whether or not it was a completely pointless activity.  We thought it was a super long shot but the odds might have even been a lot lower than we thought.\n\nAmusingly part of that decision process was I would have paid full freight for Vandy but hesitated about NYU.  She waitlisted into NYU so maybe ED2 into NYU might have worked.\n\nCollege apps are painful for hard working but only slightly above average kids that wants to get into more than their moderately well ranked flagship…which she got into with enough money that tuition is covered…which arguably is the better deal overall.",
            "score": 17,
            "author": "vinean",
            "replies": [
                {
                    "level": 1,
                    "comment": "There's a lot here.\n\nPart of what I believe and practice is that kids shouldn't be doing something only because they think that's what admission officers want to see. I tried to address that with this intro,\n\n&gt;As an admission officer at Vanderbilt, I was often asked “what do you all \\*want\\* to see?” I know the question was asked earnestly because of how competitive admissions is, but my honest response was “I dunno, what do you do? Do that and then tell us about it.”  \n&gt;  \n&gt;AOs don’t \\*want\\* to see one particular thing from the hundreds of thousands of high school students who apply to college each year. How would that even work?\n\nI don't think the \"bring me a rock\" example fits well here, because that implies that there's something specific that AOs are looking for and that I won't just tell you what it is. That's just not the case.\n\nIn fact, and I mean this in a literal sense not an argumentative sense, that's a strawman argument. I'm saying there is no rock. AOs aren't asking for a rock. They want to see students be themselves, do cool stuff, and then some *actually truly exceptional* students do stand out in the process. Not everyone can get into a highly-selective school.\n\nWhat College Vine's tiers miss is what actually helps more students stand out at highly-selective schools, which can broadly be described as passion projects. Or, in pillar 3, something creative or independent. They jump straight from winning a prestigious national award, which very few people can or will do, to being president of debate club, which hardly stands out at all. They briefly mention leading volunteer efforts, but most of what they're writing about is school-based engagement, which in my experience, has a \"ceiling\" on how helpful it is in college admissions.\n\nQuick examples of projects my students or students who I've evaluated have done in the past few years that have stood out in highly-selective admissions:\n\n* Get a bill passed in state legislature that helps people with the disability they have\n* Have a podcast and non-profit that teaches kids financial literacy *and* was included in a statewide curriculum\n* Host a TedX talk that got hundreds of thousands of views on youtube\n* Volunteer with local government and lead the youth vote-by-mail outreach program\n* Build a usable website for a local non-profit that they desperately needed\n* Set a Guinness World Record (ok, that is a tier 1, lol)\n* And plenty of students did meaningful research and wrote about it in meaningful ways\n\nOf course there are various ways to approach or categorize ECs. I hope this is a helpful way to think about what balance looks like.",
                    "score": 8,
                    "author": "Ben-MA",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "would the examples you listed at the end be pillar 3 activities?",
                            "score": 1,
                            "author": "Emotional-Welder8542",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Definitely",
                                    "score": 1,
                                    "author": "Ben-MA"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;Have a podcast and non-profit that teaches kids financial literacy and was included in a statewide curriculum\n\nI know you're the ao and i'm the rising senior but i'm going to be so fr: i've seen at least 20 people my age do something like this. is it really that impressive?",
                            "score": 1,
                            "author": "eggyeahyeah",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I bet those 20 kids with a podcast and non-profit didn't get their work officially adopted as part of a statewide education curriculum though!",
                                    "score": 3,
                                    "author": "Ben-MA",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Also, that particular kid actually has two bullet points on this list :)",
                                            "score": 2,
                                            "author": "Ben-MA"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "true, i didn't consider that part. thanks for the response!",
                                            "score": 2,
                                            "author": "eggyeahyeah",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "for sure! This gets to impact and showing that the thing you did really mattered.",
                                                    "score": 2,
                                                    "author": "Ben-MA",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Does what *type* of EC’s matter a lot? I’m possibly thinking of majoring in CS, but right now I have mostly leadership/music based EC’s. Is this a good or bad thing? Though, I am definitely going to get more involved in CS (USACO, maybe some programming projects?), (im still an underclassmen). I’m just wondering if non-CS activities have a negative or positive impact on an application, especially considering the competitiveness of the major? (For T10’s)",
                                                            "score": 0,
                                                            "author": "WastingTimeAsUsuaI"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just wanted to add here that AOs at the TOP schools want EVERYTHING, but not everything from everyone. \n\nWhat does that actually mean? It means that we're trying to build out an interesting class that upholds the culture at our schools. \n\nDoes that mean ECs being balanced? Yes, it can.\n\nDoes that mean having a \"spike?\" Yes, it can.\n\nDoes that mean having your ECs skew one way, but not necessarily a spike? Yes, it can.\n\nDoes that mean working? Yes, it can.\n\nDoes that mean having insanely unique ECs? Yes, it can.\n\nDoes it mean having some permutation of these things? Yes, it can.\n\nBut these things really mean nothing without context of the pool. What you DON'T WANT TO DO is make a profile that is the SAME as everyone else's. Is everyone at your school doing robotics, theater, track, etc, and there's only one or a couple of kids that get the roles that have real impact, whether that's a leadership position or otherwise? Maybe try something new but still within your interests. On the other extreme, if you're doing something insanely niche, but so is everyone else at your school, well... who really stands out? Everyone technically does because they do something super unique, but in effect, that sort of makes the pool sort of similar in a sense. So it would make sense to me, and this has happened several times, to have an affinity towards the kid who works a job at McDonalds and has something really different to say compared to the rest of their peers doing super unique things.\n\nAll of that to say, I broadly agree with this post, but hopefully everyone here reading understands that this is not a sure-fire way to get in. Different things will work for different students, and that's exactly the point of wanting \"everything.\"",
            "score": 17,
            "author": "Aggravating_Humor",
            "replies": [
                {
                    "level": 1,
                    "comment": "At this point, u/Aggravating_Humor *is* this sub's grain of salt 😂",
                    "score": 8,
                    "author": "wiserry",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Haha, I don't mean to be super critical of everything. I just want to provide the alternative perspective to introduce discussions that normally don't take place on the sub",
                            "score": 8,
                            "author": "Aggravating_Humor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No no keep it up your comments are always super helpful",
                                    "score": 7,
                                    "author": "wiserry"
                                },
                                {
                                    "level": 3,
                                    "comment": "Everything tastes better with a pinch of salt.\n\nI appreciated your response to my most recent post. I think most folks on this sub (us included) fall somewhere on a spectrum with two endpoints:\n\n* General to the point of being useless.\n* Too specific to be reliable.\n\nGiving effective guidance doesn't look like either one, in my view. It looks like providing flexible but specific frameworks for thinking about admissions and recognizing that there will always be exceptions to the \"rules.\" And then always trying to be more inclusive within those. (E.g., your comment about the role of jobs on my post the other day led us to make a note about working in this one.)",
                                    "score": 3,
                                    "author": "McNeilAdmissions"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Please, please keep posting! Your stuff of late has been the best advice I've ever seen on A2C, and I think it's extremely important to provide this kind of nuance when the sub has been littered with \"do this\" and \"this is how it works\" posts in the last year.",
                    "score": 8,
                    "author": "deportedtwo"
                },
                {
                    "level": 1,
                    "comment": "This relates to something else u/Ben-MA has [written about](https://www.reddit.com/r/ApplyingToCollege/comments/w2vu56/youre_not_competing_with_every_other_bay_area_kid/), albeit more focused on grades. It's an important point though - your school group is the most relevant scale for thinking about how to differentiate your application.",
                    "score": 1,
                    "author": "McNeilAdmissions"
                },
                {
                    "level": 1,
                    "comment": "&gt;Everyone technically does because they do something super unique, but in effect, that sort of makes the pool sort of similar in a sense. So it would make sense to me, and this has happened several times, to have an affinity towards the kid who works a job at McDonalds and has something really different to say compared to the rest of their peers doing super unique things.\n\nthis seems incredibly inequitable lol. at my school, several of the people who got into decent schools (think nyu/ucla/berkeley) just worked at part time jobs, while the 5-6 of us that got into hypsm had nonprofit/startup/research. i don't see how working at Mcdonalds results in having something \"different to say\" than peers doing super unique stuff",
                    "score": 0,
                    "author": "aisnake_27",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wouldn't call UCLA, NYU, Berkeley \"decent schools\" lol. They're great schools.\n\nTo your point, I have several extremely competitive pools. Think NYC and Bay Area. When you get to that level of so many students doing nonprofits, startups, research, a kid that does something like working AND STILL manages to package it well in their application is someone we love to see.\n\nMy point isn't to say that students who do something unique won't get in if the rest of the people do get in, or that if you do something like working that you WILL get in a school. I'm merely stating that at my office, we have an affinity (but this affinity does not automatically mean they get in) towards those who do something just a bit against the grain, even if the grain itself is mostly unique stuff. It's cutting through the monotony sometimes that really makes a difference for us.\n\nI'd also add that this thread and the comments have been stated in a vacuum. Those kids that got into HYPSM vs those that didn't need to be evaluated in context and holistically. Unless you have read every one's essays and their LORs, it's difficult to discern why any student would get in. It's the same reason why chance mes are useless. We're just missing a ton of context and not evaluating things in a holistic manner. This brings me back to the McDonalds thing: if you *do* have something unique to say, then say it. Package it well. Give us something you learned and gained from the experiences, but do so in a way where it brings out a real human being. Do that well, have excellent grades, strong LORs, and other strong essays, and it can put you in the running with those nonprofit kids. But even so, those nonprofit kids can still be quite similar in profiles, so it really does depend on the strength of the pool at the time. That is to say that there is no guarantee of doing anything that will secure a spot in admissions.\n\nIf the pool you're in is full of students doing all of these amazing things, then technically yes, we want other students to be at that caliber. But in building a class where, as I said, we want EVERYTHING but not from everyone, sometimes (key word: sometimes) we will opt for the student that works and does other things that aren't at the impact level of research/nonprofits/startups.\n\nYou also have to consider your experiences vs the broader pool. Not everyone in the broader pool will have the same outcomes like your school. I know because I see it every year, and it varies widely. The things I write aren't blanket statements, or at least aren't meant to be; they're offering the counterpoint to a sub that already values and overemphasizes nonprofits/research/startups way too much.",
                            "score": 1,
                            "author": "Aggravating_Humor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If a student lives in Bay Area but attends school in like PA (boarding school), do you consider them PA or Bay Area. Do you take that context into account?",
                                    "score": 1,
                                    "author": "BurningRiceHouse",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You're read in your school group. Sometimes AOs will pass it to other AOs to read when the student is from another region.",
                                            "score": 1,
                                            "author": "Aggravating_Humor"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ahem. The three pillars of a balanced extracurricular resume:\n\n1. Sleep (9, 10, 11, 12)\nHours a day: 8\n\n2. Hella bitches (9, 10, 11, 12)\nHours a day: 3 minutes (best I can do)\n\n3. RSI (11)\nHours a day: Seems like 48",
            "score": 5,
            "author": "jumpintomybed"
        },
        {
            "level": 0,
            "comment": "For doing something altruistic, how concrete does it need to be? For me, something I really like to do is give advice and help out younger athletes on my sport teams (cross country and track). I find it really rewarding to see them improve with my help and succeed more than I did at their age, but I feel there's no real way to actually quantity that for people to understand. I was hoping to write an essay about it someday if I find an applicable prompt, but I'm worried that it'll seem insincere if I don't have some kind of proof or specific time commitment. Thank you for your post!",
            "score": 2,
            "author": "Cosmic_Cat2",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; I find it really rewarding to see them improve with my help and succeed more than I did at their age\n\nThis is the core.\n\nOk, totally just from someone in marketing, not AO, but ...\n\nTrack the results, you said you helped them improve - by how much? How does it compare to others on the team without your help, did they end up with medals? Or like your instinct, how much over your own results.\n\nCreate a name for your program, 😉 it's marketing.\n\nGet it in front of your coach (better with results), maybe solicit some advice, some positive comments, maybe coach makes it a *curriculum* for people who seek/need extra help, maybe you elevate your role from just another runner to special assistant/player-trainer on the team, helping out students new to the sport. \n\nThen back to the top, track their improvements and wins (all thanks to you).\n\nWould be a good leadership, bringing proactive/protective, altruistic story.",
                    "score": 1,
                    "author": "AnotherAccount4This"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Where would music fit into ec’s if you’re planning to major in music? Will colleges care more or less about it?",
            "score": 2,
            "author": "Finn-BrawlStars"
        },
        {
            "level": 0,
            "comment": "Vanderbilt literally never accepted students from our school. Looked at Scoir data for past 4 years and several kids with HYPSM/Ivies/T20 acceptances basically never got in to Vanderbilt with like one exception. \nPresumably Vandy would like to see an EC that is specific to, well, Vanderbilt. Or a regional tie like an internship in Nashville, etc",
            "score": 3,
            "author": "soccerbill",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah, a familiar story but Nope. Things just work out that way. Vandy last year had below a 6% admit rate. I would definitely not encourage someone to create an extracurricular around a school.",
                    "score": 3,
                    "author": "Ben-MA",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Counselors at the school suggested that Vanderbilt actively takes the specific school into account - in this case a top private school in a smaller state.  Not sure if it is yield protection or not but when there is some type of “how to get into Vandy” post from someone stating a position of authority, I think it is worth presenting experiences that contradict the advice (or at least show there are other major factors that are omitted)",
                            "score": 1,
                            "author": "soccerbill"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think what makes college admissions so hard is that, among all the students with three perfect EC pillars, the vast majority will still be rejected by their dream school. Your advice is sound, but it seems like most people are already doing it, and most people are getting rejected.",
            "score": 1,
            "author": "TheStormfly7"
        },
        {
            "level": 0,
            "comment": "Hi Ben! I have a quick question. I’m a director at this successful nonprofit which i’ve been elected on the board to join a year or so ago. I’ve led the organization to help thousands of people directly, but I haven’t done any straight up “Pillar 2” altruism work. Would simply tutoring for free help me a lot for my application? Im kind of stuck on understanding that part of this post.",
            "score": 1,
            "author": "Emotional-Welder8542"
        },
        {
            "level": 0,
            "comment": "Hey there, I'm a bot and something you said made me think you might be looking for help!\n\nIt sounds like your post is related to essays — please check the [**A2C Wiki Page on Essays**](https://www.reddit.com/r/ApplyingToCollege/wiki/essays) for a list of resources related to essay topics, tips &amp; tricks, and editing advice. You can also go to [the **r/CollegeEssays** subreddit](https://www.reddit.com/r/CollegeEssays/) for a sub focused exclusively on essays.\n  \n###tl;dr: [A2C Essay Wiki](https://www.reddit.com/r/ApplyingToCollege/wiki/essays)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ApplyingToCollege) if you have any questions or concerns.*",
            "score": 0,
            "author": "AutoModerator"
        }
    ]
}