{
    "id": "141l4hq",
    "score": 5,
    "title": "What to do after life has nosedived after rejections?",
    "author": "Public_Drummer_9104",
    "date": 1685984759.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/141l4hq",
    "media_urls": [],
    "other_urls": [],
    "postText": "Everything has gone to complete shit. I won’t get into details, but everything, mental health, physics health, social life, professional relationships, family, future goals, friendships, has all crumbled because I couldn’t get into any of my top choice schools. It’s so funny. I was on top of the world just three months ago. Now I’m struggling just to wake up. I know people will say “just don’t be a pussy and keep going” but I’m burned out, completely. I have to deal with so much right now that I just can’t deal with it anymore. And there is literally not a single person I can turn to.",
    "comments": [
        {
            "level": 0,
            "comment": "Seems to be a lot going on, but let's deal with the A2C-related part ... \n\n1) Are you currently committed to a university you can afford next year?\n\n2) If so, great! You're doing better than a lot of people.\n\n3) If not, then start thinking about your options: gap year, job, CC, apply to rolling/spring admissions. There are really great universities like Pitt that are still taking applicants, since they are 100% rolling admissions.",
            "score": 4,
            "author": "grendelone"
        },
        {
            "level": 0,
            "comment": "Know a guy who got rejected by nearly all UCs in 2022, enrolled in CC as he had good number of dual enrollment credits already and is going to Berkeley this fall. Things change and as long as you get up and do your stuff - your day will come.",
            "score": 4,
            "author": "Future_Sun_2797"
        },
        {
            "level": 0,
            "comment": "This really seems like clinical depression, not something you can \"just don't be a pussy\" out of. I think you should make an appointment with a mental health clinic or therapist pronto.\n\nAlso, I think you need to recognize that your focus on getting into a top school was not constructive. Focusing on larger goals, such as discovering a true area of academic focus that you love, becoming involve in your community in things you enjoy and will make you feel connected to others, developing a healthy lifestyle that includes enjoyable outdoor activities and hobbies, etc, is far more important. These things can be easily done while attending a community college btw, and lead to great success in life.",
            "score": 2,
            "author": "Royal-Championship-2"
        },
        {
            "level": 0,
            "comment": "Your worth isn’t defined by the college you go to. Someone else suggested seeing a therapist and I’d agree, just being able to talk it out with someone can help a lot",
            "score": 1,
            "author": "Camillee1"
        },
        {
            "level": 0,
            "comment": "You can be sad about things and still not clinically depressed, but it is good to get screened by your dr.  Asssuming not, how.you rebound from disappointment is a reflection of and maker of character.  If you are set for school in the fall, try to put your summer to good use getting your mind right for the challenge ahead (did you know all colleges are tough if you do them right?).\n\nso get up, exercise (as good as taking meds, some studies say), get a job, and you will start to feel better.  Look into what is good about your future school and start to look ahead, not behind.  This will pass.",
            "score": 1,
            "author": "notassigned2023"
        }
    ]
}