{
    "id": "141mz35",
    "score": 5,
    "title": "Narrowing down college list",
    "author": "Infinite-Candy-2327",
    "date": 1685988445.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/141mz35",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! I'm a current junior gearing up for college apps, and trying to narrow down/improve my college list. \n\nFor context, I'm planning on applying for aerospace/mechanical engineering (depending on the school's major offerings). My UW GPA is most likely at a \\~3.7 after this year, weighted probably around a 4.4 - 4.5 (estimated guess). SAT is currently a 1490 (760 math, 730 reading) but just retook so hopefully will improve. EC's are pretty good. \n\nList: UMichigan, Purdue, UIUC, Texas A&amp;M, UMD, Georgia Tech, VA Tech, CU Boulder, WPI, RPI, Rose Hulman, Iowa State (very reach-y, I know)\n\nConsidering adding: Clarkson, UKentucky, Oregon State, Embry Riddle, Michigan State, Union College, Lafayette College, Bucknell, Lehigh University\n\nI'm really interested in both STEM + humanities, which is why I added union, lafayette, bucknell, lehigh to the maybe-apply list.\n\nI'd really appreciate any insight anyone can provide! Feel free to critique list/add suggestions (I need advice on safeties most I think...)\n\nThanks in advance!!",
    "comments": [
        {
            "level": 0,
            "comment": "I think you have an solid shot at a lot of those schools, but for schools like gtech, you should consider retaking your sat to have a better chance",
            "score": 5,
            "author": "northwesternlover"
        },
        {
            "level": 0,
            "comment": "You have a decent shot at those schools. For safeties, maybe consider adding schools like rit and stevens",
            "score": 4,
            "author": "student15672"
        },
        {
            "level": 0,
            "comment": "All reaches or matches - you’ll almost certainly get into a few.\n\nSuggestions are Wisconsin, Ohio State, and Penn State, based on where my 3.75/1400/MechE daughter applied, after research. Penn State as a safety, or your local state school, if it’s comperable.",
            "score": 3,
            "author": "RichInPitt"
        },
        {
            "level": 0,
            "comment": "What is your budget? What is your home state?",
            "score": 2,
            "author": "crlynstll",
            "replies": [
                {
                    "level": 1,
                    "comment": "Home state VA, budget not much of a concern, but suggestions for schools with good merit would be appreciated too",
                    "score": 1,
                    "author": "Infinite-Candy-2327",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "TX A&amp;M makes you apply for your major after freshman year. I’d avoid schools like that especially with very competitive programs. I personally know students who aren’t happy with the engineering major they ended up with at TX A&amp;M. Rose Holman is a very particular sort of school. Make sure you visit. \n\nMechE vs Aerospace….research this choice carefully.\n\nSince they aren’t too far from you, go visit GWU and UDelaware. On the opposite side of the couch try, Oregon State has a solid engineering program and the MECOP internship is very popular there. You’d possibly receive merit scholarships from these 3 schools. Run the NPCs and read about OOS merit scholarships.",
                            "score": 1,
                            "author": "crlynstll",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ok, noted. Is the first-year engineering at Purdue the same as TX A&amp;M in this regard?\n\nI've visited Rose Hulman, I liked the campus and size (which, although smaller than my HS, has several advantages IMO), but I'm hesitant about the fact that it is solely STEM, with fewer humanities options for fun exploratory classes, if that makes sense?",
                                    "score": 1,
                                    "author": "Infinite-Candy-2327"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lafayette specializes in engineering I think. Plus they have a really great campus and location. With your stats I’m guessing it would be a target for you!",
            "score": 2,
            "author": "Lys_456",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok, thanks for the insight! Anyone have advice on Union or Bucknell? I'm guessing target but not sure.",
                    "score": 1,
                    "author": "Infinite-Candy-2327"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Have you thought about [Alabama](https://aem.eng.ua.edu/)? Mean engineering SAT 1346, GPA 3.98",
            "score": 1,
            "author": "Kitchen-Taste-4643",
            "replies": [
                {
                    "level": 1,
                    "comment": "3.98 weighted or unweighted?",
                    "score": 2,
                    "author": "Infinite-Candy-2327"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You've got a solid list so far. For safeties, and depending on where you are based, I'd recommend looking at your state school / Rutgers - they've got a solid aeorspace/ engineering program.",
            "score": 1,
            "author": "tutelageadmissions",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok, I'll research rutgers, thanks!\n\nSolid list including the second half? Anything I should eliminate, or just shotgun it?",
                    "score": 1,
                    "author": "Infinite-Candy-2327",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Where do you want to be, location wise, and are you leaning more towards STEM or humanities, or a combination? I think based on these factors, you can eliminate a few schols from the second half of your list.",
                            "score": 1,
                            "author": "tutelageadmissions",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I prefer STEM generally but I also really enjoy a lot of humanities subjects/classes. Location is not really huge factor for me.",
                                    "score": 1,
                                    "author": "Infinite-Candy-2327"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}