{
    "id": "1421k6v",
    "score": 18,
    "title": "I lied on my application and got rescinded from an Ivy",
    "author": "throwaway019292864",
    "date": 1686020632.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/1421k6v",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone, I’ve been a long time lurker on the sub thru my main. I wanted to warn everyone about lying on college applications.\n\nI’ve always had strong grades and test scores. I had a few decent ecs (president of one club and did a research program with a t50). But the international competitions/published research/national leadership positions/prestigious internships etc. on this sub made me feel like I had no shot for my dream schools. So I lied. I lied about volunteering at a place related to my intended major and founding a program I co-founded. However, the thing I got caught for was, being the treasurer for a club. A small club. I made 3 lies, with two much bigger than the other but I was caught for the smaller lie. I was one of the few selected for an audit. My counselor just casually asked the club moderator if I was the treasurer and it all came to shit. My other lies haven’t been found out yet, sure they will soon. Even if they don’t, my counselor informed them of my lie and now I’ve been rescinded. This is what gets you rescinded. Not a B- in your AP Physics class, it’s lying.   \n\n\nI was admitted to 2 ivys and 3 other t20s. Now, I’ve been rescinded from one and it’s too late to ask any colleges to admit me now. My counselor would surely tell them about my lie. For the past few days, I’ve felt incredibly depressed. The worst part of it is the disappointment from my grandma. She was so excited when I got into college. I wrote about a childhood tradition I did with her in my personal statement, she knew I wrote about her. She was so proud of me and now she can’t even TALK TO ME. \n\nI’m not sure if I‘m going to enroll in community college or not. Probably will but I don’t feel like it anymore. Point of this is all to say, never lie on your college apps. The consequences of getting caught is too great. Hopefully, I will learn. I want to be a better person. Guys, be better than I was. Please.",
    "comments": [
        {
            "level": 0,
            "comment": "Valuable cautionary tale.",
            "score": 12,
            "author": "Ok_Experience_5151"
        },
        {
            "level": 0,
            "comment": "You did wrong and have now paid the consequences.  Now is the time to pick yourself back up and rebuild your character and integrity.  You can get a fine education at a CC with a transfer to 4Y.  Just put in the work and use that to regain your self respect.  You are young and allowed to make a mistake, as well as recover from it.",
            "score": 6,
            "author": "notassigned2023"
        },
        {
            "level": 0,
            "comment": "What ivies audit?",
            "score": 2,
            "author": "Available-Bat7593"
        },
        {
            "level": 0,
            "comment": "Glad you posted. That’s 1 good thing you did. Hopefully it will keep other people from doing this. Tell your grandma that you being caught should make no difference on Your relationship since why should a college decision affect that. Also you suck and I’m glad you got rescinded. I wish more people would get caught.",
            "score": 1,
            "author": "Training_Message21"
        },
        {
            "level": 0,
            "comment": "Your counselor went to far in my opinion, I don't believe such a lie should result in her informing the colleges. True, your integrity is horrible considering you lied on important factors that probably contributed to your acceptance but you were only caught for the lie of being a treasurer, which thousands of other applicants have. The impact it had on your acceptance (since they don't know about your big lies) is likely to be very little. To report for such a small lie resulting in a bleak future for you seems too extreme. Especially considering your relationship, I would have expected your counselor to have a massive decrease in respect for you but still willing to turn a blind eye. \n\nThis is not to defend you lying though. You did do something morally wrong but you shouldn't let this drag you down.",
            "score": 0,
            "author": "Fit-Kaleidoscope6422",
            "replies": [
                {
                    "level": 1,
                    "comment": "OP admitted he lied about several things. Thousands of kids who were honest got rejected or waitlisted, and hopefully one of them can take OP’s spot instead.",
                    "score": 5,
                    "author": "Available-Bat7593"
                },
                {
                    "level": 1,
                    "comment": "They probably cared more about punishing someone for the principle lying rather than giving much thought about what the actual lie was",
                    "score": 1,
                    "author": "asianmaleincs"
                }
            ]
        }
    ]
}