{
    "id": "1423o50",
    "score": 2,
    "title": "Best Websites for Best Colleges For Biology?",
    "author": "GScience8",
    "date": 1686025976.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/1423o50",
    "media_urls": [],
    "other_urls": [
        "https://www.niche.com/colleges/search/best-colleges-for-biology/](https://www.niche.com/colleges/search/best-colleges-for-biology/))",
        "https://www.collegefactual.com/majors/biological-biomedical-sciences/general-biology/biology-studies/rankings/top-ranked/bachelors-degrees/](https://www.collegefactual.com/majors/biological-biomedical-sciences/general-biology/biology-studies/rankings/top-ranked/bachelors-degrees/))"
    ],
    "postText": "Hi guys,\n\nI am currently researching colleges that have the highest quality and best reputable undergraduate biology research and programs, so I was wondering which websites are the most reliable and the best for that? I want the ranking sites that can provide most accurate data.\n\nI know US News is an option, but they rank graduate schools instead of undergrad and they seem wildly inaccurate a lot (for instance, ranking University of Utah above USC/NYU/Rice).\n\nAre Niche's Best Colleges For Biology ([https://www.niche.com/colleges/search/best-colleges-for-biology/](https://www.niche.com/colleges/search/best-colleges-for-biology/)) and College Factual's Best Biology Bachelor's Degree Schools ([https://www.collegefactual.com/majors/biological-biomedical-sciences/general-biology/biology-studies/rankings/top-ranked/bachelors-degrees/](https://www.collegefactual.com/majors/biological-biomedical-sciences/general-biology/biology-studies/rankings/top-ranked/bachelors-degrees/)) both reliable and popular among employers? Those are what I see in my perspective as the best ranking sites.\n\nIt would be so helpful if you can provide tips. I know rankings don't matter for a lot of things but I just want to know which sources are most reliable. Thank you very much!",
    "comments": [
        {
            "level": 0,
            "comment": "Rankings for biology are pretty much pointless - every school will have similar-enough resources for it.\n\nGo for schools in locations where you’ll get good jobs/internships, lower cost, good locations, etc. - and definitely focus more on grad school.\n\nGo to schools you’ll like environment-wise.",
            "score": 4,
            "author": "DoAFlip22"
        },
        {
            "level": 0,
            "comment": "Go wherever it’s cheap, they’re teaching all the same things out of the same textbooks. Find labs to volunteer in and then apply to grad school somewhere that has research that aligns with your interests.\n\nBiology is a very bad degree to go into debt for lol. The jobs are not there.",
            "score": 2,
            "author": "Prof-"
        },
        {
            "level": 0,
            "comment": "I think for bio, it’s more accurate to look at grad rankings.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "As others are suggesting, it is not possible to find a reliable source for something that cannot be done reliably.  And any sort of attempt to \"rank\" undergraduate programs in Biology would be inherently unreliable as that isn't really how anyone who matters (employers, admissions deciders at top graduate programs, and so on) are going to evaluate Biology graduates.\n\nIt would actually be kinda nice if such people evaluated the \"value added\" of different Biology programs in a rigorous way, but mostly they are just going to weakly use the overall admissions standards of the college as a proxy for your pre-college qualifications, then focus on your grades and recommendations.  And they will be perfectly fine taking someone who went to a more selective college with a \"worse\" program in Biology over the opposite, as long as that person got really good grades and recommendations.\n\nAnd of course Biology is far too popular of a major for it to be ignored by any \"top\" college.  So all the \"top\" general universities and LACs are going to have more than adequate faculty and lab resources available for undergraduate Biology studies, and indeed all of their faculties will be drawn from the same top Biology graduate programs.  And then all of them will have the ability to place their outstanding Biology students among competitive employers and graduate/professional schools--but you have to be one of their outstanding students for that to work.\n\nAnd so I will toss in as well that I think of Biology as a notable danger major for people actually interested in Biology careers because at many competitive colleges you get mixed in with a bunch of pre-med students and such, who are gunning for top grades for different purposes.  To be very blunt, if you are interested in competing for something like Biology graduate school admissions, you might actually want to stay away from colleges that would be most likely to attract such people.\n\nOf course there are going to be some such people at every top college, but I am not sure I would recommend, say, Johns Hopkins to someone interested in a Biology career.   Great for grad school, but for undergrad it is full of pre-med gunners.\n\nHonestly, your best bet would probably be just a good LAC.  If you look at the stats, in fields like Biology they tend to have wildly higher per capita PhD placement rates than comparable universities. But I'd also think any \"Ivy Plus\" university without such a strong premed-specific branding would be a better choice than Hopkins.  And so on throughout the various possible \"peer groups\" in the U.S. college landscape.",
            "score": 1,
            "author": "NiceUnparticularMan"
        },
        {
            "level": 0,
            "comment": "where you got your undergraduate degree in biology is meaningless. a masters is the minimum requirement for most life science jobs .  Grad school only cares about GPA and your GRE score and internships you have completed. \n\nYou should also realize that 31% of all biology graduate have a NEGATIVE return on investment over a 30 year time frame compared to a high school graduates- this is according to the analysis done by the Foundation For research and Equal Opportunity of over 30,000 degree programs in the USA using a Federal Data base... You should also realize that Biology is one of the worst degrees to have in terms of finances if you stop at the BS level, and even if you get a masters degree the field has a underemployment rate of about 50%.....\n\n&amp;#x200B;\n\ngood luck",
            "score": 1,
            "author": "Wild_Emu7167"
        }
    ]
}