{
    "id": "142foee",
    "score": 3,
    "title": "\"Qualifications and Major Considerations As an International Student\"",
    "author": "Ok_Presentation3067",
    "date": 1686057150.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/142foee",
    "media_urls": [],
    "other_urls": [],
    "postText": "\nHey, I am an international student from Iraq and I am curious to know if my grades meet the requirements for universities in the United States and Canada. Furthermore, I would greatly appreciate your guidance regarding the choice of a suitable major. Currently, I am enrolled in an American curriculum school where I have attained a GPA of 3.2. I am feeling quite anxious about my grades as I am entering my senior year in the upcoming academic term. Throughout my high school journey, I have actively participated in my school's debate team for a period of two years. Additionally, I had the privilege of being a member of the school theatre team last year, alongside serving as an editor for our school magazine. Moreover, I had the honor of organizing chess tournaments at my school. Looking ahead, I have made plans to undertake four AP courses next year, specifically in the subjects of Chemistry, Calculus, Biology, and History. Due to the limited offerings at my school, I will be pursuing the History course through online classes and self-study. As of now, I have yet to take the SAT exam.",
    "comments": [
        {
            "level": 0,
            "comment": "A gpa of 3.2 in an American curriculum (I assume also US style grading) is fine for many decent state schools.\n\nPlease make sure you can afford US colleges.",
            "score": 5,
            "author": "throwawaygremlins"
        },
        {
            "level": 0,
            "comment": "It depends on how your grades are in the context of your university system. If that's more an average than a very high grade there, you'll be looking at the less competitive universities for Canada, and likely without funding assistance.",
            "score": 2,
            "author": "ResidentNo11"
        },
        {
            "level": 0,
            "comment": "Hi there, I’m a bot and something you said made me think you're looking for help with international admissions!\n\n\nThe first thing you need to understand about admissions to colleges and universities is that you need to come to it with an open mind, so that you can have a balanced list. \n\n[Here’s a folder with lists of colleges that have historically been generous with international students](https://drive.google.com/drive/folders/1pu179ZFhaTlFBqepzIB1W7dPhfVxIle2)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ApplyingToCollege) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        }
    ]
}