{
    "id": "142o4xg",
    "score": 2,
    "title": "if i’m applying for my first ever semester of college in the fall, how would i go about applying for fafsa",
    "author": "RainV8",
    "date": 1686074461.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/142o4xg",
    "media_urls": [],
    "other_urls": [],
    "postText": "hello everyone, this is my first year of college starting in the fall, i want to apply for fafsa but how would i go about it since i’m new to all this",
    "comments": [
        {
            "level": 0,
            "comment": "To be clear, are you applying to college somewhere (maybe CC?) to start Fall 2023?",
            "score": 1,
            "author": "throwawaygremlins",
            "replies": [
                {
                    "level": 1,
                    "comment": "correct",
                    "score": 1,
                    "author": "RainV8",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You might be a little late depending on the state. Contact the financial aid office at your committed school ASAP.",
                            "score": 1,
                            "author": "throwawaygremlins",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "i did look it up, says i have until june 30th to apply for this fall but i just wanted a second option because it’s just a lil overwhelming",
                                    "score": 1,
                                    "author": "RainV8",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "99% of applications are done (deadline was Janurary 1st), but there should be a few rolling schools still",
                                            "score": 1,
                                            "author": "RileyK12361"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "FAFSA will still process your form and make the calculations.\n\nBut a school needs to use the results to determine your specific aid. Most schools require the data much earlier than June 30.",
                                            "score": 1,
                                            "author": "RichInPitt"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "FAFSA is a standardized form that students and families complete. The results and data are used by college Financial Aid offices to determine financial aid awards/offers. There’s nothing you apply “for”. “FAFSA” does not award aid.\n\nApplying this fall or attending this fall?  If attending this Fall, your FAFSA will still be processed/calculated until June 30, but the majority of schools required the results long ago, in parallel with the application process, to make an aid offer.\n\nIf applying this Fall, for 2024 start, you need to complete the 2024-2025 version, which should be available \\~October 1, and complete aid application forms at the schools to which you are applying.",
            "score": 1,
            "author": "RichInPitt"
        }
    ]
}