{
    "id": "142rms8",
    "score": 26,
    "title": "I'm a rising junior, any advice/tips to prepare for college?",
    "author": "rubee_bee",
    "date": 1686081813.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/142rms8",
    "media_urls": [],
    "other_urls": [],
    "postText": "title!!",
    "comments": [
        {
            "level": 0,
            "comment": "Start writing college essays early. Apply EA/ED to as many schools as possible if you can. Try and keep your grades up in senior year(senioritis is a real thing). Also make sure to spend a lot of time with your friends, you most likely won’t be seeing a majority of them after this year.",
            "score": 23,
            "author": "PurdueEngSimp",
            "replies": [
                {
                    "level": 1,
                    "comment": "Only ED to one school but EA to as many as possible",
                    "score": 7,
                    "author": "slid89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "to expand, only ED to a college that you know you would absolutely love (very top choice) &amp; would be financially feasible",
                            "score": 6,
                            "author": "Zestyclose_Oil6382"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do not begin 10 new extra curricular activities just to look good for college. Stick with one or two you already have or if you have none, pick one or two that you'll be passionate about and stick with them.",
            "score": 17,
            "author": "Zipper222222"
        },
        {
            "level": 0,
            "comment": "Do what you love. Don’t take a bunch of extracurriculars that you don’t even like to impress colleges. Also, please explore both the ACT and SAT. Personally, I live in a very SAT-dominant area, but the ACT was much easier for me. Some people that I know didn’t even realize there was an ACT. Good luck!!",
            "score": 10,
            "author": "colorecafe29",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you live in a state where the ACT/SAT is mandated, and is offered at your school, take it! \n\nMy school paid for students ACT fees (may be different at your school, see your counselor for details)",
                    "score": 2,
                    "author": "BorkBorkSweden"
                },
                {
                    "level": 1,
                    "comment": "do you know why you felt the ACT was easier? I feel like i can do well on math SAT but english is just so hard for me in SAT. Idk if ACT will be any better",
                    "score": 1,
                    "author": "WraithAks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I actually felt the same way! If you look at the ACT reading section, it is wayyy easier. The questions are very straightforward and are basically written word-for-word in the actual passage. This is mainly because of the short time that you get compared to the SAT. Also, for the SAT, on average, I was finishing each section around 30-40 minutes before time was called. This is why I realized that I would be better suited for the ACT since I could easily adjust to the shorter time limits.",
                            "score": 1,
                            "author": "colorecafe29"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As a Math Person, I can attest to this. The ACT is a lot more about Math than reading, and the \"reading\" passage for me just worked through a method I called \"priority questions.\" Below is the method for it:\n\n1. Read the intro blurb.\n2. Look for the questions that ask \"The usage of *word* in line 32 means \\_\\_\"\n3. Answer those questions\n4. Read topic sentences and organize questions by order",
                    "score": 1,
                    "author": "Storm_Sniper"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes, lots.\n\nhttps://www.reddit.com/r/ApplyingToCollege/comments/fx9oco/juniors_start_here/",
            "score": 4,
            "author": "ScholarGrade"
        },
        {
            "level": 0,
            "comment": "Get a safety (REAL safety, not a T20 that you feel you can “confidently” get into) that you actually and genuinely love. Too many people on here either put schools that they don’t like as “safeties” so in the event that they actually get rejected from all of their top choices they feel so disappointed and dejected that they only have a shitty safety to fall back on",
            "score": 3,
            "author": "LilKaySigs"
        },
        {
            "level": 0,
            "comment": "start compiling a list of schools you would apply to that you can narrow down as you go into summer before senior year",
            "score": 2,
            "author": "sweetlikecinnamon26"
        },
        {
            "level": 0,
            "comment": "Eat as much food as possible",
            "score": 2,
            "author": "MerryBirthdayUnited",
            "replies": [
                {
                    "level": 1,
                    "comment": "wait can u explain more on why for this one??",
                    "score": 1,
                    "author": "rubee_bee"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When you get into a college, if not before, read the course catalog. It contains instructions for \"Care and Feeding of Your College Education.\" Learn them so you have a clear understanding of exactly what you have to do, like residence requirements (many schools require six semesters, leaving you two to study away if you wish). You don't want to waste time due to misunderstanding a simple requirement, like imagining you have to do something when you don't.\n\nBe thorough. Read through all the majors' descriptions of themselves in the course catalog. You won't major in more than one or two of them, but pay the courtesy of reading each department's one- or two-page blurb. It will give you an idea of the breadth of things people are studying and teaching all around you at the university. When you encounter a fellow student, if you've read up on their major it'll give you a bit of a handle on what they're doing.",
            "score": 1,
            "author": "casuistrist"
        },
        {
            "level": 0,
            "comment": "Look for programs! I cannot stress this enough, there are a million programs out there there you could apply too.",
            "score": 1,
            "author": "SalaryBig4015"
        },
        {
            "level": 0,
            "comment": "READ more books. And only do activities that are meaningful.",
            "score": 1,
            "author": "FroyoCold2839"
        },
        {
            "level": 0,
            "comment": "read a lot of books",
            "score": 1,
            "author": "throwaway762542"
        }
    ]
}