{
    "id": "142x5i6",
    "score": 2,
    "title": "Define “Transfer Student”",
    "author": "MajorA1den",
    "date": 1686094870.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/142x5i6",
    "media_urls": [],
    "other_urls": [],
    "postText": "On college applications there are the options to apply either as a transfer, freshman, or international student.\n\nI’m looking to graduate high-school with a diploma as well as an Associates of Science through a Dual Enrollment program. If I wanted to further my education at another college to get a bachelors, do I apply to that college either as a freshman or a transfer student (despite already attaining an Associates)?",
    "comments": [
        {
            "level": 0,
            "comment": "You will be considered a first year applicant for admissions pretty much everywhere if your associates degree was from dual enrollment during high school.  \n\nYou could certainly still receive transfer credits from those courses though, depending on the college/university you choose.",
            "score": 3,
            "author": "BrawnyAcolyte"
        },
        {
            "level": 0,
            "comment": "Check the school's application criteria.\n\nBut if you are just graduating high school, you are universally considered a Freshman applicant, as far as I've ever seen.",
            "score": 2,
            "author": "RichInPitt"
        },
        {
            "level": 0,
            "comment": "Transfer students are defined by the universities you plan on applying to. I know some colleges define transfers as students who attended a college after graduating hs, while some might define them as students with a specific number number of college credits, regardless if those credits were earned during or after hs.",
            "score": 2,
            "author": "vinny_anon"
        },
        {
            "level": 0,
            "comment": "You will initially apply as a freshman admit.  \n\nDepending on where you are you may have a second chance to apply as a transfer if not admitted as a freshman.  In Florida, this is a thing and I know kids who weren't admitted as freshman to UF and FSU but who were admitted as transfers two weeks after being rejected.  Note:  students had pre requisites for major complete as part of their AA earned in High school.\n\nConversely, Va has GAA that guarantee admission to UVA, William and Mary with AA  3.4,3.6 gpa respectively.  They require 24 credits after high school to use the GAA end explicitly exclude DE students. \n\nSo check where you are applying what your options are should the worst happen.",
            "score": 1,
            "author": "FSUDad2021"
        }
    ]
}