{
    "id": "142zqj8",
    "score": 138,
    "title": "Everyone is a valedictorian",
    "author": "creamsoddaa",
    "date": 1686102003.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/142zqj8",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m a incoming college freshman that got into several t10s and has been following the class of 2027 pages and the people. Everyone has been posting recently since it’s the graduation season right now, and I’ve noticed that EVERYONE is literally a valedictorian, except for some very few who are sal. When I finally find a graduation post that doesn’t have a huge VALEDICTORIAN on their scarf, I see the comments shouting something like “my fav valedictorian.” I’m not exaggerating when I say that my feed is nothing but valedictorian graduation speeches for the past few weeks. Yes, I’ve also graduated as a top of my class, but this is still very, very intimidating. How is this even possible? Do these colleges select nothing but valedictorians?",
    "comments": [
        {
            "level": 0,
            "comment": "Nah, that's mostly selection bias. While higher ranked students have an edge, colleges don't accept only valedictorians. In fact, many high schools don't even have valedictorians or rankings at all.",
            "score": 153,
            "author": "thifting",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep our school is so large we don’t “DO” Val or sal or any class ranking. There’s really no point as there would be so many ties and the difference between like top 25 is so tiny…",
                    "score": 28,
                    "author": "throwawaygremlins",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yep. my high school has a population of 3600. very competitive students, all with very high grades. it’d be very difficult and impractical to try to rank them",
                            "score": 3,
                            "author": "mentally-ill-banana"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m just going to suggest that literally no one will every raise the topic of valedictorian except your parents gloating to their siblings/friends and yourself when you have your own teenagers.",
            "score": 46,
            "author": "WorriedTurnip6458"
        },
        {
            "level": 0,
            "comment": "agreeing with almost everyone in the comments about selection bias. if it makes you feel better, everyone who got into an ivy at my school for the past 2 years (about 10 people or so) were not valedictorians. they had strong gpas too but they weren't #1.",
            "score": 19,
            "author": "rubee_bee"
        },
        {
            "level": 0,
            "comment": "Valedictorians will post about their valedictorian speech.  Not many people will post \"I'm not valedictorian and didn't make a speech\".",
            "score": 13,
            "author": "RichInPitt"
        },
        {
            "level": 0,
            "comment": "If I'm reading between the lines properly, are you worried you're going to be outdone by them for class grades and opportunities? I think that's a common concern to have (right up there with imposter syndrome), but in general, these T10 places have enough resources and opportunities for each student that trying to find things to do will likely be fairly painless\n\nTL;DR You'll be ok and any relative disadvantages you might have can be worked on. You have your head in the right place, turn it into productive endeavors!\n\nAs someone who graduated from a T20, I've learned that the valedictorian title means very different things from school to school. Some people went to really easy high schools where getting A's was very manageable even if you took 6 APs a year, while other people attended the TJ/Exeter/Lynbrook-type places that are basically harder than college. If you come from a place that falls in the latter category, then you have very little to worry about if you stay motivated. Even as someone who graduated in the 2nd (maybe even 3rd) decile of a Lynbrook-esque high school, I didn't struggle to outperform people with 4.8s from elsewhere unless they went to TJ, Harker, or Gunn\n\nEven if you attended a high school in the former category, your study habits aren't static and can be changed. A lot of my classmates attended easier high schools and did have to work harder to build successful study habits, but all of them eventually did (and some even did better in the same classes I took toward the back half of college). \n\nI actually think some people (disclaimer, not all of them) who graduated as HS valedictorians and decided to rest on their laurels (so to speak) ended up doing worse than people who've had their limits tested in an environment where they were far from being the smartest. The reason is that the former valedictorians were more prone to overconfidence in their academic abilities and have to mentally transition to no longer being the biggest fish in the pond. By recognizing the fact that you're playing a whole new ballgame, you're already a few steps ahead.",
            "score": 12,
            "author": "MundyyyT",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;If you come from a place that falls in the latter category, then you have very little to worry about if you stay motivated. Even as someone who graduated in the 2nd (maybe even 3rd) decile of a Lynbrook-esque high school, I didn't struggle to outperform people with 4.8s from elsewhere unless they went to TJ, Harker, or Gunn\n\nthanks for this comment LOL i go to one of those private prep schools and it's eating me alive rn. i'm currently doing homework (on june 7!!!!!!!) when school ended over a week ago. i feel fucking *awful* because everyone around me is enjoying their summers and here i am, doing missing work because i missed 30% of the schoolyear again lol. (there's a saying at my school that if you miss more than 3 days a semester you'll never get a 4.0....and as someone who has *definitely* missed more than 3 days a semester, i can say that it's very true). i'm probably in the 25-50th percentile for gpa (3.3, school average is like a 3.65) and it kills me to be on this sub and be told that my chances at anything but a state school are nil because i have a &lt;3.9, even though i have very real extenuating circumstances (chronic illness + being LI) and i go to a school whose classes/grading system is so hard that i sometimes pop into nearby college classes (for subjects that i'm not even that great at!) and find them frustratingly easy lol\n\nit's comforting to hear this bc i always see upperclassmen go to t10s/20s/30s and coast (even while taking hard majors) and get crazy awards while partying all the time, even the ones that *didn't* get &gt;3.65s, but i guess it never really sunk in until right now. the amount of work i have to do right now sucks but i'll be grateful for it once i go to college. basically thanks for writing that out LOL i needed to hear it",
                    "score": 3,
                    "author": "eggyeahyeah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I think for most people there's a tradeoff to make when you go to a really hard high school vs. an easier one. I see it as a choice between frontloading the difficult stuff and making college the easier part and leaving it to college like most people do\n\nIt'll probably be harder to stand out for top schools than attending an easier school on the basis of your classmates being more driven, and the difficulty might overwhelm you. But that environment serves its intended purpose (college prep) extremely well once you actually start college since you've probably had to dial in your study habits and work ethic much sooner than your classmates. So in the long term, you'll still end up doing great even if you don't look as impressive in the short term.",
                            "score": 2,
                            "author": "MundyyyT"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "People saying selection bias are…only partially right. My college publishes the statistics. For the class of 2026, 31% of those who committed are valedictorians. Sal stats aren’t published, but I have no reason to believe they wouldn’t be similar. That means around half the college, by a conservative estimate, graduated val or sal.\n\nSelection bias or not, that’s a pretty staggering proportion. Does it matter? Not at all. Literally nobody here cares. Still, I don’t think explaining it away as “oh it’s just the loudest people in the room” is quite accurate, if the stats at my institution are anything to judge by…",
            "score": 8,
            "author": "ImBehindYou6755"
        },
        {
            "level": 0,
            "comment": "You are a valedictorian, so you know that just one person per graduating class is a valedictorian.  The average HS graduating class size is \\~140 (apparently) so that means .71% of graduating seniors are valedictorians.  There are \\~3.8m college first years in the US, and \\~19k T10 first years, so .5% of first years are T10.  Thus, there seem to be more valedictorians than places in T10.  This leads to the conclusion that the T10 first years will be stacked with high achievers, high SATs, people who \"worked closely with Noam Chomsky\", and the like.",
            "score": 5,
            "author": "jbrunoties",
            "replies": [
                {
                    "level": 1,
                    "comment": "my graduating class is 700😭",
                    "score": 2,
                    "author": "mentally-ill-banana",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "800 here😭",
                            "score": 2,
                            "author": "hybyehi"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How can you even have that on your college application? Our val/sal are picked after college applications are submitted in October/November.",
            "score": 3,
            "author": "SpecialNotice3151"
        },
        {
            "level": 0,
            "comment": "My friend’s daughter had 380 valedictorians in her school. 380.",
            "score": 4,
            "author": "megalomaniac2023"
        },
        {
            "level": 0,
            "comment": "Fwiw in some schools there can even be multiple valedictorians, like in a school near me they give everyone with a 4.0 the title of valedictorian. Idk how they figure out speeches tho",
            "score": 2,
            "author": "tank-you--very-much",
            "replies": [
                {
                    "level": 1,
                    "comment": "they fight for it, our school had something crazy with 7 vals and they all gave speeches, it was **very very** boring",
                    "score": 2,
                    "author": "Hopeful_Chair_3005"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There are 16k incoming freshman at US T10s and 20k high schools in the US. T10s could fill up their class with *only* valedictorians, and there would still be valedictorians who didn't get into a T10.",
            "score": 2,
            "author": "Deutsch-Jozsa"
        },
        {
            "level": 0,
            "comment": "“Do these colleges select nothing but valedictorians?”\n\nor\n\n“Are really good well rounded students usually valedictorian?” \n\nlol",
            "score": 1,
            "author": "ThoughtSafe9928"
        },
        {
            "level": 0,
            "comment": "idk, but I don't want my kid to be a valedictorian. He's talented in soccer so he prob has a better chance of going to say Stanford as an athlete who gets decent grades. If he aims for valedictorian then it will take time away from other talents he can develop. Doesn't matter in the long run if you are valedictorian. Many of the world's best leaders and innovators were not. Einstein, Steve Jobs, Thomas Edison, or modern leaders like Elon Musk, Jack Dorsey, Larry Ellison, Pat Gelsinger (intel).\n\nJeff Bezos was V\n\nBiden and Trump... no... Bush Jr... all a bit dumb, let's be real.\n\nBiden graduated with 1.99 or something. Now look at the old fart. Can you believe it - old and dumb and leader of the free world",
            "score": 0,
            "author": "SeriousPuppet"
        },
        {
            "level": 0,
            "comment": "my school actually stopped doing valediction/saluditorian before i started there and instead there’s the top 5% posted in the yearbook (maybe they have a bigger role at graduation?). funny enough, plenty of ppl who weren’t a part of it got into t10/20s / ivies (even stanford, mit, and harvard).",
            "score": 1,
            "author": "jujubean-"
        },
        {
            "level": 0,
            "comment": "I went to a T20 school with many valedictorians.  Many of them dropped out.   It doesn’t mean anything.",
            "score": 1,
            "author": "Cheerful_cal"
        }
    ]
}