{
    "id": "143l1n5",
    "score": 308,
    "title": "Can I create a new word that means the rest of my application?",
    "author": "MilkyOne2",
    "date": 1686162824.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/143l1n5",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have a lot more to talk about in my application essay, but I’m completely out of space. I know AOs have access to the internet, so my plan is to end my essay with “Thank you, and strifjekat.” I’ve already gone to Urban Dictionary and submitted the rest of my essay as the definition of that word. Do you think the AOs will find it?",
    "comments": [
        {
            "level": 0,
            "comment": "I know this is a shitpost and someone probably shouldn’t do this but it’s lowkey a cool idea 😭",
            "score": 176,
            "author": "Success0bsessed",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right if only you could attach a link like you can on Reddit",
                    "score": 41,
                    "author": "user1987623",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Omg ikr! For this you would have to depend on the AO wanting to know what the word means, and googling it themselves.",
                            "score": 22,
                            "author": "Success0bsessed"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "UChicago would prolly love it 😂",
                    "score": 37,
                    "author": "mateoisascrub1205",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My thoughts exactly",
                            "score": 3,
                            "author": "No_Craft4641"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lol it really isn’t\n\nEdit: to clarify, gimmicky does not equal good. Gimmicks get in the way of good writing.",
                    "score": -8,
                    "author": "uehfkwoufbcls",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "u/uehfkwoufbcls Bro I can use ur Reddit name as a new word in my essays",
                            "score": 45,
                            "author": "Snoo_53364",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "😭",
                                    "score": 3,
                                    "author": "Relevant-Ad4902"
                                },
                                {
                                    "level": 3,
                                    "comment": "LMFAO foul",
                                    "score": 3,
                                    "author": "eggyeahyeah",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "LOL I let my intrusive thoughts win",
                                            "score": 1,
                                            "author": "Snoo_53364"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "For anyone not feeling like looking it up here is the rest of the essay:\nDear Admissions Committee,\n\nI couldn’t fit all of this within the word limit, so I trust you’ll find your way here after looking up what Strifjekat means. I offer you a truly unique talent that sets me apart from the crowd: my unparalleled napping skills. Since I was a child, I've demonstrated an uncanny ability to doze off at a moment's notice, even amidst the most engaging of situations. In high school, I strategically found the perfect nap locations, mastering the art of sleeping through classes. In college, I honed my skills, discovering hidden nooks and empty lecture halls that became my personal sanctuaries of sleep. My napping is not a sign of laziness but a dedication to achieving peak performance and rejuvenating my mind and body. I am the nap whisperer, the somnolence savant, ready to bring balance to the world of academia.\n\nNapping has been proven to promote overall well-being and mental health. By embracing the art of napping, I can serve as a living testament to the importance of self-care and the positive impact it can have on the student body. Encouraging napping as a means of relaxation and rejuvenation would not only benefit individual students but also foster a healthier and more balanced campus culture.\n\nThank you for considering my application. If you have any further questions, please don't hesitate to wake me up.\n… and that’s my college application. Thank you, and strifjekat",
            "score": 53,
            "author": "itsanOriot",
            "replies": [
                {
                    "level": 1,
                    "comment": "strifjekat infinite loop",
                    "score": 12,
                    "author": "eggyeahyeah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Didn’t think this through, accidentally made a recursive essay. Hopefully I don’t crash my AO",
                            "score": 7,
                            "author": "MilkyOne2"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://www.urbandictionary.com/define.php?term=Strifjekat",
            "score": 10,
            "author": "trei6170"
        },
        {
            "level": 0,
            "comment": "Might I offer you my sincerest contrafibularities.\n\nMight I add that I am also anaspeptic, phrasmotic, and even compuctuous to have such pericombobulation inflicted so interphrastically upon an unknowing admissions officer.",
            "score": 8,
            "author": "DarkMoonWarrior"
        },
        {
            "level": 0,
            "comment": "Hey there, I'm a bot and something you said made me think you might be looking for help!\n\nIt sounds like your post is related to essays — please check the [**A2C Wiki Page on Essays**](https://www.reddit.com/r/ApplyingToCollege/wiki/essays) for a list of resources related to essay topics, tips &amp; tricks, and editing advice. You can also go to [the **r/CollegeEssays** subreddit](https://www.reddit.com/r/CollegeEssays/) for a sub focused exclusively on essays.\n  \n###tl;dr: [A2C Essay Wiki](https://www.reddit.com/r/ApplyingToCollege/wiki/essays)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ApplyingToCollege) if you have any questions or concerns.*",
            "score": 3,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "new response just dropped????",
            "score": 1,
            "author": "SpikyLlama"
        }
    ]
}