{
    "id": "14429o8",
    "score": 1,
    "title": "Lor related question",
    "author": "anonymous310506",
    "date": 1686208693.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/14429o8",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have shifted schools and went to a very prestigious private school for 8th, 9th and 10th grade. Then, to a small unknown school for 11th and 12th. I guess it's also worth mentioning that I'm an international student. \n\nI was a bit of a trouble maker in the first school and am skeptical about asking them for an lor.\n\nWill it be alright if I only have lors from my second school (principal+ teacher) and a supplemental or will that raise red flags?",
    "comments": [
        {
            "level": 0,
            "comment": "It will be alright. However you might lors from 2 teachers instead, a humanities and a stem based one is common for many schools.",
            "score": 1,
            "author": "Somebodynobody29",
            "replies": [
                {
                    "level": 1,
                    "comment": "I see, so 1 principal lor+ 2 from teachers?",
                    "score": 1,
                    "author": "anonymous310506",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You won't need one from your principal unless hes also your college counselor (such was the case at my school)",
                            "score": 1,
                            "author": "Somebodynobody29",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well, we don't have a college counsellor. So I guess that means I'll need his lor. If you don't mind me asking, which lors did you submit?",
                                    "score": 1,
                                    "author": "anonymous310506",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I submitted a lor from my Math teacher for 10th-12th grade and My science teacher for 9th, 11th and 12th grade. However I did those two because I knew they would write me the highest quality letters of recommendation (I hadn't had my humanities teacher since grade 9). If you can get a high quality one from both fields it's prefered and required at some schools.",
                                            "score": 1,
                                            "author": "Somebodynobody29",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ohk, thanks!",
                                                    "score": 1,
                                                    "author": "anonymous310506"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "LORs from your 11th/12th grade school is what is expected.\n\nLetters from teachers who haven’t taught you since 9th grade or earlier would be a bad idea.\n\n(what happened to 10th grade?)",
            "score": 1,
            "author": "RichInPitt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry I meant 8th, 9th and 10th. I was in that school for 3 years.",
                    "score": 1,
                    "author": "anonymous310506"
                }
            ]
        }
    ]
}