{
    "id": "144f9c2",
    "score": 6,
    "title": "Want to Impress Unis Overseas? Open a Book",
    "author": "Aneducationabroad",
    "date": 1686244885.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/144f9c2",
    "media_urls": [],
    "other_urls": [],
    "postText": "While it shouldn't come as a shock, given the academic and field focus that universities outside of the United States have, one of the single best things that you can do to impress universities overseas is to show that they read outside of class.  After all, elite places like Oxford and Cambridge aren’t just looking for great test scores, but also people who are really driven within their subject areas.  \nHowever, the choice of what to read is often a tough one.  After all, Harry Potter isn't going to do the job.  You want to come off as engaged, but at the same time, it's vacation.  \nInstead, what I typically recommend is going to the websites of departments that teach what you are interested in studying and seeing what books they list.  Believe it or not, some of the best sources for these lists are at individual colleges at Oxford and Cambridge, even if you aren't interested in studying at either of those places.    \nNot only do these lists show a lot of the books that professors overseas consider worth reading, they also tend to be pretty good books overall.  I'm not a science person, but I read just about anything Sam Kean writes, and his books are highly regarded by science faculties around the world as a great way to demonstrate further interest in a subject.  \nThat's not to say that tackling a textbook isn't a bad idea; for the right student, it can be a great move.  However, everyone needs downtime, and reading about dueling paleontologists beats trying to figure out Linear Algebra.",
    "comments": [
        {
            "level": 0,
            "comment": "New application advice just dropped",
            "score": 3,
            "author": "Xenocrates15"
        },
        {
            "level": 0,
            "comment": "&gt;However, everyone needs downtime, and reading about dueling paleontologists beats trying to figure out Linear Algebra.\n\nwhat if linear algebra is my downtime 😔",
            "score": 2,
            "author": "eggyeahyeah"
        }
    ]
}