{
    "id": "144mry1",
    "score": 10,
    "title": "what kinda GPA?",
    "author": "sgtgutrfv",
    "date": 1686262095.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/144mry1",
    "media_urls": [],
    "other_urls": [],
    "postText": "Okay so what gpa do colleges really care about? My individual term GPAs, my cumulative unweighted or cumulative weighted? (I have a good few  APs and honors so that’s why i’m asking) \n\nThanks !",
    "comments": [
        {
            "level": 0,
            "comment": "&gt;My individual term GPAs, my cumulative unweighted or cumulative weighted?\n\nYes. They consider them all",
            "score": 8,
            "author": "skieurope12"
        },
        {
            "level": 0,
            "comment": "Best way to compare yourself to others is to look at unweighted cumulative. Course rigor also factors in, but no consistency in how that is weighted. But schools often have their own way to weight. UC system publishes their algorithm on the web. Just search “UC GPA calculation”.",
            "score": 1,
            "author": "grendelone"
        },
        {
            "level": 0,
            "comment": "Common Data Sets.\n\nDepending upon what school you want to be accepted into, whether it be a state or an Ivy, relies purely upon what the school wants. These sets allow you to see the scores and grades of students accepted into schools your interested in.",
            "score": 1,
            "author": "Bite_Existing"
        },
        {
            "level": 0,
            "comment": "Schools will look at all of your data points, in the context of your school’s grading methodology, and consider it along with the rigor of your courseload.\n\nThey don’t use a number in a vacuum. My daughter’s 5.56 did not provide a huge advantage over those lowly sub-5.0 students.",
            "score": -7,
            "author": "RichInPitt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why are you being downvoted? This is accurate information and reflects what everyone else is saying.",
                    "score": -5,
                    "author": "LeSauce1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Based on the context of the point they are making, I figured that was pretty obvious sarcasm.",
                                    "score": 1,
                                    "author": "LeSauce1"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}