{
    "id": "144qes6",
    "score": 1,
    "title": "What is the checklist for applying in California?",
    "author": "Amaryllidaceaee",
    "date": 1686271184.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/144qes6",
    "media_urls": [],
    "other_urls": [],
    "postText": "My dream school is UCDavis, but I do have other UCs and CSUs in mind since those are the majority I plan on applying to. I don't want to transfer.\n\nI've just been so out of it these past few years, I'm not  completely sure how I'm supposed to do this. I'm on track to graduate with A-G and community service, but I'm just not sure what I'm supposed to do University-wise. I know I gotta do Insight Questions, apply for financial aid and scholarships, but I'm not sure what else I need to do. Can someone help me create a generic list of the forms/tasks I need to do?",
    "comments": [
        {
            "level": 0,
            "comment": "You can look at u/retiringtigermom guides and Ms Sun website beyond A2C search &amp; UC website",
            "score": 2,
            "author": "Future_Sun_2797"
        },
        {
            "level": 0,
            "comment": "You can also search on YouTube if you like it via that medium",
            "score": 1,
            "author": "Future_Sun_2797"
        },
        {
            "level": 0,
            "comment": "[https://www.ucdavis.edu/admissions/undergraduate/freshman/application-tips](https://www.ucdavis.edu/admissions/undergraduate/freshman/application-tips)\n\n[https://www.ucdavis.edu/admissions/undergraduate/apply/personal-insight-questions](https://www.ucdavis.edu/admissions/undergraduate/apply/personal-insight-questions)",
            "score": 1,
            "author": "elkrange"
        },
        {
            "level": 0,
            "comment": "I think the UC and CSU applications open in early August. The competitive CSUs admit something like this: https://www.sjsu.edu/admissions/impaction/\n\nFor that one you’ll mostly need to fill in your classes and grades and if you apply to Cal Poly SLO answer some additional questions for their point system. There are a few programs (CSUF nursing for example) that require more but mostly grades are all you need to show.\n\nFor UCs you’ll input your grades &amp; classes, fill in a chart with your extracurricular activities and their impact, and write 4 personal insight questions (you could look those up and get started now if you want).\n\nYou’ll need your FAFSA done by March. You’ll be considered for university scholarships and aid based on that. They may invite you to apply for other school scholarships and you can also look yourself for outside ones. \n\nThe UCs and even top CSUs can be really hard to get into, especially in popular majors like CS, nursing, psychology, biology and engineering. Every year there are many amazing students shut completely out of the UC or only admitted to Riverside/Merced. I know you said you don’t want to transfer, but Davis offers guaranteed transfer admission to most majors with a 3.4-3.5. So do many majors at UCI and UCSB. If you have a bunch of AP/IB credits you can often transfer after just one year of CC - although Davis doesn’t accept TAG unless you were at a CC the spring before submitting your application it does have fairly  high acceptance rates in many majors and doesn’t use PIQs in transfer admission decisions. If that’s your dream school, reconsider CCC because you can probably go there. And with CC here being so cheap it’ll cut the cost of attending in half if you don’t qualify for something like the Blue &amp; Gold plan. https://www.reddit.com/r/ApplyingToCollege/comments/126z38b/for_the_many_amazing_california_students/",
            "score": 1,
            "author": "RetiringTigerMom",
            "replies": [
                {
                    "level": 1,
                    "comment": "OMG thank you! I am in a dual enrollment program so I take regular high school classes and college classes provided by my local community college. This upcoming fall will start my second year in the program. Would I be able to transfer right after graduation? I also qualify for the blue and gold plan.",
                    "score": 1,
                    "author": "Amaryllidaceaee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You need 60 semester hours done by the end of June prior to enrollment and they must include the requirements for your major. This kind of shows how you plan for a transfer. It’s designed for a 1-year transfer but the planning process is the same. https://ca01001129.schoolwires.net/cms/lib/CA01001129/Centricity/Domain/441/UC_oneyeartransfer.pdf\n\nSomeone on here was a middle college student who was only allowed to do 11 units per term but had done summers + AP and hit everything so Davis let him TAG. \n\nI believe generally they request high school students apply for a freshman spot but depending on your major and classes you’ve had it might make more sense to graduate HS early or get your GED and then apply as a transfer using TAG. There are of course TAG limits. This chart shows them. https://admission.universityofcalifornia.edu/counselors/_files/documents/tag-matrix.pdf",
                            "score": 1,
                            "author": "RetiringTigerMom"
                        }
                    ]
                }
            ]
        }
    ]
}