{
    "id": "145975a",
    "score": 16,
    "title": "GPAs",
    "author": "extendosin",
    "date": 1686326666.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/145975a",
    "media_urls": [],
    "other_urls": [],
    "postText": "What types pf GPAs do colleges favor more? For context, I have a 3.67 UW GPA going into senior year but a 4.34 W GPA from 12 AP classes and a couple extra courses at my local community college. Will the low UW gpa hinder my chances at some selective schools?\n\nEDIT: I’m aiming for T50s",
    "comments": [
        {
            "level": 0,
            "comment": "At top selective schools, we care about both",
            "score": 16,
            "author": "Aggravating_Humor"
        },
        {
            "level": 0,
            "comment": "They’re looking at both collectively. Context matters so they can’t view one in isolation from the other. A 3.67UW with a good degree of rigor (as you have) will be viewed more favorably than a 3.67 with fewer advanced courses obviously. How much varies school to school.",
            "score": 11,
            "author": "ChampionshipPerfect5"
        },
        {
            "level": 0,
            "comment": "colleges want a high gpa in challenging classes so both",
            "score": 5,
            "author": "catolinee"
        },
        {
            "level": 0,
            "comment": "&gt; What types pf GPAs do colleges favor more? \n\nHigh ones. \n\nThey look at  everything (and care about everything) on the transcript, including individual grades, weighted GPA, and unweighted GPA",
            "score": 5,
            "author": "skieurope12"
        },
        {
            "level": 0,
            "comment": "What they want is a very high GPA with a very rigorous schedule. \n\nBoth are considered important, so reductions in either are meaningful and it’s probably not possible to say “X AP courses = Y GPA”.\n\n3.67/12 AP is better than 3.67/3 AP or 3.4/12 AP.  And not as strong as 3.9/12 AP. Beyond those obvious points, it’s an art more than a science\n\nThe type of AP courses, A/B/C’s were earned all matters, as does the rest of the application.\n\nAt the most selective schools, there will be thousands of 3.9+/12 AP applicants, which will make a 3.67 a challenge.  At many “T50” schools, you should be quite competitive.",
            "score": 2,
            "author": "RichInPitt"
        }
    ]
}