{
    "id": "145g2y8",
    "score": 1,
    "title": "Is my college essay idea valid? How can I improve it?",
    "author": "millionaireplayboy74",
    "date": 1686343013.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/145g2y8",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I'll probably write about, as my main idea, how moving around a lot as a kid throughout elementary and middle school impacted how I made friends, adapted, stuff like that. I also plan on transitioning to Covid, and how that further impacted me and my high school career (this is a maybe). That's about it. I don't really have a unique idea in that sense, so other idea help would be appreciated. Ik that how I will write it is the biggest factor, but just want some opinions on my essay idea.",
    "comments": [
        {
            "level": 0,
            "comment": "to be so fr it's a dime a dozen type essay. Lots of kids move around and we were all affected by covid.",
            "score": 5,
            "author": "Somebodynobody29",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ik but the thing is there hasnt been any major change or event in my life, good or bad, which I'm both glad for and, in this case, unhappy lol. What other suggestions do u have?",
                    "score": 1,
                    "author": "millionaireplayboy74",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Most applicants don’t have any major changes or events in their life. It’s not about what you write about, it’s about how you write about something that showcases your qualities and characteristics. You can literally talk about brushing your teeth if you can write it in such a way that highlights you as a person.",
                            "score": 3,
                            "author": "PurdueEngSimp"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!",
                    "score": 1,
                    "author": "millionaireplayboy74"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes it’s valid, but quite generic and common. Are there any specific points that are more interesting from your experiences?",
            "score": 1,
            "author": "EthanRuiLi12345",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'll defo try and add some personal details within the story as well, but I can't recall any major events or anything like that",
                    "score": 1,
                    "author": "millionaireplayboy74"
                }
            ]
        }
    ]
}