{
    "id": "145kgv4",
    "score": 0,
    "title": "I took a 10 year break and am in way over my head and need help/advice",
    "author": "AzoriusValkyrie_420",
    "date": 1686353795.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/145kgv4",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I'm a 25[mtF] who graduated High School in 2014. I decided to take some time off, because I was sorta burnt out. Planned to go back later, but just never did. \n\nFlash forward almost a decade, and I'm trying to enroll in College. I tried to just go on with doing it online, but a lot of stuff came up that I have no clue whatsoever about. \n\nOne of the questions asked me about a Counselor recommendation and told me it was required for where I was applying (RIC), but I do not remember my counselor's name, nor am I aware if she's even still at the school I graduated from.\n\nIt asked me for class statistics that I had no knowledge of. \n\nWhile a cover letter isn't required, should I submit one anyway? \n\nI also took the SAT, but that's been 10 years,\nand I don't recall my score   \n\nI honestly feel like I'm stranded in the deep end with no clue as to what I'm doing \n\nCan anyone help me sort any of this out, or have any advice for enrolling somewhere after 10 years off?",
    "comments": [
        {
            "level": 0,
            "comment": "Just start out at CC. It will be cheaper and it’s not like you are wanting to dorm with 18 yo’s. Transfer and do the uni thing when you have credits. You won’t need letters of rec or test scores.",
            "score": 9,
            "author": "milczy33",
            "replies": [
                {
                    "level": 1,
                    "comment": "Second. Get a CC semester or two under your belt instead of trying to jump right into the sleep end. Do well in those classes and you’ll be able to show a 4-year school you’re capable of succeeding. Then write an honest essay explaining why you took your academic break and how you’ve matured as a person and now feel like you’re ready to give your education your full attention and best effort.\n\nETA: I went back to school as a 25-year old sophomore and ended up being stuck with an 18-year old freshman roommate (freshman dorms were full so they stuck him with me). Do your best to avoid that kind of a situation at all costs. 18-year olds are horrible.",
                    "score": 4,
                    "author": "HairyEyeballz"
                },
                {
                    "level": 1,
                    "comment": "This is what I did, and I think it's way easier than tracking all of that information down. If your set on your way you need to talk to the admissions people at the school you're applying to.",
                    "score": 1,
                    "author": "BreRaw"
                }
            ]
        }
    ]
}