{
    "id": "14679ba",
    "score": 0,
    "title": "Will this transcript be ok for prospective yale recruited athlete?",
    "author": "caitlinelaine_",
    "date": 1686421336.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/14679ba",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! I am hoping to get recruited to run at Yale, and this has been a dream of mine since I was little. My grades freshman year were very good, and I was 11/732, but I took AP physics sophomore year and got a very bad grade (87) for a semester average. I have 5s on my other AP exams, but on AP physics I got a 3. This was not due to laziness at all, and I worked very hard in the class, but the teacher was a harsh grader and often wouldn’t show up to tutorials at all. I also have an 85 on my transcript because I took a credit by exam summer my sophomore year so that I could take AP physics early, but I had no study materials or class to work off of. These are the worst grades on my transcript. The 85 does not go into my gpa. It is my dream to run at Yale, and I would love to run for any of my other schools, but I am scared that these two grades will deter the coaches from even looking into me. I am taking the act soon, and in practice got a 36 although I know this is very different than reality. I also have good “extracurriculars” and they are things I really cared about and put lots and lots of effort into.\n\nI really, really appreciate this!",
    "comments": [
        {
            "level": 0,
            "comment": "&gt;I am scared that these two grades will deter the coaches from even looking into me\n\nThey won't \n\n&gt;I also have good “extracurriculars” \n\nFor a recruited athlete, the only EC that matters is your sport",
            "score": 3,
            "author": "skieurope12"
        },
        {
            "level": 0,
            "comment": "touch some grass. a singular 87%- a B+ on most scales is not a bad grade. also 5s on all your aps but one isn’t bad. it’s good to have high standards, it isn’t healthy to think your future is ruined because of a B+",
            "score": 1,
            "author": "addi_writes_"
        }
    ]
}