{
    "id": "146cytw",
    "score": 3,
    "title": "What colleges do you think I should apply to ?",
    "author": "JeanDaDon",
    "date": 1686435797.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/146cytw",
    "media_urls": [],
    "other_urls": [],
    "postText": "What colleges do you think I would be a qualified applicant for?\n\n\n\nI already know I’m going to apply\nTo UT Austin, NYU, Columbia, and rice even thought some of those might be a reach. I just love new York so much I’d hate to not apply if I had a chance to get in. \n\n**Desired Major:**  majoring in computer science gonna minor in business\n\n**Location:** Urban area or downtown area, I hate the country. \n\n**Financial info:** Parent makes 200k+/yr so I’ll be looking for merit based scholarship. My parent is willing to pay a good amount. \n\n**GPA:** Highschool GPA: UW - 3.5, W - 4.5. College GPA: 3.8. I did really bad during my freshman year ( Covid year) because of a multitude of issues but I’ve slowly been coming back. The college gpa stems from taking dual credit classes. I’ll graduate in may of next year with my associates. \n\n**Highest SAT:** didn’t take the SAT bc I had Covid that week, but I’ve been practicing and i get around 1400. \n\n**Course Rigor:** Ap World Hist (3) Ap lang (3). taking AP Cal and AP bio in the fall. DC classes: English comp, US hist, sociology, computer science, Texas gov, college algebra, Econ, speech, federal gov, environmental sci, humanities, psychology, art, educ, phed. Envr sci 2, huma 2, info tech. All of these classes were taken at lonestar college through my schools dual credit program. \n\n**Ext. Activities:** Currently developing a telemedicine website (alpha.afyadux.org) with a few partners. Also developing a coding learning index for my schools coding club (codinginitiative.org). And also lol making a website for web development firm that me and my friends are making (spearheaddesigns.dev). Qualified for SkillsUSA nationals for the Web design and development competiton ( gonna compete in 2 weeks). Regional runner up in TexasUIL computer programming (district champion). State runner up in SkillsUSA entrepreneurship completion ( present a software-as-a-service company). SkillsUSA Computer technology Vice-President, National English honor society Secretary and Co-Founder, Schools coding club vice president and co-founder. Technology student association President and founder. Managing tech communications at school district football games. Managed live streams at a local church (Directed cameramen, setup video tech). Spent last summer fixing school chromebooks, redoing bios system’s, and other comp-tech stuff. Doing it again this summer. \n\n**LOR/Essays:** I’m pretty good at writing and my uncle is an English college prof so I’m sure essays will be good. gonna try and get LOR’s from my counselor who I’m really close with, my tech internship manager, maybe my ap or Dc teachers, and then my mentor who’s the head of IT at a large finance firm in NY. \n\n**Current In-State Options:** UT Austin, UT Dallas, UT Arlington, Texas tech, Texas A&amp;M, UOH, Baylor university, rice, st. Thomas, and a few others. \n\nThank you in advance, and apologies for this being so long by the way.",
    "comments": [
        {
            "level": 0,
            "comment": "Make sure your reverse chanceme follows our guidelines on [how to do a reverse chanceme](https://www.reddit.com/r/ApplyingToCollege/wiki/reversechanceme).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ApplyingToCollege) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Hey there, I'm a bot and something you said made me think you might be looking for help!\n\nIt sounds like your post is related to essays — please check the [**A2C Wiki Page on Essays**](https://www.reddit.com/r/ApplyingToCollege/wiki/essays) for a list of resources related to essay topics, tips &amp; tricks, and editing advice. You can also go to [the **r/CollegeEssays** subreddit](https://www.reddit.com/r/CollegeEssays/) for a sub focused exclusively on essays.\n  \n###tl;dr: [A2C Essay Wiki](https://www.reddit.com/r/ApplyingToCollege/wiki/essays)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ApplyingToCollege) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        }
    ]
}