{
    "id": "146iim2",
    "score": 1,
    "title": "High School GPA Uncommon Calculation",
    "author": "Hello-World427582473",
    "date": 1686451672.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/146iim2",
    "media_urls": [],
    "other_urls": [],
    "postText": "My high school calculates cumulative GPA out of 4.00 scale but an A+ in any class is a 4.33 even if it is not AP or Honors. Honors classes are not given any GPA boost and AP classes only receive a 0.5 GPA boost (i.e an A+ in AP course would be 4.83 assuming you pay for the exam). You do not get the 0.5 bump if you do not pay for the AP exam.\n\nAs you probably guessed this is unconventional and as a result I don’t know how colleges would view this or even know about the situation. \n\nShould I write about the way this system works in the additional information section? Because this type of system lets people have 4.33 weighted GPAs without taking a single AP class and people who do take AP and Honors classes are punished GPA-wise, how would I communicate this?\n\nKeep in mind the GPA I am talking about is the weighted GPA and not the unweighted GPA which is also out of 4.0 but an A+ is considered an 4.33 so it is possible to have an unweighted GPA above a 4.0 and therefore my counselor recommended to put my unweighted GPA as a 4.0/4.0 even though I have a 4.2 unweighted.",
    "comments": [
        {
            "level": 0,
            "comment": "Your college counselor letter will layout what the school does for GPA. And many colleges will recalculate your GPA based on their own internal system. The UC system even publishes their algorithm ( [https://admission.universityofcalifornia.edu/admission-requirements/freshman-requirements/gpa-requirement.html](https://admission.universityofcalifornia.edu/admission-requirements/freshman-requirements/gpa-requirement.html) ). The colleges won't just take whatever number your school sends them at face value and directly compare it to other people's GPA.\n\nYou do not need to explain this to the colleges. Your school should take care of that.",
            "score": 2,
            "author": "grendelone"
        },
        {
            "level": 0,
            "comment": "Context: I will have taken 13/15 APs offered by next year but as they are more difficult classes I was expecting a 1.0 GPA bump like most other schools but it is just a conditional 0.5.",
            "score": 1,
            "author": "Hello-World427582473"
        },
        {
            "level": 0,
            "comment": "Your school provides a “school profile” with the counselors letter that explains all this",
            "score": 1,
            "author": "WorriedTurnip6458"
        }
    ]
}