{
    "id": "146m2d7",
    "score": 4,
    "title": "Am I being lied to about schools' acceptance rates?",
    "author": "lord_carrotz666",
    "date": 1686463399.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/146m2d7",
    "media_urls": [],
    "other_urls": [],
    "postText": "I use the Fiske book, SCOIR, and google. They all give me different acceptance rates to schools sometimes by up to 20%. I really need accurate info to decide where to apply. What is the most reliable?",
    "comments": [
        {
            "level": 0,
            "comment": "They're not lying - some of them just haven't updated their data in a few years, which is a significant amount of time these days.",
            "score": 20,
            "author": "prsehgal"
        },
        {
            "level": 0,
            "comment": "College website - check freshman profile",
            "score": 8,
            "author": "Future_Sun_2797"
        },
        {
            "level": 0,
            "comment": "Fiske releases a new edition every year but only some colleges within it are updated each year - so don’t rely on that.\n\nThe schools own websites usually have last years data. Form more detail the most recent common data set (CDS) it accurate.",
            "score": 3,
            "author": "WorriedTurnip6458"
        },
        {
            "level": 0,
            "comment": "IPEDS, but the search interface is crap. Schools will often announce their most recent rate before it shows up in IPEDs too.",
            "score": 1,
            "author": "Ok_Experience_5151",
            "replies": [
                {
                    "level": 1,
                    "comment": "THIS is the truth or the common data set if you can find it. Different sources use different years. The most recent common data set is for 2022-2023",
                    "score": 1,
                    "author": "cmsnsn"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can’t rely for b data that’s even 2 years old. Things change too quickly these days.",
            "score": 1,
            "author": "Available-Bat7593"
        },
        {
            "level": 0,
            "comment": "You really don't need information at that accuracy level to decide where to apply.  Acceptance rates are really not great metrics of how selective an institution is, because for highly selective institutions, they depend mostly on how many frivolous applications they get from people who just want to take a shot.",
            "score": 1,
            "author": "Powerful-Inside2892"
        },
        {
            "level": 0,
            "comment": "Try US News World Reports",
            "score": -1,
            "author": "TheStormfly7"
        }
    ]
}