{
    "id": "146w2cw",
    "score": 46,
    "title": "Notre Dame CS vs. UMich data science",
    "author": "Free-Debate-5027",
    "date": 1686495543.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/146w2cw",
    "media_urls": [],
    "other_urls": [],
    "postText": "Just got off UMich waitlist. Was really hoping to get a CS degree and really in love with Notre Dame, but wondering if opportunity is too good to pass up.",
    "comments": [
        {
            "level": 0,
            "comment": "If you’re set on cs and umich isn’t drastically cheaper than Notre Dame then I’d opt for Notre Dame, that’s still a pretty solid school for cs",
            "score": 46,
            "author": "riveter1481"
        },
        {
            "level": 0,
            "comment": "Are you in-state? That's the only reason (price) I can think of that would make UMich more attractive in this scenario, where you love ND and are in the major you want.",
            "score": 12,
            "author": "elkrange",
            "replies": [
                {
                    "level": 1,
                    "comment": "They have an awesome program though, and I do really like Mich as well.",
                    "score": 1,
                    "author": "Free-Debate-5027",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There is no substantial difference in prestige, if that is what you are thinking about. Consider what you want to study.",
                            "score": 2,
                            "author": "elkrange"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Very different school cultures. For example at ND, you have to be in dorms for 3 years minimum. Choose based on fit not major as both of these majors will help set you up for similar jobs (especially if you have an interest in stats/data analysis/potentially ml). It’d be very easy to self study the gaps between the majors based on your interests",
            "score": 12,
            "author": "lolllicodelol"
        },
        {
            "level": 0,
            "comment": "If you want to do CS, I don't see the conflict.  Stick with ND.",
            "score": 9,
            "author": "KickIt77",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was considering a switch to data science anyways, but I’m not totally convinced.",
                    "score": 1,
                    "author": "Free-Debate-5027"
                }
            ]
        },
        {
            "level": 0,
            "comment": "as a umich student, i’ll tell you that the DS bachelors is very open and you can take literally every class a CS major does (except maybe 1/2) as part of your curriculum. if there’s no real difference in price, i’d pick whichever school environment you like better. very, very different school social lives and experiences",
            "score": 10,
            "author": "Awesomlegp"
        },
        {
            "level": 0,
            "comment": "if similar price i would pick the one that fits better\n\nif there’s a noticeable difference pick the cheaper one\n\nmich is better by a decent margin but if you like nd more and price is better or similar then go there",
            "score": 4,
            "author": "CovalentElectron"
        },
        {
            "level": 0,
            "comment": "I agree with what others have said. Unless there’s a substantial cost difference, if you’re wanting to pursue CS, then go to ND for CS and never look back. Good luck!",
            "score": 3,
            "author": "Silent_Gift3874"
        },
        {
            "level": 0,
            "comment": "If you want to study CS, then Norte Dame. Otherwise, I would go to Mich because it’s a better school for tech",
            "score": 2,
            "author": "Beneficial_Sky9813"
        },
        {
            "level": 0,
            "comment": "Nah ND for the W",
            "score": 2,
            "author": "McBobBagger"
        },
        {
            "level": 0,
            "comment": "Current ND student here (albeit nothing in STEM) lmk if you have any questions",
            "score": 0,
            "author": "tmarino721"
        }
    ]
}