{
    "id": "1471gne",
    "score": 1,
    "title": "senior year schedule for social sciences major",
    "author": "otmeel",
    "date": 1686508496.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/1471gne",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am currently debating on whether I should take AP Bio or AP Physics 1 next year for my science class. If it's relevant, I plan on majoring in Anthropology or History. I know that bio might be more relevant if I study anthropology in college, but tbh I want an easy (or relatively easier..) A that I can get with less effort. \n\nbio pros: teacher is GREAT, I've heard amazing things about her from everyone who has had her class, apparently her exam score average is like 4.9 LMAO, if you pay attention in class you don't have to study that much, applies to what I want to study ish\n\nbio cons: the course itself is super content heavy and the homework sucks sometimes, id have to email my counselor to change my schedule 😔😔\n\nphysics pros: I had one of the physics teachers for apes this year and he's really chill (you can turn in any assignment even months late for full credit) , the other teacher is really good and he authored a physics prep book or something idk , I'm okay at math and physics is a lot of math ?, easy-ish A, my friends are taking it\n\nphysics cons: daily homework.. I'm already taking calc 😭,  the chill teacher also sucks at teaching ..., physics also has nothing to do with what I want to study, I don't think I'll find it that interesting \n\nFor context these are the rest of my classes.\n\nap lit / ap research / ap csp / (science class) / ap calc bc / ap spanish 4 / ap us gov\n\nI know that its a lot of APs, but I have to take 7 classes bc of circumstances which mean that I can't take any free periods  and the only options for the electives I wanted to take are APs.\n\nI also might just take both and not take comp sci lol \n\n&amp;#x200B;\n\nAny advice or feedback on my schedule would be really cool, thank you in advance!",
    "comments": [
        {
            "level": 0,
            "comment": " u said urself u want an easier class and seems to me that u already think physics 1 is easier. just go with physics 1",
            "score": 1,
            "author": "Proper-Fig-6326"
        },
        {
            "level": 0,
            "comment": "I would say go w Bio since it relates to your major and the teacher is great so you will probably do well on the AP exam",
            "score": 1,
            "author": "saturn_soda"
        }
    ]
}