{
    "id": "en97tp",
    "score": 7256,
    "title": "Unpopular Opinion: a lot of y’all don’t belong at top schools.",
    "author": "edxothers",
    "date": 1578758821.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/en97tp",
    "media_urls": [],
    "other_urls": [],
    "postText": "Alright so basically what I’ve noticed about people who get into top schools that I’ve been friends with is that they’re all nice people and actually have a life. If you have to study 24/7 and don’t have time for a social life just to maintain good grades and good test scores, you don’t belong at a top school. The people who belong at t20s are the people who actually have a life and passions beyond ‘I need a 4.0 GPA and 36 ACT’ they’re just smart enough to get the 4.0 and 36 on top of that. Y’all really need to chill because frankly not having a life is ruining your chances. When you look back and think ‘why did I get deferred/denied? I had a 4.0, I studied every single hour, I joined 7 different ECs just for this college’ then that is exactly why you got deferred/denied. Sure, there are some exceptions. But colleges don’t want people with no outside competence and no perspective which so many of you display them wonder why you’re not getting in to your top choices.\n\nEdit: just because you didn’t get into a top school doesn’t mean that you necessarily have no personality! Top schools are always hard, getting rejected even with good scores could be a lot of reasons\n\nEdit2:  I’m apologize to any 1 specific person who read this and got upset. I am sure you have a life. I never tried to say that you didn’t, you can have exactly 7 ECs but still have a life. The number was arbitrary, I didn’t mean to offend anyone with the post it was just my opinion.",
    "comments": [
        {
            "level": 0,
            "comment": "3 bans and counting. Be nice.\n\nEdit: this is why we can’t have nice things. Locked.",
            "score": 1,
            "author": "jortbru1299",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Getting into your top school doesn’t make your problems go away and it won’t mean you’ll be inherently successful. This sub needs more posts like this",
            "score": 257,
            "author": "BubbleGumRiot",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s great to get into your top school! But ultimately it shouldn’t be the sole focus of someone in high school",
                    "score": 77,
                    "author": "edxothers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Agreed. If you get into your top school, good for you, but it shouldn’t come at the expense of social skills, personality, and a recognition that success isn’t determined by the school",
                            "score": 36,
                            "author": "BubbleGumRiot"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tbh seems like half of the people here dont have a life",
            "score": 1869,
            "author": "Arthur_144",
            "replies": [
                {
                    "level": 1,
                    "comment": "The sad thing is some people think that once they get into their dream college, all their other problems will go away and they’ll have a great time, but the pressure to succeed will be insane, especially at top schools where you are surrounded by valedictorians and scholars.",
                    "score": 944,
                    "author": "officiakimkardashian",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I just had this conversation with my high achieving 16 year old. \n\nYou will never be happy if you spend your entire life focused on the next goal. You fall into a spot where you don't even care about your straight As or 1550 SAT score because you are so focused on getting into CalTech or MIT or Harvard or Stanford. If you don't get it, then it feels like all of that hard work was for nothing but the problems don't end if you do get in. Instead of being a stressed out high schooler focused on college, you are now a stressed out college student focused on keeping up with your peers, not letting yourself down, graduating with honors, setting yourself up for the best grad or med school, etc. \n\nMost of y'all just need to chill. I get that it's hard. My kids go to a high performing high school and the pressure is intense, but you can't spend your whole life focused on a future that you'll never allow yourself to actually enjoy.",
                            "score": 658,
                            "author": "Mannings4head",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You can have goals,  you can work hard to achieve them,  but you can’t plan results.  \n\nI wish I had this hammered into my head when I was younger.",
                                    "score": 90,
                                    "author": "Manoflemoyne",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "aka the lesson of the Stoic School, see the Enchiridion by Epictetus: http://classics.mit.edu/Epictetus/epicench.html\n\nThe first line:\n\n&gt; 1. Some things are in our control and others not. Things in our control are opinion, pursuit, desire, aversion, and, in a word, whatever are our own actions. Things not in our control are body, property, reputation, command, and, in one word, whatever are not our own actions.",
                                            "score": 10,
                                            "author": "VerySecretCactus"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Good on you. My parents had the opposite conversation with me and basically told me if I don’t get straight A’s or a 1550 SAT score then my life will be ruined and of course that fear snowballed into crippling depression and anxiety",
                                    "score": 111,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Same, my parents just yelled at me because I have a 106 in AP gov. That could be higher but I failed a quiz. I still have above 100%. I've already gotten admission to my top choice. Nothing will ever be good enough for them",
                                            "score": 57,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No way this is real. Nobody should get pissed at you over a 106 in Gov",
                                                    "score": 39,
                                                    "author": "_Did_"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "My guardians didn't even talk to me about it.  I ended up at community college and a state school because I paid for it myself and didn't want to be saddled with debt.  Best decision of my life",
                                            "score": 54,
                                            "author": "Iohet"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I have taught at an ivy league school (ecology and biostatistics, both required for bio majors including pre-med) and I think everyone here is over-estimating the demands on students at these institutions. I firmly believe that the hardest part is getting in, and that the student's abilities had little to do with that. \n\nGrade inflation is insane. I was basically not allowed to fail students. I was required to ensure that my classes had a B average. Rebellious by nature, I addressed this by grading students incredibly harshly, failing almost the entire class on every assignment, and curving the grades to a B average. Students' writing skills were barely literate and made me strongly suspect that most had their entrance essays written by someone else, or the essay was not important in getting them accepted. I found myself not getting through biostatistics material because the students (sophomores) had never learned Microsoft Excel and I had to walk them through that. Many of my ecology students (freshmen) had clearly breezed through high-school without challenge, and had to be taught how to study and take notes. \n\nI have also taught at flagship State Universities with relatively low admissions standards (48% and 63%). Qualitatively, the only difference between students at the Ivy and at the public schools was that the class sizes at the ivy were significantly smaller, and the worst students weren't present. If you took the 5 best students from my public school classes, and randomly selected 15 from the remaining students who actually bothered to show up to class, you would have the kids in my Ivy classes.\n\nI believe it is truly one of the biggest scams in history that so many people believe that Ivy League students are the brightest our country has to offer. As I mentioned above, they were on par with my public school students. I will say that because of the smaller class sizes students received a somewhat better and much more personalized education, if they took advantage of it. But overall, once they were in, it was basically impossible for them to fuck it up, and most of my students put in the minimum amount of effort necessary so they could focus on socializing.",
                                    "score": 21,
                                    "author": "OsiyoMotherFuckers"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "that big fish - little pond to little fish - big pond transition can fucking do people in mentally too",
                            "score": 19,
                            "author": "notmadeofstraw"
                        },
                        {
                            "level": 2,
                            "comment": "Fun fact: I've guest-lectured at Stanford. \n\nYou still have problems in your life after, even if you've got friends in Professorville.",
                            "score": 61,
                            "author": "JManRomania"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's a sub for applying to college. Consider the type of person this will attract to become active.",
                    "score": 16,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "i think the reason this guy feels this way is because he spends too much time on college forums. you arent going to get a sense of people's lives outside applying to colleges if you're spending all your time listening to people talk about college admissions. in reality ill bet most people here have lives outside applying. granted, lots of people here just want the prestige of a t20 and don't really care about the actual experience, and those people don't deserve to get in, but admissions officers can sniff that out in their essays. it will all work out.",
                    "score": 201,
                    "author": "valkarez",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is an underrated point. There’s this tendency to create caricatures out of internet communities and people. Maybe i just don’t talk to a lot of people, but I feel like most people who do the kind of stuff OP is talking about aren’t super antisocial and lifeless corpses. From my experience, there aren’t actually that many people who give up everything to fixate on a test score, especially because “SAT/ACT isn’t that important, admissions reps care about the whole person” isn’t exactly a hot take these days.",
                            "score": 83,
                            "author": "mcmichaelwave",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "at the same time, i always see people talking about how they’re taking so many hard classes and can barely handle them because they’re so stressed so i feel like these kinds of subreddits tend to attract people who really care about their academics.",
                                    "score": 10,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We’re on reddit...I thought that was a given",
                    "score": 12,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "You got me there",
                    "score": 6,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Someone finally said it...\n\nIf everything you do is fueled solely by the desire to get into a top school, you will be a less interesting person and that will (most likely) come through.\n\nI don't think OP is saying doing schoolwork is bad, I think they are just raising the point that school can't be a personality trait.",
            "score": 565,
            "author": "gp_13",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah! Obviously there are exceptions, and obviously even the most naturally bright people are going to work hard and do their work if they want to get to an Ivy. But having college as a sole obsession instead of general success etc. is often quite detrimental to someone long-term",
                    "score": 140,
                    "author": "edxothers"
                },
                {
                    "level": 1,
                    "comment": "I agree with these sentiments, however, I think most on this thread are failing to consider where robots who only care about their grades come from. Do you think they don't realize the flaw in their thinking? All too often, they come from parents whose only expectation is that they get into an Ivy, and/or extremely competitive prep schools which shape them into a paranoid, uninteresting person.\n\nThese people should be treated with empathy and not scorn. This mindset is not their fault. These people are (rightfully, in my opinion) not admitted to Harvard, but shunning them in this way is not healthy either.",
                    "score": 43,
                    "author": "moustachioedtamarin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m sorry if the post came off as shunning. I don’t think that anyone is any ‘lesser’ than for basically any decision anyone makes in high school (within reason ofc. Not gonna like it if you murder someone etc.) I don’t think the mindset is always the students fault- or even usually the students fault. But sometimes some students just doesn’t realize that it’s unhealthy, which is the target of my post if that makes sense.",
                            "score": 15,
                            "author": "edxothers",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I understand, and no need to apologize! Your post wasn’t particularly brutal, I’ve seen much worse. :) But I disagree that your post, which is directed at someone who is already feeling paranoid and worthless, will “open their eyes” in any way. It will make them cling harder to their grades, a safety net. You are not the first person to tell them this, nor will you be the last. It is far more complicated than just “recognizing” a toxic mindset - it takes years to change that.\n\nHave a nice day.",
                                    "score": 11,
                                    "author": "moustachioedtamarin"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That's a great point... I think part of the point of this post was to (hopefully) open some people's eyes to the fallacies in their thought process, rather than just blind criticism, like you are saying. You're for sure correct.",
                            "score": 3,
                            "author": "gp_13"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's similar to the people who think the secret to working at google is the robotics club, math, and a T20 school.  Almost never ends up like that.",
                    "score": 21,
                    "author": "BldrStigs",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's facts",
                            "score": 3,
                            "author": "gp_13"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes. Dedication is important. But they want to know that you don’t just want good scores; rather, you want to learn.",
                    "score": 6,
                    "author": "uglypenguin5"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah see I feel for her...\n\nBut at the same time, schools don't want that person.\n\nI wonder where in her life she switched her mentality from learning just to learn to being so driven and motivated, and I would be interested to see if her parents are pressuring her.\n\nTake note, underclassmen reading this. Please talk about memes at lunch, not school.",
                            "score": 5,
                            "author": "gp_13"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is a real unpopular opinion, I like it",
            "score": 1247,
            "author": "WestBeatsEast",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly I just feel that if someone gets like a 28 on the ACT without studying and then studied for 200 hours and spends $5000 on getting a better score and gets a 32 and complains about test scores being bs and how they should’ve gotten a 35/36 that’s just Bc they’re not smart enough to be competitive applicant. If they were really competitive they wouldn’t have had to go through all those hoops and still get below average for Ivy League. There’s nothing wrong with that, they should just go somewhere less prestigious instead of wasting money and years of their life to get something they don’t have the natural aptitude for anyways",
                    "score": 519,
                    "author": "edxothers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's not a waste if they want it. I think you're underestimating people who start off with bad scores but work their way up. I don't think you are in a position to advise people how hard they should be working for their dreams.",
                            "score": 226,
                            "author": "initiald-ejavu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If your only goal in life is to get into an Ivy League then you’ll sacrifice the things that ivy leagues want to accept. More people would get in when their goal is to be a successful engineer. They work towards that, dedicate themselves towards that, have friends in engineering ECs, and then apply and get accepted when it’s clear they have actual passion.",
                                    "score": 211,
                                    "author": "edxothers",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "On this,  we agree. I don't think it's healthy for ANYONE to rely on getting into an Ivy.",
                                            "score": 100,
                                            "author": "initiald-ejavu",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah. I’m not saying people can’t work their way up. But if they’re working their way up only for the sole purpose of getting into college and dedicate all of their time to that, they won’t have the personality that colleges are looking for. Spending some free time studying for SAT/ retaking it so that you can feel better about your score is one thing as long as it isn’t all-consuming and it’s a REASONABLE time spent. Sacrificing your character and interests in pursuit of getting a better SAT score is different and detrimental and is done a lot on this subreddit.",
                                                    "score": 64,
                                                    "author": "edxothers",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "See this I agree with. I literally put two hobbies on my common app that I did for my own self enjoyment. One of them I even wrote about for the extracurricular supplement question. I work hard and got good grades of course but I didn’t sacrifice any of my interests for it. \nI think there’s some confusion because your original post isn’t necessarily worded like your comment here.",
                                                            "score": 33,
                                                            "author": "Lil-pants",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah, my original post isn’t worded as well as it could have been. I mean more that people who sacrifice their interests to do well are going to fall short, while people who try hard while continuing to pursue what they like will usually come out on top and I see a lot of the first on this subreddit",
                                                                    "score": 18,
                                                                    "author": "edxothers"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Hey if you don’t mind sharing were you accepted into schools you liked with so few extracurriculars? Because I have the same problem, good scores/gpa but I can’t bring myself to join a clubs that I hate just to put it on a college app, ya know?",
                                                                    "score": 8,
                                                                    "author": "bienvenidos-a-chilis",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I had some other ecs like doing 3 sports every year and having a part time job, but yeah I didn’t join any clubs whatsoever and I’m at my top choice.",
                                                                            "score": 6,
                                                                            "author": "Lil-pants",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Oh that’s awesome! I have a part time job too and I’m hoping with that and good essays I can get into my top, I’m not looking Ivy League or anything obviously haha. I get the drive to go for top schools but it’s silly to waste so much time in clubs you aren’t interested in imo",
                                                                                    "score": 5,
                                                                                    "author": "bienvenidos-a-chilis"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You don’t need $5000.  Maybe in the pre internet days. Yes, there is a high or almost perfect correlation between family income and SAT scores. I believe the internet with khan academy and low cost uworld will change that dynamic. That plus a $20 book with ten legit practice tests.",
                            "score": 15,
                            "author": "katytx97"
                        },
                        {
                            "level": 2,
                            "comment": "The issue I have with this is that ivy leagues shouldn’t be just for people who are “smart enough”. They aren’t a means for like natural selection, they’re a reward for people with the right mindset and those willing to put in the work to improve themselves - they shouldn’t be available to people born with the right environment to prepare them for good scores down the line. That’s why a lot of schools are going test optional or not relying so much on these scores, there are sooo many links to socioeconomic and uncontrollable factors that applicants can’t change.",
                            "score": 31,
                            "author": "Taquito4Ever",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "i dont really agree, i worked my ass off and took the test five times, went from a 24 to 34. im not naturally smart, but i love learning and work hard to get good grades at a competitive high school in NY. i dont think it means im not smart enough for an Ivy, it just speaks to my test taking skills. i got deferred from brown and i didnt submit any subject tests and with an average ACT. i didnt spend any money on tutoring (im low income) and i feel like this is the case for a lot of kids. just because u want to aim high and improve doesnt necessarily mean what you were saying",
                            "score": 58,
                            "author": "20figaro",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wanting to improve isn’t bad but if you have to sacrifice your friends and interests it’s detrimental to both yourself and your college application. Or at least that’s how it looks in my experience",
                                    "score": 48,
                                    "author": "edxothers"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 41,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; The ACT just tests how well you can do on the ACT \n\nThat's exactly what they say in one of the Princeton Review ads for their SAT Test Prep plans. It's also a marketing strategy.",
                                    "score": 21,
                                    "author": "Invisible_Gamer"
                                },
                                {
                                    "level": 3,
                                    "comment": "It measures how well you can do on the ACT and also gives you a prediction of how prepared you are for college. Sure it’s not 100% accurate but nothing is",
                                    "score": 18,
                                    "author": "edxothers",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 11,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That’s actually not true. The act doesn’t check how prepared you are for colleges, but college grades determine how ready you are. How you do in your AP classes does. That’s because if you look at the ACT, literally none of the parts are close to AP level, much less college level. It’s standardized, but brilliant people can still get 25s and average students can get a 36",
                                            "score": 12,
                                            "author": "avatar4real",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Generally speaking, people with a 36 are gonna be way more prepared for college than people who got an 18. Obviously as I said it’s not perfect, it’s just a tool that measures and sometimes malfunctions.",
                                                    "score": 30,
                                                    "author": "edxothers",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You’re not going to see a brilliant student with a 25 man",
                                                    "score": 16,
                                                    "author": "AsianRuler",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Took the SAT without studying and got a 1530 and then took it again after studying and got a 1530 gang",
            "score": 68,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "1530 is insanely impressive. I don't think I've ever met someone with a score that high. I was happy with my 1270...",
                    "score": 21,
                    "author": "Dulakk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Peep r/sat and bear witness to all the 1600s",
                            "score": 23,
                            "author": "Shmookley",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Here's a sneak peek of /r/Sat using the [top posts](https://np.reddit.com/r/Sat/top/?sort=top&amp;t=year) of the year!\n\n\\#1: [Andrew Yang just came out talking about the pressure of the SAT. LOVE IT!](https://i.redd.it/1fq72hf3qkr31.jpg) | [242 comments](https://np.reddit.com/r/Sat/comments/dfmqia/andrew_yang_just_came_out_talking_about_the/)  \n\\#2: [I hate him](https://i.redd.it/rjou24txynl31.jpg) | [19 comments](https://np.reddit.com/r/Sat/comments/d202mw/i_hate_him/)  \n\\#3: [Let's stress em out guys](https://i.redd.it/l525uh9h82s31.jpg) | [60 comments](https://np.reddit.com/r/Sat/comments/dgrt3t/lets_stress_em_out_guys/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/ciakte/blacklist_vi/)",
                                    "score": 4,
                                    "author": "sneakpeekbot"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "1510, 1510, 1520 gang checking in - no superscore.",
                    "score": 11,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "In short, colleges want humans, not machines.",
            "score": 181,
            "author": "pysapien",
            "replies": [
                {
                    "level": 1,
                    "comment": "Pretty much haha",
                    "score": 31,
                    "author": "edxothers"
                },
                {
                    "level": 1,
                    "comment": "Exactly. And, keep in mind that colleges are brands. They want their alumni to be visionaries and game-changing innovators that make a lasting impact on the world.\n\nIf all you cared about in high school was getting good grades and making that college application nice and polished, it doesn’t show that you have much genuine passion for anything. All visionaries have genuine passion.",
                    "score": 24,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "This comment deserves more appreciation",
                    "score": 9,
                    "author": "gp_13",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "UwU",
                            "score": 5,
                            "author": "pysapien"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had about 10 friends in high school get into T20 schools. \n\nMost of them had social lives and a couple ECs they were passionate about and were able to get 4.0+ GPA and 1580+ SAT off of basically just their intelligence. Those people are still very happy at their current schools.\n\nThe remainder were the type of people to sacrifice social lives and spend countless hours studying and doing academic ECs. People who weren’t naturally brilliant but overcompensated with the amount of time committed to academics. As far as I know, none of them are happy at their schools. They are constantly stressed and feel extremely out of their league, and supposedly have zero free time while everyone else manages to still have some fun and a social life.\n\nI’m sure there are exceptions but I haven’t seen one personally.",
            "score": 62,
            "author": "SkyOnFire42",
            "replies": [
                {
                    "level": 1,
                    "comment": "These posts make me feel that some people are just born luckier with natural intelligence :( It's not anyone's fault that some people have to take off time from having fun to work harder in order to be on the same level as their friends.",
                    "score": 10,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know it’s not anyone’s fault but the people who had to struggle more to get there ended up less happy. I am decently smart but not T20 smart and I went to a good school but not Ivy tier and I’m pretty happy because I find I fit in academically with the people- I’m challenged but not out of my league. If everyone around me were much smarter than me I don’t know if I’d feel adequate.\n\nThe type of person who gets into T20 schools is generally extremely smart and hard working. My friends who were hard working but weren’t as brilliant struggled when surrounded by people who were just as hard working but were also naturally brilliant, because they can get further with the same amount of work.\n\nIt sucks to think about but tragically genetics are as much a factor as hard work in a lot of cases.",
                            "score": 11,
                            "author": "SkyOnFire42",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "ECs are something you should do because you want to and you have a passion for it, not because you want to boost your college application. I’m sure college admissions can tell the difference.",
            "score": 142,
            "author": "xander2021",
            "replies": [
                {
                    "level": 1,
                    "comment": "This makes me feel better about my fantasy football commissioner EC",
                    "score": 82,
                    "author": "kindathecommish",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I love this comment",
                            "score": 21,
                            "author": "gp_13"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Exactly! And having passion and demonstrating it (especially in academic fields) is a surefire way to boost your chances at colleges",
                    "score": 17,
                    "author": "edxothers"
                },
                {
                    "level": 1,
                    "comment": "they cant tell the difference. thats why there's a thriving industry built around admissions",
                    "score": 17,
                    "author": "SchmilkBoii",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree. It's all about rhetoric/the way you present yourself more than what it is. If I take video games, for example, and all I use it for is for a bit of escapism and as a distraction and isn't necessarily a life-long passion that fuels me or something, then:\n\n&gt; I've always wanted to apply to Princeton computer science because I've been flabbergasted by how software designers could so powerfully capture the essence of a different world and allow even someone with as humble of a background to go beyond the bare walls of my bedroom into an unexplored world. In fact, it is this ability to so perfectly capture experiences that I want to cultivate at Princeton, inspiring a new generation with my passions in video game design.\n\nIf you took away video games from me, it's not like I'm going to throw a temper tantrum because it's my life-long passion, but I am going to be somewhat frustrated until I replace that with something like tennis or football.\n\nBut with the paragraph I wrote, it makes it sound like video games are a cornerstone to my life and I would die to design them.",
                            "score": 14,
                            "author": "Noisetorm_"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fr all these people out here doing internships and research programs just for college",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree with this. I was really really dumb in high school (like a 1090 psat in 10th grade). And I just studied my ass off in my junior year of high school and same with sophomore. I only confined myself to one friend and just tagged on him for stability. Tbf my parents were first gen immigrants wo college education so I didn’t grow up with books but hardcore video games. Eventually I study like 1000 hours for the SAT (more like several hundred) and get 1550. Then the essays I just wrote out woke thoughts I had. It wasn’t that great but I felt like I manifested my personality from what I wrote in college apps instead of the other way around. I graduate valedictorian and go to Stanford. \n\nThe people here at Stanford? People who are used to their whole life naturally curious, ambitious, smart, and resourceful. I worked in high school a lot just to make myself feel better than my other peers, and I benefitted academically from self alienation. \n\nSo... yeah. I don’t belong to go here. But guess what? Fuck you im here right now. Respect to anyone who can make it to Stanford from a first gen background. I may feel very culturally different from my peers but I realize now it’s the companionship you feel from others that is worth it. \n\nI let myself have fun now in college and it’s just now I see it was totally fine for me to work so hard in high school, but I should have definitely made more friends and do more social things. This early social development would’ve helped me but I feel again my school is very awkward. I never had a friend group. Now I do. I feel a special sense to each person within our friend group, and it gets better from here. \n\nTLDR: this guy is right but Know first how much you are willing to sacrifice before you make it. I would fit better in a more introverted UC environment but I learned so much more about life eventually so it all works out. For me? I don’t deserve it but it was fucking worth it.",
            "score": 40,
            "author": "FinalPush"
        },
        {
            "level": 0,
            "comment": "Agreed lol",
            "score": 91,
            "author": "Deaddish44",
            "replies": []
        },
        {
            "level": 0,
            "comment": "As someone who is at a \"top school\" this shit isn't true, lol. There's no major quality or trait that you could apply unequivocally to everyone at a t10 school. Adopting the belief that it's basically a lottery once you meet all the \"recommended\" statistics is probably much closer to reality.",
            "score": 27,
            "author": "tacopower69"
        },
        {
            "level": 0,
            "comment": "&gt;7 ECs\n\n&gt; Does nothing but study\n\nOK",
            "score": 27,
            "author": "StardustNyako"
        },
        {
            "level": 0,
            "comment": "100% agreed. and though AOs cant tell everything about people, essays and LORs can give a good idea of if certain applicants have those people skills and genuine passions past the 4.0 GPA and perfect score",
            "score": 99,
            "author": "notabalone"
        },
        {
            "level": 0,
            "comment": "While I agree with you, being an actual interesting person also isn't enough to get you into these schools. I know people who did stuff not to put on their college app but because they were actually interested in [insert activity here] and it didn't matter in the end (obviously they were also the people to get 36 and 4.0 without trying). \n\nMost of my extracurriculars are things I genuinely enjoy and I'm glad that I can go back to focusing on them now that the majority of the apps are over, but in the end it doesn't really matter. I did these activities because it was a good time with my friends and I got to learn things, which is what colleges are supposedly looking for \"intellectual curiosity\". I got a 36 without hundreds of hours of studying but there's always going to be that guy that [interned at NASA, wrote some new algorithm at CMU, etc. etc.] that's going to get in over me.",
            "score": 21,
            "author": "kingboo9911",
            "replies": [
                {
                    "level": 1,
                    "comment": "And the thing is, because pursuing interests also helps you on a personal scale, if you end up getting denied regardless, you have a lot more options than if you got denied and spent all of your high school trying to get into a particular college",
                    "score": 6,
                    "author": "edxothers"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think it’s because you are on a platform that only talking about colleges. Why would they talk about their personal life outside of school?",
            "score": 20,
            "author": "h4ck3rbr0",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Spicy take. I don’t hate it.",
            "score": 15,
            "author": "blue_surfboard"
        },
        {
            "level": 0,
            "comment": "I hate to admit it but yeah",
            "score": 85,
            "author": "Asian-Squat"
        },
        {
            "level": 0,
            "comment": "I think that’s one thing people especially parents forget to tell you that just because you strive for the best grades and to get into the best colleges that other aspects of your life won’t drastically suffer. There needs to be a lot less pressure on worrying about college and more in every aspect of your life because they’re just as important.",
            "score": 29,
            "author": "jayv987",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly! If you succeed generally in life &amp; high school and just try to maximize your experience, getting into a good college will naturally follow. Obviously it won’t guarantee ivy leagues etc. but nobody needs an Ivy League to be successful",
                    "score": 16,
                    "author": "edxothers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Correct people put too much pressure on getting into  ivy league schools and put them on such a high pedestal when I think being able to get into any other good college is good enough. It’s like a person obsessed with revenge eventually when they finally get it they lose their purpose in life because that’s all they focused on and cared about.",
                            "score": 7,
                            "author": "jayv987",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Education is education. Especially in stem fields. I had a conversation with one of the people who conducts interviews for interns at Facebook and he States that  they value person's character and what they know is weighed more than the degree they have. Tbh ivy leagues is just overpriced education because you're paying for \"Prestige\".",
                                    "score": 8,
                                    "author": "Tvank",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\\*Insert comment about how an ivy league is cheaper than state schools for 90% of people\\*, and then think to yourself that 90% of people on this sub fall in the 10% where ivies are far more expensive than state schools.",
                                            "score": 6,
                                            "author": "KoalityBrawls"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think it really depends on how you operate and what you’re looking for in life. If someone doesn’t value social life as much as others they shouldn’t be cast aside for studying more",
            "score": 79,
            "author": "Stekuns",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s fair, I just feel like people who’s only goal is to get into say, Harvard, and not to succeed generally end up doing worse than people who just try to do well and put that into a Harvard application. Having goals is good- don’t get me wrong. But having colleges be your only goal can be detrimental in the long run; and often is as seen on this sub imo",
                    "score": 43,
                    "author": "edxothers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh yea especially with how toxic Harvard and other ivy schools can be",
                            "score": 5,
                            "author": "Stekuns"
                        },
                        {
                            "level": 2,
                            "comment": "I don't think people just want to 'go to Harvard' though. They may be focused on getting into a top university at the moment but only so they can achieve certain goals further down the line. If you asked these people what they want to be in 10 years I don't think their answer will be 'idk i just wanted to go to harvard lol'.",
                            "score": 7,
                            "author": "NowThisNameIsTaken",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s fair, except honestly I know some people who genuinely have no ‘after’ plan. I might just know people who belong to the minority though!",
                                    "score": 2,
                                    "author": "edxothers"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Someone fucking said it.\n\nNews flash: none of you mfs are special, none of you mfs are the next Bill Gates or Albert Einstein. \n\nIf you’re going to college, you might as well go to one you can actually succeed in. If you go to a T20 and you still have no life because you’re studying harder bc you’re not smart enough to be there you’re still gonna be miserable.\n\nIf you go to a state school then your work ethic now will actually pay off with merit scholarships and your education will still be the same, you’re going to a literal fucking institution of higher education, with classes taught by people WITH LITERAL FUCKING DOCTORATES, you’re getting a quality expanse of your knowledge either way you look at it.\n\nOn top of that, you won’t have to pay as much for college, meaning you won’t be in as much debt, and if the state school has good job placement, you’ll still be a qualified individual with marketable skills anyway that companies would love to have. A lot of you have insane work ethics, and that’s what matters more than your high school GPA and test scores. \n\nAfter your first job your college won’t matter. What will matter is your work experience and what you’ve done for your company.",
            "score": 101,
            "author": "Jimbussss",
            "replies": [
                {
                    "level": 1,
                    "comment": "The idea that top schools are extremely rigerous is not always true. I know someone who is in a PhD program at MIT and has TA'd for undergrads and has a lot of stories.\n\nOnce these students get in, the school will do basically anything to retain them. Massive curves, passing grades were sometimes as low as 30%, professor essentially refused to fail students regardless of grades, the person I know basically had to beg the professor to fail a student even though then student did not submit the overwhelming majority of assignments or show up to class.\n\nObviously this is not be the case in every program or at every school but the point is that a schools selectivity is not necessarily reflective of the difficulty of course work especially at the undergrad level. Undoubtedly many, many students rejected by top schools would still have been successful had they got in.",
                    "score": 32,
                    "author": "Rampant16",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Prefacing this; I’m a grad student \n\nWhen it comes to curves the 30% is usually because of how difficult the exam was (and the fact most professors either use a normal distribution or their own preset grade breakdown to determine many people should get what grade)\n\nRemembering back when I was an undergrad, there were upper division classes where the average on an exam was sub 50’s, and most of the class passed anyways because frankly the test wasn’t supposed to be passed with a good grade.",
                            "score": 17,
                            "author": "Entrei6",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This sums up my experience in undergrad and now in grad school for physics. Sometimes we're lucky if the average is 30% (before the curve) for an exam.",
                                    "score": 3,
                                    "author": "astrodyl"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "im the next elon musk",
                    "score": 6,
                    "author": "SchmilkBoii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i go to a “top school” and tbh most people there don’t have a life/didn’t have one in hs... but small sample size so idk, just saying what i know",
            "score": 63,
            "author": "helpingwcollege",
            "replies": [
                {
                    "level": 1,
                    "comment": "I also go to a “top school” and most people I know have a pretty active social life. I mean, we’re all insanely busy all the time but we make free time to party or at least hang out on the weekends, and hang out plenty during the week over homework/meals.\n\nPlenty of us didn’t have a life in high school, but in my case at least that’s because I didn’t connect with anyone, not because I was too busy.",
                    "score": 21,
                    "author": "MissesAndMishaps"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 14,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "oh but why are people associating social life so narrow-mindedly to parties. How come aclohol and loud music cause social life? You can do anythong else... play board games, hang out in the park (while talking about, say, maths - it's still relaxing and a social interaction).\n\nIs getting drunk a social life?",
                            "score": 30,
                            "author": "Maurycy5",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 8,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "yea I didn't say that you think that. It is just sad that others think that. There's so much to do outside of parties which isn't studying.",
                                            "score": 3,
                                            "author": "Maurycy5"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Someone can be a student and do stuff beyond studying or, if not, they can at least actively engage in studying beyond passively completing whatever assignments their teacher/prof gives them. I know a lot of really cool geeks and nerds whose lives _do_ revolve around studying, but they engage with the subjects they like in a way that’s actually interesting to discuss with other people. Some people who aren’t super scholarly might say that they’re shut-ins, but I think the average person would think that, even though they study a _lot_, they do have lives and are interesting people.\n\nIf you feel that video games, studying, and movies are enough to give you a rich and fulfilling life, that’s great. I think a lot of people with those hobbies, though, don’t feel their lives are fulfilling or meaningful and that’s where the problem comes in. Not hating life isn’t the same as enjoying life, you feel me?",
                            "score": 5,
                            "author": "Queen-of-Leon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I didn’t mean to give off the impression that I watch movies and play games by myself, because I certainly have friends that do it with me \n\nI enjoy going out and seeing a movie in theaters with them every now and again. We go out to eat, etc. \n\nI like to talk about my studies with others. I read books on it, articles etc. I work on projects as well. Right now I’m doing some cyber security competition that I’m really excited about. \n\nI just meant that those are my main hobbies. Someone who didn’t know me might assume I had no life just from knowing my hobbies",
                                    "score": 2,
                                    "author": "kaystrrrr"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There are lots of ways to \"have a life\" in college that don't have anything to do with parties, many of which also prepare you for your career even though they aren't academic. In college I participated in student government and residential life. I did restoration in a Georgia swamp on Alternative Spring Break. I weaseled my way into a geology field trip with the graduate students. I wasn't even a geology major. I just really liked rocks and camping. Super dorky? Yes. But a great experience.\n\nEdit: Oh! And the time I (again) weaseled my way onto some training course for biology teachers that involved one of my professors sailing a boat to Key West. There was a terrible storm that prevented us from making it to Key West, so we ended up just sailing up and down the coast sunbathing, and going to clubs, and drinking Malibu rum. This is literally with my professor and a bunch of high school teachers. Luckily I turned 21 on the trip.",
                            "score": 4,
                            "author": "UnrulyDuckling"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m here from /r/all and wanted to chime in as someone who is finished up with college. \n\nI work for one of the biggest companies in the world. There people around me salaried at over half a million dollars a year. And above them, our executives are the golden parachute type. \n\nNone of them went to a top 20 school for their undergraduate degree. And the ones who went for their masters did it on the company’s dime and none of their test scores played a factor. \n\nYour degree, being good at your job, and have the right personality type are the three most important factors for success.",
            "score": 29,
            "author": "237FIF",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;None of them went to a top 20 school for their undergraduate degree. And the ones who went for their masters did it on the company’s dime and none of their test scores played a factor.\n\nThat's rare. Check the incoming classes of the most-desired positions in the world - Programmers at FAANG, Quants at Two Sigma/Citadel/Jane Street, Analysts at Bulge Bracket Banks...\n\nSuccess doesn't need a top school but many who go to top schools become successful.",
                    "score": 9,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You are looking at a very narrow group of companies, none of which are fortune 50. I’m sure those are great jobs and all, but you are thinking extremely narrow. \n\nI had a job offer from 4 of the 40 biggest companies in the world when I graduated from college. I went to a public state school. \n\nIf your definition of success is that narrow then you probably do need to go to a top school. But those people aren’t getting paid any more and I don’t see how those relatively small companies are any more prestigious if you are just hoping for bragging rights. \n\nI recommend you spend some time thinking about what you are really trying to accomplish and more importantly, why.",
                            "score": 18,
                            "author": "237FIF",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If this was true, then colleges wouldn't suffer so much with Admissions Scandals, or discussions about how people get into schools due to a great amount of opportunities related to their privilege.\n\nI agree with you, school is not everything, but it's precisely that search for the ideal college student what has hurt college admissions. Everyone wants someone that is outgoing but smart, when reality is quite off. Most of the people here, even though they vent their frustration at spending too much time and effort have a personality and a social life. But we somehow have to pretend \"you've got to have a something in order to get T20\", I'm sorry but I'll be blunt: the students are normal, as everyone else. They are hardworking, they have aspirations, they can be great as persons but also commit mistakes. \nYou are making it look like T20's should care about personality, for god's sake, maybe it's because I'm not American but colleges are first institutions of higher education and then communities. Let's stop judging our character for education, most people here are not even adults goddammit.",
            "score": 9,
            "author": "LouisTheLuis",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Honestly, this opinion shouldn’t be unpopular",
            "score": 15,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I’ve gotta say, as a Barnard/Columbia student, this is a problem we get a lot. Students come in overjoyed but used to not doing anything but studying and it destroys their mental health much faster in a college environment than high school. You need to be able to maintain that balance, you need to understand how to maintain your happiness, because relying on just being at these schools won’t make you happy - it’ll make you bitter, depressed, isolated, and it’ll wreck you. \n\nIt’s not just ‘colleges won’t accept you if they see you have no social life’, nor is it about just working hard. If all you’re doing right now is studying, you’re going to really screw yourselves over when you get to your dream schools.",
            "score": 7,
            "author": "elizasbreath"
        },
        {
            "level": 0,
            "comment": "While I agree with the sentiment that people should stop obsessing over top colleges/T20s, this post really seems to shift the blame onto individual students that really haven't done much except been victims to the \"T20 or bust\" mentality. The vast majority of students that feel like they NEED a 4.0 GPA/36 ACT etc. etc. generally go to high schools where people regularly get into such colleges and there's a general mindset that if you don't get in, you're 'stupid' or there's something wrong with you. I don't think you intended to come off this way, but it feels like you're saying \"unless getting into a T20 took very little effort for you, you shouldn't go there because you're not cut out for it.\" This is EXACTLY what contributes to Stanford Duck Syndrome type mindsets where students feel like they have to maintain the perfect image of balance, where they act like they don't study and get perfect grades, sacrifice sleep to seem like they have a life, or where they feel anxiety since everyone around them acts like they have it together. Yes, you'll be better off at a top school if you manage to have a good work/life balance, but I don't think we should be telling people \"you don't belong here if you don't.\"",
            "score": 8,
            "author": "Oooooontz"
        },
        {
            "level": 0,
            "comment": "To add on I think people think they will just magically get social once they go to college but I think they don’t realize you can’t just magically be good at making friends etc...",
            "score": 6,
            "author": "sadepressedpancake",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gap year. Such an important thing that needs to be adopted in America. Spend a year or two traveling, working full time, getting into a serious relationship and learn what it means to be an adult, then go to college.",
                    "score": 6,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Another Unpopular Opinion - Going to your backup school to then transfer to your dream school. There was nooo way I was going to make it into my dream school (not a T20, but a \"public Ivy\") based off my HS grades, so I ended up going to my state school for a year. Worked my ass off getting a 3.85 GPA along with being in different clubs, and ended up transferring to my dream school no problem. It also saved a whole year's worth of Tuition by going to a state school.",
            "score": 5,
            "author": "spencefunk"
        },
        {
            "level": 0,
            "comment": "Exactly. If you had to study 1000 hours to get your act to a 35/36 you’re not gonna be able to keep up at a a top school",
            "score": 61,
            "author": "Honorful",
            "replies": [
                {
                    "level": 1,
                    "comment": "You will be able to keep up, because you know the meaning of hard work. College is gonna hit the naturally-achieving kids like a truck.",
                    "score": 15,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "100%",
            "score": 19,
            "author": "fmemate"
        },
        {
            "level": 0,
            "comment": "I agree. Another Unpopular Opinion: If you are constantly having mental issues you shouldn't get into a T20. If you think HS is hard and you're having breakdowns etc at a T20 it's just going to get amplified. I know multiple people who are top 20 of my school and go to top 20's. The majority of them have some sort of mental issue and even though I'm a bit lower in rankings/scores I feel like my mental is sooooo much better.",
            "score": 39,
            "author": "Kali-Lionbrine",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean I feel like obviously if you have very severe mental issues then that can be a problem, but if you manage to get very good grades despite anxiety etc. then that’s an entirely different scenario. If someone can’t handle the stress of top colleges they shouldn’t go, but simply having ‘some sort of mental issues’ shouldn’t disqualify people for top colleges if it doesn’t impact their performance.",
                    "score": 27,
                    "author": "edxothers"
                },
                {
                    "level": 1,
                    "comment": "Humbly disagree. I battled with depression through 3/4 of my high school career, but kicked its ass and maintained an unweighted 4.0 in junior and senior year (so far). I work my ass off, and though I don't wanna go to a top tier school, I think someone like me shouldn't be dismissed for having mental issues that may make them have breakdowns.",
                    "score": 12,
                    "author": "okay-boomerang"
                },
                {
                    "level": 1,
                    "comment": "As someone who goes to a T20, there’s definitely a lot of mental issues and a stress culture here. Not to say I agree with you, because I know plenty of people who have struggled with depression/anxiety stuff who are really succeeding at college. But it’s something to keep in mind.",
                    "score": 8,
                    "author": "MissesAndMishaps"
                },
                {
                    "level": 1,
                    "comment": "On top of their mental issues you say they have, they still outperform you. Why would that make your \"mental\" that much better?",
                    "score": 12,
                    "author": "DORMOMUUUUU",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "T20s have great counselling services and enough resources in their disposal to help such students. People with mental health problems should seek help from a qualified professional and learn to manage their emotions, not change their life goals",
                    "score": 3,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I mean I’m going to a t20 and have pretty severe mental health problems, but I don’t think it has anything to do with my studying as I was still pretty fucked in the head when I was little and didn’t care too. Does that count?",
                    "score": 3,
                    "author": "Lenoc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "PERIODDDT. people on this sub are really insecure abt their scores and it rly shows. foh with the attitude of \"if you don't go to a t20 you're garbage and stupid\"",
            "score": 43,
            "author": "stressednbk",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is irrelevant to the post. Not socializing =/= being arrogant and looking down on lower scores. OP talks about people who have friends, but no friends doesn't necessarily mean being an asshole. However, I do have to agree that there are a lot of people in this sub with such mindset. But this is overgeneralization and irrelevant.",
                    "score": 23,
                    "author": "No_SChool123",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Idk if this is as unpopular as it is ignorant.",
            "score": 12,
            "author": "TummyRubs57",
            "replies": []
        },
        {
            "level": 0,
            "comment": "\"The Case Against Education\"  is a good book on this subject, there is really no point in going to uni to do just average or slightly above.",
            "score": 5,
            "author": "Bananas_in_my_jammas",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oo that sounds really interesting, I’ll check it out",
                    "score": 2,
                    "author": "edxothers"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd actually realized this when I didn't get into MIT or any of my choice schools, yet got into my state uni which is the most prestigious in the state. The moment I started tackling the workload and then getting stressed out and procrastinating last semester was when I thought, 'If this is already hard now, imagine what it'd be like at MIT doing psets.' I didn't have the work ethic or drive to even accomplish my homework at the time so how could I possibly even survive in MIT or NEU for that matter? Point is, you're absolutely right. Some of us really don't belong at top schools and one of the reasons being this most likely as well.",
            "score": 4,
            "author": "beaux-restes"
        },
        {
            "level": 0,
            "comment": "How much yall wanna bet this was written by a high school senior?",
            "score": 14,
            "author": "badmovieandabeat",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Some people aren’t very good at socializing, so they decide to work hard at something they actually are good at: school.",
            "score": 3,
            "author": "marveliteIG",
            "replies": [
                {
                    "level": 1,
                    "comment": "And that’s ok! It’s just that it’s beneficial to have things you genuinely care about that you’re not doing for the sake of college",
                    "score": 3,
                    "author": "edxothers"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree, but I would probably feel differently if I was one of those people.\nBut, on the flip side, I’m afraid that if I get into a good school, I’ll be terrible at it because I didn’t have to work very hard to get good grades/test scores in high school. And I really do think that elite schools are filled with people who are really devoted and work really hard, regardless of “natural” intelligence.",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is so facts. The people who got into Ivies at my school are all personal, cool, charismatic, have flourishing social lives outside of school, and are extremely smart. Some of ya’ll dont belong at Ivies and it’s ok. They ain’t for everyone.",
            "score": 4,
            "author": "BasilSpicy"
        },
        {
            "level": 0,
            "comment": "Ehhhh, some people are extra talented and have the ability to maintain a social life on top of grades+testing+ECs. But not everyone",
            "score": 9,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "And it’s really not the end of the world if you don’t make it into a top school. Tbh your grades in college matter more than where you go",
            "score": 8,
            "author": "EricEssington",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed completely. Undergrad can definitely impact your life but what school you go to is in absolutely no way the be all end all of anything.",
                    "score": 4,
                    "author": "edxothers"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The thing people have to understand is that working hard doesn’t mean only studying. Let me give you an example. Let’s say 20 years from now you’re looking back at your life and there were two possible paths in high school:\n\n1) you worked hard and got a 3.6 GPA and a 1450 SAT. Which are very respectable. You studied a good amount but you made time for your family and friends and to build meaningful relationships. \n\n2) you have a 4.5 GPA and a 1590 SAT but you couldn’t do much outside school other than study and work on extracurriculars which you only did for college apps.\n\nI GUARANTEE you would be much happier with the first option. Cause when you have a job and live alone you’ll regret not spending more time with your mom, talking for half an hour about how your days were. Making sure your dad was okay cause he isn’t perfect. Trying to help your siblings get through the difficult times they’re  going through. \n\nAlso another thing yall have to understand is that a big name doesn’t mean it’s a good school. \n\nFact: UIUC and Purdue are ranked higher than any of the ivies for engineering. \n\nHowever, no one cares about them but you go to Princeton for like music or smth and everyone makes a big deal out of it.\n\nWhat matters more than where you get your degree is what you do with it. \n\nI know people who have gone to very mediocre schools and become super successful \n\nI know people who have gone to amazing schools and crumbled after cause they thought their life was made out for them\n\nDon’t put this much pressure on yourself to get into these universities when, in reality, they matter very little when it comes to everything life will throw at you after. \n\n\nPS. I got into a top ten engineering school in the world (although I haven’t decided if I’m going) so I’m speaking from experience and not just some salty senior that got rejected from MIT",
            "score": 9,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Our bad, guys everyone start talking about their personal life and what they do for fun on a forum about applying to college! 😂 just seems a bit harsh to come at people like that when they’re using the forum as it’s intended to be used, (no I’m not attending a T20 your approach to this just pissed me off lol)",
            "score": 8,
            "author": "SubParStudentAtBest",
            "replies": [
                {
                    "level": 1,
                    "comment": "People literally use this forum to complain about not having a personal life and how they’d much rather just not have tried as hard as they did throughout highschool tho lmao",
                    "score": 5,
                    "author": "edxothers",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I disagree. \n\nFirst off, what im going to talk about it not necessarily my situation. \n\nI dont like how you seem to devalue the “tryhards” who work their ass for a great sat score and “good” clubs to get into their top college relative to the more relaxed ones who pursue their passion. Well, i dont think its feasible for every highschool senior to have a legitimate passion they are passionate about. And college is where they can find it. Working hard to get into those colleges to be able to explore better opportunities later is not bad thing at all. I mean, while socializing and enjoying life may worth it as a personal development, devoting time to SAT/ACT would develop your critical thinking and other relevant skills. People are trying their hardest to be able to pursue their passion later in their life, and you can't blame it on them.\n\nNext, it seems like your generalizing. Those people who study 24/7 and work their ases off to maintain that 4.0 gpa aren't always bad at socializing. \n\nWhile it may be true that lack of character and personality in your app might reflect negatively, your completely ignorant and negative view towards those students seems a bit too much. Based on your last paragraph, I also can't understand how \"outside competence and perspective\" relates to socializing. In college apps, it's completely possible to show such \"competence and perspective\" without socializing(they can just pretend?) and still work hard. \n\nThey're trying their best to achieve their dream, and without a clear passion or goal, such approach to academics may be better for them. It simply doesn't make sense to say \"they don't belong at top schools\"\n\n&amp;#x200B;\n\nwell, that's probably my unpopular response; it's like 3 am and I don't even know what I'm writing lol",
            "score": 38,
            "author": "No_SChool123",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s fair but I still stand by my opinion that sacrificing personal character to pursue better scores is something a lot of people here do and something that colleges look negatively at",
                    "score": 32,
                    "author": "edxothers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "well, you wouldn't know if college look negatively at work ethics unless you're an AO. And it seems like you're obsessing the importance of socializing on college apps. Some people might just not find right people until they get into college and developing personal character without friends is also possible.",
                            "score": 12,
                            "author": "No_SChool123",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The having friends is just a general example of personal character. And I don’t know why you’d put that you socialize on college apps, that’s irrelevant to the application. It’s more about outlook, which is 99% of the time improved by having friends. Obviously as I said in my post, there are exceptions. But the ‘I need to abandon everything I love in order to get into an Ivy League or else I’m going to kill myself’ is an attitude I see more and more here and it’s bs",
                                    "score": 14,
                                    "author": "edxothers",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don’t think working for the ACT or the SAT will improve any skill other than your skill at solving questions in those exams (I didn’t work much on the SAT though, so I might be wrong) It’s indeed a reasonable strategy for these people to work hard in HS, but what is most important for them is to discover who they are and take the necessary steps to actualize themselves.",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 12,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd actually disagree. Med school is rote memorization and a sprinkle of critical thinking.98-99% of all people matriculating into med school will end up passing, a far higher rate than in undergraduate schools",
                    "score": 10,
                    "author": "redmo15",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes but the point of medical school isn't just to memorize a bunch of stuff about medicine, it's to be a doctor.  Good doctors have amazing people skills and to have good people skills a person needs to be relatable, which means that they need to have some sort of life outside of medicine.  Medical schools know this and intentionally weed out applicants who are pretty much just premed machines.  As an applicant you need to prove to medical schools that you not only have the intellectual capacity to keep up with the curriculum, but also that you have healthy coping mechanisms for dealing with the stressful and depressing nature of the job.\n\nSource: I am a second semester college senior who got into their top choice med school as an early decision applicant.",
                            "score": 4,
                            "author": "JSD12345"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;Med school is rote memorization and a sprinkle of critical thinking\n\nI went to medical school. That's not true at all. There is a LOT of critical thinking in medical school. Your third year is almost entirely critical thinking. You'll get eaten alive if you try to memorize your way through a patient encounter.",
                            "score": 4,
                            "author": "mhc-ask"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "People have dreams, and they're working hard to pursue them. You're essentially telling people to stop trying because they'll never be smart enough. As long as there is a mixture of safety, target, and reach schools there is no reason to not aim for the top.",
            "score": 7,
            "author": "springsteeb",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I definitely see what you’re saying, that people should have ECs that they like and are passionate about, instead of just having them for the sole purpose of college.\n\nHowever, it comes off that you’re saying that people should just be straight genius’, and be able to have friends and a social life while also having grades and ECs good enough to get into Ivys. Which of course isn’t true at all, there’s nothing wrong with someone working there ass off to get to this level and improve themselves.",
            "score": 4,
            "author": "marveliteIG",
            "replies": []
        },
        {
            "level": 0,
            "comment": "100000000% agree.",
            "score": 3,
            "author": "BubbleTeaGal"
        },
        {
            "level": 0,
            "comment": "After reading this work by world-renown philosopher u/edxothers, I have to agree. Colleges love to see people succeeding in school, but more than that, they love to see well-rounded people who succeed in school and have other passions. \nI have slightly above average stats (I’m no 4.0/1600, but I’ve worked hard and done alright for myself) but lots of extracurriculars that I genuinely enjoy, and I think it shows.",
            "score": 3,
            "author": "okay-boomerang",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I teach in an urban HS--OP speaks the truth. I see this shit all the time. Kids who will be great members of society, and great people all around, breaking their backs, dropping courses they enjoy for more test prep, or Pre-AP/AP/BC course that TBQH crushes the vast majority of the kids I see take them. \n\nI agree with OP in that if you have to study/work to the exclusion of everything else, then maybe you should reevaluate things. Work/Life balance is so important, and destroying a social life for school will lead to it in life.",
            "score": 3,
            "author": "trv2003"
        },
        {
            "level": 0,
            "comment": "This is true even for non-top schools. I went to a State college, and even then a lot of my try hard friends got deferred/denied while I didn’t despite having lower grades (3.85 GPA). But I was really good in band and stayed in Youth Council (it was like student government but city wide) for my entire high school career, and it really helped me. \n\nObviously don’t take my advice if you’re trying to get into Stanford or something though",
            "score": 3,
            "author": "Mo_Salad",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Well, I wanted to tell this for a long time but since you've raised the issue so here goes.\n\nI think you haven't taken someone's background while evaluating them. A lot of rich people, who are academically inclined, groom their children from early on. So when they are at college going age, they already have the necessary social skills and academic knowledge. But people from poor background have to first get the academic knowledge before they can even compete. There are exceptional people but in general rich people have better social skills in addition to the academic skills.\n\nSo the issue basically goes to rich kids vs poor kids. Its unfair to poor kids but the whole society is geared towards the rich hence its not really unfair.",
            "score": 3,
            "author": "svayam--bhagavan"
        },
        {
            "level": 0,
            "comment": "If they really worked as hard as they say they did then they belong at the top schools no question about it. I applied to a bunch of schools and none of them asked me if I have a life or not, they asked me about my grades, test scores, EC’s, passions, etc. I don’t understand how this crap is getting upvoted lol.",
            "score": 8,
            "author": "AgentWaffles",
            "replies": [
                {
                    "level": 1,
                    "comment": "Having passions and following through= having a life imo, you misinterpreted the intention of the post",
                    "score": 9,
                    "author": "edxothers",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "In the most humble way I can say it, I got into Stanford with terrible stats. 3.6 GPA and 31 act. I'm a URM and I am very involved with my culture and I love sports, and Iwrote my essay about music, something that wasn't even mentioned in my application or even something I plan to pursue in college. Just be an interesting person and don't give yourself off as a boring scholar. College would suck if it only had people who obsess their lives over some numbers on a piece of paper. Of course, good stats do help, but once you're in a certain range a few decimal points won't matter at all.",
            "score": 9,
            "author": "noicegod",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly! Being an interesting person is awesome. If your biggest personality trait is a good ACT score that’s a problem",
                    "score": 10,
                    "author": "edxothers"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I disagree with you. I think that most high school students (not necessarily the ones you see on this subreddit) do extracurricular activities that they find fun and enjoyable, not because they think the activities will look great on their college resumes. It seems to me that if you’re feeling this way, you must go to a very competitive high school. Maybe you feel like those students who work their butts off aren’t genuine. But you don’t necessarily know who these kids are outside of school. Maybe they love video games, or comic books, or nature, or baking, or filmmaking, but you only see the kid who tries to hard and has no life outside of school. Everyone, even the most “try hard” person has a life outside of school, but the things they make time to do out of school might not be something they are listing on their college apps.\n\nThere are a ton of paths to top schools. You guys are teenagers. Some students have true academic passions in high school, but you don’t need to have everything all figured out right now. Some of you are stressed out. Some of you are being pushed by their parents and some of you think you have it figured out but will change your minds once you enter college. You don’t need to have your school work and social life and outside interests all perfectly balanced to get into a top school.\n\nWhen I was in college, I once told a professor that I wasn’t sure if I chose the right major because I found my classes to be really challenging. She told be that it was supposed to be challenging—that you don’t major in something because it comes easy to you. Even the smartest, most naturally gifted kids in high school can study something that challenges them in college. Like in high school, in college you have to prioritize between your schoolwork and grades, mental health, and having fun. But in high school, you have demands from your parents and teachers, while in college, it’s all on you.",
            "score": 9,
            "author": "feartherex",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s literally the point of my post... I think you misinterpreted it. If someone IS solely doing an EC for college, that’s a problem. And people definitely 100% do at times. Some people genuinely have almost no life out of school and they’re likely not the people Ivys are looking for most of the time. But if someone IS genuine about it, that’s great!",
                    "score": 8,
                    "author": "edxothers",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "But still on the other hand if you’re not as smart as you want and you always have the option to have a social life is being dormitory and studying to be smart and do better on extracurriculars really that bad if then you can go back second semester of senior year to having the life you want? Because still even if you had a life and are a semi smart student you can’t get into a T-30 by just average extracurriculars and awards right?",
            "score": 2,
            "author": "Atticus326"
        },
        {
            "level": 0,
            "comment": "No one on the planet thinks that just a 4.0 and 36 ACT will get them into college. Literally one single google search regarding T20 acceptees' profiles will show you they had 1-3 activities and 1 that they really focused and expanded upon in their free time, often producing results far above a typical participant. Everyone knows that approaching college applications as if they are a checklist is widely known to be the wrong approach. I don't understand how on earth this is an unpopular opinion—it's literally on the sidebar.",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "A lot of people so far have disagreed haha, although it’s more popular than I originally thought",
                    "score": 2,
                    "author": "edxothers",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "damn, u just did me like that",
            "score": 2,
            "author": "laflame013"
        },
        {
            "level": 0,
            "comment": "I feel the same way, kinda. Like i never had a \"dream college\" to attend and still don't. All i want from college is the knowlegde about my desired subject (which i love to death) so that i can specialize later and get a job i will genuinely enjoy. Like the name or prestige of the college is not important at all.",
            "score": 2,
            "author": "_DeshellingAcrab_"
        },
        {
            "level": 0,
            "comment": "Bad stats and no social life gang",
            "score": 2,
            "author": "FeeshGawd"
        },
        {
            "level": 0,
            "comment": "As a college student who will be applying to grad next year I somewhat agree with this. You need to have Some real world experience and maturity. You want to be able to sit down with an interviewer and be able to talk to them as a peer. You also need to show you are serious about the profession and aren’t just going for it because of the money or you dreamt about it since you were young.\n\nIt’s important to take time off from school work to have a life, you will gain so much in confidence and understand your self a lot better. No one really cares if you are an expert piano player or were head of the debate team, they just want to see a competent adult.\n\nAlso, if you don’t learn important skills like how to maintain a relationship, balancing friends with work, developing good social skills, understanding failure and humility, etc. your just gonna wind up one sad miserable adult.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "As a bonafide idiot, it always baffled me how the smartest kids in my high school(we're talking 4.5 weighted GPAs) always seemed to be fucking around setting fires in the forest or something while I studied in my normal classes for maybe a B. \n\nSome people are just smarter and deserve those more competitive schools.",
            "score": 2,
            "author": "MrSomnix"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think it depends on how hard they work, really. If you need to spend 2000 hours studying to get a 33 on the ACT then you’re definitely very dedicated but you might not be a good fit certain careers",
                            "score": 2,
                            "author": "edxothers",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's both work ethic and talent though. It's the hare and the tortoise story. If the hare had the work ethic/dedication, it could easily beat the tortoise--it can literally run circles around it. But the tortoise wins eventually because of sheer effort and persistence rather than natural ability or talent. \n\nIf you have both then you're unstoppable.",
                                    "score": 2,
                                    "author": "Noisetorm_"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "the hyperfocus on these numbers rather than being a genuinely well-rounded student is also (more significantly) related to \"burning out\". when you get to college and start trying to balance grades and having a life, itll be much harder if it's something you havent practiced. especially if you're studying far from home... you won't have anyone around to help support you when you can't hold yourself up.",
            "score": 2,
            "author": "crossedcandlesticks"
        },
        {
            "level": 0,
            "comment": "Yes. I don’t know why I am still subscribed to this subreddit as I am now a college freshman but this is true. A majority of people that ended up at top schools had a life. \n\nAny bum can get good test scores and GPA in college. High school is much easier than college.",
            "score": 2,
            "author": "SultanOilMoney"
        },
        {
            "level": 0,
            "comment": "Agreed. No T20 university, with not very many exceptions, is going to accept an applicant who clearly only does ECs and gets good grades for the sake of prestige and extra boosters on college apps. \n\nGenerally, all that shows is that you have no genuine passions and are not naturally talented, you’re just a try-hard.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "OP has about as much authority on the subject as a turd does.\n\n(I went to an Ivy League and am an alumnus interviewer)",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I got into a great school in my state and still studied constantly. It wouldn't have mattered where I went, I would have worked just as hard. I am thankful I didn't go to a top school because my student loans only gave me enough to go to a less prestigious one.",
            "score": 2,
            "author": "Steve_Rogers_Titties",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "A lot of top schools will take a 3.6 with a great personality over 4.0 with no personality tho",
                    "score": 2,
                    "author": "edxothers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Worked my ass off getting into my dream school, a pretty good engineering school, and finally realized there was way more to life than a 4.0 GPA. Found a social life, my grades dropped, and I realized I'm way happier being an average student having fun than a great student studying all the time. Wish I had this knowledge in highschool, who knows where I'd be now.",
            "score": 2,
            "author": "Die_Lit_97",
            "replies": []
        }
    ]
}