{
    "id": "fexhjx",
    "score": 6287,
    "title": "Juniors, this is your chance to cure COVID-19 to get an auto admit to Harvard. Don’t lose it.",
    "author": "NeoLiberaI",
    "date": 1583598780.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/fexhjx",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4369385/\n\nfigure out how to better deliver an ACE2 inhibitor to your lungs, pair it with drugs that boost your immune system and cont iv.\n\nFind a better test for corona, THATS how to get in.",
            "score": 1308,
            "author": "ineedchickentendies",
            "replies": [
                {
                    "level": 1,
                    "comment": "Future Headlines: *100 high school juniors cure covid-19 in the same way!*",
                    "score": 675,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "You can't do that. It's not that simple... \n\nWhile it's true that Covid-19 and SARs both utilizes the ACE2 receptor to enter the cell, ACE2 plays an important role in regulating heartbeat. So if you inhibit the ACE2, then you would cause the patient's heart to malfunction.\n\nFinding a better test for Corona really is the best thing to do right now.",
                    "score": 247,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Death is the solution to the coronavirus.",
                            "score": 101,
                            "author": "DrumletNation",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s also the best method of prevention",
                                    "score": 45,
                                    "author": "thpaghetti6"
                                },
                                {
                                    "level": 3,
                                    "comment": "Death solves all problems. No man, no problem. -Joseph Stalin",
                                    "score": 37,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"Mao people Mao problems\"- Mao 'the schlong' Tzedong before taking a great leap forward",
                                            "score": 27,
                                            "author": "skilled_cosmicist",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Igsce history 9",
                                                    "score": 11,
                                                    "author": "MyUsernameIs3pic"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "True lol",
                                    "score": 10,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Who needs a heart anyways?",
                            "score": 98,
                            "author": "DaMeteor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not me, if I die who wants it",
                                    "score": 24,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Me please.  Heart ❤️been broke 💔 so many times ⏰ i i don’t 🤷‍♀️know what to believe 💭 yeah 👍 mama 👩🏾 said it’s my fault 👎🏿",
                                            "score": 34,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "U alright dude?",
                                                    "score": 8,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I’m being taken over by TikTo- \n\nThis is for Rachel you big fat white nasty smelling fat bitch why you took me off the motherfuckin schedule with your trifflin dirty white racist ass you big fat bitch oompa loompa body ass bitch I'm coming up there and I'm gonna beat the fuck out of you bitch",
                                                            "score": 9,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "O.o",
                                                                    "score": 7,
                                                                    "author": "[deleted]"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "eh man you win some you lose some",
                            "score": 25,
                            "author": "advancedcss"
                        },
                        {
                            "level": 2,
                            "comment": "Wait, so the real goal is making full replacement artificial hearts.",
                            "score": 5,
                            "author": "ccAbstraction",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah haha... After you're cured (2 weeks of no heart should be no problem) :))",
                                    "score": 6,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "How come you don't stop the heart long enough for corona to die out then restart it?",
                            "score": 3,
                            "author": "Puffymar1234",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hahaha",
                                    "score": 3,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What would better testing look like?",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It would need to be fast and effective. Since there is a lot of infected people right now, we need to be able to differentiate the infected from the non-infected to separate them and reduce the spread.\n\nAn example could be to test for the covid-19 antibody in our body through blood test. (Which I believe was already done but still takes a long time to check)",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What would better testing look like?",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "dang bro wish there was some horrible outbreak I could've taken advantage of! \n\n/s",
                    "score": 60,
                    "author": "callmemateo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Also juniors, this is your chance to contract COVID-19 and have a great common app essay about overcoming adversity",
            "score": 193,
            "author": "Shmookley",
            "replies": [
                {
                    "level": 1,
                    "comment": "Anyone on the east coast wanna carpool to WA?",
                    "score": 41,
                    "author": "BananaMan4444",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "don’t have to go that far when it’s already in ATL 😔",
                            "score": 18,
                            "author": "soliette",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s in NC too, but the road trip will offer more to write about",
                                    "score": 14,
                                    "author": "BananaMan4444"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My school is being shut down because of COVID-19 as someone in WA. I'm so excited for my common apps essay.",
                            "score": 10,
                            "author": "MorallyApplicable",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "sars-cov2 is in my town and events are being shut down but I’m already a senior 😗✌️\n\nright now I just want prom to happen :(",
                                    "score": 6,
                                    "author": "confettichloe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Aww :( I'm sorry. I hope all clears up by then for your prom!!",
                                            "score": 6,
                                            "author": "MorallyApplicable"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Me in FL driving to Tampa. It’s already here boys",
                            "score": 5,
                            "author": "aintzanep"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was actually wondering about something like this. I was considering writing about my schools shooting that happened a few months ago and stuff. I feel bad saying this, but I feel like it’d make me stick out more.",
                    "score": 3,
                    "author": "Voldemort57",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If your school had a shooting, that is most definitely, without a doubt, something you should write about. Very few students will be able to have a story like that, and it while this may be unfortunate, it is true that the more heart wrenching your story is, the better. For a lot of people it may be difficult to write about such a traumatic event, and if that is the case then don’t write the essay, but if you can stomach it, talk about any people you know who were harmed directly, or any relationship you had with the shooter, and most importantly, how you were able to overcome it and accomplish some goal, or use it as a catalyst for some shift in your life.",
                            "score": 7,
                            "author": "Shmookley"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "While you smart science kids do that, the liberal arts kids are going to get the virus so we can write essays about it",
            "score": 389,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can see it now:\n“COVID... It has taken me over, my body is convulsing, my mind is racing. Death surrounds me, hate surrounds me”\nPlease science kids cure this before I have to read the BEAUTIFUL essays",
                    "score": 154,
                    "author": "identifyasawalnut",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "JDJJSJS OMG",
                            "score": 5,
                            "author": "gerardxway"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Liberal arts kids would talk about any possible racial implications bc of Corona relating to anti asian sentiment. Pockets of the asian American community have already seen an uptick in racial prejudice, and it’s uncertain how far it will go as hysteria rises. \n\nFor extra synthesis points, it’s not too far off from how Japanese imperialism abroad prompted the domestic internment of these individuals because of wartime hysteria. \n\nAny type of hysteria could lead to extremism, and it’s uncertain to see how far it would go from here.\n\nEdit: stanford campus shut down two weeks of classes last night. The hysteria surrounding the situation immediately after worries me.",
                    "score": 72,
                    "author": "FinalPush"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tell me deadass why I was legit trying to cure covid-19 last week just for college??",
            "score": 606,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 326,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Scientists don't have the resources available that a high schooler has",
                            "score": 59,
                            "author": "SwissyVictory",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 29,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lack of deadlines, no bureucray, state of the art high school chemistry classroom, little siblings to test on without ethical regulations",
                                            "score": 199,
                                            "author": "SwissyVictory",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hey Ferb, I know what we’re going to do today!",
                                                    "score": 91,
                                                    "author": "furlintdust"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Confidence",
                                            "score": 32,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The power of youth",
                                                    "score": 18,
                                                    "author": "skilled_cosmicist"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Ender’s game mentality",
                                            "score": 5,
                                            "author": "Calmeister"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "LMAO you mean decades of medical experience?",
                                    "score": 7,
                                    "author": "ThickTangerine"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "don't stop now! you'd be an r/ApplyingToCollege legend if you pulled it off ;)",
                    "score": 161,
                    "author": "UnrestrictedPotato"
                },
                {
                    "level": 1,
                    "comment": "Covid-19* the distinction is important right now",
                    "score": 42,
                    "author": "RaoulDuke209",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "true true I’ll edit the comment , thanks!",
                            "score": 20,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Wait what do you mean?",
                            "score": 3,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "r/UsernameChecksOut",
                    "score": 4,
                    "author": "PM_HOW_UR_DAY_WAS",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lmao how",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "oh nvm, I thought it was a reference to baljeet from phineas and ferb, bc he's a super smart child genius in the show lol",
                                    "score": 5,
                                    "author": "PM_HOW_UR_DAY_WAS",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ahah you’re right! LOL finally someone understands my username, a lot of ppl think my real name is baljeet.\n\nSadly I’m the complete opposite of baljeet’s genius...",
                                            "score": 2,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was thinking the same thing, OP",
            "score": 120,
            "author": "icebergchick",
            "replies": [
                {
                    "level": 1,
                    "comment": "Correct",
                    "score": 44,
                    "author": "HamdanAthar"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Essential oils. I’m in bros.",
            "score": 124,
            "author": "JayG941"
        },
        {
            "level": 0,
            "comment": "It's a win-win. If they refuse to admit you regardless you can threaten them with COVID-19 samples so you can get in.",
            "score": 35,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Not if you're Asian and haven't visited Africa to save humanity",
            "score": 97,
            "author": "gatorsya",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Man all these Asians look the same. Play violin, cured Coronavirus, perfect SAT. Give me something unique. \"\n\n\\-Harvard AO",
                    "score": 43,
                    "author": "DataPools"
                },
                {
                    "level": 1,
                    "comment": "You need something to help your application stand out more...",
                    "score": 28,
                    "author": "AAboostED"
                }
            ]
        },
        {
            "level": 0,
            "comment": "chance me kids still would say you have no chance",
            "score": 10,
            "author": "GodzCooldude",
            "replies": [
                {
                    "level": 1,
                    "comment": "For real, lmfaooo. \"Maybe if you cured it in February\"",
                    "score": 27,
                    "author": "NeoLiberaI"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Comes with a free Nobel prize!",
            "score": 60,
            "author": "MrDarSwag",
            "replies": [
                {
                    "level": 1,
                    "comment": "Will that look good on the application?",
                    "score": 63,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not as good as a volunteer trip to Uganda, but I hope it does the trick",
                            "score": 61,
                            "author": "MrDarSwag"
                        },
                        {
                            "level": 2,
                            "comment": "not as good as NHSS tho",
                            "score": 13,
                            "author": "ineedchickentendies",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s the only thing that got me and my friends into brown it was a flex on my app",
                                    "score": 2,
                                    "author": "davidcf67"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nah, I wouldnt be so sure. Maybe if you had a legacy to go along with it",
            "score": 15,
            "author": "acrossthe-universe"
        },
        {
            "level": 0,
            "comment": "Seriously yO 😂😂 where are all the stem kids when we need them most",
            "score": 9,
            "author": "Alymedin"
        },
        {
            "level": 0,
            "comment": "This can honestly hurt Asian applicant’s chances this year tho",
            "score": 31,
            "author": "dlwnsguq0210"
        },
        {
            "level": 0,
            "comment": "Too bad I'm not an affluent genius whose multimillionaire doctor parents taught me the tricks of the medical trade. \n\nOh, well. Guess my parents can't place a bribe.",
            "score": 11,
            "author": "thegreatestgemini"
        },
        {
            "level": 0,
            "comment": "Chegg it. Problem solved",
            "score": 6,
            "author": "CursedClimb",
            "replies": [
                {
                    "level": 1,
                    "comment": "but that requires a membership :(",
                    "score": 3,
                    "author": "confettichloe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A cure is easy. It is well known that 70% alcohol is the best at killing bacteria and viruses. All you have to do is set sick people on an IV drip of isopropyl until their BAC is 70%. But I dont need an auto admit to harvard, I already know everything.",
            "score": 10,
            "author": "Idonoteatass"
        },
        {
            "level": 0,
            "comment": "Come on Stanford REA applicants this one’s on you",
            "score": 4,
            "author": "legobaba"
        },
        {
            "level": 0,
            "comment": "I'm going to start cloning SCP-500. Wish me luck, guys.",
            "score": 9,
            "author": "Catty-Cat"
        },
        {
            "level": 0,
            "comment": "😂😂😂",
            "score": 2,
            "author": "Banzai237"
        },
        {
            "level": 0,
            "comment": "I'm WHEEZING",
            "score": 2,
            "author": "evilclawz"
        },
        {
            "level": 0,
            "comment": "The fact that Harvard is the end goal and curing COVID-19 is the means is backward.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Please all be safe ...",
            "score": 3,
            "author": "sharkjeev"
        },
        {
            "level": 0,
            "comment": "I was thinking about that yesterday",
            "score": 1,
            "author": "Historiawaifu"
        },
        {
            "level": 0,
            "comment": "I feel like there may be less applicants early to the colleges because of the outbreak",
            "score": 1,
            "author": "LarryC3"
        },
        {
            "level": 0,
            "comment": "Easy, just [read this](https://www.reddit.com/r/copypasta/comments/et9hmz/the_entire_wuhan_virus_genome/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) and design a protein that binds to it, and only it",
            "score": 1,
            "author": "cresomp"
        },
        {
            "level": 0,
            "comment": "Wow. Thank you. Now everyone has the same idea as me. Now I'll never get into Harvard.",
            "score": 1,
            "author": "rant-rant-rant"
        },
        {
            "level": 0,
            "comment": "u/mcoolinham use it to get into rochester... I believe in you",
            "score": 1,
            "author": "Gallinaz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lmao I’ll get right to it in my basement",
                    "score": 1,
                    "author": "mcoolinham"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Auto admit\"",
            "score": 0,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Or you know... just win a gold medal at some international science olympiad",
            "score": -35,
            "author": "Uipncspn",
            "replies": [
                {
                    "level": 1,
                    "comment": "or ya know, college scandal",
                    "score": 20,
                    "author": "CandyCornGal10",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "500k ain’t bad you know?",
                            "score": 3,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That doesn't 'auto admit'. A lot of Olympiad ppl are rejected lol",
                    "score": 6,
                    "author": "AlexRinzler"
                }
            ]
        }
    ]
}