{
    "id": "gvnu7i",
    "score": 4101,
    "title": "Collegeboard bad",
    "author": "codingstudent7",
    "date": 1591162340.0,
    "url": "https://www.reddit.com/r/ApplyingToCollege/comments/gvnu7i",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Technically speaking, college board is \"not-for-profit\" instead of \"non-proft.\" It basically allows them to pay themselves lavish salaries.",
            "score": 286,
            "author": "desertfox_JY",
            "replies": [
                {
                    "level": 1,
                    "comment": "You are correct, but either way they really shouldn’t be charging me $50 send a test score(which is literally just a number) to one school 😭",
                    "score": 148,
                    "author": "codingstudent7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You don't know how hard it is. First you gotta send the test score to the school.",
                            "score": 147,
                            "author": "Untaken____Username",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why don’t you think I know? I’m a prefrosh and I had to send my scores to several schools.\n\nLol why is this getting downvoted, it was an honest misunderstanding. It’s not like I said something offensive. Yall are weird",
                                    "score": 0,
                                    "author": "codingstudent7",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It was a joke. I talked it up to be hard, then listed a short step",
                                            "score": 89,
                                            "author": "Untaken____Username",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ah, apologies. It’s hard to tell sarcasm online lol",
                                                    "score": 48,
                                                    "author": "codingstudent7",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "No it’s not. I can read your mind",
                                                            "score": 15,
                                                            "author": "[deleted]"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "/s",
                                                            "score": 6,
                                                            "author": "shingdao"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah it was a good one. I personally woulda gone with this:\n\nYou have to transmit the full 0.000004 megabytes of information electronically between computers handled by massively wealthy organizations that do this stuff all the time. Do you know how hard that is? Have you ever sent an email with more than 4 alphanumeric characters to someone?",
                                                    "score": 24,
                                                    "author": "IshwarKarthik"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "And then you have to put up with criticism because you're running an unethical process. Such a hard line of business and definitely worth the money lmoa",
                                    "score": 1,
                                    "author": "1amlegend-13"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Schools also buy your name from the collegeboard so they make money that way too. This is why you have mail from colleges you have never heard of.",
                            "score": 18,
                            "author": "iamsavsavage",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Colorado School of the Mines went hard, holy shit",
                                    "score": 19,
                                    "author": "Kittaylover23"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yep, there is a lawsuit about it I believe",
                                    "score": 2,
                                    "author": "emminet"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "the one thing about the college board that baffles me the most is how they’ve managed to have a “rush shipping” option for sending SAT scores. great, it costs $30 to send a couple digital numbers to a school. and it takes days somehow? i’m convinced the processing time on these things are artificial given the simplicity of the task.",
                            "score": 13,
                            "author": "skunk-boy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’ve heard rush shipping is a scam and makes no difference",
                                    "score": 3,
                                    "author": "codingstudent7"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You really gotta love how collegeboard takes 2 WEEKS to send an EMAIL containing a single number after you pay $50",
                            "score": 12,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly! It’s infuriating",
                                    "score": 2,
                                    "author": "codingstudent7"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;**Not-for-profit** organizations **are** types of organizations that **do not** earn **profits** for its owners. All of the money earned by or donated to a **not-for-profit** organization **is** used in pursuing the organization's objectives and keeping it running.\n\nhuh",
                    "score": 10,
                    "author": "Soft-Future"
                },
                {
                    "level": 1,
                    "comment": "The NFL and MLB are nonprofits (not even not-for-profits) and the NFL pays Roger Goodell \\~$40M in total comp annually.  There's nothing preventing any nonprofit from making a ton of money and paying it out in salaries, just that they have to make the salaries public info.\n\nAlso iirc because of public pressure, the NFL and MLB both started paying taxes voluntarily in the 2010s but they never really had to.",
                    "score": 7,
                    "author": "Temper03",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for putting collegeboard’s greed into perspective (hint it’s relatively minimal). Doesn’t mean they aren’t greedy but there’s far worse in Murica",
                            "score": 1,
                            "author": "pokemongofanboy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "they are not for profit, not nonprofit, but it is important to note that their employee are overly profiting.",
            "score": 93,
            "author": "tcchoi",
            "replies": [
                {
                    "level": 1,
                    "comment": "Whats the technical difference",
                    "score": 20,
                    "author": "Faizan24839",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "not-for-profits usually cannot qualify for tax-exempt status in us. collegeboard is a very shitty exception =/",
                            "score": 43,
                            "author": "fullert0n"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Legally, not-for-profit is not a thing. The college board is a nonprofit, meaning that their money does not go to pleasing the shareholders and they are tax-exempt.",
                    "score": 7,
                    "author": "HSHopeful",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 0,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You can argue about the semantics, but either way, the college board is a 501(c)(3) nonprofit. Not-for-profit is not an actual IRS classification, just tax-exempt status.",
                                    "score": 2,
                                    "author": "HSHopeful",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 0,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Right. Because synonyms don't exist in English.\n\nFor the record, in my original comment, I said that not-for-profit is not a thing legally, which is true.",
                                                    "score": 3,
                                                    "author": "HSHopeful"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Something something rich and politics",
            "score": 19,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I have immeasurable beef with College Board",
            "score": 5,
            "author": "tbradshaw37"
        },
        {
            "level": 0,
            "comment": "College Board is a 501c3. They receive government funding. So why do I have to pay for an exam when they already get money? I understand maybe making a voluntary donation to help keep the company running but that's corporate America for you",
            "score": 4,
            "author": "southernjew55"
        },
        {
            "level": 0,
            "comment": "You’re the new meme lord",
            "score": 3,
            "author": "icebergchick",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, icebergchick! 🥰",
                    "score": 2,
                    "author": "codingstudent7"
                }
            ]
        },
        {
            "level": 0,
            "comment": "im out of the loop, why collegeboard bad",
            "score": 2,
            "author": "Unknownx1"
        },
        {
            "level": 0,
            "comment": "My 12.9 IQ just couldn’t",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "where is the non profit part? all i see is collegeboard on a pile of money with student tears",
            "score": 2,
            "author": "bearbearbearrawr",
            "replies": [
                {
                    "level": 1,
                    "comment": "You are correct",
                    "score": 1,
                    "author": "codingstudent7"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wake me up when there are memes that don’t just shit on the College board. I’ve seen every possible variation at this point",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I invite you to create your own memes.",
                    "score": 39,
                    "author": "codingstudent7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just because I’m critical of your work doesn’t mean I have to prove I’m decent at it. If that were true, nobody would be complaining about someone’s acting, singing, or athletic abilities",
                            "score": -22,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I wasn’t asking you to prove you’re decent. My point was that if you’re not happy with our memes, then create your own that will make you happy.",
                                    "score": 37,
                                    "author": "codingstudent7",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But complaining is so much easier...maybe next time. It’s cool that you weren’t so mad",
                                            "score": 13,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Lol, why should I be mad? I agree, collegeboard memes are overdone but I was blank on ideas",
                                                    "score": 19,
                                                    "author": "codingstudent7"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Why is this downvoted, 100% fax",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "‘Tis the nature of reddit I’m afraid. Or I made a mistake but that can’t *possibly* be true!",
                                            "score": 2,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Bro I hate it when I tell someone they suck at something and they tell me do it better yourself. Like man just cause I’m worse at your thing doesn’t mean you’re good",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "True true, but A2C is full of try hards lol, so it might not fly well",
                                                            "score": 2,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "they pull too much  shit",
            "score": 1,
            "author": "HansTheAxolotl"
        },
        {
            "level": 0,
            "comment": "lol this meme is saying the opposite of what OP wanted",
            "score": 1,
            "author": "CludoMcGuire",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s true lol, I used the template wrong rip",
                    "score": 1,
                    "author": "codingstudent7"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Then explain how I have an IQ of about 130 and adamantly believe that the Collegeboard is nonprofit.",
            "score": 1,
            "author": "dinosause313",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've took an IQ test in 2015 and got a score of 134, four points higher than yours.",
                    "score": 1,
                    "author": "throwoway1589942123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "the ceo has a salary of millions",
            "score": 1,
            "author": "spongeboobryan"
        },
        {
            "level": 0,
            "comment": "That Cornell award hit so hard 😳",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "they need to pay their employees",
            "score": 1,
            "author": "KingSuj"
        }
    ]
}