{
    "id": "10a6zrl",
    "score": 1,
    "title": "Auburn Engineering Transfer",
    "author": "Apprehensive_Quit394",
    "date": 1673548698.0,
    "url": "https://www.reddit.com/r/auburn/comments/10a6zrl",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am a current Purdue sophomore in mechanical engineering. I’ve struggled a lot in ME for most of my time at Purdue and classes continue to get more difficult. I dropped below a 3.0 GPA this semester which is what I need for most of the internships I’m trying to get. I am considering transferring to Auburn ME. How difficult is the program and what can I expect compared to Purdue?",
    "comments": [
        {
            "level": 0,
            "comment": "ME is one of Auburn’s flagship degrees I know Purdue is a great school but don’t expect any slack from Auburn. Auburn’s undergrad program runs laps around GaTech’s. I’m short on specifics but the overall conclusion is that it is a very difficult degree here and if you’re already struggling at Purdue I wouldn’t come down here and expect anything different. Source: I’m an AE that’s close with a bunch of MEs. Also be sure to find out what credits Auburn will except from Purdue and look into Auburns CO-OP program.",
            "score": 8,
            "author": "cornhublover6965",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not to cast dispersions against my alma mater (either one of them), but as it relates to Georgia Tech, how did you come up with that assertion? Their UG program for ME is ranked 2nd in the nation; their College of Engineering is ranked within the Top 5, and overall, the university is ranked within the Top 20 for public institutions.",
                    "score": 4,
                    "author": "rbtgoodson"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi, I’m a current ME student, feel free to DM me! \n\nTo answer your post though… Don’t expect it to be easier. Auburn is a wonderful, amazing place, but it’s a tough as hell school. ME is a hard discipline anywhere, but Auburn also has no problems railing students with grade deflation. That alone can make simple classes hell. I don’t know what Purdue is like to compare the two directly though, so idk. \n\nAs far as internships, if you have other applicable skills, you can get one without a 3.0. I don’t have close to a 3.0, but I got one this last summer because I have a boatload of 3D printing experience. Experience is experience, and an internship is just a couple months.",
            "score": 5,
            "author": "holly_fly",
            "replies": [
                {
                    "level": 1,
                    "comment": "is dr knight still there? who teaches systems dynamics now? thermodynamics, and systesms were like the hardest classes back in the late 2000’s",
                    "score": 1,
                    "author": "royerr9954",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I believe so, because I’ve heard the name, but I haven’t had him. Bevly, Martin, and Rose teach systems, but Bevly acts as a course coordinator type, so it’s still… what it was then, if not worse. Definitively the hardest class in the major.",
                            "score": 1,
                            "author": "holly_fly",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "ha. yes thats the hardest class. and it doesnt help thay bevly is a prick. and doesnt really do much when asked for help. maybe hes changed but i doubt it. he seamed like he thought his shit didnt stink. i ended up with the stupid sears lawmower washer senior project. maybe its still going on now.",
                                    "score": 2,
                                    "author": "royerr9954",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He hasn’t changed. At all. I had him and… I’ll just say I withdrew from more than his class because of his “I haven’t deemed you worthy of my time” Attitude. I’ll be starting senior design this year, so I’ll find out XD",
                                            "score": 2,
                                            "author": "holly_fly"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Knight doesn’t teach systems anymore. Thermo II. Wasn’t much of a fan of him, very rough around the edges didn’t seem to want to reach just tell you you’re dumb. Also bevly was similar he took a rough class and made it more difficult than necessary, he was not very approachable or helpful unless you planned on going to grad school and he recruited you to work in his lab. Bevly plays favorites and he missed more than half our classes to watch rc cars race in Indiana. Martin and rose were great I went to them mostly. I ended up passing with Allen he was new last year and totally awesome would take any class with him if I was still there.",
                            "score": 1,
                            "author": "SirDavidDAR",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "yup that was bevly. i dispised him. knight was almost as bad with his thermo classes. one of my fave was bhavnani, i believe he was the heat trasnfer guy he was approachable and if you reached out he was helpful. burch was the one for thermo, and hvac. those were the only 2 that i enjoyed classes with. i actually think they enjoyed teaching.",
                                    "score": 1,
                                    "author": "royerr9954",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I forgot about burch he was good to helpful and chill, class was still hard and no partial credit with multiple choice. Never had bhavnani. I think it was ragan for heat transfer he took a brutal class and made it very approachable had a better experience there than in most other difficult classes. Tons of homework problems mostly ungraded but the big thing is he provided solutions before tests to make sure you could learn. In a lot of classes I would get B and C on tests and straight F’s on homework which would really hurt my overall grade. Never understood why so many profs never gave homework solutions that’s how I learned much of what I know. If anyone in aerospace or other has the chance to take melnick he will always be the best teacher I’ve had in my life I can’t recommend him enough.",
                                            "score": 1,
                                            "author": "SirDavidDAR"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wait there’s grade deflation??",
                    "score": 1,
                    "author": "Taylor7193"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't know about ME but the aerospace program at Auburn is just as if not more rigorous.",
            "score": 1,
            "author": "auburnstu1227"
        },
        {
            "level": 0,
            "comment": "it gets harder the further in you get.  i graduated back in 08. im sure it may be easier with youtube.(you can find alot on youtube) i may be wrong. but with the internet the way it is now .i struggled alot back then but did graduate.",
            "score": 1,
            "author": "royerr9954"
        }
    ]
}