{
    "id": "10szp0e",
    "score": 91,
    "title": "Trying again since I haven't received any word on him, and I appreciate everyone's advice on the previous post.",
    "author": "Beamer1220",
    "date": 1675469355.0,
    "url": "https://www.reddit.com/r/auburn/comments/10szp0e",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Best of luck finding your little love",
            "score": 22,
            "author": "onemanlan"
        },
        {
            "level": 0,
            "comment": "If he knows your smell maybe leave a shirt or something around the exit he got out from? Or in shrubs nearby! Good luck!",
            "score": 7,
            "author": "Rosaryas",
            "replies": [
                {
                    "level": 1,
                    "comment": "I took your advice and put a t-shirt out there along with his litterbox and some food",
                    "score": 10,
                    "author": "Beamer1220"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I assume you've checked with Lee County Humane society?",
            "score": 6,
            "author": "thegrizzlyjear",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea I gave them my information and his chip # in case someone brings him in but I still have called everyday lol",
                    "score": 8,
                    "author": "Beamer1220"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I took a screenshot and sent it to my son who lives in The Village so he can keep an eye out for Puck. We are a family of cat lovers and hope he comes home to you very soon!",
            "score": 5,
            "author": "seechellem",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! I appreciate it a lot",
                    "score": 3,
                    "author": "Beamer1220"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Probably a shot in the dark but I’ve seen a lot of stray cats in the back of the grove",
            "score": 5,
            "author": "Parkur8",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was just about to say I saw a cat with similar colors walking around the Grove a few hours ago.",
                    "score": 1,
                    "author": "Deep_Spectrum"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When my Gypsy got out I tried everything. Only one thing worked. Indoor cats, if they escape, will only really be active from 2-4 am. That’s when you need to look for Puck. That’s when I found Gypsy.",
            "score": 5,
            "author": "Cawfeestain"
        },
        {
            "level": 0,
            "comment": "Get a havahart trap. You can find them at Home Depot or Lowe’s. Your vet might have one you can borrow. Set it up near your place in a inconspicuous location like in bushes. There is a 45 second video on YouTube “how to set a havahart raccoon trap” that shows you what you need to do. I would have never gotten my Merlin back without it.",
            "score": 3,
            "author": "Definitely_Not_Erin"
        },
        {
            "level": 0,
            "comment": "Go look to where he usually goes when he gets out. If he’s hurt then he will prob be hiding, maybe even in a tree. Cats will stay in trees for a long time if something is wrong or scares them",
            "score": 1,
            "author": "Immediate_Cover_3026"
        }
    ]
}