{
    "id": "11l00hn",
    "score": 2,
    "title": "Best apartments in Auburn",
    "author": "Lolo_2022",
    "date": 1678197394.0,
    "url": "https://www.reddit.com/r/auburn/comments/11l00hn",
    "media_urls": [],
    "other_urls": [],
    "postText": "What are the two best apartment’s in Auburn for an 18 year old Freshman female? Looking for safety/security and proximity to campus. \n\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "Compared to other cities, most apartments in Auburn are pretty safe, even the ones that look kind of rundown! The main questions are do you have roommates and how much are you willing to pay? In my experience, the dorms are a good option for a freshman. Townhouses on N Gay and Ashton Heights are nice and near campus if you have roommates. One thing I would say is don’t put too much stock in a gated complex because people give out the passcodes like candy here",
            "score": 10,
            "author": "bpud14",
            "replies": [
                {
                    "level": 1,
                    "comment": "One roommate would be fine. Not to concerned about the costs.",
                    "score": 1,
                    "author": "Lolo_2022",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Got ya. Really the places on or right next to campus downtown (like along Magnolia and Glenn) are all relatively safe—it just comes down to price and also it can be pretty noisy if you’re near the bars or Greek houses. Personally, I prefer the north side of streets if you go outside of downtown—there are a lot of apartments on S College for example but it can be a pain to get through to campus from that direction with traffic.",
                            "score": 4,
                            "author": "bpud14"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The place currently called Samford Square is not safe. It's the cheapest housing in the area for a reason, that's where the shootings tend to happen.\n\nEdit: For those looking for sources, looks like one happened there again just a couple years ago in 2021, though the article doesn't name the complex it is one of the very few on the 200 block of west longleaf and given its history its very likely to have been the one. https://www.wrbl.com/news/six-arrested-after-gunshots-erupt-at-auburn-apartment-complex-party/\n\nHere's an article from the one that happened while I was living there. It happened about 100 feet away from my bedroom window but I was lucky enough to be at a party down the road at the time. https://www.wtvm.com/story/27651180/residents-at-tiger-lodge-apartments-want-out-of-their-leases-after-fatal-shooting/",
            "score": 10,
            "author": "zthompson2350",
            "replies": [
                {
                    "level": 1,
                    "comment": "It was Tiger Lodge back when I was in college, no good. The Chevron at the end of longleaf had also been held up at gunpoint a couple times and then the Blanchard kidnapping happened at the gas station a little further down on S College. Events like these are still rare, but it’s honestly the proximity to the 85 exit and the backroads that connect to Cox — almost always people coming in from out of town vs auburn residents. I lived in 2 places along Longleaf/S College and personally never had any issues, but if safety is the main concern, other side of town is a better bet. \n\nAlso, I’ve already said this in this thread but good god I hate driving onto campus from S college it just feels eternal",
                    "score": 2,
                    "author": "bpud14"
                },
                {
                    "level": 1,
                    "comment": "Dang one of my brothers live at Samford Square",
                    "score": 1,
                    "author": "dyldyl8"
                }
            ]
        },
        {
            "level": 0,
            "comment": "not the Hub.",
            "score": 5,
            "author": "littlemisskeith"
        },
        {
            "level": 0,
            "comment": "I loved my time at 221 because I felt so safe and there were a lot of people my age around me. It’s definitely not the nicest complex in the world but it was so homey and the management was awesome. Super close to campus and downtown and the price was very reasonable considering the location. I lived there as a sophomore and I am a female",
            "score": 4,
            "author": "Electronic-Camera-36"
        },
        {
            "level": 0,
            "comment": "Freshman females in my opinion, have the best opportunity to make friends, walk to class, and really experience freshman life if they live on campus. There are many options. Apartment living can wait.",
            "score": 3,
            "author": "kathnick1416"
        },
        {
            "level": 0,
            "comment": "Gentilly Park is a great bet if you don’t mind a trailer. Lives there all my years in Auburn and never had a problem. It’s cheap, safe and gated.",
            "score": 4,
            "author": "auburntiger1984"
        },
        {
            "level": 0,
            "comment": "320 West mag is right next to campus, 160 Ross kinda close, the standard, Logan square/the union about 15~ from campus walking but you can take the bus. Kinda anywhere near the frats are safe and fairly close to campus like eagles west and the others. All of these are safe but honestly everywhere is safe in auburn outside of a few sketchy spots",
            "score": 2,
            "author": "Jburnette17"
        },
        {
            "level": 0,
            "comment": "Oliv. I live there (male) and it's mostly girls. It just opened last fall. It's a three minute walk to campus and the building is great. Great gym, actually useful common areas to read, great study rooms and a really cool rooftop pool with great views. I used to live at 320 and it was much more easy to access (especially at night) if you didn't live there and that wasn't great. That's not the case at Oliv. There's only one way in, you need a key fob and from Thursday to Saturday there are two security guards all night in the lobby. I love that building. \n\nTake a look at their instagram page but it is far and away the building with the most useful design along with the best finishes (I'd say just a tad above 320) in the apartments themselves, including really tall ceilings and floor to ceiling windows. I live in a studio but the shared apartments are also pretty nice. \n\nHighly recommend, particularly for a first year female.",
            "score": 2,
            "author": "Safe-Jackfruit-4902"
        },
        {
            "level": 0,
            "comment": "I  got in auburn 2012 and graduated 2017 and i couldnt tell you what apartment i would choose my freshman year now days. so much has changed since then.  but i would definitely live near campus your freshman year for the full experience. in my opinion you only get that rookie feeling one time so no matter what apartment it is there is no price tag in the united states that matches freshman life experience and campus life at auburn. And i can tell you by your junior year you prob will need to be away from all of that distraction just to be able to pass auburn lol. Good luck to you friend",
            "score": 2,
            "author": "getafterthat1234"
        }
    ]
}