{
    "id": "1210ith",
    "score": 3,
    "title": "Possible to switch to summer term?",
    "author": "NewAardvark6001",
    "date": 1679695747.0,
    "url": "https://www.reddit.com/r/auburn/comments/1210ith",
    "media_urls": [],
    "other_urls": [],
    "postText": "I want to get ahead on a few classes just to lighten my course load for the fall. I’m an upcoming freshman accepted for fall term, submitted enrollment deposit and everything. I’m wondering if it’s possible to take some prereq classes online over the summer (calc 1, English 101 is what I was specifically thinking). Is this possible ?",
    "comments": [
        {
            "level": 0,
            "comment": "Auburn usually offers incoming freshmen a deal on summer classes. It's insanely cheap too ... Maybe 12hrs for $2k? Don't quote me on the price. Wait for an email.\n\nDON'T TAKE CALC 1 THIS WAY UNLESS YOU ARE A SAVANT. \n\nGet as many English, history, theater, anthro or whatever as you can but do not take your first college math or science in summer. You will cry.",
            "score": 17,
            "author": "tonguescrapingchakra",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'd suggest if they were to try to get ahead on any kind of math during the summer, just do it at an online community college",
                    "score": 7,
                    "author": "wynn_ed"
                },
                {
                    "level": 1,
                    "comment": "But why though? How are the classes harder ? Is calc 1 not just calc 1?",
                    "score": 2,
                    "author": "NewAardvark6001",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Summer terms are a bit shorter than normal semesters iirc. Also it’s your last summer before college, you’ll want to have a life outside of school. I’d recommend knocking out math and science classes at a local community college if you can",
                            "score": 9,
                            "author": "degaknights"
                        },
                        {
                            "level": 2,
                            "comment": "2 aspects of college math make calc 1 hard: pacing and sudden-death grading.\n\nMost people coming from highschool had the same math all year. Fall semester is only about 15 weeks. That pace takes getting used to. Summer is even shorter- only 10 weeks.\n\nMany math classes are graded on 3 exams and a final. Your first time having each exam be 20% and the final 40% is very intense. You have to learn to study for that course structure. It gets you mentally ready for engineering if you survive it. Lol then you only have 2 exams and a final.\n\nCombining the transition from highschool pacing/intensity with a short summer semester can make you feel like you can't handle college.",
                            "score": 3,
                            "author": "tonguescrapingchakra"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'd also take a look at what Southern Union is offering!",
            "score": 4,
            "author": "IreRage"
        },
        {
            "level": 0,
            "comment": "I knocked out my degree in 36 months by taking 6-9 credits over each summer. I highly recommend. It's a little faster pace, but I found that to be better because it tends to cut out the fat. I would not recommend Calc 1 and Physics 1 over the summer. I did that my first semester here after not being in school for 10 years... it was rough, like - \"I am going to drop out of college\" rough... still got an A, but I gave my heart and soul...so it is absolutely possible. I would recommend taking genEds in the summer, like English or History. I took History I and II concurrently over a summer and though it was a lot, I would 100% do it again. I also tossed in another degree related course that semester and it was honestly one of the best.",
            "score": 2,
            "author": "SkydivingSquid",
            "replies": [
                {
                    "level": 1,
                    "comment": "Rather then at auburn do you think taking it a CC would be a smart decision (maybe it’s slower paced or something idk)?",
                    "score": 2,
                    "author": "NewAardvark6001",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I preferred to stay AU through and through. But it’s dealers choice. If you want to take classes through other colleges, as long as they are accepted you can go that route. I never took a class elsewhere because it was “easier”. Then again I didn’t take honors courses because I didn’t want anything to threaten graduating.. I'm still graduating summa cum laude.",
                            "score": 2,
                            "author": "SkydivingSquid",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks for the detailed response, helps a lot",
                                    "score": 1,
                                    "author": "NewAardvark6001"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I took math at Southern Union through the summer (I think it was calc 2/linear equations in separate summers). Honestly I much preferred SUSCC’s math teaching to Auburn’s. Their teachers are good at really starting at the basics and building up to the deeper concepts. Fair tests and homework, I’d certainly say easier than Auburn but I don’t feel like I sacrificed any understanding of the concepts.",
                            "score": 1,
                            "author": "Inevitable-Health790"
                        }
                    ]
                }
            ]
        }
    ]
}