{
    "id": "12fcztt",
    "score": 9,
    "title": "Auburn Flats Apartments",
    "author": "Express_Ad2942",
    "date": 1680932762.0,
    "url": "https://www.reddit.com/r/auburn/comments/12fcztt",
    "media_urls": [],
    "other_urls": [],
    "postText": "Anybody know anything about these apartments?\n\ntrying to watch out for fake reviews on apartments. seeing a lot of places either with dozens of reviews on the same day or the reviews being the only one the accounts have ever. (e.g. sort by new on The Standard)",
    "comments": [
        {
            "level": 0,
            "comment": "It looks like The Standard might be doing what Evergreen is doing where you can get a prize for leaving a review. I’ve seen other apartments that will also hold an event and then ask people to leave reviews while they’re there and a lot of those comments mention crawfish",
            "score": 7,
            "author": "remzilla_",
            "replies": [
                {
                    "level": 1,
                    "comment": "that actually makes sense now",
                    "score": 3,
                    "author": "Express_Ad2942"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am living in Auburn Flats right now. This was supposed to be temporary, but we fell in love with it. It's quiet, safe, and the property manager is the sweetest woman you will ever meet (she does talk a lot though). You will have to supply your own washer/dryer - or use the on site laundry. They just installed all new AC/Heating HVAC systems with wifi capability, internet speeds are good, cell reception is decent, and its only a 15 minute drive from anywhere (campus, opelika, downtown). My wife and I have really enjoyed it. They are clean and any issues you have are normally corrected same day. The property also has a small gym (more cardio focused) and an in-ground pool. I would 100% recommend.\n\nThey are also pet friendly for a small monthly fee. You will have to provide proof the pet is vaccinated. There are doggy bins for people to use that are out of sight.",
            "score": 2,
            "author": "SkydivingSquid",
            "replies": [
                {
                    "level": 1,
                    "comment": ":O SKYDIVINGSQUID HI\n\nI am the pip manager on the CSSE discord LOL\n\nThe world really is small; this is honestly the only review I need",
                    "score": 2,
                    "author": "Express_Ad2942"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lived there my first year in town. They were fine, if a bit dated. The location is great and the apartments themselves are pretty spacious. The balconies and fireplaces are a fun addition. Maintenance is really hit or miss...they fired one guy halfway through me living there and he had apparently just thrown away my list of things to fix from move in, and the new guy never actually fixed any of it. Luckily, as was mentioned, the property manager is great, and she made sure I didn't pay for any of that stuff on move out.\n\nNeighbors were nice, mostly adults and families. The pool is nice, the cardio room is laughably small, but the peletons are nice.\n\nI didn't love that I was paying the same as others in town (the Glenn, greystone pointe) that are newer and much nicer, but when I moved Auburn flats was the only one available. I moved out when I bought a house, but if I had ended up needing to stay longer, it would have been fine.",
            "score": 2,
            "author": "knopeknopeknopenuhuh"
        }
    ]
}