{
    "id": "12tlon6",
    "score": 9,
    "title": "People who have lived in Northcutt’s Studio Apartments…",
    "author": "CaptainGhost007",
    "date": 1682039687.0,
    "url": "https://www.reddit.com/r/auburn/comments/12tlon6",
    "media_urls": [],
    "other_urls": [],
    "postText": "How did you feel about the space in them and how did you maximize space in them? Particularly in their War Eagle property since that’s the one I’m eyeing. I’ve been thinking about getting a loft bed that way I can have a desk underneath it but looking through the photos it’s kinda hard to tell how tall the ceilings are. Do you think a 6ft guy could fit comfortably with one?",
    "comments": [
        {
            "level": 0,
            "comment": "I would look at Dexter Arms instead. Slightly bigger while still small. Being a bigger guy, might be just the right size to be able to spread out just a little more.",
            "score": 8,
            "author": "No_Hovercraft8054",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah Dexter and Neil were on my radar but the photos on the website weren’t really catching my eye and is why I was leaning more towards War Eagle (renovated) since it had that modernish renovated look. But yeah I’m still open to looking and actually seeing first hand the places",
                    "score": 3,
                    "author": "CaptainGhost007",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree lol War Eagle is not bad. Just small. They are renovated. Go talk to Northcutt. I think some of the Dexter Arms just got renovated within the last year or so.",
                            "score": 1,
                            "author": "No_Hovercraft8054"
                        },
                        {
                            "level": 2,
                            "comment": "Dexter and Neil are not great. I suggest, if you live in one, spend most of your time outside. To answer your question though, get small furniture. Not like cat furniture but twin bed, futon maybe? Wall-mount your tv. Fold-up table. That sort of thing.",
                            "score": 1,
                            "author": "AUMojok",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I considered the cheap studio apartments in the first place because between work and school I’ll probably be in the apartment mainly just to rest so I didn’t need anything too expensive. What didn’t you like about Dexter and Neil?",
                                    "score": 1,
                                    "author": "CaptainGhost007"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I lived at Dexter Arms for first two years at Auburn. I’m 6ft tall as well and I would say that you won’t have ceiling problems. I was able to touch ceilings with tiptoeing but that didn’t really bother me much. \n\nHowever, they have pretty thin walls in between each units. I didn’t like that part. \n\nDexter/Neil house has desks attached to the unit and it’s big enough for one person. There’s also a semi wall that separated your desk area and kitchen area so that was nice. If you live nearby, you should sign up for the tour. Hope this helps",
            "score": 2,
            "author": "625sunny"
        },
        {
            "level": 0,
            "comment": "I'm not sure about the loft bed idea, but I think you could easily configure your space to have enough room. I was able to have a desk and a small bistro set without feeling too cramped.",
            "score": 1,
            "author": "BobbyPeppermints"
        }
    ]
}