{
    "id": "140qxws",
    "score": 11,
    "title": "Aviation Question",
    "author": "Planes_Airbus",
    "date": 1685913948.0,
    "url": "https://www.reddit.com/r/auburn/comments/140qxws",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am thinking about applying to Auburn. I am interested in becoming a professional airline pilot. I was thinking about getting a degree in Professional flight but, I want a backup in case things don’t go as planned (Aviation Management). Would it make sense to major in Aviation Management with a minor in Professional flight? \n\nThose of you that have experience in the aviation portion of Auburn, I’d love to hear your opinions about the quality of the education etc. I just toured Embry-Riddle Aeronautical University. How do you think they compare?\n\nThanks.",
    "comments": [
        {
            "level": 0,
            "comment": "Major in something that you can fall back on if flying doesn’t work out for you and fly on the side. It will take you more than 4 years at auburn or embry riddle to go from 0 time to 1000 hours and get all those ratings. If you fly on the side with part 61 and you are persistent you can get everything done much faster and spend that leftover time building your 1500 hours as a CFI or whatever you want to do. The flight costs are astronomical ($230ish/hour for the 172s and ~$500/hour for the seminoles) and are not included in the cost of tuition. If money isn’t an issue for you then disregard that statement. The constant terrible weather especially during the spring and summer does not help with progression either. We follow a training course outline to the T. If the weather is bad, you will just have to do it during your next flight block. You practice what auburn wants you to practice and there are no real opportunities to practice things that you personally feel you need to work on. The program is also experiencing growing pains as we have once again admitted more students than the program can handle. Over 700 pro flight students with only 50ish planes. Also a pro flight degree is worthless if you lose your medical or something else happens. Major in engineering or something and go to your local flight school and get your stuff done. \n\n-sincerely someone who started out in pro flight and lost their passion for flying due to auburns ridiculous costs and overbearing procedures. Switched my major and started flying on the side. Having a lot more fun now…",
            "score": 21,
            "author": "anarchosockpuppetism",
            "replies": [
                {
                    "level": 1,
                    "comment": "As someone who did the program and finished through commercial multi, then CFI at box in MGM. \nThis is great if you want a backup plan. The program has some serious growing pains.\nAlso I won’t be offended if you come fly with us at Box Aviation ;)",
                    "score": 4,
                    "author": "OrionX3"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wouldn’t come here, you’re gonna be waiting for a plane. Not worth",
            "score": 6,
            "author": "Impossible_Paint_774"
        },
        {
            "level": 0,
            "comment": "So as I’m nearing the end of the program I can give some good advice here. If you have a lot of money and don’t care about time then this is the place. The planes are top notch and getting from 0 to commercial pilot takes a bit over 4 years. Make sure you understand what that means though. You finish here around 300 hours. Airlines don’t hire before 1000. You have to get your instructor ratings to gain hours the fastest and work as that or go into another field to gain hours as a pilot. If you want cheap and fast look at Montgomery box aviation or Birmingham flight center for the two closest ones. Auburn is the nicest but the slowest and their might be a waitlist to even start the program at the moment. I loved it here but it was the slowest and most tiring program and if you want cheaper and faster than anything else works. There are nice perks and I got a minor in business to even myself out. It’s a hard program and most people drop out at some point. I’d say 65 or 70 percent never make it to instrument rating and switch to a diff degree. Overall it was a choice I wouldn’t change as I’ve gotten good opportunities and loved the planes and some instructors. If you are fully sold just make sure you understand prices. My private cost around 30 I think and instrument was like 20 ish. Add a good 5 or so thousand more as the numbers are bare minimum and you won’t complete in that time. Also if you commit definitely fly summers or expect 5 or 6 years here.",
            "score": 2,
            "author": "Jakeysnake17"
        },
        {
            "level": 0,
            "comment": "Go ME ( Mechanical Engineering), join the Navy, pass boot camp then onto OCS school for your training in such discipline. Can't go wrong. WDE!",
            "score": 6,
            "author": "ZenFreefall-064",
            "replies": [
                {
                    "level": 1,
                    "comment": "Navy has the best aviators in the world AND there is a fantastic NROTC on campus that will offer fat scholarships.",
                    "score": 3,
                    "author": "SkydivingSquid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly, my old man put 22 yrs in the Navy with no regrets. Retired as Commander",
                            "score": 2,
                            "author": "ZenFreefall-064"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "came here to say this. was ChE with a bunch of Navy ROTC guys who now run the nuke ships. with that kind of experience, you'll get hired over the aviation degrees every time. good luck. WDE",
                    "score": 3,
                    "author": "bwcwde"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I did aviation management, major in anything else, I fly but have been curious what I would do should something happen to my medical. \nAny job I’m interested in at airlines is asking for Business admin, management, IT/Comp Sci majors. \n\nSure my aviation background/major might help. \nBut do yourself a favor go Part 61, and major in something outside aviation. \nJust for reference I finished all my flight training in 8 months part 61. \nWas on a 2 month waitlist for PPL at auburn Part 141 before making the switch",
            "score": 1,
            "author": "615Flyer",
            "replies": [
                {
                    "level": 1,
                    "comment": "When were you on a waitlist? I started last semester and didn’t have an issue",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Summer and fall 2018, made the swap to aviation management spring 2019, and started part 61 summer 2019\nGraduated May 2020",
                            "score": 1,
                            "author": "615Flyer"
                        }
                    ]
                }
            ]
        }
    ]
}