{
    "id": "e23kuw",
    "score": 180,
    "title": "anyone think its kind of unsettling how little coverage the dead Taiwanese student is getting compared to Aniah Blanchard?",
    "author": "zirmona",
    "date": 1574798726.0,
    "url": "https://www.reddit.com/r/auburn/comments/e23kuw",
    "media_urls": [],
    "other_urls": [],
    "postText": "Not that it's a competition, I think everyone needs to be hearing about these things, but last I heard of the taiwanese student his body was found in a shed, dead, after being missing since August and nothing else has been released.... very upsetting to hear.",
    "comments": [
        {
            "level": 0,
            "comment": "Not surprising, no. You've got a native-born female that had a lot of local friends and relatively local relatives with a wide social influence and a foreign-born male with no semi-local family that I'm aware of and the foreign Asian communities in Auburn tend to keep to themselves or at least be reserved socially. I do hope more comes out as they investigate his disappearance and death, but I'm also afraid there may be a lack of evidence with Lai Chih-kai, unlike with Aniah. Lai also hadn't really been here long before he disappeared (about 3 weeks), and as far as I'm aware, no arrests have been made.",
            "score": 54,
            "author": "Trogador95",
            "replies": [
                {
                    "level": 1,
                    "comment": "I fully agree. Both are equally sad but I saw an article where they’re assuming “no foul play involved” with Lai and I just don’t buy that.",
                    "score": 25,
                    "author": "jirenlagen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s definitely hard to believe. I’m not sure if i buy it to be honest. On one hand I have no reason to doubt APD or LCSD, on the other hand it’s so hard to believe nobody saw or interacted with him in 3 months without him leaving town.",
                            "score": 11,
                            "author": "Trogador95"
                        },
                        {
                            "level": 2,
                            "comment": "It's worth noting that Taiwan is still pretty much culturally Chinese and they are under a lot more pressure to do well in school with often disastrous results. It very well could have been a mental health issue that was exacerbated from the stress of doing well in school.",
                            "score": 2,
                            "author": "Tigerlittle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I believe that. But the whole him being alive and by himself in a shed for a few months unnoticed is a bit farfetched to me.",
                                    "score": 2,
                                    "author": "jirenlagen",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "From what I understand they believe he wasn't in the shed until his final few days. I think he also looked dirty and a bit skinnier so some think he was maybe in the woods (I know, sounds weird) for a period of time beforehand. I agree the whole thing is weird and spooky, but a coroner report would have been released by now if there were any signs of strangulation, lacerations, blunt force trauma, etc. \n\nIt's a weird situation, I agree, but they have no reason to hide what actually happened.",
                                            "score": 1,
                                            "author": "Tigerlittle"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "To add to it, Aniah appears to have been murdered and the Taiwanese student appears to have died from natural/accidental causes but not foul play. Unless they find evidence of foul play i don't expect much more to be reported",
                    "score": 3,
                    "author": "KaiserSote",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I do find that aspect odd. How did the property owners or tenants or whatever the situation is on that land not know he was there, and how did he evade the public eye for months?",
                            "score": 31,
                            "author": "Trogador95",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dude i work with claims he works another job with the guy whose shed he was found in. Said it was weird cause the guy had never seen him before and he looked like he had been roughing it in the woods or something",
                                    "score": 7,
                                    "author": "L4ZYSMURF",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Had never seen him before he was found I assume?",
                                            "score": 6,
                                            "author": "Trogador95",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah thats what I heard",
                                                    "score": 4,
                                                    "author": "L4ZYSMURF",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Wild",
                                                            "score": 3,
                                                            "author": "Trogador95"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Not sure i haven't seen the property, but depending on what that structure was used for and it's location, it's feasible they didn't know.",
                                    "score": 4,
                                    "author": "KaiserSote",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Feasible but certainly odd.",
                                            "score": 3,
                                            "author": "Trogador95"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So I live with three Taiwanese guys. They knew of the guy that went missing, and one even knew him personally, although not well. They are all saddened and concerned by his death. If you know any Taiwanese students, this is the time to show them a little kindness. It’s too bad that most international students rarely interact with American culture. It would mean a lot to any of them for an American to reach out and show interest in who they are and their culture.",
            "score": 21,
            "author": "jwe1352",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree",
                    "score": 3,
                    "author": "lilsebastian8989"
                }
            ]
        },
        {
            "level": 0,
            "comment": "In many cases like this where very few details are released, it's because the person had mental health issues and details aren't being released out of respect for the families involved. It's fathomable that someone like that might seclude themselves then unintentionally die from exposure/starvation/malnutrition. It happens to the homeless on a regular basis. This is why it's important for our local community to build relationships with the international student community.  You might not be able to imagine all the stresses they are going through, but you sure can cook em' a meal and give them a place to feel at rest. Consider volunteering at one of the many international student outreach programs across our city. There are plenty to chose from.",
            "score": 22,
            "author": "washboard",
            "replies": [
                {
                    "level": 1,
                    "comment": "And people choose to fill in the blanks with dramatic tv flair.  “There must be more to it!”",
                    "score": 5,
                    "author": "mooncricket18"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Male victims have never gotten the same coverage that female victims have. But I agree there's something really fishy about that case.",
            "score": 64,
            "author": "Kaiiu",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 29,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think it's also because there's more likely to be a sexual motive when the victim is female (or that's the perception at least). Sexually motivated crimes make for a more sordid story and are also more likely to be repeated if the offenders aren't caught.\n\nBut I guarantee there's a level of racism/xenophobia going on here. A lot of people in Auburn don't see Chinese students as human, or at least it seems that way from the way people talk.",
                            "score": 3,
                            "author": "ellisno"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was waiting for someone to mention this. It is really weird tbh. The whole story surrounding that kid is suspicious and it feels sweeped under a rug",
            "score": 17,
            "author": "wowwowbear"
        },
        {
            "level": 0,
            "comment": "Come on now.... I hate to be this way but Auburn has always shown a lot more care and attention whenever it's a female student that has something happen to them..\n\nAlso, let's not forget that tensions are still running high from all of the rapes last year and, let's be honest, most of us locals have never really got over Lauren Burke, which crazily enough I think hit the 10-year anniversary this year... even though it feels like yesterday... At least for us local people it feels like deja vu when this case started to unravel.",
            "score": 36,
            "author": "decadin",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a current freshman at Auburn I had never heard of Lauren Burke. \n\nJust read up about her.  That’s awful.",
                    "score": 23,
                    "author": "TRFlippeh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea Laurens case was incredibly sad. Her dad is one hell of a guy... He moved heaven and Earth to find out what happened to his daughter, even buying a home down here so that he could be close by during the entire process...",
                            "score": 7,
                            "author": "decadin"
                        },
                        {
                            "level": 2,
                            "comment": "You’ll get the annual email soon.",
                            "score": 7,
                            "author": "ImYourPizzaGuy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I can’t believe it’s been 10 years. So sad",
                    "score": 4,
                    "author": "muneca82"
                },
                {
                    "level": 1,
                    "comment": "I’ve been here for 5 1/2 years and I don’t know who Lauren Burke is...",
                    "score": 2,
                    "author": "jthunt4",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just the way the university likes it.",
                            "score": 6,
                            "author": "decadin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You also have to take into account that his parents aren't here. Aniah's mom was all over social media from the first day she was missing and the story was being shared through mutual friends. Everybody saw it and heard about it because the parents are in Alabama and they pushed the story through their contacts and connections. It doesn't hurt that her step-father is UFC famous. It made the news as much as it did because people were already talking about it.  \nNow the story is getting more press because it was (probably) a violent crime. A random crime. Three people have been arrested for it. By comparison, the exchange student seems to have died by his own hand or by accident and not at the hands of a random monster. There's no grainy convenience store footage or blood-filled car found abandoned.",
            "score": 16,
            "author": "mandilew"
        },
        {
            "level": 0,
            "comment": "What was his cause of death?",
            "score": 4,
            "author": "Chadster113",
            "replies": [
                {
                    "level": 1,
                    "comment": "They did not suspect foul play",
                    "score": 2,
                    "author": "cbt12345"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When guys disappear and are found dead, there is less news coverage. That really is sad on what happened to him. \nThe news would rather print news stories that will get viewers and people would rather hear about a woman who disappeared and/or found dead. There are many angles to stories like that.",
            "score": 3,
            "author": "mcraft27"
        },
        {
            "level": 0,
            "comment": "Auburn likes to hush up unpleasant situations in general. Nobody heard about the fisheries professor who shot herself this summer, or the grad student who was stabbed at sky bar a few months ago, or even the shooting downtown before the Georgia game. The university likes to depict Auburn as this safe little college town, but plenty of sketchy stuff goes on. Aniah's story blew up primarily because of her parents. I doubt it would have gotten as much attention if they hadn't been all over social media trying to raise awareness that she was missing.",
            "score": 3,
            "author": "sarabee213",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow I had heard nothing about any of those things. :0 but I’m not surprised. So I just looked into those things. And I’m honestly unnerved by the shooting downtown. That is less than a mile from my apartment and I saw no news coverage or alert or anything relating to that previously.",
                    "score": 1,
                    "author": "jirenlagen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have been thinking this for a while now. Really sad",
            "score": 2,
            "author": "Countingfrog"
        },
        {
            "level": 0,
            "comment": "The creepy thing is, the Taiwanese kid was found less than 10 min from my house. And the transgender female to male or male to female that shot that older lady, was like 2 streets behind me.",
            "score": 1,
            "author": "Zachary2005317",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cue country song about small towns",
                    "score": 3,
                    "author": "RhythmofChains"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Simple: it was the Chinese spies that responded after he posted about the Hong Kong protests\n\n.\n\n.\n\n.\n\n.\n\nThis is semi-joking, but it kinda adds up along with the anti-Hong Kong protests posters that popped up in Haley around the same time",
            "score": -10,
            "author": "LoathsomeLuke",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did he actually post about HK?",
                    "score": 3,
                    "author": "ellisno",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah he had an Instagram account where he posted stuff in favor of the protests, which got taken down shortly after he disappeared",
                            "score": 1,
                            "author": "LoathsomeLuke",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Okay, that's pretty sketchy.",
                                    "score": 3,
                                    "author": "ellisno"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}