{
    "id": "ibj1t6",
    "score": 161,
    "title": "It is good to be back!",
    "author": "Thwitch",
    "date": 1597686691.0,
    "url": "https://www.reddit.com/r/auburn/comments/ibj1t6",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Damn... I wish I had this man’s free time.",
            "score": 65,
            "author": "anxietyantelope"
        },
        {
            "level": 0,
            "comment": "Heyyyy I see 2 people wearing a mask. Good for them.",
            "score": 98,
            "author": "JessHas4Dogs"
        },
        {
            "level": 0,
            "comment": "There’s at least a 95% chance this guy grew up with his mom saying if he wouldn’t eat his veggies the devil would come and give him the big gay",
            "score": 58,
            "author": "ogfmc",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can confirm. I hate veggies and have the big gay.",
                    "score": 44,
                    "author": "theyellowhammers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But do you really hate ALL the vegetables?...\n\n*giggles in middle school voice*",
                            "score": 8,
                            "author": "ogfmc"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did he fill out his health survey to get his pass to be on campus?",
            "score": 51,
            "author": "PrincessPenelopeAFK"
        },
        {
            "level": 0,
            "comment": "Anyone else ever want to just ruin their whole gig?\n\nI’m talking full on devil costume with a boombox playing highway to hell. even start playing music backwards and blathering at them in tongue if they get too ornery. \n\nI got so many ideas.",
            "score": 55,
            "author": "LitterTreasure",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’d go with a sign that says “Krusty Krab Unfair” and doing the chant",
                    "score": 27,
                    "author": "LoathsomeLuke"
                },
                {
                    "level": 1,
                    "comment": "alright who has a tuba",
                    "score": 10,
                    "author": "c-nergy"
                },
                {
                    "level": 1,
                    "comment": "I’m down",
                    "score": 7,
                    "author": "KingOfSpaz78"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lmao I drove past him earlier and I was wondering what his sign said. Thanks for posting this",
            "score": 9,
            "author": "elkemosabe",
            "replies": [
                {
                    "level": 1,
                    "comment": "I actually posted this same guy with the same sign in the same spot almost a year ago haha.",
                    "score": 8,
                    "author": "Thwitch"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’s the same dude who said I was going to hell for wearing leggings and a long T-shirt lol.",
            "score": 8,
            "author": "smacky210"
        },
        {
            "level": 0,
            "comment": "Gluttony is a sin too but he doesn't seem to mind",
            "score": 22,
            "author": "Butholxplorer_69_420"
        },
        {
            "level": 0,
            "comment": "*Gives the middle finger*",
            "score": 18,
            "author": "joetheminoin",
            "replies": [
                {
                    "level": 1,
                    "comment": "better not to bother.  just reinforces their actions in their minds.  \n\neta:  best to just ignore them completely.  that infuriates people like this more than anything else.",
                    "score": 23,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is that \"Brother Micah?\"  I remember people screaming at him, which is what he wanted....some things never change.",
            "score": 6,
            "author": "noblehousemartin",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; A local boy kicked me in the butt last week, I just smiled at him and I turned the other cheek. I really don't care, in fact I wish him well. Cause I'll be laughing my head off when he's burning in Hell\n\nHoly shit imagine blasting Amish paradise at those cats.",
                    "score": 6,
                    "author": "LitterTreasure"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i see these guys on gameday sometimes.  i wonder what \"church\" they are from.",
            "score": 7,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "you love to see it",
            "score": 7,
            "author": "youngnasty14"
        },
        {
            "level": 0,
            "comment": "When I was at Auburn that guy’s name was Brother Jed. What’s his name now?",
            "score": 5,
            "author": "texistiger"
        },
        {
            "level": 0,
            "comment": "At least judgment is spelled correctly.",
            "score": 5,
            "author": "GeldolphZeldolph"
        },
        {
            "level": 0,
            "comment": "I judge this imbecile for not wearing a mask lol",
            "score": 2,
            "author": "jirenlagen"
        },
        {
            "level": 0,
            "comment": "Is that a GoPro below his sign? I wonder what his YouTube channel is called.",
            "score": 2,
            "author": "YYKES"
        },
        {
            "level": 0,
            "comment": "Which side of campus is this on? I would love to run him over with my car 💞✨🧚🏻‍♂️",
            "score": 3,
            "author": "Jakobie97"
        },
        {
            "level": 0,
            "comment": "Ah I remember this guy. Last year me and a buddy were walking by and these two guys started making out in front of him (I’m assuming in protest or something) and he straight up left. No yelling, no gay slurs, he just left. Needless to say I didn’t see him the rest of the year. But looks like cockroaches don’t die that easy lol",
            "score": 4,
            "author": "Cdizzle2001"
        },
        {
            "level": 0,
            "comment": "Why do y’all dislike these guys?",
            "score": -11,
            "author": "agjrsbko",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m very religious, but I believe religion is a private/personal matter. It’s fine to wear a shirt proclaiming your faith, pray, or elaborate if someone asks but I don’t think someone who clearly isn’t in college should be holding a giant sign like this and screaming hellfire and brimstone at students trying to get to class.\n\nIt actually accomplishes the opposite of what I would think a religious person would want to accomplish. Making it all scary and negative and fear based like that.",
                    "score": 6,
                    "author": "jirenlagen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree that’s definitely not the way I’d go about it either but it’s with good intentions the way I see it.",
                            "score": -2,
                            "author": "agjrsbko"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As long as you're not hurting anyone, you go live your life like you want, and I'll do the same with mine.  i won't judge you if you won't judge me.  I think this guy thinks differently and wants to \"save our souls\".  No thanks.  I'm fine.",
                    "score": 4,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s also the screaming at people but that isn’t ok",
                            "score": 2,
                            "author": "jirenlagen"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah I’d agree with you on letting everyone live their lives how they want, he’s not doing anything that violates that. But there’s not one person on this planet who doesn’t judge. It’s human nature. If he wants to walk around with signs and talk to people let him live his life as he chooses, don’t judge or hate him for it?",
                            "score": -8,
                            "author": "agjrsbko",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Pretty obvious he's a troll.  I follow the rule \"don't feel the trolls\".  It just encourages them.   \n\nI don't know him.  I don't hate him.  Whatever opinion I have of him I keep to myself (other than in this thread obviously).  I pass no judgement on him in public.  He's not hurting anyone, so fine, let him carry his sign.  \n\nBut yeah, he's a troll.  What a waste of a life.  Very sad.",
                                    "score": 5,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "Harassing people is generally frowned upon",
                                    "score": 5,
                                    "author": "sponge_welder"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -18,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thats a bold claim. Can you back it up?",
                    "score": 30,
                    "author": "IanCarpenter66",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I highly highly doubt he can",
                            "score": 10,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yall hate these guys yet you leftist reddit Libtards support the people that stand at Toomers with signs backing an organization that wants to destroy the western nuclear family 🐸☕️",
            "score": -8,
            "author": "lewy669"
        }
    ]
}