{
    "id": "xfbtsh",
    "score": 31,
    "title": "My dad retired from Auburn University a few years ago. He had a pretty demanding job and after a couple years of retirement, I get the feeling that he’s bored and needs a source of responsibility. If anyone knows of any volunteer work or a part time job, please leave a suggestion. Thanks",
    "author": "Au-Confidential",
    "date": 1663286022.0,
    "url": "https://www.reddit.com/r/auburn/comments/xfbtsh",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "The Southeastern Raptor Center is always looking for volunteers!",
            "score": 19,
            "author": "Nightsky07",
            "replies": [
                {
                    "level": 1,
                    "comment": "He doesn’t know that I’ve put this post up but, that’s a really good idea. However, he’s a retired professor of veterinary medicine. So, I just don’t think he’d be in to that but thank you for that suggestion. I probably should’ve put what his former occupation was. That’s my bad.",
                    "score": 9,
                    "author": "Au-Confidential",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hahaha. Too true!",
                            "score": 2,
                            "author": "Nightsky07"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What about volunteer work at Lee county humane society? They love when people can just walk the dogs!",
            "score": 11,
            "author": "_boomroasted_"
        },
        {
            "level": 0,
            "comment": "Exceptional Foundation of East Alabama loves them some volunteers, advocacy and community training!",
            "score": 8,
            "author": "LitterTreasure",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh really, What exactly is that?",
                    "score": 3,
                    "author": "Au-Confidential",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A year round non-profit organization that provides opportunities and engagement for people with intellectual and developmental disabilities! They’re always looking for people with different ways to engage, different stories to bring and always more friendship.",
                            "score": 8,
                            "author": "LitterTreasure",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That is an awesome suggestion. Thank you so much. Honestly, that sounds like something I might like to do also. Im putting this on my list.",
                                    "score": 11,
                                    "author": "Au-Confidential",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s a lovely place everyone on the plains should get to know!\n\n*Where are my manners. No, thank you! Please consider it. It’s always a wonderful experience, so many amazing people in that building. If you’re located outside of auburn, there are many chapters. Just call and set up a time.",
                                            "score": 2,
                                            "author": "LitterTreasure",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ok. Sounds good thanks again.",
                                                    "score": 1,
                                                    "author": "Au-Confidential"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Came here to say this! Phenomenal organization!",
                    "score": 3,
                    "author": "Useful_Wishbone9317"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is he still in Auburn?  The Lee County Humane Society, the Food Pantry at AUMC, the Food Bank are always looking for volunteers, or something outside the box would be either [The Village Friends](https://cws.auburn.edu/auburnserves/Partner/Details/331) or [OLLI](https://auburn.edu/outreach/olliatauburn/)?",
            "score": 7,
            "author": "junknowho",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok. That sounds good. Thanks for the suggestion.",
                    "score": 3,
                    "author": "Au-Confidential"
                },
                {
                    "level": 1,
                    "comment": "Missed your recommendation of OLLI, and second that.",
                    "score": 2,
                    "author": "3furryboys"
                }
            ]
        },
        {
            "level": 0,
            "comment": "War eagle productions is the athletic live video broadcast dept on campus \nMostly hiring students but they’ve had older people work for us before and an ex professor would easily get on and could get a spot on an event that fit their interest",
            "score": 3,
            "author": "F4allingthrutime20",
            "replies": [
                {
                    "level": 1,
                    "comment": "Really, that sounds awesome. That also sounds like something Id like to look into as far as employment.",
                    "score": 1,
                    "author": "Au-Confidential"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Come out to O grows in Opelika! We are a community food project with a community garden that always could use more hands. Plus we have goats!",
            "score": 3,
            "author": "pressthabuttonz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay. That’s definitely a good suggestion. I’m going to run past him. Thank you so much.",
                    "score": 1,
                    "author": "Au-Confidential",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're welcome! Our main programing is Saturday mornings from 9 to 12. Hope to see y'all out there sometime!",
                            "score": 2,
                            "author": "pressthabuttonz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Absolutely.",
                                    "score": 1,
                                    "author": "Au-Confidential"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Two years after you retire from AU you can return as TES. If you're not just done with the university altogether after retirement, there's an opportunity to come back and do something else.",
            "score": 3,
            "author": "NotFranzKafka",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh really, so he could come back and work at the university in a different capacity? Okay, that's something I'll definitely look into. Thanks",
                    "score": 2,
                    "author": "Au-Confidential",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, but if you work too many hours that reduces your retirement benefit. That goes for anywhere, not just AU. TES jobs are mostly administrative assistants or similar work, but not exclusively.\n\nHe could probably even teach a class. I don't know how that works, but I expect he probably already does and would have done it if he wanted to.",
                            "score": 2,
                            "author": "NotFranzKafka",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah. It’s interesting you say that. He has had to be careful about his income in the past, because RSA will come down on you. Lol",
                                    "score": 1,
                                    "author": "Au-Confidential"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There may be a head football coaching job coming available soon on campus if he's interested.",
            "score": 3,
            "author": "JibJabJake",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ahahahaha!!! That’s hilarious and also a very true statement. It may become open Sunday. Lol.",
                    "score": 1,
                    "author": "Au-Confidential",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wish I had put money on that.",
                            "score": 2,
                            "author": "JibJabJake",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh ikr. Geeze what an embarrassment. I don’t think I can remember a game we’re we’ve gotten handled like that. I bet he doesn’t make it to the bye week.",
                                    "score": 1,
                                    "author": "Au-Confidential"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "He could drive for Tiger Transit part time. It would get him back on campus and around the students again.",
            "score": 2,
            "author": "theloosestool",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes. Thanks for the suggestion. I’m putting it on my list.",
                    "score": 1,
                    "author": "Au-Confidential"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had a supervisor at work retire in the last couple years. He went and picked up a part time job at Lowe's",
            "score": 2,
            "author": "tcarp458",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes. I could definitely see him doing that.",
                    "score": 1,
                    "author": "Au-Confidential"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Because no one else has mentioned it, the East Alabama Food Bank is a great place to go volunteer",
            "score": 2,
            "author": "wareagle8608",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, that’s definitely a good suggestion. I’ll be running that past him. Thanks",
                    "score": 2,
                    "author": "Au-Confidential"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nature preserve is always looking for folks",
            "score": 2,
            "author": "Zarnong"
        },
        {
            "level": 0,
            "comment": "EAMC always needs volunteers and so does Bethany House/Hospice",
            "score": 2,
            "author": "justicebeaverhausen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much. I’m definitely going to run this by him and look into it.",
                    "score": 1,
                    "author": "Au-Confidential",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Best of luck to him",
                            "score": 1,
                            "author": "justicebeaverhausen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes. Thank you for your help.",
                                    "score": 1,
                                    "author": "Au-Confidential",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You're welcome!",
                                            "score": 2,
                                            "author": "justicebeaverhausen"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe less productive but what really helped my parents relax was introducing then to some boardgames, hobby, and Kyuudo.",
            "score": 2,
            "author": "Praisethesunbrah"
        },
        {
            "level": 0,
            "comment": "u/Au-Confidential.   I found a volunteer opportunity for your Dad.  It does involve animals, I'll put this up front, but he might enjoy the work?  I have a friend running a non-profit animal rescue outside of Dadeville.  It's called Seven13 Farm and Sanctuary, and they rescue critters of all kids, not just dogs and cats.   The volunteer services run the gamut from assisting with animal care to fence repair, and anything in between.\n\nHer FB is [Seven13 Farm](https://www.facebook.com/seventhirteenfarm) and [this is the email](mailto:seven13farm@gmail.com).   \n\nAnyone reading this, that might be interested, please consider volunteering.  Thanks y'all!",
            "score": 2,
            "author": "junknowho",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much. I’ll see if he’s interested.",
                    "score": 2,
                    "author": "Au-Confidential"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This isn't volunteer, but have him check in to the Osher Life Long Learning Institute (OLLI). They have excellent programming. \n\n[https://auburn.edu/outreach/olliatauburn/](https://auburn.edu/outreach/olliatauburn/)",
            "score": 2,
            "author": "3furryboys",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the suggestion. I’m going to check this out and ask him if he’s interested.",
                    "score": 2,
                    "author": "Au-Confidential"
                }
            ]
        }
    ]
}