{
    "id": "xhh3i5",
    "score": 58,
    "title": "Windows are covered up but Publix looks like it’s coming along. Too much parking but nice to have grocery’s downtown.",
    "author": "bachelorburner987",
    "date": 1663508775.0,
    "url": "https://www.reddit.com/r/auburn/comments/xhh3i5",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Y’all are acting like the parking lot wasn’t already there, it was a Burger King for crying out loud, it’s not even that big\n\nThis sub swings from “not enough parking” to “why are we building parking lots and decks” quicker than a 180 bpm metronome",
            "score": 85,
            "author": "69_ModsGay_69",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly!",
                    "score": 7,
                    "author": "junknowho"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Since when are we gonna complain about having too much parking downtown??",
            "score": 66,
            "author": "pileoflogs",
            "replies": [
                {
                    "level": 1,
                    "comment": "With the amount of foot traffic and the ungodly congestion that happens downtown I’m surprised parking exists there",
                    "score": 3,
                    "author": "ttehrman519"
                },
                {
                    "level": 1,
                    "comment": "Cars should be banned",
                    "score": -39,
                    "author": "bachelorburner987",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My guy this a college town, just be happy that Thatch and Haley aren’t actual streets anymore",
                            "score": 44,
                            "author": "69_ModsGay_69"
                        },
                        {
                            "level": 2,
                            "comment": "idk why youre getting downvoted im with you lol. americans forget we dont Need cars everywhere.",
                            "score": -24,
                            "author": "harlequinbazaar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hard agree. Lots of places are car centric but Auburn doesn't need to be one of them\n\nGive me the downdoots, haters. Parking should be either built on or it should be expensive as shit. Nobody wants to go to college in a parking lot. Get out of the Birmingham over the mountain mentality and treat Auburn like a real town.",
                                    "score": 3,
                                    "author": "dancingshibe"
                                },
                                {
                                    "level": 3,
                                    "comment": "Brainless take",
                                    "score": 2,
                                    "author": "YellowStopSign"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "“Too much parking” -nobody in auburn ever",
            "score": 63,
            "author": "YYKES",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ban cars, add street cars.",
                    "score": -26,
                    "author": "bachelorburner987",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hey buddy Auburn is not a metropolitan area that can support public transit like that.",
                            "score": 9,
                            "author": "Zudop",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "To his point Auburn already has the largest public transit system in Alabama, but yeah the rest of what he’s spewing doesn’t really work for a town of this size and seasonality",
                                    "score": 8,
                                    "author": "69_ModsGay_69",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah those are buses dude I can’t exactly use those to get to the grocery store and back easily after class or something",
                                            "score": 2,
                                            "author": "Zudop",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Where did I say that lmao, don’t be so hostile I literally gave him ONE piece of credibility \n\nTo be frank if you live so far off campus to need to complain about the parking rhetoric, you probably won’t be shopping at this location in the first place. It’s really meant to target people who live on / by campus like the new target, which are absolutely in walking or bus system distance. The reality of why this Publix has a parking lot is that, if it didn’t have one, people would park at the North College parking deck and just go to Target instead, because it’s right next door.",
                                                    "score": 2,
                                                    "author": "69_ModsGay_69",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Finally a person who gets it. If you're poor, just fucking drive to Walmart and stay out of our downtown!!",
                                                            "score": 1,
                                                            "author": "Butholxplorer_69_420",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That’s exactly what I said thank you for putting so eloquently for the uneducated poors",
                                                                    "score": 2,
                                                                    "author": "69_ModsGay_69"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Technically you can- i took a tiger transit to Walmart my freshman year",
                                                    "score": 1,
                                                    "author": "Prime89"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It’s heading that direction.",
                                    "score": 1,
                                    "author": "bachelorburner987"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "No one likes bike leftists",
                            "score": -6,
                            "author": "Mitchford"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Almost across the street is a large parking lot that is part of AUMC and a building that is also part of the church. Once upon a time that building was Super Foods Grocery Store and the parking lot was part of Super Foods.    IMHO it's about damned time there is a grocery store with plenty of parking in downtown again, and it was smart to put it on Gay Street too.",
            "score": 9,
            "author": "junknowho",
            "replies": [
                {
                    "level": 1,
                    "comment": "I bet you sit in your car and let the engine idle on purpose",
                    "score": -8,
                    "author": "Butholxplorer_69_420",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Point being?",
                            "score": 3,
                            "author": "junknowho",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That you're stoopid",
                                    "score": -4,
                                    "author": "Butholxplorer_69_420",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well, my degree would say otherwise, but okay.",
                                            "score": 8,
                                            "author": "junknowho",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What's your degree In? A doctorate of Stoopid and a minor in silliness?",
                                                    "score": -4,
                                                    "author": "Butholxplorer_69_420",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "LOL",
                                                            "score": 1,
                                                            "author": "junknowho"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Elm court dt is like $550- it’s not expensive to live DT. I live there and still drive everywhere lol",
                                            "score": 1,
                                            "author": "Prime89",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's just your opinion",
                                                    "score": 0,
                                                    "author": "Butholxplorer_69_420",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Opinion ≠ an objective fact. Objective fact is compared to appts in Auburn 550 is cheap. You a clown lmao",
                                                            "score": 3,
                                                            "author": "Prime89",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Ok well maybe be more specific as to what you're comparing to in the future. Average monthly salary in Venezuela is only $100 so $550 would be exorbitant there. Sheesh it's like you just can't be specific, you're a little scatterbrained I see",
                                                                    "score": -4,
                                                                    "author": "Butholxplorer_69_420"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "“I’ve only ever lived in a metropolitan area and have zero experience in a place like Alabama where cars and trucks are used everyday for all types of commerce and transportation. I’m sure when they build other buildings in the area they’ll just walk all the materials there by hand! We don’t need cars! Just take a bus that doesn’t exist to the Briggs and Stratton plant you work at! Or ride a bike!.” -OP probably",
            "score": 18,
            "author": "Seacow1109",
            "replies": [
                {
                    "level": 1,
                    "comment": "OP doesn’t understand or give a shit about the people that actually live, work, and pay taxes here. Everyone should just live downtown, amirite?! Ignore that there are at least 6 churches that many locals attend within a block of each of their precious “city amenities”. Ignore that all of those businesses you love to drink at have employees that can no longer afford to live in Auburn proper and have to DRIVE from places like Opelika, Notasulga, and Tuskegee. Also completely ignoring the fact that the construction of West &amp; Wright (Evolve), Uncommon, The Standard, 191 College, 320 West Mag, and Oliv fucked up traffic in two-lane streets by adding parking decks that filter into those small streets at all times of day is far worse for congestion than the minute traffic of a (comparatively small) grocery store parking lot is so asinine that it’s hilarious. Traffic was rough on game days and A-day before those complexes came to town, and we act like it was always bad, but it was NEVER the level that it now is almost 24/7 on Glenn/College, on Magnolia in front of Shelby, or on any of the cross streets north of campus. You’d have to circle the block looking for parking downtown most days outside of the summer, but you were never in a lot of gridlock outside of maybe a busy Friday/Saturday night - now you’re waiting 2 or 3 light cycles to go fucking straight through an intersection and it’s just getting worse.",
                    "score": 2,
                    "author": "TalkDMytome"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The issue shouldn't be whether you walk or drive to Publix, it should be what you plan to buy at Publix.\n\nI encourage everyone to list one item and one beverage that they specifically look forward to purchasing from this Publix. I will go first:\n\nI will buy table salt and a bottle of water",
            "score": 6,
            "author": "Butholxplorer_69_420",
            "replies": [
                {
                    "level": 1,
                    "comment": "Publix subs are the best!",
                    "score": 3,
                    "author": "APSnooTiger",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Most things from the Publix Deli are great.",
                            "score": 2,
                            "author": "Jonesta29",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They have sesame bagels in the bakery.",
                                    "score": 1,
                                    "author": "rimjobnemesis"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's actually crazy that the city would let them come into a downtown with huge surface level parking lots like that. Publix has experience making more \"urban\" styled stores, just look at the one in downtown Huntsville for example",
            "score": 17,
            "author": "epiccooldude69",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed. If they had no parking, people would adapt.",
                    "score": -31,
                    "author": "bachelorburner987",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don’t tell this guy about game day.",
                            "score": 10,
                            "author": "DoobieDonuts"
                        },
                        {
                            "level": 2,
                            "comment": "How do you expect the workers that don’t fuckin live downtown to get to work? I agree cars aren’t the greatest solution to the transportation problem, but at least in America and especially outside of major metropolitan areas, cars are a necessary evil and you’re delusional if you think this store would stay in business with no parking.",
                            "score": 18,
                            "author": "Red-Quill",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "they would adapt. take the bus, get dropped off nearby, shit, park at the nearest parking garage less than 5 minutes away even &amp; walk for 2 minutes. like what💀 downtown is a super condensed space, people with no cars do it all the time. people just think anything that takes more than 5 minutes of walking/preplanning is impossible, which is why car culture is so rampant\nedit: it would be different if we were talking about an actual rural non-metropolitan area but my guy this is downtown",
                                    "score": -19,
                                    "author": "harlequinbazaar",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Do you understand literally a single word I said, because you must not be replying to me. I literally said “… that don’t live downtown.” Downtown is a 10-15 minute **drive** for most of the people that live in Auburn but not near downtown. That means it’d be *at least* a 30 minute walk. And I know you didn’t just mention the buses like those are even remotely reliable or timely or accessible or convenient enough to use as transportation to a job that requires consistent punctuality.\n\nI know you’ve got a really convenient high horse to ride around all day, but unfortunately the rest of us don’t and while I do agree with you that car culture sucks and isn’t exactly environmentally sustainable, but fuck off with the “parking lots are why car culture is so rampant” bullshit.\n\nUnless the employees live downtown, walking is not viable, especially considering the state of the sidewalks in Auburn. If you live downtown and can walk there, great. Not everyone can afford that privilege.\n\nParking lots aren’t the problem, they’re a symptom of the real problem: woefully inadequate public transportation and horribly car-centric city planning. Stop blaming the people that are suffering from the poor planning and start blaming the poor planners. You’re being a little tone deaf right now babe.",
                                            "score": 13,
                                            "author": "Red-Quill",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "i wrote, 'they can park nearby and walk.' not a 30 minute walk, although to be honest, ive walked much longer, millions of people do every day to commute to work, when i lived overseas i walked 45 minutes just to the train station (with unreliable trains) to walk another 15 minutes to my workplace, in a country where punctuality was everything, &amp; this was the norm for everybody there. like if im on my high horse its because i know this shit is possible. my point is theres plenty of parking around. should there be spaces for disability accommodations, yes, i think that's a given, but for the rest, come on. i can't tell if you're for or against car-centric planning the way you're rooting so hard for this example.",
                                                    "score": -7,
                                                    "author": "harlequinbazaar",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Okay I guess I’m gonna have to break it down into bite sized pieces for you to understand.\n\n&gt; they can park nearby and walk\n\n\nLiterally solves absolutely nothing, cars are still being used and the problems of car emissions and inconvenient planning still exist.\n\n&gt; ive walked much longer […] when i lived overseas i […]\n\n\nIrrelevant. I and most other people aren’t going to walk an half an hour or more to work or to get groceries barring absolute necessity. Why? It’s a pain in the ass and not feasible if you’re planning on getting enough groceries to last even a week.\n\n&gt; in a country where punctuality was everything\n\n\nSo, just like this one?\n\n\n&gt; this was the norm for everybody there\n\n\nWhere are we, here or there? Because that’s not the norm *here*.\n\n\n&gt; if im on my high horse its because i know this shit is possible\n\n\nYup. Possible, not but not currently feasible. It’s *possible* for me to walk all the way from here to Canada, but you sure as hell won’t catch me doing it before Satan’s able to make snow angels. That doesn’t excuse the insufferable holier-than-thou attitude you’ve got for people that don’t want to be pedestrians in an anti-pedestrian country.\n\n\n&gt; should there be spaces for disability accommodations, yes, […] but for the rest, come on\n\n\nSo you don’t care about the employees that don’t live within 15 minutes of walking from the store? Are you aware that most people won’t walk more than 15 minutes to a certain point? That’s ~0.8 miles for the able bodied. I live in Auburn, but 3 miles from downtown. That’d be a **1 hour walk**. Rain? 95° weather? Traffic that wants to kill me? All for an hour? HA yea okay buddy, I’ll drive 10 minutes, but thanks.\n\n&gt; i can’t tell if you’re for or against car-centric planning\n\nWell, conveniently, I said in my first reply to you: “I agree cars aren’t the greatest solution.” In my second reply to you, I said: “while I do agree with you that car culture sucks.” And here, I’ll say it one more time: I hate car centric city planning and **all** of the problems that it entails. Hopefully we’re on the same page now.\n\nBut finally: Auburn public transport is ASS dude, I wouldn’t trust it to get me anywhere on time even under the utmost perfect circumstances. You suggest people should be dropped off or park nearby, but *what problem does this solve*? Definitely not the car one. And no one except the people that live in the apartments smack dab in the middle of downtown are going to walk to that Publix, sorry.\n\nSo why are you so against the parking lot? You don’t seem to care about the cars since you offered solutions that *require* just as many cars and emissions, but you do seem to hate the parking lot. Is it an eyesore thing for you? Because it’s really just starting to sound like “I don’t want to look at an ugly parking lot,” which is a bit insensitive to the people that can’t afford to live close enough to walk everywhere downtown.",
                                                            "score": 2,
                                                            "author": "Red-Quill",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "see u in traffic babe x\nthe way americans will do everything but walk is so funny to me",
                                                                    "score": -1,
                                                                    "author": "harlequinbazaar",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Lmfao did you read the part where I said I live an HOUR’S walk from downtown? Sorry but I have other shit to do with my day than spend 2 fucking hours walking somewhere.",
                                                                            "score": 1,
                                                                            "author": "Red-Quill",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "so park at the parking garage like i said. youve fundamentally misunderstood me",
                                                                                    "score": 1,
                                                                                    "author": "harlequinbazaar",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "How are you such a sheep?",
                                                                    "score": -1,
                                                                    "author": "CoconutPie9",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Baaaaaa lmfao make an argument or fuck off",
                                                                            "score": 1,
                                                                            "author": "Red-Quill",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I don’t subscribe to pointless arguments. Everyone already knows you’re wrong",
                                                                                    "score": 0,
                                                                                    "author": "CoconutPie9",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "You're both wrong",
                                                            "score": 0,
                                                            "author": "Butholxplorer_69_420"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You're both wrong",
                                                    "score": -1,
                                                    "author": "Butholxplorer_69_420",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Got a specific point you’d like to argue or are you just here to be contrarian?",
                                                            "score": 1,
                                                            "author": "Red-Quill",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah the point is that you're missing the big picture and your obliviousness is cringe",
                                                                    "score": -2,
                                                                    "author": "Butholxplorer_69_420",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The big picture? Go on then, I’m waiting.",
                                                                            "score": 1,
                                                                            "author": "Red-Quill",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "The mayor knew letting this in would set commuters against non-commuters. You're not even remotely prepared for the firestorm that has been building on the periphery. It involves the city council, the zoning committee, Publix CFO, the circle K manager, and special interest groups out of Thailand. In the meantime, pea brain Auburnites have been ignoring the clues because \"FoOtBaLl\" started back up and they're too busy cumming while watching grown men fondle each other and throw a ball",
                                                                                    "score": -4,
                                                                                    "author": "Butholxplorer_69_420",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You sound exactly like a privileged, ignorant college student.",
                            "score": 12,
                            "author": "Jeriahswillgdp",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wrong. If you don't live downtown you can drive to Walmart, Kroger, Publix, or target. If you live downtown you can walk to Publix. Easy pz",
                                    "score": -5,
                                    "author": "Butholxplorer_69_420"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't think the problem is too much parking as much as it is \"target and Publix are going to pack hundreds more cars a day into an area that already has a massive traffic congestion problem\"",
            "score": 2,
            "author": "TheGreatWeagler"
        },
        {
            "level": 0,
            "comment": "I’ll say this, to families in auburn, how would they transport a couple weeks of groceries. Saying ban cars or get rid of parking for families who can’t walk 20 bags of groceries is just unrealistic. You can’t really adapt to just not having necessities. Busses and bikes aren’t as reliable for one, and not real sources of grocery transportation. I for one am happy we have something right near most of the students, and young families who can drive or walk a few minutes to get things.",
            "score": 0,
            "author": "zacharypolk19",
            "replies": [
                {
                    "level": 1,
                    "comment": "Drive to the Walmart or Kroger like they already do",
                    "score": 2,
                    "author": "bachelorburner987"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lots of arguing here but I'm just going to say that everyone on both sides is saying what they're saying because they love Auburn. I agree with the OP even if most don't but I'm against big parking lots because I want Auburn to be livable and enjoyable. Think about the opportunity cost of the space. But people on the other side are not evil or backwards.\n\nConsider Tuscaloosa- it's impossible to get around without a car. We're clearly a better town in part because of that. I just want us as a town to capitalize on what we do have and not sell it out to dumb ass chains or turn us into East Cobb or Hoover.",
            "score": 1,
            "author": "dancingshibe"
        }
    ]
}