{
    "id": "xhy6kp",
    "score": 2,
    "title": "Which university should I attend for a business major Auburn University or The University of Alabama Tuscaloosa?",
    "author": "Intern_Miserable",
    "date": 1663551130.0,
    "url": "https://www.reddit.com/r/auburn/comments/xhy6kp",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "for business it's about the same tbh, both business schools have pros and cons and you should just look at which school has the culture you're more interested in",
            "score": 9,
            "author": "Beginning_Ad5785"
        },
        {
            "level": 0,
            "comment": "Auburn’s professional development is miles above UA’s iirc",
            "score": 4,
            "author": "lactosandtolerance"
        },
        {
            "level": 0,
            "comment": "Business degrees don’t really matter.  It’s generic, look for the school that places them into jobs better.\n\nAs compared to a hard science, where the schools track record and professors do matter.",
            "score": 1,
            "author": "steakfarts",
            "replies": [
                {
                    "level": 1,
                    "comment": "Schools definitely matter for a business school. Auburn has a much better program and has more national recognition for academics than Bama",
                    "score": 5,
                    "author": "Crowzen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Greek life and football are huge at both places, so I won’t comment on those except to say WDE.\n\nAuburn as a university is huge about supporting their students in and out of the classroom, and after graduation. We also have a reputation for creating highly qualified graduates, no matter what they major in. If you’re looking for a good school with a strong community that you can find a few good friends to study with, the Auburn Family is very real and you will not regret the decision to come here. Our campus also tends to be much cleaner and has a much more “homey”/ small town feel.",
            "score": 1,
            "author": "holly_fly",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think Greek Life and football are more important in Tuscaloosa than Auburn, although yes they are big here too. Everything you said is spot on.",
                    "score": 3,
                    "author": "junknowho"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Alabama graduates make more money on average",
            "score": 1,
            "author": "I_am_in_Med_School"
        }
    ]
}