{
    "id": "xtdizk",
    "score": 17,
    "title": "What a terrible loss",
    "author": "Striptastik08",
    "date": 1664679004.0,
    "url": "https://www.reddit.com/r/auburn/comments/xtdizk",
    "media_urls": [],
    "other_urls": [],
    "postText": "I feel bad for this team. They were doing so well for the first half. It was an amazing half of football then it just stopped. \n\nWhy won’t Hardin take points instead of going for 4 &amp; 11? Why does he keep Carlson in when we have a freshman that kicked 60 yarders last year at his high school. Why can’t they keep any consistency throughout a game? Why does Harsin go for it on 4 &amp; 11?  Why is the answer for that always a long toss up play that almost never works out.\n\nWe hit a wall every game and then nothing. I love this team but it’s hard to watch the same things happening week in and week out. I’m all up for trusting Harsin but we go backwards after a specific point and you can tell when it happens. If we get rid of Harsin, let’s call into question the Board of Directions being a major player in every little thing while we’re at it. Why the hell not? \n\nHarsin, it’s been a fun time and I have been loyal to you throughout the last two years. This is a game we should have won and it’s getting hard to back you if this is what’s being consistently produced. You’ve got to show more emotion going forth. Covering your eyes and bending over so you can’t see isn’t cutting it. Get onto someone, get in their face when they make a dumb decision that affects the entire team. Do it. Just once. You won’t get fired over that.",
    "comments": [
        {
            "level": 0,
            "comment": "When every shot of him in the second half of every game shows him just blankly staring at the field and rubbing his temples it really looks like he wants to be somewhere else.",
            "score": 14,
            "author": "bluecheetos"
        },
        {
            "level": 0,
            "comment": "BECAUSE HARSIN THINKS HE IS IN THE MOUNTAIN WEST CONFERENCE FIRE HIM LETS MOVE ON!!",
            "score": 9,
            "author": "69fukone69",
            "replies": [
                {
                    "level": 1,
                    "comment": "#Harsinmustgo",
                    "score": 4,
                    "author": "theratking007"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m an Auburn fan as well. They fucking suck.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I feel bad for the people paying their hard earned money to support the team just for these fb players and coaches to not get it together! I mean they have all the resources🤦🏽‍♂️",
            "score": 1,
            "author": "ReasonableDesk6888"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -22,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Grown ass men crying lmao",
                    "score": -10,
                    "author": "AlabamaStyle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's so funny to see. There's only two things that make me cry:\n\n1. really really spicy peppers with no milk\n2. Exceptionally powerful church sermons",
                            "score": -13,
                            "author": "I_am_in_Med_School",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Go watch Brian’s Song and try not to when he says “I love Brian Piccolo”",
                                    "score": 0,
                                    "author": "LitterTreasure"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}