{
    "id": "yrk3xl",
    "score": 39,
    "title": "What the heck happened with that email thread this morning?",
    "author": "Et12355",
    "date": 1668097655.0,
    "url": "https://www.reddit.com/r/auburn/comments/yrk3xl",
    "media_urls": [],
    "other_urls": [],
    "postText": "Chase Gay is a legend",
    "comments": [
        {
            "level": 0,
            "comment": "emailtoprint@auburn.edu was one of the best features when I was a student. It was so cool to be able to print anything when I needed it",
            "score": 25,
            "author": "memerfrancisco",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They got rid of the tigermail part of the email in 2020 or 2019. \n\nThere are dedicated commercial-grade printers scattered around campus in common areas. You email emailtoprint your document and then swipe your tiger card at one of the printers and it charges a cent or so per page and prints it out. There’s always a printer nearby",
                            "score": 3,
                            "author": "memerfrancisco"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Context?",
            "score": 18,
            "author": "WittyEagle74",
            "replies": [
                {
                    "level": 1,
                    "comment": "Chase Gay sent his chemistry study guide to emailprint@auburn.edu instead of emailtoprint@auburn.edu and somehow it got sent to tons of students. Who all proceeded to reply all telling him he messed up. Chaos ensued for about five minutes and everyone’s phone buzzed nonstop with emails.",
                    "score": 48,
                    "author": "Et12355",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's wild, I know him",
                            "score": 18,
                            "author": "WittyEagle74"
                        },
                        {
                            "level": 2,
                            "comment": "Like ten years ago there was a reply-all storm on one of those AU Recycles emails offering game tickets to volunteers that blew up for like two hours. Just hundreds of emails. They still send those emails out today with a note asking people not to reply, so I don't know that they ever fixed the mailing list.",
                            "score": 11,
                            "author": "NotFranzKafka"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got the email too 🤣",
            "score": 6,
            "author": "Confident_Donut_2281"
        },
        {
            "level": 0,
            "comment": "Anyone have a screen shot? Just curious…",
            "score": 4,
            "author": "Kolpasterop"
        }
    ]
}