{
    "id": "yup85f",
    "score": 20,
    "title": "Lane Train Baby",
    "author": "ConnorTeems",
    "date": 1668401444.0,
    "url": "https://www.reddit.com/r/auburn/comments/yup85f",
    "media_urls": [],
    "other_urls": [],
    "postText": "Looks like we might have a new head coach...",
    "comments": [
        {
            "level": 0,
            "comment": "Or Lane is getting a raise.  Remember, his agent is Jimmy Sexton who leaks this kinda stuff to generate leverage for a raise.  Only thing we know until there is an official announcement is Lane will make more money next year.",
            "score": 24,
            "author": "WDEBarefooter",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think one benefit is Ole Piss is gonna have to fork out some heavy cash as they only have 4 year contracts at a max.",
                    "score": 1,
                    "author": "T1G3R02"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nahhhh bro. Auburn twitter is just looking for something else to be excited about",
            "score": 17,
            "author": "wynn_ed"
        },
        {
            "level": 0,
            "comment": "???",
            "score": 4,
            "author": "neenersweeners"
        },
        {
            "level": 0,
            "comment": "Gross what is wrong with you traitors wanting great value Daniel Tosh ??",
            "score": 12,
            "author": "KylosLeftHand"
        },
        {
            "level": 0,
            "comment": "Kiffin almost beat Saban driving a 1999 Camry (Ole Miss). He is about to get the Keys to a Camaro going to Auburn",
            "score": 3,
            "author": "ConnorTeems"
        },
        {
            "level": 0,
            "comment": "Choo choo",
            "score": 2,
            "author": "_qt314bot"
        },
        {
            "level": 0,
            "comment": "Can someone please tell me why if we’re trying to get someone that can beat nick Saban we go after someone who hasn’t ever beaten him? I’m not mad at the hire (if we do hire him) but I’m not excited about it either… he can develop a QB and his offense is really good so that’s the plus side",
            "score": 3,
            "author": "XxHensleyXx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Coaches that have beaten Nick Saban is a very short list, so you are severely limiting yourself there. Tuberville was 0-4 against Alabama while at Ole Miss; obviously he had a lot of success when he came to Auburn. The only attainable person that we could hire is Freeze, and if you want to play that game, I don’t want a coach that has ever lost to UCONN",
                    "score": 10,
                    "author": "Javierfrom203",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even Nick Saban hasn’t beat Nick Saban!",
                            "score": 6,
                            "author": "RefrigeratorSea5503",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Kick 6 would disagree.",
                                    "score": 6,
                                    "author": "vashtaneradalibrary"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Freeze coached liberty to beat an Arkansas team that put 40 on auburn…",
                            "score": 4,
                            "author": "Jdavi3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Freeze will never coach in the SEC again. His background check is full of red flags. He’ll come up every time there is an opening but I don’t think anyone will roll the dice with him.",
                                    "score": 2,
                                    "author": "autigerts08",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ed Orgeron had a sketchy past due to illegal recruiting but that didn't stop LSU from naming him their head coach. \n\nHell, Bruce Pearl has a checkered past dating all the way back to Division II basketball when he ratted out several coaches to the NCAA. Then he broke NCAA rules at Tennessee. I know it was only a BAR BQ but he still broke rules. It was bad enough he had a 3 year show cause penalty. But we still hired him to Auburn. Calipari flat out got caught cheating at UMASS and Memphis but Kentucky hired him.",
                                            "score": 1,
                                            "author": "Over-Sir-2316"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Then proceeded to lose to UCONN, so what’s your point? Dudes a scumbag too.",
                                    "score": 1,
                                    "author": "_Weagle_Weagle_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And Lane Kiffin is not a scumbag? Sure freeze lost to uconn but he also is still the coach at liberty university a place you have never heard of until he was coaching it.",
                                            "score": 1,
                                            "author": "Jdavi3"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Would you take Nick Saban?",
                            "score": 3,
                            "author": "lalookn"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You have to understand there is a difference in resources between colleges. Lots of people believe Kiffin is a large fish in a small pond at Ole Miss, and that he can do much better somewhere with more resources, like Auburn, or maybe Nebraska or something",
                    "score": 2,
                    "author": "Whitttzz"
                },
                {
                    "level": 1,
                    "comment": "Alabama has lost the sauce dude",
                    "score": -1,
                    "author": "DaftPhya",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "😂😂 lost The sauce huh",
                            "score": 4,
                            "author": "XxHensleyXx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hell yeah, Saban been shitting his pants at his 6th lake house this weekend",
                                    "score": -3,
                                    "author": "DaftPhya"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The Saban era is over...",
                    "score": 0,
                    "author": "APSnooTiger"
                },
                {
                    "level": 1,
                    "comment": "Adding on, I’m from atl so half and half auburn uga. Uga spent the last few years recruiting and will be a ducking powerhouse in the next few years. Barkbark, war eagle",
                    "score": -16,
                    "author": "DaftPhya",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow breaking news",
                            "score": 3,
                            "author": "dubya4206969",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fk off cnt",
                                    "score": -6,
                                    "author": "DaftPhya"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Can someone please tell me why Auburn fans only seem to care about Saban and Alabama? There's 11 more teams on our schedule but fans like yourself seem to only care about Alabama and y'all judge an entire 12 game season on whether or not the coach beat Alabama. \n\nIf that's all that matters then y'all should've never fired Tuberville or Gus. Thank God that shortsighted fans like yourself aren't hiring our new coach.",
                    "score": 0,
                    "author": "Over-Sir-2316"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Deion or bust",
            "score": 1,
            "author": "Famous-Rutabaga-5517"
        },
        {
            "level": 0,
            "comment": "Why not travel by highway in smooth riding, luxurious Cadillac?  Plus that's a lot cheaper than buying a whole train.",
            "score": 1,
            "author": "Jay1972cotton",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dig",
                    "score": 1,
                    "author": "xcramer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lame Kitten is not Auburn material.",
            "score": 1,
            "author": "xcramer"
        },
        {
            "level": 0,
            "comment": "This aged well.",
            "score": 1,
            "author": "rbtgoodson"
        }
    ]
}