{
    "id": "1449ia2",
    "score": 4175,
    "title": "[Marco van Basten] open letter to Gianni Infantino asking for rule changes to prevent time wasting, diving, acting and harassment of the referee.",
    "author": "timdeking",
    "date": 1686231364.0,
    "url": "https://www.reddit.com/r/soccer/comments/1449ia2",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "It is a topic he has been vocal about and tried to change since forever. A lot of the suggestions and ideas for rule changes he made while working for the UEFA initiative were based in the idea to keep the game from being \"watered down\".\n\nVan Basten worked on VAR and suggested a three phase introduction. One phase to let referees and technicians get used to the technology, one phase to implement all the red cards/penalties/offside issues and one phase to introduce yellows for time wasting (VAR reviews for dives) and unsportsmanlike behaviour (crowding the ref).",
            "score": 313,
            "author": "R_Schuhart",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fascinating. And did they end up following his suggested phases?",
                    "score": 66,
                    "author": "throwawayursafety",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; And did they end up following his suggested phases?\n\nFIFA: _lmao_",
                            "score": 199,
                            "author": "BluePowderJinx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "*Turns around and signs another deal with a questionable regime*",
                                    "score": 22,
                                    "author": "Magnetronaap"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The WC was great in how they took wasted time more seriously.\n\nI do know a lot of people have concern about clocks that stop, but I do think it would be interesting to try it out, and see how it affects time wasting.",
            "score": 1584,
            "author": "DaveShadow",
            "replies": [
                {
                    "level": 1,
                    "comment": "Something I've never understood is how the entirety of the added time given can be spent time-wasting with the ball barely being in play.\n\nThe ref will give +4 added time, ball has been in play for less than a minute of that and the final whistle is still blown at 94.20.",
                    "score": 58,
                    "author": "apustus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The whole implementation of stoppage time is so dumb.  It's completely arbitrary and inconsistent every game.",
                            "score": 23,
                            "author": "AdonalFoyle"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; The ref will give +4 added time, ball has been in play for less than a minute of that and the final whistle is still blown at 94.20.\n\nSpanish refs: I can offer you 3 minutes added time and final whistle at 92:50",
                            "score": 2,
                            "author": "bveres94"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Honestly, I'd love to see it more often.\n\nToo many teams try and run the clock down (my own included) and we need to have some kind of deterrent. \n\nTeams would be far less likely to time waste if they saw that there would be 14 minutes of stoppage time added on.",
                    "score": 574,
                    "author": "TheGoldenPineapples",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My only concern is that if every game is like 10 minutes longer now those minutes add up over the course of the season \n\nBut in theory I think it’s great and hopefully if it stops people time wasting the issue solves itself eventually",
                            "score": 150,
                            "author": "TheSoundOfTheLloris",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Easy solution: change the game to 60 minutes or 70 minutes. True time playing football is close to 58 on average iirc",
                                    "score": 110,
                                    "author": "Satan_Himselff",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's what the proposal is, 2 halves with 35 minutes of effective playtime.",
                                            "score": 175,
                                            "author": "niallmul97",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I wonder if they'd still keep the timewasting rules in place in terms of taking too long for kicks, corners, throws etc. If not, I could see teams taking advantage of the change and using it to get a breather wherever possible.",
                                                    "score": 47,
                                                    "author": "duffking",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yes, it should be still punished because that breaks the flow of the game if you take too long.\n\nBut at the same time it likely won't be abused as much, as their gain is now limited to interrupting the flow, and not just removing 10 minutes of actual game.",
                                                            "score": 82,
                                                            "author": "cuentanueva",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Futsal has the 4-second rule, where the refs count (slowly) to four and the game needs to resume before that. Football has the 6-second rule for goalkeepers, but it's almost never enforced. Just change that to a general 10-second rule that is strictly enforced and the problem is solved. There's more time than in futsal, but not too much.",
                                                                    "score": 45,
                                                                    "author": "jmov",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Free throw clock, inbounds clock, pitch clock. The players and coaches have done this to themselves",
                                                            "score": 21,
                                                            "author": "Acceptable-Remove967"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "There definitely are different issues that could arise with a stopwatch clock. As you mentioned, timewasting for a breather. Usually it was the \"inferior\" team that would time waste for a result, but now you could see the \"superior\" team do it even when behind.",
                                                            "score": 6,
                                                            "author": "KhonMan",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Pickford rubbing his t-rex hands together at the thought of this.",
                                                            "score": 6,
                                                            "author": "crookedparadigm"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I would love to see them test out stopping the clock *but only during stoppage time.* Give us a full stoppage time. Time wasting doesn't matter if the clock is stopped. They can still enforce it if they are stopping the flow of the match but at least it won't actually eat the clock.",
                    "score": 8,
                    "author": "repost_inception"
                },
                {
                    "level": 1,
                    "comment": "I do agree it would be a positive change to the game to prevent time wasting. Though I think a part of my heart would miss the current timing system, 90+5' goals and the emotion created by not knowing exactly how much longer the match will last. And the timing was engrained in football history for over a century as a unique part of the sport, which goes away with a stopping clock.",
                    "score": 5,
                    "author": "seanhemi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you set the endgame like it is in rugby, ie the game stops the first time the ball leaves play after the clock reaches full-time, you could still see the losing team desperate to keep the control of the ball to score, and the winning team trying to shoot it out of the field...",
                            "score": 3,
                            "author": "barthvonries",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\n&gt;I do know a lot of people have concern about clocks that stop, but I do think it would be interesting to try it out, and see how it affects time wasting.\n\nI think the main concern with stopping the clock is that it's eventually gonna lead to more and more ads than ever before. And it's not gonna be long after until things start to look like The NFL.",
                    "score": 129,
                    "author": "ComradePoula",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, why would it? That's if you allow timeouts or something.\n\nYou should STILL card players/coaches for wasting time and ruining the flow, even if the clock isn't running. But at least the play actual time stays the same across teams and across leagues.",
                            "score": 123,
                            "author": "cuentanueva",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Stopping the clock means that you have control over when to resume play. It can be 30 seconds or 5 minutes if needed. So you know how this will eventually end.\n\nThe best solution is counting every second that was wasted just like they did in the world cup. You wanna fake an injury and stay on the ground for 20 minutes? Be my guest. But you're gonna have to play every single second that you wasted as added time.  \n And more yellow cards of course for intentional time wasting even if it's the 5th minute.",
                                    "score": 84,
                                    "author": "ComradePoula",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; Stopping the clock means that you have control over when to resume play. It can be 30 seconds or 5 minutes if needed. So you know how this will eventually end.\n\n[But European channels have laws on how many ads can be shown in an hour.](https://eur-lex.europa.eu/legal-content/EN/TXT/HTML/?uri=CELEX:52004XC0428\\(01\\)&amp;from=DE)\n\n&gt; In the light of the original wording of the television without frontiers Directive, the Member States differed in their interpretation of the provision of Article 18 that \"the amount of spot advertising within a given one-hour period shall not exceed 20%\". According to the sliding hour criterion adopted by some Member States, a broadcaster could not broadcast more than 20 % advertising, regardless of the precise moment from which a given one-hour period was deemed to run. This interpretation amounted to an **absolute ban on the broadcast of advertising for a continuous period of more than 12 minutes**. However, according to the clock hour criterion adopted by other Member States, a reference hour constituted a period of 60 consecutive minutes, starting at minute 0 and ending at minute 59 (natural clock hour) or starting at any time after minute 0, for example where a broadcaster's broadcasts start at 6.05 on any given day (overlapping clock hour). In this latter case, consecutive clock hours would run from 6.05 to 7.04, from 7.05 to 8.04, and so on.\n\n--\n\n&gt; Article 11(4) provides that where programmes, other than those covered by paragraph 2, are interrupted by advertising or teleshopping spots, **a period of at least 20 minutes should elapse between each successive advertising break within the programme.**\n\n---\n\n&gt; Sports programmes. The Commission would like to clarify how the provisions of Article 11 apply to sports programmes. In this respect, it should be recalled that Article 11(2) applies only to \"sports programmes ... containing intervals\". The interval must be natural and recurring and directly linked to the structure of the performance or event, as suggested by the explicit reference to \"similarly structured events and performances\". The explanatory report specifies that the notion of \"autonomous part\" during sports programmes must, generally speaking, correspond to natural breaks which are in keeping with the sport in question(28). This does not cover single accidental breaks, since all conceivable programmes would otherwise be covered by Article 11(2) of the Directive and not only those specifically mentioned. **For instance, concerning football, it follows from this interpretation that a corner, a free kick, a player replacement, etc., which does not entail a break in the game, does not constitute an interruption within the meaning of Article 11(2).**\n\nNow the European leagues could timeout the game until US or other countries broadcasters have taken ads, but there would be a hell of a lot of useless waiting around for Europe and people would tune out.",
                                            "score": 30,
                                            "author": "TIGHazard",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; Stopping the clock means that you have control over when to resume play. It can be 30 seconds or 5 minutes if needed. So you know how this will eventually end.\n\nIf they want ads in the middle, they can add them easily even with a running clock...\n\nIt's a different thing. You can stop the clock, but also say that the flow must be maintained and that's it.\n\nOn the NBA the flow is still there unless the go to timeout. And even more with the TV timeouts. But that's not because the clock stopping when the ball is out, it's because they added _other_ changes to the game to get ads.\n\n&gt; The best solution is counting every second that was wasted just like they did in the world cup. You wanna fake an injury and stay on the ground for 20 minutes? Be my guest. But you're gonna have to play every single second that you wasted as added time.\n\nYou want stopped clocked, just that doesn't look like it's stopped.\n\nAnd it's not realistic, because the _actual_ play time today is around 30 minutes per half. Doing what you are saying is increasing actual game time by 50%. That's why it's not doable.\n\nYou want to do 30 running minutes then, and the clock never stops, but you have _another_ clock that counts the time the ball wasn't in play... and then you add _that_ time to the time. And then for the extra 5 minutes you also have that clock counting... and then you add the time lost during that time... and then again and again in smaller and smaller increments?\n\nIt's literally clock stopping with extra steps.\n\n&gt; And more yellow cards of course for intentional time wasting even if it's the 5th minute.\n\nThe cards should still be given because you still interrupt the flow, even if the game time is still accounted for.",
                                            "score": 46,
                                            "author": "cuentanueva",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I played basketball till high school and I have watched a big number of matches of top level basket and futsal both live and on TV, the flow of the games isn't damaged at all by the clock stopping in those sports. Like you said it's just the long timeouts and I would add also free throws breaks (*cough* Giannis *cough*) that hurt the product (and American loves of commercials). Other FIBA leagues without that many timeouts means you feel like the games never really stops, especially as a player the few timeout you have are literally needed to catch your breath sometimes with how much the game feels without pause even if the clock isn't running (and you have refs actually counting loud the seconds for throw ins/other infractions).",
                                                    "score": 3,
                                                    "author": "DeathStar13"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; If they want ads in the middle, they can add them easily even with a running clock...\n\nAnd they do, with hydration breaks.",
                                                    "score": 7,
                                                    "author": "ibribe",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Exactly. And you don't even have to stop the game. In some leagues you have ads done by the commentators while the game is going. Or you have banners put over the actual game going for the ads. Or they could be added when there's something that's a known natural longer break...\n\nThere's an infinity number of ways where you can add ads without having to stop the clock. It's not a necessary condition.",
                                                            "score": 7,
                                                            "author": "cuentanueva",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Exactly.      \n      \nAnd by the other persons logic, they could actually have an ad break, and then just add stoppage time equal to the length of the ad break",
                                                    "score": 5,
                                                    "author": "5510"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I just don't understand this logic. Say there's an injury so they stop the clock. How is it any different from what we have currently with a running clock? They could already put advertisement in that injury break. Why would a different method of handling the time make that any different?\n\nCommercial breaks are only viable for pre-determined breaks like time outs.  Football doesn't have those and the suggestion isn't to add them. If they want to put commercials during the time that the game is paused, they can already do that, nothing is stopping them.",
                                            "score": 11,
                                            "author": "RN2FL9"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;Stopping the clock means that you have control over when to resume play. It can be 30 seconds or 5 minutes if needed. So you know how this will eventually end.\n\nIt isn't a problem in basketball though?",
                                            "score": 20,
                                            "author": "AlotaFaginas",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Or Rugby.",
                                                    "score": 23,
                                                    "author": "superfire444",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Rugby clock doesn't stop for normal dead ball situations either though.",
                                                            "score": 2,
                                                            "author": "BusShelter",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Stops shouldn't be any longer just because of a stop clock. The stops are the same, only how they are measured, would change. Also, broadcasters will shove adverts in their regions regardless, they're not going to wait for stopclocks for that opportunity.\n\nExamples: The Super League (top division of rugby league in UK) was set up in the 90s with Sky, in a very similar story to the Premier League's breakaway. It has adopted far more intrusive commercialisation than football, such as changing club names (most teams adopted a mascot-style name like Wigan Warriors or Leeds Rhinos), and multiple shirt and shorts sponsors. Even the [video ref decisions on the big screen are sponsored (this example is from the Australian NRL, but it's a very similar style of sponsoring the TRY and NO TRY decisions)](https://youtu.be/RAxHmRdutkc?t=55). It uses a stopclock when the ball is out of play. It would have been ripe for that additional advertising when the clock is stopped, and **it does not have additional advertising here**. The clock is stopped, but the break is no longer than natural, ie. The ball goes out, the clock stops whilst the player runs to get the ball to restart play, the clock restarts. From the style of commercialisation already happening in Super League, you'd be forgiven for thinking it would be ripe for yet another advert break here, but it doesn't happen because it would clearly intrude on and interrupt the actual gameplay, which isn't the design of the stopclock.\n\nIn contrast, if I watch an American or South African broadcast of a Premier League match, I will already see additional adverts when they make the screen 30% smaller to force an advert around the sides during live play. \n\nBroadcasters will force adverts into live play if they want to, they don't need stopclocks for that. But when adverts have a genuine impact on live play, (responsible) broadcasters will not have it interrupt the actual sport.",
                            "score": 11,
                            "author": "RtHonJamesHacker"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don't see a concern. If we are having to add 8+ minutes, the TV times are already being screwed anyways. I doubt a stopclock would add much more tv time than that",
                    "score": 12,
                    "author": "Legitimate_Secret_79"
                },
                {
                    "level": 1,
                    "comment": "&gt; The WC was great in how they took wasted time more seriously.\n\nBut it was still inconsistent, still at the will of the refs (meaning not every team will play the same) and leaves everyone on the dark on how much was left...\n\nGiven it was so long, there was a lot of wasted time inside as well, which wasn't accounted for most of the time. If you say there's 15 minutes of stoppage, you will have to add wasted time to that injury time... and that's not displayed anywhere, it's all a mystery...\n\n&gt; I do know a lot of people have concern about clocks that stop, but I do think it would be interesting to try it out, and see how it affects time wasting.\n\nThe best way is that the clock stops, that's the only way to make it fair and consistent across games. If the ball is in play, the clock is going and thats it.\n\nUnless FIFA also allows time outs or whatever, there's absolutely no reason to expect increased ads or whatever. That's a different thing compared to the time running or stopping.\n\nThe time wasting will be there, but it will be different, as in with the ball in play, which is how it should be.",
                    "score": 11,
                    "author": "cuentanueva"
                },
                {
                    "level": 1,
                    "comment": "as an american, if you start stopping the clock, they're going to try to wiggle in commercials. it'll become 4 hour games with 60 minutes of actual sports being played. it's unbearable.",
                    "score": 11,
                    "author": "kojak2091",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As long as it’s treated like hockey and not the NFL, it’ll be fine.",
                            "score": 5,
                            "author": "think_long"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "But, effective playing time or net playing time does remove professional football even more from amateurs, because you simply cannot implement it on every amateur pitch around the world. You would need time keepers or at least a visible clock at every pitch. \n\nI know, VAR and goal-line technology is already professional-only, but net playing time is a fundamental change of the laws of the game. \n\nI'm not sure it will ever come, nor will it solve time wasting. Destructive teams will simply interrupt the game flow in the final minutes by constantly stopping the clock. It would be awful to watch.",
                    "score": 3,
                    "author": "mxinex",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Van Basten waging war against shithousery, though I agree with the referee part",
            "score": 865,
            "author": "maxconnor6",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly, shithousery is a slippery slope. You have to put an end to it at some point because otherwise it devolves from a game of skill and talent to a game of fooling the officials and rule jacking.\n\nThe world cup group stages were far more enjoyable when they added 10-15 minutes to kill time wasting.",
                    "score": 358,
                    "author": "Veni_Vidic_Vici",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I LOVED the world cup extra time rules. So good. THen I come back to watch the premier league and I hate it even more. That is a rule that NEEDS to be put into effect.",
                            "score": 69,
                            "author": "gdewulf"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What do you mean I can't tell the ref that he's a wanker after I intentionally kill the other player?\n\nBut more seriously though, some control is good. But don't take the fun out of it.",
                    "score": 142,
                    "author": "ComradePoula",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "So you disagree they should do something against time wasting and acting?",
                    "score": 44,
                    "author": "Mapplestreet",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I love the referee part!",
                    "score": 2,
                    "author": "ireaddumbstuff"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No idea why no one in football even thinks about implementing a rule where only the captain can speak to the ref like in rugby. Also if you scream “FUCK OFF!” or something like that at the ref over a decision like you see all the time in the PL you get sent off.",
            "score": 578,
            "author": "ComeOnPelicanFly",
            "replies": [
                {
                    "level": 1,
                    "comment": "Rugby and Field hockey are great examples how referees should be treated and respected.",
                    "score": 282,
                    "author": "mattijn13",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Field hockey also has an excellent VAR system where teams get 1 appeal and keep it if they were right. It really allows refs to pretty much tell complaining playwrs to appeal officially or gtfo. Instantly kills all the complaining to the ref.",
                            "score": 218,
                            "author": "Aethien",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, I really wish they would implement these rules in football. The KNVB has a great example in the KNHB so they could just copy them.",
                                    "score": 43,
                                    "author": "mattijn13",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Personally I like the idea of every call being looked at without needing to appeal. In fact I think it should be done even more for incorrect yellows, corners etc. \n\nLike the other day for example Grealish did a blatant dive which AWB got a yellow for, and by the time the cameras had shown us about 53 different angles of it, the freekick still hadn't been taken. So correcting this mistake would not have added any time to the game.",
                                            "score": 32,
                                            "author": "TheJoshider10",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They still look at all the goals in field hockey. The referee can also ask the var to look at a situation. It does really help with the wining to the referee",
                                                    "score": 10,
                                                    "author": "laulau1501"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I've been saying for years how much i want that var system. It will get rid of most annoyances with the var and how random it feels",
                                    "score": 30,
                                    "author": "Satan_Himselff",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "All VAR calls being on mic and a conversation between ref and VAR is great too, as is the VAR just saying what the right decision is, no calling the ref to a screen nonsense.",
                                            "score": 45,
                                            "author": "Aethien",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes, it's great. One thing that still worries me compared to hockey is that for some reason football VAR's are so bad at the rules of the game compared to hockey's. They'd have to solve that too",
                                                    "score": 12,
                                                    "author": "Satan_Himselff",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That's because they're only tangentially looking at the actual rules. What they're really looking at is whether the ref made a 100% mistake or not. It's a painfully stupid roundabout way to do things and encourages VAR to figure out how to explain the refs decision not to be a mistake rather than looking at what the best decision would be.",
                                                            "score": 21,
                                                            "author": "Aethien"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The only obstacle I see to this system in the PL is that most refs in England are ego maniacs and the appeal system would force them to say \"Yeah we were wrong\" more often.",
                                    "score": 4,
                                    "author": "crookedparadigm"
                                },
                                {
                                    "level": 3,
                                    "comment": "Problem with this is that there are many situations that can technically be fouls but are not deemed so because of the flow of the game. It feels impossible in football to draw a black and white lije.",
                                    "score": 6,
                                    "author": "Deckkie"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[The most famous rugby example:](https://youtu.be/7x7sSz_Vsi8)",
                    "score": 28,
                    "author": "bydy2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That would be so nice in football",
                            "score": 15,
                            "author": "mattijn13"
                        },
                        {
                            "level": 2,
                            "comment": "Someone knows their onions. Hartley missing out on Lions was my first thought",
                            "score": 6,
                            "author": "Geg0Nag0"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m sure they tried that for about 3 games in the premier league a few seasons ago. It wasn’t enforced and quickly forgotten about",
                    "score": 40,
                    "author": "allangod",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They need to actually enforce it\n\nIf your average 13 year old playing rugby can follow the rules, so can prem players",
                            "score": 18,
                            "author": "Reach_Reclaimer"
                        },
                        {
                            "level": 2,
                            "comment": "They only need one ref with balls and post match support. Announce it before the community shield and make some examples of players in that game. It'll catch on real quick.",
                            "score": 55,
                            "author": "XSavage19X",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;post match support\n\nThis is a the real key.\n\nAt least at the amateur levels, we hear all the time that we should feel empowered to use our yellow and red cards to curb referee abuse. Which holds, until they're going over your stats at the end of the season and see how many cards you've given -- and suddenly it's a conversation about how you need to do better to \"manage the game without cards\". \n\nChange needs to come from the top. When individual referees try to make change on their own, they just stop getting games.",
                                    "score": 28,
                                    "author": "lamp37",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "unrelated fun fact: Ibrahimovic was sent off because he said 'it seems strange to me' to the referee\n\nDuring Covid so you can hear any word said.",
                    "score": 28,
                    "author": "Bloodnose_thepirate"
                },
                {
                    "level": 1,
                    "comment": "Van Basten proposed exactly that in 2017.\n\nHowever it was neglected probably because the first suggestion in his 10-point-plan to make football more exciting was to get rid of the offside rule, which at the time was the dumbest thing anyone had ever said.",
                    "score": 25,
                    "author": "F___TheZero",
                    "replies": [
                        {
                            "level": 2,
                            "comment": " &gt; which at the time was the dumbest thing anyone had ever said  \n\nWhat about now?",
                            "score": 3,
                            "author": "rugbyj",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[It's hard to think of anything dumber than this](https://www.reddit.com/r/soccer/comments/yz6z6b/rob_harris_fifa_president_gianni_infantino_at/)",
                                    "score": 4,
                                    "author": "akskeleton_47"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It desperately needs to happen.\n\nI’ve played lots of sports only at a weekend level. But football is the only one that tolerates referee abuse.",
                    "score": 2,
                    "author": "Fork-Cartel"
                },
                {
                    "level": 1,
                    "comment": "Maybe in certain circumstances, such as ref abuse, we allow the ref to eject the offending player, but allow his team to use a sub to replace him. It will make it a lot easier for the ref to make that call and I am sure that the player and the team would be upset by it.\n\nOf course, bad tackles, violent behavior and the like would still mean a red card and the team going a man down.",
                    "score": 2,
                    "author": "ghost00013",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mourinho is in shambles.",
            "score": 367,
            "author": "Algrinder",
            "replies": [
                {
                    "level": 1,
                    "comment": "Simeone is in the corner crying",
                    "score": 200,
                    "author": "DaAweZomeDude48",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "La Liga is in mourning.",
                            "score": 162,
                            "author": "Algrinder",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\n\n\n\n\n\n&gt;Diving and Harassing referees\n\n\n\nBruno Fernandes gonna have to start looking for a new job",
                                    "score": 138,
                                    "author": "DaAweZomeDude48",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;Bruno Fernandes gonna have to start looking for a new job \n\nHalf the players gonna have to start looking for a new job* \n\nThere fixed that for you.",
                                            "score": 24,
                                            "author": "gbx7"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Bordalas is in comatose",
                                    "score": 2,
                                    "author": "perhapsasinner"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Getafe about to disband",
                    "score": 22,
                    "author": "Behxccc",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "To be fair, Mourinho had a point. Especially after the FA Cup Final and West Ham game…\n\nIt always annoys me that referees conveniently ignore the fact that they themselves need to improve their decision making which creates situations where fans and players protest. You don’t see it in Rugby or cricket because VAR has been implemented correctly and the referees are a damn side better. \n\nAlso, on the Roma game, how was Anthony Taylor even allowed to ref such a high profile match? He has been one of the worst referees is the PL for years. There should be some quality assurance like any other line of work.",
                    "score": 4,
                    "author": "BlueOtis"
                }
            ]
        },
        {
            "level": 0,
            "comment": "An open letter to the fat, arrogant, anti-charismatic (inter)national embarrassment known as President Gianni Infantino...",
            "score": 54,
            "author": "Pikachu62999328",
            "replies": [
                {
                    "level": 1,
                    "comment": "The man's irrational, he claims that we're in league with Allardyce in some vast international intrigue.",
                    "score": 8,
                    "author": "Abafourth"
                },
                {
                    "level": 1,
                    "comment": "To the vile dog Infantino. Tales of your misdeeds are told from Ireland to Cathay. I submit these demands:",
                    "score": 4,
                    "author": "hobocactus"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There are so many things I hate about modern football:\n\n- players getting a freekick by *just* managing to get in between the ball and the opponent and going down immediately at the slightest touch\n\n- players who, whether fouled or not, take the ball into their hands when falling down\n\n- players who refuse to jump during a header duel and thereby make the opponent player 'roll' over them when they jump\n\n- players lightly shoving/pushing opponent players who try to control a high ball, just to mess with the opponent's control while they themselves aren't even interested in controlling the ball in that situation\n\n- players who *just* fouled an opponent refusing to move out of the way when the opponent tries to take the freekick quickly\n\n- goalkeepers handling/holding the ball for up to half a minute, despite the 6-second rule\n\n- players going down holding their faces theatrically when the opponent's hand brushed so much as their chest\n\nMost, if not all of these should be rigorously punished with yellow cards in my book.\n\n\nModern football is systematic cynicism.",
            "score": 44,
            "author": "skunkrider",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well said mate. I'm astonished at the amount of people are okay with all of this and just call it 'part of the game'. It's infuriating",
                    "score": 14,
                    "author": "kopite998"
                },
                {
                    "level": 1,
                    "comment": "&gt; players who, whether fouled or not, take the ball into their hands when falling down\n\nThis should be an instant yellow even if the player was actually fouled and gets a free kick. At the point of falling, no foul has been blown yet, so it's part of the game and handsball.",
                    "score": 2,
                    "author": "RyoCaliente"
                },
                {
                    "level": 1,
                    "comment": "&gt;players who   \n&gt;  \n&gt;just  \n&gt;  \n&gt; fouled an opponent refusing to move out of the way when the opponent tries to take the freekick quickly\n\nI remember last year in an MLS game when one player tried to block his opponent from taking a free kick by kicking the ball away but instead kicked the player and it still took VAR to give him a red card",
                    "score": 2,
                    "author": "akskeleton_47"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Time wasting yellow cards should be given earlier to keepers , and send them off if they persist. Referees will watch it go on basically all game, only give the card in the 85th min, then they never follow up with a red. Early on in the season, if a goalie is trying it give him the two yellows and you might cut that shit out. \n\nA stop clock sounds like a good solution in theory but I think players will game that in the same way they've gamed the head injuries protocol, I'm not sure it  would work cause effectively, you can use it to break up the game. That means it's still not flowing, the clock is just paused when players are acting out whatever they need to break up the game. \n\nCompletely agree on the communication with refs. Only the captain should approach, if the rest do, hand put yellows, if someone already has one give them a 2nd. I understand why officials don't do this cause they don't wanna tip the scales of the game themselves too much but if players understand there are consequences it might stop.",
            "score": 85,
            "author": "normott",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Time wasting yellow cards should be given earlier to keepers , and send them off if they persist. Referees will watch it go on basically all game, only give the card in the 85th min, then they never follow up with a red. Early on in the season, if a goalie is trying it give him the two yellows and you might cut that shit out.\n\nExactly - people are always so quick to go to changing the fundamentals of the game, when in fact the rules that exist just need to be enforced.",
                    "score": 22,
                    "author": "SanguinePar"
                },
                {
                    "level": 1,
                    "comment": "&gt;Time wasting yellow cards should be given earlier to keepers\n\nah lay fucking loo ya",
                    "score": 13,
                    "author": "weirdpastanoki",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I agree that players will always find ways to game the system.  It would suck to see a team kick the ball out of bounds at every opportunity, or go down injured every 5 minutes.  But I'm sure there are solutions to further deter this.  I'm not sure what they are, but they definitely exist.\n\nHowever, the bigger issue is that time-wasting and referee abuse has been a problem for a very long time without any attempts at all to address it.  At some point, some meaningful action needs to happen.",
                    "score": 2,
                    "author": "OG12"
                },
                {
                    "level": 1,
                    "comment": "I kind of agree but I don’t think the captain speaking to the ref would work in football as the field is too large and a captain could be at the other side of the pitch. This would allow one captain to take advantage. I actually think the main issue  with players grouping or rushing around a ref is because of pretty poor decision making. I think improving their decision making and some changes with communication like mic-ing a ref up. Showing what VAR are looking at. Having announcements in the stadium. Just basic stuff.",
                    "score": 2,
                    "author": "BlueOtis"
                },
                {
                    "level": 1,
                    "comment": "&gt; I understand why officials don’t do this cause they don’t wanna tip the scales of the game themselves too much\n\nOf course I am no referee but I am quite comfortable to say that antics against the ref is the rule breach that is the easiest for the ref to determine. Refs would have all the rights in the world to just stand up for themselves and hand out 2nd yellows for aggressive arguing, shouting etc. Yet they are put in this mad situation by the players, their respective associations and football in general that if they red card somebody for being an absolute aggressor they are tipping the scales of the game, but if they hand out a second yellow or a red for a rule breach they barely saw or what is highly subjective (like a tackle or a hand ball situation), they are instantly backed by their higher ups.\n\nOf course I know what people mean under refs tipping the scales and it absolutely happens, but everybody (the ref himself especially) should understand that when a player gets sent off for spitting in the mouth of the ref then its them whould tip the scales and not the ref.",
                    "score": 2,
                    "author": "Billofrights_boris"
                }
            ]
        },
        {
            "level": 0,
            "comment": "In Australia diving and time wasting is the main reason the sport is the 4th most popular. I've tried to get my friends to watch games and it is embarrassing sometimes.",
            "score": 95,
            "author": "Friendly_Chicken_760",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same in canada, when people compare it to hockey, its always come back to how hockey player are tough and go on with the game regardless of what happen compared to football player acting like they got shot for every small contact.",
                    "score": 47,
                    "author": "Marchedbee2042",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeh, when you've seen humans take a certain amount of pain get straight backup, and then an hour later watch an even bigger person get less contact and roll around it's so glaringly obvious",
                            "score": 24,
                            "author": "Friendly_Chicken_760",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I love combat sports &amp; even amateur/ journeyman fighters can take sn absolute beating, but still, will still be able to smile, laugh, &amp; joke. \n\nI've seen 115lbs women in MMA be a savage but full-grown men in football pretend to cry,spit &amp; just act like children. \n\nThe refs in combat sports take less shit than football refs, and fighters have more of a reason to be angry, especially with brain damage on the line.",
                                    "score": 7,
                                    "author": "AsymmetricNinja08"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I also hate diving but I’m pretty sure embellishment happens much more often than diving without contact and refs 100% have an influence of that because the players feel (and have been feeling for years already) that they get less calls if they don’t embellish contact which is absolutely true.",
                            "score": 8,
                            "author": "Billofrights_boris",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Ditto down here in the States. People are used to sports that celebrate toughness and self-pride. Faking injury, rolling around on the ground, and play-acting are absolute non-starters in basically every sport apart from the NBA (and even then it’s widely criticized by fans).\n\nFans in the US and Canada love this sport but we face similar issues when we try to get friends to watch and they just laugh at us for watching a sport with so much nonsense on the field.",
                            "score": 9,
                            "author": "mindthesnekpls",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Hockey has two rules I think football could easily implement.\n\n1 - Delay of game, if a hockey player shoots the puck into the crowd from his team's own half of the ice, he is sent off for 2 minutes. Since they don't have penalties in football, maybe a free kick could be awarded from the spot of the foul. Do it inside the box? Give the other team a choice of where to kick from outside of the box.\n\n2 - Embellishments, if a referee determines that you're exaggerating they can give you a penalty as well. This includes if a player actually committed a foul on you. In that situation the ref will give both players penalties. Dunno how offsetting penalties would be handled in football though.",
                            "score": 2,
                            "author": "DevryMedicalGraduate"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Football needs a change at grassroot levels. Diving and time wasting as a kid should be shamed upon.\n\nThat and only captains allowed to 'surround' the ref. Captains and ref then can call on those involved in the challenge.\n\nAnd more ref accountability. In-game mic.",
            "score": 122,
            "author": "DeliciousBallz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Grassroots change can only happen when these 8 year old kids stop seeing their favourite football hero abuse officials in front of millions.",
                    "score": 118,
                    "author": "OG12"
                },
                {
                    "level": 1,
                    "comment": "Grassroot can only change if you start attacking the top levels in their behaviour. Especially with kids. We have this here in Germany, where the aggressive behaviour against refs is at an all time high leading to multiple grassroot level games being cancelled. \n\nIf you ask the most refs no matter which div they are in, it's always the same: More aggressive behaviour in the BuLi. If lets say Thomas Müller can get away with bullying the ref in front of a multi million audience, why shouldn't the amateur player be able to do the same when only a handful of people are watching?\n\nKids being the same, why not fakeing a injury like Neymar or shithouse like Atletico when they are successful with this?\n\nOf course we need a change at grassroot levels but in my eyes these changes are bound to changes in the professional levels as well.",
                    "score": 41,
                    "author": "domi1108"
                },
                {
                    "level": 1,
                    "comment": "You’ve got this the wrong way around. Needs to change at the top levels first.",
                    "score": 17,
                    "author": "Anonamoose12771"
                },
                {
                    "level": 1,
                    "comment": "To pile on to the other comments: as someone who has refereed thousands of grassroots games, the change absolutely must come from the top.\n\nKids are impressionable. They watch their heroes on TV, and mimic them.",
                    "score": 4,
                    "author": "lamp37"
                },
                {
                    "level": 1,
                    "comment": "This is a top-down situation, not bottom-up. Children are impressionable and follow what their role models on TV do, which is abuse refs. Referees might try and assert their authority on a game by giving cards for dissent but the league runners will be quick to give those referees less and less games\n\nThis is a management and top-level issue through and through",
                    "score": 3,
                    "author": "happygreenturtle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There are rules for all of this it's just not enforced.",
            "score": 12,
            "author": "VegetableAwkward286",
            "replies": []
        },
        {
            "level": 0,
            "comment": "\n\n\n\n\n\n\n\n\n\n\nPersonally not a fan of the 2x35 , I think the extra added time for time wasted is the way to go like in the world cup. We just gotta get used to seeing +14 minutes added on more often lol",
            "score": 127,
            "author": "DaAweZomeDude48",
            "replies": [
                {
                    "level": 1,
                    "comment": "The two reasons why 2x35 will be more effective is because players will see that their time wasting efforts aren't working in real time. If they don't get to see the number added until the end of the half, they will always take the chance that they can't waste time and the ref won't award all of it. \n\nAnd once extra time starts, there is no official extra time to extra time. 2x35 guarantees there is.",
                    "score": 105,
                    "author": "XSavage19X",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'd say before that, we need to introduce time stops for substitutions, medical intervention and VAR checks only (ref can also stop if the ball takes too long to be fielded again). Time-stops everytine the ball goes out of play is too unreliable for scheduling and we risk games taking 3 hours to end\n\nI'd also like to see a rule being implemented where, if the throw-in/goal kick/etc takes too long, the ref blows the whistle and the player has 3 seconds (counted by ref's hand like in futsal) to put the ball back in play or\notherwise it's yellow + loss of possession",
                            "score": 17,
                            "author": "bcotrim",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I hate the throw ins where it's one guy picks up the ball looks and then just drops it and then we wait another 10 seconds for the next player to pick the ball up and look to throw for 5 more seconds. If you pick up the ball you should have to take the throw in.",
                                    "score": 4,
                                    "author": "Bobb_o"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;  Time-stops everytine the ball goes out of play is too unreliable for scheduling and we risk games taking 3 hours to end\n\nHow do we? If each half gets changed to be around 30 minutes then even with a freak injury that takes 10+ minutes a 60 minute game would still be over well within 2 hours.\n\nI feel like football will continuously go through loop holes when it comes to the 90 minute length when there's a much more convenient and simple answer that fixes the majority of people's problems.",
                                    "score": 13,
                                    "author": "TheJoshider10",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[I'll link my reply to a similar comment](https://www.reddit.com/r/soccer/comments/1449ia2/-/jnf4ibg)\n\nTo address the freak injury, there's no solution for that. If there's one, the game will eventually prolong in any sport you play (but in football they won't stop the clock because it's better to add 20' minutes)",
                                            "score": 4,
                                            "author": "bcotrim"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; Time-stops everytine the ball goes out of play is too unreliable for scheduling and we risk games taking 3 hours to end\n\nAs opposed to +15 extra time minutes? It's the same thing. When there's a fight, or long injuries, or lights go out, or a dog comes into the field, or anything else that interrupts the game, the time is added later... So if are actually compensating from the wasted time one way or another, you would end up with a similar amount of play time.\n\nSo why not doing it the most efficient and transparent way?\n\nIt might actually be better since with injury time players will still act it up. With stop clock the do the same.\n\nYou still schedule the same window time for games as you do now. The idea is to keep the same average actual play time, but across the board.",
                                    "score": 8,
                                    "author": "cuentanueva",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm talking by experience because handball works this way. It's 30+30 with 15 minutes halftime, and games usually take 1h30-45 minutes to be completed\n\nNBA, on the other hand, is a 4x12 match where matches vary from 2 to 3 hours depending on the game events",
                                            "score": 3,
                                            "author": "bcotrim",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "NBA is a special matter because of the long timeouts, basketball match around the world usually take 2 hours at most. Football would probably be a little longer that now but not a crazy amount and a good compromise for the improvement we would get.",
                                                    "score": 3,
                                                    "author": "DeathStar13"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The NBA has literal forced TV ad breaks. That's 8 timeouts for a total of 25 _forced_ tv breaks, then you have the normal timeouts, plus half time and the other two intervals... In total it's around 60 minutes of not playing, without even touching the ball.\n\nThere's a lot of dead time in NBA.\n\nDo this math, you have 48 minutes of actual play in the NBA. In soccer it's between 50 and 60 of actual play for ~95 minutes of \"clock time\", depending the game. And the overall time is around 2 hours including the half time.\n\nIf we were to use NBA numbers, for the 48 minutes of real play it would be like a soccer game lasting 75-90 minutes on the always running clock. If you add the hour of non play time I talked about before... then you get... from 2 to 3 hours of duration...\n\nAs you can see, the difference is the forced tv timeouts, the normal timeouts, and the two extra breaks in the quarters. It's not the clock stopping or not.",
                                                    "score": 3,
                                                    "author": "cuentanueva"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I can agree with this. I don't like stopping the time every time the ball goes out. It's too complicated and difficult to implement at lower level. You would need a person only for that, and it's hard to verify that they are doing it correctly. But stop time for few events could be ok, but it's not too different from extra time as now",
                                    "score": 3,
                                    "author": "7he_Dude"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "the proposal for shorter halves is because even in the best of times the amount of time that football is effectively being played is less than 45 minutes, the ball going out of play and stuff actually eats up a fair bit of time. maybe not 10 minutes worth but still a decent amount",
                    "score": 10,
                    "author": "b3and20",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It eats up a lot more that 10 minutes. Average real gametime is something between 50 and 60 minutes a game.",
                            "score": 31,
                            "author": "DeathStar13",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "my bad but yh, further proves the point anyway",
                                    "score": 9,
                                    "author": "b3and20",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There was one premier league game in the last round of fixtures that had LESS than 45 minutes ball in play! \n\nThat’s a piss take- imagine paying for a pint and the barman serves you a half and still keeps all your money?",
                                            "score": 2,
                                            "author": "markjlast83"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No. Yes it seemed viable, but he makes a point in saying the play acting, time wasting goes on in the added minutes.",
                    "score": 6,
                    "author": "DeliciousBallz"
                },
                {
                    "level": 1,
                    "comment": "Pause the fuking game like in futsal. Rules needs to starts change, the game is getting to tactical for the common viewer, i pay for a 90min game and get a 55minute One...",
                    "score": 3,
                    "author": "FrancescoliBestUruEv"
                }
            ]
        },
        {
            "level": 0,
            "comment": "2x 35 effective play time would be great",
            "score": 99,
            "author": "Gu3rilla21",
            "replies": [
                {
                    "level": 1,
                    "comment": "The rational part of me says, that this is probably not a bad idea. The football purist part of me is covering the ears and screaming \"lalala, I can't hear you\".\n\nFor real though, this type of change to the game itself will always be a hard sell. It's worth a try in some friendlies, tough.",
                    "score": 37,
                    "author": "miregalpanic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You won't know if it's a hard sell until you try it.  If the results are drastic then the buy-in will be a lot better.",
                            "score": 6,
                            "author": "OG12",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;won't know if it's a hard sell until you try it.\n\n  \n\n\nThis is exactly why they need to actually test these proposals. Have a lower league go for it. Or even MLS, they are always looking to do something weird.",
                                    "score": 5,
                                    "author": "repost_inception",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "League Cup games. Usually nobody cares about them. This actually gives the audience a new reason to check those games",
                                            "score": 6,
                                            "author": "wizkatinga"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "MLS is a good idea because many North Americans are disgusted by the diving and time wasting and would likely embrace this.",
                                            "score": 2,
                                            "author": "think_long"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm in favour of driving positive change. Same thing happened with the Halo in F1, vast amounts of people including drivers were against the idea. Some even stating the aesthetic of it as a factor why they are against implementation. Now after saving multiple lives it is the most normal thing in the world and trying to get rid of it would be met with significant backlash.",
                                    "score": 3,
                                    "author": "Silent-Act191",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Feel like there's a massive difference between a potential life-saving change to a sport and this though.",
                                            "score": 3,
                                            "author": "BusShelter",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; The football purist part of me is covering the ears and screaming \"lalala, I can't hear you\".\n\nI don't get this. Nothing against you, I'm just using this part of your comment cause many people say the same thing and it's the typical argument against.\n\nThere's no \"purity\" in today's football. Offside wasn't even a part of the rules at first. Then it changed multiple times.\n\nThen we added VAR to review it and get way better and fairer outcomes.\n\nWhat's the \"pure\" football? Which version of offside should we go back? Shall we remove VAR go back to having unfair offside goals?\n\nAnd that's not the only change. The freaking starting kick was changed. What's a handball or not changes like every other season.\n\nThe game evolves and actually improves to slowly remove the worst parts of it.",
                            "score": 11,
                            "author": "cuentanueva",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;What's the \"pure\" football? \n\nGood question, but I think it's that 90 minutes. It has remained pretty much unchanged since the beginning, only stoppage time has been added. Changing that 90 minutes would be changing something that essentially defines the game.\n\nNot saying it can't be done, but it's definitely the most difficult change to accept.",
                                    "score": 7,
                                    "author": "jmov",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Great for bussiness, they can put commercials during the game and make it unbearable to watch.",
                    "score": 18,
                    "author": "wilins96",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They could do that now, if they wanted. A substitution or set-piece for the winning team? 30 second advert. But they don't.",
                            "score": 50,
                            "author": "RosaReilly",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They already do in Italy. We have as interruption for subs, injuries and picture in picture for normal game time. Stopping the clock wouldn't change anything for TV, but make all the difference in being more fair and improving the on the pitch product.",
                                    "score": 17,
                                    "author": "DeathStar13",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Interesting, that is against European directives.\n\n&gt; Sports programmes. The Commission would like to clarify how the provisions of Article 11 apply to sports programmes. In this respect, it should be recalled that Article 11(2) applies only to \"sports programmes ... containing intervals\". The interval must be natural and recurring and directly linked to the structure of the performance or event, as suggested by the explicit reference to \"similarly structured events and performances\". The explanatory report specifies that the notion of \"autonomous part\" during sports programmes must, generally speaking, correspond to natural breaks which are in keeping with the sport in question(28). This does not cover single accidental breaks, since all conceivable programmes would otherwise be covered by Article 11(2) of the Directive and not only those specifically mentioned. **For instance, concerning football, it follows from this interpretation that a corner, a free kick, a player replacement, etc., which does not entail a break in the game, does not constitute an interruption within the meaning of Article 11(2).**",
                                            "score": 16,
                                            "author": "TIGHazard"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Then fucking prevent it. Why is this always the reply to effective playing time.",
                            "score": 72,
                            "author": "DeliciousBallz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just Americans and their PTSD",
                                    "score": 28,
                                    "author": "aveniner",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think Americans are more likely to support stop clock, because they are used to it in other sports",
                                            "score": 10,
                                            "author": "5510",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What other sport doesn't use stopped clocks? I honestly can't think of one.",
                                                    "score": 3,
                                                    "author": "RN2FL9",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Americans are also used to rule changes in their sports (see MLB this year) so OP's comment makes 0 sense",
                                                    "score": 2,
                                                    "author": "AdonalFoyle",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "yeah, the idea that Americans are slowing down rule changes in soccer is ridiculous, even if you limit it to Americans who are actually into soccer and don’t just turn on the World Cup every 4 years and say they should get rid of offsides.",
                                                            "score": 2,
                                                            "author": "5510"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You can't put a commercial when you don't know how long the ball will be out of play for, which they'll never know. Unless they do a small screen popup commercial. They can do that already tho and they don't",
                            "score": 14,
                            "author": "Gu3rilla21",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In North America, the ref gets buzzed when the commercial break is over and play can restart. It easy enough to do.",
                                    "score": 8,
                                    "author": "ghost00013",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Jezus that's fucking insane. Did not know that.",
                                            "score": 30,
                                            "author": "Gu3rilla21"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "So we’d be combatting timewasting by the players by replacing it with timewasting by the commercials 🤮",
                                            "score": 7,
                                            "author": "Anonamoose12771"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Then we don't do that. Enforce not doing that, fuck the corpos.",
                                            "score": 5,
                                            "author": "DeliciousBallz"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "American broadcasts do that already",
                                    "score": 5,
                                    "author": "auddi_blo"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Honestly, that'd just make it even worse. \n\nOpponent going through a good spell with lots of pressure? Teammates getting exhausted? Just waste a bunch of time to take a break. No cards given because you're not \"waiting time\" since you've got effective play time.\n\nThey just need to do two things:\n\n1) instruct refs to be way less lenient on time waisting, diving and harassing the ref\n\n2) instruct refs to call fouls even if the fouled player doesn't fully go down - half the reason players go down so often/easily is because when they don't, they usually don't get the foul",
                    "score": 3,
                    "author": "JournaIist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; No cards given because you're not \"waiting time\" since you've got effective play time.\n\nTake the four-second rule from futsal and adapt it to fit football.",
                            "score": 2,
                            "author": "jmov",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Number 1 is exactly what needs to happen, but the first time that the big clubs get players sent off for doing it, they'll be screaming bloody murder and will probably attack the refs even more\n\nNumber 2 is pointless because half of the reason why players roll around is to kill momentum of the opposing team and give their own teams a breather. Stopping the clock does nothing to address the issue. Players will still roll around, teams will still take 1.5 minutes for a goal kick or throw in or etc",
            "score": 12,
            "author": "bellerinho",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Any time a player or coach on the bench is sent off the manager should have to go to.\n\nMourinho and his staff have 15 red cards this season alone, but only 2 for Jose. It's an effective tactic to just let your GK or fitness coach abuse the officials or start fights with the opposition.",
            "score": 31,
            "author": "RomaMerda89",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 23,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And they introduced yellow cards to the bench otherwise it would have been even more if only a red was available.",
                            "score": 11,
                            "author": "DeathStar13",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Mourinho had 5 yellows, he missed the final game due to the accumulation. First time in history that's happened to a manager I believe.",
                                    "score": 3,
                                    "author": "RomaMerda89",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Italiano almost missed the game against Mourinho (which was the game where Mourinho got his 5th yellow) for accumulation as well but managed to blame somebody from his staff who was red carded instead after the whole bench was complaining for something. The good things is Italiano isn't insulting the ref like Mourinho, most of his card were because he is just overly excited and often finds himself on the pitch while scolding his players.",
                                            "score": 3,
                                            "author": "DeathStar13"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes and that's not counting all the yellows. Its non stop harassment from the first whistle. And it works. They intimidated Maresca into giving them game changing decisions in their last match, that secured them Europa league. Without it they'd have been in the Conference.",
                            "score": 12,
                            "author": "RomaMerda89"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; Mourinho and his staff have 15 red cards this season alone,      \n       \nHoly shit what a shocking statistic",
                    "score": 8,
                    "author": "5510"
                },
                {
                    "level": 1,
                    "comment": "I don't think this was intentional, but Matias Almeyda once got his [interpreter sent off](https://www.youtube.com/watch?v=ws15cudlMg8)",
                    "score": 3,
                    "author": "AMountainTiger",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's hilarious. Almeyda is a Lazio legend. Other managers in that title winning side include\n\nSimeone, Mancini, Inzaghi, Conceiao, Mihajlovic, Stankovic, Nesta, Sensini, Ravanelli, Negro, Pancaro, Marcolin, Lombardo.\n\nNedved and Veron have taken director positions.\n\nHas one team ever produced more managers?",
                            "score": 7,
                            "author": "RomaMerda89"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Everything he said is so valid.",
            "score": 2,
            "author": "Razzle_Dazzle08"
        },
        {
            "level": 0,
            "comment": "Letter is in the trash bin already. Next time fill it with cash.",
            "score": 4,
            "author": "BBrainPheart57"
        },
        {
            "level": 0,
            "comment": "He's absolutely right. The Europa league final was ridiculous. Although every game Jose Mourinho is involved in is.",
            "score": 4,
            "author": "ranndino"
        },
        {
            "level": 0,
            "comment": "Well in Marco. Diving and faking injury are a massive stain on our game. The standard of play has never been better and yet the cheating has never been worse. I and alot of my friends are turning away from watching the elite game because its just embarrassing watching grown men roll around like they've been shotgunned in the face when a gust of wind comes near them. We have video technology now. Use it to punish diving and playacting. Praying something comes of this.",
            "score": 10,
            "author": "kopite998"
        },
        {
            "level": 0,
            "comment": "This is great. Hope it leads somewhere",
            "score": 13,
            "author": "Shaggythemoshdog",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am not hopefull, he worked at FIFA for two years trying to implement these things and, how he tells it, nobody listnened or wanted actual change.",
                    "score": 10,
                    "author": "mattijn13"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No Bordelas ball?",
            "score": 3,
            "author": "Evern35"
        },
        {
            "level": 0,
            "comment": "Don't need rule changes, they're already there. They just need to actually enforce them.",
            "score": 3,
            "author": "Sr_DingDong"
        },
        {
            "level": 0,
            "comment": "Ending player harassment of referees is something that can already easily be done.  Just start carding players that crowd the referee.\n\nHonestly complaining about a call/whistle should be exactly why the captain's armband exists.  Everyone else should fuck off.",
            "score": 3,
            "author": "devioustrevor"
        },
        {
            "level": 0,
            "comment": "The Europa league final wasnt a one off by the way. Mourinho's Roma has been playing like that for 2 years now.",
            "score": 42,
            "author": "RomaMerda89",
            "replies": [
                {
                    "level": 1,
                    "comment": "Moirinho based his entire career around it.",
                    "score": 44,
                    "author": "saadowitz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He's gotten much worse recently though. All the fake injuries and time wasting, its football terrorism.",
                            "score": 24,
                            "author": "RomaMerda89",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m sure the romamerda89 account has a very unbiased opinion on the topic",
                    "score": 9,
                    "author": "Pamphili"
                },
                {
                    "level": 1,
                    "comment": "You're not very smart if you think that the Romanisti wanted to waste time at 1-1, knowing they would have no chance of winning on penalties",
                    "score": 4,
                    "author": "Pleasant_Skill2956",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "not really a fan of 2x35. Just start handing out yellows more often with no warnings\n\ncommitting a foul and picking up the ball and walking away? yellow  \nrolling back onto the pitch when injured? yellow  \ntaking 30 seconds and moving up the pitch on throw ins? yellow",
            "score": 5,
            "author": "edwardfortehands"
        },
        {
            "level": 0,
            "comment": "I completely agree with everything he said about referee abuse. \n\n\nEffective playing time, not so much. The moment effective playing time is introduced, is the moment I stop watching football. I've seen enough basketball and handball games in my life to know that all stopping the clock does is stretch out game time and make a match feel much longer. The sport would be come unwatchable to me. \n\n\nOne of the best things about football is that I can pretty much pinpoint when a game ends. This is extremely helpful not only when I schedule to watch a match on tv, but especially when I attend one at the stadium. It's also much more entertaining to watch as interruptions feel like a natural part of the game flow and not like actual interruptions for which the clock has to be stopped every single instance, making an interruption feel much more boring to sit through. I can also the risk of such interruptions being used as an opportunity to show ads mid-game since it would be more practical for broadcasters to plan and schedule when to show how many ads, adding to the boredom aspect. \n\n\nSo overall it's a strong no from me on effective playing time.",
            "score": 24,
            "author": "Hic_Forum_Est",
            "replies": [
                {
                    "level": 1,
                    "comment": "How would it stretch the game? You would still have limited time to take a goal kick or throw-in. In combination with shorter halves, it would more or less be the same at the very worst. It very well might be quicker since there's a lot less incentive to take it slow.",
                    "score": 4,
                    "author": "_Djkh_"
                },
                {
                    "level": 1,
                    "comment": "Field hockey has effective playing time and every time I watch a match all i can see is: this game feels so much faster than football. It's honestly a better viewer experience. All their rules are aimed at making the game fast paced and it works",
                    "score": 23,
                    "author": "Satan_Himselff",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I don't know much about handball, but the basketball situation wouldn't apply to football. There's a necessity to try and foul in order to get the ball back quickly, which causes the game to drag on. There's no equivalent need in football: giving away free kicks doesn't get you the ball back.",
                    "score": 14,
                    "author": "RosaReilly"
                },
                {
                    "level": 1,
                    "comment": "But there’s added reason to foul in basketball right? You get the ball back. In football you just shoot yourself in the foot if you do it.",
                    "score": 2,
                    "author": "czeja"
                },
                {
                    "level": 1,
                    "comment": "How does effective playing time stretch the game? I think it would do the opposite. \n\nI think I see what you mean though. The ref always has the time left on his wrist so we could take all the time in the world to finish the game. Also, it may still encourage rhythm breaking. Players play acting won't go away.\n\nI think we really need to play test it in a future FIFA minor tournament. Then see how it goes and if needed enforce a time where the match ends. Unless circumstances arise of course.",
                    "score": 6,
                    "author": "DeliciousBallz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; Also, it may still encourage rhythm breaking. Players play acting won't go away.\n\nYou still card players like you do today for wasting time. It just doesn't affect the clock... You literally continue everything like today, the reward is that the time that was wasted is accurately accounted for instead of having some vague generic +4 that is grounded on how the ref felt that day...",
                            "score": 6,
                            "author": "cuentanueva"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A shame he doesn’t bring up the third point about referee accountability as we saw in the Valencia game with regards to not following the anti racism protocol or the VAR issue because it was in their interest to demonize Vini. \n\nReferees, FIFA and UEFA are not symbols of virtue, and accountability has to start with them.",
            "score": 9,
            "author": "LewsTherin177"
        },
        {
            "level": 0,
            "comment": "Based Marco",
            "score": 7,
            "author": "mattijn13",
            "replies": [
                {
                    "level": 1,
                    "comment": "If van Basten is a \"football enthusiast\" what does that make us?",
                    "score": 3,
                    "author": "rummyt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Diving should be a red. It has to start somewhere so players like Bousqets and Neymar learn the lesson.",
            "score": 2,
            "author": "ryanmannz"
        },
        {
            "level": 0,
            "comment": "\"i'm Marco Van Basten today, and I disagree\" Infantino probably",
            "score": 2,
            "author": "thesoundready"
        },
        {
            "level": 0,
            "comment": "Do not stop the clock, this is not a real problem. Soccer is the most popular sport in the world, enforce time wasting with more cards and it will die down. But it's effectively part of the game. Makes it unique.",
            "score": 2,
            "author": "Penguana7"
        },
        {
            "level": 0,
            "comment": "Funny how is always Mourinho, and never the ref",
            "score": 2,
            "author": "Susp"
        },
        {
            "level": 0,
            "comment": "How about fixing the hierarchy structure of football first and actually enforcing the fucking FFP shit for once on the clubs that have been falsifying and scamming for years without any fucking penalty. It is infuriating to support a club that is banged by FFP every single year when wealthy Arab states can buy clubs and instantly bypass the same laws without a single point being withdrawn.  \n\n\nAs I see it the shithousery is something the less rich clubs use to compete with the infinitely wealthy clubs to drag them down to their level.  \n\n\nThe harassment of the officials is however something that absolutely has to stop, even though the refs can seem like corrupt buckets of farts it absolutely melts my brain when I have to watch massage therapists and goalkeeping coaches getting red carded because it's the norm to harass the ref every time a throw in happens.",
            "score": 2,
            "author": "addi10"
        },
        {
            "level": 0,
            "comment": "It’s crazy to me that anybody who complains about time wasting isn’t in favor of stop clock… a spot clock is tant fixes the problem.     \n        \nJust reduce the game to 60 or 70 minutes, stop the clock anytime the ball is out of play (like in other sports), and then say the game can only end on a throw in or goal kick, if you want to preserve the unofficial idea that the game generally doesn’t end right in the middle of an attack.",
            "score": 9,
            "author": "5510"
        },
        {
            "level": 0,
            "comment": "I would hate those time rules, but the mobbing I can agree with.\n\nTho it will cause an unholy amount of red cards and therefore ruined matches. Especially at first.",
            "score": 5,
            "author": "SuccessionFinaleSux",
            "replies": [
                {
                    "level": 1,
                    "comment": "So be it. It's ruining our game and something has to be done.",
                    "score": 6,
                    "author": "kopite998"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pausing the clock will make football games as long as NBA games, which means that’s you never really know how long you’re going to be watching for. Donno if it’s good or bad",
            "score": 5,
            "author": "Walter_West",
            "replies": [
                {
                    "level": 1,
                    "comment": "NBA's problem in that regard are the timeouts, not the clock stopping.",
                    "score": 6,
                    "author": "krvlover"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m against stopping the clock. Don’t think it will stop players from shithousing in order to disrupt momentum, and I also think shithousing is a valid tactic. I think it’s silly to expect a team like Elche to go toe to toe in open flowing football against a team like Real Madrid. Might not be best example because I don’t know how Elche play but point is teams with smaller resources and less quality in their team can consciously chose to time waste in order to get a point, or three if they go up. It’s not very entertaining but all that matters is taking as much as you can in points",
            "score": 2,
            "author": "sickricola",
            "replies": []
        }
    ]
}