{
    "id": "1455hex",
    "score": 125,
    "title": "Phil Neville And Richard Shaw Joining Canada Soccer’ Men’s National Team Coaching Staff",
    "author": "TheMonkeyPrince",
    "date": 1686317795.0,
    "url": "https://www.reddit.com/r/soccer/comments/1455hex",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "How the fuck does Phil Neville keep getting jobs",
            "score": 194,
            "author": "sandbag-1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not like an Canada NT assistant coaching position is that prestigious.",
                    "score": 111,
                    "author": "Lambchops_Legion",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bollocks, eh!",
                            "score": 9,
                            "author": "A_StarshipTrooper"
                        },
                        {
                            "level": 2,
                            "comment": "the CMNT sure has a habit of hiring coaches from unusual circumstances (Benito Floro comes to mind where his \"selling point\" was that he once managed Real Madrid, 20+y prior)",
                            "score": 2,
                            "author": "onthelongrun"
                        },
                        {
                            "level": 2,
                            "comment": "I'm not sure I have heard of a manager going from being full time head coach to an assistant elsewhere after wards. I'm sure it's happened sometime. It'd interesting to know if anyone knows any.",
                            "score": 2,
                            "author": "corsairealgerien",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We sacked Karl Robinson this season, he then became Sam Allardyce's assistant at Leeds for the 4 games they were there. Paul Clement went back to assisting Ancelotti after  being sacked by Derby, joining him at Bayern Munich. It's not super common, but does happen I think, particularly when the assistant role is higher up the football pyramid.",
                                    "score": 3,
                                    "author": "KarmaKarmaKarmeeleon"
                                },
                                {
                                    "level": 3,
                                    "comment": "Jason Tindall went from Eddie Howe’s assistant to managing Bournemouth for 1 year, got sacked, and then went back to being Howe’s assistant",
                                    "score": 2,
                                    "author": "Lambchops_Legion"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As a Miami local I will say he’s the best man manager I’ve ever seen coach. Knows exactly what each player needs, literally phenomenal working young players into the team and letting them have some freedom and personality. Also knows how to work with big players and get them motivated. Benched an overweight underperforming higuain last season and convinced him to lose weight and become our best player\n\nTactics 100% he still needs to improve. But he’s fantastic working with all kinds of personalities and getting them to bond and work together as a team. Perfect fit for part of an up and coming national team",
                    "score": 13,
                    "author": "zelli197"
                },
                {
                    "level": 1,
                    "comment": "That's because we've conflated the roles of coach and manager. \n\nManagers are typically statesman like figures that take the arrows in the press or handle the dynamics of groups first and foremost. Some people can't handle that responsibility, but can program in the ideas of football into a group.",
                    "score": 13,
                    "author": "KHeneage_NYCFC"
                },
                {
                    "level": 1,
                    "comment": "Well-respected, articulate former international footballer who has played at the highest level and won almost everything there is to win. Maybe as a manager he doesn't have what it takes to get a team winning consistently, but as a middling international team, Canada could do a lot worse than him",
                    "score": 32,
                    "author": "TheDrySkinOnYourKnee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’re thinking of his brother Gary, but yeah Phil nonetheless played at the very top for over a decade with Everton. Not a good manager but maybe he’s a good first team coach who can help inspire the players and improve their defensive work",
                            "score": -1,
                            "author": "yaya_tourettes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No I’m not. You do know that Phil Neville was at Man Utd before he went to Everton, right? He won multiple PLs and a treble while being a solid squad player. He was seen as more talented of the two brothers as well, but Gary just had more of a drive and ambition.",
                                    "score": 11,
                                    "author": "TheDrySkinOnYourKnee",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oooof i totally missed that one, my bad!",
                                            "score": 1,
                                            "author": "yaya_tourettes"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s easy to hate on him because he has undoubtedly benefited from nepotism when getting his main gigs, but him now going back to coaching is a very different gig. I don’t know what people expect him to do, just retire?",
                    "score": 21,
                    "author": "SorryIGotBadNews",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "think you should re-read the comment you're replying to",
                            "score": -12,
                            "author": "Schnix",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "His comment makes perfect sense? He's got this job because it's not a prestigious one like being the manager. He's just part of the coaching staff.",
                                    "score": 11,
                                    "author": "CymruGolfMadrid",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It doesn't make sense as a reply to the original post, no. The OP questioned why Neville gets hired and the response was acting as if he was questioning why Neville seeking employment.",
                                            "score": -17,
                                            "author": "Schnix",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He literally said coaching is a different gig to being a manager? Also said nepotism was the main factor in the past too. So yes, it does make sense.",
                                                    "score": 10,
                                                    "author": "CymruGolfMadrid"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I get it's fun to hate on some people but pretending like Phil Neville is so shit that he isn't even worth consideration for the men's Canadian NT assistant position is quite an exaggeration",
            "score": 65,
            "author": "AvikHyp3",
            "replies": [
                {
                    "level": 1,
                    "comment": "I count myself among the biggest Phil Neville haters on r/soccer but even I don’t get the reaction. He’s a mid-level national team’s assistant coach, that’s basically a part time job. If he was named the manager that would be way different.",
                    "score": 25,
                    "author": "Rc5tr0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because we’d rather give the opportunity to a young Canadian rather than to a failed foreign manager who only got to where he is post-retirement because of his name. This is the same organization that took a paycut from its olympic winning women’s team stating there wasn’t enough money to go around…",
                            "score": 4,
                            "author": "DatGuyYouKnow01",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If his appointment prevents them from hiring a young Canadian coach then I can understand that. But it’s not like there’s a limit on how many assistants you can have. And I can’t imagine he’s making *that* much to set out cones in training a few weeks per year.",
                                    "score": 5,
                                    "author": "Rc5tr0"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "oh brother, this guy stinks!",
            "score": 6,
            "author": "churrosricos"
        },
        {
            "level": 0,
            "comment": "Canada outjerking MLS",
            "score": 14,
            "author": "MultiGoat"
        },
        {
            "level": 0,
            "comment": "Should stay as TV commentator - bellend only, coaching isn't for him",
            "score": 4,
            "author": "RestaurantFeisty541",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nah, he should stay in coaching. For life.",
                    "score": 4,
                    "author": "TurnCruyff"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wtf why",
            "score": 1,
            "author": "CoolstorySteve",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am Canadian but let's be real, we are still around a top 50 country in the world in football which potential to grow. We aren't out there getting Getting someone like Neville with his experience inside national programs and managerial background in an **assistant** role is a good hire. Tons of shitty managers/head coaches in every sport end up being good assistants.",
                    "score": 17,
                    "author": "PMMeYourCouplets"
                },
                {
                    "level": 1,
                    "comment": "Board of directors are a bunch of amateurs. Canada has had recent success in spite of them, not because of them.\n\n\nWouldn’t be surprised if one of them was a fan of Man United and hired solely based on the fact Neville was one of their favourite players",
                    "score": 19,
                    "author": "DatGuyYouKnow01",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Only to find out Phil Neville turns up.  Was a fan of Tracey Neville",
                            "score": 3,
                            "author": "d_smogh"
                        },
                        {
                            "level": 2,
                            "comment": "You don’t realize how corrupt Soccer Canada is until you try to volunteer at grassroots programs",
                            "score": 3,
                            "author": "MileZero17"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Guaranteed to be at the next world cup",
                    "score": 1,
                    "author": "A_StarshipTrooper"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hahahahahahhahah",
            "score": 0,
            "author": "[deleted]"
        }
    ]
}