{
    "id": "145ayk4",
    "score": 98,
    "title": "[La Pizarra del DT] Kendry Paez will not be with Ecuador for the next FIFA matchday because he does not have the visa to enter the U.S. The expectation to see his talent at the highest level is still alive and well.",
    "author": "static_reset",
    "date": 1686330733.0,
    "url": "https://www.reddit.com/r/soccer/comments/145ayk4",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Well that's bad luck.\n\nAnd a pretty funny translation.",
            "score": 38,
            "author": "hipcheck23",
            "replies": [
                {
                    "level": 1,
                    "comment": "translators getting better sucks because mismatched translations occasionally post some real flowery language that i just appreciate, especially spanish to english",
                    "score": 10,
                    "author": "Animastarara",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Were you around for the early days of web translation? There was a niche hobby that I loved of taking a phrase, translating it into another language, and then back into the original (or continuing to pass it on to another language before returning it back to English), and you'd get some almost nonsensical hilarity.",
                            "score": 5,
                            "author": "hipcheck23"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "He's 16, he'll get his chance. This gives Felix Sanchez a chance to focus on and try out other players who can fill some desperately needed gaps in the national team, Campana at striker and Vite as an attacking midfielder come to mind.",
            "score": 9,
            "author": "Montuvito_G"
        },
        {
            "level": 0,
            "comment": "Surely Boehly or Clearlake could ring someone here???",
            "score": 3,
            "author": "HonestOnslaught",
            "replies": [
                {
                    "level": 1,
                    "comment": "He's not a Chelsea player yet, not until 2025 at least.",
                    "score": 4,
                    "author": "Montuvito_G",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He is a Chelsea player. Just won't join us till hes 18. Kinda like Endrick and Real",
                            "score": -1,
                            "author": "Triangle-Yeeter"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "cant he go on a Tourist visa",
            "score": -6,
            "author": "kokukojuto33",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well it’s technically illegal to work on a tourist visa and his work would be pretty easy to prove lol.\n\nSecondly, from many countries getting a tourist visa into the USA is like a 6+ month process and many are denied.\n\nSource: my ex was colombian and her parents tried to get visas to come visit us. They were denied so we went down there instead.",
                    "score": 19,
                    "author": "GarfieldDaCat"
                },
                {
                    "level": 1,
                    "comment": "Even if he could, he wouldn't be able to play, as that would ensure he'd have a tough fight ever returning to US.",
                    "score": 3,
                    "author": "deadraizer"
                }
            ]
        }
    ]
}