{
    "id": "146603q",
    "score": 3306,
    "title": "[TalkSport] BREAKING: Alex Oxlade-Chamberlain is on the verge of completing a free transfer to Aston Villa.",
    "author": "Hokage123456789",
    "date": 1686418191.0,
    "url": "https://www.reddit.com/r/soccer/comments/146603q",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "\nTo reduce the spam of reports regarding the same move during transfer windows we try to allow **only one submission about each transfer saga per day**. The submission in question also needs to contain relevant new information regarding the potential move, and not just being a \"no/minor developments\" report.   \n\nIf there are important/official developments or new valuable information about a saga, we will allow extra threads in the same day, but for the rest of minor news please just comment them as a reply to this comment. Please help us reporting unnecessary threads for being duplicates. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/soccer) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Much needed depth. Our only midfield option last season if one of Luiz/Ramsey/McGinn/Kamara got injured was Dendoncker.",
            "score": 925,
            "author": "GameplayerStu",
            "replies": [
                {
                    "level": 1,
                    "comment": "tbf dendoncker was ok in the league for us. just forget him in the cup tho :D",
                    "score": 276,
                    "author": "ThrownVeryFarAway789",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh no, I'm not saying Dendoncker was shit by any means. But he was literally our only back up midfield option lmao",
                            "score": 144,
                            "author": "GameplayerStu"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He is great depth...if he's ever fit...and he's never fit.",
                    "score": 454,
                    "author": "TheGoldenPineapples",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hasn't actually been injured for a huge amount of the last two years.",
                            "score": 149,
                            "author": "GdotKdot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Correct. He was actually fit most of last season, just out of favour.",
                                    "score": 324,
                                    "author": "HUGE_HOG",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Do you think him not being chosen to play has something to do with him not being injured though?",
                                            "score": 102,
                                            "author": "Anglan",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I've found that he was chosen to play more often when he was not injured.",
                                                    "score": 68,
                                                    "author": "cluboriginal2",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "True if big.",
                                                            "score": 19,
                                                            "author": "Pejob"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Him not being chosen to play was because he wasn't doing enough when he did. He just never returned to the heights that he reached in the season when he was a starter over basically everyone else in midfield.",
                                                    "score": 2,
                                                    "author": "FakeCatzz"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Can't get hurt if you never play",
                                            "score": 28,
                                            "author": "losenota_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Naby Keita would like a word.",
                                                    "score": 60,
                                                    "author": "IAmIrritatedAMA",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Didn't Pogba get a long term injury taking free kicks in training?",
                                                            "score": 7,
                                                            "author": "Acceptable-Lemon-748",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Naby got “sick” and was unavailable because of the lack of AC on a plane to an away CL match.",
                                                                    "score": 7,
                                                                    "author": "fancysauce_boss",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Wasn't that a neck injury for a preseason game caused by the Aircon blowing on him on the plane? Or has he had multiple Aircon related injuries",
                                                                            "score": 2,
                                                                            "author": "BankDetails1234"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Not gonna get injured from sitting on the bench.",
                                    "score": 46,
                                    "author": "Heblas",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You'd be surprised. Just surviving a training session with only one of Keita, Thiago, and Ox being getting injured was a relief.",
                                            "score": 80,
                                            "author": "WorthPlease",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Milner is such an obvious vampire.  I don't understand how he keeps getting away with it.",
                                                    "score": 30,
                                                    "author": "arbuthnot-lane",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "He's an energy vampire!",
                                                            "score": 0,
                                                            "author": "broken_neck_broken",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Prolly got some much needed recovery in that time if he was active in training which he prolly woulda been under Klopp imo.",
                                            "score": 4,
                                            "author": "KimKongtheIllest",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He's been injury free one season out of the last eleven, and that season he only played about 1400 minutes. I don't think he's getting over his injury problems by resting.",
                                                    "score": 12,
                                                    "author": "Heblas",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Eh, ur prolly right but I'm convinced a lot of these recurring injuries happen from incomplete recovery, followed by too quick a return but I'm basing that on literally 0 evidence tbf.",
                                                            "score": 1,
                                                            "author": "KimKongtheIllest"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Get the physio! I’ve done me coccyx!!!",
                                            "score": 1,
                                            "author": "RuairiQ"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Jokes on u martial managed to get injured listening to eth speech",
                                            "score": 1,
                                            "author": "Aggressive-Theory609"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "splinters on your ass from sitting on the bench too long..",
                                            "score": 1,
                                            "author": "onlyjeffjarrettfan"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah he just hasn't been picked because he's not very good anymore. Some people talk about this guy like it's 2017 still. Maybe a move will revitalise him. Probably not though",
                                    "score": 5,
                                    "author": "legentofreddit"
                                },
                                {
                                    "level": 3,
                                    "comment": "I mean…he’s barely played in the last two years. How exactly could he get injured?",
                                    "score": 2,
                                    "author": "hopscotch1818282819"
                                },
                                {
                                    "level": 3,
                                    "comment": "Was injured for 3 months this season and played like 300 minutes to get that injury. Reason he hasn't had more injuries is because he was crap when he did play so kept him on the bench.",
                                    "score": 1,
                                    "author": "CymruGolfMadrid"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Big IF. Shame his injury record has taken over his latter part of his career, he showed some great potential at Arsenal.",
                            "score": 1,
                            "author": "FoxOntheRun99"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "you're after depth to cover injury and you bought ox?",
                    "score": 62,
                    "author": "ydktbh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well he’ll most likely be on the bench and come on for some minutes. Can’t get injured if his minutes are low right… right? Hahaha",
                            "score": 16,
                            "author": "Intentionallyabadger",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Go figure out why Liverpool kept playing Morton and Bajcetic in the last 2 seasons. ¯\\\\\\_(ツ)\\_/¯",
                                    "score": 3,
                                    "author": "BrowakisFaragun",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We played Bajcetic because he's fucking insane",
                                            "score": 6,
                                            "author": "Ollietron3000"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He provides the injured players with company",
                            "score": 1,
                            "author": "Rulweylan"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We thought he would be good depth as well.",
                    "score": 16,
                    "author": "Mezzwayt"
                },
                {
                    "level": 1,
                    "comment": "Depth? He’ll probably be fit for 2 games in the season. Injury prone and massively declined the last two years. I don’t understand how these players still get big moves",
                    "score": 8,
                    "author": "PEPSICOLA123456",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Free transfer, and English (Homegrown). So if the contract is performance-related (surely it is), then it's pretty low risk with a potentially high up-side.",
                            "score": 2,
                            "author": "giantshortfacedbear"
                        },
                        {
                            "level": 2,
                            "comment": "Some people may think it has to do with the medical staff, doubly so if there are multiple injury probe players at the same team.",
                            "score": 1,
                            "author": "cube_mine",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ox missed a lot of football through injury at Arsenal as well, he's just injury prone.",
                                    "score": 4,
                                    "author": "GlasgowSellik1888"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's not depth if he's injured 24/7, though?",
                    "score": 9,
                    "author": "Bloddersz"
                },
                {
                    "level": 1,
                    "comment": "Bench gonna be looking stacked for that conference league run lmao.",
                    "score": 2,
                    "author": "Rickcampbell98"
                },
                {
                    "level": 1,
                    "comment": "The Ox doesn't count as depth.",
                    "score": 2,
                    "author": "TheOnionWatch"
                },
                {
                    "level": 1,
                    "comment": "You forget that ox is someone who needs a backup for 80% of the season",
                    "score": 1,
                    "author": "greater_gatsby12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mr. Emery is getting the band back together",
            "score": 1358,
            "author": "22goblins",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know it’s a joke, but he never managed him",
                    "score": 599,
                    "author": "DVPC4",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Mate he's obviously talking about the iconic reunion of [Ox and Coutinho](https://www.joe.co.uk/uploads/2017/12/17193041/Screen-Shot-2017-12-17-at-19.09.39.png?height=386&amp;width=647).",
                            "score": 253,
                            "author": "TheLimeyLemmon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Coutinho in that image looks like one of those rage face dudes",
                                    "score": 26,
                                    "author": "CFCkyle"
                                },
                                {
                                    "level": 3,
                                    "comment": "You love to see it",
                                    "score": 36,
                                    "author": "borg_6s",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I for one had no clue this existed",
                                            "score": 2,
                                            "author": "EstebanL"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Wenger is joining as assistant coach.",
                            "score": 192,
                            "author": "tr_24",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You shut your whore mouth!",
                                    "score": 112,
                                    "author": "TheGoldenPineapples",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Assistant TO the coach",
                                            "score": 45,
                                            "author": "SnooCrickets6733"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Its crazy that thats the case, in the back of myind i just assumed",
                            "score": 4,
                            "author": "22goblins"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wilshere will be the next one going there, followed by Walcott and giroud",
                    "score": 26,
                    "author": "ravadelie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What's Aaron Ramsey up to these days?",
                            "score": 9,
                            "author": "ThereIsBearCum",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Been at Middlesbrough on loan",
                                    "score": 6,
                                    "author": "Jimoiseau"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Villa must have state of the art wheelchairs if he's choosing them",
            "score": 609,
            "author": "GomeyGoblin",
            "replies": [
                {
                    "level": 1,
                    "comment": "They have Queen Elizabeth Research Hospital there, they will fix everything",
                    "score": 165,
                    "author": "boldstrategy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, they did Eduardo's ankle after that horror tackle.",
                            "score": 42,
                            "author": "BaBaFiCo"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "To be fair, he was fit most of this last season, Klopp just stopped using him.",
                    "score": 24,
                    "author": "ginopalladino",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "True. I'm excited for him and Villa if he stays fit. He is a great talent and can be a game changer,  just never really found a place here (no thanks to injuries).\n\nLove the guy and feel like we're losing a lot of our fun players (as in whimsical off the pitch). Firmino, Chamberlain, possibly Matip (?), Milner. \n\nJust basing that off of interactions I've seen with what I've seen behind the scenes. I'm sure there's still great chemistry and bonds betweens players and their families, those few just stuck out a bit for me.",
                            "score": 6,
                            "author": "PalPubPull"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He should ask Coutinho",
                    "score": 17,
                    "author": "OliverAM16"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Grabbing Tielemans and Ox, smart moves, both for free",
            "score": 406,
            "author": "longsh0t1994",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fit Ox sure, but does a fit Ox exist?",
                    "score": 254,
                    "author": "quickestred",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Did a fit Ox ever truly exist?",
                            "score": 142,
                            "author": "Akira_Nishiki",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "17/18 season he was amazing for like 3/4s of the season, but your point stands",
                                    "score": 134,
                                    "author": "ShiPaTown",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "For 1/2 of the season at best. He started playing in November and got injured in April. That’s all we got out of Ox in how many ever years he was with the club.",
                                            "score": 34,
                                            "author": "Any_Ingenuity_4390",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He was important to us in the 19/20 title winning season, great in the CL group stages as well, and filled in decently enough in the 21/22 season.",
                                                    "score": 55,
                                                    "author": "Ymir-Reiss"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yea a great 5 month period, 5 years ago. He's done",
                                            "score": -4,
                                            "author": "Happytohelp87"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I believe it is a mythical creature, the fit ox",
                                    "score": 15,
                                    "author": "quickestred",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You should’ve seen the one I saw at the farm yesterday",
                                            "score": 3,
                                            "author": "SnottyTash"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Anyway, $4 a pound.",
                                    "score": 4,
                                    "author": "AnotherThrow2023"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Missed 0 games the season before last through injury. Just not good enough for us anymore.",
                            "score": 3,
                            "author": "AJLFC94"
                        },
                        {
                            "level": 2,
                            "comment": "we shall see! I hope so, for him and AV",
                            "score": 2,
                            "author": "longsh0t1994"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How is Ox a smart move? You’re getting an injury prone player who is way past his best and hasn’t played well for more than 2 years. Just because he’s free doesn’t mean that villa aren’t paying his wages + signing bonus. Unless it’s a 2 year deal I think it’s a really poor transfer for villa.",
                    "score": 80,
                    "author": "Any_Ingenuity_4390",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm apprehensive about it but he's not going to be required to play week in week out for us (if it happens). Cup games and injury cover at most I'd guess.\n\nWe also have Tielemans now, and with us in for wingers Ramsey, McGinn etc can also cover a lot of the midfield so we're not pinning all of our back up hopes on an injury prone player. \n\nIf it does go through though we'd have a midfield selection of Douglas Luiz, Kamara, Tielemans, McGinn, Ramsey and Oxlade-Chamberlain - all for a combined transfer cost of £18m. Pretty crazy.",
                            "score": 18,
                            "author": "Anglan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;If it does go through though we'd have a midfield selection of Douglas Luiz, Kamara, Tielemans, McGinn, Ramsey and Oxlade-Chamberlain - all for a combined transfer cost of £18m\n\na lot of these are on free transfers, what wages are they on?",
                                    "score": 8,
                                    "author": "momspaghetty",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Kamara is on 120k I believe because of his free transfer. Not sure on the rest but Luiz + McGinn are on new deals as of last season",
                                            "score": 2,
                                            "author": "ziggylcd12"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Always naive to think that injury prone players can act as injury cover.\n\nYour mind says even if he’s only fit for 15 games a season it’s good injury cover, but there’s no guarantee that the 15 games you’ll need him for are the ones he’ll be fit for",
                                    "score": 5,
                                    "author": "Stirlingblue"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I reckon these professional scouts and coaches know a bit more and have access to more info than we do. He is a free transfer, with lots of experience at a top club, it's worth a bet for a club like AV",
                            "score": -9,
                            "author": "longsh0t1994",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well, yeah? That's their job. Doesn't mean they can't make mistakes though.",
                                    "score": 21,
                                    "author": "BocatFan",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah, clubs with professional scouts and coaches never make mistakes.",
                                    "score": 26,
                                    "author": "WorthPlease",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "An yes, because clubs never make bad signings.",
                                    "score": 4,
                                    "author": "hopscotch1818282819",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "that's like saying you know more than doctors because doctors make mistakes sometimes. nice strawman lol",
                                            "score": 1,
                                            "author": "longsh0t1994"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah which is why you see signings like Pepe, antony, Werghorst and maguire lol",
                                    "score": 8,
                                    "author": "Lanesra99",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "ah yes because mistakes can't be made or things always must work out simply to acknowledge they know more than us? nice lol",
                                            "score": 1,
                                            "author": "longsh0t1994"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No one would be saying Ox is a smart move if it was West Ham or Everton signing him.",
                    "score": 24,
                    "author": "NobleForEngland_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "lol that's such a weird argument",
                            "score": 1,
                            "author": "longsh0t1994"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow, didn’t expect Villa for him. Good luck Ox.",
            "score": 69,
            "author": "SuggestionExtension9",
            "replies": [
                {
                    "level": 1,
                    "comment": "He will be good backup doubt he will start much",
                    "score": 1,
                    "author": "Joshvir262"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How has he managed a contract with a premier league club? Wow",
            "score": 208,
            "author": "HaroldIcaza",
            "replies": [
                {
                    "level": 1,
                    "comment": "He joined Arsenal the same year Phil Jones joined United, and Jones is technically still there(until the end of the month), never left, not even on loan. Let that sink in",
                    "score": 98,
                    "author": "Ainsley-Sorsby",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Jones leeched off united for years",
                            "score": -37,
                            "author": "ireallydespiseyouall",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No he didn't \n\nI wish that man the best",
                                    "score": 25,
                                    "author": "Zdeneksfilter"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "How did Jones not get a testimonial for his loyal service?",
                            "score": 1,
                            "author": "silent--onomatopoeia"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Why would he not? \n\nHe's not been injured much over the past two years and when he's played he's been passable with some decent performances mixed in.",
                    "score": 36,
                    "author": "dj4y_94"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Villa media department crying tears of joy",
            "score": 28,
            "author": "redditaccountplease",
            "replies": [
                {
                    "level": 1,
                    "comment": "Villa medical department crying tears of sorrow",
                    "score": 16,
                    "author": "XHeraclitusX",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Job security isn't something to cry about",
                            "score": 16,
                            "author": "redditaccountplease",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Teams will always have medics, better to be chilling on the bench watching games instead of doing physio work on Ox all season.",
                                    "score": 2,
                                    "author": "XHeraclitusX"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ox is constantly injured whats the point of signing him",
            "score": 122,
            "author": "Dio_my_senpai",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think that's an exaggeration. His availability post-ACL in 2018 would surprise a lot of people.\n\nThe bigger problem for Ox was getting the minutes after such a long absence. Our midfield had fully transitioned and he could never cement a place in the squad outside of late sub appearances.\n\nHe is however a solid squad player who never made a stink about it. If Villa just need someone for occasional cover and cup appearances, there's really no harm.",
                    "score": 117,
                    "author": "TheLimeyLemmon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; I think that's an exaggeration. His availability post-ACL in 2018 would surprise a lot of people.\n\nPeople often exaggerate the shit out of injury prone players. Saw someone the other day say 'Kante has barely played the last four seasons.'\n\nSure, if averaging 32 games a season over the last four seasons counts as 'barely playing,' then yeah. Take away the 22/23 season and he's averaged 40 games a season.",
                            "score": 75,
                            "author": "MattSR30",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They were exaggerating the time frame (4 years) because people have short term memories.\n\nThey weren’t exaggerating his lack of recent availability though because tbf he only played 9 times in all comps last season, which is a big blow at 32 for a player whose movement is a big part of what made them great",
                                    "score": 10,
                                    "author": "ThrowerWayACount"
                                },
                                {
                                    "level": 3,
                                    "comment": "Love to see someone with knowledge and a competent mind",
                                    "score": 15,
                                    "author": "PapaKloppssmile"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Says a lot though that with your much publishes centre mid issues he’s still barely getting a look in even when fit.\n\nI was really jealous when you signed him as he has all the tools to be great but really not sure what level he’s at anymore",
                            "score": 1,
                            "author": "Stirlingblue"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Back up for the back up",
                    "score": 7,
                    "author": "jon04"
                },
                {
                    "level": 1,
                    "comment": "Ox has been fit and available the past 2 seasons just that he has not been the required standard for Klopp so spent a good chunk of it on the bench",
                    "score": 6,
                    "author": "McQueensbury",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He was injured for three months this season.",
                            "score": 5,
                            "author": "Heblas"
                        },
                        {
                            "level": 2,
                            "comment": "He was injured for 3 months this season and barely played to get that injury. Tells you all you need to know about his fitness.",
                            "score": 8,
                            "author": "CymruGolfMadrid"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tielemans I like alot. Ox, not for me at all. I trust emery and if he sees something in him then by all means but I don't like it at all",
            "score": 35,
            "author": "bambinoquinn",
            "replies": [
                {
                    "level": 1,
                    "comment": "Both bad signings tbh",
                    "score": -25,
                    "author": "Beastbrook00",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In no world can Tielemens be seen as a bad signing, he’s CL standard if you play to his strengths",
                            "score": 8,
                            "author": "Stirlingblue",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Weird he was at Liverpool from age 23 to 29 and I legitimately feel like he could've never played there at all. Whole prime of a career just passed by through injuries.",
            "score": 5,
            "author": "BeneficialVacation41"
        },
        {
            "level": 0,
            "comment": "Villa on maneuvers today",
            "score": 4,
            "author": "nolesfan2011"
        },
        {
            "level": 0,
            "comment": "Still have ptsd from his goal against us.",
            "score": 7,
            "author": "JustJamesanity"
        },
        {
            "level": 0,
            "comment": "Truly inexplicable if he's getting another Premier League contract.",
            "score": 39,
            "author": "theglasscase",
            "replies": [
                {
                    "level": 1,
                    "comment": "The physios/medical team must not be busy at villa",
                    "score": 18,
                    "author": "onlyjeffjarrettfan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or they're taking on a few young trainees and need someone to experiment on.",
                            "score": 4,
                            "author": "theglasscase"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Enjoy paying him £100k a week for five games a season",
            "score": 24,
            "author": "AdministrativeLaugh2",
            "replies": [
                {
                    "level": 1,
                    "comment": "We’re a well run club we don’t give big contracts to people who don’t deserve it. He’ll be on 50/60k a week.",
                    "score": -16,
                    "author": "Ichooseyoudragonite",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Digne and ings were two of our highest paid players.",
                            "score": 18,
                            "author": "bambinoquinn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ings got sold, and dinge I expect him to be sold too. Those were Gerrard not the club.",
                                    "score": -13,
                                    "author": "Ichooseyoudragonite",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Gerrard ain't sitting down and doing wages with a player. It would have been lange. I think we are generally well run, but we've still thrown out daft contracts at times",
                                            "score": 29,
                                            "author": "bambinoquinn",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Mate you’re talking about two signing out of dozens. We’re are a well operated club. One or two times doesn’t change that.",
                                                    "score": -12,
                                                    "author": "Ichooseyoudragonite",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Mate you only scraped through FFP because you sold your stadium and got a mega fee for Grealish, massive stretch to claim that you’re well run.\n\nYou’ve also got quite a few players on around 100k a week - to think you’re not pushing out big wages for a free transfer is stupid. Bet he’s on at least 90k a week",
                                                            "score": 4,
                                                            "author": "Stirlingblue",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Everton fan talk about ffp relax mate you’re circling the drain. Our ceo made the ffp rules. We know how to be compliant unlike Everton.",
                                                                    "score": 1,
                                                                    "author": "Ichooseyoudragonite"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Villa might as well recruit a new physio while you they are at it.",
            "score": 11,
            "author": "Zizouhimovic"
        },
        {
            "level": 0,
            "comment": "What a weird signing for Villa. Reminds me of Everton/West Ham signings of old (signing an injury prone player from a bigger club).",
            "score": 8,
            "author": "BodySlam9",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fits tactically, Ox looks the right profile for a 442 wide mid. Health the big question, but he’s an awkward fit in a 433. If the wages are low or health based, I like it.",
                    "score": 2,
                    "author": "DrLyleEvans"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Depth for McGinn nice",
            "score": 3,
            "author": "Financial_Anything43"
        },
        {
            "level": 0,
            "comment": "I really hope he can get a consistent run without injury. He always had the potential to be a class player.",
            "score": 3,
            "author": "overcooked_biscuit",
            "replies": [
                {
                    "level": 1,
                    "comment": "He genuinely hit world class at Liverpool for a few months until that first injury. After Coutinho left he was part of the new Fab Four. He should have been in the history books alongside Mo, Sadio, and Bobby but injuries robbed him of it. Could really have done with him for the World Cup that summer too. What could have been, eh?",
                    "score": 1,
                    "author": "not_a_morning_person"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Big fan of AOC",
            "score": 3,
            "author": "Hot-Afternoon168",
            "replies": [
                {
                    "level": 1,
                    "comment": "She does have her perks.",
                    "score": 3,
                    "author": "RetiredPenguin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Villa really do move in silence",
            "score": 8,
            "author": "TakeCareInUrDreamin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Starting to worry that I'll wake up one morning to find myself holding a Villa shirt up to the camera",
                    "score": 29,
                    "author": "Dorgilo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dorgilo sounds like some super obscure South American talent as well!",
                            "score": 5,
                            "author": "BigfatDan1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Villa would be smart of they gave salary with low base and enough performance related bonuses. Otherwise they will be left with paying English man taxes and would be better if they took the same chance on good players from other  league players who might cost less than him",
            "score": 6,
            "author": "Coolhunter11"
        },
        {
            "level": 0,
            "comment": "Championship player",
            "score": 8,
            "author": "greezyo"
        },
        {
            "level": 0,
            "comment": "He'll be crucial for Carabao Cup",
            "score": 2,
            "author": "CoaxHoax"
        },
        {
            "level": 0,
            "comment": "I cant see him staying fit enough tho make an imprint on Emery, sorry. And I guess these 2 signings means no Lo Celso as well then, will probably get a chance as an 8 with Ange then.",
            "score": 2,
            "author": "neandertales"
        },
        {
            "level": 0,
            "comment": "Great mascot!",
            "score": 2,
            "author": "anagramorganic"
        },
        {
            "level": 0,
            "comment": "Emery is about to either turn Ox into a world-ender or experience the same as Kloppo. There really is no mid outcome from this situation.",
            "score": 2,
            "author": "Cult_0f_Personality"
        },
        {
            "level": 0,
            "comment": "No doubt he’ll play week in week out with a medical team which doesn’t have a gypsy curse on them",
            "score": 3,
            "author": "DoctorDremian"
        },
        {
            "level": 0,
            "comment": "he's no longer relevant enough to warrant a headline that includes BREAKING",
            "score": 4,
            "author": "TimingEzaBitch"
        },
        {
            "level": 0,
            "comment": "Villa grabbing all the frees. Really pulling a Barcelona recently.",
            "score": 3,
            "author": "Comrade-Conrad-4",
            "replies": [
                {
                    "level": 1,
                    "comment": "I guess that's one way to challenge the elite with FFP existing.\n\nI imagine there will be clubs trying this more in the future if running out contracts becomes more common.",
                    "score": 3,
                    "author": "AxFairy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great player when he's fully fit. Which isn't often",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great 🤨",
                    "score": 4,
                    "author": "holonight"
                },
                {
                    "level": 1,
                    "comment": "Not a great player tho is he, he's been fit but hardly had a kick",
                    "score": 5,
                    "author": "Beastbrook00"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Villa's not messing around today, would be another good signing",
            "score": 1,
            "author": "andreew10"
        },
        {
            "level": 0,
            "comment": "Villa's not messing around, Gallagher next?",
            "score": 1,
            "author": "Cowdude179"
        },
        {
            "level": 0,
            "comment": "He hasn’t been injured much the last 2 seasons, just doesn’t fit how we play anymore. I wish him lots of luck at villa and think he’ll do well when given the opportunity",
            "score": 1,
            "author": "Old_Medicine2229",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;He hasn’t been injured much the last 2 seasons,\n\nBecause he hasn't being playing much the last two seasons. As soon as he plays he gets injured and he's out the majority of the season.",
                    "score": 2,
                    "author": "XHeraclitusX"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "When was the last time he had a run of games as a starter for Liverpool? There's absolutely no evidence of him still having it.",
                    "score": 1,
                    "author": "theglasscase",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pretty sure it's as far back as 19/20.  Never seen a player ride two goals as much as he did with the two goals against City in 17/18.",
                            "score": 3,
                            "author": "CT_x",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; Pretty sure it's as far back as 19/20.\n\nIt was 21/22 especially around AFCON when he chipped in with a couple of vital goals and played pretty fucking well.",
                                    "score": 1,
                                    "author": "AgentTasker"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They’ve been cleaning up a ton of free transfers the last few years it feels like",
            "score": 1,
            "author": "Andy-Is-Hot"
        },
        {
            "level": 0,
            "comment": "so happy to see him go to unai’s team.  would really love to see him get back to some sort of regular play in the prem.",
            "score": 1,
            "author": "caulpain"
        },
        {
            "level": 0,
            "comment": "Is he the best midfielder in the world? No. Is he a solid substitute? Sure. Has he been injured before? Yes. Did he ever make a stink about not getting back in the team? No, far from it. It’s a free transfer and he’s likely not on huge wages. Don’t see the harm here; seems a smart bit of business.",
            "score": 1,
            "author": "Orthancapolis"
        },
        {
            "level": 0,
            "comment": "I thought Liverpool will be hesitant to let more homegrown players go? Are they promoting some youngsters?",
            "score": 0,
            "author": "Ceassar",
            "replies": [
                {
                    "level": 1,
                    "comment": "He played a grand total of 334 mins in the league for us this season. There was absolutely no way we were going to extend his contract.",
                    "score": 17,
                    "author": "Jacob_YNWA",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The fact that he scored this season is wild to me",
                            "score": 5,
                            "author": "doubleoeck1234"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Contract has ended, plus his injury record means he's hardly ever available, not to mention he's no longer the player he was 3-4 years ago.",
                    "score": 8,
                    "author": "Ha-Ur-Ra-Sa"
                },
                {
                    "level": 1,
                    "comment": "he was on fairly big wages iirc",
                    "score": 9,
                    "author": "ioniums"
                },
                {
                    "level": 1,
                    "comment": "We need to free up some wages also he's injured every 5 seconds",
                    "score": 5,
                    "author": "doubleoeck1234"
                },
                {
                    "level": 1,
                    "comment": "Curtis Jones will move from List B to List A (or U21 to regular squad) next season so he’d take a free space in the homegrown list at least for UEFA competitions and the Prem",
                    "score": 3,
                    "author": "Zak369"
                },
                {
                    "level": 1,
                    "comment": "Ox is not worth having on the books because he's unavailable 70% of the time.\n\nRemember, HG players don't allow you to have more international players.  Really it's a limit on international players.  You're only allowed 17 and we have 15, including Adrian, who could very likely be not registered for the PL season.",
                    "score": 3,
                    "author": "rossmosh85",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "With him, Kelleher, and Milner all leaving, as well as Phillips most likely, is this something they have under control? Isn’t it also kind of a waste to keep Adrian and not just use that spot with an old or very young HG keeper? I thought for Europe they needed 8 with 4 being club trained?",
                            "score": 3,
                            "author": "Ceassar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think the whole thing is being a bit blown out of proportion.  Chelsea, Man City, and United have worse squad bloat than us with all sorts of players not being registered.\n\nThere are a lot of ways to handle the squad balance regarding international players vs HG vs exempt players due to age.  If someone like Adrian gets sacrificed, it's really not a big deal.",
                                    "score": 1,
                                    "author": "rossmosh85",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah that’s true. I just read about Liverpool and Manchester United in particular being cognizant of it so I wanted to ask.",
                                            "score": 1,
                                            "author": "Ceassar",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I think many were surprised by the Adrian extension, but hopefully the club has this under control. With Mac we now currently have 15 internationals, Henderson as association trained, and Trent, Curtis, Kelleher, Gomez, Phillips and a bunch youngsters who could qualify as club trained. Now the fan sentiment in general is that we should be looking at signing at least 2 more midfielders and a CB, and seeing as we are probably priced out of Mount, Bellingham and Rice transfers, I must admit I’m not quite sure how we can do it without a departure. The simplest way would have been to keep Kelleher or sign a HG keeper for 2nd choice as I’m sure we have at least one youth keeper ready to be 3rd choice, but now I would assume the plan is to look for suitors to Matip or Thiago, or postpone parts of the rebuild until next summer. I’m not certain what the best move is in this situation, but I’m sure the club will pull something off.",
                                    "score": 1,
                                    "author": "redditingtonviking"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hes played about 20 games since 2020.",
                    "score": 2,
                    "author": "GTACOD"
                },
                {
                    "level": 1,
                    "comment": "We already have u21 players that are firmly intergrated in the first team like Elliott and Bajcetic",
                    "score": 2,
                    "author": "Elliot_Kyouma"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wonder if this rules Villa out of signing Tyler Adams? I figured they might go after Adams as a Rice replacement.",
            "score": 0,
            "author": "barstoolLA",
            "replies": [
                {
                    "level": 1,
                    "comment": "Villa might replace West Ham's Declan Rice?",
                    "score": 2,
                    "author": "pyramid-teabag-song",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "lol. taking a lap",
                            "score": 4,
                            "author": "barstoolLA"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope he can get back into form. Seems like a great player but just hasn't played enough to really become a part of Liverpool after his injury.",
            "score": 1,
            "author": "Kopman"
        },
        {
            "level": 0,
            "comment": "Good squad signing if you get his contract cheap - maybe on a play/performance deal?",
            "score": 1,
            "author": "james2183"
        },
        {
            "level": 0,
            "comment": "Squad depth I assume which we are sorely missing. Can't see him getting close to the first team.",
            "score": 1,
            "author": "GuardianGundam"
        },
        {
            "level": 0,
            "comment": "Don’t actually think there’s any truth in this. \nBit like when they broke the news Maguire was joining us because he was playing golf at the belfry.",
            "score": 1,
            "author": "ApprehensiveTrust779"
        },
        {
            "level": 0,
            "comment": "Teenage mutant ninja turtle moves club",
            "score": 1,
            "author": "Cpt-Dreamer"
        },
        {
            "level": 0,
            "comment": "Interesting decision, and if he stays fit, a pretty sensible one. A great player on his day, and sad to see how it ended with us.",
            "score": 1,
            "author": "FridaysMan"
        },
        {
            "level": 0,
            "comment": "Ox had Nottingham Forrest written all over him. Better move than expected for sure.",
            "score": 1,
            "author": "jamjars222"
        },
        {
            "level": 0,
            "comment": "Aston Villa: I think we will have them all.",
            "score": 1,
            "author": "lucash7"
        },
        {
            "level": 0,
            "comment": "That’s a great signing if he can stay fit",
            "score": 1,
            "author": "OkAd1456",
            "replies": [
                {
                    "level": 1,
                    "comment": "This or a variation this sentence has been said about Ox for damn near a decade now.",
                    "score": 3,
                    "author": "lastjedi23"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fells like 15  years since he last played for Arsenal",
            "score": 1,
            "author": "AV15"
        },
        {
            "level": 0,
            "comment": "I kinda had a feeling he would sign for Villa.\n\nGreat move for both club and player.  As a Liverpool supporter he leaves with his head held high.",
            "score": 1,
            "author": "Jhushx"
        },
        {
            "level": 0,
            "comment": "I wish him the best, if he keeps clear of injuries maybe he can come back to his old form and help you lot.",
            "score": 1,
            "author": "frankserpico27"
        },
        {
            "level": 0,
            "comment": "Decent player the ox just seems to be made of fiberglass",
            "score": 1,
            "author": "ArtetaLegoHair"
        }
    ]
}