{
    "id": "146h8i8",
    "score": 66,
    "title": "Scenes in Ecuadorian Liga Pro: Técnico Universitario player Luzarraga headbutts a referee after receiving a red card",
    "author": "TheGTAone",
    "date": 1686447667.0,
    "url": "https://www.reddit.com/r/soccer/comments/146h8i8",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "**Mirrors / Alternative Angles** \n  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/soccer) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "If my linesman isn’t right there to pull up, I don’t want them on the touch line.",
            "score": 18,
            "author": "Writerhaha"
        },
        {
            "level": 0,
            "comment": "La LigaPro tiene que actuar de forma urgente, esta huevada es para sancion de media temporada MINIMO",
            "score": 18,
            "author": "Montuvito_G",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lo peor de todo es que el presidente Loor unas horas después, creo que ni enterado aún, se le ocurre publicar [esto](https://twitter.com/miguelloor/status/1667694529263308800) jajaja",
                    "score": 7,
                    "author": "TheGTAone"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What's the red for, did he shoulder barge the ref when they were running back after the hand ball appeals?",
            "score": 6,
            "author": "GinValid",
            "replies": [
                {
                    "level": 1,
                    "comment": "From what I heard from the pundits the player shouted something to the ref\n\nEdit and also ran into the ref after shouting before being sent off and giving the headbutt",
                    "score": 18,
                    "author": "manualex16"
                }
            ]
        },
        {
            "level": 0,
            "comment": "lmao. what the heck",
            "score": 9,
            "author": "xI-Red-Ix"
        },
        {
            "level": 0,
            "comment": "Clear hand missed. Plus that player deserved 2 red cards. Lengthy ban",
            "score": 2,
            "author": "MultiGoat"
        },
        {
            "level": 0,
            "comment": "ban forever surely?",
            "score": 1,
            "author": "Athletic_Bilbae"
        },
        {
            "level": 0,
            "comment": "That’s crazy man. I don’t understand how you’re a professional football player getting paid well above what the rest of the country earns and because their might have been a bad call, you barge into the referree, head butt him and hurled an insult as well lol get fucked, ima be on the lookout for that ban.",
            "score": 1,
            "author": "jonhgary"
        },
        {
            "level": 0,
            "comment": "“Headbutt” feels like a massive stretch here.\n\nPlayer definitely at fault and can’t be doing that but this whole thing is made way worse by the referee",
            "score": -5,
            "author": "Stirlingblue",
            "replies": [
                {
                    "level": 1,
                    "comment": "His head was in a forward position with a clear intention of contact, regardless of lack of neck thrust. Its still a headbutt",
                    "score": 0,
                    "author": "KerbHunter"
                }
            ]
        }
    ]
}