{
    "id": "146uagh",
    "score": 2909,
    "title": "Alphonso Davies: \"Barcelona approached me but their president (Bartomeu), didn't want me because I'm from Canada. I won't lie, it kind of crushed my feelings - tho this is what came out in the media, I don’t know if their president actually said this.\"",
    "author": "mynamestartswithCa",
    "date": 1686491023.0,
    "url": "https://www.reddit.com/r/soccer/comments/146uagh",
    "media_urls": [
        "https://v.redd.it/epa5oxmj7e5b1"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "**Mirrors / Alternative Angles** \n  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/soccer) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Another Bartomeu L",
            "score": 1463,
            "author": "ad1s6h",
            "replies": [
                {
                    "level": 1,
                    "comment": "He also didn't buy darwin nunez for peanuts as a sub for suarez.",
                    "score": 337,
                    "author": "akagaminick",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you think Nunez plays well at Liverpool? He is far from great. Prefer Gakpo. More skilled.",
                            "score": 11,
                            "author": "173555",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He was great at Benfica. He certainly has the skillset and eyes for goals. He is pacey too. I also love all his slander songs lmaoo. My point is form can turn upside down, he probably needs time to settle as well.",
                                    "score": 205,
                                    "author": "akagaminick",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What songs",
                                            "score": 2,
                                            "author": "Gverreiro",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "More songs that he has goals in LFC. Just search Darwizzy songs in youtube. There are hundreds probably. Funny as heck too.",
                                                    "score": 3,
                                                    "author": "akagaminick"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "HE CAME FROM BENFICA TO THE BIG REDS\n\nhttps://youtube.com/shorts/5gtkRLG49dQ?feature=share\n\nApologize in advance if you had gone this long without seeing this and I ruined this for you 😂",
                                                    "score": 0,
                                                    "author": "TheLeoMessiah"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I think there is a big difference scoring against boavista or Aston Villa… ofcourse it is a good player. He is not worth the money they paid. Gakpo is worth any penny so far.",
                                            "score": -46,
                                            "author": "173555",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Exactly what I am saying. We could have gotten him for less than €5m probably. At that point he would have been worth it and if he had flopped, then it's barely €5m.",
                                                    "score": 36,
                                                    "author": "akagaminick"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Some players do better in certain enviorments.\n\nWho knows if this is the version of Nunez we wouldve seen in another team.",
                                                    "score": 13,
                                                    "author": "linqqan"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;Far from great\n\nwhat a stupid r/soccer take. He scored 15 goals + 4 assists in all comps over 2300 minutes according to Transfermarkt.de. That's a goal or assist every 121 minutes.\n\nTo compare that to Gakpo - he has 7 goals + 3 assists for Liverpool in roughly 1900 minutes so a g/a every 190 minutes\n\n or to Salah - he has 30 goals + 16 assists in 4300 minutes so g/a every 93 minutes\n\nWhat I'm trying to say is that Nunez is FAR from as bad as everyone on r/soccer is trying to make him. He has had a decent start and will only get better.",
                                    "score": 169,
                                    "author": "Pu_Baer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is it. Nunez wasn’t even that bad everyone is just hating because he had a couple open net blunders and the news cycle kept rolling the clips. More than likely he has some positive regression and ends up with 20+ next year and we all forget about the “bad” year.",
                                            "score": 81,
                                            "author": "Groomed_Banana",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The media pushing the Darwin vs haaland narrative really didn't help too. haaland would have been at least twice as much without the release clause putting them in comparable territory. Darwin was expensive, sure, but haaland would have been closer to mbappe than Darwin and the pundits were acting like they were expected to be similar quality. Haaland is a much more finished product, as young as he also is.\n\nNot to say Nunez has lived up to his fee, but he has been promising, especially if you compare him to Antony rather than haaland",
                                                    "score": 35,
                                                    "author": "WhenWeTalkAboutLove",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Good comparison, honestly forgot about Anthony… as he is forgettable at this point. He’s the true benchmark for a bust.",
                                                            "score": 5,
                                                            "author": "Groomed_Banana"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "If haaland didn't come to the premiere league at the same time, the perspective around nunez would be completely different now. And it's clear no one has seen his games. He does a lot more than just score goals",
                                            "score": 12,
                                            "author": "jayesh_f33l"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Gakpo passes the eye test and seems way more positionally intelligent and aware of the flow of play. Couple more g/a for Darwin doesn't change that. Still have hopes for the kid but Gakpo seems superior.",
                                            "score": 5,
                                            "author": "techaansi"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "He plays well the only thing missing are goals but i think next season we will see a other nunez",
                                    "score": 5,
                                    "author": "nombresinhombre"
                                },
                                {
                                    "level": 3,
                                    "comment": "I personally prefer Nunez. I haven’t watched Gakpo a lot but a couple of times I watched him I felt his touch let him down in tight spaces in the box. Nunez is just chaos and for me fits Liverpool. Just needs to improve His finishing",
                                    "score": 16,
                                    "author": "RedOnePunch"
                                },
                                {
                                    "level": 3,
                                    "comment": "I think they compliment eachother really well  and really help cover up their weakness",
                                    "score": 2,
                                    "author": "ChefBoyardee66"
                                },
                                {
                                    "level": 3,
                                    "comment": "Nunez would be better at Barcelona",
                                    "score": 1,
                                    "author": "ineververify"
                                },
                                {
                                    "level": 3,
                                    "comment": "he has had a great season there. Midfield and defence were just atrocious this year",
                                    "score": 1,
                                    "author": "jeeeeezik"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'd say that's a W, ngl",
                            "score": -38,
                            "author": "Daramangarasu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "20g/a first season in LFC without starting every game and missing minutes to injury.\n\nHe also missed some good chances he created.\n\nIf he fixed his finishes he will be a killer.",
                                    "score": 46,
                                    "author": "PhillipIInd"
                                },
                                {
                                    "level": 3,
                                    "comment": "Idk..we don't have any replacement for lewy rn except for ferran and ansu, that are both underwhelming at the position. And now we are linked to a €40m roque (who is good, but expensive). Alternatively, we could have even sold darwin for a good price. Who knows. I rate him.",
                                    "score": 4,
                                    "author": "akagaminick"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Tbh, Davies wasn’t a lb. Don’t think Barcelona management would have been smart enough to switch his position to LB. Worked out for Davies that Hansi Flick came in",
                    "score": 93,
                    "author": "Tight-Ad-1161",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Davies played both LB and LW for the Whitecaps.",
                            "score": 69,
                            "author": "BlameTibor"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Typical  Bartomeu... Fuck Barca everytime he could",
                    "score": 2,
                    "author": "MontblancAlps"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hourly Bartomeu L",
            "score": 1711,
            "author": "Erty13",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hate the man as much as anyone, but this kind of comment makes 0 to no sense. At the time we were struggling to sort out Coutinho's registration for the non-EU spots. Davies being Canadian was a clear difficulty to sort out, plus lb was and it's sorted out.\n\nThis is more the media running with something based on a half-frame truth, and everyone just posting their generic comments for karma.",
                    "score": 494,
                    "author": "Random_Acquaintance",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It does make sense, as a Young talented player, he could sign for Barcelona B and still have opportunities in the main team, Bartomeu just discarded him, it's now a fact that he is the worse president ever.",
                            "score": 164,
                            "author": "guitate",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ballau tabla signed for Barcelona B   And he’s Canadian",
                                    "score": 49,
                                    "author": "Banksmans",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He joined in January 2018. And then like the other guy said , we had the problem with the EU spots for the first team. Also since the moron signed Tabla , we couldn't have fit him in for the B team since we already had reached the limit there as well. Also the issue with him being under 18 also prevented us from signing him immediately , but then the moron could have signed davies like bayern had.",
                                            "score": 11,
                                            "author": "idonotstutter"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "if he's moving straight to bayern's bench he could have probably done better than barcelona b",
                                    "score": 22,
                                    "author": "b3and20"
                                },
                                {
                                    "level": 3,
                                    "comment": "Gentle reminder that, at the time, we had Cucurella and Miranda at Barça B. Again, you're all just pilling up for karma instead of trying to understand the situation at the time.",
                                    "score": -1,
                                    "author": "Random_Acquaintance",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Gentle reminder that when Bayern signed Davies his position was LW. They pushed him to LB because Lucas Hernandez got injured, so your theory doesn't hold water here.",
                                            "score": 89,
                                            "author": "SomteeOnline",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh, so then he was the sub for Ansu Fati?",
                                                    "score": -51,
                                                    "author": "Random_Acquaintance",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Ansu wasn't even in barca B. He directly jumped in from the juvenil team.",
                                                            "score": 81,
                                                            "author": "letsnotbedumb",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "dude is just taking Ls all over the place haha",
                                                                    "score": 55,
                                                                    "author": "lilbelleandsebastian"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "⛏️ dig deeper that hole",
                                                            "score": 8,
                                                            "author": "linqqan"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "His primary position was LW, but he played as LB often enough in Vancouver.",
                                                    "score": 1,
                                                    "author": "canuck1701"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Davies wasn't a LB back then. He was a pure winger. He only started playing as a wingback in 2019 when Herdman started him there that summer for Canada and then Kovacs played him as a left back for Bayern after.",
                            "score": 57,
                            "author": "tedbawno",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He played at lb occasionally for the whitecaps. It was already known he can cover that position",
                                    "score": 11,
                                    "author": "RyanBordello",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nah, Davies never played LB/LWB for Vancouver. If there's evidence he was ever deployed there I'll admit being wrong but I support the Whitecaps and have watched probably every game Davies played for them and can't recall a time he ever covered there - before he established himself as a starter, most of his substitutions in were for Manneh on the left wing.\n\nFirst time Davies played as LB was a friendly against Trinidad and Tobago in June 2019. [His first official start as LB came a couple games later in the Gold Cup 7-0 demolition against Cuba.](https://www.espn.com/soccer/match/_/gameId/539226) I vividly recall how Herdman making that move made a lot of noise and had a lot of people questioning it at the time. If Davies is now known primarily as a LB the switch obviously has paid off for both club/country.",
                                            "score": 17,
                                            "author": "tedbawno",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah I was gonna say I dont recall him ever being deployed as a fullback here but I could be misremembering",
                                                    "score": 5,
                                                    "author": "darkerthrone",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "He did on a few occasions, mostly as cover for an injury or if the team went down a man.",
                                                            "score": 2,
                                                            "author": "Valcari"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "This is just wrong, Davies played LB and LWB a handful of times for Vancouver. It was never consistent but it did happen",
                                                    "score": 3,
                                                    "author": "Sielaff415"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "https://www.eightysixforever.com/2018/4/14/17237282/vancouver-whitecaps-alphonso-davies-at-left-back\n\nHe played as LB for the Whitecaps at times. Here's your evidence, now please stop spreading disinformation.",
                                                    "score": 1,
                                                    "author": "canuck1701"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "but doesn’t the fact that he has Liberian citizenship as well mean that he wouldn’t take up a non EU spot due to the Cotonou agreement? that argument doesn’t make sense at all",
                            "score": 2,
                            "author": "LabraTheTechSupport"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Did he do one good thing for you?",
                    "score": 6,
                    "author": "Flammwar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The woman team definitely. And no one is really sure how much he was involved in that.",
                            "score": 7,
                            "author": "Erty13"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He did so much damage to every level of the club it is unreal.",
                    "score": 12,
                    "author": "ZachsLegacy92"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Very humble - he was definitely our best player that last year",
            "score": 165,
            "author": "ma9pie",
            "replies": [
                {
                    "level": 1,
                    "comment": "he wasn’t very humble when I met him",
                    "score": -73,
                    "author": "-___-___-__-___-___-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "From the first impression, you aren't very nice so maybe that played a role.",
                            "score": 55,
                            "author": "coolwool",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "lmao",
                                    "score": -21,
                                    "author": "-___-___-__-___-___-"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love how he says he wasn’t the best at Vancouver that’s very humble and obviously not true",
            "score": 47,
            "author": "_escapevelocity",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dude started playing with Vancouver when he was like 16 lol",
                    "score": 28,
                    "author": "deetee141",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah but his 2018 season was pretty legendary he was by far their best player by that point imo",
                            "score": 20,
                            "author": "_escapevelocity"
                        },
                        {
                            "level": 2,
                            "comment": "Got MLS minutes at 15 even, I'm pretty sure",
                            "score": 7,
                            "author": "Disk_Mixerud",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He had just over 600 minutes for the Whitecaps from about 15 games (a couple of them starts) by the time he turned 16.",
                                    "score": 5,
                                    "author": "EndsTheAgeOfCant"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He had moments where he looked unstoppable, but was obviously inexperienced and still had games where he struggled to get involved, though he got noticeably better the more he played.",
                    "score": 4,
                    "author": "Disk_Mixerud"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Another piece of evidence indicating Bartomeu was a Trojan horse.",
            "score": 329,
            "author": "oneandonlyA",
            "replies": [
                {
                    "level": 1,
                    "comment": "Madrid legend",
                    "score": 96,
                    "author": "nekoparaguy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I get the joke though barca's downfall hasn't helped us, apart from the rivalry jokes and what not, it's just sad to see the league's giants are no longer as relevant as they used to be, even Sevilla. La Liga is a shithole currently.",
                            "score": 9,
                            "author": "HarshangLad",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We’ll find out years from now that Tebas was squeezing the league to force the CVC deal through. La Liga is getting too predictable.",
                                    "score": 6,
                                    "author": "brain-juice"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He literally fired Zubizarreta after putting together the treble team",
                    "score": 11,
                    "author": "cortez0498"
                },
                {
                    "level": 1,
                    "comment": "i swear to me mum he playin against us",
                    "score": 2,
                    "author": "EnvironmentalSpirit2"
                },
                {
                    "level": 1,
                    "comment": "Bartomaeu's dar should've used a Trojan",
                    "score": 2,
                    "author": "elardmm"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can we please get a worldwide ban on this exact sad piano sound in short videos",
            "score": 857,
            "author": "Andy-Is-Hot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ban on music in a video where it's not needed in general",
                    "score": 193,
                    "author": "Xey2510",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So many great shorts ruined by music!",
                            "score": 21,
                            "author": "ACardAttack"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank fuck for the subtitles",
                    "score": 27,
                    "author": "Legendarybbc15"
                },
                {
                    "level": 1,
                    "comment": "But how would you know how to feel without an obvious musical cue?",
                    "score": 6,
                    "author": "GazzP"
                },
                {
                    "level": 1,
                    "comment": "It's this - https://youtu.be/LlN8MPS7KQs\n\nI know it sucks when added to videos but I love listening to the longer version of this before bed during winter.",
                    "score": 32,
                    "author": "suarezian"
                },
                {
                    "level": 1,
                    "comment": "I swear to god football videos always have the most godawful music. Whether it be interviews, highlights or anything",
                    "score": 11,
                    "author": "ThermosbyThermas"
                },
                {
                    "level": 1,
                    "comment": "I saw a short where they added that sigma male music and that annoying oversaturated filter to the coin scene from no country for old men. Your internet rights should be revoked for a year if you post that imo.",
                    "score": 2,
                    "author": "LordKappachino"
                }
            ]
        },
        {
            "level": 0,
            "comment": "While a bad decision.  There is a limit on how man non-eu players you can play.",
            "score": 356,
            "author": "gsingh704",
            "replies": [
                {
                    "level": 1,
                    "comment": "Davies wouldnt take up a non-eu slot, his parents are liberian and liberia is part of the Cotonou Agreement, so he would be treated as a EU citizen in Spain, [just like Etoo when he was at barca](https://www.theguardian.com/football/2007/oct/07/newsstory.sport4)",
                    "score": 133,
                    "author": "EwieErik",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ewie \"The Truth\" Erik you deserve an award fam",
                            "score": 39,
                            "author": "Intelligent-Agent440"
                        },
                        {
                            "level": 2,
                            "comment": "Pretty sure Eto’o had actual Cameroon citizenship though, Davies considers himself Canadian through and through, pretty sure at the very least he would have needed a Liberian passport for this to work",
                            "score": 4,
                            "author": "fiveht78"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This was before going to Bayern so around 2018 right? Barça at the time was still struggling trying to get Coutinho's Portuguese nationality in time.",
                    "score": 88,
                    "author": "KaliVilla02"
                },
                {
                    "level": 1,
                    "comment": "Yeah I think he meant Canadian in non-eu sense and not like he can't be that good if he's from Canada.",
                    "score": 3,
                    "author": "dhillonaire"
                },
                {
                    "level": 1,
                    "comment": "In Spain?",
                    "score": 18,
                    "author": "TexehCtpaxa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[In La Liga, each club is allowed five non-EU players, but are only allowed to name three non-EU players in each matchday squad.] (https://www.goal.com/en-gb/news/explained-how-many-foreign-players-are-real-madrid-barcelona--each-la-liga-team-allowed/1kzy86sp6t2ex1qzhuvygusdwj)",
                            "score": 85,
                            "author": "yaffle53",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Does that change if a player gets Spanish citizenship ?",
                                    "score": 12,
                                    "author": "guanwe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes",
                                            "score": 60,
                                            "author": "Akopalypse76"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yes, iirc Militao, Rodrygo and Vini got Spanish citizenship specifically to keep the non-EU spots unoccupied.",
                                            "score": 44,
                                            "author": "s_91",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "How come they were able to obtain Spanish citizenship in such a short amount of time? I’m not well-versed with the process in Spain.",
                                                    "score": 2,
                                                    "author": "SeniorCheeto",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "If you are from South America you can get Spanish nationality very quickly, I think after only 3 years of living legally in Spain.",
                                                            "score": 1,
                                                            "author": "Stimlak"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yes, but if you are from south America, and especially from a Spanish speaking country, you have to play for 2 years in Spain and then you can get the Spanish citizenship (during Covid years the process was slower, so nowadays you might have to wait a bit more)",
                                            "score": 18,
                                            "author": "n0www"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That's how we roll. I think we currently have all slots open.",
                                            "score": 5,
                                            "author": "Cucumberino"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "any eu citizenship is fine",
                                            "score": 6,
                                            "author": "b3and20"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "No, they would still only be allowed 5 non-eu players. But the player just wouldn't be one of them.",
                                            "score": 1,
                                            "author": "beastmaster11"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That actually seems like a huge handicap ngl\n\nI wonder if they’ll push for Bellingham to get Irish citizenship to help with this? Or maybe Kane, if they sign him - not sure if he has Irish ancestry (probably does) but Bellingham has at least 1 Irish grandparent iirc.",
                                    "score": 1,
                                    "author": "a_f_s-29"
                                },
                                {
                                    "level": 3,
                                    "comment": "Wow Jude going to take up that non-EU spot for Real next year",
                                    "score": 1,
                                    "author": "RunawayRobocop"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Teams only get 4 non-EU registration spots in LaLiga.\n\nEdit: Sorry, 5 spots, but only 3 in the matchday squad, I got mixed up with France.",
                            "score": 10,
                            "author": "WinsingtonIII"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Is it a bad decision? Not like Barcelona didn't have one of the best fullbacks in recent times at their club in the last few seasons + currently has another exciting prospect as his successor there.\n\nWe don't know how Davies would've turned out at Barca without the playing opportunities and in Barca's system.\n\nHe's good offensively but doesn't have the offensive arsenal to play the role Alba played and honestly, Balde looks even more promising at this point and will only get better.",
                    "score": 2,
                    "author": "robins420",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He was a winger at the time not a fullback",
                            "score": 8,
                            "author": "Enage"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Based",
                    "score": 1,
                    "author": "ThatGuyTitan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "At this point what hasnt Bartomeu done ?",
            "score": 17,
            "author": "Sheikhabusosa"
        },
        {
            "level": 0,
            "comment": "always. the same. fucking. music.",
            "score": 82,
            "author": "DraenglerDennis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Insert random  iman shumpert short video hyping up lebron",
                    "score": 12,
                    "author": "John_e_caspar"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The amount of hate i have for Bartomeu is immeasurable. This guy has fucked up soo many good transfers for us. Genuinely hope he somehow gets put away to jail for a good amount of time.",
            "score": 13,
            "author": "CombinationMuted7260"
        },
        {
            "level": 0,
            "comment": "Ballou Tabla exists.",
            "score": 12,
            "author": "SENAPIFAKER"
        },
        {
            "level": 0,
            "comment": "Bartomeu regressed this club 5 years back atleast",
            "score": 17,
            "author": "banana-is-apeeling"
        },
        {
            "level": 0,
            "comment": "He's probably just going off the story I remember saying this about, but it makes no sense. Barca (granted the B team) signed Tabla from Montreal like a year before Davies left for Bayern.\n\nIt absolutely didn't work out (honestly Davies was better even at the time) but that's just bad scouting luck right?",
            "score": 17,
            "author": "Melniboehner",
            "replies": [
                {
                    "level": 1,
                    "comment": "not really comparable, doubt he looks over the B team's signings",
                    "score": 10,
                    "author": "calmboi4life"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bartomeu also preferred to sign Kevin Prince Boateng for 20 million rather than Haaland for 9 million. Fucking Nobita can't keep breathing calmly, he's screwed us over but okay.",
            "score": 41,
            "author": "II_MrBlack_II",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's so hindsight though. It's like saying Perez was sabotaging Madrid for letting go of Theo and Hakimi even though they were unproven",
                    "score": 28,
                    "author": "jopma",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes but no, in my opinion. Basrtomeu was a horrible president but I guess the technical management had a heavier weight in the decisions about signings. And the truth is they managed to always choose the worst option. Like Boateng/Braithwaite over Haaland, Dembele over Mbappe, Coutinho, Griezmann... Sure, hindsight is 20/20, but I struggle to remember a signing that was done right and turned out to be the best possible choice, aside from Pedri. If he didn't take those decisions personally, he did make sure to surround himself with the most awful scouting team ever.",
                            "score": 5,
                            "author": "raincloud82"
                        },
                        {
                            "level": 2,
                            "comment": "Yes imo, everyone can see their talent they just needed time.\n\nWe bought them too young",
                            "score": 1,
                            "author": "uchiha_boy009"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Braithwaite*, Boateng was a loan",
                    "score": 2,
                    "author": "tecotoc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sounds exactly like something Bartomeu would said whilst planning on to bid 134 million for some bloke in Sunday League",
            "score": 6,
            "author": "ctladvance"
        },
        {
            "level": 0,
            "comment": "With Bartomeu everything was possible.\n\n Top 3 Real Madrid president easily, only behind Santiago Bernabeu and Florentino.",
            "score": 10,
            "author": "n0www"
        },
        {
            "level": 0,
            "comment": "Davies to Madrid revenge arc 👿",
            "score": 7,
            "author": "Remote_War_313"
        },
        {
            "level": 0,
            "comment": "\"that's what came out in the media, idk if he actually said that\"\n\nI thought professional athletes knew better than to believe everything in the media",
            "score": 2,
            "author": "mookkss"
        },
        {
            "level": 0,
            "comment": "Bartomeu hates hockey :)",
            "score": 2,
            "author": "SocratesPolle"
        },
        {
            "level": 0,
            "comment": "Anyone have link to the full video?",
            "score": 2,
            "author": "KL2447"
        },
        {
            "level": 0,
            "comment": "Didn't want Davies as a Canadian but got Dest an American, makes sense",
            "score": 2,
            "author": "Salami_Lozenges"
        },
        {
            "level": 0,
            "comment": "that brother has a special place in hell",
            "score": 5,
            "author": "Aye2004"
        },
        {
            "level": 0,
            "comment": "The same Bartomeu that bought Dest? This sounds ridiculous",
            "score": 3,
            "author": "halflemonade"
        },
        {
            "level": 0,
            "comment": "Bartomeu is a bigger real madrid legend than christer ronald sewey. Probably 2nd only to Di Stefano.",
            "score": 4,
            "author": "rr18114"
        },
        {
            "level": 0,
            "comment": "As a Canadian, very glad he didn't go to Barca. Definitely can't see him fulfilling his potential in the total mess that club has been recently compared to Bayern",
            "score": 4,
            "author": "bellerinho",
            "replies": [
                {
                    "level": 1,
                    "comment": "Weird thing to say about a team that better or worse always gives chances to promising young players and often leading to them sticking up in the starting lineup(Balde,Araujo,Pedri,Gavi,Ansu...)They literally fielded a 15 years old last month in Yamal lol",
                    "score": 3,
                    "author": "kokukojuto33"
                },
                {
                    "level": 1,
                    "comment": "and bayern didnt have a fucked up year? lol",
                    "score": -1,
                    "author": "Ezio_Auditore_11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They've literally won the league every year and a CL since he has been there. Barca have been dumped out of CL more times than not",
                            "score": 3,
                            "author": "bellerinho"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "And as Muller always says \"Barca will pay the price\"",
            "score": 2,
            "author": "akagaminick"
        },
        {
            "level": 0,
            "comment": "Huh? Him being canadian isn't actually even a better thing? Sure Barca is already a pretty well known brand but they could get even more fans from a new market, right?",
            "score": 1,
            "author": "I_am_not_Serabia",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think the thought process from Bartomeu was he didn’t want to use up one of his non-eu spots on a 17 year old from the MLS. The rules are a lot different in Germany and Bayern could’ve probably afforded to take the gamble.",
                    "score": 92,
                    "author": "Chxkn_DpersRtheBest",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ok, that makes sense.",
                            "score": 6,
                            "author": "I_am_not_Serabia"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Canada could win the World Cup and you still wouldn’t get more football fans here.",
                    "score": -10,
                    "author": "ParadiseGangster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's not true, there would be more fans.\n\nThere just wouldn't be more investment in the sport.",
                            "score": 19,
                            "author": "Ryuzakku"
                        },
                        {
                            "level": 2,
                            "comment": "I remember in the early 2000s as a kid it was embarrassing to have soccer as my main sport. Definitely has been changing over the last 2 decades tho",
                            "score": 1,
                            "author": "balapete",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same in the US. Saw a kid (no older than 10) with an Mbappe jersey on yesterday, made me happy",
                                    "score": 1,
                                    "author": "NoSleepTill-Brooklyn"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No matter how new the market is, it is very very small.   \nBy that logic, they could also buy someone from New Zealand.",
                    "score": 1,
                    "author": "coolwool"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's Bartomeu. He most likely said that shit.",
            "score": 0,
            "author": "SomteeOnline"
        },
        {
            "level": 0,
            "comment": "Bartomeu you sister's cunt",
            "score": 2,
            "author": "PapaShangoo000"
        },
        {
            "level": 0,
            "comment": "Bald is clear anyways",
            "score": 1,
            "author": "aviary___"
        },
        {
            "level": 0,
            "comment": "He has a British accent? Or is that how Canadians sound",
            "score": 0,
            "author": "OddWitness2768",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think it's the Liberian accent he got from his parents coming through.",
                    "score": 4,
                    "author": "Sporkedup"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I want worst things possible to happen to Bartomeu fucking my god",
            "score": 1,
            "author": "OriginalRange8761",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope he drops his bagel or toast and it falls face down on the carpet",
                    "score": 2,
                    "author": "ineververify"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I mean seeing how Vini's been treated, he can be kinda glad he didn't",
            "score": -22,
            "author": "DescriptionTimely675",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, although Bellingham still went to Real Madrid regardless.",
                    "score": 12,
                    "author": "TheBiasedSportsLover",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah but Bellingham is only going to get half the amount of hate. /s",
                            "score": 5,
                            "author": "SANTICLAWZ"
                        },
                        {
                            "level": 2,
                            "comment": "It's not the big 2 but rather how the rest of the league treats you",
                            "score": 1,
                            "author": "DescriptionTimely675"
                        },
                        {
                            "level": 2,
                            "comment": "We'll see, El Chiringuito already started attacking Bellingham.",
                            "score": 1,
                            "author": "javierich0"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Come to Madrid and show them what you are made of.",
            "score": 1,
            "author": "NeoIsJohnWick"
        },
        {
            "level": 0,
            "comment": "Give Barto a statue outside spotify camp nou. imo",
            "score": -11,
            "author": "Mackieeeee",
            "replies": [
                {
                    "level": 1,
                    "comment": "Outside of Bernabéu*",
                    "score": 24,
                    "author": "oneandonlyA",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "hehe",
                            "score": -2,
                            "author": "Mackieeeee"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's okay Alphonso, Madrid is a better choice for you anyways.",
            "score": -3,
            "author": "refusestonamethyself",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dream on",
                    "score": 1,
                    "author": "getZlatanized"
                }
            ]
        },
        {
            "level": 0,
            "comment": "To be fair who would want a C🤮nadian in their team?",
            "score": -20,
            "author": "Friendly_Chicken_760"
        },
        {
            "level": 0,
            "comment": "its okay davies, we will take you for rw",
            "score": -19,
            "author": "Eibermann"
        },
        {
            "level": 0,
            "comment": "That explain all those Bayern vs Barca scoreline",
            "score": 0,
            "author": "imaliveyeay"
        },
        {
            "level": 0,
            "comment": "why do more and more videos have that sad music playing in the background now?",
            "score": 0,
            "author": "Praydaythemice"
        },
        {
            "level": 0,
            "comment": "Most normal bartomeu decision",
            "score": 1,
            "author": "daboatfromupnorth"
        },
        {
            "level": 0,
            "comment": "Remember guys he wouldn't have been playing LB if Barca got him.",
            "score": 1,
            "author": "theonewithtoomany"
        },
        {
            "level": 0,
            "comment": "People have preconceived notions about others. But successful management evaluate people on their individual attributes. Sadly this was missing as Bartomeu is a buffoon but generally it is like that especially here r/soccer .",
            "score": 1,
            "author": "RevolutionaryRodd"
        },
        {
            "level": 0,
            "comment": "I’m not trying to defend Bartomeu here, but if it’s due to him being Canadian, is it not because Spanish football has a rule on how many non-EU citizens a club can sign, and not because of racism?",
            "score": 1,
            "author": "Dark_Wolf04",
            "replies": [
                {
                    "level": 1,
                    "comment": " probably the non EU slots",
                    "score": 1,
                    "author": "xenon2456"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bartomeu the greatest Madridista ever",
            "score": 1,
            "author": "shakespearediznuts"
        },
        {
            "level": 0,
            "comment": "I believe it.",
            "score": 1,
            "author": "demidemian"
        },
        {
            "level": 0,
            "comment": "I am 100% convinced (not exxagerating for effect) that BARTOMEU's mission was to actually destroy Barcelona.",
            "score": 1,
            "author": "goodboybane"
        },
        {
            "level": 0,
            "comment": "Sorry if I am being daft, but why did it matter if he was from Canada? \n\nThe rule around how many non EU players you have is it?",
            "score": 1,
            "author": "Flavourifshrrp"
        },
        {
            "level": 0,
            "comment": "Can’t wait for him to go to Madrid and crushhhhh Barca.",
            "score": 1,
            "author": "rwalter5"
        },
        {
            "level": 0,
            "comment": "Real Madrid will not say no to a Canadian with a manager that lives in Canada in the summer!",
            "score": 1,
            "author": "Barb-u",
            "replies": [
                {
                    "level": 1,
                    "comment": "Davies contract with Bayern isn't expiring yet",
                    "score": 1,
                    "author": "xenon2456"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Where’s the rest of it",
            "score": 1,
            "author": "10ele"
        },
        {
            "level": 0,
            "comment": "Another reason to hate bartomeu",
            "score": 1,
            "author": "BlueLabel19"
        },
        {
            "level": 0,
            "comment": "I hope I run into Bartomeu one day just to take out my frustration on him.",
            "score": 1,
            "author": "efarfan"
        },
        {
            "level": 0,
            "comment": "Saw him play in Vancouver and he was giving the Sounders fits. Easily the best player on the pitch. Told the Caps fans next to us to enjoy him while you can",
            "score": 1,
            "author": "JasonJasonBoBason"
        },
        {
            "level": 0,
            "comment": "i feel for players like him. not only does he get judged by shitty \"fans\" for being of African, but he doesn't get respect from management because he's North American. i know not everyone can be the Lebron James of soccer, but it's not like there aren't any quality players to come out of America and America's hat.",
            "score": 1,
            "author": "RedgrenCrumbholt"
        },
        {
            "level": 0,
            "comment": "Madrid would love you",
            "score": 1,
            "author": "alejpaz"
        },
        {
            "level": 0,
            "comment": "Because he’s Canadian don’t buy him? Absolutely nothing to do with his football playing wtf",
            "score": 1,
            "author": "Cpt-Dreamer"
        },
        {
            "level": 0,
            "comment": "That Davies Assist vs Barca (8:2) lol",
            "score": 1,
            "author": "shudnap"
        },
        {
            "level": 0,
            "comment": "Being Canadian isnt bad just for being canadian but cause in Spain you have a  limit of 3 Non-EU players. Southamerican players can get EU citizenship fast(few years) but for a Canadian it would take a lot more time and thats an issue for a team like Barcelona",
            "score": 1,
            "author": "kokukojuto33"
        },
        {
            "level": 0,
            "comment": "Ha ha ha...",
            "score": 1,
            "author": "DeaJes"
        },
        {
            "level": 0,
            "comment": "Yea",
            "score": 1,
            "author": "Yayimlonely"
        },
        {
            "level": 0,
            "comment": "Lol what did Barto have against Canadiens ?",
            "score": -3,
            "author": "LewsTherin177"
        },
        {
            "level": 0,
            "comment": "Like if Real Madrid didn't have [enough pull](https://www.bundesliga.com/en/bundesliga/news/alphonso-davies-having-david-alaba-beside-me-was-amazing-bayern-munich-15967) already...",
            "score": -1,
            "author": "e1a6"
        },
        {
            "level": 0,
            "comment": "I mean he would've started in the B team and probably been called up to the first team later",
            "score": 0,
            "author": "xenon2456"
        }
    ]
}