{
    "id": "146y03a",
    "score": 95,
    "title": "[FB Ref] As per Opta Data, Kyle Walker has the worst 1v1 success rate in the 22/23 Premier League season, winning only 16.7%. Topping the charts is Aaron Wan-Bissaka with a staggering success rate of 92%.",
    "author": "ABCP3",
    "date": 1686500278.0,
    "url": "https://www.reddit.com/r/soccer/comments/146y03a",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "**This is a stats thread. Remember that there's only one stat post allowed per match/team, so new stats about the same will be removed. Feel free to comment other stats as a reply to this comment so users can see them too!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/soccer) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "His speed lets him defend differently. So long as he doesn't dive in he is always in the way for a cross or dangerous pass as no one can get past him far enough to be clear.\n\nThe only time he really needs to win a tackle is if the other player tries to cut inside of him which is quite rare.",
            "score": 83,
            "author": "Quacky33",
            "replies": [
                {
                    "level": 1,
                    "comment": "His style of defending has nothing to do with having the worse tackle % in the PL this season. He would not be the elite defender he was if this was a normal season. Through his City career he averages a 55% success rate in the league, not the 16.7% we saw this year.\n\nIn the CL this season his rate was 77%. Only Ruben Dias' had a higher success rate on City. The statistic matters, but the only reason why it's misleading is because its a career anomaly.",
                    "score": 1,
                    "author": "yellow__cat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kyle Walker was discussing this after a game the other night.\n\nIt is apparently part of his strength, that he gives players space to pass but wins in the foot race. \n\nSo imo, it doesn't tell the whole story.",
            "score": 135,
            "author": "DonParatici",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ofc it doesn't. These are percentages for tackles. Walker usually out runs ppl and just run them of the ball.\n\nIt's such a poor post.",
                    "score": 98,
                    "author": "Gu3rilla21",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why is it a poor post? It’s an interesting statistic for one of the most effective defenders in the league…",
                            "score": 14,
                            "author": "yellow__cat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's interesting for AWB's style of defending. It is entirely distorted for Walker's style.\n\nFor instance, Maldini made very few tackles because his positioning was exceptional and is widely considered one of the best to play the game.\n\nWalker's game relies on a specific tactic of forcing the attacker to make a run against him and then picking his pocket. The first 1v1 is nearly always lost but the shoulder-to-shoulder duel is nearly always won.",
                                    "score": 15,
                                    "author": "DonParatici",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Haha thanks I had never heard of Maldini. \n\nJokes aside, your comparison doesn’t make any sense. This is about tackle success, not tackles attempted. Maldini still had a high tackle success rate even though he made fewer tackles than one would expect. They didn’t measure these statistics back then, but from the hundreds of games I’ve seen him play (because I’m old) he rarely missed, and tbh he still made loads of tackles per game especially when he played LB.\n\nFurthermore, letting an opponent progress with a ball isn’t considered a missed tackle. Missed tackles are generally given when a player either makes an attempt to play either the ball or player and either misses or makes contact without winning back possession. Walker intentionally letting an opponent pass him out wide isn’t going to count against him here. Bumping them and letting them pass might though, I’m not sure. \n\nEither way i still think it’s an interesting statistic even though slightly misleading, that a player considered to be one of the best defensive FBs in the world has lowest 1v1 success rate in the league. It shows that with certain characteristics in the right system, a defender can miss the majority of their tackles and still barely ever concede a goal.",
                                            "score": 3,
                                            "author": "yellow__cat",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm pretty sure 1v1 success and tackle success are different things",
                                                    "score": 2,
                                                    "author": "VAM89",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "As far as this statistic is concerned there's technically no difference. It's measured by dribblers tackled divided by number of attempts to challenge an opposition dribbler. Walker has 16% this season (4 tackles out of 24 attempts), way below the 55% average during the rest of his City career.\n\nAccording to my understanding, allowing a player to pass him without a challenge so that he can win the ball in recovery does not count as a missed tackle attempt. There needs to be a genuine attempt to play the ball/man and a failure to disrupt possession to count as a failed tackle.",
                                                            "score": 1,
                                                            "author": "yellow__cat"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "But this is about 1v1 success, not 'tackles attempted' success.\n\nIn a 1v1, if a player passes you then the defender has 'failed'.\n\nMaldini didn't need to make as many tackles because his positioning was superior. Just like Kyle Walker's positioning is superior.",
                                                    "score": 0,
                                                    "author": "DonParatici",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;But this is about 1v1 success, not 'tackles attempted' success.\n\nIt's the same thing. The statistic is measuring challenge % success, which is literally calculated by dividing the number of \"successful tackles\" by the number of total \"tackles attempted\". Walker has 4 successful tackles in 24 total attempts this season; a 16.7% success rate, which is a massive drop off compared to the 55% he has averaged during his other 5 seasons. You're saying that's because of his positioning and style; but his career numbers don't support that claim. \n\nAnd I'm still not sure why you're comparing him to Maldini or what you think that proves. We're not talking about the number of challenges a player makes, we're talking about their success rate when they attempt one. Maldini's success rate was probably 80-90%. If he committed to a tackle, as calculated, strong, fast, and precise as he was, he almost always won it.",
                                                            "score": -1,
                                                            "author": "yellow__cat"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Walker has attempted 1 less 1v1 tackles as Aaron Wan-Bissaka (AWB), this season.\n\nAWB is considered one of the best 1v1 tacklers in world football at this current time.\n\nGiven you're suggestion that Walker usually outruns players and runs them off the ball, would you suggest AWB does the same thing then?",
                            "score": -23,
                            "author": "ABCP3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Walker has played around 500 more minutes than AWB this season in the PL",
                                    "score": 26,
                                    "author": "undeadgoblin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Interesting.  Per 90 Walker averages 1.10 tackle attempts per game.  For comparison, players at a similar range includes Ben Davies at 1.02 per 90 &amp; Rico Henry 1.14 per 90.\n\nAaron Wan Bissaka is at 1.57 tackle attempts per 90.",
                                            "score": -4,
                                            "author": "ABCP3"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "But boy can he run fast.",
            "score": 64,
            "author": "TimmyBash",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fuck can he run.",
                    "score": 14,
                    "author": "Ryuzakku"
                },
                {
                    "level": 1,
                    "comment": "In my experience with my own son and nephews, I feel that the current generation of football fans, are very quick to jump on a bandwagon, especially if their experience of FIFA backs it up.\n\nWalker has never been an elite defender.  He's an incredible athlete yes, but pales in comparison to full backs such as Dennis Irwin and Ivanovic when taking into account the defensive duties of players in his position.",
                    "score": -73,
                    "author": "ABCP3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is just a really reductive way to look at defending.\n\nWalker is, and has always been, incredible at defending open spaces, better than almost anyone.\n\nThat makes him a perfect fit for the modern game with high lines.\n\nHe’s never been the best penalty box defender, but his teams avoid a lot of penalty box defending by having a high line and him shutting down all counterattacks.\n\nWalker also deliberately avoids making tackles, he lets a player try to go outside and then just mops up the ball when they take a heavy touch.\n\nIf a stat says that one of the best defenders of the last 5 years, in one of the best teams, under one of the best managers, is shit, it’s a good sign the stat is being applied wrong, and you’re applying this stat wrong by equating 1v1 % with being good at defending.",
                            "score": 84,
                            "author": "BabaRamenNoodles",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "100%, his athleticism allows him to be played in this particular role.\n\nI really made the point in reaction to CBS interview last night where Graelish suggested Thierry might struggle versus Walker.\n\nGive Henry the open space and there's only one winner.  Comfortably the fastest player I've seen live, more so than Mbappe and definitely the quickest the PL has ever seen.\n\nWalker is a relatively very limited defender in technical terms, but physically he's one of the best over the past decade.",
                                    "score": -25,
                                    "author": "ABCP3",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He’s held down a starting position for the most technically and tactically demanding coach in the world for 6 years, he’s not technically limited.",
                                            "score": 41,
                                            "author": "BabaRamenNoodles",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Tackling is a technique as much as first touch, marking, or passing.\n\nHe's technically limited in the tackling area.",
                                                    "score": -18,
                                                    "author": "ABCP3",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "or maybe everyone else is limited, because they act everytime they feel like they need to.\n\n&amp;#x200B;\n\ngetting a tackle wrong in that position has much bigger consequences than getting a few correct",
                                                            "score": 16,
                                                            "author": "Alia_Gr"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Horrible take. So many elite wingers have claimed Walker as the toughest opponent they've faced. He's shut down wingers like Mbappe, Vinicius in recent times. \n\nTo claim he's not an elite defender is ridiculous. You don't become the starting RB in a Pep team winning so many trophies without being elite",
                            "score": 32,
                            "author": "philipfoden",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I respect your opinion.\n\nAll I'm saying is the stats backed up my assumption on him as a defender.",
                                    "score": -15,
                                    "author": "ABCP3",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You mean stats you selectively picked that don't show anything about Walker because tackling is not his style?",
                                            "score": 34,
                                            "author": "Gu3rilla21",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What are you talking about?  \n\nI said in the light of Jack Graelish asking Thierry Henry last night, if he could 'take Walker on', that Thierry would be very successful in my opinion.\n\nSee my other comment for my prerequisite on that.\n\nI've suggested that Henry taking on and beating some of the worlds best 1 on 1 defenders over the course of his career, would mean he could most definitely (in Graelishs words), 'take Walker on' and be successful.\n\nThis is backed up by this season's data, which suggests Walker is very poor when faced with a 1v1.",
                                                    "score": -3,
                                                    "author": "ABCP3",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This isn't this seasons data. This is just a single stat that doesn't show anything. Everyone has eyes. You can see how good Walker is 1v1. There's a reason the best wingers name him as their toughest opponent. It's not because he's very poor 1v1... It might be the opposite.\n\nYou just have your mind made up by some dumb tackling stat.",
                                                            "score": 15,
                                                            "author": "Gu3rilla21",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Absolutely not.\n\nThe stat backs up my assumption that he's an incredibly limited defender in certain areas.\n\nI'm not sure why people are getting so flustered by this? \n\nI thought his deficiencies were quite obvious to the watching eye, you'd swear I had called him the worst player of all time given the reaction from some people.",
                                                                    "score": -4,
                                                                    "author": "ABCP3",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The problem with your assumption is very simple... Walker does not depend on tackling to defend. His team also plays a high line cuz they are comfortable with the knowledge that Walker will always mop up any inefficiencies in their high press tactics. I mean, Vinicius Junior and other top wingers observed that fact. \n\nWalker will readily engage wingers in a chase down the wing and then take the ball, and still have the presence of mind to pass it to another teammate. \n\nThe stats you posted don't paint the whole picture... which is really a problem with stats in general. You need context to fully grasp the value of many of these stats. That would explain why some players will register good stats on specific metrics yet turnout to be mediocre players in general.",
                                                                            "score": 4,
                                                                            "author": "BlueAzania",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "None of what you said addresses the actual statistic that Walker has the lowest 1v1 tackle success rate in the league though. \n\nLetting a winger pass him with the ball doesn’t count as a missed tackle from Walker. The statistic says that when Walker attempts to win the ball 1v1, he does not succeed more than 4/5 times. His total tackles per 90 in the league this year is .88, which is in the bottom 2% of other fullbacks, supports that he not a strong tackler. That’s an interesting statistic for a player considered to be one of the best RBs in the world. To extrapolate the statistic into “Walker is a bad defender” is wrong, but OP never said that, so I’m surprised at how much debate there is. He said Walker is a poor 1v1 tackler, which is hard to argue this season considering the data. It shows that a “poor” 1v1 tacklers can still be one of the best RBs with the right mix of other characteristics and system.",
                                                                                    "score": 0,
                                                                                    "author": "yellow__cat",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "mate football stats known to the public are absolute dogshit for the most part.\n\n&amp;#x200B;\n\ntake xG, team A scores a free kick, then team B gets the exact same free kick, but team A's goalkeeper makes a brilliant save after which team B shoots a point blank rebound over. team B will end up with the higher xG and everyone will talk about how they deserved to win",
                                            "score": 11,
                                            "author": "Alia_Gr",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Certainly, there's alot of stats that are bogus.\n\nHowever in this instance, I've always felt Walker is limited in certain defensive aspects &amp; that AWB is considerably efficient in 1v1s.\n\nThe stats I've posted merely back up the assumption I've always had regarding the two players.\n\nGiven the reaction, it's as if I've called Walker terrible, which he most definitely is not.",
                                                    "score": -2,
                                                    "author": "ABCP3"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "His recovery pace though and his physical attributes in general are such an asset to peps system and indeed any system that it lessens his flaws massively",
                            "score": 20,
                            "author": "Baisabeast",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Brilliant athlete, just a very limited defender. \n\nHe's found the perfect team where he can utilise his athleticism, whilst being heavily protected for the most part from actual 1v1 defending, where he struggles massively.",
                                    "score": -13,
                                    "author": "ABCP3"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "His biggest weakness is the blind side run, Sadio Mane would exploit it almost every time.",
                            "score": 0,
                            "author": "Acegeta",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He really struggled with Sadio in them Liverpool City games.\n\nI can't believe the blowback I've received regarding this post.\n\nHe has had several lapses in defending over the past few seasons, just because I've highlighted that he struggles in that area, does not mean I think he's crap.",
                                    "score": 2,
                                    "author": "ABCP3",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The blowback happens in a lot of sports subs when people use analytics without also providing match footage to back your conclusions. You need both.",
                                            "score": 8,
                                            "author": "BuckfuttersbyII"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "He's basically there for the initial counter attack, his pace allows him to be close to quick wingers which makes opposition teams less likely to use that option.",
                                            "score": 3,
                                            "author": "Acegeta"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Very misleading stat based on the way in which he defends imo",
            "score": 76,
            "author": "AvikHyp3",
            "replies": [
                {
                    "level": 1,
                    "comment": "It would be misleading if you used it to say “Walker is a bad defender” but is anyone doing that? It’s definitely interesting to see from one of the most effective defenders in the league, that’s for sure",
                    "score": -10,
                    "author": "yellow__cat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://www.reddit.com/r/soccer/comments/146y03a/fb_ref_as_per_opta_data_kyle_walker_has_the_worst/jnsn249/\n\nI mean, that is exactly what OP is saying",
                            "score": 16,
                            "author": "NaviersStoked1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You're right, OP did say he's a bad defender. I didn't read all of his comments. \n\nBut the \"misleading stat based on the way in which he defends\" that this thread keeps parroting is just not true at all. \n\nThe only reason why this stat is misleading is because it's a career anomaly. Walker's City average for the same stat is **55%**, with **66.7%** as his career best in 20/21 (6th highest in the league), not the **16.7%** we saw this season (literally the lowest percentage in the entire league). It's not about his method of defending, i.e. allowing a defender to pass him so that he can win the ball in recovery (which even still, does NOT count as a missed tackle attempt). It's because he was simply poor in the challenge this year with only 4 tackles out of 24 attempts. Way below what Walker usually does.",
                                    "score": 1,
                                    "author": "yellow__cat"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm so hoping Man U get rid of Wan-Bissaka. Reckon he'd be a great signing",
            "score": 7,
            "author": "CompetitiveSeat5340"
        },
        {
            "level": 0,
            "comment": "Defensive stats are usually trash and miss important details. What's defined as a 1vs1 success depending of the team can change, some teams want to stall and prepare the defense and others want to recover the ball as fast as possible. I'm not saying Walker it's an incredible defender but if Pep has trusted him that much it's because he's good.",
            "score": 14,
            "author": "anpife"
        },
        {
            "level": 0,
            "comment": "I’ll admit, I’m only in the 20s so I’ve not seen as much as soon - but AWB is comfortably the best 1v1 defender I’ve ever watched",
            "score": 15,
            "author": "xegget",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would say Azpilicueta until recently.",
                    "score": 3,
                    "author": "H4RRY29",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ashley Cole. Azpilicueta was the best in the league for a good 5 year period though.",
                            "score": 6,
                            "author": "Rong_Bips_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ashley Cole doesn't get mentioned enough in terms of top full backs. One of the best of the modern era",
                                    "score": 6,
                                    "author": "NaviersStoked1"
                                },
                                {
                                    "level": 3,
                                    "comment": "Oh for sure, unfortunately Cole left Chelsea when I was thirteen so it is hard to call him the best 1v1 defender I've seen when my understanding of the game was not what it is now.",
                                    "score": 1,
                                    "author": "H4RRY29"
                                },
                                {
                                    "level": 3,
                                    "comment": "https://punditarena.com/football/thepateam/cristiano-ronaldo-ashley-cole-manchester-united/\n\n\"In an interview with El Chiringuito TV back in 2018, Ronaldo revealed that three-time Premier League winner Ashley Cole was by far and away the toughest opponent he’s played against.\"",
                                    "score": 1,
                                    "author": "someone88"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Eye-test always.",
            "score": 2,
            "author": "fingrar",
            "replies": [
                {
                    "level": 1,
                    "comment": "for defenders most definitely",
                    "score": 3,
                    "author": "MadsNN06"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The way our fans talk about dalot youd think he was in the top 10 worst lol",
            "score": 2,
            "author": "dumpystumpy"
        },
        {
            "level": 0,
            "comment": "If only AWB could pass 2 yards",
            "score": -12,
            "author": "Hicko11",
            "replies": [
                {
                    "level": 1,
                    "comment": "Such a shit take after the season he's having. He's massively improved his game and his attacking output is now much better than before. There's a reason ETH prefers him over Dalot who's supposed to be the better attacking RB.",
                    "score": 26,
                    "author": "JhonShelby",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah he's made huge strides this season. His link up play and ball carrying abilities have improved drastically. Still lacks a killer cross but that's not what he's in the team to do.",
                            "score": 1,
                            "author": "ScoopScoopScoop"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;  There's a reason ETH prefers him over Dalot who's supposed to be the better attacking RB.\n\nBecause Dalot has dropped off massively since the World Cup.",
                            "score": -4,
                            "author": "ID6WU"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Incredibly limited offensive player.\n\nI also dont think he's necessarily great in his defensive awareness and positioning.\n\nBut incredible 1v1.",
                    "score": 0,
                    "author": "ABCP3"
                }
            ]
        },
        {
            "level": 0,
            "comment": "In light of this clip:\n\n[https://twitter.com/CBSSportsGolazo/status/1667658944972718080](https://twitter.com/CBSSportsGolazo/status/1667658944972718080)\n\nGraelish has suggested Thierry Henry might have trouble against Kyke Walker.\n\nI've been fortunate to see Thierry Henry live on a number of occassions over the years.\n\nI've also ben fortunate to watch England and Man City play on a few occassions.\n\nThe suggestion Henry would struggle was laughable to me and sure enough, the stats on Walker's 1v1 defending backs up my assumption.\n\nNot a great defender by any means, in my opinion, but yes, he is incredibly quick.\n\nEdit: People downvoting me, please just go and watch old 90 minute matches without jumping to conclusions.  Heck, watch the Euro 2000 final.\n\nHenry faced the greatest defender of all time in Maldini, the 2006 balondor in Cannavaro and one of the top 4 defenders of my lifetime, Allesandro Nesta and left them for dust on multiple occasions.\n\nIt's not a slander on Kyle, people are underrating Thierry Henry.",
            "score": -16,
            "author": "ABCP3",
            "replies": [
                {
                    "level": 1,
                    "comment": "Henry would struggle, just as Mbappe, Vini, Hazard, Neymar all struggled against him, we have eyes.",
                    "score": 24,
                    "author": "LukeParkes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would consider Henry quicker than each of those\n\nAdmittedly i haven't seen Hazard live, so I can't speak for him.  But compared to the other 3, Henry is the quickest of the lot, no question.\n\nGive Thierry the space that Walker often leaves, particularly in the Arsenal sides from the early 2000's who were phenomenal on the counter attack &amp; I can only see one winner.",
                            "score": -2,
                            "author": "ABCP3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Henry is quicker than Mbappe? What's Henry top speed?",
                                    "score": 5,
                                    "author": "Exact_Let5460"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Walker's probably had his worst season to date. Was even below his usual levels when playing for England.",
            "score": -6,
            "author": "FloppedYaYa"
        },
        {
            "level": 0,
            "comment": "But proceeds to pocket Vini. Sure.",
            "score": 1,
            "author": "Gold-Train-1471",
            "replies": [
                {
                    "level": 1,
                    "comment": "Because this is a PL statistic and the CL is a different competition. \n\nIn the CL this season he was 7/9 in challenge attempts for an average of 77%.   \nIn the PL this season he is 4/24 for an average of 16.7%, by far the lowest in his career where his average is 55%.",
                    "score": 2,
                    "author": "yellow__cat"
                }
            ]
        }
    ]
}