{
    "id": "k0uzsv",
    "score": 44503,
    "title": "Maradona passed away at the age of 60",
    "author": "[deleted]",
    "date": 1606320767.0,
    "url": "https://www.reddit.com/r/soccer/comments/k0uzsv",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Hey all, just to keep r/soccer/new from being overwhelmed from this awful news, feel free to reply to this comment with links to tributes from across the footballing world.",
            "score": 1,
            "author": "deception42",
            "replies": []
        },
        {
            "level": 0,
            "comment": "As the Clarín eloquently put it:\n\n\"La sentencia que varias veces se escribió pero había sido gambeteada por el destino ahora es parte de la triste realidad: murió Diego Armando Maradona.\"\n\n\"The sentence that was written so many times and has been dribbled on by destiny is now a part of this sad reality: Diego Armando Maradona has passed away\"",
            "score": 2877,
            "author": "jorsiem",
            "replies": [
                {
                    "level": 1,
                    "comment": "I remember reading that some members of the Cameroon squad in 1990 were actually in tears in the tunnel before the match just seeing Maradona in the flesh. A footballing God all over the world without a doubt. I'm from Egypt and I have a tear in my eye reading this.",
                    "score": 54,
                    "author": "PharaohLeo"
                },
                {
                    "level": 1,
                    "comment": "My dad used to swear by him as the greatest of all time. Recently he’d softened his stance in favour of Messi but El Diego was one of a kind",
                    "score": 444,
                    "author": "DrRashfordPM",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My dad is weeping right now, he loved him so much",
                            "score": 238,
                            "author": "Damarugaki",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same over here, guys. Big hug.",
                                    "score": 93,
                                    "author": "Syggie"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My dad still thinks Maradona is the best of all time. And he's a Brazil fan.\n\nPeople of my dad's generation who watched him play are weeping... its extraordinary.",
                            "score": 28,
                            "author": "nikhil48",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Heartbreaking is an understatement. This is possibly the saddest I’ve ever been for football news",
                    "score": 730,
                    "author": "Montuvito_G",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As a portuguese I can't even imagine when the day eventually comes for Ronaldo. Still decades away hopefully. Feel pretty sad for all argentinians",
                            "score": 355,
                            "author": "Shadowgown",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Small solace is the fact us normal meat-sacks likely aren't outliving a Portuguese Greek God",
                                    "score": 376,
                                    "author": "9thredditaccount",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yea there's no way I'm out living Ronaldo, and I'm like 3 years younger. He has access to premium Healthcare and treats his body like a temple. I eat an entire bag of chips while watching him score on my favorite team.",
                                            "score": 283,
                                            "author": "ncocca",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "After what happened to Kobe, you never know.",
                                                    "score": 109,
                                                    "author": "StatMatt",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "And the thing is: Ronaldo is for sure a Portuguese legend and obviously one of the best players ever, but Maradona is a national hero, he won the 1986 World Cup almost single-handedly and scored one of the best goals the world has ever seen (against England). The most amazing part about that World Cup is how dire the rest of the Argentina team was; Maradona caused eternal joy for all Argentinians that year and deserves to be hailed as a hero",
                                    "score": 131,
                                    "author": "sam_293",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; Maradona is a national hero\n\nWay more: Maradona was God on Earth to the argentines. There will be MONTHS of mourning for him. I live near Argentina, was there a bazillion times and they come here to spent summer vacations in my city... and Maradona is a religion to them. When Senna died, MILLIONS of brazilians flooded the streets to see his funeral procession, and i could bet my life that we will se something WAY BIGGER for Maradona in the next days. The country will stop.",
                                            "score": 130,
                                            "author": "DickOfReckoning",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Maradona's importance to Argentinians is almost impossible to measure. Even when Pelé dies I don't think there will be as much commotion in Brazil as there will be in Argentina now. I'm speaking as as Brazilian btw.",
                                                    "score": 31,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Confirmed by: CNN, Clarin, La Nación, TyC Sports, Olé, America TV and whatnot. :(",
            "score": 7611,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 4069,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean,he was like a god for a lot of people. And a legend when it comes to the game.",
                            "score": 2914,
                            "author": "trapsl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A sad day for our beautiful game.",
                                    "score": 1080,
                                    "author": "maxiaoling",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "There is a literal religion about him. Search \"Iglesia Maradoniana\". It's mostly a parody now, but it started as a real new religion by some extreme fanatics of him.",
                                    "score": 546,
                                    "author": "nicolas123433",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I joined them as a joke when I was a kid. I always loved to get their update when his birthday was coming.",
                                            "score": 298,
                                            "author": "manguito86",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I don't even like soccer and I get all emotional when I see his games.  \nHe was out of this world.",
                                    "score": 377,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "His outside persona aside he was the best player I have ever seen. The most skilled player which I have only seen Ronaldinho show similar traits after that, he was amazing and a leader on the field. RIP Diego you will always be remembered fondly for what you did on the pitch.",
                                            "score": 261,
                                            "author": "Steelkatanas",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "RIP, wish I could have seen him play but the reputation is legendary.\n\nIs there a good site to watch old games, or a channel or anything (specifically so I can see some old matches of him?)",
                                                    "score": 84,
                                                    "author": "trashboatfourtwenty",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Try footballia",
                                                            "score": 43,
                                                            "author": "prati_kk",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[This man's reaction](https://www.youtube.com/watch?v=zihxpL9ne3s) :/",
                            "score": 384,
                            "author": "taZz727",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I could only imagine how Argentina is feeling right now. Sad day for Latin American football, sad day for football in general.",
                                    "score": 255,
                                    "author": "Vx1xPx3xR",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 169,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm 40, I feel like crying. First time this happens for a football player, granted most of the players i watched growing up are still around but this will happen more and more, part of getting old.",
                                                    "score": 30,
                                                    "author": "DoJu318",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Guillermo Andino, the journalist, has always said in TV that he is very passionate about fútbol.\n\nTotally understandable, most of our journalists at least met Diego once and had a cool relationship with him, and don't forget how they saw him on his prime. \n\n QEPD Diegote",
                                    "score": 47,
                                    "author": "fedemasa"
                                },
                                {
                                    "level": 3,
                                    "comment": "Heartbreaking.",
                                    "score": 32,
                                    "author": "Gweedoke"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Pundits are more than just pundits, they are human. \n\nNot easy to control emotions when your job is to tell millions of people that their beloved legend is no more.",
                            "score": 117,
                            "author": "Ciao9",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Mate, I'm working late at my desk here and my shirt is wet because I'm sweating due to crying. I have never cried about the death of someone not intimately known to me, but he's been a source of pride for decades in my life, someone who never ideologically abandoned his people, whoever they are, gave us the very few successes we've enjoyed while rightly sticking his fist out at the ones with power who persecute and criticise those without. He was also the greatest player to have ever lived and he loved us and we loved him.\n\nSai, perché, mi batte il corazon? Ho visto Maradona, ho visto Maradone, eh, mamma, innamorato son'!",
                            "score": 542,
                            "author": "oplontino",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I can not imagine the pain in Naples right now.",
                                    "score": 135,
                                    "author": "SliceOfTony"
                                },
                                {
                                    "level": 3,
                                    "comment": "I went to naples last year, took a pizza class and all the teacher could talk about was Maradona and how he ate his pizza. He also said the cocaine stuff was not his fault but because of his knees.  I will never forget the passion Naples has for Maradona.",
                                    "score": 76,
                                    "author": "chanigan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I too have, err, knee problems...",
                                            "score": 77,
                                            "author": "oplontino",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm not even Argentinian, I'm Irish for Christ's sake, and I am feeling distraught like someone who I knew for a long time died.",
                                    "score": 52,
                                    "author": "Action_Limp"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Mariano Verrina: \n\nand one day it happened. One day the inevitable happened. It is an emotional and national slap. A blow that reverberates in all latitudes. A worldwide impact. The sentence that was written several times but had been dribbled by fate is now part of sad reality: **Diego Armando Maradona died**.\n\nhttps://twitter.com/_PaulHayward/status/1331634620346019842",
                    "score": 357,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Im crying like a fucking bitch right now. He means the world to us in Napoli",
                    "score": 1215,
                    "author": "FurioSoprano7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "One of my favorites stories about Maradona is that in the 1990 WC semifinals between Argentina and Italy, held in Naples, many napoletanos were actually cheering for Maradona instead of their own national team. That shows how special he was. RIP Dios.",
                            "score": 629,
                            "author": "liimaitanen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That also shows how deeply Italy was (and sometimes still is) divided, sadly... but yes he was a very special person in addition to being an amazing player (to sua the least)\n\nPeople often hate on Diego for his past with drugs but when he was at Napoli he got into relations with the Camorra... it’s not really his fault. People should have respected him more imo",
                                    "score": 312,
                                    "author": "ZageStudios",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He was a true football genius, and true geniuses are often deeply flawed - e.g. George Best.",
                                            "score": 100,
                                            "author": "Daedeluss",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "George Best did all his best work between the ages of 17 and 25.  His impact on the sport was immense.\n\nEdit: typo",
                                                    "score": 18,
                                                    "author": "In4matics"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Diego cursing the Italians while they were whistling our national anthem on the next match is the most badassery thing made in a pitch ever.",
                                    "score": 28,
                                    "author": "ChemaRojo",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I can imagine, and I think we’re all feeling sad right now... I can’t imagine the day Totti will pass away...\n\nRIP Diego",
                            "score": 267,
                            "author": "ZageStudios",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Am really not ready for the day we lose SAF, it's going to be brutal.",
                                    "score": 190,
                                    "author": "mu_37",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "At least you could say SAF had a long life and its natural, so its more acceptable. Maradonas death is different, died to early and tbh it was kinda called that he wont live long, with his destroying if his own health and poor lifestyle choices.",
                                            "score": 151,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "George Best was a similar story",
                                                    "score": 79,
                                                    "author": "Vapourtrails89",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Best died 15 years ago today actually!",
                                                            "score": 52,
                                                            "author": "Grevling89",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Im sorry man :(\n\nThis year really does suck",
                            "score": 55,
                            "author": "sil445",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I cried when Cruijff died, can fully imagine what you're feeling now :(",
                            "score": 158,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm guessing you're older. Can't imagine what it's like for people who grew up around the time they played.",
                                    "score": 46,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I read Diego's history and how the people of Napoli were basically the same italians that migrated decades before to Argentina.",
                            "score": 117,
                            "author": "AdAlternative6041",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Italian-Argentinians are from all regions of Italy, but yes it’s poetic that Diego’s family could perhaps be coming from Naples",
                                    "score": 126,
                                    "author": "ZageStudios",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Argentina is second Italy.",
                                            "score": 57,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It is common to have southern italian family amongst us italian descendants. My family came from Calabria, Naples and Sicily. One of my strangest experiences was hearing a Naples native speaking spanish, sounded 100% like a Buenos Aires native.",
                                    "score": 59,
                                    "author": "kplo",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "beIN Twitter now too",
                    "score": 61,
                    "author": "thfc11189"
                },
                {
                    "level": 1,
                    "comment": "Oh my god. I'm speechless.",
                    "score": 78,
                    "author": "Ciao9",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Well, fuck. A legend to a country, a legend to the sport.",
                    "score": 44,
                    "author": "Mekfal"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you haven’t yet, watch the 2019 Maradona documentary. It’s incredible. It’s on HBO in the states.",
            "score": 554,
            "author": "tenacious-g",
            "replies": [
                {
                    "level": 1,
                    "comment": "The quality of the pitch side footage is incredible",
                    "score": 166,
                    "author": "gmed88"
                }
            ]
        },
        {
            "level": 0,
            "comment": "RIP. I thought he got better recently",
            "score": 3954,
            "author": "_fmaule",
            "replies": [
                {
                    "level": 1,
                    "comment": "He suffered a brain acv/stroke some weeks ago, his state was delicate  \nEDIT: it seems it was a subdural hematoma and not a stroke",
                    "score": 2001,
                    "author": "Kaiserigen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Damn, must've been a tough few weeks before his death.",
                            "score": 575,
                            "author": "Legendary_Cheerio",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s been a shitty year",
                                    "score": 312,
                                    "author": "agieluma",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Years of abuse on your body will catch up with you. Sad nonetheless. RIP",
                    "score": 1056,
                    "author": "KembaWakaFlocka",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm honestly surprised he lived this long tbh",
                            "score": 762,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "To quote Maradone back in 2014: \"I am 53 going on 78 because my life hasn't been normal. I've lived 80 [years] with the life I've gone through.\"",
                                    "score": 435,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Time goes faster on cocaine",
                                            "score": 246,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Unless you're Keith Richards. Then you're basically invincible.",
                                                    "score": 47,
                                                    "author": "PSChris33",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah. Tragic thing to say about someone who's died at 60. Sadly we'll probably be saying the same about Gazza in the not to distant future.",
                                    "score": 350,
                                    "author": "KnightsOfCidona",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I remember seeing posts on social media saying happy 60th birthday to him and thinking it would be a miracle if he made it to 70. Still wasn't expecting this to happen.",
                                            "score": 163,
                                            "author": "TheJeck",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I didn't somehow expect Pele to outlive him, but Pele is likely to become the Bill Russell of football",
                                                    "score": 66,
                                                    "author": "Acethic",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "In his 60 years, Maradona lived more than 99,99% people live in 100, if that’s any comfort.",
                                            "score": 257,
                                            "author": "TinyMaintenance",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "People are saying he lived life fully to be polite. Not many are actually jealous of the life he lived after football.",
                                                    "score": 66,
                                                    "author": "hurleyburleyundone",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Us argentinians are a battered people. Our economy is famously and historically a joke, our politicians just use as as slaves, everything is always bad and getting worse.\n\nThis man is the only one that ever made us feel happy, proud to be argentinians. He made us feel patriotism. Italians (I know, not everyone, I do not hate italians, MOST ARGENTINIANS ARE 2ND OR 3RD GENERATION ITALIANS) whistle our national anthem? Just pass it to Diego, he will win the match. We went to a moronic war against the English and got our asses kicked? No problem, give the ball to Diego, he will make something and then you will feel happy.\n\nHe was the greatest ever, and a cheater. He was so incredibly smart, and made the dumbest decisions ever. He had everything he needed to be happy, to be the best, yet he always took a wrong turn and ended up badly, but not without having touched greatness moments before.\n\nMaradona was Argentina. Thank you Diego. I'm sorry we as a nation couldn't help you, but I guess we just couldn't, like we can't help ourselves.",
            "score": 488,
            "author": "Motrok",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the most important comment on here.",
                    "score": 50,
                    "author": "narraThor"
                },
                {
                    "level": 1,
                    "comment": "One of the best comments I've seen in 10 years on reddit. Bravo and sorry for your loss. RIP to a true legend, maverick and original.",
                    "score": 28,
                    "author": "tallfranklamp8"
                },
                {
                    "level": 1,
                    "comment": "I've never seen so much poignant regret and pain in a comment, especially the last sentence. \n\nEven for a foreigner far far away, the tragedy of Argentina is known to me. The sad tale of squandered riches and potential, reflected in the mottled greatness of Argentina's most beloved son. There may be other countries like, but not quite like Argentina, but there never has been nor will be someone like Maradona for any other people. There is not enough history or circumstance to permit this. \n\nIt is late, and my addictions are claiming my energy and focus, so I will leave with one last parting word. \n\nThank you, Maradona. Long live Argentina.",
                    "score": 14,
                    "author": "paoro"
                },
                {
                    "level": 1,
                    "comment": "What a comment.",
                    "score": 12,
                    "author": "Bakayokoforpresident"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My uncle died today. He was the ultimate local football fan, in a country where football isn't the most popular sport. He took me to the stadium to see many matches, from 4th division games, local cups, Sunday league, to Copa Libertadores and Copa América events... and he always said that there wouldn't be another one like Maradona.\n\nAs a fan of both, I feel like it's almost poetic that they both died at 60, the same day. \n\nHope they'll meet wherever they are.\n\nEDIT: Thanks for the silver and huuuuuge thanks to everyone that replied to this comment showing their support in these tough times. I'll try to reply and personally thank each one of you. This is a beautiful community. Bless y'all.",
            "score": 4540,
            "author": "darthema",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry for your loss man. Wishing you strength in this difficult moment.",
                    "score": 808,
                    "author": "AppleGun170",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Keep your head up, amigo. Condolences.",
                    "score": 239,
                    "author": "Faintlich",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "What south American country were you in that soccer isn’t the #1 sport?",
                    "score": 116,
                    "author": "dm955",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Looking at his history, he's Venezuelan",
                            "score": 243,
                            "author": "Giggsy99",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wow looked it up and apparently baseball is the country’s most popular sport ahead of soccer",
                                    "score": 151,
                                    "author": "dm955",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "a lot of nations in latin america, central america especially , have extremely talented baseball players",
                                            "score": 85,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "During the early stages of the Cuban missile crisis, U-2 photos from over Cuba showed soccer pitches being built. That’s one of the pieces of evidence that confirmed soviets were building military installations; “Cubans play baseball, Russians play soccer.”",
                                                    "score": 125,
                                                    "author": "ThePrussianGrippe",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "wow incredible.  i believe you but do you have a source?",
                                                            "score": 25,
                                                            "author": "GigglyWalrus",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "\\#5 on this list, though I got a detail wrong. The fields were spotted by a CIA consultant, who then sent a message up the chain. It was then that Kennedy ordered U-2 recon flights over Cuba. https://www.cnn.com/2014/06/05/us/cold-war-5-things/index.html\n\nEdit: fixed number sign, sorry guys!",
                                                                    "score": 39,
                                                                    "author": "ThePrussianGrippe"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's real, confirmed by all news outlets in Argentina",
            "score": 1383,
            "author": "pintobols",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can't even begin to imagine how it's like to be in Argentina right now.\n\nI've seen the way people celebrate a goal, you can hear it in the streets. Argentina breathes football. I can't even comprehend how you all are dealing with this.",
                    "score": 632,
                    "author": "Ciao9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We’re all shocked for now, if there’s a public funeral I gurantee you that there would be million people on the streets",
                            "score": 467,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh wow yeah if there's a public funeral procession or whatever this could get to Senna like levels. That could really be something to see though I guess Covid could impact it potentially.",
                                    "score": 182,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "I guess a public funeral would be forbidden because of COVID raging hard over Argentina right now.\n\nI wonder how the government responds to the thousands of people that will show up to his grave anyways.",
                                    "score": 53,
                                    "author": "AdAlternative6041",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lol The funeral will be held at the national congress and I am not talking about the soccer  fileds of boca and Argentinos.",
                                            "score": 50,
                                            "author": "Nicok33",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "im from argentina, here in the office everyone is shock as hell. \n10 minutes after finding out about it, we had a call with some executive from france and he was like “oh i got the news, you must be sad.. well moving on...” and people from here had to beg him to suspend the call because everyone was super heartbroken, it really felt like the world stopped for a while in here.",
                            "score": 74,
                            "author": "aixcx",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "TyC sports says they are still trying to revive him.\n\nEdit: it's been confirmed",
            "score": 1830,
            "author": "tango_rojo",
            "replies": [
                {
                    "level": 1,
                    "comment": "TyC sports now confirmed it :(",
                    "score": 822,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Feels very surreal, came straight out of left field",
                            "score": 208,
                            "author": "vik0_tal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "To be honest, I don’t think this is unexpected. He has had multiple health issues in recent years and seemingly was on a downward spiral for years.",
                                    "score": 194,
                                    "author": "AWilsonFTM",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They're talking about it in 90 minutos too. Oscar Ruggeri is on the panel. This is heartbreaking to watch",
                    "score": 282,
                    "author": "ArgieGrit01",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Feels like Ruggeri hasnt assimilated the info. Hes so idle, he should go home, its so sad seeing him like this.",
                            "score": 175,
                            "author": "Kuro013",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The way he mentioned Brown and Cucciufo is hard",
                                    "score": 69,
                                    "author": "ArgieGrit01",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Lo estoy mirando ahora, terrible.",
                            "score": 35,
                            "author": "astroargie",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Man, his son was in Italy with coronavirus and couldn't travel when Maradona was in the hospital. I hope he was able to see him before he died",
                    "score": 117,
                    "author": "andysenn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Shit that's awful",
                            "score": 43,
                            "author": "IM_FANTASTIC_LIKE"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know Maradona had his faults, but he gave joy to millions (if not billions) of people. And for many people, those faults just made him more relatable. RIP if true.",
            "score": 2026,
            "author": "doobie3101",
            "replies": [
                {
                    "level": 1,
                    "comment": "Somehow I always really liked seeing him in public. He always seemed to enjoy life and the attention. What I wanted to say is that he always seemed to be his own silly self, which I respect. RIP hero.",
                    "score": 423,
                    "author": "sil445",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He was no one but himself, and you gotta respect that. Gonna miss him",
                            "score": 168,
                            "author": "TigerBasket",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Its billions, I live in India and I do not know a single football fan who doesn't know Maradona, and we have football fans everywhere.",
                    "score": 521,
                    "author": "Raijin_Thund3rkeg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Growing up in the 80s, we all grew up as children of Maradona.  For a young kid in India,  the Hand  of God seemed like cosmic justice against the Brits for colonialism. Our own football team might have sucked,  but we all had Maradona to play on our behalf.  It was plain irrational,  but so is love. Thanks for the memories.  Champ.  May the Gods get to see the magic we were blessed to have watched.",
                            "score": 141,
                            "author": "YearPurple",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Even in the most recondite part of the world if you said Argentina they told you Maradona",
                    "score": 24,
                    "author": "Fortineroo",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is this real?",
            "score": 2211,
            "author": "Brouings",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is all over the Argentinian news. Broadcasters crying live. Its true",
                    "score": 2259,
                    "author": "rochiss",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "don’t think any country will ever love a footballer like Argentina love Diego",
                            "score": 1507,
                            "author": "TheRalphExpress",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That man united the whole nation of Argentina like no one ever did. Icon.",
                                    "score": 1044,
                                    "author": "Ciao9",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Terrible time for a joke but I was genuinely confused why you brought up Man United until I realized I'm a dumbass",
                                            "score": 1844,
                                            "author": "zionooo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm way too shocked to have even realised my terrible wording",
                                                    "score": 444,
                                                    "author": "Ciao9",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I read this like three times trying to work out what Manchester United had to do with anything.",
                                            "score": 198,
                                            "author": "AcesAgainstKings",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I can't lie, I stumbled on this because I couldn't understand how Manchester United fit in",
                                            "score": 118,
                                            "author": "alnmaharaj",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ed almost signed him.",
                                                    "score": 52,
                                                    "author": "ColinZealSE",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 160,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "half-mast",
                                            "score": 127,
                                            "author": "arsenal062"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "half mast, or half staff",
                                            "score": 42,
                                            "author": "discountErasmus"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Sportsman*\n\nThe guy despite all things bad or good, represented \"el pueblo argentino\" and is forever a legend",
                                    "score": 57,
                                    "author": "fedemasa",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I can't say I didn't expect it. But still it's shocking to hear. Rip",
                            "score": 92,
                            "author": "Brouings",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Brazilian media is also reporting/confirming it",
                    "score": 58,
                    "author": "bodebrusco",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Clarin is quite reliable",
                    "score": 54,
                    "author": "SeleccionUruguaya",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm from New Zealand so football isn't big here at all, but I was lucky enough to do an exchange for my last year of high school to South America and spent a lot of time in Argentina. It blew my mind that you would walk into people's houses and on the wall there'd be two framed photos. One of Jesus and the other of Diego, will be a tough day for a lot of people.",
            "score": 63,
            "author": "DudstownScarfie",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Rest in peace you Cosmic Kite",
            "score": 471,
            "author": "PM_ME_YR_TROUBLES",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"From what planet did you come to leave so much English on the road, so that the country is a clenched fist screaming for Argentina?\n\nThank you, God, for football, for Maradona, for these tears, for this Argentina 2 - England 0\" \n\nV. H. M.",
                    "score": 104,
                    "author": "romanagr"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Same date as George Best, 15 years apart",
            "score": 343,
            "author": "Johnny_Shitbags",
            "replies": [
                {
                    "level": 1,
                    "comment": "[and Fidel Castro](https://pic.17qq.com/uploads/dckhgklgdv.jpeg), four years apart",
                    "score": 110,
                    "author": "hawkalpin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What a weird fact lol",
                            "score": 47,
                            "author": "ArvasuK",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not as weird when you remember Fidel and Maradona were buddies.",
                                    "score": 65,
                                    "author": "Bakatora34",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Doesn't that make it more weird that they died on the same day?",
                                            "score": 51,
                                            "author": "Terran_it_up"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Left a mark on the game that will never be forgotten.",
            "score": 53,
            "author": "IP14Y3RI"
        },
        {
            "level": 0,
            "comment": "God damn, never thought this day would come. Feels surreal.\n\nLet us remember him for the amazing player he was.\n\nRest in peace Dieguito, you earned it.",
            "score": 2661,
            "author": "Kuro013",
            "replies": [
                {
                    "level": 1,
                    "comment": "He was before my time (and I'm sure a lot of you as well), but man, everything I've read about his footballing career makes it seem like he was a real-life superhero. RIP and my condolences to his family.",
                    "score": 687,
                    "author": "BeenWavy07",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was lucky enough to have watched him in the 1986 World Cup (even the one before). He was pure magic. Incredible incredible player.",
                            "score": 154,
                            "author": "Give_me_5_dollars",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I saw him in 1998 at Trade in Ibiza, leaning up against the VIP bar biting the heads off of flowers*.\n\n*Vase not Tim",
            "score": 47,
            "author": "interior-space",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I can not believe this, even with all of the recent news I still can’t believe it.",
            "score": 2713,
            "author": "_Konstantinos_",
            "replies": [
                {
                    "level": 1,
                    "comment": "He has hardly treated himself well and has been in awful health for a long time. It is not the most unexpected news to hear.",
                    "score": 1644,
                    "author": "Vegan_Puffin",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Espn say the same and more news, omg we gonna have like a million cases of covid, a lot of people is going to be on his funeral",
            "score": 1318,
            "author": "Sognar7",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 294,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It goes beyond Boca there are maradona fans from river newells almost every club",
                            "score": 266,
                            "author": "Sognar7",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "the whole world actually. it's crazy",
                                    "score": 113,
                                    "author": "AkatsukiEUNE",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Didn't Rosario Central even hand him a plaque?",
                                    "score": 72,
                                    "author": "pintobols",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In the last year while he was dt for Gimnasia he got a plaque in all the stadiums",
                                            "score": 65,
                                            "author": "Sognar7",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, even club rivals loved him",
                                                    "score": 29,
                                                    "author": "pintobols",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Covid is so cruel. People can't even mourn in peace.",
                    "score": 611,
                    "author": "Ciao9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's heartbreaking, let's see how it's going to unfold. I doubt the Argentinians will just pass on the mourning process for this one, nothing brings that country together like football and they just lost their biggest.",
                            "score": 289,
                            "author": "AlmostNL",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "three national days of mourning are scheduled",
                                    "score": 22,
                                    "author": "TheRalphExpress"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ruggeri old teammate and friend is on TV, and says he couldn't visit him",
                            "score": 86,
                            "author": "Sognar7",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Goodbye Diego. With all the good and bad, there will not be another like you.",
            "score": 290,
            "author": "thebluetistaar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Truly. Football lost a real one today",
                    "score": 43,
                    "author": "Rohan-Ajit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "holy shit. RIP to a legend.",
            "score": 62,
            "author": "Servalarian"
        },
        {
            "level": 0,
            "comment": "RIP. Definitely burned out rather than faded away.",
            "score": 338,
            "author": "IwillNoComply",
            "replies": [
                {
                    "level": 1,
                    "comment": "It may have been 60 years since he was born but he lived 100 years",
                    "score": 247,
                    "author": "slyfox1908",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "he is eternal",
                            "score": 11,
                            "author": "denisorion"
                        },
                        {
                            "level": 2,
                            "comment": "That's a beautiful way to put it",
                            "score": 33,
                            "author": "MrD3ath"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "No!?\n\nOne of the greatest of all time, the 86 World Cup is the best by one player ever.",
            "score": 649,
            "author": "sheikh_n_bake",
            "replies": [
                {
                    "level": 1,
                    "comment": "Goal of the century and Hand of God within the same game, much less the same tournament.\n\nOne of very few players in existence where the most viable tactic against him was to just foul him",
                    "score": 445,
                    "author": "Tsenta",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Telling quote from Gary Lineker:\n\n“When Diego scored that [second goal](https://youtu.be/1wVho3I0NtU) against us, I felt like applauding. I’d never felt like that before, but it’s true… and not just because it was such an important game. It was impossible to score such a beautiful goal. He’s the greatest player of all time, by a long way.\"",
                            "score": 181,
                            "author": "twiggez-vous"
                        },
                        {
                            "level": 2,
                            "comment": "Incredible player, I went through and watched every game he played that tournament. He was truly unplayable, I doubt we'll see the likes of him again.",
                            "score": 42,
                            "author": "sheikh_n_bake",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "There's a film somewhere of Maradonna being absolutely hammered out of the 82 world cup, just a litany of succesive fouls that made sure he had a quiet tournament",
                            "score": 122,
                            "author": "dustaz",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "My dad has always said that England had 3 or 4 opportunities to hack him down during his goal of century, which they did! Diego was just too good to get hit.",
                            "score": 32,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "I grew up hearing stories about those goals before i ever developed interest in football, he'll never be forgotten in this sport.",
                            "score": 10,
                            "author": "mu_37"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is this legit ? Fucking hell",
            "score": 552,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "TyC and a few others say they're still trying to revive him it seems, so who knows.\n\nEdit: nevermind not anymore... RIP",
                    "score": 142,
                    "author": "flae99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This cant be happening man. I refuse to believe this",
            "score": 682,
            "author": "FurioSoprano7",
            "replies": [
                {
                    "level": 1,
                    "comment": "I remember this thing where someone released a list of hacked passwords of Neapolitans....  \n\n\nMost of the passwords were variations of his name, like Maradona1926, Diego123 etc.  \n\n\nRIP, man.",
                    "score": 173,
                    "author": "tanstaafl_why"
                },
                {
                    "level": 1,
                    "comment": "With Maradona dies a part of Napoli and Neapolitans too. I am so shocked right now. R.I.P. Diego a football god on Earth and now in Heaven.",
                    "score": 390,
                    "author": "dariop94",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I knew that problems affected his life and he has been in a bad spot, but i was never prepared to deal with the fact that we might lose him one day. \n \nI know people crying about celebrities is weird because you have no bond to them. But Maradona meant the world to us in Napoli, words cannot describe what he did for us. This feels like losing a father to me",
                            "score": 159,
                            "author": "FurioSoprano7"
                        },
                        {
                            "level": 2,
                            "comment": "We're all in sorrow with you, Napoli.  Yes he may have worn certain jerseys but he was a football god to all of us.  RIP!",
                            "score": 63,
                            "author": "italiansocc3r10"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A sad day for Napoli. Diego was an absolute legend of the game, and it won't just be Napoli and Argentina fans that shed a tear today. All football fans across the world are with you on this.",
                    "score": 25,
                    "author": "Meath77"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can't fucking believe it. One of my first ever football memories is Maradona crying after the 1990 WC final loss. Football is a bit dead today :'(",
            "score": 182,
            "author": "Utegenthal",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Fuck. Too soon. RIP magician.",
            "score": 648,
            "author": "aibrahim1207",
            "replies": [
                {
                    "level": 1,
                    "comment": "Football has lost one of it's biggest icon today",
                    "score": 212,
                    "author": "Bushuazoo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The biggest for a lot of people. RIP",
                            "score": 107,
                            "author": "AkatsukiEUNE"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "FUCK, I was reading Galeano's book about football just yesterday and the chapters about him were just wonderful  \n  \nBrazilian banter aside, they made me admire him even more",
            "score": 173,
            "author": "Lukanian",
            "replies": []
        },
        {
            "level": 0,
            "comment": "“What I could do with a soccer ball, Maradona could do with an orange.”  - Platini\n\nRIP Legend.",
            "score": 21,
            "author": "wizardkell3y"
        },
        {
            "level": 0,
            "comment": "The polemics and flaws are a big part of Maradona's myth and what makes him such a legendary personality, the biggest in football history. You can't have Maradona without his flaws or imagine his career if he hadn't become a drug addict. He was someone who knew how to be relatable, passional and earn the love of supporters and living life to its extremes. There are plenty of amazing docs, books and films to find if anyone wants to understand why Maradona is such a mythological figure and why his legacy is eternal and transcends football more than any other player ever.\n\nArgentina vs. England in 1986, for example, was the ultimate f**k you to England after Argentina lost the war for the Falklands' Island and England was very disliked, hated even, by argentinians. And England is still not a very sympathetic country from a South-American perspective. England is seen as stiff, arrogant, possessing superiority complex and unique smugness.\n\nAnd then we have what Maradona did for Napoli, a region historically discriminated by the rest of Italy and also financially poorer. He is an eternal idol there!",
            "score": 24,
            "author": "matbezlima",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Look, I wont say anything new for sure. But... I need to get it out of my chest.\n\nIm from spain, born in 1995, never got to see Diego live. Thanks to my team being Deportivo de La Coruña I have seen many of the very best footballers in history. AC Milan during their height (when they played both finals against Liverpool), both Barcelonas that completed the treble, Mourinho's and Zidane's Real Madrid, the rise of Cholismo, I have seen Ronaldinho, Kaká, Cristiano Ronaldo, Xavi, the whole spanish squad that dominated all the competitions... Many times, many many times on the field, just 20 meters, at best, from me.\n\nBut trust me... I always tried to imagine the feeling of watching Maradona libe. Not Pele, not Di Stefano, Eusebio or any other.\n\nI watched Messi live and always thought that I was glad that at least my children and grand children will get to hear from him directly from me.\n\nAlways loved seeing Banega, Gago, Riquelme and Redondo and trying to think that, in their very best day they might get close to the playstyle that Diego had.\n\nDiego just feels like the creator of the game that I love, a romantic style to it, the ball close to your foot, a player that fights for the ball, that knows how to dribble in short distances...\n\nHe might have made many, and I mean many, mistakes in live, for sure. And I am not trying to say: man, lets forget it. But he was joy to the people and created a culture behind him for a reason.\n\nI just hope that he was happy during his life and want to show my sincere admiration for making me feel like football was more than just a sport just by watching his main matches, tons of clips yes..., and all the documentaries avaliable in the world.\n\nMy number as a player was always 4, but always wanted to be the one wearing his number 10.",
            "score": 463,
            "author": "imTonchu",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm not trying to one up or brag or anything, I just want to share a random fact. The first time my dad took me to a football match it was France vs Mexico in 2006 (test matchs before World Cup). It happened to be Zidane's last match at the Stade de France, and as he got subbed out for a standing ovation he was replaced by a young dude playing for the first time for France : Franck Ribéry.\n\nI was 10 back then, but I will always remember that night. The size of it all, the stadium, the roars of the crowd. And Zizou.",
                    "score": 40,
                    "author": "ThePr1d3"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A sad day\n\nAnd if you haven't, you should watch Asif Kapadia's film on him, absolutely brilliant piece of work...",
            "score": 73,
            "author": "_rickjames",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Sad, but not so shocking, the guy had so much mental and physical problems.\n\nRIP",
            "score": 396,
            "author": "IdanTs",
            "replies": [
                {
                    "level": 1,
                    "comment": "True, cocaine takes its toll",
                    "score": 150,
                    "author": "vik0_tal",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Truly sad news, wasn't there a recent vid where he had a dealer bring him cocaine in the middle of managing a match?",
                            "score": 87,
                            "author": "pakiet96",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah there was. And when they found out the camera was filming him, the other staff members came to stand in front of him, to block the view of cocaine exchanging hands. Hilarious. Sad.",
                                    "score": 129,
                                    "author": "Kensei01"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know his health has been bad recently but he was one of those larger than life figures that seemed immortal in that way. RIP",
            "score": 61,
            "author": "RallyPigeon",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Unfortunately It is true. \n\nRIP Dios.",
            "score": 104,
            "author": "pascualama",
            "replies": []
        },
        {
            "level": 0,
            "comment": "is it confirmed?",
            "score": 23,
            "author": "Archias1995",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes",
                    "score": 24,
                    "author": "PaperSonic"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Gracias Maestro!",
            "score": 20,
            "author": "impatientimpasta"
        },
        {
            "level": 0,
            "comment": "Latin American idol. You made so much, not just for Argentina, for our continent, our people, the whole world. We will miss you. RIP. Eternal respect from Brasil.",
            "score": 34,
            "author": "brazilian_liliger"
        },
        {
            "level": 0,
            "comment": "I’ve kept it together until I listened to Ray Hudson break down describing his impact on the world—“in Argentina, there’s a football pitch with statues of the England defenders when Maradona scored that beautiful solo goal in the World Cup. But his statue isn’t there—because the children of his homeland are meant to be him. In that small escape from their sometimes heart wrenching, broken home lives, the children of Argentina are the hero for their country.”",
            "score": 11,
            "author": "ltplummer96"
        },
        {
            "level": 0,
            "comment": "I didn't know this would pain me so much as an Egyptian who has nothing to do with Boca, Napoli or Argentina, but I love the beautiful game of football and I can appreciate his legendary career. In fact, I just watched HBO's Diego Maradona documentary last week for the first time. \n\nRIP, Maradona, you'll always be THE football icon in my book. 🙏",
            "score": 9,
            "author": "tarekelsakka"
        }
    ]
}