{
    "id": "11bxxzl",
    "score": 0,
    "title": "Potential incoming - seeking Apparel Merchandising/Management program info",
    "author": "kosmiccookie",
    "date": 1677364679.0,
    "url": "https://www.reddit.com/r/CalPolyPomona/comments/11bxxzl",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi!  My kid (not on Reddit-) was recently accepted for the Apparel Merchandising/Management program  and hoping to get some insight from current students before making decisions.  pros/cons of attending CPP for what looks to be an outlier of a program in a sea of Engineering and Science majors? Quality of professors and class experience? Campus life?  Any feedback would be great.  Recently toured campus and housing and everything seemed nice and as expected there.  Thanks for any input!\n\nEdited to add clarity to who was posting.",
    "comments": [
        {
            "level": 0,
            "comment": "As someone who isn’t part of the sciences/Engineering, I can say I’ve loved my experience at CPP. I had the same concerns that since it was an engineering school that I wouldn’t get the best quality education. I feel like I got the best possible education &amp; for the best price. I also find that it’s easier to transfer over units from a community college over to cpp (as opposed to private universities). The professors are amazing and genuinely care about their students. Of course there is a couple of professors who aren’t the best but I’m sure every school has those. \n\nUnless your child is active in clubs or actively seeks friendships/social events there won’t be much. Since this is a commuter school it’s a little bit harder socially. I personally made my first friend after three years because I’m not very social &amp; also a commuter.",
            "score": 0,
            "author": "Savooosim",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the info.  That's very helpful.",
                    "score": 0,
                    "author": "kosmiccookie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The area surrounding campus also doesn’t have much around it. A couple restaurants here and there and of course there’s the chino hills shoppes. If your child is looking for more of a campus to have fun surrounding activities/livelihood, I would recommend UCI.",
            "score": 0,
            "author": "Savooosim"
        }
    ]
}