{
    "id": "11rg8lm",
    "score": 2,
    "title": "Housing suites waitlist?",
    "author": "jaws4671",
    "date": 1678840442.0,
    "url": "https://www.reddit.com/r/CalPolyPomona/comments/11rg8lm",
    "media_urls": [],
    "other_urls": [],
    "postText": "The emails went out yesterday to which wave you are in to get a room for housing suites, the newsletter on the 10th said if you don’t get an email assume you’re on waitlist.\n\nI didn’t get an email but turned in my application about 2-3 hours after it opened because I had a class in the morning. \n\nI’m assuming I’m waitlisted but confused on what to do next because I can’t commute. I also have to wait till April to know which spot I’m on the waitlist so I don’t know if I should stay and hope or try something else.\n\nIs anyone familiar with the process or have been in a similar issue before?",
    "comments": [
        {
            "level": 0,
            "comment": "It seems like there was a lot more than expected that applied for housing this year based on what she said from the zoom last week. She said that there was high traffic on the site that morning and many got their application in at exactly 7:30. She was pretty confident in saying she would get appointments out by 5pm on Monday too. I was able to get mine in at 7:31 but the site was slow. I got my appointment on Monday through email. If you are for sure on the waitlist, what I did last year was explain my situation. I told them I had to live on campus and that I can’t commute because I won’t have a car and live hours away. I think they put a note on my account and it bumped me up the waitlist. I got into the dorms, so I kept calling and waited for someone to cancel from the suites and eventually got a room in the suites around July.",
            "score": 3,
            "author": "beanncheeseburritos",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also make sure to check if someone in your roommate group got the email instead. They would select the rooms for everyone.",
                    "score": 1,
                    "author": "beanncheeseburritos"
                }
            ]
        },
        {
            "level": 0,
            "comment": "We are having the same issue, I want to chalk it up to just cpp being late with everything",
            "score": 2,
            "author": "Fast_Statistician725"
        },
        {
            "level": 0,
            "comment": "i emailed housing, and it was a little confusing, but to be considered for housing, you have to pay the deposit or defer on top of submitting the application. I did not receive and email, nor did my roommates, and i submitted it at 7:36 on March 1st and payed only 2 days later. my best guess is when you payed effects your position on the list. I do not know what is going on, from the email they said that after all the room appointments go out they may do a 4th wave or manually assign students",
            "score": 0,
            "author": "sun_rot",
            "replies": [
                {
                    "level": 1,
                    "comment": "I turned in my application at 10:30 on the first and paid 1 day later. I think it also takes that into account but I still didn’t get in.",
                    "score": 3,
                    "author": "jaws4671"
                }
            ]
        }
    ]
}