{
    "id": "11smrpo",
    "score": 33,
    "title": "I'm sorry what does this even mean??",
    "author": "gracethechickenface",
    "date": 1678950063.0,
    "url": "https://www.reddit.com/r/CalPolyPomona/comments/11smrpo",
    "media_urls": [
        "https://i.redd.it/uk5twsfjc3oa1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Provide a doctor’s note proving COVID exposure/infection and you’ll be excused from whatever you’re trying to get out of",
            "score": 68,
            "author": "RoadDino2001",
            "replies": [
                {
                    "level": 1,
                    "comment": "But how does a Dr know you were exposed to someone who tested positive with an at home test? After exposure it can take 5 days to test positive yourself.",
                    "score": 9,
                    "author": "AFlamingKitten",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They don't. But the added obstacle of getting a doctor's note at all will deter students from simply using it as an excuse to not do something.",
                            "score": 13,
                            "author": "84danie"
                        },
                        {
                            "level": 2,
                            "comment": "1. This is probably just a CYA for the faculty member. All kinds of reasons for that. \n2. I could be wrong, but I think the phrase, \"butts in seats,\" applies to colleges as well. To remain accredited (and probably to receive state funding), I think there requires a certain building occupancy percentage or else it is at risk of losing it. Pretty sure this is why everyone had to come back to campus instead of offering more online courses. \n3. I'm no longer a student, but was there ever a good system to prevent cheating on tests, etc. .with all the going remote stuff? \n4. Pineapple on a pizza or no?",
                            "score": 3,
                            "author": "PolyPonies",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think there has to be a certain responsible level to it. Missing a couple normal lectures due to an exposure should not require OP to go get a note. Let’s not forget we agree there is no way for a Dr. to know if someone was exposed. If OP goes on campus to the health center WE as CPP students pay for it (assuming my memory is correct that the health center is funded via tuition).\n\nEdit: pineapple can be on pizza and I’ll eat it but I don’t think iv ever ordered it.",
                                    "score": 2,
                                    "author": "AFlamingKitten",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Agreed on making exceptions for certain conditions if this is about getting attendance points that can affect a student's grade. I don't think making a blanket exemption for covid exposure--given its 10 day window-- is really formidable with the standardized format of a 16 week course. That's missing a good chunk of the course and exposure can happen multiple times in a semester. The doctors note seems excessive--making me believe this professor is having some kind of issue with getting students to pass this class. Again, CYA #1 on the list. Making two versions of a course (one for online and one for in-person) is doable, but irritating for professors. Some have major issues with making the quality and equity possible. Some have technical handicaps or are not in-tune with the constant change of software programs they need to learn to stay relevant. The easiest way to prevent this is just make students come to class. I think a lot of it boils down to legal exposure as their primary goal is to educate you and prove to the state you retained the information.\n\n&amp;#x200B;\n\nI don't think I've ever ordered it either. CPK does a decent Hawaiian BBQ chix pizza though..",
                                            "score": 0,
                                            "author": "PolyPonies",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "CPP hasn't updated its covid policies in 2 or 3 years, which is a big part of the confusion.  People can disagree on how bad covid is at this point, but I think we can all agree that policies based on our understanding of covid 19 circa March 2020 are outdated in March 2023.",
                                                    "score": 3,
                                                    "author": "Chillpill411",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "So true. Is the professor tenured or adjunct? Adjunct professor's have a lot less influence in the department and will bend to the student's needs more likely than not. I think the most important thing to keep in mind is-- what does a grade mean in real-life? If quarantining without a doctor's note affects your ability to graduate or take the subsequent course you need--making petitions to the department chair or the dean is a really smart way to go. For example, if you were on the cusp of passing and this made you not pass, absolutely argue for/petition your case. Getting students out (graduating) is really important to programs. If this is just about getting a certain GPA for graduate school, etc, unfortunately, I think the professor has the high-ground.",
                                                            "score": 0,
                                                            "author": "PolyPonies"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If you can cheat on a test by looking up the answer, it’s not a good test. That doesn’t rest your knowledge, it tests your recall.",
                                    "score": -3,
                                    "author": "lemonlimespaceship",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So why are you not allowed to have phones and laptops out during tests? Is it the professor's fault that you can look-up the answer? Or is the point of learning to recall the information, skills, etc? I understand where you are coming from, but that doesn't mean it's a bad test necessarily.",
                                            "score": 2,
                                            "author": "PolyPonies"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Face palm*",
            "score": 14,
            "author": "bedheaddavy"
        },
        {
            "level": 0,
            "comment": "too many people were trying to get excused from their class, they might've been suspicious and now require a doctor's note for absences.",
            "score": 10,
            "author": "jesusandpals777"
        },
        {
            "level": 0,
            "comment": "You need an excusal from a medical provider. It's pretty clear and straightforward. Go to urgent care and convince a doctor to give you a note.",
            "score": 26,
            "author": "djwoodie98",
            "replies": [
                {
                    "level": 1,
                    "comment": "“Expose urgent care staff to covid unnecessarily so that your professor doesn’t get butthurt”",
                    "score": -2,
                    "author": "lemonlimespaceship",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Who says they still have covid? This comment wasn't helping op nor was it pushing the conversation forward.",
                            "score": 2,
                            "author": "djwoodie98",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My comment addresses the fact that the professor wants students to risk themselves and others instead of encouraging them to take necessary precautions. Sending students to an urgent care can expose staff there and the student themselves. The only *safe* thing to do when exposed is quarantine yourself until you’re sure that you didn’t catch it. It is not necessary, per medical advice, for people to confirm exposures with a PCR test, which is the only thing a doctor will do. You cannot confirm that you do not have covid until 3-5 days after exposure.\n\n*edited for spelling, oops",
                                    "score": 1,
                                    "author": "lemonlimespaceship",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Also, a simple urgent care visit can be hundreds of dollars and many hours (up to six in this area alone).",
                                            "score": 5,
                                            "author": "lemonlimespaceship",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Medical and Medicare should cover that. The hours thing is true though.",
                                                    "score": 1,
                                                    "author": "djwoodie98"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Are you thinking of an an ER? I don’t think I’ve ever waited more than 15 min for an urgent care appt, you can make one online so you don’t show up and have to wait around.",
                                                    "score": 0,
                                                    "author": "HonestBeing8584"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wym bruh",
            "score": 16,
            "author": "axel7530159"
        },
        {
            "level": 0,
            "comment": "Can u read",
            "score": 9,
            "author": "No-Carpenter-5860",
            "replies": [
                {
                    "level": 1,
                    "comment": "no why do you think I am asking",
                    "score": 1,
                    "author": "gracethechickenface"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can see your frustration but I'm sure there might be a trend that this professor/department is noticing that right around a big exam or a big project due date that suddenly a lot of students are getting COVID. Providing proof for COVID can come in many forms for many different professors. Some may ask for a simple positive at-home test while some may ask for a doctor's note. If you do unfortunately get COVID and do happen to get Paxlovid, that's a great way to show a professor that you have COVID but nowadays COVID is becoming like any other sickness where teachers expect some form of proof. I wish each teacher's attendance policy (if they have an attendance policy) was mandated to allow students a certain number of sick days. I've had a professor drop my attendance grade by 7 percent because I missed one day as I got a terrible stomach bug and had to rush to the Student Health Center to get IV fluids and anti-nausea medication. I sent him my doctor's note saying that I should go home and rest and I was excused from any activity including class and he still didn't excuse it. There should be some general reform to attendance policies.",
            "score": 3,
            "author": "S3XYEngineer"
        },
        {
            "level": 0,
            "comment": "Insane 😭",
            "score": 4,
            "author": "Letsrockandroll2002"
        },
        {
            "level": 0,
            "comment": "Maybe a positive test result",
            "score": 2,
            "author": "microman12100"
        },
        {
            "level": 0,
            "comment": "It means that your professor is a)classist &amp; b)inconsiderate of others’ health. Possible c) Covid denier. Guess they don’t care if you expose others who may not be able to afford (physically and financially) to get sick!\n\nI think your classmates would love to know that you’ve been exposed to Covid and are being forced to come to class and possibly expose them as well! Go to canvas and send a message to everyone in the class (students), and email the chair of your college. First part is relevant because the more people who know about your professor willing to risk their health, the more of them will [hopefully] also send emails to appropriate individuals.",
            "score": -3,
            "author": "starbycrit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol downvote me please. I get off on it\n\nETA downvoted myself too, feels good, that comment was stupid just downvote the fuck out of it",
                    "score": 1,
                    "author": "starbycrit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Find a fake doctors note online and submit that. Ideally using a local hospital’s info so it looks more real",
            "score": -7,
            "author": "fuckoffredit123456"
        },
        {
            "level": 0,
            "comment": "You can go to a doctor and tell them you were exposed. They can still test you, take vitals, ask about symptoms, and write a note based on that, along with giving recommendations.",
            "score": 1,
            "author": "ManCakes87"
        },
        {
            "level": 0,
            "comment": "Some context: my partner (who I spend nearly every day with, either on or off campus) tested positive for COVID on Tuesday. According to CPP safer return guidelines I can still come to campus even though I was literally exposed to him every single day up until he tested positive. He tested with an at-home test and there was no doctor involved. How am I supposed to explain to my doctor that they need to verify my exposure to someone else's COVID case that was not diagnosed by that practitioner?\n\n\nUpdate: I am now showing symptoms but it hasn't been long enough since most recent exposure to reasonably expect a positive test result.",
            "score": 1,
            "author": "gracethechickenface"
        }
    ]
}