{
    "id": "11xowhi",
    "score": 24,
    "title": "Repair cafe today 12-4ish",
    "author": "DrJoeVelten",
    "date": 1679421761.0,
    "url": "https://www.reddit.com/r/CalPolyPomona/comments/11xowhi",
    "media_urls": [],
    "other_urls": [],
    "postText": "Come one, come all, let's take a look at your stuff.  I suspect this might be a slow day due to the whole 'rain and electronics do not mix' issue, but we'll still be there ready to help.",
    "comments": [
        {
            "level": 0,
            "comment": "So far we have a Quadro k5200, 2 electric skateboard that we've managed to revive, and a 2013 MacBook air that we think should be back up and running after some water damage.  \n\nEDIT: Oops, the macbook is giving us fits again.  Might be the keyboard, sometimes they also get messed up after water damage.",
            "score": 6,
            "author": "DrJoeVelten",
            "replies": [
                {
                    "level": 1,
                    "comment": "when are you guys holding the next repair cafe?",
                    "score": 2,
                    "author": "dustybeagle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "After spring break, I try to be at the maker space here every Tuesday.",
                            "score": 2,
                            "author": "DrJoeVelten"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Alum here, shame I couldn't be there to check these out. I have an old graphics card that I'm not sure works, and I've been meaning to try and find someone to test it out. I'd pay good money, too!\n\nIn any case, thanks for what you do Dr. Velten!",
            "score": 5,
            "author": "funnystuff97",
            "replies": [
                {
                    "level": 1,
                    "comment": "... Pay money?  That'd go against the spirit of the repair cafe.  Happy to help however I can.  If you can't show up during the regular hours, I'm sure we can arrange something for it.",
                    "score": 3,
                    "author": "DrJoeVelten"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Where",
            "score": 2,
            "author": "Big-Tax8691",
            "replies": [
                {
                    "level": 1,
                    "comment": "2nd floor of the library, in the maker space.  Come on over, you can't miss it.",
                    "score": 3,
                    "author": "DrJoeVelten"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dang if I had known sooner I would have brought my switch :/",
            "score": 2,
            "author": "The_Rat_King_",
            "replies": [
                {
                    "level": 1,
                    "comment": "1. There's always the week after spring break\n2. What's up with it? Some common issues I've seen with switches have easy software solutions.",
                    "score": 1,
                    "author": "DrJoeVelten",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh i'll definitely come after spring break! And i have no clue what's wrong with it, it just won't turn on even after charging.",
                            "score": 1,
                            "author": "The_Rat_King_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It turns on when plugged in?",
                                    "score": 1,
                                    "author": "DrJoeVelten",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The last time I tried to use it, it wouldn't turn on at all whether plugged in or not. I haven't tried since then either and that was around October.",
                                            "score": 1,
                                            "author": "The_Rat_King_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well then, l certainly can give it a shot.  Sometimes it's as simple as a worn charger port.  Happens way more than you might think, especially with mobile electronics",
                                                    "score": 2,
                                                    "author": "DrJoeVelten",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "much appreciated! What day is it going to be again?",
                                                            "score": 2,
                                                            "author": "The_Rat_King_",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Tuesdays 12-5ish.",
                                                                    "score": 2,
                                                                    "author": "DrJoeVelten"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Aight, I'm buttoning up, I gotta get my kid from daycare, and I'm betting the weather is going to make the drive an issue.",
            "score": 2,
            "author": "DrJoeVelten"
        },
        {
            "level": 0,
            "comment": "Would I be able to bring my Polaroid? After Spring Break of course Lol.",
            "score": 2,
            "author": "Major_Professional60",
            "replies": [
                {
                    "level": 1,
                    "comment": "It'd be a novel repair attempt for me, but we can give it a shot.",
                    "score": 1,
                    "author": "DrJoeVelten"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do you accept donations like a broken appliances like Air Fryer and Blender. I'm looking for somewhere to property dispose of or recycle these two electronic items",
            "score": 1,
            "author": "BlasterFluff",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dunno about disposal or recycling, honestly. I feel like somebody might know. I'll ask around.",
                    "score": 2,
                    "author": "DrJoeVelten",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have some old, obsolete laptops I would like to properly dispose of as well.",
                            "score": 2,
                            "author": "Thonking_about_it",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How old and how obsolete?  You'd be surprised how old a laptop needs to be before it can't be a glorified chromebook internet browser machine.",
                                    "score": 1,
                                    "author": "DrJoeVelten",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Two of them are at least 10 years old.",
                                            "score": 1,
                                            "author": "Thonking_about_it",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If they're old thinkpads, they'd make \\*excellent\\* chrome books.",
                                                    "score": 1,
                                                    "author": "DrJoeVelten"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}