{
    "id": "11y6jk9",
    "score": 6,
    "title": "How strict are they with commencement ceremony tickets?",
    "author": "CaptainYohas",
    "date": 1679458468.0,
    "url": "https://www.reddit.com/r/CalPolyPomona/comments/11y6jk9",
    "media_urls": [],
    "other_urls": [],
    "postText": "So they are giving us 8 tickets for this year graduation, from previous experience how strick are they at checking? 😂😂 wondering if a few extra people show up if they can easily sneak in or if they don't even check.",
    "comments": [
        {
            "level": 0,
            "comment": "graduated last spring and stuck by the rules. My family told me that they didnt even check the tickets they just let them in. Was pissed cuz I had my cousins watching from the livestream in parking lot smh lol",
            "score": 19,
            "author": "Loud-Lifeguard391",
            "replies": [
                {
                    "level": 1,
                    "comment": "As far as tickets, did they give everyone like a QR code or was it physical?",
                    "score": 6,
                    "author": "Prize_Set3251",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "QR Codes!",
                            "score": 2,
                            "author": "Loud-Lifeguard391"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Really? Dude that sucks. I would have texted them real quick like pull up, they are not checking.\n\n🤔🤔, well maybe if a few extra heads show up ill tell them to blend in and follow the crowd if no one checks.",
                    "score": 6,
                    "author": "CaptainYohas",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i wouldve, but i was told after walking. I graduated w a degree in Kinesiology which was on the last day, Sunday. So, idk if that had to do with them just letting people in haha",
                            "score": 5,
                            "author": "Loud-Lifeguard391",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ahh, I see, idk maybe. 🥲🥲 I'm accounting and this year the ceremony is on a Tuesday at 8 am, like wtf, random day.",
                                    "score": 6,
                                    "author": "CaptainYohas"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm going to be having more family and friends showing up to my graduation and seriously 8 ticckets is not enough. it's nice to hear in here that they may not even check the QR code",
            "score": 2,
            "author": "xSugarpastel"
        },
        {
            "level": 0,
            "comment": "I hope Billy Bronco will be checking tickets. If you don't have one, he'll use his billy club.",
            "score": 2,
            "author": "PaulNissenson"
        },
        {
            "level": 0,
            "comment": "With the way it was set up last year, coming from building 8 side there was no one monitoring if people were coming from that way, if you look like you’re about to buy a snack and then just walk to a seat I feel like no one would even notice? I literally just walked through the seating area on my way to take my last final through that way lol",
            "score": 1,
            "author": "InternalWonder115"
        }
    ]
}