{
    "id": "11youbh",
    "score": 41,
    "title": "Happy birthday CPPMechEngTutorials!",
    "author": "PaulNissenson",
    "date": 1679503696.0,
    "url": "https://www.reddit.com/r/CalPolyPomona/comments/11youbh",
    "media_urls": [
        "https://www.reddit.com/r/CalPolyPomona/comments/11youbh/happy_birthday_cppmechengtutorials/"
    ],
    "other_urls": [
        "https://www.youtube.com/user/CPPMechEngTutorials)"
    ],
    "postText": "Gather round the campfire young ones and I'll tell you a tale from long, long ago. Let's go back in time 10 years to March 22, 2013. It was a time before COVID and TikTok. A time when my hair was all pepper and no salt.\n\nOn that day, my department started a [YouTube channel](https://www.youtube.com/user/CPPMechEngTutorials) with a handful of videos. Back then, we simply wanted to share videos with faculty and students easily. During the first year, we were averaging 10 views a day (30 on a good day). But we didn't care. The channel was serving its purpose.\n\nWell, over time we gradually added videos to the channel and (to our surprise) it grew in popularity. The channel is now almost 600 videos strong and averaging 5000-8000 views a day (10k on a good day). During its first 10 years, the channel has accumulated 13.6M views, 1.2M hours of total watch time, and 118k subscribers.\n\nCrazy. Truly crazy.\n\nHappy birthday CPPMechEngTutorials!",
    "comments": [
        {
            "level": 0,
            "comment": "Loved these videos and they still help me. It’s always a trip seeing these get mentioned in other engineering subreddits. I think it’s linked on the r/engineeringstudents sub. Glad to see it’s success go beyond our school\n\nHappy birthday!",
            "score": 8,
            "author": "GuCCiAzN14",
            "replies": [
                {
                    "level": 1,
                    "comment": ":D\n\nI see screenshots of Prof. Biddle's lectures there occasionally.",
                    "score": 6,
                    "author": "PaulNissenson"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Amazing work!!!",
            "score": 1,
            "author": "Dense_Cloud1100"
        },
        {
            "level": 0,
            "comment": "Blessings to you all who created these videos. Having to work multiple jobs through college, having these to review made my life so much easier.",
            "score": 1,
            "author": "mexicanvanilla97",
            "replies": [
                {
                    "level": 1,
                    "comment": "Making others' lives easier is what we do.",
                    "score": 1,
                    "author": "PaulNissenson"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awww congrats!! The number of students y'all's channel has helped must be astronomical. &lt;3",
            "score": 1,
            "author": "HonestBeing8584",
            "replies": [
                {
                    "level": 1,
                    "comment": "It must be at least 10.",
                    "score": 1,
                    "author": "PaulNissenson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’re increasing the job market competition for your own students by helping others, so you should make the playlist private! j/k",
                            "score": 1,
                            "author": "HonestBeing8584"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I struggle paying attention in class and this channel is basically saving my ass. The only reason I am doing really good in my classes is because of the recorded lectures.\n\nI really wish i found out about this channel back in highschool and could gotten a head start in ME.  \n\nI hope more courses gets added to the channel.",
            "score": 1,
            "author": "Tronsler",
            "replies": [
                {
                    "level": 1,
                    "comment": "We have plans to add more full length lecture series in the future, but there is a looooong lead time. We are considering ME 2150, 3150, 3401. However, they probably wouldn't be ready for at least a year.",
                    "score": 1,
                    "author": "PaulNissenson"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Alright but when are we gonna see a structural analysis of that Play Button? I wanna see that stress strain curve!",
            "score": 0,
            "author": "funnystuff97",
            "replies": [
                {
                    "level": 1,
                    "comment": "What a stress strain curve? I'm a thermal-fluids guy.\n\nWe still need to put the play button up outside the department office.",
                    "score": 2,
                    "author": "PaulNissenson"
                }
            ]
        }
    ]
}