{
    "id": "12jz871",
    "score": 4,
    "title": "What is the grade forgiveness policy?",
    "author": "Infinite_Elderberry4",
    "date": 1681333578.0,
    "url": "https://www.reddit.com/r/CalPolyPomona/comments/12jz871",
    "media_urls": [],
    "other_urls": [
        "https://www.cpp.edu/registrar/student-record/course-repetition.shtml",
        "https://www.cpp.edu/registrar/student-record/course-repetition.shtml"
    ],
    "postText": "I am at risk of getting below a C- in one of my classes and I ran into this on the CPP website: [https://www.cpp.edu/registrar/student-record/course-repetition.shtml#:\\~:text=Students%20may%20repeat%20an%20additional,factored%20into%20the%20student%20GPAs](https://www.cpp.edu/registrar/student-record/course-repetition.shtml#:~:text=Students%20may%20repeat%20an%20additional,factored%20into%20the%20student%20GPAs)\n\nFrom my understanding:  \n\\-There's 16 units of grade forgiveness.  \n\\-Say you get a F in a class and you retake it later, the F gets erased and replaced with that other grade you got (say a B) so your GPA will be fixed.  \n\\-After these 16 units, there are 12 additional units but these will not erase the previous grade, your grade will simply be added so your GPA isn't fixed in this case.\n\nSo is this actually true? If say I get a D in one of my classes, I can retake it next semester and get a A to replace it and it'll be like nothing ever happened?\n\nIf so, why do people withdraw and take a W instead of just retaking the course?\n\nAny opinions are welcomed and please correct my misunderstandings if I'm not reading it right. Thanks.",
    "comments": [
        {
            "level": 0,
            "comment": "If you got a D in the class, the D would still show up on your transcript it just wouldn't count towards your GPA. Grade forgiveness doesn't erase the bad grade, it only removes its effects. That's why a W is better, because it implies that you had a compelling reason to withdraw rather than receiving a D without explanation",
            "score": 8,
            "author": "ihavefeelings2",
            "replies": [
                {
                    "level": 1,
                    "comment": "O I see. Thanks",
                    "score": 0,
                    "author": "Infinite_Elderberry4"
                },
                {
                    "level": 1,
                    "comment": "sorry to hijack the question, but if say you are barely a fulltime student,12 unit, wouldn’t you have to payback your financial aid if you withdraw?",
                    "score": 0,
                    "author": "misunderstood_youth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I believe that if you complete a certain % of the semester before you withdraw (believe it's like 60% of the semester) you don't have to pay back anything since they consider it as \"earned\". Not 100% sure but I think it's true since, personally, I didn't pay anything back when I withdrew near the end of the semester like a year ago (and I dropped all my classes 💀). \n\nSource (specifically in the \"calculation of earned and unearned Title IV aid\" section under the withdraw, refund, repayment tab): https://www.cpp.edu/financial-aid/resources/financial-aid-policies.shtml\n\nHope that helps",
                            "score": 1,
                            "author": "DiamondGoesWild"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Got it ty",
            "score": 0,
            "author": "Mamichulabonita"
        }
    ]
}