{
    "id": "13074rt",
    "score": 0,
    "title": "UCSB vs Cal Poly Pomona",
    "author": "SeesawMost68",
    "date": 1682562211.0,
    "url": "https://www.reddit.com/r/CalPolyPomona/comments/13074rt",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m in the middle of deciding on which school to transfer to. A little bit about me, I am a biology major working towards getting into medical school. I am overwhelmed by my current studies and trying to finish my last semester strong before transferring so I don’t know what I should do. Any advice would be greatly appreciated. \n\nQuestion to people on the same boat, how important is it to save as much money if you have plans to attend such an expensive place such as medical school. \n\nThe cost of attendance between UCSB &amp; Cal Poly Pomona differ of an amount of $7,000 just by tuiton itself. Attending UCSB, will be having to pay for room and board, while attending Cal Poly Pomona, I will only have to worry about tuition cost. \n\nMy overall focus on going to a school that will be the best for my major. I am 100% committed to this career path, so which one is the best?",
    "comments": [
        {
            "level": 0,
            "comment": "Depending how much you care about money if you do go to CPP. For a bio major your opportunities won’t be too different tbh. If money is no issue UCSB is a no brained though",
            "score": 3,
            "author": "International_System"
        },
        {
            "level": 0,
            "comment": "Interestingly enough I attended UCSB for my undergrad and now I’m finishing up my Graduate degree at CPP. \n\nCPP is a commuter school and it’s way harder to make relationships with people, professors, etc. While UCSB is a closer knit community where like 90% of the students walk/bike to campus. Parties almost every night if your are into that. \n\nHousing is definitely the worst part of UCSB. But as a transfer I think you are guaranteed housing with the UCSB apartments (~$600-700 utilities included) your first year and after you make some friends you’ll likely won’t have too hard of a time finding a spot for your senior year. \n\nPersonally I think it was worth it to attend UCSB. Nothing beats getting out of class and being a stones throw away from the beach. I don’t really care about making connections and all that now since I have a job now, but maybe that’s something you want to consider. \n\nBoth campuses are diverse, both campuses are well know, at the end of the day it doesn’t matter where your bachelors comes from, as long as you have the grades and letters of recommendation. Finically CPP is the better choice. However the UCSB campus lifestyle is miles ahead of CPP.",
            "score": 7,
            "author": "ACosmicUniverse",
            "replies": [
                {
                    "level": 1,
                    "comment": "all facts here I have more enemies than friends on campus",
                    "score": 2,
                    "author": "Separate_Funny_5775",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Whyy???",
                            "score": 2,
                            "author": "Main-Advisor8019"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Question, Is cal poly really well known? And it what respect is it well known",
                    "score": 0,
                    "author": "Dense_Cloud1100",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Everybody and their momma knows “cal poly” and “engineering” go in the same sentence. Both school are well know in certain disciplines.",
                            "score": 3,
                            "author": "ACosmicUniverse"
                        },
                        {
                            "level": 2,
                            "comment": "It's fairly well known in the hospitality industry. \n\nWe're definitely not as prolific as Cornell (which is consistently ranked #1 in the US) or UNLV, but I've worked with alumni/former classmates of mine in every company that I've been employed at since graduating.",
                            "score": 3,
                            "author": "collins_anonymous"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bio major here, UCSB is undoubtably better for it than CPP is",
            "score": 1,
            "author": "KhukuriLord"
        },
        {
            "level": 0,
            "comment": "Just so you know, we have cows and horses here!! They’re cute!",
            "score": 1,
            "author": "mriyaland"
        }
    ]
}