{
    "id": "1309efo",
    "score": 7,
    "title": "people approaching students near library",
    "author": "hveelinda",
    "date": 1682568655.0,
    "url": "https://www.reddit.com/r/CalPolyPomona/comments/1309efo",
    "media_urls": [],
    "other_urls": [],
    "postText": "Two ladies with a book approached me near the library today. I was trying to take a nap. \n\nI told them no, to whatever they wanted to share because I was so sleepy. \n\nThey left me alone.\n\nBut I felt annoyed by it. Does anyone know what they want? Is it some cult stuff?\n\nAnyone else approached?",
    "comments": [
        {
            "level": 0,
            "comment": "Like I have said on previous posts, just say you really need to poop and speed walk by",
            "score": 11,
            "author": "THEasianDERULO"
        },
        {
            "level": 0,
            "comment": "It happened when I was there between 08-10. They were competing with the people that wanted to sell you their new mix tape",
            "score": 13,
            "author": "Davepitaph"
        },
        {
            "level": 0,
            "comment": "I have been approached before. Recently was approached by a young man who was providing free Burger King coupons and asking for 100 dollar donations. Yea..100",
            "score": 3,
            "author": "peter095837",
            "replies": [
                {
                    "level": 1,
                    "comment": "No whopper is worth $100",
                    "score": 5,
                    "author": "CPP_HorseWhisperer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That sounds like a crappy fortune cookie saying",
                            "score": 5,
                            "author": "Appropriate_Tone_127"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not sure if it’s the same group but got approached twice today in the library by the ministry club. I respectfully decline and we go about our day. Happens sometimes all good.",
            "score": 9,
            "author": "marhad400",
            "replies": [
                {
                    "level": 1,
                    "comment": "At least it’s not the same b***** approaching you 4 times in the restroom before you even wash your hands.",
                    "score": 1,
                    "author": "SadLifeKitty"
                }
            ]
        },
        {
            "level": 0,
            "comment": "there was this guy outside the bookstore at 8am one morning. i walked out and he handed me a small New Testament. i was too tired so i just took it and walked away. i didn’t even realize i had grabbed it or what it was lmao",
            "score": 2,
            "author": "ramenoodleszs"
        },
        {
            "level": 0,
            "comment": "probably money. Like asking you for some donations. I met a few people asking for donations when I was walking to the cashier and financial aid building",
            "score": 1,
            "author": "New-Establishment358"
        },
        {
            "level": 0,
            "comment": "I just go in through the side door, it makes it so much easier to avoid them.",
            "score": 1,
            "author": "kjhorton25"
        },
        {
            "level": 0,
            "comment": "Probably some stupid shit asking for money. Just ignore them and if they don’t leave you alone just talk shit to their face",
            "score": 1,
            "author": "nate109109"
        }
    ]
}