{
    "id": "135qjay",
    "score": 7,
    "title": "Paybyphone parking",
    "author": "Stevie1505",
    "date": 1683041927.0,
    "url": "https://www.reddit.com/r/CalPolyPomona/comments/135qjay",
    "media_urls": [],
    "other_urls": [],
    "postText": "I park in one of the parking structures and usually use one of the parking meters to get a slip that’s printed out to leave on my dashboard so I won’t get ticketed. Today it’s not working so I used paybyphone. Will I still get ticketed since I don’t have anything left on the dash?",
    "comments": [
        {
            "level": 0,
            "comment": "i dont even know if they bother checking. havent paid for parking since week 4",
            "score": 9,
            "author": "Joppapi",
            "replies": [
                {
                    "level": 1,
                    "comment": "I got 3 tickets this semester on different parking lots, they do check, you’re just lucky lol",
                    "score": 6,
                    "author": "danielajpe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "just dont park in popular spots ez",
                            "score": 2,
                            "author": "Joppapi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "whats the best place to park to not get a ticket?",
                                    "score": 1,
                                    "author": "NecessaryWeek7429",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "well now that the semester is almost over, i always park in B lot. Theres always parking there. It is far from everything, but if you have a scooter or keep the walk time in mind its great",
                                            "score": 1,
                                            "author": "Joppapi"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "last time i used the paybyphone app and i still got ticketed. I had to make an appeal and i still haven’t received a notice on the status of the appeal... smh",
            "score": 5,
            "author": "a09a671",
            "replies": [
                {
                    "level": 1,
                    "comment": "i went straight to the police department right after I saw the ticket and they removed it right away. next time try going in person",
                    "score": 6,
                    "author": "Dezeya"
                },
                {
                    "level": 1,
                    "comment": "That's messed up, like why even bother telling people to use the app when your enforcers and system are too incompetent to know who's already paid.",
                    "score": 5,
                    "author": "StolenArc"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am pretty sure they check by plate and it will show you payed. I used it once when visiting last year.",
            "score": 8,
            "author": "PvtPopcorn"
        },
        {
            "level": 0,
            "comment": "I usually pay for parking that way and haven’t had any issue with tickets.",
            "score": 1,
            "author": "mathikiru"
        }
    ]
}