{
    "id": "139cvh1",
    "score": 11,
    "title": "Applying to Kellogg's honors?",
    "author": "purpleteostra",
    "date": 1683349805.0,
    "url": "https://www.reddit.com/r/CalPolyPomona/comments/139cvh1",
    "media_urls": [],
    "other_urls": [],
    "postText": "Got an invitation to the Kellogg's Honor college and I'm gonna be a freshy soon in fall. Should I apply, I'm gonna be an industrial engineering and possibly dorm first year. Don't want my schedule getting busier or harder. Also trying to get into MEPS, is it gonna be worth it?",
    "comments": [
        {
            "level": 0,
            "comment": "Definitely go for it. Apply from the website. Honors classes are not harder, they are just a little more discussion based and are only GEs, no honors major courses. Overall not a big commitment at all, and getting priority registration is a godsend. This semester’s registration was awful, and while my friends got hardly any majors courses I was the first to get to everything I wanted and all of the hardest to get classes.",
            "score": 10,
            "author": "marhad400"
        },
        {
            "level": 0,
            "comment": "Dude you’re gonna want it, they get priority registration and let me tell you sometimes it’s hard getting the exact classes that you want, the exact teachers that you want, and the exact schedule that you want. I’m going in next semester but I lowkey wish I had done it when I first came in",
            "score": 4,
            "author": "AridorBird"
        },
        {
            "level": 0,
            "comment": "I applied too it hopefully I get in",
            "score": 2,
            "author": "SimpleGrape9233",
            "replies": [
                {
                    "level": 1,
                    "comment": "If we both get in I'll celebrate with you",
                    "score": 1,
                    "author": "purpleteostra"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is it competitive to get into the KHC?",
            "score": 1,
            "author": "DANI-FUTURE-MD",
            "replies": [
                {
                    "level": 1,
                    "comment": "prolly tbh",
                    "score": 1,
                    "author": "purpleteostra"
                }
            ]
        }
    ]
}