{
    "id": "13ozt2g",
    "score": 0,
    "title": "Covid positive",
    "author": "iamrluc780",
    "date": 1684782023.0,
    "url": "https://www.reddit.com/r/CalPolyPomona/comments/13ozt2g",
    "media_urls": [],
    "other_urls": [],
    "postText": "Tested positive for covid and have commencement tomorrow. Is it advisable to show up or stay back?",
    "comments": [
        {
            "level": 0,
            "comment": "I am so sorry, but please stay home. You're going to be shaking people's hands and those people will be shaking a lot of other people's hands. I know it sucks, but I would do the same",
            "score": 25,
            "author": "ihavefeelings2",
            "replies": [
                {
                    "level": 1,
                    "comment": "You won’t be shaking hands with the administration, but you WILL be in very close contact with your peers. This really sucks, and I am so sorry this has happened to you. Please take all necessary precautions seriously.",
                    "score": 7,
                    "author": "Appropriate_Tone_127"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Please don't go, if you must go, or decide to go for FOMO or something, a surgical mask won't cut it, you need a proper fit N95 to protect others. Please don't expose others though, so many who might be at risk will be there.",
            "score": 7,
            "author": "UserSleepy"
        },
        {
            "level": 0,
            "comment": "Stay home. If you must go, at least wear a mask. It's outdoors but it gets really crowded and people will be there with their whole families, including their grandparents.",
            "score": 18,
            "author": "Franklytacos"
        },
        {
            "level": 0,
            "comment": "You better mask up it isn’t advisable to show up anywhere sick in general.",
            "score": 15,
            "author": "tdbauer97"
        },
        {
            "level": 0,
            "comment": "Please do not come if you are sick, or at the very least please wear a mask",
            "score": 3,
            "author": "Enzodacabbie"
        },
        {
            "level": 0,
            "comment": "Very few people are testing, we are all surrounded by people with covid. You will regret not attending your commencement. Wear a mask, don't linger to chat with people.",
            "score": -14,
            "author": "sonoma4life"
        },
        {
            "level": 0,
            "comment": "Just wear a good mask. And have a great time. You only graduate once unless your planning to go to grad school.",
            "score": -8,
            "author": "Creative_Ad_9264"
        }
    ]
}