{
    "id": "13x5nxc",
    "score": 0,
    "title": "Associate Degree Request",
    "author": "luckas9746",
    "date": 1685586125.0,
    "url": "https://www.reddit.com/r/CalPolyPomona/comments/13x5nxc",
    "media_urls": [],
    "other_urls": [],
    "postText": "How do I request a associate degree as a incoming transfer student? I attended three colleges and wanted to simplify the process by having all my classes at cal poly Pomona and getting the degree.\n\nCan I get my Associates here at CPP or do I have to compile my courses into one community college and request from there? \n\nAn employer and other certifications are requesting an associate degree.\n\n\nSide question if I can dual enroll here at CPP and at WGU for a separate degree",
    "comments": [
        {
            "level": 0,
            "comment": "Talk to the last community college you went to or the one where you did the majority of your units. \n\nCPP won’t care about an Associates Degree as they are focused on the 4 year degree and the community colleges issue the Associates Degrees.",
            "score": 6,
            "author": "they_are_out_there",
            "replies": [
                {
                    "level": 1,
                    "comment": "This. Ask them (cc) about reverse transfer and see if you can get them to award it.",
                    "score": 1,
                    "author": "KindLoquat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They should award it based on units acquired at whatever CC the most units were finished. If they are all in the same system though, i.e. California CC system, then you could probably apply for the degree at almost any of the campuses.\n\nIf you earned enough units to get a degree or more at a CC, you can always apply for that degree at any time down the road. The problem is if they add in more graduation requirements in the interim.",
                            "score": 0,
                            "author": "they_are_out_there",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Definitely worth a shot but most CCc campuses have a residency requirement for the degree granting. I’d check with the most recent campus with most work completed to see what is needed to fulfill the associates degree requirements.",
                                    "score": 2,
                                    "author": "KindLoquat"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "CPP does not grant associate degrees.  Order a transcript sent from CPP to one of your past community colleges and then speak with their advisors to see if they will take the credit.  I would think yes as the colleges try to issue as many degrees as possible as it affects their bottom line.  Have your community colleges also send their transcripts to each other’s.",
            "score": 5,
            "author": "6LittleChickens"
        },
        {
            "level": 0,
            "comment": "I went to two different colleges before. What I did before is transferring my degree from OCC to mtsac and earner my associate degree there. Mtsac will see if the course you took at OCC are equivalent at mtsac or no. If its not equivalent, you will need to take another class. If you already fullfill all the requirement, you can start to apply for the associate degree. Then you can apply to transfer to cpp. When you apply at the CSU website, you can fill up the classes that you take at 3 different colleges one by one. Of course you fill it up by the school first, then the classes you take. I hope my explanation make sense and helps!",
            "score": 0,
            "author": "New-Establishment358",
            "replies": [
                {
                    "level": 1,
                    "comment": "The best thing you need to do is to check if you already fulfill all of the class requirements. If you already fullfill all of it, you should be able to get you associate degree. You just need to work on the procedure.",
                    "score": 0,
                    "author": "New-Establishment358"
                }
            ]
        }
    ]
}