{
    "id": "145obaz",
    "score": 7,
    "title": "Is there a discord for CPP Pokémon Go players?",
    "author": "sexa_r",
    "date": 1686364716.0,
    "url": "https://www.reddit.com/r/CalPolyPomona/comments/145obaz",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "There is a discord and Facebook page. Idk if the server is active since I left. If u go to 5 star raids, you can interact with other players.",
            "score": 2,
            "author": "robynjanine"
        },
        {
            "level": 0,
            "comment": "During the semester, if you walk around campus when there are 5-star raids, especially at the rose garden, there is a high chance of meeting other players. I lived on campus, so it was easy to walk around at any time and play the game with other friends who lived on campus. Community days are also great for meeting other players. \n\nAnd this may sound weird, but some professors/TAs play the game. My bio lab professor would tell me when there were special events, so I could evolve my Pokemon and get more stardust. The best lab professor I had last semester. \n\n(Especially because there was an Eevee event, and I am trying to evolve and collect all of them)",
            "score": 2,
            "author": "LavenderTea5"
        },
        {
            "level": 0,
            "comment": "http://bit.ly/cpp-pogo",
            "score": 2,
            "author": "GoldenTinyfin"
        },
        {
            "level": 0,
            "comment": "Pretty dead discord and pretty hard to communicate with others that do play. There's no designated coordinator I believe",
            "score": 0,
            "author": "CCxDragonLore"
        },
        {
            "level": 0,
            "comment": "There’s a Facebook messenger group that’s still pretty active",
            "score": 0,
            "author": "GeexwhY"
        },
        {
            "level": 0,
            "comment": "Yep, but after covid the majority of the OG group graduated, so it is pretty dead. Would love for it to go back to the days when there would casually be dozens of people for the raid train.",
            "score": 0,
            "author": "THEasianDERULO",
            "replies": [
                {
                    "level": 1,
                    "comment": "I remember the raid train 🥲",
                    "score": 1,
                    "author": "robynjanine"
                }
            ]
        }
    ]
}