{
    "id": "12ingbs",
    "score": 1446,
    "title": "I'm Dr. Marie Gdalevitch, an orthopedic surgeon who conducts cosmetic limb-lengthening procedures in Montreal. AMA!",
    "author": "CTVNEWS",
    "date": 1681226982.0,
    "url": "https://www.reddit.com/r/IAmA/comments/12ingbs",
    "media_urls": [
        "https://i.redd.it/75f6uyan1zra1.jpg",
        "https://www.reddit.com/r/IAmA/comments/12ingbs/im_dr_marie_gdalevitch_an_orthopedic_surgeon_who/"
    ],
    "other_urls": [
        "https://www.ctvnews.ca/w5/what-s-driving-limb-lengthening-surgery-a-radical-procedure-making-men-taller-1.6276603)**"
    ],
    "postText": "Canadian investigative news show, W5, recently broadcast a story about cosmetic limb-lengthening surgery. The episode centres on a 28-year-old patient who underwent the procedure and successfully grew from 5’9” to 6’0”. An increased number of men are undergoing the surgery, and I'm here with W5's Anne-Marie Mediwake, the reporter on the story, to give you insider-only information on the process of getting taller. \n\n**Edit: We are signing off, but we will monitor for new questions. Make sure to check out our episode and stay tuned for more u/CTVNEWS AMAs.**\n\n**Find our episode [here](https://www.ctvnews.ca/w5/what-s-driving-limb-lengthening-surgery-a-radical-procedure-making-men-taller-1.6276603)**\n\nPROOF: https://i.redd.it/75f6uyan1zra1.jpg",
    "comments": [
        {
            "level": 0,
            "comment": "For more AMAs on this topic, subscribe to r/IAmA_Medical, and check out our other topic-specific AMA subreddits [here](https://reddit.com/r/IAmA/wiki/index#wiki_affiliate_topic-specific_subreddits).",
            "score": 1,
            "author": "IAmAModBot"
        },
        {
            "level": 0,
            "comment": "Can you shorten legs?",
            "score": 94,
            "author": "CrunchyAssDiaper",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can’t believe they didn’t answer you smh",
                    "score": 48,
                    "author": "re_Claire",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "They remove the shins and reattach your ankles to your knees, but you have to have killed fiddy men first.",
                    "score": 7,
                    "author": "robbviously"
                },
                {
                    "level": 1,
                    "comment": "Dr G:  You can shorten legs.  Recover is actually harder and longer than lengthening as the muscles have a really hard time adapting to the shortened length.  You can shorten a femur by 5cm and tibias by 3cm",
                    "score": 5,
                    "author": "CTVNEWS",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What's the out of pocket cost estimate for this? It may be cheaper than paying for extra leg room on flights over my lifetime.",
                            "score": 2,
                            "author": "CrunchyAssDiaper"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You assert that \"this is no different than any other cosmetic surgery,\" yet the recovery times, risks, and activity restrictions are hefty. Can you give an example of a \"mainstream\" cosmetic surgery this could be fairly compared to? \n\nQ2. Do you require your patients to undergo any level of counseling prior to electing this procedure? Would someone need to speak with a therapist first about their insecurities and their plan, or would you operate on a patient who has explored no alternative forms of treatment for their dysphoria? \n\nTIA!",
            "score": 986,
            "author": "Itsoktobe",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ask me anything BUT THAT!",
                    "score": 41,
                    "author": "Interesting-Role-784"
                },
                {
                    "level": 1,
                    "comment": "I like how this post is conviently left unanswered LOL",
                    "score": 114,
                    "author": "gannex"
                },
                {
                    "level": 1,
                    "comment": "Love how the OP totally ignored these very reasonable questions because it cuts into what is an advertisement AMA for her surgery practice.",
                    "score": 569,
                    "author": "LifeOnAnarres",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*her* surgery practice.",
                            "score": 75,
                            "author": "0056",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "thank you for noticing this, edited my original post to use correct gender",
                                    "score": 33,
                                    "author": "LifeOnAnarres"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "great and fair question!!\n\n- am MD",
                    "score": 71,
                    "author": "Koumadin"
                },
                {
                    "level": 1,
                    "comment": "Not OP but I’d argue facial/skull contouring and bunion removal.\n\nEdit: It’s definitely fair to say that in a lot of cases bunion removal is not a cosmetic procedure. In other cases it can be, with the caveat that it does legitimately help with fitting into more shoes even if pain isn’t a significant concern. Here’s a link if anyone’s curious on reading more into it:\nhttps://www.hmpgloballearningnetwork.com/site/podiatry/blogged/bunionectomy-ever-purely-cosmetic-procedure?amp",
                    "score": 45,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m afraid to ask, but … what is skull contouring???",
                            "score": 17,
                            "author": "Marathon2021",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's exactly what you fear it is. Skin is opened and part of various bones on the face are removed to change the shape of the face.",
                                    "score": 33,
                                    "author": "swistak84",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I've had this, wasn't so bad. Though I have limited feeling part of my scalp and chin. But this is preferable to crushing dysphoria.",
                                            "score": 31,
                                            "author": "BreakingBaaaahhhhd",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Good for you and I mean it. If it's worth it for you then it's worth it.",
                                                    "score": 18,
                                                    "author": "swistak84"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I had a “bunion” surgery and didn’t walk for 3 months.  It was enormously painful and the pain persisted for years.  \n\nI would shout from the rooftops DONT DO IT",
                            "score": 71,
                            "author": "229-northstar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My ex girlfriend had it done twice (once for each foot). Her surgeries were extensive, including putting cadaver bone in her foot, but can't remember why.\n\nIn total it was probably like 6 months or more in a wheelchair because one of her feet had some issues healing.\n\nShe would probably do it again, her bunions caused her a lot of issues.",
                                    "score": 27,
                                    "author": "Killbot_Wants_Hug"
                                },
                                {
                                    "level": 3,
                                    "comment": "Bunion surgery for me many yeara ago corrected an extremely painful bent big toe joint that had been making it almost unbearable to walk and now ever since recovering I've had zero pain and still have  extremely active lifestyle. Bunions can keep getting worse and become debilitating so they can definitely be worth correcting . My rooftop shout - shoes suck, wear wide ones!",
                                    "score": 67,
                                    "author": "br0ck",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm so blessed that I wrecked a family trip with the wrong shoes on my feet while I was old enough to know I was mortal but young enough to be insured.\n \nI may be tall and skinny but my feet are wide, that's life.",
                                            "score": 9,
                                            "author": "AlmostAnal"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Thank you so much for that!  I have 2 of the biggest bunions protruding but they’ve never bothered me other than having to wear triple E width shoes.  I’ve worked over 30 years in my feet as RN and countless surgeons noticed and many offered surgery.  Main reason I didn’t is because I never had “only 6 weeks off your feet” as I was told with raising my 4, my brother passed so I had his 2, full time work.  I would’ve liked to have pretty feet, but mine have been functional over 60 years and no problem.  I’ve had bunions since I hit puberty and not from right shoes as I wore custom shoes for parochial school since I was bow legged.",
                                    "score": 4,
                                    "author": "Do_it_with_care",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you decide to have it done, make sure you talk to more than one doctor. And make sure you talk to his patients. I didn’t talk to his patients before I had mine done and that was a huge mistake.",
                                            "score": 2,
                                            "author": "229-northstar",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You all chose the wrong surgeons. All my bunion patients walk home the same day. I get them from a walking boot into sneakers in 3-4 weeks",
                                    "score": 9,
                                    "author": "redandgold45",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The girl who worked with me must have gone to you!  In 2 weeks, she was back in cardio class and she also had 2 rods inserted to straighten her toes which had crossed completely over\n\nI chose the head of orthopedics.  What could possibly go wrong?  Bad move.\n\nI brought my husband with me to an appointment because he didn’t believe what I was saying.  Dr was arrogant to my husband… who gets along with everyone…and talked over his polite questions.  Seeing is believing!  And if I had seen this side of him before surgery, I would have run.  \n\nAfterwards my friend said”oh that’s the arm guy”.  She had slipped on ice and broke her humerus.  She also had lupus and was on pred for that.  She chose him, too.  At check up, she told him it still hurt. No diagnostics.  He told her to quit being a baby and sent her home.  After several months of that, she got a new doctor who ordered an X-ray to see why it still hurt.  It never knitted and she had two broken bones floating around.  She had to have her arm in a sling for a mother year but at least she got good care\n\nI hope someone sued him into the worst nursing home",
                                            "score": 17,
                                            "author": "229-northstar"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I’d add in orthognathic (double jaw) surgery when the goal is purely aesthetic.",
                            "score": 3,
                            "author": "TheNoobtologist"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I would say Brazilian Butt Lifts have a long and painful recovery time and a high mortality rate.",
                    "score": 22,
                    "author": "LaLaLaLink",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "they are illegal in most places for a reason.",
                            "score": 8,
                            "author": "YuusukeKlein"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Have you seen the recovery times for abdominoplasty? That is largely cosmetic and one of the surgeries period that take the longest to recover from. Full recovery is like 6-12 months from one of those.",
                    "score": 25,
                    "author": "AkioDAccolade",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I can’t find anywhere saying recovery is remotely that long for abdominoplasty. Also, you can still use your legs while recovering from that, so not really comparable.",
                            "score": 49,
                            "author": "ivictoria"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "To question 2: counseling can fix what goes on in your own head, but not other peoples. Height (especially for males) is extremely important in the sexual, social, and professional arenas. Taller males are considered more attractive, more interesting, and more competent.\n\nTo handwave the desire for an advantage down to an \"insecurity\" is pretty ignorant.",
                    "score": 2,
                    "author": "milkman163"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Purely hypothetically, as an experiment let's say...\n\nJust *how* long could limbs be lengthened by? Arms and legs. What's the absolute maximum limit where the user could still operate and use them without injury or damage?",
            "score": 310,
            "author": "Moggy-Man",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dr. G: Bones can be lengthened alot in cases of bone loss but for cosmetic purposes 8cm is the max in the legs from a safety perspective in otherwise healthy people.  In patients with certain types of dwarfism they can be lengthened more over their lifetime but not at one time",
                    "score": 333,
                    "author": "CTVNEWS",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "8cm... Okay that's not bad.\n\nNow, if there were some less than scrupulous surgeons carrying out such a procedure, and the patient waived safety to just be as tall as possible. Maybe they were a huge fan of Avatar. Or basketball, but too short to make it.\n\nHow long can you go?",
                            "score": 190,
                            "author": "Moggy-Man",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dr G: proportions are important too, so there is a limit to how much you can lengthen without looking strange or affecting function.  But if we are being technical, the bone can be lengthened past 8cm but not safely",
                                    "score": 183,
                                    "author": "CTVNEWS",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Tell that to my torso/legs. I am 6' but gotta remove 5\"+ from every pair of pants I buy or im walking on them.",
                                            "score": 9,
                                            "author": "Black_Moons",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah? Try being 100kg and 5\"8. I'm ever so lucky to be built like a D'n'D dwarf.",
                                                    "score": 5,
                                                    "author": "DickyMcDoodle"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Suppose I'm an eccentric billionaire and pay for everything to do it, absolve liability and overpay through the nose for uh, 18\" height increase. \n\nHow badly is this gonna hurt. What's likely to fail?",
                                            "score": 148,
                                            "author": "Tack122",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Dr G:  18 inches of height is not possible in one lengthening\n\nwhen patients go for a max height safely we go to 5 inches in legs\n\nfor patients who have an underlying diagnosis of dwarfism, we can lengthen them 3 x during their lives to gain 40cm in their legs and 10cm in their arms, but their body can accommodate that better than patients who dont have that diagnosis",
                                                    "score": 206,
                                                    "author": "CTVNEWS",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Say I'm an eccentric trillionaire and I want arms. Long arms. Long as a gibbon skeleton. And big hands, too. I just want to spend my sunset years swinging limb to limb in the tree canopy among the only beings that have ever truly gotten me, plucking fruits for my shorter armed brethren and maybe even saving a marooned cat or two. How long can we go? I am also interested in lengthening my jaw to its furthest extent.",
                                                            "score": 317,
                                                            "author": "Jacollinsver",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Bros you are not getting the answer we’re looking for lol",
                                                                    "score": 270,
                                                                    "author": "PhantomTroupe-2",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It's because their job is to make the bones functional lol. Anything beyond \"safe\" means they're gambling on whether they can even support the arm anymore.\n\nNow if you just wanted to lie on the floor forever with super long twig arms that you can't move, now we're cooking",
                                                                            "score": 88,
                                                                            "author": "Ergheis",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "It’s more interesting to talk about what is actually feasible which is what doc has done here. They could make up ridiculous numbers, but they basically went into the absolute max that they’ve ever done and they are not going to speculate",
                                                                                    "score": 12,
                                                                                    "author": "Eternityislong"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I literally laughed out loud reading this after the billionaire for two minutes straight hahahaha",
                                                                    "score": 15,
                                                                    "author": "ChewbaccaSmith"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Long long man!",
                                                                    "score": 45,
                                                                    "author": "Cethinn",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "God damn now i have to go watch that ad",
                                                                            "score": 9,
                                                                            "author": "frekinghell"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "r/FuckYouChiChan",
                                                                            "score": 2,
                                                                            "author": "chrisKarma"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "When your net worth reaches 12 figures only then can you truly realize the truth that we were not meant to come down from the trees",
                                                                    "score": 8,
                                                                    "author": "RetroRocket"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Man, you gave me a good laugh 😂 also, I don't know why they can't just answer the question. It's like talking to an NPC with limited dialog",
                                                                    "score": 37,
                                                                    "author": "incraved",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Because you basically are. It’s an advertisement ama",
                                                                            "score": 10,
                                                                            "author": "darkphalanxset"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Had a good laugh with this comment lol.  Thanks for making my day.",
                                                                    "score": 3,
                                                                    "author": "reeshua"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "So, no hope of me becoming the alien in Close Encounters of the Third Kind?",
                                                            "score": 13,
                                                            "author": "CassandraVindicated",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Lol. Maybe they should just take piano lessons",
                                                                    "score": 4,
                                                                    "author": "SigourneyReaver"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Right that makes total sense, but in a hypothetical no safety \"push it to the point of failure\" scenario where would things go wrong?\n\nI imagine strained muscles, snapped tendons/ligaments, maybe uh, bone weakness?",
                                                            "score": 30,
                                                            "author": "Tack122",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I'm getting an incredibly strong sense that this guy and u/Moggy-Man are doing the bare minimum amount of research to start a black market limb-lengthening business out of a van in a back alley somewhere.",
                                                                    "score": 138,
                                                                    "author": "m0chab34r",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "🤫",
                                                                            "score": 24,
                                                                            "author": "Moggy-Man",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You ordered the saws from home depot right?",
                                                                                    "score": 28,
                                                                                    "author": "Tack122",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Tom? Mr. Tom Cruise?",
                                                    "score": 9,
                                                    "author": "Adminion"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; 8cm... Okay that's not bad. \n\nIt really isn't, is it? Thank you. I told my ex that and she laughed. I never felt smaller.",
                                    "score": 27,
                                    "author": "Different-Estate747",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I think you need to be a lot 'lesss than scrupulous' to offer this as cosmetic surgery in the first place.",
                                    "score": 4,
                                    "author": "ghsgjgfngngf",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You need to lengthen the space between \"a\" and \"lot\" because those are two separate words.",
                            "score": 30,
                            "author": "handlit33"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;alot",
                            "score": 2,
                            "author": "TheBaltimoron"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My wife lost 1cm of length on one leg from a mediocre tib-fib fracture repair about 20 years ago. One of the bones didn't lose as much as the other, so her ankle is all kinds of wonky. Is this the kind of thing you can repair?",
            "score": 183,
            "author": "quietIntensity",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dr G:  This falls under deformity correction (in which we often use limb lengthening) and this can usually be fixed by recreating correct length between the two bones and covered by insurance or provincial health care.",
                    "score": 271,
                    "author": "CTVNEWS",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for answering! We're in the US, but I have really good insurance, so we could probably get it covered by a US provider. Follow up question, which is my wife's primary concern: How long is the recovery period from this before regular load bearing activities can be resumed? She spent most of a year in a wheelchair when she broke her leg and had to relearn how to walk again, she's not very keen on repeating that experience. This was all before the advent of the knee-scooter, so I'm assuming there wouldn't be nearly as much or any wheelchair time past the hospital stay.",
                            "score": 75,
                            "author": "quietIntensity",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dr G:  Recovery can vary on the technique used to correct her problem.  Your surgeon in the US can help clarify, but there are usually some weight bearing options",
                                    "score": 82,
                                    "author": "CTVNEWS",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I have this… where should I get examine to get a quote when I was a child I have an accident where I receive a bad operation in my femur where I end up with 3.5-4cm of difference",
                                            "score": 11,
                                            "author": "pablines",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I actually live in Quebec and you've been telling me that the healthcare system will cover getting my one leg as long as the other? I've just been limping around and physio for the last few years! This is wild!\n\nI also would like to know what recovery looks like though.",
                            "score": 30,
                            "author": "CoupleofbOObs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm old now but I remember pondering going for that procedure (in the 80's so no doubt more barbaric to have done) and wish I had.",
                                    "score": 4,
                                    "author": "_The_Room"
                                },
                                {
                                    "level": 3,
                                    "comment": "Dr G:\n\nyes, this is covered.  Having a limb length discrepancy is a huge functional problem and often affects all your other joints.   Your welcome to come see us, there is no fee with your provincial health care card for a medical problem",
                                    "score": 5,
                                    "author": "CTVNEWS"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A very basic (and maybe dumb question), do your legs go back to 100% flexibility and mobility? If that made sense. That after the surgery, eventually, everything will be just as same as before except I’m taller?",
            "score": 34,
            "author": "helpaccount1263",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dr G:  The goal with this surgery is exactly that.  The muscles, and tendons and ligaments and bone all adapt to the new length.  Patients who do their rehab typically get back to their normal flexibility, but it can take almost 9-12months after the surgery for the muscles to get back to their \"new\" normal length",
                    "score": 43,
                    "author": "CTVNEWS",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you for getting back! Is there an ‘optimal’ age to do this surgery? I’m 20. Has there been recent advancements in this surgery? I remember inquiring about this years ago but I was pretty much told ‘it barely works and you’ll be in pain forever’. This appears almost…mainstream.",
                            "score": 12,
                            "author": "helpaccount1263",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dr G: Younger patients recover faster physically, but the maturity to undergo this procedure is also important.  We have patients who do this from 18-60, but a large amount are in their 20's and 30's\n\nThe surgery has evolved with the advent of the intramedullary lengthening nails which makes it safer, more cosmetic and a lot less painful",
                                    "score": 28,
                                    "author": "CTVNEWS",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What are the most common side effects you see? And how exactly common are they?",
                                            "score": 12,
                                            "author": "helpaccount1263"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How much does it cost?",
            "score": 30,
            "author": "BloodRaevn",
            "replies": [
                {
                    "level": 1,
                    "comment": "Article in OP’s post says 90k (Canadian dollars, though, I think)",
                    "score": 28,
                    "author": "2_brainz",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Dr G:  90,000$ can for femurs, 95,000$ for tibias",
                    "score": 2,
                    "author": "CTVNEWS"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What if I want just one long arm? Is that something that would be allowed?",
            "score": 144,
            "author": "Digital_loop",
            "replies": [
                {
                    "level": 1,
                    "comment": "All I can picture after reading your comment is cotton screaming,”they took my shins”",
                    "score": 59,
                    "author": "davejugs01"
                },
                {
                    "level": 1,
                    "comment": "It's crazy the superficial procedures people will go through to conform to standards. Unless it is needed and not cosmetic I just don't get it. One long arm though, I can see that.",
                    "score": 33,
                    "author": "pbgu1286",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "As it's a cosmetic procedure, whereby people are opting in for the surgery, are there any reasons you'd refuse to carry out the surgeries?",
            "score": 91,
            "author": "toodlelooh",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dr G:  I dont often refuse unless I dont think the surgery can help the patient, if for example patient has unrealistic goals or expectations. Patients who are depressed or suicidal are not great candidates until they are stable.",
                    "score": 125,
                    "author": "CTVNEWS",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm curious about the depressed or suicidal bit. I've come to some basic conclusions in my head, but are you able to expand on this?",
                            "score": 17,
                            "author": "Sarru-kin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm not the good doctor here, but my assumption (and I'm happy to be told I'm wrong) would be that it won't be addressing the underlying issue/issues the patient would be having. \n\nI don't believe it's entirely possible to treat depression or suicidal ideations with cosmetic surgery. And a person in that state of mind might believe it can and have unrealistic expectations, which can only serve to make their mental state worse. \n\nLeading people in that frame of mind to believe it'll magically cure their clinical depression is unethical and just plain grossly wrong and negligent for a Doctor to do. \n\nAgain, happy to be corrected.",
                                    "score": 29,
                                    "author": "Different-Estate747",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s not what the doctor is saying. He is saying that it would be unwise to operate on someone electively that is not mentally and emotionally well. One of the biggest reasons for this is that patient cooperation and adherence to post-operative guidelines and advice is significantly lower in patients that are in the aforementioned group. This would increase the likelihood of complications which can be life-changing and in certain cases simply exacerbate the patient’s poor mental health status.",
                                            "score": 12,
                                            "author": "saintviribus",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Dr G (she/her):   I agree with above comment on needing to find underlying cause of depression or other mental health issues and treating it appropriately. Cosmetic surgery cannot fix that.  I also agree that we do not operate on patients who are actively suffering from a mental health crisis for reasons you stated (this is true for elective medically necessary surgery).  For cosmetic surgery, we want to be sure that patients don't believe that the surgery will fix all their underlying issues and is not a replacement for therapy or other medical treatments for their mental health problems.",
                                                    "score": 5,
                                                    "author": "CTVNEWS"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Dr G:  yes, you are correct",
                                            "score": 2,
                                            "author": "CTVNEWS"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't know if the AMA is over, but could this be used in a non cosmetic fashion to even limb length? I have a shorter leg, maybe 7CM, and it's messing with my hip and back. Would love a way to correct this besides an insole.",
            "score": 12,
            "author": "CatManDontDo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes",
                    "score": 11,
                    "author": "-212-"
                },
                {
                    "level": 1,
                    "comment": "This is actually how these type of surgeries began - to correct discrepancies in the lengths of legs, so for example, people born with one leg shorter than the other and they have to use special devices to even their walk would be good candidofor this surgery",
                    "score": 4,
                    "author": "Andromeda39"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The site shows only leg-lengthening.  Is that the only limbs one gets lengthened during these procedures?  Do you have any head-obscured Work-Safe images we can see of someone who has had this procedure done?  I am wondering if they end up looking disproportional afterwards.  \n\nAlso, what about nerves, blood vessels, etc - the images in the article only really imply bone-inserts for lengthening, but what about all the other important bits and bobs that run up and down our legs?  \n\nDo you do arms too?",
            "score": 31,
            "author": "HouseCravenRaw",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dr G:  During leg lengthening, the other structures get lengthened at the same time (in fact the bone is the easiest part of the lengthening).  The muscles, nerves, tendons etc.. need to stretch as well and are the ones that resist the lengthening the most.  \n\nproportions are something we discuss during consultation\n\nusually most people have a longer arm span than leg span and can accomodate the lenghtening of the femurs\n\ntibial lengthening dont change proportions as much (think of a woman on high heels)",
                    "score": 64,
                    "author": "CTVNEWS",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you.",
                            "score": 11,
                            "author": "HouseCravenRaw"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 29,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey, I hope your gf is doing fine. I've read on somewhere that you can do limb lengthening surgery for one leg too to even them out, let me find the link. I've done a lot of research on limb lengthening because I'm thinking of having too and I've decided it is best to have it in Turkey, the prices are much more affordable. Let me find the link.",
                    "score": 3,
                    "author": "anotherview19",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is limb lengthening still primarily based on the Ilizarov technique? I had my right tibia and femur and left tibia lengthened when I was in my tweens in the mid-90’s, and my surgeon was said to be following the Ilizarov technique. (BTW, I was born without fibulae!) \n\nMy adult height without the surgeries would have been 4’10”, but with them it’s 5’2” — still very short for a man, but better than it would have been otherwise.",
            "score": 23,
            "author": "DeliveratorMatt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ilizarov technique is still very much used, but now intramedullary lengthening rods are common place. Patients lengthen the rod either though a machine utilizing a magnet or a machine utilizing a pulse of energy. Both ways spin a motor inside the nail to distract it out to length slowly.",
                    "score": 2,
                    "author": "Repiks",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Dr G:  Ilizarov principles are still used as the is the father of distraction osteogenesis, but we have some newer equipment nowadays, including circular hexapod external fixators that are computer assisted and magnetic telescopic internal nails.",
                    "score": 2,
                    "author": "CTVNEWS",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are you a fan of Gattaca?",
            "score": 78,
            "author": "Robobvious",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's a great film. Of a *dystopian* future",
                    "score": 5,
                    "author": "Dogwiththreetails"
                },
                {
                    "level": 1,
                    "comment": "[https://i.imgur.com/Da1pzg6.gif](https://i.imgur.com/Da1pzg6.gif)",
                    "score": 6,
                    "author": "DocJanItor",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "How long is the recovery and do you know if these men still wear lifts after the procedure?",
            "score": 21,
            "author": "biscaynebystander",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dr. G:  lengthening is 3 months, consolidation can take anywhere from 3-6months after lengthening and full recovery to all contact sports usually takes one year.\n\nfew men still wear lifts after the procedure, but it depends on their starting height",
                    "score": 46,
                    "author": "CTVNEWS"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just want to be able to scratch my whole back with my fingertips. Would it be better to lengthen my upper arm instead of my forearm? I also type on a keyboard a lot so that should be taken into account. And to save money I probably just need one arm lengthened not both",
            "score": 9,
            "author": "notLOL"
        },
        {
            "level": 0,
            "comment": "Hi Dr. Gdalevitch, thank you for this AMA.  I have several questions, if you don't mind.\n\n1) Are any women undergoing this procedure?  Would there be differences in how it was performed on women vs. on men?\n\n2) Would you say that those desiring to undergo this procedure are suffering from a form of body dysmorphic disorder?  If so, would it be fair to say that (at least in some cases) there are parallels to gender-confirmation surgery?  \n\n3) Should this procedure be covered by insurance, at least in some instances?\n\nEdit: inserted 'disorder' in point (2)",
            "score": 40,
            "author": "SpaceElevatorMusic",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dr. G: 1. yes woman are doing this as well, but less than 10% of my patients are women\n\n2. I would say they mostly have heigh dysphoria (unhappy with their height) but for some it might feel like gender-confirming surgery in the sense that it is a life-changing procedure with regards to how they feel about themselves and their self confidence\n\n3. This procedure is covered for patients who have dwarfism (a medical condition) unfortunately in a socialized medial system we dont yet have ressources to distinguish between different cosmetic procedures and this procedure is still considered cosmetic",
                    "score": 51,
                    "author": "CTVNEWS",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you for the responses.",
                            "score": 6,
                            "author": "SpaceElevatorMusic"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are there any ethical considerations you take into account? If so, what are they?",
            "score": 65,
            "author": "zwitterionz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi ! It's Anne-Marie, reporter on this story. Could you expand on what you mean by ethical consideration?",
                    "score": 16,
                    "author": "CTVNEWS",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not the OP but for example, how would you counter the claim that you are exploiting the insanity of anybody who opts for this surgery? Since there is presumably no medical reason to do it in the vast majority of cases? Would you see any difference between doing this and offering surgery to make people look more like a horse, if that's what they desired?",
                            "score": 87,
                            "author": "JumpinJackFlashlight",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why do you think people who opt for this are insane? Do you think that women who get boob jobs or men who get hair transplants are insane because they opted for surgery purely for cosmetic reasons?",
                                    "score": 26,
                                    "author": "FriedrichHydrargyrum",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You're comparing relatively minor surgeries to a far more serious one. Should cosmetic brain surgery become acceptable if you are bothered by the shape of your lobes?",
                                            "score": 11,
                                            "author": "Petrichordates",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "People get major orthodontia all the time. What's the difference, on a certain level, between getting your legs lengthened and getting your teeth and jaw realigned?",
                                                    "score": 11,
                                                    "author": "SigourneyReaver",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well one is a cosmetic surgery that only negatively impacts your health, and the other is a medical procedure intended to improve you health. Your confusion is confusing.",
                                                            "score": 12,
                                                            "author": "Petrichordates",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "There’s a 0% chance I’ll get a limb lengthening surgery or any other cosmetic surgery. I don’t have a dog in the fight. \n\nThere’s a continuum of elective cosmetic surgeries. Why do you draw the line specifically at this one?",
                                                                    "score": 12,
                                                                    "author": "FriedrichHydrargyrum",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "was this meant as a response to a different comment? person you're responding to didn't suggest you had any personal investment in this subject or that they draw the line specifically here (though they do imply it's somewhere beyond the line, on account of being a major surgery for purely cosmetic reasons, fair enough if that's what you meant)",
                                                                            "score": 2,
                                                                            "author": "hearke"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Agree with this 💯",
                                    "score": 2,
                                    "author": "Dogwiththreetails"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Well, at the risk of stating the obvious, any surgery comes with some risks.  When you have a patient who's 5'9\", which is normal height, is it ethical to expose him to the risks of surgery just to satisfy his vanity?",
                            "score": 30,
                            "author": "BarnabyWoods",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ethical would be determining if the patient is mentally sound (which the doctor mentions in another comment) and then making sure they know the risks. \n\nThen it's all up to the patient.",
                                    "score": 6,
                                    "author": "mortavius2525"
                                },
                                {
                                    "level": 3,
                                    "comment": "But you could argue the same thing for any cosmetic procedure. If you have B cup boobs, which is normal, but you want DDs, is it ethical to expose them to the risk of surgery to satisfy their vanity? Brazilian Butt Lift surgery (BBL) have high rates of post-surgery complications (incl death) but are still performed regularly. \n\nNot sure why people in this thread are acting like this one doctor is at the core of all that they think is wrong with cosmetic medicine…",
                                    "score": 53,
                                    "author": "letsmakeart",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Dr G:  All surgery does come with risks but that is for the patient to decide on what risks they want to take.  A patient who is 5'6 may feel perfectly ok with their height, whereas a patient who is 5'9 can feel short.  It is more about how they feel in relation to their height, than the actual number",
                                    "score": 23,
                                    "author": "CTVNEWS",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks Anne-Marie and Dr. G. Following up from my comment: stature lengthening is a topic of debate in patients without skeletal deformity. As you surely know, literature at this time does not delineate between height *treatment* versus *enhancement*. Where treatment allows for exploration of \"height dysphoria.\" As of now, \"height dysphoria\" is not a true pathology. \n\nIs it your position that there is no consideration necessary aside from your patients will to have the procedure and their pocket book? Do you conduct any screening for potential issues such as height dysphoria, or will you only take this into consideration when CMQ has something to say, and in the meantime, roll in cash?",
                                            "score": 17,
                                            "author": "zwitterionz"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This is a total abdication of your responsibilities as a surgeon, part of nonmalfeasance is being a gatekeeper between patients and unneccessary risks. Subjecting a patient to massive bilateral boney work for cosmetic reasons should raise multiple ethical red flags for any surgeon, how do you justify such a huge risk profile against cosmetic benefit? Is the risk of losing both limbs to nonunion really worth it when the benefit is purely cosmetic?\n\nFor the record I am not totally against the surgery as a concept but to so flippantly dismiss the question of ethics is highly concerning. We don't abdicate our duty to the patient on the grounds of 'the patient wanted it so whatever', that's bad medicine.",
                                            "score": 70,
                                            "author": "topperslover69",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; massive bilateral boney work\n\nI got a giggle out of how professional everything in your statement was except \"boney\" haha... I hope that can be a standard term.",
                                                    "score": 27,
                                                    "author": "NinjaRedditorAtWork",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You'll hear it in ortho plent! If we're drilling into or cutting bone.... boney work.",
                                                            "score": 13,
                                                            "author": "topperslover69"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Just a theory: money.",
                                                    "score": 32,
                                                    "author": "hippopototron"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;but that is for the patient to decide on what risks they want to take\n\nA genuinely frightening statement. You scare me.",
                                            "score": 10,
                                            "author": "_InTheDesert_",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi, Dr. Gdalevitch, thank you for taking the time to do this. My question is: I'm assuming there is a period of rehabilitation after the surgery to get the surrounding musculature to accept and adapt to the new length of limb, what does this look like? Are the stretches similar to exercises one would do to improve general flexibility anyway or is there anything special that needs to happen to allow the muscles to adapt? Or does the body just take to it without much rehab required?\n\n\nAnd as a follow up question: if there is a period of stretching involved, do patients have the ability to further increase their flexibility, or is there a certain level that they can't progress? Would someone who was maybe considered flexible before the surgery lose a portion of flexibility due to the muscles now being permanently stretched?",
            "score": 17,
            "author": "GallifreyFNM",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dr G:  The most important part of the surgery is the rehab.  \n\nPatients do daily physiotherapy after the surgery and this is the most important part of the procedure.  Usually patients will be able to regain their underlying flexibility after the surgery",
                    "score": 33,
                    "author": "CTVNEWS",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What does the rehab consist of? Is it similar to what one would do after a lower limb fracture (isometric, progressive overload with isotonic exercises, then plyo)? What are some of the restrictions (weight-bearing, activity restrictions, etc) within the first few months post surgery? What are the long-term implications on athletic performance (tendon length/stiffness, muscle thickness, sprint/jump velocity, ability to absorb impact in contact sports)?",
                            "score": 11,
                            "author": "rozen30",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dr G: rehab consists of stretching multiple times a day and using a walking aid for 6 months, with increasing weight bearing in the last 3 months.  Once full weight bearing achieved and bone is healed, strengthening is increased.  Weight bearing during lengthening is at 70-80lbs per leg.   Long term implications for performance is that most patients get back to their pre-surgical capabilities.",
                                    "score": 25,
                                    "author": "CTVNEWS",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Would most patients be capable of participating in contact sports like soccer/football or basketball post recovery?",
                                            "score": 5,
                                            "author": "accountnumber42"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m familiar with limb lengthening but any possibility of adding length to a below knee amputation with very little residual?",
            "score": 7,
            "author": "bassmatty"
        },
        {
            "level": 0,
            "comment": "Not an expert so excuse my terminology: When you lengthen a limb, moments induced onto the joints during different movement patterns are increased. It could also create different amounts of rotation in neigbouring joints that weren’t developed for it. Since the patient’s personal bone structure was developed without accounting for this extra length, is there negative repercussion/pain/arthritis/weakness in the long term?",
            "score": 5,
            "author": "AntiPiety"
        },
        {
            "level": 0,
            "comment": "Does the procedure limit athletic ability post recovery? How is flexibility affected?",
            "score": 6,
            "author": "mikerz85"
        },
        {
            "level": 0,
            "comment": "Hey Hi, I know I'm late to the party but I'd so appreciate an answer. If you were to totally disregard the Hippocratic oath and all that jazz in some horrible, sci-fi near future how tall could you theoretically make a person if you started going at it with psychotic vigor from a young age?\n\n&amp;#x200B;\n\nI'm not asking in a trolly way, I'm just genuinely curious what you imagine the limits of the human body are in that regard, as one of the more qualified folks to comment.",
            "score": 5,
            "author": "Strugglepup",
            "replies": [
                {
                    "level": 1,
                    "comment": "They answered elsewhere: 8cm",
                    "score": 3,
                    "author": "SquirrelAkl"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I mean... I already have a short upper body. I'm 5'5\" (male) so already short, but my upper body is (I think) abnormally short for my size.  Wouldn't something like this make anyone without a long upper body look odd?",
            "score": 13,
            "author": "covingtonFF",
            "replies": [
                {
                    "level": 1,
                    "comment": "Of course it would.",
                    "score": 17,
                    "author": "pbgu1286",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm picturing that SpongeBob where he has the long legs.",
                            "score": 6,
                            "author": "10000Didgeridoos"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "ur pretty much trading proportions for height by definition",
                    "score": 5,
                    "author": "WeirdbutSexy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What would you guess is the (pre procedure) height of your average cosmetic patient?",
            "score": 10,
            "author": "ekaterina6",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dr G:  Usually between 5'2 and 5'7",
                    "score": 23,
                    "author": "CTVNEWS",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know somebody who is 6'4\" and wants to be 6'7\" or better. Would you do that procedure for them? Just curious, it's probably just cosmetic, but I don't think he needs to be any taller at all, but it did make me wonder if you actually need a good reason.",
                            "score": 8,
                            "author": "RedTuna777",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol this is like when Kyle in South Park went to play basketball. \n\nI think he'd regret it. Back problems later in life, hard time finding clothes that fit, not fitting in most furniture or vehicles, etc. The world isn't built for 6 foot 7 sized people.",
                                    "score": 7,
                                    "author": "10000Didgeridoos"
                                },
                                {
                                    "level": 3,
                                    "comment": "i think this is actually a really good question that needs to be considered",
                                    "score": 2,
                                    "author": "echo-ld"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can I make my fingers super long and slender?",
            "score": 8,
            "author": "mungermoss245"
        },
        {
            "level": 0,
            "comment": "1. Assuming someone is a perfect surgical candidate, would there be any contraindications? (I.e., can a 6’8” guy who wants to be a 7’0” NBA player just waltz in and get the surgery, or \n\n2. I’d assume there’s not a ton of data on this just yet, but where could I find research on “success rates” and “fail rates” of the procedure as a whole? (I’m sure y’all have your own nomenclature and metrics and probably don’t call it a “fail rate”, but you get what I mean)\n\n3. Do you need immunosuppressants afterward?",
            "score": 9,
            "author": "FriedrichHydrargyrum"
        },
        {
            "level": 0,
            "comment": "I have looked at this over the years, but been put off by the cost and the rehabilitation required. Do you see this becoming more mainstream and faster recovery times?",
            "score": 11,
            "author": "Remix73",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dr G: for recovery, once a full weight bearing nail is on the market recovery will be a little easier, but not faster",
                    "score": 12,
                    "author": "CTVNEWS",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dude they make shoes that add 2' without looking like platform shoes. Just buy those.",
                                    "score": 14,
                                    "author": "pbgu1286",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Anne-Marie: Hi! It's Anne-Marie, reporter for this piece. One of the key reasons the men we spoke to in this story did so, was their hope that this surgery would become more mainstream. Their hope was that with more demand, would be a reduction in the costs for surgery and rehab,",
                    "score": 10,
                    "author": "CTVNEWS",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Kinda makes me wonder though - if it became easier and more accessible, I imagine eventually a height war would start so to speak where already average or taller than average men decide they want to add 3 inches to themselves, too.",
                            "score": 5,
                            "author": "10000Didgeridoos"
                        },
                        {
                            "level": 2,
                            "comment": "Wouldn't it be better to try and change social norms so that so many men don't feel the need to undergo painful and complicated cosmetic surgeries to feel ok and valued? Instead of trying to normalize this incredibly expensive and unecessary surgery that is exploiting people's insecurities???",
                            "score": 2,
                            "author": "therustiestman"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Won't a longer leg affect the way the arms looks. I already have a short arm, can both be done together???",
            "score": 3,
            "author": "irrespressible"
        },
        {
            "level": 0,
            "comment": "Do you ever do surgeries to lengthen just one leg? Is that common at all, in fact,?\n\nReason I ask is after a hip replacement my leg was longer than the other. Not uncommon but also a bit annoying. Could people in a similar situation as me get their legs lengthened? Or is it mainly for people with two even legs?",
            "score": 3,
            "author": "sjp1980",
            "replies": []
        },
        {
            "level": 0,
            "comment": "What’s the oddest request you’ve ever received? Anyone want uneven limbs?",
            "score": 3,
            "author": "jasonridesabike"
        },
        {
            "level": 0,
            "comment": "If a power lifter got a leg lengthening procedure done, what would be their prospects of being able to lift heavy weight again or be competitive?",
            "score": 3,
            "author": "NoveskeCQB",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would guess no matter what they’d be worse at deadlift since increasing femur length increases the highest load bearing fulcrum. Even if the bones and muscles returned to full strength (doubtful), the basic kinematics indicate a harder lift (need more torque the longer the lever arm)",
                    "score": 2,
                    "author": "_username__"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What's the tallest person you have had as a patient?",
            "score": 3,
            "author": "Temporalwar"
        },
        {
            "level": 0,
            "comment": "What long term clinical data exists for this procedure regarding patient outcomes, both physical and psychological?",
            "score": 3,
            "author": "FancyJams"
        },
        {
            "level": 0,
            "comment": "My daughter was born with a congenital issue on her hips (her femur is shortened)  and now she is 15yo has a one leg a little more than 2 inched shorter than the other. Would it be possible and safe to equal her legs length  after the surgeries she had to correct the aforementioned issues?",
            "score": 3,
            "author": "jayboogie15"
        },
        {
            "level": 0,
            "comment": "What are the risks?",
            "score": 3,
            "author": "Jusstonemore"
        },
        {
            "level": 0,
            "comment": "How many inbound inquires have you received from Joe Rogan's people after he got that Spotify money?",
            "score": 11,
            "author": "MesWantooth",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Are you only lengthening femur or also tibia/fibula?  How does bone grow in space? Do you use cadaver bone",
            "score": 6,
            "author": "drdog1000"
        },
        {
            "level": 0,
            "comment": "Do you ever feel weird about studying medicine for over a decade just to waste resources making people who are 5'9\" taller?",
            "score": 11,
            "author": "AmbiguousDingus",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Hi Dr. Gdalevitch,\n\nWhy?",
            "score": 6,
            "author": "The1GiantWalrus"
        },
        {
            "level": 0,
            "comment": "Age limits? 50+ years old?",
            "score": 4,
            "author": "drdog1000",
            "replies": [
                {
                    "level": 1,
                    "comment": "She said she has done them up to the age of sixty",
                    "score": 2,
                    "author": "Laylasita"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is it possible to do limb shortening? For example if someone was 6ft and wanted to be shorter is that possible?",
            "score": 3,
            "author": "Due-Paleontologist69",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is but usually only up to 4-5 cms.",
                    "score": 2,
                    "author": "AlternatePixel23"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do you lengthen penises? Asking for a friend.",
            "score": 18,
            "author": "darkhorsehance",
            "replies": [
                {
                    "level": 1,
                    "comment": "Knew I'd find someone in here wondering exactly what counts as a \"limb\" lol.",
                    "score": 17,
                    "author": "PM_ME_A_PLANE_TICKET"
                },
                {
                    "level": 1,
                    "comment": "Yes but this require a boner's implant first.",
                    "score": 5,
                    "author": "no_choice99"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is there any procedure to correct bow legs (excessive curvature in the lower legs)?",
            "score": 2,
            "author": "Transki",
            "replies": [
                {
                    "level": 1,
                    "comment": "I had a valgus deformity (think the opposite of a bow leg) and Dr. G did my surgery in 2014. So it's definitely a possibility.",
                    "score": 2,
                    "author": "TheMontrealKid"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hypothetically speaking, if someone gets one leg shorter than the other is that something you guys can help with too?",
            "score": 2,
            "author": "cyankitten"
        },
        {
            "level": 0,
            "comment": "Is it purely for cosmetic purposes? My right leg is a half inch shorter than my left - is that a viable fix?",
            "score": 2,
            "author": "KhaosElement"
        },
        {
            "level": 0,
            "comment": "Have you seen the character Timmy from American Dad?",
            "score": 2,
            "author": "TristanDuboisOLG"
        },
        {
            "level": 0,
            "comment": "How accurately is the procedure/recovery portrayed in the movie Gattaca?",
            "score": 2,
            "author": "BiffMaGriff"
        },
        {
            "level": 0,
            "comment": "I saw a documentary about a young man who wanted his arms and legs long enough to finally ride his motorcycle, and he was undergoing the procedure... is it still as gristly/brute-force like? Just sever and space the bones?",
            "score": 2,
            "author": "L1qwid"
        },
        {
            "level": 0,
            "comment": "I've this the one where you break the bones and the drill screws in the bone then widen the break and let the break heal over time  forms , increasing the length?",
            "score": 2,
            "author": "DissidentVarun"
        },
        {
            "level": 0,
            "comment": "Oh no, I feel like I missed the window to have my questions asked, but here goes nothing. I’m desperate to help my mom. My mom has had seven hip surgeries, with entire hip replacements and now rods inserted. This has all left her with bone loss and about 1cm difference between her legs. Her doctors refuse to do anything else to help her and she’s been left in a lot of pain due to the height difference between legs. \n\nWith everything she has been through, is this procedure something that is feasible for her? If so, would there be any critical risks due to her previous surgeries?",
            "score": 2,
            "author": "NikiHarrow"
        },
        {
            "level": 0,
            "comment": "Will we see performance enhancing surgery in the future for atheletes?",
            "score": 2,
            "author": "MikeSafetyNZ"
        },
        {
            "level": 0,
            "comment": "Is there a maximum age, or other criteria, that would prevent someone from having this procedure done?.. not for cosmetic reasons, but for a leg length discrepancy.",
            "score": 2,
            "author": "FromTheOtherSideOfL"
        },
        {
            "level": 0,
            "comment": "Hi Dr. G, if I’m slightly bow legged and will need knee replacement surgery in his 30’s, can limb lengthening be done at the same time as the  knee replacement?",
            "score": 2,
            "author": "CrocodileWoman"
        },
        {
            "level": 0,
            "comment": "How much does this typically cost?",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "My daughter has extreme scoliosis leaving her hips extremely unlevel. Anyone used asymmetric limb lengthening to permanently be able wear normal shoes? We’ve done all we can with rods for her spine.",
            "score": 2,
            "author": "ReasonablyConfused"
        },
        {
            "level": 0,
            "comment": "Asking for a friend, is it possible to lengthen ones spine instead of their legs? Let's say they have very long legs but have a very short upper body for their body type / size?",
            "score": 2,
            "author": "redditproha"
        },
        {
            "level": 0,
            "comment": "I was born with fibular hemimelia so one of my legs was shorter than the other and had to get lengthened. Is there a difference in procedure between cosmetic limb lengthening and medically necessary limb lengthening? Thanks!",
            "score": 2,
            "author": "AVeganTrex"
        },
        {
            "level": 0,
            "comment": "Because I broke my legs at different times in my life my left leg is 1 1/8 inches longer than my right. I am now 48 years old and wear a lift. If I were to correct the difference, how long would it take and how much would it cost?",
            "score": 2,
            "author": "Paravachini"
        },
        {
            "level": 0,
            "comment": "How do patients’ soft tissue (muscles, tendons, and ligaments) increase in length to match up with the increased bone length?  Do they do stretching exercises? Do they use medication? Is the soft tissue surgically lengthened?\n\nIs the 8 cm max limitation based on ability of soft tissue to adapt to the new increased length?",
            "score": 2,
            "author": "229-northstar"
        },
        {
            "level": 0,
            "comment": "Why should someone talk to you when there are perfectly good butchers in almost every town in north america?",
            "score": 2,
            "author": "Gleefularrow"
        },
        {
            "level": 0,
            "comment": "If there is a complication, does your office take any financial responsibility for the burden placed on the public health system?",
            "score": 2,
            "author": "lord_ive"
        }
    ]
}