{
    "id": "12okau1",
    "score": 15,
    "title": "I am Kevin Gordon , creator of the podcast \"Meeting with a Stranger\", and retired pro wreslter AMA!",
    "author": "CrimsonCorpse",
    "date": 1681670332.0,
    "url": "https://www.reddit.com/r/IAmA/comments/12okau1",
    "media_urls": [
        "https://www.reddit.com/r/IAmA/comments/12okau1/i_am_kevin_gordon_creator_of_the_podcast_meeting/"
    ],
    "other_urls": [
        "https://imgur.com/a/NGdTmmG)",
        "https://alarencontreduninconnu.wordpress.com/7-2/)"
    ],
    "postText": " Hello Reddit! I am Kevin Gordon, creator and host of the podcast \"Meeting with a Stranger,\" where I invite strangers to share their stories, experiences, and passions.\n\nI am here to answer any questions you may have about the podcast, my journey as a content creator, and anything related to the world of podcasting!\n\nIf you have any questions about the behind-the-scenes of the podcast, how I find my guests, how I prepare for my episodes, or simply about the fascinating stories I've discovered, feel free to ask!\n\nI am also open to any suggestions for guests or topics you would like to see covered in the podcast.\n\nI am really excited to answer your questions and chat with all of you. So, go ahead, ask away!\n\n[(Proof)](https://imgur.com/a/NGdTmmG)\n\nWebsite - [Here](https://alarencontreduninconnu.wordpress.com/7-2/)\n\n&amp;#x200B;\n\nI had to repost since it was deleted, so here we go again !!!",
    "comments": [
        {
            "level": 0,
            "comment": "Hi Kevin, thanks for sharing with us! I am also a podcaster, our show is a sort of love letter to \"bugs\", I'm an ecologist/entomologist and my cohost is an artist. Our shows are pretty structured because I am discussing sometihng very specific. How difficult is it for you to do an off the cuff interview with strangers and their stories? How do you prepare for a podcast that is more story focused? For exanple, I have to do a lot of research on my end. Do you read about that person ahead of time? Do you know all the specifics of the story or are you hearing it in its entirety for the first time when recording?",
            "score": 4,
            "author": "FillsYourNiche",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the question.\n\nI don’t really do off the cuff, I usually send a form of pre-interview since I might not know anything about the subject or their interests. So after getting the pre-interview back, I get the flow of the interview ready by dividing main points and then expanding those points during the interview. \r  \n\r  \nI do a lot of research beforehand and even too much sometimes which makes me think about questions too much during the episode and that doesn’t appeal to my guests since I'm not listening as I should.\r  \n\r  \nAn example of my complete process is : After I get confirmation of my guest I send out a pre-interview, around 10 questions. When I get it back I focus my research on their passions. If you like surfing I’m going to get the jist of a surfers world and questions one would ask a surfer. \r  \n\n\nedit: a few words",
                    "score": 4,
                    "author": "CrimsonCorpse"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've seen a similar concept where hosts will set up in public places and allow people to come to them and share as they please. Have you tried that format before, or do you prefer to host in a more private setting? \n\nWhen you're selecting guests, how do you make sure they won't bring up wildly inappropriate topics? Lots of people nowadays will take any chance to push their own  views on others. Do you set up a guideline beforehand for them or discuss what stories they'll share?",
            "score": 2,
            "author": "TeaStainedSocks",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry for the long wait, and thank you for the question.\n\nI prefer a quieter setting, but I am working on a 'live' interview during some events. I don't know if it will happen, but it would be interesting to try \n\n\nFor the topics, I go from a pre interview to a kind of structure for the episode, so I can easily steer the conversation. Also it is not live so cutting sections that go too far is a peace of cake.",
                    "score": 1,
                    "author": "CrimsonCorpse"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why did you retired from pro wrestling?(I mean at any point of time did you think that it's not your cup of tea and left wrestling ir you couldn't make enough money or sth other reason?)",
            "score": 2,
            "author": "Ok-Feedback5604",
            "replies": [
                {
                    "level": 1,
                    "comment": "I had to make a decision between living a dream and reality. Unless you are a big indie guy/gal you don't make money, or not a lot. So after some major injuries I accepted to retire and chose a career over dreams.",
                    "score": 1,
                    "author": "CrimsonCorpse",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then did you take any formal training before making this(podcasting)your career?(I mean any media business or presenter like training or diploma?)\n(Plz ans to that I can get some knowledge about media related career)",
                            "score": 2,
                            "author": "Ok-Feedback5604",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Over the years, I have accumulated various tips and techniques for public speaking and presentations, which I've successfully adapted to the realm of podcasting. Although I recognize there's always room for improvement, taking that initial step to begin podcasting is a crucial milestone on the path to growth and refinement in this medium.\n\nEdit - a few words",
                                    "score": 1,
                                    "author": "CrimsonCorpse",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "A valuable tip my sister shared with me during her communication studies was to practice reciting a text with a pencil in your mouth. To enhance my pronunciation, I typically rehearse my introduction before a show, employing this technique to refine my speech.",
                                            "score": 1,
                                            "author": "CrimsonCorpse"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "When you were a pro wrestler, what was the canradiery like with the other wrestlers?\n\nWhat kind of outfit did you wear to wrestle?\n\nDo you have a favourite high profile wrestler at the moment?",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The atmosphere in some companies was more enjoyable than in others, and it largely depended on the \"cliques\" present. If you weren't considered one of the \"boys,\" you might have felt excluded. Fortunately, I had the opportunity to wrestle in various places and meet numerous welcoming people along the way.\r  \n\r  \nI initially wore baggy shorts but eventually transitioned to tights. This change significantly enhanced my appearance, giving off a more professional look. When pursuing success, it's essential to put in the effort and pay attention to every detail.\r  \n\r  \nCurrently, I follow Speedball Mike Bailey, who has a YouTube vlog that offers a backstage glimpse into the world of wrestling.",
                    "score": 2,
                    "author": "CrimsonCorpse"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is there a level of dysfunction present with the overwhelming violence of death match wrestling? Mental health issues? Long term health problems (besides obvious scaring)? For instance: light tubes, knifes, body slammed on razor blades, gusset boards, etc. Why is this ok and how does one become ok with willingly being suplexed into an actual net made of barbed wire?",
            "score": 2,
            "author": "MadManMed",
            "replies": [
                {
                    "level": 1,
                    "comment": "Deathmatch wrestling, known for its extreme violence and use of unconventional weapons, can raise concerns about the physical and mental well-being of the wrestlers involved. While I am not a medical expert, I can share some potential risks and factors associated with this form of wrestling.\r  \n\r  \nMental health issues: The repeated exposure to violent situations and the stress of participating in extreme wrestling matches may lead to mental health issues such as anxiety, depression, or PTSD. The wrestling environment might also normalize violence, which could affect a wrestler's personal life and relationships.\r  \n\r  \nLong-term health problems: Besides the obvious scarring and risk of injury during matches, wrestlers may experience long-term health issues due to the physically demanding nature of their sport. Chronic pain, joint problems, and neurological issues are possible consequences of a prolonged wrestling career. Additionally, the use of weapons like light tubes, knives, and razor blades can lead to infections or other complications if not managed properly.\r  \n\r  \nAs for why this type of wrestling is considered \"okay\" by some, it is often seen as a form of entertainment that caters to a specific audience that enjoys the extreme and violent aspects of the sport. Some wrestlers may be drawn to the adrenaline rush, the challenge, or the notoriety that comes with participating in deathmatch wrestling.\r  \n\r  \nUltimately, whether or not one feels comfortable participating in such events is a personal choice. Some wrestlers might be more willing to take on extreme risks for the sake of their career or for the entertainment of their fans. However, it is important for wrestlers and promoters to prioritize safety and consider the potential long-term consequences of participating in deathmatch wrestling.",
                    "score": 2,
                    "author": "CrimsonCorpse"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Any advice on starting a podcast? And the mindset I should have.\n\nCheers",
            "score": 2,
            "author": "Rewl_Batman",
            "replies": [
                {
                    "level": 1,
                    "comment": "Starting with a clear topic or theme for your podcast is essential, as it provides focus and direction for your content. In addition to following a thread throughout your series, it's also important to keep your audience in mind and provide value to them with each episode. This can be achieved by offering unique insights, expert opinions, or engaging storytelling.\r  \n\r  \nAnother way to make your podcast better is to invest in quality equipment and production values. This includes using a good quality microphone, editing your episodes for clarity and flow, and including music or sound effects to enhance the listener experience. It's also important to promote your podcast effectively by utilizing social media and other platforms to reach a wider audience.\r  \n\r  \nFinally, be sure to engage with your listeners by responding to their feedback, questions, and comments. This creates a sense of community around your podcast and helps build a loyal following. By following these tips and continuously refining your content, you can create a successful and engaging podcast that resonates with your audience.",
                    "score": 1,
                    "author": "CrimsonCorpse"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "While I often feel nostalgic, my busy schedule helps prevent these sentiments from overwhelming me.",
                    "score": 1,
                    "author": "CrimsonCorpse"
                }
            ]
        }
    ]
}