{
    "id": "12up3mf",
    "score": 8526,
    "title": "I am an Air Traffic Controller. Two weeks from today the FAA will be hiring more controllers. This is a 6-figure job which does not require a college degree. AMA.",
    "author": "SierraBravo26",
    "date": 1682124871.0,
    "url": "https://www.reddit.com/r/IAmA/comments/12up3mf",
    "media_urls": [
        "https://www.reddit.com/r/IAmA/comments/12up3mf/i_am_an_air_traffic_controller_two_weeks_from/"
    ],
    "other_urls": [
        "https://www.usajobs.gov/job/723857500)",
        "https://imgur.com/gallery/eYEOQju)",
        "https://www.reddit.com/r/IAmA/comments/v99b50/i_am_an_air_traffic_controller_two_weeks_from/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=ioscss&amp;utm_content=1&amp;utm_term=1)",
        "https://www.reddit.com/r/IAmA/comments/ouykas/iaman_air_traffic_controller_today_the_faa_opened/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)",
        "https://www.reddit.com/r/IAmA/comments/et0g75/iaman_air_traffic_controller_tomorrow_the_faa/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)",
        "https://www.reddit.com/r/IAmA/comments/bsbndl/iaman_air_traffic_controller_this_time_last_year/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)",
        "https://www.reddit.com/r/IAmA/comments/8kwxk3/iaman_air_traffic_controller_the_faa_will_be/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)",
        "https://www.faa.gov/be-atc)",
        "https://www.aviationmedicine.com/wp-content/uploads/2014/02/Medical-Standards-for-Terminal-and-En-Route-Centers-for-ATC-Positions%C2%A0FAA-Brochure.pdf)"
    ],
    "postText": "**Update May 5**\n\nThe bid is live. [**CLICK HERE TO APPLY!**](https://www.usajobs.gov/job/723857500)\n\n**Update May 4**\n\nThe bid goes live tonight at 12:01 eastern. I’ll post a link to the application here once it’s available.\n\n**Update April 24**\n\nFor those wanting to know what to do now, you can go ahead and make a profile on USAJobs and create your resume using the resume builder tool (*highly recommended*). The job posting will be under series 2152 and titled “Air Traffic Control Specialist Trainee”, but you won’t see it until it goes live on May 5. Again, I’ll update this thread with a direct link to the application once it goes live to make it easy. \n\nKeep sending questions my way. I’ll answer everyone eventually!\n\n**Update 2 April 22**\n\nI’m still answering all my DMs and any questions here. Same as always, I’ll keep updating this post over the next 2 weeks, and will have a direct link to the application posted here once it goes live. Feel free to keep engaging here, and I’ll also be posting updates over on r/ATC_Hiring\n\n**Update April 22**\n\nJust waking up, seeing a lot of questions now. I’ll start combing through and get back to everybody!\n\nAlso feel free to sub to r/ATC_Hiring . I made that sub a few years ago to be a place for people to keep in touch while going through the hiring process.\n\n[Proof](https://imgur.com/gallery/eYEOQju)\n\nI’ve been doing AMA’s for these “off the street” hiring announcements since 2018. Since they always gain a lot of interest, I’m back for another one. I’ve heard back from *hundreds* of people (if not thousands at this point) over the past few years who saw my posts, applied, and are now air traffic controllers. Hopefully this post can reach someone else who might be looking for a cool job which happens to also pay really well. \n\nCheck out my previous AMAs for *a ridiculous amount* of info:\n\n[2022](https://www.reddit.com/r/IAmA/comments/v99b50/i_am_an_air_traffic_controller_two_weeks_from/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=ioscss&amp;utm_content=1&amp;utm_term=1)\n\n[2021](https://www.reddit.com/r/IAmA/comments/ouykas/iaman_air_traffic_controller_today_the_faa_opened/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)\n\n[2020](https://www.reddit.com/r/IAmA/comments/et0g75/iaman_air_traffic_controller_tomorrow_the_faa/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)\n\n[2019](https://www.reddit.com/r/IAmA/comments/bsbndl/iaman_air_traffic_controller_this_time_last_year/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)\n\n[2018](https://www.reddit.com/r/IAmA/comments/8kwxk3/iaman_air_traffic_controller_the_faa_will_be/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)\n\n** This year the application window will open from ***May 5 - May 8*** for all eligible U.S. citizens.**\n\nEligibility requirements are as follows:\n\n- Must be a U.S. citizen\n\n- Must be registered for Selective Service, if applicable (Required for males born after 12/31/1959) \n\n- Must be age 30 or under on the closing date of the application period (with limited exceptions)\n\n- Must have either three years of general work experience or four years of education leading to a bachelor’s degree, or a combination of both\n\n- Must speak English clearly enough to be understood over communications equipment\n\n**- Be willing to relocate to an FAA facility based on agency staffing needs**\n\n[START HERE](https://www.faa.gov/be-atc) to visit the FAA website and read up on the application process and timeline, training, pay, and more. Here you will also find detailed instructions on *how to apply*.\n\n[MEDICAL REQUIREMENTS](https://www.aviationmedicine.com/wp-content/uploads/2014/02/Medical-Standards-for-Terminal-and-En-Route-Centers-for-ATC-Positions%C2%A0FAA-Brochure.pdf)\n\nLet’s start with the difficult stuff: \n\nThe hiring process is *incredibly* arduous. After applying, you will have to wait for the FAA to process all applications, determine eligibility, and then reach out to you to schedule the AT-SA. This process typically takes a couple months. The AT-SA is essentially an air traffic aptitude test. The testing window usually lasts another couple months until everyone is tested. Your score will place you into one of several “bands”, the top of which being “Best Qualified.” I don’t have stats, but from my understanding the vast majority of offer letters go to those whose scores fall into that category. \n\nIf you receive and accept an offer letter (called a Tentative Offer Letter, or TOL) you will then have to pass medical and security clearance, including:\n\n- Drug testing\n\n- Minnesota Multiphasic Personality Inventory (MMPI2)\n\n- Class II medical exam\n\n- Fingerprinting\n\n- Federal background check\n\nOnce you clear the medical and security phase you will receive a Final Offer Letter (FOL) with instructions on when/where to attend the FAA Academy in Oklahoma City, OK.\n\nDepending on which track you are assigned (Terminal or En Route), you will be at the academy for 3-4 months (paid). You will have to pass your evaluations at the end in order to continue on to your facility. **There is a 99% chance you will have to relocate.** Your class will get a list of available facilities to choose from based solely on national staffing needs. If you fail your evaluations, your position will be terminated. Once at your facility, on the job training typically lasts anywhere from 1-3 years. You will receive substantial raises as you progress through training. \n\n**All that being said:**\n\nThis is an *incredibly* rewarding career. The median pay for air traffic controllers in 2021 was **$138,556** (I don’t have the number from 2022). We receive extremely competitive benefits and leave, and won’t work a day past 56 (mandatory retirement, **with a pension**). We also get **3 months of paid parental leave**. Most controllers would tell you they can’t imagine doing anything else. Enjoying yourself at work is actively encouraged, as taking down time in between working traffic is paramount for safety. Understand that not all facilities are well-staffed and working conditions can vary greatly. But overall, it’s hard to find a controller who wouldn’t tell you this is the best job in the world. \n\nPlease ask away in the comments and/or my DMs. I always respond to everyone eventually. Good luck!",
    "comments": [
        {
            "level": 0,
            "comment": "For more AMAs on this topic, subscribe to r/IAmA_Specialized, and check out our other topic-specific AMA subreddits [here](https://reddit.com/r/IAmA/wiki/index#wiki_affiliate_topic-specific_subreddits).",
            "score": 1,
            "author": "IAmAModBot"
        },
        {
            "level": 0,
            "comment": "How do you understand what people are saying over those low audio quality radios with a lot of background noise? Does it sound as bad as it does on those website where you can listen in on ATC towers?",
            "score": 1235,
            "author": "Jounas",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh no, the audio quality is infinitely better than what you hear on LiveATC",
                    "score": 1746,
                    "author": "SierraBravo26",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow, thanks! It baffled me how someone could understand that without subtitles",
                            "score": 655,
                            "author": "Jounas",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah that would be unbearable",
                                    "score": 619,
                                    "author": "SierraBravo26",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I flew a Cessna in bravo airspace. A JAL flight was entering and pilot's English was so bad, ATC kicked him out of sequence to land. Told him to learn to speak better English. Doh!",
                                            "score": 329,
                                            "author": "ptanaka",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's a BIG oof considering he's also expected to know english even when flying in japanese airspace. It's the internationally accepted language of the skies in most places and most airlines require you to know it before they'll even put you in a cockpit. Basically the only place this isn't true now is Russia, who once again is cut off from the international air travel network, and no flights go through Russia either for obvious reasons, but before the war even they were required to know english",
                                                    "score": 345,
                                                    "author": "Faxon",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "There were (still are?) huge issues with especially Asian commercial pilots who knew the standard vocabulary well, but did not actually speak english. As soon as something was non-standard, they didn’t get anything ATC was saying and communication broke down. \n\nSomething like this (here it’s _relatively_ harmless, but imagine it’s in a serious situation):\n\nhttps://youtube.com/shorts/tRR3ObhuWHY?feature=share",
                                                            "score": 164,
                                                            "author": "Exatex",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Iirc, there was a plane crash featured on Air Crash Investigation that crashed partly because the pilot did not actually speak English, only knew how to reply using standard words. Crazy.",
                                                                    "score": 90,
                                                                    "author": "ThisIsNotAFunnyName",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "“So you *do* speak English?”\n\n“No, only that sentence and this one explaining it.”\n\n“…you’re kidding, right?”\n\n“¿Què?”",
                                                                            "score": 28,
                                                                            "author": "Captain_Waffle"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Which episode?",
                                                                            "score": 7,
                                                                            "author": "superhero455",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I'm not sure which incident the poster above was referring to, but one such incident involving use of language was the [1977 Tenerife airport disaster](https://en.wikipedia.org/wiki/Tenerife_airport_disaster), which is the deadliest aviation incident on record, resulting in the death of nearly 600 people. It featured in [series 16, episode 3](https://www.imdb.com/title/tt5863646/) of Air Crash Investigation/Mayday/Air Disaster. See stickied posts in /r/aircrashinvestigation to find out where to watch it online ;)\n\nLanguage wasn't the primary cause of the accident, but it played a part, and resulted in recommendations that emphasized standard phraseology and good command of the English language, as being essential to aircraft safety.\n\nIn my opinion, both the pilot and controller are at fault in this video. The pilot, obviously, for clearly not meeting a good working knowledge of English, and the controller (albeit to a lesser degree) for using phrases that can be confused due to language/radio interference/etc. which they are supposed to be trained to avoid using.",
                                                                                    "score": 17,
                                                                                    "author": "zero_iq",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "A big oof is also how quickly and non-standard atc in america talks compared to ICAO",
                                                            "score": 102,
                                                            "author": "canyoutriforce",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "NY TRACON really does a number even on Americans.",
                                                                    "score": 29,
                                                                    "author": "SamTheGeek",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Am a US based airline pilot who flies &gt;50% of my flights into and out of NYC. Have been for years. \n\nI regularly ask my flying partner “what the **** do they mean by that?”",
                                                                            "score": 33,
                                                                            "author": "PMMeUrTinyT1ts",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I have a friend who’s currently at Monroney and wants to go to NY (best pay, plus she’s from the northeast) and I expect that we’ll never be able to understand her again once she starts.",
                                                                                    "score": 8,
                                                                                    "author": "SamTheGeek"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Details are murky, but I'll try my best here. This was probably in the early 1970s. Definitely Canada.\n\nI recall a story making it to the news about a private pilot creating some controversy. The issue was that he only spoke French and tried entering ATC for a larger airport. Chaos ensued.\n\nMy dad was a former pilot (not commercial) and had involvement with commercial pilots on a professional level. This story really pissed him off.",
                                                    "score": 22,
                                                    "author": "handlebartender",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It was, especially with ROK Marines who knew about 1 word of English ... *Roger!* I've told the story [elsewhere](https://www.reddit.com/r/MilitaryStories/comments/pjzlir/that_time_with_a_code_2_and_a_rok_marine/), but that little \"communication problem\" almost caused us to lose Bob Hope and VP Spiro Agnew.",
                                            "score": 45,
                                            "author": "hedronist",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Which would have been a terrible tragedy. That was their second-to-last Agnew!",
                                                    "score": 40,
                                                    "author": "DontTreadOnBigfoot",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I feel a jowel movement coming on!!",
                                                            "score": 17,
                                                            "author": "gdub695",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "RRRRRRRRRRR!!!",
                                                                    "score": 10,
                                                                    "author": "litescript"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; the audio quality is infinitely better than what you hear on LiveATC\n\nThis genuinely made me laugh. Going back a few years -- Korea, 1970-1 -- I was with the 284^th AVN ATC attached to 8^th Army HQ. Technically I was 93K20 (Enroute Approach; sort of like ARTCC), but we all ended up working tower (93H20).\n\nWhen I arrived in late 1970, our tower radios were absolute crap. This was at H201, the VIP helipad for 8^th Army HQ, so you would think they would go the extra mile. Nah, this was the Army. \n\nThen one day Robo arrived. His last name was Wrobowski (I think), but the controllers considered him to be a good friend of the Radio Gods. He did nothing by the book, but suddenly our radios were performing like Chinese acrobats. Saying the difference was night and day is a massive understatement.\n\nThere are many wild and weird stories involving Robo, but as the song says, \"You don't know what you've got til it's gone.\" When Robo finally rotated home, we got a new Spec 6 running Commo and he did *everything* by the book. Our radios went from Heaven to Hell in about 2 weeks. God I missed Robo.",
                            "score": 143,
                            "author": "hedronist",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Glasses, slight gap tooth, and always looked like it was a bit too bright outside?",
                                    "score": 39,
                                    "author": "SocialSuicideSquad",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No,  that's Radar",
                                            "score": 26,
                                            "author": "felpudo",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;He did nothing by the book, but suddenly our radios were performing like Chinese acrobats.\n\nRoughly speaking what does that translate into?  Was he boosting transmission range or going outside of FCC specs or something?",
                                    "score": 15,
                                    "author": "diymatt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "**tl;dr:** the problem was mostly antenna type and location relative to terrain features. \n\nFirst let me state:\n\n+ This was more than 50 years ago (*sigh*),\n+ My career was as a software engineer, not an EE,\n+ I just used the radios and had nothing to do with the physical equipment (except for those unfortunate incidents involving our radio beacon antenna and a couple of packs of hot dogs).\n\nWe had several problems: wires in subpar condition, connectors that had corrosion, etc. The most significant problem turned out to be the interaction between our antennas (not the ones involving the hot dogs) and the local terrain. UHF is mostly LOS (Line of Sight), and VHF only slightly less so.\n\nTo our north was *Nam San* (South Mountain) which totally blocked signals from that direction. This was not too much of a problem because there was prohibited airspace (around the Presidential Palace), ground to unlimited, starting about 200' north of our northern boundary. Meaning we *never* had aircraft coming from that direction.\n\nTo our east was a ~150' hill with an elementary school on it. He looked at putting a remote antenna up there, but there were problems both technical and political with that. So another block.\n\nTo the west was Officer Country (i.e. family housing). That was prohibited under 5,000', so we didn't use it for a traffic pattern. We had good LOS, but we had iffy signal strength/quality depending on what frequency we were on. Predictably, the most problems were on our primary tower frequency. To the south we had both good LOS and signal quality.\n\nThe problem was that easily 60% of our traffic was coming from the west following the Han River. And that's where the \"iffy signal\" came into play.\n\nRobo spent a couple of weeks walking/driving around with radios and test meters trying to identify the source of the problem (not your average spec 5 commo guy). He never exactly nailed it, but he did have a map where he drew contours showing areas of signal strength/quality.\n\nThe problem was something in Officer Country that was both electrically and *magnetically*(?) active, causing both static and a 'drifting signal'(?). He dealt with part of it by using some sort of homemade RF bandpass filter, and suddenly about 80% of our static disappeared. The only solution he could figure for the other problem was a signal relay from our southern border, where the problem didn't manifest. This involved an oddly-shaped antenna + electro-magical stuff that only Robo understood.\n\nThese 2 things took our signal from the west from about a 3x2 to 5x5. It might not have been by the book, but for about 9 months it was glorious. And then he rotated home, some details of which are part of my yet-to-be-written magnum opus: 'Part I: [Orange Sunshine](https://en.wikipedia.org/wiki/ALD-52#History) Kimchi -- Fear and Loathing in Itaewon' and 'Part II: Robo goes insane' (alternate title: 'Wrobowski the Destroyer').",
                                            "score": 28,
                                            "author": "hedronist",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I am so happy to hear this, it's always been a question of mine,  I love listening on liveatc and always assumed IRL it was better, glad to hear it's true you can actually hear better,  WE'd all be dead if you couldnt",
                            "score": 12,
                            "author": "dmcginvt"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Dude, work a McDonalds drive through for a month.  Trying to hear people through a shitty speaker, over their super duty, high pitched diesel engine messes with your brain.  It starts filling in the words, even when your ears don't hear them.\n\n\"I w\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ac\\_\\_\\_eel\\_\\_arg\\_\\_siz\\_\\_\\_w\\_\\_\\_\\_oke.\"\n\n\"That's a big mac meal, large sized with a coke?\"  \"Yep\"  \"$10.89. Pull around.\"",
                    "score": 99,
                    "author": "MakingItElsewhere",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The reason for this is. LiveATC receivers are placed at low altitudes somewhat far from the airport by plane nerds. The FAA splashes the cash for the very best transmitters and receivers mounted on massive antenna towers in then perfect locations. So for them unless something is really fucked one-off it sounds like a telephone call.",
                    "score": 104,
                    "author": "blbd",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "What are some reasons one wouldn't want to get into this career? Surely it's not 100% upsides.",
            "score": 684,
            "author": "formalcall",
            "replies": [
                {
                    "level": 1,
                    "comment": "Most likely will have to relocate, work weekends for the first 10-15 years of your career, and miss some holidays",
                    "score": 1063,
                    "author": "SierraBravo26",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wait, I already do two of those for like 1/3 of the pay. And I'm just under 30. Maybe I should apply...",
                            "score": 777,
                            "author": "DanTheMan_622",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you want to, you should do it now.  Once you hit that magic number, the opportunity has passed.  \n\nMy dad worked for the FAA in many different capacities over his lifetime and enjoyed it (he was not a controller).  \n\nHe wanted me to apply when I was younger, but I was not interested.",
                                    "score": 79,
                                    "author": "UnicornFarts1111",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'd have to do some more research because it sounds like a huge commitment based on some of OP's other answers. I turn 28 later this year so I still have a little bit of time left to consider it, this ama does actually have me curious to at least look into it.",
                                            "score": 37,
                                            "author": "DanTheMan_622",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I think that it's more of a career opportunity than anything else. Some younger people might not have the direction. I worked retail, food, and customer service for two decades before I landed my current skilled labor job. I would've skipped college had I known.",
                                                    "score": 16,
                                                    "author": "goingnorthwest"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "They do not open up for applications often.",
                                                    "score": 7,
                                                    "author": "Smee76"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Do it",
                                    "score": 490,
                                    "author": "SierraBravo26",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Does having purchased weed in a recreational state bar you completely or would you just have to pass the drug test?\n\nEdit to clarify: purchased weed from a dispensary",
                                            "score": 128,
                                            "author": "ClaritinRabbit",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Your past with drugs will not affect you, provided you do not have a criminal history. However, you will have to pass a DoT drug panel right off the bat and then be subject to random, but somewhat frequent testing throughout your career. I have heard of some places performing hair follicle tests for new hires in the past, but I have not encountered it personally.",
                                                    "score": 44,
                                                    "author": "RazgrizSeed"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Just pass the drug test",
                                                    "score": 121,
                                                    "author": "Jangenzer0",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I know multiple controllers with possession charges in their youth.  No big deal.  Just pass the drug test and it'll be fine",
                                                    "score": 103,
                                                    "author": "ItinerantBanana"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You’re fine, you just can’t be using it anymore.",
                                                    "score": 44,
                                                    "author": "SierraBravo26",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "...aaand half of reddit just left the thread.",
                                                            "score": 63,
                                                            "author": "soulcaptain"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm assuming prescribed stimulants are a no go?",
                                                            "score": 11,
                                                            "author": "Slang_Whanger",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Apply because you're genuinely interested in becoming a FAA, not because your current job sucks and this one has equally bad schedule.",
                                    "score": 136,
                                    "author": "Dick_Demon",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That comment wasn't meant completely seriously, but I get what you're saying. I honestly don't *genuinely want* to do any job so I'm always trying to keep my eyes open for anything I think I could at least tolerate (and qualify for with my lack of degree) that also pays the bills, and, well, air traffic control certainly fits the second requirement at least lol.",
                                            "score": 90,
                                            "author": "DanTheMan_622",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 63,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "My cousin did that 20 years ago after flunking out of engineering. Married a girl he met on air traffic training.\n\nThey are some of the highest achievers I've ever met. It's not for everyone, but a great job if you can handle it.",
                                                            "score": 27,
                                                            "author": "Steinrikur",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I get paid well in a complex job. I don't think i could be atc.",
                                                            "score": 21,
                                                            "author": "KingsleySeiffert"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I mean, yes and no.  Could the FAA job be worse than their current one?  Absolutely.  Do they need to be particularly interested in or passionate about being an air traffic controller?  Not really. \n\nIf you have a skill set or talents beneficial to ATC then it becomes more of an issue of woyld you rather do this job for x amount or that job for y amount.  For example, if you asked all the ATCs in the country what they wanted to be when they grew up, there ain't gonna be a ton who answered \"ATC.\"",
                                            "score": 29,
                                            "author": "Daddysu",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "A 3x increase in income can easily remove all the other suck in your life. The job equally sucking isnt ideal, but everything else sure is.\n\nNice trade to make, and you can always pivot out of the career if it doesnt suit you.",
                                            "score": 19,
                                            "author": "Letmefixthatforyouyo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ya. Like...while I really like my job(social worker), before grad school my wages were way way lower than they are now. Suddenly getting discretionary money is huge",
                                                    "score": 8,
                                                    "author": "GreatMadWombat"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The schedule sucks if you are a normal human being.\n\nIt was a bit of everything all at once for me, but working two evening shifts (get off at 9pm then 10:30pm), then two morning shifts followed by a midnight shift at the end of your fourth day were hell.",
                    "score": 86,
                    "author": "Keltarrant",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Kind of sounds like they're hoping to cause crashes.",
                            "score": 31,
                            "author": "A1000eisn1",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It can be a pretty stressful position. You have to be able to quickly and clearly communicate with dozens of planes even in emergency situations.",
                    "score": 111,
                    "author": "Davidmoose",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Incredibly high stress, shift work, destroys relationships, shitty suicide rate, etc. A friend of mine was one for many years she finally washed out about 10 years ago, unless things radically changed she recommend against it for anyone that was interested.",
                    "score": 265,
                    "author": "malwareguy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah OP conveniently doesn’t mention these parts. My dad has worked in aviation his entire career and said that everyone in the industry knows that being an ATC is the most stressful job on the planet",
                            "score": 138,
                            "author": "chemical_sunset",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This! This is what I’ve always heard too. Had a guy in my graduating OTA class who was an air traffic controller and was making a career change because of how stressful and high stakes it is.",
                                    "score": 35,
                                    "author": "GroundedOtter",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What is OTA",
                                            "score": 10,
                                            "author": "thechilipepper0",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Now is it just being an ATC at a super busy airport like O'Hare or even for smaller regional airports? I imagine one is way more stressful than the other.",
                                    "score": 8,
                                    "author": "CunnedStunt",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My dad was one for 30, and I have a lot of memories of him sleeping on the sofa. The  shift scheduling was brutal. 3 days on, 3 days off, 4 days on, 2 days off, and jammed as full of shifts  as the system could legally allow.",
                            "score": 21,
                            "author": "nomecks",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I work on ATC systems for a living and work closely with controllers. Some can be very difficult, arrogant bordering on sociopathic. Affairs, divorce etc. are very common amongst them, people are talking about high stress, no one has mentioned boredom. They master their jobs in a few years and from that point on it’s the same job in a sterile room for 25+ years, the boredom is suffocating.",
                            "score": 35,
                            "author": "Imundo",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "From the people I know that work there, it also sucks having to work with other ATCs lol... many of them seem to have a god complex",
                            "score": 23,
                            "author": "xixi2",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Mandatory 6 day work weeks at many facilities. Inability to choose where you work - you could be placed anywhere in the country. If you get placed at a poorly staffed facility you may not be able to leave before retirement, unless the system changes. Basically in an effort to staff shitholes where no one wants to work, they've made it so no one can leave those places unless staffing rises above an unrealistic threshold.\n\nI used to love this job but 6 day work weeks have killed my enthusiasm in and out of work. I'd also add that many people suspect the FAA is keeping things the way they are, rather than massively increasing hiring, because it's cheaper to pay the overtime than it is to pay new bodies and their trainers.",
                    "score": 194,
                    "author": "DaytonaJoe",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I will mention this from my experience trying to go through the program:\n\nTo do the health screenings and everything involved, they require you to go to the nearest locations that offer it. They only selected 2 during my group. They were California and New York. You had to pay to get there which for many people means up to $800 for the trip. Good luck if you weren't close by.\n\nPlus, the \"we pay you during your training\" is 25k PER YEAR. So you have to be fine with 3 to 4 months of that pay while living in Oklahoma City, OK. Housing isn't included nor is transportation. So you better hope you can find a cheap option as the ones listed as common options are extended stay motels or house rentals where the prices were around 1200-1500 per month. This is before all of your other bills for transportation and anything else. \n\nOn top of this, the training starts at their leisure which means that if you aren't living with others who are willing to let you leave whenever, you are likely paying termination fees. \n\nPlus, once you do graduate, the salary isn't 6 figures. It is 70k plus or minus cost of living adjustments for the area.",
                    "score": 22,
                    "author": "Traevia"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are some airports more stressful than others? What types of airports do entry level ATCs start out at, and how often (if at all) do ATCs move to different airports?",
            "score": 99,
            "author": "CSKnowItNone",
            "replies": [
                {
                    "level": 1,
                    "comment": "Of course! \n\nSo there are multiple types of facilities, and not all controllers work at an airport. There are also en route centers, tower/Approach facilities, and standalone approaches. At it’s simplest form, once your flight departs, a departure controller in an approach facility (radar) gets you climbing and turning, and then center controllers work you across the country up at altitude. Then it’s all reversed as you get closer to your destination. \n\nNew hires get slotted for either tower or en route. If you get tower, you’ll end up at a mid—range facility out of the academy. Once you certify, you can try to transfer to another facility, where you’ll have to go through some more training to learn the local airspace, SOP, etc. \n\nIf you get hired for en route, you’ll go to one of the 21 centers once you graduate the academy. Those are all around major metropolitan areas.",
                    "score": 147,
                    "author": "SierraBravo26",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for the info! ATC was something I've been interested since I was 11 (rather than astronaut or something like that) so it's something I'll look into. I currently work for the fed govt so are there any benefits that come with that?",
                            "score": 32,
                            "author": "CSKnowItNone",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not exactly true that there are no benefits transferring from one agency to another. A couple of things, you would want to end one pay period on the books for agency A and start with agency B the very next day. Why? Because you can get save pay. You could retain your pay until your ATC catches up to or passes what you were making before the transfer. While training at the academy your pay is low to start but you get per diem and big pay raises along the way in training. If you have a break in service you do not get this benefit.\n\nYour federal time would count toward earning more leave, the 3, 5, 15 year milestones. Your federal time would count toward retirement. For ATC it is 1.7% for the first 20 years and 1% after that. Non-ATC time would add 1% per year of service. Lastly federal service time is a tie breaker in seniority if you join the agency at the same time as someone else and end up at the same ATC facility.",
                                    "score": 28,
                                    "author": "IctrlPlanes"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why the age requirement of under 30?",
            "score": 710,
            "author": "homiedontplaytdat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mandatory retirement at age 56 is the best answer I have",
                    "score": 1119,
                    "author": "SierraBravo26",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When I saw your last ama 3-4 years ago I was already too old to apply 😭 I would've applied otherwise",
                            "score": 207,
                            "author": "nokarmawhore",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same here. I got really excited then saw the age requirement, this was a couple times ago though.",
                                    "score": 76,
                                    "author": "Original_Sciene",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Can't have those old people being too slow or unable to direct traffic. Don't need grandpa falling asleep either.",
                            "score": 309,
                            "author": "urabewe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Or middle-aged guys who just lost their daughter to a heroin overdose",
                                    "score": 736,
                                    "author": "NavyJack",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Someones pool had a bad day",
                                            "score": 34,
                                            "author": "Shadrach_Jones"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Fucking minerals innit",
                                            "score": 17,
                                            "author": "TRAMPCUM_SQUEEGEE"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Poor Q.\n\nTake that reference.",
                                            "score": 61,
                                            "author": "xproofx",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Maybe he was right about humanity being awful.",
                                                    "score": 18,
                                                    "author": "LemonColossus"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Well that got dark real quick. Is this a reference to something?",
                                            "score": 116,
                                            "author": "urabewe",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "As the deleted comment said, there was a documentary about a science teacher that became a meth kingpin",
                                                    "score": 453,
                                                    "author": "SensibleCircle",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Amazing how they got those cameras everywhere for that documentary",
                                                            "score": 115,
                                                            "author": "thrik",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They used the camera crew from trailer park boys.",
                                                                    "score": 45,
                                                                    "author": "TheB1GLebowski",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Breaking Bad",
                                                    "score": 67,
                                                    "author": "rachface636",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Oh boy, you get to see Breaking Bad for the first time. Lucky duck",
                                                    "score": 18,
                                                    "author": "Wafflelisk",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Crazy that you can be president at 80 but can't be an air traffic controller at 57.",
                                    "score": 134,
                                    "author": "JethroFire",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The actual answer is because the older you are the harder it is to learn.\n\nhttps://www.businessinsider.com/becoming-air-traffic-controller-career-pros-cons-of-job-2022-1\n\n&gt; All ATC applicants must be 30 or younger on the closing date of the application period to qualify for the position, according to the FAA. This is because the agency has determined through extensive research that the older someone is, the harder is it for them to complete the rigorous training.\n\nThe \"extensive research\" text in quote above links to a report from July 1971 which is below: \n\nhttp://libraryonline.erau.edu/online-full-text/faa-aviation-medicine-reports/AM71-36.pdf",
                    "score": 173,
                    "author": "KindOne",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It makes more sense seeing that the study is from the 70s. I didn't understand why someone being 30 or 35 would be considered old. I imagine the fact that most 30 year olds had families back then played a role.",
                            "score": 121,
                            "author": "A1000eisn1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This isn't particularly surprising the FAA is stuck in the 70s in a lot of ways.",
                                    "score": 89,
                                    "author": "Stealthpenguin2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I mean, they're still using the MMPI for screening",
                                            "score": 26,
                                            "author": "new_glerp_city"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "About everything to do with our government is stuck in the past refusing change with the times and becoming modern",
                                            "score": 6,
                                            "author": "Slit23"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah and maybe that's standard for most people, but I'm 40 and I feel like I can learn new things better than ever. Like I have taught myself how to learn faster.\n\nI made a career switch to HVAC a little over a year ago. I had zero experience with anything HVAC besides fixing my own furnace a couple times. I do have extensive hobby experience with hand tools, power tools, and fabrication. I picked right up on HVAC and now I'm the owner's and lead salesman's go-to installer over 10 other employees, all with years more experience than I have. All I did was ask questions and absorb as much as I could while I was working with others.\n\nI think the belief that people learn slower as they age might be just because most people let the skill of learning slip away.",
                                    "score": 25,
                                    "author": "Slipsonic",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 18,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Definitely feel like this is something that should be relooked into, with video games and computers becoming significantly more prominent in the last 30 years i'd suspect a lot more people would be reasonably able to learn to do this job.",
                            "score": 46,
                            "author": "slicer4ever",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is it as stressful as they claim? Are most days fine, but then when delays are factored in, it becomes intense?",
            "score": 89,
            "author": "squatwaddle",
            "replies": [
                {
                    "level": 1,
                    "comment": "As stressful as some might think? Probably not. You pretty much hit the nail on the head. Regular days are fine, weather and bad staffing can really suck.",
                    "score": 137,
                    "author": "SierraBravo26",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m not sure I could live my life if eventful weather directly caused my job to be more stressful. One of my favorite joys is big storms, the cognitive dissonance would be painful",
                            "score": 48,
                            "author": "nichecopywriter",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You’ll hear a lot that controllers would rather have it storm on their days off than while they’re working",
                                    "score": 55,
                                    "author": "SierraBravo26",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "About how often do you give pilots a “number to call”?",
            "score": 238,
            "author": "NavyJack",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not often lol",
                    "score": 151,
                    "author": "SierraBravo26"
                },
                {
                    "level": 1,
                    "comment": "What does that mean",
                    "score": 56,
                    "author": "PaulBlartFleshMall",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When there's an incident (rules broken, procedures not followed, pilot fuck up, near miss etc....) the ATC will give the pilot a number so that once they're done flying they can call it and get their arse chewed out...or tell their side to the investigating team. You hear it a lot on the ATC YouTube videos due to them usually being about incidents.",
                            "score": 205,
                            "author": "blood__drunk",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "You **do not** want to be given a number to call by ATC. It means you dun fucked up greatly.",
                            "score": 72,
                            "author": "Myownprivategleeclub",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They always call it a 'possible pilot deviation', it's not a 100% you fucked up. Could simply be a misunderstanding. ATC makes mistakes also.",
                                    "score": 45,
                                    "author": "Sunsparc",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, and if you *did* fuck up, you're still very difficult to replace. I've fucked up plenty in my career (mainly pest control, followed by truck driving), but I've found that so long as I don't try to hide it, do what I can to fix it including ask for help, and in the long term demonstrate a capacity to learn from my mistakes, I'm fine.\n\nThe one time my boss did blow a gasket because I dared explain my position, I was working for his competitor within the week.",
                                            "score": 27,
                                            "author": "DaSaw"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's a 'pilot deviation', meaning you did something that broke the rules. They give you a phone number to call and talk you through what happened. If it was a simple mistake like being over the hold bar a little bit while taxing, they'll probably just say 'don't do that again'. Or if it was Harrison Ford landing on a taxiway level mistake, it could escalate to an investigation and revocation of pilots license.",
                            "score": 22,
                            "author": "Sunsparc"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have another question, what’s the most stressful moment you’ve had while working?",
            "score": 65,
            "author": "wallerc15",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you don’t mind military ATC stories. We had extremely thick fog rolling through during flight ops in the Arctic Circle out at sea. A Marine MV-22 Osprey was still out and had to come back because they had 30 minutes of fuel left which is usually fine in good weather but visibility was absolute shit so we were a little nervous. They didn’t make it on to the boat on their first two attempts and by the 2nd attempt was over we were already spinning up additional SAR helicopters for when they inevitably fall out of the sky into the freezing cold ocean. The pilot/copilot we’re getting audibly shook up and every transmission they made ended with a quiet sigh but our Final controller was in extreme focus mode and pretty much at the last minute, they got the guys on board and everybody in Radar pretty much went into celebration mode. Probably the first and only time I ever saw all of Radar and the adjacent work centers (CIC, TACRON, and Tactical Logistics) in one single tiny room watching one guy work his magic. The pilots even came into Radar and gave the guy a hug saying he saved their lives and explaining how terrifying it was how they could barely see anything in front of them so they had to trust their instruments and ATC.",
                    "score": 142,
                    "author": "CrackCocaineShipping",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I’ll take this one. I worked in ATC at Houston Center for 9 years. Quit to move to Colorado and buy a bar. Totally different story, but I have a few horror stories. \n\nFirst one was the least harmful. I was in training on the radar. I had a fully certified and very tenured controller watching my every move and would have intervened had he thought it necessary. But this dude was chill as fuck and not once keyed over me. I was really busy, but doing pretty well. At some point a pilot keyed onto my frequency and I couldn’t find him anywhere on my scope. My heart dropped into my stomach. I pulled up his data block. He was in the sector over, but the hand off had been made. He was totally fine. I had just forgotten so switch communications with him. These things do happen, but that was a feeling of pure terror. I cried myself to sleep that night. \n\nOnce we were working an American Airlines flight from DFW to Cancun, and he was northwest of Austin when the pilot keyed up and said there was smoke in the cockpit. We were able to safely get him to San Antonio, but the fear in the pilot’s voice definitely stuck with me. \n\nI worked in QA (quality assurance) for a year or two, in which the “tapes get pulled” for any time someone has had a safety incident. Everything on your screen and every transmission is recorded. So we were analyzing other peoples’ fuck ups, and there were some doozies in there.",
                    "score": 128,
                    "author": "shorrrtay",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "What is your own educational and work background? What activities leading up to your now career do you find help you most in your day to day activities?",
            "score": 228,
            "author": "insaneintheblain",
            "replies": [
                {
                    "level": 1,
                    "comment": "I graduated with an associate’s degree from a CTI program. Before that I was a baggage handler and had no clue what I wanted to do with my life. Discovered ATC at age 24 and pulled the trigger. \n\nNot sure I understand the second part of your question.",
                    "score": 309,
                    "author": "SierraBravo26",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For example before my professional career I was a waiter (who also had no idea what he wanted to do, haha) what I found carried across into my now career is my ability to multitask and a high capacity for putting up with bullshit.",
                            "score": 141,
                            "author": "insaneintheblain",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah yes, similar things here. There also seem to be quite a few gamers in the profession.",
                                    "score": 154,
                                    "author": "SierraBravo26",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's really interesting... my brother is a big gamer, and my parents would always tell him off for playing - but he says the same thing, that they helped him build skills that he finds useful in his job.",
                                            "score": 61,
                                            "author": "insaneintheblain",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There's a reason U.S. military drone controllers are designed to look similar to video game controllers. High crossover in that industry too.",
                                                    "score": 51,
                                                    "author": "BrazenBull",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Don't they just use plain ol' Xbox 360/Xbone controllers? I recall reading that a few years ago that since they were readily available in large quantities, built to handle being thrown around a bit by teenagers, had a great SDK for integrating them in your program, and a large majority of the force under 30 already knew how an Xbox controller worked (substantially reducing training time and cost) that they were a perfect solution.",
                                                            "score": 24,
                                                            "author": "scottpid",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What do they do in CTI classes?",
                            "score": 5,
                            "author": "blbd",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have thought this job is extremely stressful and deleterious to one's mental and physical health. (Understand I can remember Reagan firing air traffic controllers in the 80s.)\n\nOr are these 'old conditions' which have been ameliorated over the years..??",
            "score": 35,
            "author": "sleeper_54",
            "replies": [
                {
                    "level": 1,
                    "comment": "Some of the conditions remain (poor staffing), but the current contract is much more controller-friendly",
                    "score": 19,
                    "author": "SierraBravo26"
                },
                {
                    "level": 1,
                    "comment": "I get the impression that ATC work attracts a certain type of person who is not as easily stressed as the average bear. Their hiring requirements exclude a whole lot of people (including anyone with mental health issues or a neurological disorder) and basically select for the young and healthy",
                    "score": 14,
                    "author": "chemical_sunset"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is it true that 'Pushing Tin' is a documentary?",
            "score": 101,
            "author": "KernelFrog",
            "replies": [
                {
                    "level": 1,
                    "comment": "Scene for scene exact recreation. Most people don’t know that John Cusack is an air traffic controller who just moonlights as an actor.",
                    "score": 185,
                    "author": "SierraBravo26",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I knew it!",
                            "score": 22,
                            "author": "KernelFrog"
                        },
                        {
                            "level": 2,
                            "comment": "\"That really is the view from NY TRACON, we swear!\"",
                            "score": 8,
                            "author": "voretaq7"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just how difficult are these jobs?\n\nI had a friend that went through the process and ended up having to relocate to Oklahoma and ended up washing out and moving back home because he said he just couldn’t do it.",
            "score": 202,
            "author": "One_Eyed_Sneasel",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oklahoma is where the initial training is located. It's a couple of months there then to your final facility that could be anywhere in the country. The training in Oklahoma just shows that you have the ability to learn the job but not necessarily be successful at a facility. There are a lot more stressors working live traffic in bad weather where you can't pause the scenario.",
                    "score": 39,
                    "author": "IctrlPlanes"
                },
                {
                    "level": 1,
                    "comment": "It really is just one of those jobs where some people can do it and some people can’t. Once you certify, the day to day isn’t really all that difficult. \n\nSorry to hear about your friend.",
                    "score": 271,
                    "author": "SierraBravo26",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My dad was a controller and did a few of the trainings in OK. He said most of the guys that wash out there are due to attitude",
                            "score": 72,
                            "author": "krombopulousnathan"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do a lot of people apply? And if so what is the amount picked out of the total number of people?",
            "score": 97,
            "author": "wallerc15",
            "replies": [
                {
                    "level": 1,
                    "comment": "Last year over 58,000 people applied and a little over 2,700 received tentative offer letters. 1500 is the overall hiring goal for this year, and the hiring goal for next year is 1800. Selection is dependent on Air Traffic Skills Assessment (ATSA) results.  - Alison, FAA HR",
                    "score": 297,
                    "author": "FAANews",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sounds similar to Stanford University’s acceptance rate.  \n\n&gt;\tOut of the competitive applicant pool of 56,378 prospective students, 2,075 applicants were admitted and 1,736 matriculated, with a yield rate of 83.66%.\n\nRef: https://stanforddaily.com/2023/02/28/acceptance-rate-drops-to-3-68-majority-women-and-non-white-students/",
                            "score": 31,
                            "author": "NotJimIrsay"
                        },
                        {
                            "level": 2,
                            "comment": "I love that HR is on here supporting our dude",
                            "score": 26,
                            "author": "Philuppus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Or keeping an eye on him...",
                                    "score": 21,
                                    "author": "Hugs_for_Thugs",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thank you!",
                            "score": 15,
                            "author": "wallerc15"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Last year over 58,000 people applied, and I believe somewhere around 2,700 were hired.\n\nEdited, thanks FAA 🤙",
                    "score": 92,
                    "author": "SierraBravo26",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you stay up to date with the pass rate in OKC?  Is that still under 60%?",
                            "score": 22,
                            "author": "WinnieThePig",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don’t know what the official number is today, but I’ve always heard it’s around that number.",
                                    "score": 25,
                                    "author": "SierraBravo26",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Couple classmates of mine ended were in some sub 40% pass rate classes in the 13/14 timeframe.",
                                            "score": 11,
                                            "author": "WinnieThePig"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "About 10 years ago, I got rather deep into the hiring process. I got as far as the security clearance (which if I passed that, meant ATC school acceptance) before I realized that anyone who had ever sought care for mental health, even if it is not a mental illness, would receive and automatic DQ. I had received therapy for about six months a few years prior. I had heard from other applicants that I could just lie and it's likely that they won't check my insurance records and I'd be fine. But it's also a felony if you get caught and they want to make an example of you. I decided to withdraw my application. \n\nI'm now disqualified from future hiring because I withdrew so late in the hiring process, but with the rise of mental health awareness in the country, along with the fact that many people seek therapy for things that aren't necessarily related to mental illness (mine was just mentally reconciling a break up), is seeking therapy still an automatic DQ within the FAA?",
            "score": 483,
            "author": "09232022",
            "replies": [
                {
                    "level": 1,
                    "comment": "Absolutely not. There are even programs in place for employees to get up to 8 free therapy sessions *per issue* per year.\n\nBeing diagnosed is a whole other thing, but therapy alone is not a disqualifier.",
                    "score": 435,
                    "author": "SierraBravo26",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wish it was like that back then! I was so excited to join the FAA. My father, grandfather, and his father were all air traffic controllers and they were so proud when I passed the entrance exam. I think my father's heart was broken when I told him I withdrew. \n\nBut I never would have met my husband if I had gotten on that plane to Oklahoma, so there's that. Maybe in an alternate timeline I'm an air traffic controller making bank.",
                            "score": 191,
                            "author": "09232022",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That is wild. It’s a shame that it didn’t work out for you for that reason, but you’ve certainly got a great perspective.",
                                    "score": 112,
                                    "author": "SierraBravo26"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Most people who have actual mental health challenges don't see a therapist without getting a diagnosis; 8 sessions per year is fine for someone who has something temporary in their life they need to work through, but not for anyone actually neurodivergent.\n\nI have ADHD; if I'd never gotten a diagnosis or taken medication, I'd be eligible for a Class I medical, and (if I got hired obviously) be responsible for hundreds of lives while hiding/masking my ADHD symptoms.  Now that I *have* been diagnosed, and take medication to control those symptoms and function much more normally, I'm permanently disqualified from even being licensed to fly a Cessna.\n\nOP, I know you're doing a good thing here, and you've been helping people find ATC careers on Reddit for a long time.  But it's the aviation world's worst-kept secret that \"no pilot has ever been to therapy\", and people are very much encouraged to hide those kinds of issues if they have any interest in an aviation career.  There are even entire law firms and medical practices that specialize in fighting FAA medical disqualifications based on old, incorrect, or \"incorrect\" diagnoses.",
                            "score": 24,
                            "author": "h3r4ld"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'll add my little story, dealing with mental health issues and the FAA (I was an airline pilot, with a VA disability rating for mental health \"issues\").\n\nTechnically, there are ways to \"make it work\", but depending on what kind of issues, you could be out more than $20k out of pocket for psychiatric testing that isn't covered by any insurance (since it's not health CARE, technically) and there's no transparency on what the FAA is looking for with these tests.\n\nFor me, they kept telling me, \"We need more 'information'\" and they refused to elaborate. After thousands and thousands of dollars and multiple tests, I was \"approved\" for a brief moment, but the slightest hiccup sent me right back to the FAA for more tests, so I just quit. I'm a computer programmer now.\n\nWhen I talk to other pilots, it seems to be much more difficult if you were ever prescribed any sort of mental health medication (I never was). The FAA needs to seriously overhaul their entire attitude on mental health care.",
                    "score": 13,
                    "author": "Duling"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I saw you mentioned it’s rotating shifts in a previous comment. How long is each shift? Thanks for doing this!",
            "score": 30,
            "author": "DILDO_VAGGINS",
            "replies": [
                {
                    "level": 1,
                    "comment": "8 hours, and absolutely!",
                    "score": 29,
                    "author": "SierraBravo26",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bruh you know we're all doing six 10 hour shifts.",
                            "score": 18,
                            "author": "turn20left",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Is that why you need 20 left?",
                                    "score": 13,
                                    "author": "SierraBravo26"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 25,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "TCAS would have saved them",
                    "score": 53,
                    "author": "SierraBravo26",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just hopping in this thread to let everyone know I was one of the people reading this thread roughly 4 years ago. I currently work at a level 5 up/down (tower and tracon) It's not a lot of money relative to other facilities, but it's more money than I've seen in my life, and it was 100% worth the hoops you jump through\n\nI highly encourage anyone who has even a slight interest to apply, or if you're someone like me who doesnt have a clear goal or career in mind with what they want to do. This is the first time in my life I haven't had to worry about money. And I love my work (although I wish I was in a different part of the country but that's just air traffic for you)\n\nIf anyone has any questions for someone who relatively recently went through this process, you can also DM me \n\nFor sierrabravo, how many people have reached out to you to let you know they made it? Or went through the process because of you?",
            "score": 123,
            "author": "Fun_Experience5951",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s awesome man, thank you so much for sharing! I’ve had hundreds of people keep in touch over the years who are now controllers, and I’ve personally met a few in person. \n\nIf you feel comfortable, feel free to DM me. I’d love to know what facility you’re at and get an idea of where you’re trying to go. I know NCEPT can be brutal these days.",
                    "score": 38,
                    "author": "SierraBravo26",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Are you in an outreach/recruiting type roll or program or is this really just something you put together for the good of mankind?",
                            "score": 16,
                            "author": "imZ-11370",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m a controller. I literally just do this on my own time.",
                                    "score": 49,
                                    "author": "SierraBravo26",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Very cool man, thank you for doing this. I’ve got a good career and past the cutoff age, but learning all of this was fascinating.",
                                            "score": 13,
                                            "author": "imZ-11370",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Absolutely man, thanks for the kind words",
                                                    "score": 12,
                                                    "author": "SierraBravo26"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why was I not told about this in high school in the 90's? In my 20s and 30s I rocked multitasking and could have been damn good at that job. Starting to slow down a bit in my 40s though. Way too late for me to apply. Bummer.",
            "score": 110,
            "author": "Sum_Dum_User",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah that’s unfortunate man",
                    "score": 42,
                    "author": "SierraBravo26",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ever hear any interesting stories about UFOs?",
            "score": 15,
            "author": "jedi-son",
            "replies": [
                {
                    "level": 1,
                    "comment": "Canadian ATC here. \n\nI once had a police helicopter pilot ask me on frequency if “I’d seen anything unusual tonight?”.\n\nI said, “Not really. Should I have seen something?”.\n\nHe said, “uhh well we’ve had around 15 calls about bright lights in the sky, shooting stars, and UFOs. So if you see anything like that let me know”.\n\nIt turned out that one of the SpaceX rockets had broken apart on reentry into the atmosphere and all the pieces burning up looked like spacecraft or something. [THIS](https://www.forbes.com/sites/ericmack/2021/03/26/spent-spacex-rocket-burns-up-over-seattle-stunning-skywatchers/amp/) is an article about it. \n\nIt was a funny exchange. I wish I’d seen it myself!",
                    "score": 43,
                    "author": "saskford"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi! I'm Australian so technically this doesn't imapact me, however if someone had ADHD or something similar would they be barred from acceptance?",
            "score": 54,
            "author": "kittykata27",
            "replies": [
                {
                    "level": 1,
                    "comment": "With an official diagnosis, yes",
                    "score": 91,
                    "author": "SierraBravo26",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was looking for this question and I’m sad to see that’s the answer. Damn this depressed brain of mine. :(",
                            "score": 23,
                            "author": "ZombieTurtle2",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is the AT-SA something you study for or is it more like a baseline for how you might do? Also what is the personality inventory like,just making sure you’re mentally sound for the job?",
            "score": 33,
            "author": "Domination_",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are study materials online that you can pay for. I can’t vouch for any, but I think there’s like a $10 one that I’ve heard is pretty good.\n\nAnd yeah, basically.",
                    "score": 31,
                    "author": "SierraBravo26"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Have you ever set off the snitch?",
            "score": 8,
            "author": "ElChidro",
            "replies": [
                {
                    "level": 1,
                    "comment": "You’re not trying if you don’t",
                    "score": 10,
                    "author": "SierraBravo26",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Okay, what is the snitch?",
                            "score": 6,
                            "author": "Murphysburger",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; and won’t work a day past 56 (mandatory retirement, with a pension). \n\nWell, shit.  I'm 57.  I have a rewarding (if sometimes stressful) job already, but...\n\nAnyway, a question...how do they determine that's the cutoff?  If a person was in good physical and mental shape and had started the career later in life, why check out at 56?  Seems a bit arbitrary.",
            "score": 43,
            "author": "gogojack",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s a good question. Not sure where that number came from.",
                    "score": 15,
                    "author": "SierraBravo26",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "You can apply for an extension. Which has it's own merits but lots people get it approved. This can help with how much your retirement pension is as well. Some people move on to supervisory jobs, or retire and get rehired as contract workers in the facility training new hires in computer labs on fake planes.",
                    "score": 36,
                    "author": "INoahABC",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm an engineering student, not interested in becoming ATC (though perhaps someday a pilot). I love aviation, though, and I was wondering: do you recommend any particular ATC simulators for people like me who just want to have some fun during our downtime? It need not be super intricate, and ideally it should be free or low-cost to play. I've been obsessed with [atc-sim](https://atc-sim.com/), to give you an idea, and am looking for a bit of variety.\n\nAlso, wanted to say that I really appreciate the work you and other ATCs do to keep us travelers safe. Thank you for your service!",
            "score": 43,
            "author": "aliendividedbyzero",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve never heard of that sim, but I just checked out your link and that looks pretty good!",
                    "score": 20,
                    "author": "SierraBravo26",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Check out openscope too",
                    "score": 5,
                    "author": "bdepz",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "What are some things people should enjoy that would correlate with the job? I've heard it's extremely stressful. Is it just being able to multi task and manage different things happening? I'm an engineer/project manager in the construction industry and routinely have 15-20 different projects going at once and have to field questions from different people (employees, trade partners etc.). I don't mind all the different projects but the deadlines to get a bunch of projects pushed out is getting to be insane. I would imagine there's not really deadlines in a job like this, just a bunch of multi-tasking going on at once right?",
            "score": 10,
            "author": "jmov99",
            "replies": [
                {
                    "level": 1,
                    "comment": "Pretty much. The nice part is not having to care about any of that as soon as you unplug. I’d take that over managing projects any day",
                    "score": 7,
                    "author": "SierraBravo26"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My son is in ATC in the Marines can he transfer to FAA after the age of 30? He is also looking at DOD airfields.",
            "score": 10,
            "author": "MechEngineeringGod",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes!",
                    "score": 9,
                    "author": "SierraBravo26"
                },
                {
                    "level": 1,
                    "comment": "For prior military experience, the age limit goes to 35",
                    "score": 9,
                    "author": "TheDrMonocle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "would you say it's a fun job (or with moments of fun)? if not, which moments of the job are the worst?",
            "score": 38,
            "author": "DinoDinossaur",
            "replies": [
                {
                    "level": 1,
                    "comment": "Definitely a fun job. Most days don’t feel like work. \n\nI think the consensus worst part about the job is the sleep schedule. We work rotating shift work at most facilities, and work weekends and holidays.",
                    "score": 114,
                    "author": "SierraBravo26",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As a non traffic controller it's exactly like the movie 2:22 where you can tell a plane to \"punch it\" and cross the path of another landing plane and it's safe.\n\nWhat that movie is 100% realistic",
                            "score": 38,
                            "author": "slaughtamonsta",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don’t forget all the numbers that you see swirling around your head as you do on the spot calculus",
                                    "score": 69,
                                    "author": "SierraBravo26",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Where are you working out of?  My father in law worked out of nashville for his last twenty years, and he was always tense.  First few years in retirement, he was looking up and naming planes and approaches.  Most def seemed like work, especially with the turn-around shifts.  It doesn't feel like you're being honest with how stressful this job can be.",
                            "score": 19,
                            "author": "belunos",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "OP probably isn’t someone who’s easily stressed or feels very personally affected by the job, as that seems like a requirement to get the job in the first place",
                                    "score": 11,
                                    "author": "chemical_sunset"
                                },
                                {
                                    "level": 3,
                                    "comment": "I’ve been in 7 years and have been fortunate enough to be at a couple facilities with good staffing. I’m at a center now so sure, it’s a little different. I can only speak for myself, but I know there are controllers at facilities with much worse staffing who have a different experience. Hopefully that can change soon.",
                                    "score": 8,
                                    "author": "SierraBravo26"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does your employer realize how valuable your services here are? That saves them a huge amount of money…",
            "score": 6,
            "author": "Masek_Kiel",
            "replies": [
                {
                    "level": 1,
                    "comment": "We absolutely do. This thread drove a lot of traffic to our [hiring page](https://www.faa.gov/be-atc) last year and we’re extremely grateful to OP for that. We [posted a video](https://twitter.com/faanews/status/1649080731740536835?s=46&amp;t=A8vf4fWL72ADh73yk8mtQA) recently too of a current trainer who said she was inspired to apply after seeing a previous thread. -D",
                    "score": 11,
                    "author": "FAANews",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sully probably could have avoided those birds, right?",
            "score": 91,
            "author": "bk15dcx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unable.",
                    "score": 266,
                    "author": "SierraBravo26",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Best answer ever",
                            "score": 40,
                            "author": "ohwrite"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for doing these AMAs! I applied in 2021 and am still in the hiring process. Unfortunately I have been sent to Teir 2, so it's taking a lot longer than usual. I've been glad to see how thorough the process is though! How long does the FAA give you to report to Oklahoma after receiving the FOL?",
            "score": 6,
            "author": "TylerBob5",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Apologies if this is a double question, scrolled down pretty far- what are work schedules like? Knowing it’s weekends/holidays etc. do you work 5 days a week?",
            "score": 6,
            "author": "Dylan619xf",
            "replies": [
                {
                    "level": 1,
                    "comment": "My last schedule was:\n\n- WED off\n- THURS off\n- FRI 1430-2230\n- SAT 1300-2100\n- SUN 0700-1500\n- MON 0600-1400, back at 2215-0615 for the mid shift\n- TUES off after 0615",
                    "score": 7,
                    "author": "SierraBravo26"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Interesting! This caught my attention, and honestly it seems to be my last chance if I am to apply. My question is; the first round of testing. Is it done close to where you live or you have to travel somewhere? Second; what would you consider a good skillset to have, to do well in the application process tests? (Mathematics, critical thinking, logical reasoning etc?)",
            "score": 6,
            "author": "Tomero",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Hi Sierrabravo, I've seen your posts about ATCs for the last couple of years, and am intrigued- the job appeals to me in a lot of ways, but one thing I've wondered about is, are you able to have hobbies given the inconsistent schedule? I am a creative person and enjoy hobbies like painting and writing on a regular basis, as well as outdoorsy stuff like rock climbing and hiking. Would love to get your thoughts on that! Thanks for providing so much helpful info about becoming an ATC. Cheers!",
            "score": 7,
            "author": "Upset-Let1708",
            "replies": []
        },
        {
            "level": 0,
            "comment": "What new technology could make human controllers obsolete? Is this not a real risk?",
            "score": 16,
            "author": "sammnyc",
            "replies": [
                {
                    "level": 1,
                    "comment": "Risk on one hand, lifesaver on the other.\n\nThe overarching question is, does this job hurt the humans who perform it?\n\nIn my humblest of opinions, no salary is worth dying over, and ATC has some of the highest burnout/self-harm rates of any profession.  Makes sense to think about ways to force-multiply that staff to reduce burden, and to automate the process (within reason) to reduce turnover sensitivity.",
                    "score": 14,
                    "author": "mrmemo"
                }
            ]
        }
    ]
}