{
    "id": "131xn11",
    "score": 502,
    "title": "I’m Callie, Insider’s senior music reporter and noted pophead. AMA!",
    "author": "thisisinsider",
    "date": 1682695804.0,
    "url": "https://www.reddit.com/r/IAmA/comments/131xn11",
    "media_urls": [
        "https://i.redd.it/bn8m7j05i4wa1.jpg",
        "https://www.reddit.com/r/IAmA/comments/131xn11/im_callie_insiders_senior_music_reporter_and/"
    ],
    "other_urls": [
        "https://www.insider.com/author/callie-ahlgrim)"
    ],
    "postText": "I founded Insider’s music team in 2020. I mostly write about [pop music](https://www.insider.com/author/callie-ahlgrim) and I love to interview rising singer-songwriters, particularly women and queer artists. I covered Coachella on the ground this year (for the second time) and I’m here to talk about festivals, live music, stan culture, and more!\n\nPROOF: https://i.redd.it/bn8m7j05i4wa1.jpg",
    "comments": [
        {
            "level": 0,
            "comment": "For more AMAs on this topic, subscribe to r/IAmA_Music, and check out our other topic-specific AMA subreddits [here](https://reddit.com/r/IAmA/wiki/index#wiki_affiliate_topic-specific_subreddits).",
            "score": 1,
            "author": "IAmAModBot"
        },
        {
            "level": 0,
            "comment": "Do you have any insights about Billboard’s scoring system for Hot100? It seems like they change it frequently and there’s a lot of stantwt discussion about that",
            "score": 36,
            "author": "kthnxybe",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm not sure I'm the right person to speak to that, but from my understanding, Billboard updates its chart methodologies on a regular basis (at least once a year) to keep up with rapidly evolving industry trends + how people consume music in the streaming era.  \nIn the past, this has helped digital-age artists, especially up-and-comers whose fans probably aren't buying a lot of CDs and vinyls. For example, \"Harlem Shake\" went to No. 1 in 2013 because the Hot 100 formula had been recently adjusted to incorporate YouTube data.  \nOf course, methodologies are never perfect and any legacy system for music tracking/gatekeeping is bound to have biases (who could forget when Billboard kicked \"Old Town Road\" out of country charts?). -Callie",
                    "score": 57,
                    "author": "thisisinsider"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What do you think about the recent leaks of chats from your boss Döpfner?",
            "score": 13,
            "author": "OldSituation3590"
        },
        {
            "level": 0,
            "comment": "What are your opinions about Marc Rebillet having a set at Coachella? As far as I know his rise to fame was largely through youtube and insta. What do you think of the impact of social media on pop music? Do you think different social media platforms have different kinds of impact?",
            "score": 9,
            "author": "forward_only",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't think this question is specific to Marc Rebillet. Just look at all the artists on festival lineups this year who owe their breakout hits to TikTok! Social media has definitely changed the industry but I don't think that's a new phenomenon on its face — it's just the newest way people are discovering and consuming music. \n\nThere was a similar panic when iTunes became a thing, and then when iTunes was usurped by things like LimeWire and Pandora, and then when streaming services took over. Before that, it was the sudden switch from vinyl to cassette, then cassette to CDs. \n\nAll this to say, the music industry is always evolving and I don't think there's anything inherently sinister about artists who rise to fame through social media, whether it's YouTube, Instagram, TikTok, or SoundCloud. -Callie",
                    "score": 19,
                    "author": "thisisinsider",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In what ways do you think social media is causing a panic? Just that it's really shaking things up? I didn't mean to imply there's anything sinister about Marc Rebillet. I'm a huge fan of his.\n\nIt seems like the music industry has focused a lot more on promoting artists who have already achieved some level of fame on social media as a sort of proof of concept that they're worthy of investment, rather than periods in the past where relatively unknown yet incredibly talented performers would be elevated to fame by a label taking a risk and having that gamble pay off.",
                            "score": 3,
                            "author": "forward_only",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I more meant that on a macro level, a lot of music industry professionals and execs seem panicked about social media's impact because they don't fully understand it. It's hard to market a new artist in a traditional way when fans today are so savvy and hyper-aware of marketing tactics. \n\nI think social media's most significant effect is democratization. It sounds corny, but fans want authenticity. Growth has to be organic (or at least *seem* organic). The power is in the hands of the people who consume music (as opposed to labels and PR professionals) more so than ever before, and I think the industry's eagerness to promote already-popular artists on social media is a reflection of that trend. Labels want to throw their weight behind someone that audiences already like, so they can skip the hard part. -Callie",
                                    "score": 11,
                                    "author": "thisisinsider"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Smiths or The Cure?",
            "score": 5,
            "author": "scarlettvvitch",
            "replies": [
                {
                    "level": 1,
                    "comment": "Early 20s Me would've said The Smiths all the way but Late 20s Me would say The Cure. -Callie",
                    "score": 20,
                    "author": "thisisinsider",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Excellent! You’re evolving quite well then.\n\n(I like both, don’t get me wrong.)",
                            "score": 2,
                            "author": "Rooster_Ties"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As an artist with no label support, do you have any advice on the best ways I go about getting my music in front of reviewers and others?",
            "score": 17,
            "author": "Systemic_Chaos",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is a great question. I would say do your research on specific writers instead of sending form emails to as many writers as possible. Get to know the reviewer you're pitching to and what their preferences are, which artists they tend to cover, and how they write about music. Then tailor your pitches to match. Music reporters get hundreds of emails from publicists and labels and PR professionals every day, so it's important to personalize. I'm far more likely to give something a listen if the pitch is thoughtful + intentional. -Callie",
                    "score": 41,
                    "author": "thisisinsider"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’s my time, folks. I really appreciate all the thoughtful questions. Thanks for having me and I hope to be back soon!",
            "score": 6,
            "author": "thisisinsider"
        },
        {
            "level": 0,
            "comment": "What's an up and coming talent you'd recommend keeping an eye (ear) on right now?",
            "score": 23,
            "author": "question_4_y0u",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ooh, so many! I went to Lizzy McAlpine's concert in Brooklyn this week and her opener, Olivia Barton, was phenomenal. She performed an as-yet unreleased song that made me cry. I [recently discovered Bratty](https://www.insider.com/coachella-best-female-queer-performers-you-cant-miss-2023-4?utm_source=reddit&amp;utm_medium=social&amp;utm_campaign=insider-iama-sub-comment), a Mexican singer-songwriter who makes really lovely Clairo-adjacent bedroom pop. UMI, Cassie Marin, and Tei Shi are all super underrated. I've also been really into Yaeji's \"With A Hammer\" and Raye's \"My 21st Century Blues.\" -Callie",
                    "score": 53,
                    "author": "thisisinsider",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Further coming up pop recs that no one asked me for:\n\n-Joesef (thinking of you, been a little heavy lately, wonder why)\n\n- Matilda Mann (bloom, nice)\n\n- your neighbors (hallmarks)\n\n- Cain Culto (BLAME THE MOON)\n\n- Orla Gartland (did it to myself)",
                            "score": 5,
                            "author": "CubanCharles",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I want to add to your list with OSTON! Her EP Melancholia from end of last year has some good ones like Whatshisface and Girl In the Mirror",
                                    "score": 1,
                                    "author": "TravisParks"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thanks for the recommendations!",
                            "score": 2,
                            "author": "question_4_y0u"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do you think smartphones detract from the live music experience? And outside of pop music, what genre do you enjoy the most in a live setup? My metal friends think I'm weird for shuffling between stuff like Johnny Booth into electro swing like Parov Stelar, but I dig the hard shift to different things.",
            "score": 11,
            "author": "Fluffy017",
            "replies": [
                {
                    "level": 1,
                    "comment": "I go back and forth about this. On one hand, I think it's beautiful when people want to remember an experience so clearly that they can't help but record it. It's quite cute when you think about it like collecting souvenirs or preserving a memory. Taking photos and videos eases the existential dread of time passing.\n\nOn the other hand, I do think there has to be a line. I try to give myself a personal limit: take videos during two or three songs, then put your phone away and enjoy the rest. There is definitely something to be said for \"being in the moment,\" and it can be really frustrating when you're trying to connect with an emotional song and you can hardly see the singer through a sea of iPhones. I do think some people take it too far.\n\nAs for your second question, it has to be rock — hard, classic, alt, emo, all of the above. There's nothing like hearing an electric guitarist nail a live solo. And I don't think that's weird at all! Contrast is one of the things that makes listening to music fun and interesting. -Callie",
                    "score": 21,
                    "author": "thisisinsider"
                }
            ]
        },
        {
            "level": 0,
            "comment": "how to start writing about music? any advice for beginners?",
            "score": 6,
            "author": "Holy_DIO21",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've found that writing about music — reviewing albums, interviewing artists, trying to explain what makes a song good or bad — is far more aligned with creative writing than traditional \"reporting.\" I have degrees in both literature and journalism and I often feel like I lean more heavily on the former. \n\nYou should definitely find music reporters you admire and read as much of their work as possible, but also, read novels and poems! Take a creative writing class if you can! Keep a journal and record uncensored, messy observations while you listen to new albums. (You can always clean it up later.) Expand your appreciation for language and it becomes much easier to find interesting, unique ways to write about something as universally beloved as music. -Callie",
                    "score": 19,
                    "author": "thisisinsider"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There seem to be a lot more festivals now than before. What makes for a good festival over a bad one?",
            "score": 7,
            "author": "HobbitFoot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Super interesting question! On the most basic level, a good festival is one that's prepared. It has to have enough food options, water refill stations, and bathrooms to keep the crowds controlled and keep everything running smoothly. (This sounds like a given, but you'd be surprised. It is not.) \n\nOn a slightly more nuanced level, I think a great festival understands the audience it's trying to serve. Coachella is great in the sense that it's huge and there's something for everyone — every stage has a unique lineup and appeal. Smaller festivals like All Things Go serve a more niche audience and can tailor their lineups accordingly. \n\nOn a personal level, I prefer a music festival that has public transportation options, like Gov Ball, Boston Calling, and Lollapalooza. I want to be able to get on the subway at the end of the night and go home without a fuss. -Callie",
                    "score": 15,
                    "author": "thisisinsider",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Your last paragraph was reminiscent of the Parking Issues from [\"The Day I Turned Uncool\" by Dan Zevin](https://www.amazon.com/Day-Turned-Uncool-Confessions-Reluctant/dp/0812967224)",
                            "score": 3,
                            "author": "IAmA_Nerd_AMA",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yea",
                                    "score": 1,
                                    "author": "Zevindan"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How do you see the longevity of your career when so much pop music today is indistinguishable from AI generated music?  It is only a matter of time before AI artists become the norm and AI journalists are the only ones writing about them.",
            "score": 3,
            "author": "sirthunksalot"
        },
        {
            "level": 0,
            "comment": "I'm in an alt rock band (prolly a bit outside of your pop sphere) and we have some new songs coming out. \n\nWe want people like you to listen to/think about/maybe write about our music. Do you have any advice on this? I've slid in DMs, I've messaged people on email, I've made tweets trying to bring attention to us. What else should I try?\n\nYes we play to our audience, gig consistently but not too often, advertise occasionally when big releases drop, and try to market ourselves in a variety of ways. I'm specifically curious on how music makers get people like YOU to care about their band BEFORE they have that even Coachella slot or that big 50mil plays single",
            "score": 5,
            "author": "mellamosatan",
            "replies": [
                {
                    "level": 1,
                    "comment": "This will be a frustrating answer, but it sounds like you're doing everything right and you just need a stroke of luck. There are so many talented musicians who are vying for attention. It's about timing and serendipity as much as anything else, probably even more so. \n\nThat being said, my email is on my author page. I'd be happy to take a listen! -Callie",
                    "score": 16,
                    "author": "thisisinsider"
                },
                {
                    "level": 1,
                    "comment": "Sorry they're too busy writing about beyonce to care about up and coming artists",
                    "score": -11,
                    "author": "fookcelery"
                }
            ]
        },
        {
            "level": 0,
            "comment": "In other parts of America, do people call you a sodahead or Cokehead?",
            "score": 4,
            "author": "traderjehoshaphat"
        },
        {
            "level": 0,
            "comment": "Your personal thoughts on new age genre?",
            "score": 2,
            "author": "Ok-Feedback5604"
        },
        {
            "level": 0,
            "comment": "Personally what era you consider as new age genre's origin? 90s ir 2000s?",
            "score": 2,
            "author": "Ok-Feedback5604"
        },
        {
            "level": 0,
            "comment": "So cool how young you are and how successful you've become by doing what you love. Congratulations for that in and of itself.\n\nI am curious though, what made you think it could turn into what it is now? Or did that ever come to mind at all?",
            "score": 5,
            "author": "YsiYsi",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much! If I understand your question correctly, I had no idea that I could turn the music team into anything at all. I started as a general entertainment reporter, but I've always wanted to write about music for a living. I saw a gap in Insider's coverage, pitched myself to fill it, and then worked really hard to prove it wasn't a mistake. I still have a long way to go in terms of making a name for myself as a writer, landing big names for interviews, networking within the industry, etc. But I just try to build a little every day and trust the process. I already feel so much more established and confident in my abilities than I did just two years ago, and that encourages me to keep going when I doubt myself. -Callie",
                    "score": 12,
                    "author": "thisisinsider",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Amazing. You answered exactly what I asked!\n\nYou've got a fan in me now. Wish you luck!",
                            "score": 7,
                            "author": "YsiYsi"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What’s the draw to pop music for you? As a metalhead I don’t fully understand the appeal.",
            "score": 4,
            "author": "Red_Revenge59",
            "replies": [
                {
                    "level": 1,
                    "comment": "I guess you could ask this about anything that's not your personal taste. It's hard to explain why you like the things you like. Try to explain why you love the person you love. You just do! Something about that person intrigues you, excites you, appeals to your sensibilities in a unique way. I think it's the same with music.\n\nFor pop specifically, there is a pervasive sense that it's somehow \"low brow\" or less refined than other genres. But I would argue that writing a song that has some kind of impact on such a huge number of people — makes them want to dance, to drive with the windows down, to text a link to a friend — is an incredible and rare skill. Blending the personal with the universal is no small feat. Pop music does that better than anything else. \n\nOf course, that's not to say all pop music is perfect and meaningful. There are great pop songs and bad pop songs, just like any other genre. But the label \"pop\" casts a wide net by definition, so I think the range in quality is a big larger. -Callie",
                    "score": 16,
                    "author": "thisisinsider",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\\*a bit larger :)",
                            "score": 7,
                            "author": "thisisinsider"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So how many people in \"stan culture\" do you expect are severely mentally ill? In addition, what do you see as the increase in parasocial relationships on pop fandom?",
            "score": 2,
            "author": "hythloth"
        },
        {
            "level": 0,
            "comment": "Who is currently your favorite artist who you’ve seen live? I always appreciate when artists make their live shows super cool",
            "score": 3,
            "author": "mordeh",
            "replies": [
                {
                    "level": 1,
                    "comment": "I get this question a lot and I have a really, really hard time answering it! How much I enjoy a concert is super dependent on the vibe of the crowd, the set list, what I've been listening to recently, etc. Of course, everyone loves going to a concert where they love the songs and know all the lyrics, so I'm biased towards those experiences.\n\nBut in terms of performance, concept, and overall stage presence, there are definitely artists who consistently impress. Beyoncé, obviously, but of the shows I've seen post-pandemic: Halsey, Lorde, Maggie Rogers, and Tyler the Creator come to mind. Pre-pandemic, my favorite live shows I'd ever seen were probably FKA twigs and Vince Staples. -Callie",
                    "score": 10,
                    "author": "thisisinsider",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Love to see Vince Staples getting some recognition here!",
                            "score": 1,
                            "author": "randomlybalanced"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "why come king gizzard no have 2 drummers anymore?",
            "score": 2,
            "author": "tvreference",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cav's got two nostrils just lying about don't he",
                    "score": 4,
                    "author": "traderjehoshaphat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How does it feel to be replaced by AI?",
            "score": 2,
            "author": "Sonofpan"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -11,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "What's the difference between asking an insulting question and just being an outright asshole?",
                    "score": 13,
                    "author": "FedishSwish",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -17,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ironically enough, your lack of understanding of the Pop genre - it’s not just what is currently on the radio - really highlights the lack of sophistication in your own music tastes.",
                                    "score": 12,
                                    "author": "jsamurai2"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm high rn. U high rn?",
            "score": 1,
            "author": "guitarjg"
        },
        {
            "level": 0,
            "comment": "Could I suggest couple female artists to check out? Thank you",
            "score": 1,
            "author": "petecho"
        },
        {
            "level": 0,
            "comment": "What is your opinion on the music of Dimash Qudaibergen? Do you think his music could become popular in the western music scene?",
            "score": 1,
            "author": "DeepThought45"
        },
        {
            "level": 0,
            "comment": "Can you shout out some of your favourite A&amp;Rs please?",
            "score": 1,
            "author": "NBAFAN2000"
        },
        {
            "level": 0,
            "comment": "I tend to think that genre names aren't very good at describing music, but maybe I'm just not familiar with the names. There can be so many sub genres that to me it seems ridiculous. I feel like the bands that I like the most don't really fit into any one genre, but still always sound like themselves, like Smashing Pumpkins and Led Zeppelin. I currently don't think genre matters too much, as long as the group or artist don't sound like they are trying to copy what's popular. I tend not to listen to genres where everything sounds too similar, I usually keep it at one or two artists or songs from a genre when it comes to country, hip hop, punk, pop.  My question is: am I wrong or am I on to something? Do I just need to be schooled more, or does it even matter? Am I being ridiculous? Maybe I shouldn't think about it so much. I just want to understand why I like so little of what's out there.",
            "score": 1,
            "author": "BlackEyedSceva"
        },
        {
            "level": 0,
            "comment": "What are your thoughts on rotating stages and how do you feel it’s impacted festival experiences?",
            "score": 1,
            "author": "DontNameThePuppy"
        },
        {
            "level": 0,
            "comment": "Why did business insider rename to insider and pretend to be a completely different company?",
            "score": 1,
            "author": "mttl"
        },
        {
            "level": 0,
            "comment": "Do you have kids?",
            "score": 1,
            "author": "Recon_by_Fire"
        },
        {
            "level": 0,
            "comment": "Any tips for a startup working on an online publication about live music?",
            "score": 1,
            "author": "julesexplainsitall"
        },
        {
            "level": 0,
            "comment": "Why does Insider break up their videos every two minutes with two ads?  Don't you think that's overkill?",
            "score": 1,
            "author": "JFSOCC"
        },
        {
            "level": 0,
            "comment": "Any opinion on the new M83 — especially “Oceans Niagara”?",
            "score": 1,
            "author": "butterscotches"
        },
        {
            "level": 0,
            "comment": "do you have a sister called *Marie*? do you have a band called *Squid Sisters*?",
            "score": 1,
            "author": "FixedFun2"
        },
        {
            "level": 0,
            "comment": "Do you feel Pop Music has recovered from the Telecommunications Act of 1996 (which was deregulation of radio station ownership, among other things) and Clear Channel gobbling up over a thousand radio stations (sometimes multiple stations in the same market) and forcing the entire nation to listen to what a bunch of guys from Texas thought was good? Any thoughts would be welcome!",
            "score": 1,
            "author": "Professor_Retro"
        },
        {
            "level": 0,
            "comment": "Ugggggh my dumb ass saw “senior music” and thought you meant old people making music…\n\nSo I guess there’s a question in there….\n\nIn a music world focused on young new musicians, who are some older musicians that are new to the scene that you recommend? Who would be out of place in the crowds at the festivals you cover, but deserve their chance to be on stage?",
            "score": 1,
            "author": "thisishowwedooooit"
        },
        {
            "level": 0,
            "comment": "I noticed in the photo that, like how those with longer fingers have an advantage playing the piano, your cheek bones are perfectly suited for the classic party game of placing an oreo on the forehead and getting it into one’s mouth without the use of hands. My question is a two parter:\n\nHave you ever played this game?\n\nIf so, have you ever lost? Because it seems like taking you down in said cookie-based game would be a tall order. Your opponent would have to be an EXTREMELY talented, awesomely charismatic, individual to even hope to achieve a such a feat. \n\nEagerly awaiting your response.",
            "score": 1,
            "author": "TippityTopka"
        }
    ]
}