{
    "id": "2wwdep",
    "score": 79180,
    "title": "We are Edward Snowden, Laura Poitras and Glenn Greenwald from the Oscar-winning documentary CITIZENFOUR. AUAA.",
    "author": "_EdwardSnowden",
    "date": 1424718210.0,
    "url": "https://www.reddit.com/r/IAmA/comments/2wwdep",
    "media_urls": [
        "https://www.reddit.com/r/IAmA/comments/2wwdep/we_are_edward_snowden_laura_poitras_and_glenn/"
    ],
    "other_urls": [
        "http://www.hbo.com/documentaries/citizenfour).",
        "https://firstlook.org/theintercept/)",
        "https://freedom.press/)",
        "http://imgur.com/UF9AO8F",
        "https://twitter.com/ggreenwald/status/569936015609110528"
    ],
    "postText": "Hello reddit!\n\nLaura Poitras and Glenn Greenwald here together in Los Angeles, joined by Edward Snowden from Moscow.\n\nA little bit of context: Laura is a filmmaker and journalist and the\ndirector of CITIZENFOUR, which last night won the Academy Award for Best Documentary Feature.\n\nThe film debuts on HBO tonight at 9PM ET| PT\n(http://www.hbo.com/documentaries/citizenfour).\n\nGlenn is a journalist who co-founded The Intercept (https://firstlook.org/theintercept/) with Laura and fellow journalist\nJeremy Scahill.\n\nLaura, Glenn, and Ed are also all on the board of directors at Freedom of the Press Foundation. (https://freedom.press/)\n\nWe will do our best to answer as many of your questions as possible, but appreciate your understanding as we may not get to everyone.\n\nProof: http://imgur.com/UF9AO8F\n\n**UPDATE**: I will be also answering from /u/SuddenlySnowden.\n\nhttps://twitter.com/ggreenwald/status/569936015609110528\n\n**UPDATE**: I'm out of time, everybody. Thank you so much for the interest, the support, and most of all, the great questions. I really enjoyed the opportunity to engage with reddit again -- it really has been too long.",
    "comments": [
        {
            "level": 0,
            "comment": "Can you explain what your life in Moscow is like?",
            "score": 1945,
            "author": "ComeForthLazarus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Moscow is the biggest city in Europe. A lot of people forget that. Shy of Tokyo, it's the biggest city I've ever lived in. I'd rather be home, but it's a lot like any other major city.",
                    "score": 3251,
                    "author": "SuddenlySnowden",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is winter harsh? Do you ever want to go out, but wake up and find yourself suddenly snowed in?",
                            "score": 4943,
                            "author": "C-4",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Canada, Sweden and North Dakota have pretty harsh winters, too. As does Boston.",
                                    "score": 2962,
                                    "author": "glenngreenwald",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This kills the joke.",
                                            "score": 6898,
                                            "author": "SuddenlySnowden",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Damn, Edward Snowden is cooler than I thought.\n\nEDIT: [Did anyone notice what he titled his proof pic on imgur?](http://i.imgur.com/ycwFTdU.png)",
                                                    "score": 3512,
                                                    "author": "adityapstar",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Andddd now we know he visits /r/gonewild ",
                                                            "score": 465,
                                                            "author": "downvotedbypedants",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "What if he's submitted to /r/gonewild?",
                                                                    "score": 337,
                                                                    "author": "adityapstar",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "\\*NSA scrambles*",
                                                                            "score": 754,
                                                                            "author": "dontsniffglue",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "now they have information on Snowden's willy in their files too.",
                                                                                    "score": 35,
                                                                                    "author": "Dark-tyranitar"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Crazy to think that the CIA is going to be pouring over this entire thread and trying to decode all of the stupid jokes contained herein.",
                                                            "score": 280,
                                                            "author": "Canuhandleit",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Hi NSA! Do you like dank memes?",
                                                                    "score": 284,
                                                                    "author": "BaconMaster2",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I guarantee a decent proportion of the NSA are /b/tards. ",
                                                                            "score": 63,
                                                                            "author": "Noodle36",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "We like Dank Memes more than you like bacon\n\n-NSA",
                                                                            "score": 22,
                                                                            "author": "Someotherrandomtree"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "The guy took on the biggest intelligence agencies in the world. I think it's safe to say he's pretty cool already.",
                                                            "score": 982,
                                                            "author": "whiteynumber2",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "It must be the weather. ",
                                                            "score": 320,
                                                            "author": "forza101",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 273,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Edward Snowdank.",
                                                            "score": 192,
                                                            "author": "taneq",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "In Soviet Russia, joke kills you.",
                                                    "score": 468,
                                                    "author": "FakeSnowden",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "/r/suchislifeinmoscow",
                    "score": 394,
                    "author": "ZugNachPankow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Last comrade in Motherland sat alone in room. There was knock on door. Was KGB. KGB is forever.",
                            "score": 559,
                            "author": "AlderaanRefugee",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "For Edward Snowden:\n\nRussian journalist Andrei Soldatov has [described your daily life](http://www.nytimes.com/2013/11/01/world/europe/snowden-russia.html?pagewanted=all) as circumscribed by Russian state security services, which he said control the circumstances of your life there. Is this accurate? What are your interactions with Russian state security like? With Russian government representatives generally?",
            "score": 1882,
            "author": "max_fisher",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good question, thanks for asking.\n\nThe answer is \"of course not.\" You'll notice in all of these articles, the assertions ultimately come down to speculation and suspicion. None of them claim to have any actual proof, they're just so damned sure I'm a russian spy that it must be true.\n\nAnd I get that. I really do. I mean come on - I used to teach \"cyber counterintelligence\" (their term) at DIA.\n\nBut when you look at in aggregate, what sense does that make? If I were a russian spy, why go to Hong Kong? It's would have been an unacceptable risk. And further - why give any information to journalists at all, for that matter, much less so much and of such importance? Any intelligence value it would have to the russians would be immediately compromised.\n\nIf I were a spy for the russians, why the hell was I trapped in any airport for a month? I would have gotten a parade and a medal instead.\n\nThe reality is I spent so long in that damn airport because I wouldn't play ball and nobody knew what to do with me. I refused to cooperate with Russian intelligence in any way (see my testimony to EU Parliament on this one if you're interested), and that hasn't changed.\n\nAt this point, I think the reason I get away with it is because of my public profile. What can they really do to me? If I show up with broken fingers, everybody will know what happened. ",
                    "score": 3295,
                    "author": "SuddenlySnowden",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't you fear that at some point you will be used as leverage in a negotiation? eg; \"if you drop the sanctions we give you Snowden\"",
                            "score": 1392,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It is very realistic that in the realpolitik of great powers, this kind of thing could happen. I don't like to think that it would happen, but it certainly could. \n\nAt the same time, I'm so incredibly blessed to have had an opportunity to give so much back to the people and internet that I love. I acted in accordance with my conscience and in so doing have enjoyed far more luck than any one person can ask for. If that luck should run out sooner rather than later, on balance I will still - and always - be satisfied.\n\n",
                                    "score": 3665,
                                    "author": "SuddenlySnowden",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If it does happen, and you're forced into the U.S. government's hands, know that I (and millions of other Americans) are behind you.",
                                            "score": 1953,
                                            "author": "just_too_kind",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Ed, I can't even explain to you how much of a hero you have become to me. I've never said that to anyone.\n",
                                            "score": 783,
                                            "author": "donotlosehope",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;At this point, I think the reason I get away with it is because of my public profile. What can they really do to me? If I show up with broken fingers, everybody will know what happened.\n\nWould you go as far as to say that you coming forward and making yourself completely public was the best thing for you? It certainly seems like a security net, as you sort of put it yourself.",
                            "score": 193,
                            "author": "walkingtheriver",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Laura, are you still detained for extra screening when you fly in the US?\n",
            "score": 1388,
            "author": "magic_rub",
            "replies": [
                {
                    "level": 1,
                    "comment": "The detentions have thankfully stopped, at least for now. Starting in 2006, after I came back from making a film about Iraq's first election, I was stopped and detained at the US border over 40 times, often times for hours. After I went public with my experiences (Glenn [broke the story](http://www.salon.com/2012/04/08/u_s_filmmaker_repeatedly_detained_at_border/) in 2012), the harassment stopped. Unfortunately there are countless others who aren't so lucky. ",
                    "score": 2345,
                    "author": "LauraPoitras",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Isn't this, in of itself, a perfect example of how mass transparency of information can fight against the very ills of secretiveness? By effectively displaying to the world what's been happening to you - the \"powers that be\" are intimidated to stop?",
                            "score": 916,
                            "author": "ohnodanny",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What do you feel can be done to help other activists who have been imprisoned (such as Barrett Brown, Chelsea Manning, and to a lesser extent Jeremy Hammond), and how do you feel about the government using laws like the CFAA to silence these types of activists while simultaneously trying to extend its reach by citing recent hackings against US corporations (e.g. Sony)?",
            "score": 437,
            "author": "swartzcr",
            "replies": [
                {
                    "level": 1,
                    "comment": "great questions. \n\nEveryone who may not know, this is [Aaron Swartz' brother](http://www.reddit.com/r/IAmA/comments/295wuz/we_are_brian_knappenberger_director_of_the/). ",
                    "score": 174,
                    "author": "imurgooglebitch"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I saw that you used GPG to encrypt the document archives and the movie stated that Laura and Glenn are using Tails to analyse documents. How do you collaborate? E.g. share a document, tag it together, share notes etc? Using tools like the overview project (AP, Knight Foundation) seems impossible when wanting to protect documents properly.\n\nP.S. Congrats and thank you for your amazing work.",
            "score": 800,
            "author": "tpreusse",
            "replies": [
                {
                    "level": 1,
                    "comment": "It would have been impossible for us to work on the NSA stories and make Citizenfour without many encryption tools that allowed us to communicate more securely. In fact, in the credits we thank [several free software projects](http://www.wired.com/2014/10/laura-poitras-crypto-tools-made-snowden-film-possible/) for making it all possible. I can't really get into our specific security process, but on the The Intercept's security experts, Micah Lee, wrote a great post about helping Glenn and I when we first got in contact with Snowden: https://firstlook.org/theintercept/2014/10/28/smuggling-snowden-secrets/\n\nIt's definitely important that we support these tools so the creators can make them easier to use. They are incredibly underfunded for how important they are. You can donate to Tails, Tor and a few other projects here: https://freedom.press/bundle/encryption-tools-journalists",
                    "score": 1421,
                    "author": "LauraPoitras",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Did you hear the story about the GPG author recently?\n\nhttp://www.zdnet.com/article/gnupg-author-set-to-bolster-operation-after-donation-drive/\n",
                            "score": 208,
                            "author": "feckin_birds",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I know for sure that Glenn Greenwald and Micah Lee know about that story, as I saw a discussion about it on Twitter. There was talk of adding GPG to the next encryption tools for journalists donation bundle here https://freedom.press/bundle/encryption-tools-journalists",
                                    "score": 53,
                                    "author": "ourari",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "To Greenwald &amp; Poitras: What was the most alarming revelation(s) you discovered throughout this process, and is there more to come?\n\nTo Snowden: What validation do we have that Putin is being honest about NOT spying in Russia?",
            "score": 1370,
            "author": "LegalNerd1940",
            "replies": [
                {
                    "level": 1,
                    "comment": "For me personally, the most shocking revelation was the overall one that the explicit goal of the NSA and its allies is captured by the slogan \"collect it all\" - meaning they want to convert the internet into a place of limitless, mass surveillance, which is another way of saying they literally want to eliminate privacy in the digital age:\n\nhttp://www.theguardian.com/commentisfree/2013/jul/15/crux-nsa-collect-it-all\n\nThere is definitely more significant reporting to come. Our colleagues at the Intercept - Jeremy Scahill and Josh Begley - just last week reported one of the most significant stories yet on the NSA and GCHQ's 's hacking practices:\n\nhttps://firstlook.org/theintercept/2015/02/19/great-sim-heist/",
                    "score": 2241,
                    "author": "glenngreenwald",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To tag on to the Putin question: There's not, and that's part of the problem world-wide. We can't just reform the laws in one country, wipe our hands, and call it a day. We have to ensure that our rights aren't just being protected by letters on a sheet of paper somewhere, or those protections will evaporate the minute our communications get routed across a border. The only way to ensure the human rights of citizens around the world are being respected in the digital realm is to enforce them through systems and standards rather than policies and procedures.",
                            "score": 2248,
                            "author": "SuddenlySnowden",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dear all,\n\nhow can we make sure that people still want to leak important information when everyone who does so puts the rest of their lives at stake?",
            "score": 1917,
            "author": "lolkep",
            "replies": [
                {
                    "level": 1,
                    "comment": "Whistleblower protection laws, a strong defense of the right for someone charged with political crimes to make any defense they want (currently in the US, someone charged with revealing classified information is entirely prohibited from arguing before the jury that the programs were unlawful, immoral, or otherwise wrongful), and support for the development of technically and legally protected means of communications between sources and journalists.\n\nThe sad truth is that societies that demand whistleblowers be martyrs often find themselves without either, and always when it matters the most.",
                    "score": 2756,
                    "author": "SuddenlySnowden",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "After Watergate and the Pentagon Papers, why aren't whistleblower protection laws yet implemented? Or is the whistleblower protection act something else?",
                            "score": 288,
                            "author": "slimmey",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There is and it is called the [Whistleblower Protection Act of 1989](http://en.wikipedia.org/wiki/Whistleblower_Protection_Act) updated in 2012. Unfortunately, it does not apply to the intelligence community. More unfortunately, the protections conferred by the act are determined in a case by case basis by the [United States Merit Systems Protection Board](http://en.wikipedia.org/wiki/United_States_Merit_Systems_Protection_Board) which pretty much always sides with the Government and not with the whistleblower. \n\nThe sad part is that because laws exist with names which sound like they should be doing what we expect, it is hard to get people excited about amending these laws to do what they should. ",
                                    "score": 545,
                                    "author": "bamfurlong",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; currently in the US, someone charged with revealing classified information is entirely prohibited from arguing before the jury that the programs were unlawful, immoral, or otherwise wrongful\n\nI've heard so many people say \"if Snowden didn't do anything wrong then why doesn't he come home?\" That's good to know.",
                            "score": 145,
                            "author": "Self_Manifesto",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Laura Poitras,Glenn Greenwald, Edward Snowden, and now **Peter Sunde** all in one thread. Wow.",
                    "score": 363,
                    "author": "omega_point",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2354,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did a TED talk specifically to refute that inane argument, here:\n\nhttp://www.ted.com/talks/glenn_greenwald_why_privacy_matters?language=en",
                    "score": 3920,
                    "author": "glenngreenwald",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I saw this talk not so long ago, I always struggled to explain why we should bother about all this, and you gave me perfect tools to do so. Thank you.",
                            "score": 880,
                            "author": "bobywomack",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "To Glenn, whatever happened to the \"list of U.S. citizens that the N.S.A spied on?\" You announced plans to release it, then nothing - can you tell us where that list went and why it was never published?\n\nSource: http://www.washingtontimes.com/news/2014/may/26/glenn-greenwald-publish-list-us-citizens-nsa-spied/\n\nEDIT: Spelling\n\nDouble Edit: Gold?! Thank you, kind stranger!",
            "score": 3152,
            "author": "N3cessaryEvil",
            "replies": [
                {
                    "level": 1,
                    "comment": "They're trying to release it, but 7 billion names takes a while to upload. ",
                    "score": 3150,
                    "author": "samlev",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"NSA, who have you spied on?\"\n\n\n\"Yes\"",
                            "score": 3570,
                            "author": "LordTyrannid",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "    function hasNSAWiretap(citizen) {\n      return true;\n    }",
                                    "score": 2311,
                                    "author": "StuartPBentley",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Alternatively, if the NSA had written the function\n\n    function hasNSAWiretap(citizen) {\n      logIPaddress(citizen);\n      infiltrateMachine(citizen);\n      monitorBrowsingHistory(citizen);\n      fuck(citizen);\n      return false;\n    }",
                                            "score": 1334,
                                            "author": "DrAminove",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Always important to implement a `fuck()` function in the global context",
                                                    "score": 644,
                                                    "author": "StuartPBentley",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Just make sure it's *private* or *protected*. No one likes getting fucked in *public*.",
                                                            "score": 1451,
                                                            "author": "DrAminove",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 253,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3381,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would have come forward sooner. I talked to [Daniel Ellsberg](https://en.wikipedia.org/wiki/Daniel_Ellsberg) about this at length, who has explained why [more eloquently](http://www.popularresistance.org/wp-content/uploads/2014/07/Ellsberg-billboards-e1404923198872.jpg) than I can.\n\nHad I come forward a little sooner, these programs would have been a little less entrenched, and those abusing them would have felt a little less familiar with and accustomed to the exercise of those powers. This is something we see in almost every sector of government, not just in the national security space, but it's very important:\n\nOnce you grant the government some new power or authority, it becomes exponentially more difficult to roll it back. Regardless of how little value a program or power has been shown to have (such as the Section 215 dragnet interception of call records in the United States, which the government's own investigation found never stopped a single imminent terrorist attack despite a decade of operation), once it's a sunk cost, once dollars and reputations have been invested in it, it's hard to peel that back.\n\nDon't let it happen in your country.\n\n\n",
                    "score": 4842,
                    "author": "SuddenlySnowden",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; Don't let it happen in your country.\n\n\nGod dammit - Canadian ",
                            "score": 3594,
                            "author": "Chris266",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup, thinking about Bill C-51 as I read that.",
                                    "score": 1334,
                                    "author": "StrayDogStrutt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's like Stephen Harper is living ten years in the past, watching the Bush era and saying \"Wow! That's brilliant! EVERYONE will LOVE that if we do it in Canada!\"",
                                            "score": 1279,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's not just Harper.  Trudeau is supporting the bill and says he'll change it a bit to add oversight once he's elected, but oversight has proven useless at stopping these violations everywhere else and it's doubtful that he would do it anyways.\n\nThe Liberal Party has always been just as bad and probably worse on privacy issues.  ",
                                                    "score": 870,
                                                    "author": "NortenK",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "A friendly reminder that the NDP is taking a hard stance (so far) against the bill. Honestly I was pretty surprised that the Liberals aren't, and if I had been considering voting for them this time around anyway this would have instantly changed that.",
                                                            "score": 468,
                                                            "author": "caninehere",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Remember C-51 and who supported it next election. Goddamn sell-out Trudeau. ",
                                            "score": 418,
                                            "author": "LatinArma",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Here's a few other things to keep in mind about Trudeau:\n\n- Trudeau wants to give $500M in taxpayer money to \"job creators\" (read: the wealthy class who own businesses) [but economists think his plan won't create many \\(if any\\) jobs.](http://www.680news.com/2014/09/26/baloney-meter-how-credible-are-the-plans-of-parties-to-tweak-ei-premiums/)\n\n- [He's pledged to protect all previous tax cuts for businesses and the rich.](http://www.cbc.ca/news/politics/justin-trudeau-defends-andrew-leslie-vows-not-to-raise-taxes-1.2547076)  This is money that used to be spent on our country and its people, now it just helps the rich make even more money.  It's these tax cuts that have contributed to growing inequality.  Why is Trudeau promising outright to keep these tax cuts but making only vague references to inequality?\n\n- [He's opposed to legalized and regulated prostitution.](http://www.cbc.ca/news/politics/justin-trudeau-wary-of-proposal-to-regulate-tax-prostitution-1.2500357)  He's called it \"a form of violence against women\" and was quite enthusiastic about the Nordic model, which penalizes buying and legalizes selling, just like Harper supports.  The Liberals \n\n- [Liberals, including Trudeau, all support FIPA and the TPP](http://www.canadianprogressiveworld.com/2013/04/23/betrayal-trudeau-and-the-liberals-voted-for-harpers-sellout-fipa/)\n\n- [Liberals prepared to back to Tory anti-terror bill](https://www.google.ca/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=3&amp;cad=rja&amp;uact=8&amp;ved=0CCYQFjAC&amp;url=http%3A%2F%2Fwww.theglobeandmail.com%2Fnews%2Fpolitics%2Fliberals-prepared-to-back-tories-anti-terrorism-bill%2Farticle22666230%2F&amp;ei=1xnNVMGWHoX4yQSF_ICABQ&amp;usg=AFQjCNEP2QtiDP8jd1AoTIGL1wwBkOG21A&amp;sig2=zg4R23x0MHnDxoZJhC7YgQ&amp;bvm=bv.85076809,d.aWw) Oh, but he'll add oversight... to the existing oversight that has done nothing to protect our privacy, just like the 10+ layers of oversight the NSA have that have worked so well for them.\n\n- [Justin Trudeau backs away from federal carbon pricing program.  Now says carbon pricing should be left to provinces.](https://www.google.ca/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=6&amp;cad=rja&amp;uact=8&amp;ved=0CC4QFjAF&amp;url=http%3A%2F%2Fwww.cbc.ca%2Fnews%2Fpolitics%2Fjustin-trudeau-says-carbon-pricing-should-be-left-to-provinces-1.2927889&amp;ei=mRrNVOD3BoSuyQS324CwCA&amp;usg=AFQjCNHKGd7brl1B6xcXPmngDl87tsVAmA&amp;sig2=zxlYekYkUB03ga91Rn4iuQ&amp;bvm=bv.85076809,d.aWw)  This is pretty much the system we already have.  Let provinces decide for themselves?  How about some minimum federal standards?  You know, some actual leadership?\n\n- [Trudeau lobbies on behalf of businesses in his riding to exempt them from having to properly qualify for TFWs when everyone already knows the standards are too lax as it is](http://www.theglobeandmail.com/news/politics/tories-release-letter-by-trudeau-asking-for-temporary-foreign-workers-for-his-riding/article11339272/)\n\n- [Trudeau supported the sale of Nexen to China and even wrote an article explaining why it's great for the wealthy business class if we sell our resource companies to foreign governments](https://www.google.ca/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=1&amp;cad=rja&amp;uact=8&amp;ved=0CDUQFjAA&amp;url=http%3A%2F%2Fo.canada.com%2Fnews%2Fnational%2Fjustin-trudeau-why-the-cnooc-nexen-deal-is-good-for-canada&amp;ei=CRzNVLXIG8mqyASF-4HQAw&amp;usg=AFQjCNHjW0-_lG5ep22Ha7yjamrQxSBcrQ&amp;sig2=dZjDyxyhCa5QMUnRgP-Cpw&amp;bvm=bv.85076809,d.aWw)\n\n- [Trudeau opposes proportional representation.](http://www.cbc.ca/m/touch/news/story/1.1862550)\n\nBelieve it or not, Harper hasn't radically changed much.  His policies are continuations of Chretien/Martin policies which themselves are continuations of Mulroney policies and Trudeau is supporting all the same ones.  Trudeau will keep us moving in the same direction as every other PM of the last 30 years.\n\nIsn't it time for an actual change, not the same old change we're promised by both the CPC and Liberals that never seems to come?",
                                                    "score": 655,
                                                    "author": "Legal420Now",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "So what you're saying is we need to vote for Zombie Layton?\n",
                                                            "score": 412,
                                                            "author": "SwineHerald",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Dammittt - Australian",
                                    "score": 217,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "FTFY: God Damn it- Five Eyes Nations",
                                    "score": 70,
                                    "author": "ThatoneWaygook",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Considering all that's happened, that's the most admirable answer possible. A follow-up, if you don't mind: if Americans could start changing the political acceptance of intrusive spying by government agencies, what would it be? I personally am not sure if any candidate up for election next year would truly care about the issue beyond campaign promises, so I'm a bit afraid of not being able to use one's vote to enact change. \n\nI greatly appreciate this, Mr. Snowden. I work in the federal government in Washington DC, though I am in the DoD, and I know many of us personally are concerned. ",
                            "score": 321,
                            "author": "A_WILD_SLUT_APPEARS",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1063,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the kind words. I definitely consider myself a\njournalist, as well as an artist and a filmmaker. In my mind, it's not a\nquestion about whether I am one or the other. Documentary films needs to do more than journalism - they need to communicate something that is more universal.",
                    "score": 1060,
                    "author": "LauraPoitras",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey everyone - thanks for the questions, I really enjoyed it. Sorry, but I have to run. Hope to be back soon!",
            "score": 683,
            "author": "LauraPoitras",
            "replies": []
        },
        {
            "level": 0,
            "comment": "What's the best way to make NSA spying an issue in the 2016 Presidential Election? It seems like while it was a big deal in 2013, ISIS and other events have put it on the back burner for now in the media and general public. What are your ideas for how to bring it back to the forefront? ",
            "score": 4877,
            "author": "masondog13",
            "replies": [
                {
                    "level": 1,
                    "comment": "The key tactic DC uses to make uncomfortable issues disappear is bipartisan consensus. When the leadership of both parties join together - as they so often do, despite the myths to the contrary - those issues disappear from mainstream public debate.\n\nThe most interesting political fact about the NSA controversy, to me, was how the divisions didn't break down at all on partisan lines. Huge amount of the support for our reporting came from the left, but a huge amount came from the right. When the first bill to ban the NSA domestic metadata program was introduced, it was tellingly sponsored by one of the most conservative Tea Party members (Justin Amash) and one of the most liberal (John Conyers).\n\nThe problem is that the leadership of both parties, as usual, are in full agreement: they love NSA mass surveillance. So that has blocked it from receiving more debate. That NSA program was ultimately saved by the unholy trinity of Obama, Nancy Pelosi and John Bohener, who worked together to defeat the Amash/Conyers bill.\n\nThe division over this issue (like so many other big ones, such as crony capitalism that owns the country) is much more \"insider v. outsider\" than \"Dem v. GOP\". But until there are leaders of one of the two parties willing to dissent on this issue, it will be hard to make it a big political issue.\n\nThat's why the Dem efforts to hand Hillary Clinton the nomination without contest are so depressing. She's the ultimate guardian of bipartisan status quo corruption, and no debate will happen if she's the nominee against some standard Romney/Bush-type GOP candidate. Some genuine dissenting force is crucial.",
                    "score": 3255,
                    "author": "glenngreenwald",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Reminds me of the speech you gave at the Boston ACLU, back in 2011.\n\nFor those interested it is a fantastic listen:  http://aclum.org/greenwald",
                            "score": 138,
                            "author": "pj4533"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is a good question, and there are some good traditional answers here. Organizing is important. Activism is important. \n\nAt the same time, we should remember that governments don't often reform themselves. One of the arguments in a book I read recently (Bruce Schneier, \"Data and Goliath\"), is that perfect enforcement of the law sounds like a good thing, but that may not always be the case. The end of crime sounds pretty compelling, right, so how can that be?\n\nWell, when we look back on history, the progress of Western civilization and human rights is actually founded on the violation of law.  America was of course born out of a violent revolution that was an outrageous treason against the crown and established order of the day. History shows that the righting of historical wrongs is often born from acts of unrepentant criminality. Slavery. The protection of persecuted Jews. \n\nBut even on less extremist topics, we can find similar examples. How about the prohibition of alcohol? Gay marriage? Marijuana? \n\nWhere would we be today if the government, enjoying powers of perfect surveillance and enforcement, had -- entirely within the law -- rounded up, imprisoned, and shamed all of these lawbreakers?\n\nUltimately, if people lose their willingness to recognize that there are times in our history when legality becomes distinct from morality, we aren't just ceding control of our rights to government, but our agency in determing thour futures.\n\nHow does this relate to politics? Well, I suspect that governments today are more concerned with the loss of their ability to control and regulate the behavior of their citizens than they are with their citizens' discontent. \n\nHow do we make that work for us? We can devise means, through the application and sophistication of science, to remind governments that if they will not be responsible stewards of our rights, we the people will implement systems that provide for a means of not just enforcing our rights, but *removing from governments the ability to interfere with those rights*.\n\nYou can see the beginnings of this dynamic today in the statements of government officials complaining about the adoption of encryption by major technology providers. The idea here isn't to fling ourselves into anarchy and do away with government, but to remind the government that there must always be a balance of power between the governing and the governed, and that as the progress of science increasingly empowers communities and individuals, there will be more and more areas of our lives where -- if government insists on behaving poorly and with a callous disregard for the citizen -- we can find ways to reduce or remove their powers on a new -- and permanent -- basis. \n\nOur rights are not granted by governments. They are inherent to our nature. But it's entirely the opposite for governments: their privileges are precisely equal to only those which we suffer them to enjoy.\n\nWe haven't had to think about that much in the last few decades because quality of life has been increasing across almost all measures in a significant way, and that has led to a comfortable complacency. But here and there throughout history, we'll occasionally come across these periods where governments think more about what they \"can\" do rather than what they \"should\" do, and what is lawful will become increasingly distinct from what is moral. \n\nIn such times, we'd do well to remember that at the end of the day, the law doesn't defend us; we defend the law. And when it becomes contrary to our morals, we have both the right and the responsibility to rebalance it toward just ends.",
                    "score": 7018,
                    "author": "SuddenlySnowden",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Martin Luther King said it best in his [**Letter from Birmingham County Jail**](http://www.africa.upenn.edu/Articles_Gen/Letter_Birmingham.html)\n\n\"How can you advocate breaking some laws and obeying others?\" The answer lies in the fact that there are two types of laws: just and unjust. I would be the first to advocate obeying just laws. One has not only a legal but a moral responsibility to obey just laws. Conversely, one has a moral responsibility to disobey unjust laws. I would agree with St. Augustine that \"an unjust law is no law at all.\" \n",
                            "score": 2532,
                            "author": "Pimpson17",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I can imagine some student in the future having to read Thoreaus 'Civil Disobedience', Kings 'Letter from a Birmingham Jail' and this Snowden response from 4 hours ago.",
                                    "score": 791,
                                    "author": "fuckswithfire",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It will be recommended reading for my Debate course. My graduating seniors will be given a  copy of Walden and Civil Disobedience as a graduation gift.  ",
                                            "score": 232,
                                            "author": "caughtowl",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Snowden's \"Gilded reply to masondog13\"",
                                            "score": 47,
                                            "author": "TheRevMrGreen"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Snowden's 'Impromptu Response on a Pre-Brainosphere Primitive Network'.",
                                            "score": 81,
                                            "author": "CopaceticOpus",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Edward Snowden just called for civil disobedience against the US government whilst also arguing for the legalization of marijuana during an AMA. This is quite possibly the most reddit thing ever.\n\n",
                            "score": 4587,
                            "author": "the_ak",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "its-happening.gif",
                                    "score": 5604,
                                    "author": "SuddenlySnowden",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 736,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 129,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "He's /u/UnidanX, clearly, and has an account for each subject area that he has mastered.\n\nEdward Snowden: The Daniel Ellsberg of our age still, somehow, finds time to argue about crows on Reddit.",
                                                    "score": 157,
                                                    "author": "lachryma",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "/r/retiredreddit\n\nOkay folks. It was a nice ride but I think we've reached peak Reddit. It can only go downhill from here.",
                                            "score": 2125,
                                            "author": "climbandmaintain",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Unlike oil, cat pictures are a renewable resource. Peak reddit is a myth.",
                                                    "score": 1452,
                                                    "author": "Noble_Flatulence",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Are you telling me edward snowden posts dank memes?",
                                            "score": 158,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If he's not more careful he might make it onto a list.",
                                    "score": 29,
                                    "author": "ChoosetheSword"
                                },
                                {
                                    "level": 3,
                                    "comment": "Except,  it's not just a reddit thing.  Virtually anyone who actually follows current and past politics will realize civil disobedience against the government is the way to get things done quick...  ",
                                    "score": 429,
                                    "author": "isarealboy772",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Agree... it's just tough to get people motivated when they aren't seeing the impact right in front of their faces. With most successful movements that I can think of, the boot was felt on millions of necks to a point it interfered with their lives.",
                                            "score": 75,
                                            "author": "anacyclosis",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Ultimately, if people lose their willingness to recognize that there are times in our history when legality becomes distinct from morality, we aren't just ceding control of our rights to government, but our futures.\n\nWow",
                            "score": 1552,
                            "author": "Tsukamori",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 507,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It is amazing and appalling to read this and think, *this* is Edward Snowden. *This* is the man that the government has driven out of the country and tormented. For what? Talking about such trifles as \"rights,\" and \"privacy.\" The gall of the peasantry!\n\nYou have done nothing but speak simple truths. And the people in \"power\" of the most \"powerful\" nation in the world are terrified of you. The weak, sniveling, obsolete old men who clog our halls are revealed for what they are. So they heap the revilement on you.",
                            "score": 33,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "These replies are so detailed, well-written, elaborate, and well-articulated! Thank you, Mr. Snowden, for what you do and for providing us the opportunity at this AMA!",
                            "score": 403,
                            "author": "SaveTheBlindTiger",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "This answer gave me chills. So clear, focused and powerful.",
                            "score": 417,
                            "author": "varunpramanik",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm out of time, everybody. Thank you so much for the interest, the support, and most of all, the great questions. I really enjoyed the opportunity to engage with reddit again -- it really has been too long.\n\n",
            "score": 2746,
            "author": "SuddenlySnowden",
            "replies": [
                {
                    "level": 1,
                    "comment": "This was a quality AMA. Come back soon!",
                    "score": 126,
                    "author": "sensationalist3"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 2356,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 463,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Laura: Will you release more footage of the meetings held with Snowden in Hong Kong?",
            "score": 424,
            "author": "nitpickr",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, I do plan to release more footage from Hong Kong shoot. On the first day we met Ed, Glenn conducted a long interview (4-5 hours) that is extraordinary. I also conducted a separate interview with Ed re: technical questions. The time constraints of a feature film made it impossible to include everything. I will release more.  \n\nI also filmed incredible footage with Julian Assange/WikiLeaks that we realized in the edit room was a separate film.",
                    "score": 921,
                    "author": "LauraPoitras",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh man, I would absolutely love to see the whole, raw footage you shot. It was very interesting to see how things unfolded before the world knew a whole lot about who had leaked things.\n\nIs this separate film with Assange in production currently?",
                            "score": 160,
                            "author": "walkingtheriver",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Would LOVE to see a film on WikiLeaks/Assange. ",
                            "score": 61,
                            "author": "itsacavetroll",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "/u/PresidentObama do you have anything you want to ask?",
            "score": 1673,
            "author": "kerrybaumann",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1751,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow the questions really blew up on this one. Let me start digging in...\n\nTo be honest, I laughed at NPH. I don't think it was meant as a political statement, but even if it was, that's not so bad. My perspective is if you're not willing to be called a few names to help out your country, you don't care enough.\n\n[\"If this be treason, then let us make the most of it.\"](https://en.wikipedia.org/wiki/Patrick_Henry)\n\nNote: reddit is rate-limiting my replies to one per ten minutes (\"you are doing that too much! try again in 9 minutes...\"), guys. Sorry for the slow responses.\n",
                    "score": 3155,
                    "author": "_EdwardSnowden",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; Note: reddit is rate-limiting my replies to one per ten minutes (\"you are doing that too much! try again in 9 minutes...\"), guys. Sorry for the slow responses.\n\nI know how to fix this!\n\n1. Find a picture of a bunch of snow completely covering a house\n2. Post picture to /r/funny\n3. make the caption, \"Guess I'm not the only one who's \"Snowed in!\"\n4. ???\n5. Post as much as you want",
                            "score": 2737,
                            "author": "jstrydor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "https://imgflip.com/i/i0s7i",
                                    "score": 746,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;I know how to fix this!\n\nComment posting is based on comment karma in the subreddit in question.\n\nYou can have a brajillion link karma in /r/funny and get rate limited comments in /r/IAmA, especially if you've gotten downvotes. \n\nI know you're making a joke but your method won't fix comment rate limiting. ",
                                    "score": 19,
                                    "author": "elneuvabtg",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Here's a little insight into how digital age media works:\n\nI learned of NPH's joke after I left the stage (he said it as we were walking off). I was going to tweet something about it and decided it was too petty and inconsequential even to tweet about - just some lame word-play Oscar joke from a guy who had just been running around onstage in his underwear moments before. So I forgot about it. My reaction was similar to Ed's, though I did think the joke was lame.\n\nA couple hours later at a post-Oscar event, a BuzzFeed reporter saw me and asked me a bunch of questions about the film and the NSA reporting, one of which was about that \"treason\" joke. I laughed, said it was just a petty pun and I didn't want to make a big deal out of it, but then said I thought it was stupid and irresponsible to stand in front of a billion people and accuse someone of \"treason\" who hasn't even been charged with it, let alone convicted of it.\n\nKnowing that would be the click-worthy comment, BuzzFeed highlighted that in a headline, making it seem like I had been on the warpath, enraged about this, convening a press conference to denounce this outrage. In fact, I was laughing about it the whole time when I said it, as the reporter noted. But all that gets washed away, and now I'm going to hear comments all day about how I'm a humorless scold who can't take a good joke, who gets furious about everything, etc. etc.\n\nNobody did anything wrong here, including BuzzFeed. But it's just a small anecdote illustrating how the imperatives of internet age media and need-for-click headlines can distort pretty much everything they touch.",
                            "score": 2181,
                            "author": "glenngreenwald",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; Nobody did anything wrong here, including BuzzFeed.\n\nThat's the political correct response, I'll just say it, click-bait journalism is a cancer and it must be killed.",
                                    "score": 1935,
                                    "author": "somewhatfunnyguy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That won't happen without fundamentally altering human psychology. The only thing separating clickbait from yellow journalism is technology and a screen - it's been around for as long as mass media has",
                                            "score": 317,
                                            "author": "lasting__damage",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "HEADLINE: Redditor somewhatfunnyguy calls Buzzfeed \"a cancer\", says it \"must be killed.\"",
                                            "score": 33,
                                            "author": "westonc",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "reddit, fix this quick.",
                            "score": 431,
                            "author": "Hejfede",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt; reddit is rate-limiting my replies to one per ten minutes (\"you are doing that too much! try again in 9 minutes...\"), guys. Sorry for the slow responses.\n\nMaybe message the mods, this probably isn't how it is supposed to work on AMA ",
                            "score": 191,
                            "author": "teleekom",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wow the questions really blew up on this one. Let me start digging in...\n\nTo be honest, I laughed at NPH. I don't think it was meant as a political statement, but even if it was, that's not so bad. My perspective is if you're not willing to be called a few names to help out your country, you don't care enough. \n\n[\"If this be treason, then let us make the most of it.\"](https://en.wikipedia.org/wiki/Patrick_Henry)\n\nNote: reddit is rate-limiting my replies to one per ten minutes (\"you are doing that too much! try again in 9 minutes...\"), guys. Sorry for the slow responses. ",
                    "score": 816,
                    "author": "SuddenlySnowden",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hey admins, this is a pretty big AMA, how about you cut Snowden some slack with the reply/submission rules for a few hours?",
                            "score": 564,
                            "author": "thewhitedeath",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Reddit: \"huh... that's not us\"\nNSA: \"he.. he.. he..\"\n\nSee also: man-in-the-middle attack",
                                    "score": 386,
                                    "author": "can_dry",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "NSA: \"Don't go to Snowden's AMA! Look over here, look at all these dank memes!\"",
                                            "score": 100,
                                            "author": "Dininiful",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "We figured out the mix-up. ",
                                    "score": 256,
                                    "author": "chooter",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Did you confirm your email?",
                            "score": 140,
                            "author": "skeddles",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 257,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "And your exact GPS coordinates. ",
                                    "score": 105,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Edward, a friend of mine works for the NSA. He still actively denies that anything you have done or said is legitimate, completely looking past any documented proof that you uncovered and released.  \n\nIs this because at lower levels of the agency, they don't see what's going on in the intelligence gathering section? Or do you suspect he simply refuses to see any wrongdoing by his employer?",
            "score": 953,
            "author": "falcon4287",
            "replies": [
                {
                    "level": 1,
                    "comment": "So when you work  at NSA, you get sent what are called \"Agency-All\" emails. They're what they sound like: messages that go to everybody in the workforce. \n\nIn addition to normal bureaucratic communications, they're used frequently for opinion-shaping internally, and are often classified at least in part. They assert (frequently without evidence) what is true or false about cases and controversies in the public news that might influence the thinking about the Intelligence Community workforce, while at the same time reminding them how *totally screwed* they'll be if they talk to a journalist (while helpfully reminding them to refer people to the public affairs office).\n\nThink about what it does to a person to come into their special top-secret office every day and get a special secret email from \"The Director of NSA\" (actually drafted by totally different people, of course, because senior officials don't have time to write PR emails) explaining to you why everything you heard in the news is wrong, and how only the brave, patriotic, and hard-working team of cleared professionals in the IC know the truth.\n\nThink about how badly you want to believe that. Everybody wants to be valued and special, and nobody wants to think they've perhaps contributed to a huge mistake. It's not evil, it's human.\n\nTell your friend I was just like they are. But there's a reason the government has -- now almost two years out -- never shown me to have told a lie. I don't ask anybody to believe me. I don't *want* anybody to believe me. I want you to look around and decide for yourself what you believe, independent of what people says, indepedent of what's on TV, and independent of what your classified emails might claim.",
                    "score": 2538,
                    "author": "SuddenlySnowden",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 100,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Think about how badly you want to believe that. Everybody wants to be valued and special, and nobody wants to think they've perhaps contributed to a huge mistake. It's not evil, it's human.\n&gt; \n\nThat makes sense. Sometimes, I wonder if that's what it all comes down to.",
                            "score": 42,
                            "author": "jon_stout",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt; I want you to look around and decide for yourself what you believe, independent of what people says, indepedent of what's on TV, and independent of what your classified emails might claim.\n\nThis x1000",
                            "score": 348,
                            "author": "TheMrFred",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He's like a cyber buddha",
                                    "score": 301,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "/u/falcon4287 have you considered the implications for your friend if he were known by his employer to have said something significantly different from what he's told you?",
                    "score": 364,
                    "author": "dr02019",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I completely understand him not wanting to say something over the phone... but when I brought up Edward Snowden, his defensiveness about the subject was not \"feeding me the company line,\" he was genuinely upset about what Snowden did and was angrily calling him a traitor.  \n\nGiven that it was the day before the guy's wedding, I didn't want to get into it with him by mentioning my views that Snowden is a national hero. He was already irate at the mere mention of Snowden's name. That's far from just telling me what he's \"supposed to\" say. He genuinely believed what he was saying.",
                            "score": 252,
                            "author": "falcon4287",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I have the impression that a lot of NSA people think they are doing a great thing for protecting the country, defending US interests.\n\nAnd to a certain point, they are right. They just don't realize that at the same time, they're destroying everything the US prides itself about (individual freedoms, democracy, ...).",
                                    "score": 278,
                                    "author": "aaaaaaaarrrrrgh",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You absolutely have to believe in what you're doing. It's not a matter of being paid enough to quiet the moral voice inside you, it's that you believe that national security and America's interests should be pursued and protected by pretty much whatever means necessary. These agencies look very closely at candidates and try their best to discern whether or not they fit that profile. ",
                                            "score": 34,
                                            "author": "Grizzleyt"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 369,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I probably would have said what I said the day before when CITIZENFOUR won the Independent Spirit Award and Laura, Dirk and Mathilde generously asked me to say something:\n\nhttps://www.youtube.com/watch?v=udfKDCI3i2s\n\nOr maybe I would have just read from some documents that I can't wait to be reported and disclosed, along with some nice visuals of those docs.",
                    "score": 690,
                    "author": "glenngreenwald",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Transcript for people who can't access the video:\n&gt; A lot of people talk about this film as if it is a subversion of privacy, and I think it's actually much more about a subversion of democracy - if we don't know the most important acts that our government is doing because it's kept from us, then we don't really have meaningful democracy , and that's why really brave whistle-blowers like Daniel Ellsberg, and Chelsea Manning and especially the stunningly courageous Edward Snowden deserve not decades in prison but our collective gratitude!",
                            "score": 467,
                            "author": "siriuslyred",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "First, congrats to the Oscar! \nMr. Snowden, what do you think about the latest news kaspersky broke? I understand they don't talk about victims and aggressors because it's their business model. But do you think they should name the nsa as an aggressor when they know about? \nEdit: spelling. ",
            "score": 582,
            "author": "ba_dumtshhh",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Kaspersky report on the \"Equation Group\" (they appear to have stopped short of naming them specifically as NSA, although authorship is clear) was significant, but I think more significant is the recent report on the joint UK-UK hacking of Gemalto, a Dutch company that produces critical infrastructure used around the world, including here at home.\n\nWhy? Well, although firmware exploitation is nasty, it's at least theoretically reparable: tools could plausibly be created to detect the bad firmware hashes and re-flash good ones. This isn't the same for SIMs, which are flashed at the factory and never touched again. [When the NSA and GCHQ compromised the security of potentially billions of phones (3g/4g encryption relies on the shared secret resident on the sim)](https://firstlook.org/theintercept/2015/02/19/great-sim-heist/), they not only screwed the manufacturer, they screwed all of us, because the only way to address the security compromise is to recall and replace every SIM sold by Gemalto.\n\nOur governments - particular the security branches - should never be weighing the equities in an intelligence gathering operation such that a temporary benefit to surveillance regarding a few key targets is seen as more desireable than protecting the communications of a global system (and this goes double when we are more reliant on communications and technology for our economy productivity than our adversaries).",
                    "score": 1294,
                    "author": "SuddenlySnowden",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So far Gemalto is claiming SIMs are still secure. http://www.cnet.com/news/sim-card-maker-gemalto-says-its-cards-are-secure-despite-hack/\n\nNot believing them at this point. Theoretically I would believe them if they had found some traces of an intrusion and had figured out that it would not have allowed access to private keys. But based on just their claims of security, not buying it yet.",
                            "score": 155,
                            "author": "1337_Mrs_Roberts",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I wouldn't believe them either. When we're talking about how to weight reliability between specific government documents detailing specific Gemalto employees and systems (and tittering about how badly they've been owned) against a pretty breezy and insubstantial press release from a corporation whose stock lost 500,000,000 EUR in value in a single day, post-report, I know which side I come down on.\n\nThat's not to say Gemalto's claims are totally worthless, but they have to recognize that their business relies on trust, and if they try to wave away a serious compromise, it'll cost them more than it saves them.\n",
                                    "score": 432,
                                    "author": "SuddenlySnowden",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Gemalto just released a new press release:\n\nhttp://www.gemalto.com/press/Pages/Update-on-the-SIM-card-encryption-keys-matter.aspx\n\nLooks like they are backtracking already on their previous comments.",
                                            "score": 82,
                                            "author": "MysticFear",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Sidenote: I just wanted to tell you how much of an inspiration you are to me and to so many of teens like me. You're my idol.",
                                            "score": 36,
                                            "author": "Tsukamori",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "As a person who has a very full understanding of how GSM/UMTS networks work and how UE(user equipment) attaches to them, its a lie. If they have the key or have hacked the SIM fw, they can do pretty much anything. ",
                                    "score": 37,
                                    "author": "solarjunk",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Very exciting to see you here Mr Snowden.\n\nWe've now known about the scary stuff happening at the NSA for quite some time. And yet from what I've seen, there's been no real effort to stop it.\n\nWhat are your thoughts on what we, as regular citizens, can do now?",
            "score": 1469,
            "author": "cahaseler",
            "replies": [
                {
                    "level": 1,
                    "comment": "Check out [Prism Break](https://prism-break.org/en/)\n\nbasically has free and open source alternatives to the NSA-compromised software most of us use on a daily basis.\n\nAlso support the [EFF](https://www.eff.org/), they're fighting for the same cause Snowden is.\n\nEdit: Thank you so much for the reddit gold, anonymous Redditor!\n",
                    "score": 930,
                    "author": "D4rkr4in",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 223,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Direct links to vote to donate via reddit:\n\n[EFF](https://www.reddit.com/donate?organization=43091431)  \n[Tor Project](https://www.reddit.com/donate?organization=208096820)  \n[Linux Foundation](https://www.reddit.com/donate?organization=460503801)  \n[Mozilla Foundation](https://www.reddit.com/donate?organization=200097189)  \n[Free Software Foundation](https://www.reddit.com/donate?organization=42888848)  \n[Internet Archive](https://www.reddit.com/donate?organization=943242767)  \n[Wikimedia Foundation](https://www.reddit.com/donate?organization=200049703)\n\nAlso check out /r/redditdonate for more suggestions.",
                                    "score": 76,
                                    "author": "Treviso",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "One of the biggest problems in governance today is the difficulty faced by citizens looking to hold officials to account when they cross the line. We can develop new tools and traditions to protect our rights, and we can do our best to elect new and better representatives, but if we cannot enforce consequences on powerful officials for abusive behavior, we end up in a system where the incentives reward bad behavior post-election. \n\nThat's how we end up with candidates who say one thing but, once in power, do something radically different. How do you fix that? Good question.",
                    "score": 2404,
                    "author": "SuddenlySnowden",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah but it makes for a good netflix show.",
                            "score": 1480,
                            "author": "AlderaanRefugee",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mr Snowden, do you feel that your worst fear is being realized, that most people don't care about their privacy?",
            "score": 3321,
            "author": "kingshav",
            "replies": [
                {
                    "level": 1,
                    "comment": "To answer the question, I don't. Poll after poll is confirming that, contrary to what we tend to think, people not only care, they care a lot. The problem is we feel disempowered. We feel like we can't do anything about it, so we may as well not try.\n\nIt's going to be a long process, but that's starting to change. The technical community (and a special shoutout to every underpaid and overworked student out there working on this -- you are the noble Atlas lifting up the globe in our wildly inequitable current system) is in a lot of way left holding the bag on this one by virtue of the nature of the problems, but that's not all bad. 2013, for a lot of engineers and researchers, was a kind of atomic moment for computer science. Much like physics post-Manhattan project, an entire field of research that was broadly apolitical realized that work intended to improve the human condition could also be subverted to degrade it.\n\nPoliticians and the powerful have indeed got a hell of a head start on us, but equality of awareness is a powerful equalizer. In almost every jurisdiction you see officials scrambling to grab for new surveillance powers now not because they think they're necessary -- even government reports say mass surveillance doesn't work -- but because they think it's their last chance.\n\nMaybe I'm an idealist, but I think they're right. In twenty years' time, the paradigm of digital communications will have changed entirely, and so too with the norms of mass surveillance.\n",
                    "score": 3500,
                    "author": "SuddenlySnowden",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "/u/SuddenlySnowden\n\nEd,\n\nI want to thank you for the sacrifices you made in defense of our constitution. Your revelations helped me to realize just how badly out of control the NSA has gotten. I have been politically active in the Oregon Republican Party for several years now, and you inspired me to propose an amendment to the state party platform (at our August 2013 state convention) that explicitly articulates our support for the 4th amendment and our opposition to the warrantless surveillance that you, Laura &amp; Glenn brought to light:\n\n&gt;2.8 We support Oregonians' right to privacy, specifically including personal possessions and electronic records, from mass surveillance, search, or seizure unless authorized by a specific warrant based on probable cause.\n\nSource: [Oregon Republican Party platform](http://www.oregonrepublicanparty.org/Platform2013) (amended 8/10/2013)\n\nAfter the \"Crime and Justice\" committee discussed and edited my proposal, we unanimously recommended it to the full convention, and it was in fact adopted by the rest of the body with little to no public opposition.\n\nIf anyone wants to read about my experience, you can do so in this thread that I originally posted to /r/RestoreTheFourth:\n\n[Last weekend, I introduced an anti-surveillance amendment to the Oregon Republican Party platform. It was unanimously approved by my committee and then adopted by the rest of the convention.](http://www.reddit.com/r/restorethefourth/comments/1kdzzp/last_weekend_i_introduced_an_antisurveillance) \n\nPeople *do* care, and we have been figuring out ways to make sure that our elected officials know it.",
                            "score": 654,
                            "author": "NathanDahlin",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hey guys, sorry -- the reddit mods are being a little weird. My account is /u/SuddenlySnowden. \n\nMods: Can you pull back the ban?  I can't post from the primary account. Thanks.",
                    "score": 2592,
                    "author": "_EdwardSnowden",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 511,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Mod here - really sorry for the confusion. Your colleagues set up the OPs account for you and when you started replying on a different account we had to assume it was a fake.\n\nYour new account /u/SuddenlySnowden is good to go.",
                            "score": 1869,
                            "author": "cahaseler",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks! Feel free to prune this part of the thread.",
                                    "score": 1681,
                                    "author": "SuddenlySnowden",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Did Edward Snowden just encourage censorship?! \n\nOf course that was satirical",
                                            "score": 280,
                                            "author": "howmanypoints",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 185,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 130,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mr. Snowden, the legal scholar Amy Peikoff says that the reason why the U.S. Supreme Court rationalizes that mass surveillance is constitutional, and not a violation of the Fourth Amendment, is that the Supreme Court cites the Third Party Doctrine. Scholars such as Amy Peikoff say that for mass surveillance to end, the Supreme Court would have to overturn the Third Party Doctrine.  May I ask for your views on the Third Party Doctrine as it relates to mass surveillance?  ",
            "score": 200,
            "author": "legendre007",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 238,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hello fantastic trio.\n\nAny hope that CITIZENFOUR's success will help with repatriating its star, or will the Manning treatment forever hang over your head?",
            "score": 478,
            "author": "ffwiffo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Edward Snowden should not be forced to choose between living in Russia or spending decades in a cage inside a high-security American prison.\n\nDC officials and journalists are being extremely deceitful when they say: 'if he thinks he did the right thing,he should come back and face trial and argue that.\"\n\nUnder the Espionage Act, Snowden would be barred even from raising a defense of justification. The courts would not allow it. So he'd be barred from raising the defense they keep saying he should come back and raise.\n\nThe goal of the US government is to threaten, bully and intimidate all whistleblowers - which is what explains the mistreatment and oppression of the heroic Chelsea Manning - because they think that climate of fear is crucial to deterring future whistleblowers.\n\nAs long as they embrace that tactic, it's hard to envision them letting Ed return to his country. But we as citizens should be much more interested in the question of why our government threatens and imprisons whistleblowers.",
                    "score": 1520,
                    "author": "glenngreenwald",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; Under the Espionage Act, Snowden would be barred even from raising a defense of justification. The courts would not allow it. So he'd be barred from raising the defense they keep saying he should come back and raise.\n\nI'd like to add some words about that wonderful bill:\n\n*The Espionage Act of 1917 was passed to prevent spying but also contained a section which criminalized inciting or attempting to incite any mutiny, desertion, or refusal of duty in the armed forces, punishable with a fine of not more than $10,000, not more than twenty years in federal prison, or both. Thousands of anti-war activists and unhappy citizens were prosecuted on authority of this and the Sedition Act of 1918, which tightened restrictions even more. Among the most famous was Eugene Debs, chairman of the Socialist Party of the USA for giving an anti-war speech in Ohio. The U.S. Supreme Court upheld these prosecutions in a series of decisions. Conscientious objectors were punished as well, most of them Christian pacifist inductees. They were placed directly in the armed forces and court-martialed, receiving draconian sentences and harsh treatment. A number of them died in Alcatraz Prison, then a military facility. Vigilante groups were formed which suppressed dissent as well, such as by rounding up draft-age men and checking if they were in possession of draft cards or not.*",
                            "score": 151,
                            "author": "LetItSnowden",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 954,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think much has changed. The US Government hasn't restricted its own power, but it's unrealistic to expect them to do so.\n\nThere are now court cases possible challenging the legality of this surveillance - one federal court in the US and a British court just recently found this spying illegal.\n\nSocial media companies like Facebook and Apple are being forced by their users to install encryption and other technological means to prevent surveillance, which is a significant barrier.\n\nNations around the world (such as Brazil and Germany) are working together in unison to prevent US hegemony over the internet and to protect the privacy of their own citizens.\n\nAnd, most of all, because people now realize the extent to which their privacy is being compromised, they can - and increasingly are - using encryption and anonymizers to protect their own privacy and physically prevent mass surveillance (see here: http://www.wired.com/2014/05/sandvine-report/).\n\nAll of these changes are very significant. And that's to say nothing of the change in consciousness around the world about how hundreds of millions of people think about these issues. The story has been, and continues to be, huge in many countries outside the US.",
                    "score": 1491,
                    "author": "glenngreenwald",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To dogpile on to this, many of the changes that are happening are invisible because they're happening at the engineering level. Google encrypted the backhaul communications between their data centers to prevent passive monitoring. Apple was the first forward with an FDE-by-default smartphone (kudos!). Grad students around the world are trying to come up with ways to solve the metadata problem (the opportunity to monitor everyone's associations -- who you talk to, who you sleep with, who you vote for -- even in encrypted communications).\n\nThe biggest change has been in awareness. Before 2013, if you said the NSA was making records of everybody's phonecalls and the GCHQ was monitoring lawyers and journalists, people raised eyebrows and called you a conspiracy theorist. \n\nThose days are over. Facts allow us to stop speculating and start building, and that's the foundation we need to fix the internet. We just happened to be the generation stuck with fighting these fires.",
                            "score": 1875,
                            "author": "SuddenlySnowden",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The disclosures really changed me personally. Information security and cryptography is something I somehow was just not that aware of before, and now I can't get enough of it, it's the perfect confluence of all my interests. As someone who graduated college not sure what to do next, it feels so empowering to have a real goal now, I want to work on the tools that will protect people's rights and help people to use them. So thank you for everything you've done, I'm still amazed at how well planned and executed it all was.",
                                    "score": 168,
                                    "author": "Sostratus",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Hey Glenn I think you should edit the original post to include all of y'all's reddit usernames. I see /u/SuddenlySnowden commenting but he doesn't have flair.\n\nEDIT: tyty",
                            "score": 67,
                            "author": "dinklebob",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 484,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "In the past week, it's actually been warmer than the East Coast. Wasn't expecting that one. ",
                    "score": 1198,
                    "author": "SuddenlySnowden",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "\"Not living in an American prison.\" would be my guess.",
                    "score": 901,
                    "author": "LascielCoin",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "\"Russia- it's pretty bad here, but it's not quite Gitmo bad\"™",
                    "score": 366,
                    "author": "CidO807",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "You should ask the US Government:\n\n1) why are you putting whistleblowers in prison at record rates?\n\n2) why did you revoke his passport when he was trying to transit through Russia, thus forcing him to stay there?\n\n3) why do you put whistleblowers in the position of having to choose between asylum in another country or decades in prison?",
                    "score": 1347,
                    "author": "glenngreenwald",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ed, is there any truth to the report that [Anna Chapman](https://imgur.com/rYi6tHl) [attempted to \"seduce\" you](http://nypost.com/2014/12/07/sexy-russian-spy-tried-to-seduce-snowden/)?",
            "score": 666,
            "author": "ispencer",
            "replies": [
                {
                    "level": 1,
                    "comment": "lol no.",
                    "score": 2089,
                    "author": "SuddenlySnowden",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; lol no.\n\n*--Edward Snowden*",
                            "score": 1283,
                            "author": "ShredderZX",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.",
                                    "score": 784,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm going to use this when someone says something stupid.",
                                            "score": 70,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "brb becoming a whistleblower",
                    "score": 240,
                    "author": "notsoobviousreddit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And then you get painted by the American media as a rapist and sex offender through their common character assassination plots.",
                            "score": 38,
                            "author": "atero",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think the correct term is \"honey-pot\"\n\nEdit: Fuck you /u/suddenlysnowden for hijacking my post.",
                    "score": 492,
                    "author": "gerjerb",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do you mind people pirating Citizenfour?",
            "score": 694,
            "author": "peps90",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't have a commercial interest in the film, so I can't speak for the filmmakers, but I know what it's like to be a student with no money.",
                    "score": 1398,
                    "author": "SuddenlySnowden",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The movie is currently available for free as the movie is used as a public evidence in a lawsuit\nhttp://t3n.de/news/citizenfour-oscar-gekroente-595416/",
                            "score": 755,
                            "author": "Gitju",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is a brilliant loophole.",
                                    "score": 227,
                                    "author": "LeFromageQc",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Time to sue Metallica.",
                                            "score": 312,
                                            "author": "sifumokung",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You should put it on Netflix ASAP though. More people will watch it that way as well.",
                            "score": 263,
                            "author": "row101",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Suddenly, Netflix gets throttled again...",
                                    "score": 57,
                                    "author": "thinkmurphy"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 473,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've spoken some about this. We had a great relationship with the CBC for months and did some big-impact stories on CSEC:\n\nhttp://www.cbc.ca/news/politics/csec-used-airport-wi-fi-to-track-canadian-travellers-edward-snowden-documents-1.2517881\n\n The reporter with whom we were working left (Greg Weston) - he was great - and then new one who was assigned wasn't comfortable with the documents, it seemed to us.\n\nBut then CBC editors assured us they were committed to doing the reporting aggressively, assigned someone new, and the last story CBC did with us - on mass CSEC spying on file uploads - was, I think, superbly done:\n\nhttp://www.cbc.ca/news/cse-tracks-millions-of-downloads-daily-snowden-documents-1.2930120",
                    "score": 598,
                    "author": "glenngreenwald",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 61,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have a filmmaking question for Laura. I'm sure this was probably answered in an interview somewhere, but what kind of legal issues did you run into with this film if any? Was there ever the threat of the footage being seized at customs?",
            "score": 160,
            "author": "MomsAgainstMarijuana",
            "replies": [
                {
                    "level": 1,
                    "comment": "Given the fact that I had been repeatedly detained at the U.S. border because of my work on previous films, I moved to Berlin to edit Citizenfour. \n\nWhen Ed contacted me in early 2013 I gave him my assurance I would never comply with a subpoena. Before going to Hong Kong I met with many lawyers to assess the risk. I ignored some of the warnings - for instance the Washington Post urged me not to travel to Hong Kong. Another lawyer said not to bring my camera. \n\nIn the end I decided I could not live with the decision to not travel to Hong Kong. ",
                    "score": 328,
                    "author": "LauraPoitras",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Edward, what was the culture like at the NSA as an insider? Were others conscious of the implications of what was/is going on and their part within it? \n\nThanks very much for coming by, and of course to all 3 of you for your ongoing work!",
            "score": 190,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Mr. Snowden: what was the last thing you did as a \"free man\" before you had to go on the run? ",
            "score": 190,
            "author": "jimifun",
            "replies": []
        }
    ]
}