{
    "id": "6uhzyw",
    "score": 42978,
    "title": "We're afraid to play horror games, so we quit our jobs and made one, with no jump scares. It's called Darkwood, and it's our debut. Ask us anything!",
    "author": "Guteks",
    "date": 1503064848.0,
    "url": "https://www.reddit.com/r/IAmA/comments/6uhzyw",
    "media_urls": [],
    "other_urls": [
        "http://imgur.com/gallery/nODIu",
        "http://www.acidwizardstudio.com/?p=726",
        "https://twitter.com/TheAcidWizard/status/894943579851943936",
        "http://imgur.com/gallery/2V4Pl",
        "https://www.youtube.com/watch?v=3S3tmWfFACQ",
        "http://store.steampowered.com/app/274520/Darkwood/"
    ],
    "postText": "**EDIT**\n\n**Wow!** We did NOT expect such a response. You guys are AMAZING! It's been really fun answering your questions, but we have to call it a day now. Unfortunately we won't be able to answer the +1200 comments which are posted at the time of writing this, but we will pop in over the weekend and try to answer some more.\n\n\nHere's Szurek (the Acid Wizard dog) thanking you for all the lovely questions and comments: http://imgur.com/gallery/nODIu\n\n\n**Another edit!**\n\nSince many of you had questions about art-related stuff, you might be interested in taking part in the fan art contest: http://www.acidwizardstudio.com/?p=726\n\n\n**---**\n\nWe're Acid Wizard Studio, three college buddies (and a dog) from Poland who teamed up and decided to make a game. After more than 4 years of development, we have finished work on Darkwood, a unique top-down survival horror that does not rely on jump scares.\n\nBefore Darkwood, some of us literally could not sit through some of the classics of the genre. While developing the game, we managed to slowly overcome our fear of playing horror games or even watching scary movies. We can now finally play Amnesia: The Dark Descent (at least in broad daylight ;))\n\nWe knew next to nothing about game development before starting work on Darkwood. We all had a background in animation / graphic design, but we had little idea about programming, game design or production. At one point, we sat down and declared we hate our current jobs, and instead of talking all the time about making the game of our dreams, we have to just go and make one.\n\nAfter a lot of sleepless nights, we had a vertical slice (kind of) of the game in 2013. We made a gameplay trailer using it, and the reactions to it blew away all of our expectations. We thought that we could actually make a living out of making video games, and started a Indiegogo campaign later that year to help us fund completing Darkwood. The campaign was not going well, but a second gameplay trailer wich launched during its last week gave us a big boost, and the campaign was a success. We set a deadline to complete the game by 2014.\n\nUnfortunately, our inexperience in game development led to heavily overshooting that date. We expanded the scope of the game, and made some major changes to the core design of the game late in development, which ate up a lot of time. We were forced to launch in Steam Early Access in 2014. The game was received very well by the players, and sold much more than we expected! Encouraged by this... We decided to expand the scope of the game even more!\n\nAfter that, even though we committed our lives to finishing the game as soon as possible, we continued to miss every deadline we set for ourselves. Negative reviews started popping up from players discouraged by the slow development or thinking we have abandoned the game. Development was very slow and frustrating. We bit off way more than we could chew, but we knew we had something special in our hands, and we had to complete it in the way we envisioned it. After 3 years of hard, hard work, the game is finished, and we're pretty proud of it.\n\nProof: https://twitter.com/TheAcidWizard/status/894943579851943936\n\n\n**EDIT:** By popular demand, here is our dog, Szurek (pronounced Shooreck) playing Darkwood: http://imgur.com/gallery/2V4Pl\n\n\nAnswering your questions will be:\n\nGustaw - programming, marketing, PR\n\nArtur - art, sound design, music, story\n\nKuba - animation\n\n\nTo get a glimpse of what Darkwood is about, check out this trailer: https://www.youtube.com/watch?v=3S3tmWfFACQ\n\nFind out more about Darkwood here: http://store.steampowered.com/app/274520/Darkwood/\n\n\n\n",
    "comments": [
        {
            "level": 0,
            "comment": "How did you guys live and support yourselves financially during the development process? Before you released on early access?",
            "score": 4764,
            "author": "Veodr",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gustaw - We gathered funds during a Indiegogo campaign. Before that, we were working after hours, with no funding at all, working day jobs / freelancing.",
                    "score": 4691,
                    "author": "Guteks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The dog is the brains behind all this",
                            "score": 3118,
                            "author": "WTFNOUSENAME",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He's the lead developer.",
                                    "score": 1077,
                                    "author": "LuvP1rate",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He's lead of pawduction.",
                                            "score": 122,
                                            "author": "wizsik"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "In the States, we call it a leash.",
                                            "score": 533,
                                            "author": "PunkShocker",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "He's the lead leash.",
                                                    "score": 293,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 201,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Firm reference- 8/10",
                                                                    "score": 100,
                                                                    "author": "PGskizzEs",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "A perfect score, 5/7.",
                                                                            "score": 82,
                                                                            "author": "CaptainFrosty408",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Lead develpupper?",
                                            "score": 213,
                                            "author": "MangeStrusic",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "There's nothing more important to a successful project than a good lead dogveloper.",
                                            "score": 76,
                                            "author": "shawnaroo",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 81,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, looks like their kick starter turned out to be a good investment in the end.",
                            "score": 53,
                            "author": "Crazy8852795"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There's a lot of trippy shit in this game. Any real life experiences / dreams that became an inspiration for darkwood?",
            "score": 2350,
            "author": "AllWillBeOne",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gustaw - both me and Artur suffer from having hallucinations when waking up during the night. I used to even have sleep paralysis, but not anymore. Sometimes I see some really trippy stuff. Today I woke up and stared at a poster on the wall for like a minute, which changed from a hole in the wall to it's original form (a face). I guess those were pretty easy to take inspiration from, at least from the perspective of emotions we wanted the player to feel.",
                    "score": 3049,
                    "author": "Guteks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; both me and Artur suffer from having hallucinations when waking up during the night.\n\nHow about you setup a carbon monoxide detector in your room?",
                            "score": 3716,
                            "author": "ellaluna4tv",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's not the only explanation. I've had periods of horrible nightly hallucinations all my life, and I've tried CO detectors with no luck. Some people's brains just suck.",
                                    "score": 1132,
                                    "author": "Honesty_Addict",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I used to have sleep paralysis and audio hullucinations. After visits to the doctor and many google searches, I found that if force myself awake for gaming or whatever and I end up going to bed anxious as well (basically anxious about the sleep paralysis / or whatever I have the next day) I would get them pretty consistently. I set myself a good sleep schedule and it eventually went away (watch it come back tonight because I said something). ",
                                            "score": 757,
                                            "author": "Seikon32",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; watch it come back tonight because I said something \n\nHow I feel literally every time I talk to someone about SP. Luckily I have total control over it when it happens, but that sheer feeling of dread stops me from seeing what happens if I allow myself to succumb to it... \n\nWatch it happen tonight because I've joined a discussion about it. \n\nObligatory edit: Did not get SP last night. ",
                                                    "score": 204,
                                                    "author": "IrritableStool",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Shit I have sleep paralysis. I mean me too thanks",
                                                            "score": 71,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; I set myself a good sleep schedule\n\nThis is the key right here. My sleep paralysis/lucid dreaming is only onset by sleep deprivation.",
                                                    "score": 254,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This happens to me currently but nothing compared to what it was like when I was working two jobs. Scary shit!",
                                                            "score": 62,
                                                            "author": "isleepinsocks3"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Same here, oddly they seem to have stopped after I got really mad at them one day (instead of scared) and yelled at them a bunch (in my dead)\n\nYay?",
                                                    "score": 35,
                                                    "author": "drpestilence",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt; in my dead \n\nUhhh..... ",
                                                            "score": 46,
                                                            "author": "IrritableStool",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Should we tell him?",
                                                                    "score": 16,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Typo! meant to say head I think, leaving it though.",
                                                                    "score": 15,
                                                                    "author": "drpestilence"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You get hallucinations for free and you're complaining?\n\nSome of us pay good money for those.",
                                            "score": 295,
                                            "author": "YzenDanek",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's like the difference between paying to get on a rollercoaster and waking up at the top of one. In the latter scenario, you didn't ask for this and weren't prepared for the drop.",
                                                    "score": 150,
                                                    "author": "SidewaysInfinity",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; Some people's brains just suck.\n\nMine likes to give me crippling depression :D",
                                            "score": 71,
                                            "author": "vikingz0mbi3",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Gustaw - thanks, but this is not specific to a place where I sleep (it happens anywhere).",
                                    "score": 271,
                                    "author": "Guteks",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He's referencing [this legendary Reddit thread](https://www.reddit.com/r/legaladvice/comments/34l7vo/ma_postit_notes_left_in_apartment/) where someone posts about strange happenings in his apartment and it turns out- well, I won't spoil the end.",
                                            "score": 327,
                                            "author": "Rock_Me-Amadeus",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Gustaw - dang... I really need to get some sleep :P",
                                                    "score": 106,
                                                    "author": "Guteks"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Pretty sure anyone with some deductive skill can figure it out based on the context above lol",
                                                    "score": 142,
                                                    "author": "Vintage53",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I didn't predict the bit where he got bit by an okapi ",
                                                            "score": 71,
                                                            "author": "Rock_Me-Amadeus"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "You spoiled it :(",
                                                            "score": 39,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Mobile carbon monoxide detector then?",
                                            "score": 74,
                                            "author": "LiberContrarion",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You think he's farting CO in his sleep??",
                                                    "score": 79,
                                                    "author": "SatNav",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I can just see the waking nightmare now.  Your curtains turn into a disembodied face coming closer to swallow you.\n\nYou jump out of bed and run to your desk, yelling \"Wait! Wait! This is awesome! I gotta write this down!\"\n\nThe face stops, looks a bit confused.  Finally it says \"Uh...OK...I guess.\"  :-)",
                            "score": 83,
                            "author": "jeffh4",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Ya'll called your company AcidWizard...sure it does not have anything to do with you guys taking copious amounts of LSD?  I mean that logo sure seems like it. ",
                            "score": 62,
                            "author": "Everyonesasleep",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Gustaw - we're called Acid Wizard because we make stuff that will make you feel as if you've taken acid.",
                                    "score": 78,
                                    "author": "Guteks",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Someone's worried their moms might be on reddit....",
                                            "score": 92,
                                            "author": "MayorOfClownTown"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;  both me and Artur suffer from having hallucinations when waking up during the night\n\nNight terrors. I get these from time to time but have learned to cope with them and just sort of sit back and let it take its course.\n\nIt used to scare the ever loving shit out of my parents when I was a kid when I would wake up and talk about people and things that weren't there in a very matter of fact sort of tone. \n\nHope you and Artur have come to terms with them cause I know first hand how crippling those can be and how they can cause you to straight up not want to go to sleep. ",
                            "score": 39,
                            "author": "Were_Doomed_arent_we",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey man, why do you wish them no inspiration?",
                                    "score": 12,
                                    "author": "desmondao"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Artur - when I was a child, I got scared easily. Until 12 years old, I slept by a lit lamp afraid of every sound, shadow, constantly imagining unnerving characters and things that lurk in the dark. In time, I learned to sleep with the light turned off, but the ability to think of creepy stuff has stayed with me ;)",
                    "score": 233,
                    "author": "Guteks",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "They named their studio \"Acid Wizard\" and I think that alone should answer your question.",
                    "score": 262,
                    "author": "yellowyeahyeahyeah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "the name reminds me of electric wizard, the band",
                            "score": 27,
                            "author": "GratefulFloyd1977",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I TOTALLY LOVE THIS BAND !!! &lt;3",
                                    "score": 30,
                                    "author": "kubakuc",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why were you forced to launch the game in early access in 2014?",
            "score": 958,
            "author": "TheRealKingpin7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Kuba - We were running out of cash, to finalize project. Money from crowdfunding campain weren`t sufficient to make DARKWOOD happen.",
                    "score": 1269,
                    "author": "Guteks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But you got there in the end! Good effing job!",
                            "score": 366,
                            "author": "Unease_Bison"
                        },
                        {
                            "level": 2,
                            "comment": "Imagining you with heavy russian accent makes it sound badass",
                            "score": 20,
                            "author": "WaitWhatting",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Which programming language did you use for developing this game? And/or did you build upon an existing engine?\n\n*Bought your game since day 1 - it was an awesome ride following you guys...*",
            "score": 1107,
            "author": "iameclectictheysay",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gustaw - we used Unity, and everything was written in C#. The main plugins we took advantage of are toolkit2d, A* Pathfinding, 2d volumetric lights, Rotorz tile system, Rewired. Previously we were developing in XNA and the jump to Unity was a tremendous quality of life improvement! Although some versions of Unity are very buggy, I would still heavily recommend this engine for small teams.",
                    "score": 1400,
                    "author": "Guteks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Did you guys have any prior knowledge on Unity or the C# language before starting development on Darkwood?",
                            "score": 89,
                            "author": "Enkrypton",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Gustaw - I had a little bit of experience in making web sites, flash and apps. But that's about it, I learned as we went ;)",
                                    "score": 150,
                                    "author": "Guteks",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "any recommendations/references for someone looking to learn C# and use Unity with experience similar to your's at the start? ",
                                            "score": 13,
                                            "author": "FunnyHairZeldaMan",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "/r/csharp\n\nIn the sidebar there are different communities and links to getting started. Reddit is the best place for information about programming languages; or at least links to them that I've found. \n\nEdit: also, /r/Unity2d /r/Unity3d",
                                                    "score": 14,
                                                    "author": "Kim_Jong_OON"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Googling all the things &lt;o/ Thanks.\n\nEdit; haha you guys are hilarious... Just saying yo thanks like in woohoow \\o/ and then thanks as in &lt;o tipping my hat... But seriously keep up the good stuff...",
                            "score": 399,
                            "author": "iameclectictheysay",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Did you just dab?",
                                    "score": 726,
                                    "author": "birdnoise13",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think it was more a salute and Hail Hitler ",
                                            "score": 493,
                                            "author": "TenshiS",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Looks to me like he's yawning.",
                                                    "score": 138,
                                                    "author": "Humding3r",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I was thinking like an anime esque  pose where the bent arms hand has the pointer and middle finger extended like &lt; over the right eye. Probably.",
                                                            "score": 51,
                                                            "author": "HatsonHats",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "     &lt;o/\n       |\n  &gt;--'",
                                                                    "score": 24,
                                                                    "author": "TheVeganManatee",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I don't know what I've done",
                                                                            "score": 65,
                                                                            "author": "TheVeganManatee",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It was obviously the Disco Point Move.",
                                            "score": 31,
                                            "author": "CunningStunt55",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "DABDUDE2004 &lt;o/",
                                    "score": 23,
                                    "author": "APKID716"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How are the animations made? Frame by frame, pixel by pixel, or is it done another way and then pixelised to your style afterwards? Sort of like a filter over the animation to make it look pixely?\n",
            "score": 227,
            "author": "TravlrAlexander",
            "replies": [
                {
                    "level": 1,
                    "comment": "Kuba - Character animations were made frame by frame. I was working on bigger image, like 4x bigger than destined sprite. When we were exporting sprites we scaled sprite 4x smaller and then we were scaling it 200% so it was working like a filter pixelating graphic.",
                    "score": 331,
                    "author": "Guteks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you ever have to touch up the scaled-down images (e.g. tweaking individual pixels) to get a better final impression?",
                            "score": 66,
                            "author": "YakumoYoukai"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The sound design, art direction, story, and scripting all seem so well done that they could have each been made by an individual who specializes in those things. How did 3 guys with the support of a dog produce all of these elements so professionally? What was it like studying new aspects of game development (particularly things like the spectacular sound design) that you guys might not have already known between the three of you? Did you ever outsource for any of these things?",
            "score": 1207,
            "author": "El_Buhdai",
            "replies": [
                {
                    "level": 1,
                    "comment": "Artur - We wanted to work in a small team. This let us have a more or less focused vision and simplified the production process. Of course by going this road, we had to accept that we will have to do things that are out (sometimes a lot) of our competences. My specialization is art, but as I was the only person in the team that had any idea about making sound (although still verry vague), sound design and music fell on my shoulders. Making Darkwood's OST was a never ending improvisation. I was playing with a medium that I did not fully understand. Maybe thanks to that we were able to create something unique and hard to define, something that breaks the common principles (which I did not know about during production). As for the story, it's like when you have a band, but there's no vocalist. There's a guitarist, drummer, someone has a bass guitar, but no one knows how to sing... so the guy that is least scared of making a idiot out of himself grabs the mic... and that was me ;)\n\nGustaw - I'd like to add that the sound design and music is probably my favorite thing about Darkwood, and Artur is the most talented person I know! :D",
                    "score": 950,
                    "author": "Guteks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There's a line from a book I love *Wise Man's Fear* about music that I feel applies here.\n\n&gt;\"Think of music as being a great snarl of a city [...]. In the years I spent living there, I came to know its streets. Not just the main streets. Not just the alleys. I knew shortcuts and rooftops and parts of the sewers. Because of this, I could move through the city like a rabbit in a bramble. I was quick and cunning an clever.  \nDenna, on the other hand, had never been trained. She knew nothing of shortcuts. You’d think she’d be forced to wander the city, lost and helpless, trapped in a twisting maze of mortared stone. But instead, she simply walked through the walls. She didn’t know any better. Nobody had ever told her she couldn’t. Because of this, she moved through the city like some faerie creature. She walked roads no one else could see, and it made her music wild and strange and free.” \n\n",
                            "score": 429,
                            "author": "mr_abomination",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 61,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm so upset that book/day 3 still isn't out.",
                                    "score": 30,
                                    "author": "dipique",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Try reading the stormlight archive to pass time. 2 books out, the third on the way in a few months. They are fantastic books, I enjoyed them almost as much as KKC.",
                                            "score": 20,
                                            "author": "Whospitonmypancakes",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Thank you for sharing this. ",
                                    "score": 31,
                                    "author": "hey_imKramer"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thanks for the response you guys. \n\nTo Artur, as an amateur producer and someone who is OBSESSED with music and quality sound design you seriously did an amazing job. Everything breathes and feels very real. The pause menu music (which I got to hear looped for hours because for the first 30 hours of playtime I was too scared to actually play longer than 3 seconds at a time during night), is dark, brooding, catchy and sounds like it was done by a producer with years of experience. If this is really something you picked up and experimented with over these last 3 - 4 years, you certainly fooled me!\n\nTo you all, I am seriously a huge fan of your work and I can't wait to finish this game in the coming weeks. Congrats on the release, and I'll be supporting your next project. Cheers! :)",
                            "score": 212,
                            "author": "El_Buhdai"
                        },
                        {
                            "level": 2,
                            "comment": "For the record, holy shit dude.\n\nThe sound design is rather wonderful!",
                            "score": 54,
                            "author": "Ubbermann"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Anything is possible when you have your trusty dog companion by your side, every step of the way",
                    "score": 93,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "The answer was in the question - the support of the dog is what did it",
                    "score": 79,
                    "author": "iLikeTelevision"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is telling everyone that there's no jump scares really just a long-con setup to a major jump scare?",
            "score": 1173,
            "author": "eye_spi",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gustaw - unfortunately no, but we will use this idea for our next game which will be solely jump scare based.",
                    "score": 1469,
                    "author": "Guteks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "... or will you?",
                            "score": 437,
                            "author": "im_in_hiding",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The anticipation for the jump scare might be worse than the jump scare. \n\nIt reminds me of that time my roommate jumped out of nowhere to scare me late at night on my way to the bathroom. I vowed to get him back. He spent the next month on his toes always anticipating it.  \nIn reality, I forgot and just went about my regular life.",
                                    "score": 284,
                                    "author": "Nuhjeea",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You should get him tonight, he must've forgotten by now",
                                            "score": 78,
                                            "author": "Elkazan"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "*Enjoy 60+ hours of pure jump scares. Acid Wizard Studio presents ... Kangaboo!*",
                            "score": 52,
                            "author": "mifan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How long between jump scares is acceptable jump scaring? Are we talking like 1-3 minutes between jumps or is it four times per second for 60 hours?\n\nEdit: I hear our brains can't process more than 60 JSPS (jump scares per second), is there any truth to that?",
                                    "score": 20,
                                    "author": "PM_ME_PRETTY_EYES",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Well now we know.",
                            "score": 27,
                            "author": "jaggedspoon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "it's a double bluff. Or is it?",
                                    "score": 50,
                                    "author": "Diptam",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Holy shit",
                    "score": 132,
                    "author": "Krocwithak",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would be so mad. I would probably rage quit after shoving my heart back into my chest. \"IT WAS ALL A RUUUSSEEEEE\"",
                            "score": 142,
                            "author": "XillaKato",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "THEY PLAYED US LIKE A DAMN FIDDLEEEEE",
                                    "score": 86,
                                    "author": "_Atem_",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am also afraid to play horror games. Should I play Darkwood?",
            "score": 707,
            "author": "McRuggets",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gustaw - I don't know to be honest. This was meant to be a horror game for players who are not horror fans (made by players who are not horror fans), but after reading some comments I'm not sure anymore, as there are both people claiming that the game is not scary at all, and at the opposite end there are players who uninstalled the game after their first meeting with the Banshee... Maybe wait for some reviews?",
                    "score": 1861,
                    "author": "Guteks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; Maybe wait for some reviews?\n\nI love this reply. This isn't something you see developers say about their own game very often at all. The honesty from your entire dev team is refreshing and is one of the things making me want to try this game out. I also enjoy taking part in \"labors of love\"\n\nYou guys seem great, keep up the good work!",
                            "score": 1712,
                            "author": "Prince_Camo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They're Polish developers. What do you expect? All the best devs are from Poland.",
                                    "score": 368,
                                    "author": "DJRES",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'd say all the devs that make the awesome unusual games are from poland.\n\nSee: Ice-pick Lodge Edit: **actually they are russian, oops. They made some really weird but great games though**",
                                            "score": 139,
                                            "author": "Hobocannibal",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Gustaw - I'm afraid Ice-pick Lodge are Russian.",
                                                    "score": 251,
                                                    "author": "Guteks",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": ":( i derped",
                                                            "score": 63,
                                                            "author": "Hobocannibal"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Nevertheless, I personally don't like jump scares but enjoy horror concepts. Thank you for doing what you do.",
                            "score": 60,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I love atmospheric horror but find jumpscares lazy and annoying. I'll have to give this a shot.",
                                    "score": 55,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I can shed some light here maybe.\n\n\n\nI love horror games, and that's what initially caught my eye on this one. It's still a horror game, but let's make a movie analogy. Darkwood is more of a suspense thriller mystery than it is a slasher gore serial killer feeling.",
                    "score": 231,
                    "author": "puffyburdz"
                },
                {
                    "level": 1,
                    "comment": "Its a survival horror game.\n\nIts rather creepy and can get super-intense at night. Albeit during the day the survival/exploration is much more leanient. So it's not a barrage of horror... More like 20 mins exploration/scavening/story, 5 mins 'Oh god go away'",
                    "score": 164,
                    "author": "Ubbermann",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What kind of survival elements are there? Like crafting and having to find food?",
                            "score": 29,
                            "author": "Sinyk7",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Crafting weapons/healing, maintaining your barricades on the windows or doors, upgrading your work stations, keeping tabs on your gasoline [If your generator has no fuel during the night... holy shit you're gonna have a bad time]",
                                    "score": 53,
                                    "author": "Ubbermann",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Honestly you don't need to fuel your generator in the beginning. Save your gas and be more discreet by sitting in the dark and lighting a flare if you really have to.",
                                            "score": 19,
                                            "author": "CaptainFrosty408"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm a gigantic wimp when it comes to horror games but I was able to play Darkwood, it's scary as all hell but for some reason I can handle it.",
                    "score": 96,
                    "author": "Elcatro",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "What was your favorite food during the development process? ",
            "score": 115,
            "author": "SpoogeDoobie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gustaw - Kebab + vietanamese restaurant close by.",
                    "score": 232,
                    "author": "Guteks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How much weight did you guys gain during those 4 years?",
                            "score": 44,
                            "author": "Bontus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not much if they focused on Vietnamese food.",
                                    "score": 22,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What do you guys use to learn programming so well? I am curious what kind of tutorials you used.",
            "score": 106,
            "author": "Crazy8852795",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gustaw - In the beginning, I tried recreating other games, like Terraria. It was fun! Then I pretty much just went and experimented with stuff.",
                    "score": 140,
                    "author": "Guteks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you mind explaining this a bit more? How did you recreate it? What game engine did you use? Any books you found useful? ",
                            "score": 31,
                            "author": "vdlb88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "At first they were on XNA then moved on to Unity. There's plenty of tutorials and on big game engines like Unity/UE4 books, unless you're already high level, would be a waste of your time. Fuck around, follow video tutorials and work hard and it'll come faster than you think.\n\ncheers",
                                    "score": 77,
                                    "author": "Hviterev",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Gustaw - what he said!",
                                            "score": 72,
                                            "author": "Guteks",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This looks fantastic! Why did you decide to do top down instead of an over the shoulder 3rd person or first person view?",
            "score": 328,
            "author": "hypnoaardvark",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gustaw - it was not a conscious decision actually. We started by making a \"top-down tower defence game\" that was going to be made... IN A MONTH ;) But then we saw that this had some real potential for heavy atmoshpere and the project grew and grew from then on. I guess this makes Darkwood pretty unique!",
                    "score": 484,
                    "author": "Guteks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I just want to say, in my humble opinion, this is one of the most interesting and original games to release in a long time from an indie group, top-down or otherwise. But for being top-down, it totally blew away my expectations!",
                            "score": 61,
                            "author": "boo_on_you"
                        },
                        {
                            "level": 2,
                            "comment": "That's neat! Thanks for the insight ",
                            "score": 47,
                            "author": "hypnoaardvark",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I would have guessed that would have been a fear factor decision. Having that perspective gives the player limited awareness and can create some unique chase experiences through mazes.",
                            "score": 18,
                            "author": "Righteous_coder"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "top down is also easier to get done, unlike 3D which will require a lot of animations and physics testing, 2D can get away with much simpler systems. Allowing you to sink more time in production value.\n\nSomething often overlooked in the game industry :\n\n\"Do it simple, but do it right\"",
                    "score": 179,
                    "author": "Herlock",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 259,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gustaw - he defended our hideout with his life!",
                    "score": 559,
                    "author": "Guteks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He protec, but does he also attac?",
                            "score": 352,
                            "author": "Aekarn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He protec, he attac, tried to keep game dev on trac.",
                                    "score": 399,
                                    "author": "regretful_username_",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 79,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Szurek! (pronounced Shooreck!)",
                            "score": 207,
                            "author": "Guteks",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Szurek is love. Szurek is life.",
                                    "score": 257,
                                    "author": "Trinitykill",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"This is mah milkbone\"",
                                            "score": 33,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Can you share a photo of the dog?",
                                    "score": 42,
                                    "author": "IHTPQ",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "http://imgur.com/a/2V4Pl",
                                            "score": 177,
                                            "author": "Guteks",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "A good boy, doing good work.",
                                                    "score": 27,
                                                    "author": "rocknokusogaki"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Can he do tricks? ",
                            "score": 11,
                            "author": "Dr4cul3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why did you censor him?",
                                    "score": 27,
                                    "author": "FirecakeLobsterMan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He was barking ruff words.",
                                            "score": 13,
                                            "author": "p7810456"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Gustaw - http://imgur.com/gallery/nODIu",
                                    "score": 12,
                                    "author": "Guteks",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey guys, congrats on all your achievements!\n\nI'm a mid-30's guy in a completely different industry than game development who is currently seriously considering making a career switch. I have zero programming knowledge but tend to have a creative personality, and game making always fascinated me. I have the fortune of having started a very modestly successful business, so I would have some income from that to keep me going during my learning period. My family is supportive of my goals.\n\nMy question(s)...  what has been the good and bad about changing careers at this point in life? While you were still figuring out game development, how much did you regret leaving your former jobs? What would you have done differently in the beginning to better prepare yourself for today?",
            "score": 85,
            "author": "UberPrioritizer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gustaw - I don't miss any part of my past jobs. Working on Darkwood was great on many levels, but also very stressful. The industry is not what it was a few years back, and marking a indie game nowadays requires a lot of luck to be successful, so it's a great risk. I know many people who made games in which they invested a lot of time and money, and they flopped. In short - it can be a wonderful journey, but it's also a very risky one in the current state of the gaming industry.",
                    "score": 102,
                    "author": "Guteks",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey there! I never had any exposure to Darkwood until it released on Steam, whereupon I quickly bought it and have enjoyed six hours so far. It feels like if Sunless Sea had a kid with Dark Souls to me, in all the right ways. \n\nNow that you've established a very heavy lore, where do you go from here? Expansion pack? Sequel with some of the side characters?\nYou may have known the Darkwood world for five+ years in development. Tired of it. Saturated in it. Wanting to move on. Working on it /every day./ But for us fans, maybe we've only known hours of it, and would happily pay for more exposure in this world if the DLC was done right. \n\nThank you Acid Wizards, best of luck to you in the future!",
            "score": 546,
            "author": "C-zom",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gustaw - Actually no, we'd like to milk this cow dry! We already have a DLC planned for next week, where you can customize the protagonist's face in any way you wish! Too bad you won't see it from the top...\n\nNo but seriously, we don't know. We will have to talk about this after getting some rest and sleep (we're very, very tired right now). I love Darkwood, but this project was also a source of great frustration for me and made me neglect many aspects of my life. There is, however, a huge list of things that we wanted to implement, but we did not want to delay the game more. So who knows?",
                    "score": 860,
                    "author": "Guteks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "hahaha you had me going \"wtf\" there for a second... amazing answer! I can only imagine the physical and emotional toll this took on you guys, so congrats on seeing it through! keep up the good work and consider hiring a couple of people!!",
                            "score": 224,
                            "author": "airstrike"
                        },
                        {
                            "level": 2,
                            "comment": "Would be glad if you guys keep adding content. Or Mod Tools so the torch kept burning.\n\nIf you are too tired of work bringing new mechanics to the game then make it easy and expand the game on the width rather than depth. For example add more of the same with the resources and tools you already developed, more maps, more items.\n\nBecame inspired by you to draw top down maps in a dark setting after drawing many other types of maps before these.\n\n[Map](https://img11.deviantart.net/0661/i/2017/212/1/1/cthulhu_crypt_by_adventuredepot-dbifgke.jpg)\n\n[Another Map](https://orig11.deviantart.net/80b5/f/2017/187/c/5/c51e4acd7ed145d98eb1f13d8e921e03-dbe73ln.jpg)\n",
                            "score": 80,
                            "author": "Adventuredepot",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Quick question for you since you mentioned Sunless Sea. I was reminded of that game instantly when I saw Darkwood on the front page of the store. How comparable would you say the games are? If I'm a big fan of Sunless Sea, will I enjoy Darkwood?",
                    "score": 30,
                    "author": "venerablemonster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The map and how the world is generated feels the same. You walk along a lot of barren forest to find milestones, like Sunless. Where these are will be randomized at the beginning of your save, but biomes don't bleed into each other, like Sunless. And honestly a lot of the dialog, characters, and overall hazy, dreamlike, ethereal feel of things is more similar to Sunless than to, say, Dark Souls.\n\nYou know how in Sunless you can wander a direction through the wilderness/fog and then stumble upon something cool or profound to the story, and it adds itself to your map? Same idea here, even the same camera perspective. BTW this is in no way a bad thing. I love both games.\n\nEdit: Darkwood is more difficult and has a more taxing combat system than Sunless Sea, and while night times are terrifying even at late game, you don't have much to do during them than be afraid and hide in a corner with a light source. There's no building, heavy furniture crafting, base customization, etc. It's linear and just wants you to experience what it wants you to.",
                            "score": 56,
                            "author": "C-zom",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I really like Sunless Sea (I'd say 55% the setting and 45% the actual gameplay) but I hate horror and being scared, maybe I'll make a small horror game myself in order to be able to properly enjoy horror movies and games, including this one :)",
                                    "score": 24,
                                    "author": "omrisim210",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tell us more about specific roles of each Wizard in your project. Is Artur can be called \"Soul of Darkwood\" as he worked on dialogues, characters and music design, videos etc.?",
            "score": 79,
            "author": "ShadyS550",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gustaw - Hi Ivan :D I would say Artur had by far the most influence on the project, but we have a very democratic process about pretty much anything in (and about) the game. It's part of the reason of why we're pretty slow in development, but that way Darkwood is the child of the man-love of all of us, and not a single person.",
                    "score": 150,
                    "author": "Guteks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "classic man-love",
                            "score": 37,
                            "author": "seawork"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 72,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gustaw - I'm not allowed to post specifics about the cut they take I'm afraid. For me, GOG is more personal and curated, as a lot of stuff has to be done through GOG's staff, whereas most of the things on Steam are done through the Steamworks portal.\n\nWe went through greenlight to get published on Steam (I actually forgot to post info about this), and GOG reached out to us personally.",
                    "score": 111,
                    "author": "Guteks"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How are the characters \"done\"? For example, the Wolfman. Did you took photo of some dude in a coat, photoshopped wolf's head in and edited it slightly or is everything hand drawn?",
            "score": 159,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Artur - Every character is draw by hand, from scratch. I did not use photos as a backdrop to draw on (except the tractor for the Musician). I cut the image to parts and then sent to Kuba for him to animate.",
                    "score": 315,
                    "author": "Guteks",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congratulations guys! It must feel great! At any point during development were you tempted to throw in the towel?",
            "score": 104,
            "author": "BoomerGar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Kuba - Everyone of us had nervous breakdowns from time to time... almost 5 years of developing is heck of a marathon. I recall begining of this project (after crowdfunding campaign - that one was stressful) as the best time.. propably one of best times in my life to be honest ! :slightly_smiling_face: People were really exited about darkwood, we were full of energy, we were working whole week, cause we wanted to! After some time things become more and more complicated. The deeper into the forest, the more trees...\n\nGustaw - I agree with Kuba. Making the Indiegogo video was extremely fun, as with most of the things that happened during that time (although the campaign was stressful). The continued delays weighed very heavily on me, I hope we will do a reset now and continue our next endeavors in a more relaxed way :)",
                    "score": 187,
                    "author": "Guteks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You guys definitely deserve a little bit of a break! Thanks!",
                            "score": 24,
                            "author": "BoomerGar"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Artur - the fact that people paid for Darkwood (especially during the Indiegogo campaign). On the one hand, it was very motivating. On the other, especially during the last 2 years, kept me awake at night.",
                    "score": 87,
                    "author": "Guteks",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congrats, been here since Alpha 1 and it's been amazing to see the game's progress!\n\nThe most important question is: where are you guys going to go from here? Will your next game be horror? Top-down? Something totally new?",
            "score": 98,
            "author": "dwthrowawaydw",
            "replies": [
                {
                    "level": 1,
                    "comment": "Down-Top horror would be even crazier!",
                    "score": 61,
                    "author": "Ulldra",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dudes. Your game is terrifying. I got it yesterday (steam watchlist) and the last time I've been so creeped out was playing Dark Descent.\n\nI can only play for a few minutes at a time before I need a break. That's a compliment.\n\nWhat are you planning for the future of the studio. Is horror \"your thing\"?",
            "score": 168,
            "author": "FILTHY_GOBSHITE",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gustaw - Thanks! I don't know about the other wizards (we haven't had the time to talk about this), but most of my ideas on next games are not horror- related.",
                    "score": 101,
                    "author": "Guteks",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are you planning a Playstation 4 release?",
            "score": 203,
            "author": "mnemonic-glitch",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gustaw - we'd like to, yes! But currently there has been nothing done towards this, we've been to preoccupied with the PC release.",
                    "score": 290,
                    "author": "Guteks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This seems like it would play wonderfully on the Switch! Need to go to the bathroom? Pick it up, take it with you to the toilet, and have it scare the shit out of you. :)\n\nEDIT: No, but seriously. Is it possible to port this to the Switch? This type of gameplay is perfect to be played on it. Imagine playing this in your bed, in the dark, with earphones in? It'd be scary!",
                            "score": 273,
                            "author": "broken_long_thumbkey",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Any thoughts on bringing it out for the switch? I feel like it would be the perfect console for it",
                            "score": 50,
                            "author": "vincentwillats",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "This might be a good fit for Nintendo Switch, too. Seems like it's shaping up to be a really good home for indies. :)",
                            "score": 37,
                            "author": "meejle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Would be perfect for Switch! ",
                                    "score": 13,
                                    "author": "BoulderFalcon"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I would love to play this on console.",
                            "score": 47,
                            "author": "cosworthsmerrymen",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The sound recordings are on point.  It looked like some environment changed with the light shining onto, nice.  Is there a stereo function based on the character, do songs get louder due to proximity of that character?\n\nWill there be different bulbs for the light, which \"filter\" the reality in a different way, similar to the flashlight? Other dimensions perhaps?\n\nI like how the top down view shifts for more viewing distance in the direction of travel.  To optimize on this, will players be able to rotate the map?\n\nI back another game in dev, and they have budgeted  over 100 million.  Their budget cannot save them from the unexpected, gripes and growls from the fans.  As a player, I'd rather wait on the polished final release than get it now.  Many \"kickstarter beta game testers\" are thin skinned, and upset it's a broken game, forgetting they're there to test in the first place.  Keep it up, this looks like a good game that harkens back to a golden age of top downs.  Shadowgate Diablo mashup?  I like it.\n\nI'm assuming this is on Steam?  How much, can we buy now?  I'm busy at work not working ding morning rituals.  Thanks guys/girls.\n ",
            "score": 33,
            "author": "ShamefulWatching",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Has Silent Hill been an inspiration for you? 2 especially is what I consider the best horror game, especially since it's so atmosphere heavy",
            "score": 29,
            "author": "CVance1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gustaw - I loved the game and it was a big inspiration (the rest of the team did not play it however, although it was a huge influence in terms of music).",
                    "score": 36,
                    "author": "Guteks",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your wages came from the Indie Gogo campaign after you quit full-time. How do you decide a reasonable level of pay for all working in the project? Do you split it evenly, or for hours worked? Do you consider overtime? For a project where all the money is upfront, then equity after the games launch starting the cycle again for the next project, I've always wondered how you work out wages. ",
            "score": 24,
            "author": "emersonbaillie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gustaw - our pay was split evenly, and we worked as much as we liked (which was pretty much all the time). Our pay was well, honestly the minimum to get by without having to worry about not making rent. This changed after the Early Access launch, and we had more funds to outsource some of the stuff we were not very good with (like rewriting the texts and translations).",
                    "score": 32,
                    "author": "Guteks"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I interviewed Gustaw over email for The University Observer in 2014/15! I was so excited for Darkwood because I hated the way 'horror' games were going!\n\nHow did you find Early Access? If you could create Darkwood again, without needing funding, would you choose early access again or go the traditional route?\n\nAgain, congrats on creating an amazing game. I look forward to what you do next!",
            "score": 40,
            "author": "Kais_117",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gustaw - Hi! I guess that depends on the game we will want to do. Early Access was both a blessing and a curse for us. Thanks to it, we were able to finish Darkwood and benefit from the community's feedback. But it was also a source of great anxiety, as people were beginning to be angry about the delays. ",
                    "score": 41,
                    "author": "Guteks",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is there any interesting idea/character/creature cut from the game in early development that you would like to share with us?\n\nVery happy about this, congratulations!",
            "score": 19,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Artur - At one point, the giant larvae location was cut from the game. You can see it on the second pre-alpha trailer (it was in the alpha for some time after that though). The talking generator was also removed. We wanted the player to gain the ability to talk to him after injecting a cerain amount of essence, but the ideas for actual implementation were too vague and he didn't make it for release. Null Winter, our moderator on the forums had a great idea of implementing a \"tumor\" that sits on the hotbar and talks to you, but it was very complex to implement. There was also a great idea about adding a mirrors mechanic to the game to play with the FOV, but it was too hard to make.\n\nP.S\nCatch it CROWBORN ! ;)\nhttps://pbs.twimg.com/media/CVbPb_5W4AEr_Fq.png:large",
                    "score": 19,
                    "author": "Guteks",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "What input did the dog have on the finished game?\n",
            "score": 57,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gustaw - he defended our hideout bravely, but he actually made sounds for the Mutated Dog enemy in the game!",
                    "score": 76,
                    "author": "Guteks",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do you have plans to make another game already? (not necesarily related to Darkwood).",
            "score": 15,
            "author": "velocifasor",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 34,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gustaw - unfortunately no, but we will use this idea for our next game which will be solely jump scare based.",
                    "score": 51,
                    "author": "Guteks",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tell us a story of how you started making first concepts and ideas about Darkwood. How did you met with each other?",
            "score": 16,
            "author": "ShadyS550",
            "replies": [
                {
                    "level": 1,
                    "comment": "Kuba - We met at the college. We were studying computer graphics/art. First concepts of darkwood started when Gustaw was making his firts steps in programming, we wanted to make our first quick game. It was somehing like tower defense/Home alone kind of thing. We were trying to do it in week or something like that... that thing evolved into DARKWOOD :smile: ",
                    "score": 47,
                    "author": "Guteks"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hate jumpscares too! Question is though, if given the extra funding and/or time, would you do it in VR? ",
            "score": 66,
            "author": "Heyello",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gustaw - Top-down in VR? That's a interesting proposition, we'll have to check it out ;)",
                    "score": 90,
                    "author": "Guteks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dota VR is predominantly top down.  It works okay.",
                            "score": 24,
                            "author": "IAmA_Kitty_AMA",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But that's still 3-d. This is a 2-d game.",
                                    "score": 30,
                                    "author": "wtfduud",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Such a game would be amazing, and easy to implement since you're using Unity. The bad news, however is that you probably made most of your objects out of 2D images, since it's top-down. To work well for VR, they would all need to be made into 3D objects. ",
                            "score": 17,
                            "author": "HantuDuppy",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Will you be launching to other platforms, like PS4 or possibly Switch?",
            "score": 13,
            "author": "ineffiable",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gustaw - we'd love to, but we can't confirm anything at this point.",
                    "score": 18,
                    "author": "Guteks",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you guys for doing this! I'm about to start college for computer science, and my ultimate goal is to go into game design for a living. I have so many questions! \n1) Where did you guys start? \n2) What language/program did you use to make your game? \n3) Are you guys completely self taught? \n4) How do I go about getting to the point where I can make something at the quality level of Darkwood? \nIt's my dream to be able to make a well-polished, thought out and enjoyable game, but I'm kind of lost as to where to even start.  ",
            "score": 14,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Are there any Plans for the Future like, DLC's or Free Updates to expand?",
            "score": 13,
            "author": "Cpt_n0rmal",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gustaw - At the time being, no. We have a huge list of stuff we wanted to implement, but did not have the time (or at least, we did not want to delay the game any further) to implement. Maybe a DLC, Darkwood 2, or something else entirely? Who knows. We will definitely try porting Darkwood to consoles though!",
                    "score": 41,
                    "author": "Guteks",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 11,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "How do you think the game will do without twitchers and YouTubers recording themselves and having over the top screamy reactions?",
            "score": 11,
            "author": "ThisLookInfectedToYa",
            "replies": []
        }
    ]
}