{
    "id": "eenred",
    "score": 43938,
    "title": "I am former NASA Mechanical Engineer turned YouTuber Mark Rober. I've been making videos for 9 years and just passed 10M subs. AMA!",
    "author": "_scienceftw_",
    "date": 1577122889.0,
    "url": "https://www.reddit.com/r/IAmA/comments/eenred",
    "media_urls": [
        "https://www.reddit.com/r/IAmA/comments/eenred/i_am_former_nasa_mechanical_engineer_turned/"
    ],
    "other_urls": [
        "https://www.dropbox.com/s/1c3coui7rzuhbtc/AMA%20Proof-%20Mark%20Rober.png?dl=0",
        "https://www.youtube.com/markrober",
        "https://www.reddit.com/r/videos/comments/a739zk/package_thief_vs_glitter_bomb_trap/",
        "https://www.reddit.com/r/videos/comments/78k522/carnival_scam_science_and_how_to_win/",
        "https://www.youtube.com/watch?v=lv8wqnk_TsA"
    ],
    "postText": "Hello, I'm Mark Rober.  I have a YouTube channel where I build stuff and come up with new ideas.  I recently cofounded #TeamTrees with Mr. Beast.  My passion is getting people (especially the young folk) stoked about Science and Engineering.  AMA!\n\nPROOF- https://www.dropbox.com/s/1c3coui7rzuhbtc/AMA%20Proof-%20Mark%20Rober.png?dl=0\n\nMy channel- https://www.youtube.com/markrober\n\nMy most popular videos on reddit were probably:\n1) Glitterbomb- https://www.reddit.com/r/videos/comments/a739zk/package_thief_vs_glitter_bomb_trap/\n2) Carnival Scam Science- https://www.reddit.com/r/videos/comments/78k522/carnival_scam_science_and_how_to_win/\n3) Courtesy Car Horn Honk- https://www.youtube.com/watch?v=lv8wqnk_TsA\n\ntl;dr of me: \n\n-I have a Masters in Mechanical Engineering. I worked at NASA for 9 years (7 of which were spent on the Curiosity Rover).  After that I worked for Apple for 4 years doing Product Design in their Special Projects Group (I just quit to do YouTube full time 6 months ago).\n\n-Some highlights for me this year were:\n  + Co-founded TeamTrees with Mr. Beast \n  + Went from 3M to 10M subscribers on YouTube and passed 1B views (I make 1 vid/month)\n  + Announced a show I'm making with Jimmy Kimmel that will air on Discovery where we prank people with cool contraptions that violate social norms\n\n\nEDIT- Ok. After 2 hours I'm gonna sign off for a bit! I will check back later and if there are any questions that have bubbled to the top I will try and address them. That was fun and different for me!! You guys are the best!",
    "comments": [
        {
            "level": 0,
            "comment": "Oh Hi Mark,\n\nDo you think you will go to space in your lifetime? What is the most important thing that needs to happen/improve for this?\n\nCongrats on 10 Mil! 😄",
            "score": 2110,
            "author": "Stevo2k-iwnl-",
            "replies": [
                {
                    "level": 1,
                    "comment": "For sure.  In fact it might happen this year :)  Hardest part will be getting clearance from the wife.",
                    "score": 2598,
                    "author": "_scienceftw_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I thought you would never say those words, its strange for me that a youtuber who doesn’t do as much work with NASA as he used to or compared to the others has a chance of going to space. One things for sure, your 2020 december vid has to be going to space! (If you do you going down in history!)",
                            "score": 476,
                            "author": "robigan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you told me ten years ago that YouTube was the way to become an astronaut, I probably would have had you committed ^^^/s ^^^^kinda",
                                    "score": 136,
                                    "author": "siccoblue",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You are going to space in less than a week?",
                            "score": 184,
                            "author": "Homespore",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "This year?!?!?!?! There's less then 3 weeks left in the year!",
                            "score": 14,
                            "author": "Morr5",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dude there's a week left.",
                                    "score": 14,
                                    "author": "Moekazool",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "1 week &lt; 3 weeks",
                                            "score": 17,
                                            "author": "TrashMobile",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How close are we to the first human landing on Mars?",
            "score": 2937,
            "author": "captaindp652",
            "replies": [
                {
                    "level": 1,
                    "comment": "They are definitely alive.  Not sure if they're in grade school or high school or already graduated.  I sure hope it's the latter.",
                    "score": 4588,
                    "author": "_scienceftw_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Plot twist: the first human on Mars will be a senior.",
                            "score": 1299,
                            "author": "TheBigLOL",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In High School or College?",
                                    "score": 527,
                                    "author": "AtWorkAndOnReddit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Citizen.",
                                            "score": 1320,
                                            "author": "almack9",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Service guarantees citizenship. Would you like to know more?",
                                                    "score": 185,
                                                    "author": "Waltmarkers",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Do you think it's important for us to put people on mars, if so why do you think so?",
                            "score": 90,
                            "author": "helderdude",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes. I covered that answer in good detail in this video. https://youtu.be/lARpY0nIQx0",
                                    "score": 72,
                                    "author": "_scienceftw_"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If something happened and YouTube wasn’t an option, would you keep doing these builds for fun? Also, what would you do for a living?",
            "score": 853,
            "author": "YeetThemBurrits",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm getting my teaching credentials!  My dream job is to teach High School Physics (part time and volunteer).",
                    "score": 1822,
                    "author": "_scienceftw_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lucky students.",
                            "score": 873,
                            "author": "helderdude",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don't worry...they won't appreciate it, lol.",
                                    "score": 437,
                                    "author": "Lone_Beagle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Are you kidding? They absolutely will, Mark will make it fun.",
                                            "score": 210,
                                            "author": "Benson9a",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Holy shit. This is my plan as well. I’m a successful engineer - I get paid very well but it’s not “fulfilling.” Hoping to save enough money to retire in my 40s and be an HS math, physics, computer science, etc teacher.",
                            "score": 142,
                            "author": "durbblurb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That was my high school physics teacher did. Worked as an engineer for 10-20 years or so and then became a teacher as he enjoyed it more. One of the best teachers I've ever had and a great guy in general.",
                                    "score": 66,
                                    "author": "WiFilip",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This really warms my heart.\n\nSome would say that you would be too overqualified to take on such a lowly job but I really think we need more people like you educating young people. There’s a stigma attached to teaching K-12 kids and I’m glad you’re here to help break it! :)",
                            "score": 44,
                            "author": "magmiy",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Start a online class",
                            "score": 57,
                            "author": "youraveragepotsmoker",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did you get any news from the guy who stole one of your glitter bombs?",
            "score": 2639,
            "author": "tomtompics",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes!  He finally started returning our calls and texts!  I would characterize his response as not very happy :)",
                    "score": 4923,
                    "author": "_scienceftw_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Karma's a bitch",
                            "score": 1309,
                            "author": "tomtompics",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Then you die.",
                                    "score": 297,
                                    "author": "xSociety",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not before regretting the time you were an absolute ass-hat and knowingly stole a glitter bomb package that was literally designed for people stealing packages.  And long before eating bananas taped to walls was a thing, so I sincerely doubt there was any artistic irony implied.",
                                            "score": 128,
                                            "author": "f_n_a_"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What did he say? Like did he return the box, did he agree it was dumb to do this to you of all people?",
                            "score": 608,
                            "author": "helderdude",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Belligerent.  Threatened legal action which is why I need to be sort of careful of what I write here.  I lawyered up pretty strong on this one so I feel really confident in my position all across the board.  The reason there were two reactions that weren't blurred was because we had signed releases from those people.  We didn't try or weren't able to obtain releases from the rest and I don't want to ruin their lives for a single bad decision without their consent.  Also gets more legally tricky unblurred and without a release because you open yourself up to some ambulance chasing type of lawyer who would track them down and encourage them file a lawsuit.",
                                    "score": 1556,
                                    "author": "_scienceftw_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Owhh I was wondering why some were not blurded so you talked with two of the \"victims\", can you talk a little about that was like, or was it only to sign the release?\n\nBTW I love what you do!",
                                            "score": 490,
                                            "author": "helderdude",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I showed the footage to Jimmy (Kimmel).  I give him sneak peeks of my videos on occasion and he always has really good input.  In this case, he said I really need to try and not have those faces blurred because their facial expressions are so great.  One of the producers from his show called them up and worked their magic so I had no interaction with them.  As a testament to how cool a human being he is, he was willing to get on the phone with the dudes himself and ask them if it came to that.  Luckily, it didn't.",
                                                    "score": 1396,
                                                    "author": "_scienceftw_",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "What was reason the 2 guys didn't want their faces blurred? Internet points? If i stole something I would not want people seeing my face.",
                                            "score": 70,
                                            "author": "carl2k1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Probably offered money",
                                                    "score": 116,
                                                    "author": "RainbowAssFucker",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Or a Bose headset",
                                                            "score": 85,
                                                            "author": "CommonWaveSounds"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "He stole something and claimed to be a victim. Lmao what.",
                                            "score": 57,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What's worse than the \"victim\" are the lawyers waiting to sweep up sleezy cases like this. \n\nIf it's not your property, don't freaking touch it.",
                                                    "score": 34,
                                                    "author": "Dynamic_Nomad",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Your response was some next level stuff. That’s why you have so many subscribers.",
                            "score": 53,
                            "author": "Slartibartfastthe3rd",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Did he tell you whether he started getting pestered by the scientologists yet? And how many of those cards did you send out? Lol",
                            "score": 204,
                            "author": "Rebuildingz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No comment on how many were sent. The uncertainty here and difficulty proving what was actually sent is the real charm. I know from his response it’s eating him up and he can’t exactly go ask all his neighbors if they received a post card with details on where/when he is supposed to meet his mail order bride :)",
                                    "score": 458,
                                    "author": "_scienceftw_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The Furry convention and financial contribution to Hillary Clinton would suspect as a larger worry to neighborly optics.",
                                            "score": 122,
                                            "author": "JeanLucTheCat",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He can show the video to his neighbors so that they know the video is fake, but then they’ll know he’s a thief.",
                    "score": 89,
                    "author": "TirelessGuardian",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "What made you switch over from NASA to Youtube?",
            "score": 1677,
            "author": "Proguy9094",
            "replies": [
                {
                    "level": 1,
                    "comment": "At the time it was a pretty easy decision.  I started a Halloween company based off my first ever YouTube video.  Sold it to some guys in the UK and they wanted me to come up with more ideas.  It may sound like a downgrade but it was a fun opportunity and a chance to see what it's like starting a business plus I knew I could always go back to NASA if it failed abysmally.   After doing that for 2 years I was offered a position at Apple to do really cool stuff so I took it.  My philosophy on career paths and life really is like crossing a river by jumping on stones.  Have a very rough general idea of your path but then look at the best stone and hop on it.  Only at that point will you really see the next available rocks and then wiggle them all with your foot and pick the best one.  This idea of a having a 20 year career plan or knowing exactly what you want to do with your life in high school is a fallacy and it stresses people out.  We think life paths are a straight line but they are always filled with twists and turns and mountains and valleys.  That's way more interesting anyways :)\n\n&amp;#x200B;\n\nEDIT- link to that Halloween video- [https://www.youtube.com/watch?v=qOQws77j\\_6c](https://www.youtube.com/watch?v=qOQws77j_6c)",
                    "score": 3408,
                    "author": "_scienceftw_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh hi Mark 👋🏼    \n   \nI’m afraid I don’t have a question but I wanted to say thank you so much for the content you put out. It’s genuinely all super interesting, and at any age too. Your videos provide me a really valuable escape from life. Well done on the 10M subs and the stuff you have in the pipeline now, it’s all completely deserved, and I get second hand excitement thinking about what you’re gonna do with these opportunities. Honestly mate, thank you for all the knowledge and for making life a little less drab!",
                            "score": 762,
                            "author": "doctor-greenbum",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks doc :)",
                                    "score": 509,
                                    "author": "_scienceftw_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you so much for replying. All the best, and merry Xmas. :)",
                                            "score": 96,
                                            "author": "doctor-greenbum",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; My philosophy on career paths and life really is like crossing a river by jumping on stones.  Have a very rough general idea of your path but then look at the best stone and hop on it.  Only at that point will you really see the next available rocks and then wiggle them all with your foot and pick the best one.  This idea of a having a 20 year career plan or knowing exactly what you want to do with your life in high school is a fallacy and it stresses people out.  We think life paths are a straight line but they are always filled with twists and turns and mountains and valleys.  That's way more interesting anyways :)\n\nAmazing. Saving this for future reference, thanks.",
                            "score": 136,
                            "author": "DeepHorse",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "This comment was really cool to read. Thanks, man. Also, I like how you casually dropped that NASA was your backup plan. That's a killer line, man. Proud of you.",
                            "score": 42,
                            "author": "VehaMeursault"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 14,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi Mark! \n\nAbout 4 years ago I reached out to you for advice before starting University, and you told me to study purely for the sake of learning - not for the sake of getting a good GPA. That advice stuck with me, and it was easier to follow for some classes than others. After years of doing my best to heed that advice, I was lucky enough to be offered a job working on Mars 2020 at NASA JPL! \nI believe studying for the sake of deep understanding played a strong role in getting this amazing opportunity.\n\nDo you have any advice for engineers about to enter the workforce? Are there common mistakes you see young engineers make that can easily be avoided?\n\nThank you!\n\nEdit: Thank you for my first Gold and Silver!",
            "score": 5285,
            "author": "McLovin_01-47-87441",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's so cool!!!!  Congrats!  I will be down there filming I think for a video this year.  They are flying the back-up Descent Stage from when I was there which means I have hardware going to Mars again!!!  What section are you in?",
                    "score": 3071,
                    "author": "_scienceftw_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm beyond excited! Thank you! I'm in a group working on simulation for the cruise stage. We will calculate the correction burns needed to reach the targeted point in the Martian atmosphere. Im not exactly sure what section that would be yet because i haven't been given a ton of information on the job. I start in May!",
                            "score": 1519,
                            "author": "McLovin_01-47-87441",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Stranger here: congrats!!",
                                    "score": 533,
                                    "author": "chodeboi",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you, kind stranger!",
                                            "score": 227,
                                            "author": "McLovin_01-47-87441",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's so cool! If you wouldn't mind, working at NASA is a dream of mine and I had some questions, if you're okay with that?",
                                                    "score": 62,
                                                    "author": "uno28",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'd love to answer any questions I can. Keep in mind I haven't actually started work at JPL. I'm still an engineering student and will begin this summer.",
                                                            "score": 62,
                                                            "author": "McLovin_01-47-87441",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah I understand! So my major is in physics focusing on astronomy right now. How did you go about applying to work at NASA? There's so much going on there... It's a lot to take in.",
                                                                    "score": 34,
                                                                    "author": "uno28",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "My University had a career fair in the fall where I spoke to a recruiter. I knew some people that had worked with the recruiter before, so I think that definitely played a role too. Putting yourself out there and making an effort to show interest in a company/org can go a long way",
                                                                            "score": 39,
                                                                            "author": "McLovin_01-47-87441",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "This! Also here's where social skills come into play. You can be a genius but if you're not a team player and/or not pleasant to work with, you're not getting an on-site interview. You have to look people in the eye and smile. When you meet a recruiter, they're judging every second to see if you're a good fit. Too many comp sci kids fail to understand and/or work on that.",
                                                                                    "score": 35,
                                                                                    "author": "abdhjops",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Can you help me with Kerbal Space Program?",
                                    "score": 218,
                                    "author": "liquidpig",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He's an engineer at NASA, not an ancient deity in possession of forbidden knowledge.",
                                            "score": 278,
                                            "author": "Neoptolemus85",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "m o r e t h r u s t e r s",
                                                    "score": 94,
                                                    "author": "_Adamanteus_",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Boosters and struts.",
                                                            "score": 37,
                                                            "author": "xjeeper",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You need some Scott Manley in your life.",
                                            "score": 17,
                                            "author": "dryclean_only"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Congrats that awesome",
                                    "score": 13,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm a mechanical engineer working with nuclear fuel design and by far the most beneficial thing you can do is listen to the seasoned veterans on the job but always ask questions as to why things are instead of just taking notes on it, especially if you don't understand. The engineering industry has a critical knowledge capture issue between generations and it's up to folks in your position to learn.",
                    "score": 202,
                    "author": "bukithd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's very helpful. I've seen this in action at past internships where the most important information for the job was passed down through 'tribal knowledge' rather than formal documentation.",
                            "score": 68,
                            "author": "McLovin_01-47-87441",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How often do you get noticed in public?",
            "score": 514,
            "author": "SunYourBunz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Depends on where I'm at.  Being in a place with a lot of people (e.g. sporting event) increases the chances as does certain parts of the country.  At this point it's maybe once a day.  I've noticed if I hold a camera it goes up about 10x and if I stop to take a pic with someone then people will look at you to see if they know you and it goes up a lot then too.",
                    "score": 806,
                    "author": "_scienceftw_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How do you feel about your (level) of fame, does it bother you, do you like it? Would you prefer if you could live anonymously?",
                            "score": 319,
                            "author": "helderdude",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Conflicted.  I never wanted that part.  At this level it is fine and I enjoy being able to something so simple as taking a picture with someone and making their day.  But I have deep empathy for people who are super famous and can't go out in public without constantly being barraged.  I could easily see how that would feel like a prison.",
                                    "score": 617,
                                    "author": "_scienceftw_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Was there ever a time it got in the way of your normal life or a really u comfortable thing that happend because you are famous?",
                                            "score": 175,
                                            "author": "helderdude",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My pharmacist, my doctor, the House cleaner are all examples of people that have recognized me where I would have preferred anonymity :/",
                                                    "score": 431,
                                                    "author": "_scienceftw_",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What led you to do partnership with MrBeast?",
            "score": 1373,
            "author": "VituzSvk",
            "replies": [
                {
                    "level": 1,
                    "comment": "We are friends.  Been talking about collabing since I did the lemon powered car video.  Once someone suggested we work together on this we just started talking about it and one thing led to another.",
                    "score": 1678,
                    "author": "_scienceftw_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How do I become friends with Mr Beast ? \n\nIn 2019 that seems to be the highest paying job a the moment lol\n\nedit: Not being a youtuber, just being friends with MrBeast seems to be an easy $100k-1 million per year income",
                            "score": 659,
                            "author": "Shenaniganz08",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hilariously enough, the top choice for future jobs with my students is they all want to be YouTube celebrities. I told them it may look like all fun and games, but it’s still a job and takes time and effort to put out quality videos!",
                                    "score": 290,
                                    "author": "ToastyXD",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Just to clarify I mean't just being friends with him, not being a youtuber. Seems anyone of his friends who is around him gets at least $100k and a car haha",
                                            "score": 194,
                                            "author": "Shenaniganz08",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Just be a toy review channel and spoil the shit out of your kids for views. Works for a lot of the stuff being put out on YouTube.",
                                            "score": 22,
                                            "author": "thatonedude2334",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi mark, what happened to the how ridiculous trampoline? Are you still working on it?",
            "score": 234,
            "author": "IAMKINGNOTYO",
            "replies": [
                {
                    "level": 1,
                    "comment": "February video most likely!",
                    "score": 262,
                    "author": "_scienceftw_",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Of all of your videos, which one was the most expensive to make?",
            "score": 1743,
            "author": "TotallyNotDalton",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably Jello Pool or maybe Glitterbomb 2.0.  We got a deal on the phones because they were used and refurbished from China at $100/per but it still adds up.",
                    "score": 2625,
                    "author": "_scienceftw_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Society needs to make jello pools more accessible for the average human",
                            "score": 1854,
                            "author": "Worldly_Jellyfish",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "yes, this is all very necessary",
                                    "score": 203,
                                    "author": "hell_haven",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The two Glitterbomb videos are, in my opinion, the best videos on your channel. Great job and keep it up!",
                            "score": 144,
                            "author": "etnguyen03",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What job did you like more and was more interesing to work at, Apple  or NASA?",
            "score": 639,
            "author": "drejkkk",
            "replies": [
                {
                    "level": 1,
                    "comment": "NASA is cool because it's freaking space and I'm designing stuff for another planet.  Apple was cool because you have more freedom and bigger budgets to try crazy things.  Less red tape to deal with.",
                    "score": 1053,
                    "author": "_scienceftw_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wait Apple gives a bigger budget than NASA?",
                            "score": 346,
                            "author": "MineBlox2007",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Apple has a more accessible budget to the lay engineer.  For example, if I wanted a piece of test equipment at NASA that cost $100k it could take months and lots of approvals. At Apple, it would take just a single email.",
                                    "score": 441,
                                    "author": "_scienceftw_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;At Apple, it would take just a single email.\n\nWow...",
                                            "score": 157,
                                            "author": "ARCS8844",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It shows how respected and in a good position mark was at Apple. He says this like anyone could do that but he probably was privileged to have it",
                                                    "score": 88,
                                                    "author": "Imverycoolandcalm",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm sure he was well respected but I could buy a piece of equipment at my company for $5k with one email and we were 30 people. $100k to Apple is a meeting.",
                                                            "score": 53,
                                                            "author": "adisharr",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "NASA gets less than 0.5% of the national budget which is usually around 20+ billion / year. Apple’s annual revenue is 10 times that",
                                    "score": 539,
                                    "author": "joe7L",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah *some* guy made a video about nasas funding but i cant seem to find his yt channel anymore",
                                            "score": 166,
                                            "author": "OwOmaltine",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Think his was Marc Roberts.",
                                                    "score": 92,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Rob Markers",
                                                            "score": 50,
                                                            "author": "Gothamtonian",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The latest tax cuts for apple leaves them with an extra $47 billion/year. NASA only gets $20 billion/year.",
                                    "score": 80,
                                    "author": "Fireflykid1",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you were given an unlimited budget for a video, what invention would you make and for what purpose?",
            "score": 746,
            "author": "jj_is_the_name",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean that self driving and drifting Deloran was pretty cool...",
                    "score": 1145,
                    "author": "_scienceftw_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe some collaboration with George Hotz?",
                            "score": 106,
                            "author": "402_payment_required",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fully *unlimited* budget? Why not start with fusion reactors and A.I.?",
                    "score": 50,
                    "author": "Downvotes_dumbasses",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "What was your first project that really kickstarted your enjoyment for engineering?",
            "score": 1122,
            "author": "RedPanda8732",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe the different projects you do in high school physics (egg drop, toothpick bridge, boat race, etc.).  I love approaching a problem and the brainstorming part at the beginning and trying to get really clever on the best approach.  The more out of the box and simple the better :)",
                    "score": 1305,
                    "author": "_scienceftw_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 182,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I live in Belgium and at our school we didn't do anything of this stuff. I think it might be a more american thing because nowhere really in Belgium we do this that i'm aware of. Our school was very theory oriented tho.",
                            "score": 53,
                            "author": "SupremeLeader_64",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The egg drop was one of the few class projects I fondly remember. About 7th grade here in the US.",
                                    "score": 17,
                                    "author": "Katarzzle"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Will you ever do another fundraiser like #teamtrees but with another topic? (Like cleaning the ocean, trying to stop wildfires, etc.)?",
            "score": 320,
            "author": "avery_ingram",
            "replies": [
                {
                    "level": 1,
                    "comment": "Stay tuned.  Two cool things I will be doing in the coming year.",
                    "score": 485,
                    "author": "_scienceftw_",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi mark Im a huge fan! So since you do a video every month, How far ahead do you plan for each project? And how many do you already have planned right now?",
            "score": 159,
            "author": "FortniteMasterKid",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have all my videos for 2020 planned out :)  They are all at varying stages in builds and planning.",
                    "score": 280,
                    "author": "_scienceftw_",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey Mark, I plan on going into engineering. Electrical/mechanical. I was wondering, do you believe your master's degree prepared you for your employment? \n\nI am also a big fan of yours, my favorite video was \"200 dropped wallets\".",
            "score": 148,
            "author": "It_Tyler",
            "replies": [
                {
                    "level": 1,
                    "comment": "I got my masters degree after working industry for awhile.  For me that was the better path.  I cared more and knew the things I was most interested in after working in the field for a bit.",
                    "score": 201,
                    "author": "_scienceftw_",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey Mark, I love all your vids! I know you created the initial Glitter Bomb video because the police couldn't/wouldn't do anything about the package you had stolen (even though you had video of the thief). What do you think can be done to actually start preventing these thefts from occurring (or at least catching some of the people who are stealing my damn packages)?",
            "score": 139,
            "author": "Hamcow",
            "replies": [
                {
                    "level": 1,
                    "comment": "What I've been proposing to do is having a  storage chest  for patio furniture cushions   (or something like it) bolted to your porch and an unlocked padlock. Having the delivery man place your delivery in the chest and lock it.\n\nIf I were living in America where this is a problem I would definitely start a business that would sell more specialised chests/boxes for this purpose",
                    "score": 71,
                    "author": "Werkstadt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Honestly at my last house I just kept a big Rubbermaid container on my porch, not bolted down or anything and it basically solved the problem. Most thieves won't go into your yard unless they can actually see the package",
                            "score": 18,
                            "author": "Houndie"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 644,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "My March 2020 video I've been working on with a team of Stanford students for 8 months.  It will take the cake even above the auto bullseye dartboard.  They are all hard for different reasons.  The Glitterbomb is so tricky because it needs to be robust and work in so many different situations.  You'll noticed the lady that stole the package after covering herself up didn't have a reaction.  That's because the weather was slightly colder and the box malfunctioned.  GPS still worked so we found it in the dumpster next to her apartment (we recovered probably 90% of the boxes and they were always in the closest dumpster... fart spray ftw).  At NASA and Apple the problems were much harder but you also have massive teams working on them so one person's job is always doable.",
                    "score": 907,
                    "author": "_scienceftw_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is this video related to the self driving Delorean?",
                            "score": 233,
                            "author": "PinkyWrinkle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol.  no.  But there are some cross-over elements.",
                                    "score": 338,
                                    "author": "_scienceftw_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Honda Elements?",
                                            "score": 56,
                                            "author": "ranhalt",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hello good sir,\n\nWhat is your favorite tool that you have in your workshop?\n\nMike",
            "score": 616,
            "author": "PensandJags",
            "replies": [
                {
                    "level": 1,
                    "comment": "Elon Musk Flamethrower.  And that absolutely qualifies as a tool.",
                    "score": 1115,
                    "author": "_scienceftw_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\\*Not A Flamethrower\n\nApparently shipping flamethrowers is illegal so they had to change the name to 'Not a Flamethrower'",
                            "score": 436,
                            "author": "Tao_McCawley",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Time to sell \"not a drug\"",
                                    "score": 333,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Research chems in a nutshell",
                                            "score": 101,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "No, its called not a flame thrower, because it isn't a flame thrower. Its a butane torch",
                                    "score": 74,
                                    "author": "Stoyfan",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "And the fact that it's a roofing torch with a shell on it also makes it not a flame thrower",
                                    "score": 36,
                                    "author": "cameronbates1"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi Mark! \n\nFor glitterbomb 3.0, can I suggest a high power fan at the base so that it flies everywhere instead of just a concentrated area? The fart spray will also spread further too lol. \n\nLove what you’re doing! \n\nThanks Mark!",
            "score": 354,
            "author": "Zaboomafookaloo",
            "replies": [
                {
                    "level": 1,
                    "comment": "One reason some people didn't smell the fart spray was because the motor was spinning slower at first and it wasn't atomizing the spray and making it float in the air.  We fixed that for the reactions you see where they actually smell it.  Having said that, next year I will double it again.  My goal is to not have a single person NOT comment on the smell!",
                    "score": 608,
                    "author": "_scienceftw_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Owhh so 3.0 is coming, for sure? \n\nAre you not worried people wil have seen your video and will just open the box and sell the phones and still end up making a profit?",
                            "score": 173,
                            "author": "helderdude",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think that the fact that they are doing it quickly is the reason why it is not caught ahead of time. People are so excited to open up their ill-gotten items, and don't bother to take a closer look... Well until they are sprayed with glitter.",
                                    "score": 13,
                                    "author": "BusDriver2Hell",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "One word if you’re serious about smell: Mercaptan.",
                            "score": 66,
                            "author": "Bubbafett33",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "After a quick google search I found this: https://en.wikipedia.org/wiki/Thioacetone#Odor\n\n&gt; \n&gt; Thioacetone has an intensely foul odor. Like many low molecular weight organosulfur compounds, the smell is potent and can be detected even when highly diluted.[6] In 1889, an attempt to distill the chemical in the German city of Freiburg was followed by cases of vomiting, nausea and unconsciousness in an area with a radius of 0.75 kilometres (0.47 mi) around the laboratory due to the smell.[7] British chemists at the Whitehall Soap Works in Leeds noted in an 1890 report that dilution seemed to make the smell worse and described the smell as \"fearful\".[8] Thioacetone is considered a dangerous chemical due to its extremely foul odor and ability to render people unconscious, induce vomiting, and be detected over long distances.",
                                    "score": 14,
                                    "author": "TiagoTiagoT",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you had to prove a flat earther wrong with just a couple of statements how would you do it?",
            "score": 411,
            "author": "Infinite-Baker",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ugghhgh.   \\*sighs\\*  \\*thinks for a bit\\* This whole premise is flawed.  As they say, \"You Cannot Reason People Out of Something They Were Not Reasoned Into\".  I think the psychology of conspiracy theorists is fascinating.  I think generally they are people who weren't the smartest in their class growing up.  This gives them the \"secret knowledge\".  They have a leg up on the sheeple.  Then a community forms and now they have an identity and friends.  There is just no incentive for them to look at it objectively.  Confirmation bias runs strong. If they agree the Earth is round then they lose all their friends and go back to being the not smart ones.  They don't receive a hero's welcome from us either.  We're like \"it's about time idiot\".   It's just misaligned incentives.  If it wasn't flat earth it would be something else.  Don't despair if you feel people are getting stupider they're just getting better at sharing it.",
                    "score": 1383,
                    "author": "_scienceftw_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know a flat earther, she is always on about how aware she is of the big conspiracy. \nOne evening I was out with my kids who had questions. I noticed that the sun was over the horizon and the sky was still lit up fairly well. There was quite a bit of light hitting the BOTTOMS of the clouds but none on top.\nMy children were able to reason why the sun would be hitting the bottom of the clouds and how this was not possible if the earth was flat and the sun above the clouds.",
                            "score": 358,
                            "author": "zadokmahir",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Aww man that must have felt pretty great, seeing your kids reason like that. I would go all destin and freak out.",
                                    "score": 214,
                                    "author": "helderdude",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; go all destin \n\nI hope this becomes a common saying. Destin is so cool.",
                                            "score": 117,
                                            "author": "that_one_fella",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "**SNATCH BLOCK!**",
                                                    "score": 122,
                                                    "author": "helderdude",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "**LAMINAR FLOW!**",
                                                            "score": 74,
                                                            "author": "Maktube",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "# SPACE ROCKS!",
                                                                    "score": 48,
                                                                    "author": "Madddux23",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; don't despair if you feel people are getting stupider they're just getting better at sharing it\n\nI don't know if you came up with that, but that's a brilliant way to put it.",
                            "score": 43,
                            "author": "helderdude",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do grades really matter at school?",
            "score": 212,
            "author": "hey_im_cucumber_guy",
            "replies": [
                {
                    "level": 1,
                    "comment": "For your first job, yes.  For the rest of your career, no.",
                    "score": 612,
                    "author": "_scienceftw_",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Am I allowed to say I love you platonically?",
            "score": 659,
            "author": "RacingboomThePleb",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes",
                    "score": 627,
                    "author": "_scienceftw_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I love you platonically.",
                            "score": 662,
                            "author": "RacingboomThePleb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is the most efficient conversation.",
                                    "score": 144,
                                    "author": "bucketzzz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes",
                                            "score": 55,
                                            "author": "RacingboomThePleb"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi Mark,\nI am an computer engineering student in my 4th year at university. While I still very much enjoy my field of study, I find myself suffering from burnout because of the grind. Do you find yourself getting burned out from time to time? If so, how do you deal with it?\n\nAlso, any more colabs with Destin planned soon?",
            "score": 420,
            "author": "wysmyster",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel strongly about burnout.  I can't speak to your situation but I will speak to mine and hopefully there is some nugget that will translate for you.  I feel like YouTubers feel this pressure that as soon as they see some sort of success they need to scale up.  Hire a team, do merch, write a book, start releasing 4 vids/week, start a podcast, etc.  It's the equivalent of turning up the speed on a treadmill.  At first it's exciting and you're killin it but the problem is that the dopamine wears off (that's a feature not a bug of human evolution to keep us striving for more) but you're stuck on a treadmill at a sprinter's pace.  That to me is the definition of burnout.  It's the same input but you're not getting the same output you used to.  I have done 1vid/month for 9 years.  I JUST hired my first full time employee a few months ago.  I still do all my own editing because I like it!  Why would I outsource that?!  I've just really tried to keep my treadmill at a jogging pace and keep the video quality high and as a result I've never felt burnt out yet.  There's a great story about this concept- [https://bemorewithless.com/the-story-of-the-mexican-fisherman/](https://bemorewithless.com/the-story-of-the-mexican-fisherman/)",
                    "score": 813,
                    "author": "_scienceftw_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You edit your own videos?! That’s amazing! I based my video where I documented my grades Washington DC trip and I tried to use some of your styles of editing! What editing software do you use? Video link: https://youtu.be/QcylEyyT8Xg",
                            "score": 300,
                            "author": "Jackfrost0714",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dude, that was great. You have a talent for that. Keep making stuff. I use première pro but it doesn’t really matter. I could make my same videos in iMovie.",
                                    "score": 343,
                                    "author": "_scienceftw_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Giving his channel the Rober Bump. Good looking out, Mark.",
                                            "score": 65,
                                            "author": "notanobelisk"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Cgpgrey is another YouTuber that comes to mind that is like this. Very infrequent posts that are the highest quality. Love it!",
                            "score": 38,
                            "author": "ep3ep3",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You told a bunch of us to email you a while ago on Twitter, what happened with that?",
            "score": 83,
            "author": "gooddumbdog",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol.  I did?  About what?",
                    "score": 76,
                    "author": "_scienceftw_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, you created a new account and told people to email you, here’s the tweet: [Image](https://imgur.com/a/NYxCjbh)",
                            "score": 56,
                            "author": "gooddumbdog",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh.  Haha!  Um, that was sort of a joke cause it was AOL. I never really checked... sorry.  Joke was on me though cause I had to use my phone number to do it and immediately after I started getting tons of spam calls.",
                                    "score": 151,
                                    "author": "_scienceftw_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But you used the [serious] tag! You monster! That's a serious tag for serious things!",
                                            "score": 46,
                                            "author": "vipchicken"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi mark, \n\nWhat do you most regret?",
            "score": 72,
            "author": "IAMKINGNOTYO",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not having a better answer for this question...",
                    "score": 186,
                    "author": "_scienceftw_",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hi Mark, I love your videos! Do you think you will ever have time to make more than 1 a month?",
            "score": 298,
            "author": "Yolo1212123",
            "replies": [
                {
                    "level": 1,
                    "comment": "I will never do that.  See my post above on burnout.  I want them to feel special and to keep the quality high.",
                    "score": 673,
                    "author": "_scienceftw_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For those curious he is talking about [this](https://www.reddit.com/r/IAmA/comments/eenred/i_am_former_nasa_mechanical_engineer_turned/fbv6maj?utm_medium=android_app&amp;utm_source=share)",
                            "score": 144,
                            "author": "helderdude",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks",
                                    "score": 16,
                                    "author": "Jackfrost0714"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "His 1 video a month makes them golden. I love that he is patient and takes his time.",
                    "score": 29,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey Mark,\n\nI've come across a video of yours here and there over the years but recently have decided to binge your channel. Only regret is that I didn't start sooner. \n\nFrom my perspective, you are a role model, kind-hearted, wholesome, successful, smart, accomplished (I mean how is coolest uncle quest not complete yet?), and many other positive attributes. It seems like you've got a good handle on this thing called \"life.\" As someone who is struggling with life, I wonder, are there any hardships you've had to overcome in life that you wouldn't mind sharing?",
            "score": 122,
            "author": "ibsnuggs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you. My only kid has Autism. My April video will talk all about that.",
                    "score": 237,
                    "author": "_scienceftw_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm sure that video will help many people. Thank you for being a beacon to us.",
                            "score": 36,
                            "author": "ibsnuggs"
                        },
                        {
                            "level": 2,
                            "comment": "Mark, my son has autism and he loves to watch your videos over and over, he even recites them verbatim when not watching them. He really likes your “red pool” and “water balls” videos, likely for the sensory input. I read somewhere previously that your son also has autism so I am eager to watch April video. Keep up the inspiring work, you’re making a difference.",
                            "score": 37,
                            "author": "gDGBD"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hello mark.\nHow did you decided to start youtube?\nAnd did you guys really believed from the start that #TeamTrees would reach the 20M goal? Cause many seemed skeptical about it!\n\nBig fan.\n\nHappy holidays!",
            "score": 161,
            "author": "lcspe",
            "replies": [
                {
                    "level": 1,
                    "comment": "Start of YouTube was just me posting my Halloween costume online and it accidentally went viral.  With #TeamTrees I had no idea.  I either thought we were going to raise $100M in the first weekend or we would never break $1M.  To be able to raise the full amount right at the end was the best case scenario.  It was such a group effort from so many YouTubers and people who just really latched on to it and it was really special to be part of it and watch it unfold.  It was a lot of work but one of the things I think I will look back on and be proud of for being a part of (as I hope everyone feels who joined).",
                    "score": 258,
                    "author": "_scienceftw_",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why do you write the date in an ambiguous format?",
            "score": 105,
            "author": "minijack2",
            "replies": [
                {
                    "level": 1,
                    "comment": "MERICA!!!!",
                    "score": 159,
                    "author": "_scienceftw_",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey mark,\n\nJust wanted to say how great your videos and also do you have any funny stories from your time at NASA?",
            "score": 51,
            "author": "chip57794",
            "replies": [
                {
                    "level": 1,
                    "comment": "I rigged a rat trap to notify us using LEDs when we caught a rat in the floor before it started smelling really bad after a few days.",
                    "score": 111,
                    "author": "_scienceftw_",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey mark, Ive been a fan for a while. My question is do you think we can get a day in the life of Mark Rober? Thanks and have a great day.",
            "score": 91,
            "author": "shnarnarbnarnar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unlikely :) don’t take this the wrong way but there are parts of my life I want to keep private. I never put my wife or son in videos. I post to other socials but it’s once or twice a week and it’s high level stuff and not details of my daily life. I feel like for it’s it’s just healthier this way.",
                    "score": 175,
                    "author": "_scienceftw_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I completely understand. Thanks for taking time out of your day to reply to me. Have a happy and safe holiday! : )",
                            "score": 21,
                            "author": "shnarnarbnarnar"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "hi mark!\n\nif you remember your carnival games video, how long did it take you to compile all the data?",
            "score": 43,
            "author": "initialddriver",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think we said it in a video but if I recall we just went down there for a day.",
                    "score": 59,
                    "author": "_scienceftw_",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks for all of your brilliant contributions to the Maker and Scientific communities! What does your /actual/ workshop look like? The tools on your bench always look too new and orderly!",
            "score": 105,
            "author": "Robot_Beep_Boop",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol.  I clean them up before I film!  Also, I just got sent a bunch of new tools from Carlyle!",
                    "score": 124,
                    "author": "_scienceftw_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Holy freaking cow! My daughter and I literally just stumbled on your glitter bomb video on youtube like an hour ago!\n\nMy daughter wanted me to ask, what is the best Christmas present you've ever gotten?",
            "score": 69,
            "author": "Trixy975",
            "replies": [
                {
                    "level": 1,
                    "comment": "Welcome! Best present ever? 20M trees and 10 M subs!",
                    "score": 166,
                    "author": "_scienceftw_",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "What tip and tricks would you recommend for a student to get into the space industry?",
            "score": 59,
            "author": "sSs_Boi_sSs",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm not Mark but I'm a relatively new mechanical engineer at NASA so I can chime in here a bit. In my opinion, the most important thing is to be able to show how passionate you are about space and the space industry! If there's an astronomy club at your school, get involved with it, if you're doing projects in school and you can, make them related to space/the space industry! If you can get involved with NASA or some other company/organization in the space industry via an internship or volunteering or just go to events that they have. Being able to show your engagement with the industry before getting a job in it, especially if it relates to what you want to do, will help show companies that you are passionate about working in the industry.",
                    "score": 71,
                    "author": "mellophenomenal",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey Mark, you are truly an inspiration for me. Your passion for science is really uplifting and motivational to me and many others in so many ways. I'm currently pursuing my bachelor in Computer Science and Engineering. I've always found a desire within myself to stay inclined to scientific arenas wherever I may decide to go with my career.\nMy question to you is, do you think I can make it into space and research following the stream I'm currently in? It has always been a dream but I'm clueless for the opportunities, or lack of, out there.\nYour reply would mean the world to me.. thanks a lot.",
            "score": 23,
            "author": "unburnt_star"
        },
        {
            "level": 0,
            "comment": "Hi Mark, Where do you store all the crazy huge stuff that you make?",
            "score": 55,
            "author": "Chax_A1",
            "replies": [
                {
                    "level": 1,
                    "comment": "DO NOT attempt stealing this guy's stuff. Just trust me.",
                    "score": 68,
                    "author": "bananatomorrow",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ever went through a time where you had depression? If yes, can you give some advice?",
            "score": 50,
            "author": "MineBlox2007",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not really. Sorry man. I have people really close to me who do though and it sucks. Like constantly trudging uphill while others coast. Advice- Get professional help the same way you would if you had a broken arm. Brains are weird. It’s not your fault. I’m happy mental health is becoming less and less stigmatized.",
                    "score": 188,
                    "author": "_scienceftw_",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 63,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I will upload at least one episode so people can taste a sample.  YouTube is still my first love so I plan on still making my monthly videos.",
                    "score": 92,
                    "author": "_scienceftw_",
                    "replies": []
                }
            ]
        }
    ]
}