{
    "id": "142p0ws",
    "score": 11,
    "title": "Living as a ghost",
    "author": "whsiduwn",
    "date": 1686076153.0,
    "url": "https://www.reddit.com/r/lonely/comments/142p0ws",
    "media_urls": [],
    "other_urls": [],
    "postText": "For almost all my life I’ve been like a ghost, lurking around in the background, never in the spotlight and never being truly alive. \n\nI’ve got basically no life experiences worth mentioning, no achievements whatsoever, I’ve never had a romantic relationship (mostly because I’m invisible to most people since I very rarely leave the house and when I do it’s usually to haunt the streets at night like some lost spirit) and I’ve had no true friendships except for one, and even that relationship is very dysfunctional. \n\nI exist, and have existed for years, as some corpse that barely moves, hardly coming out of my room, I really might as well be dead since there’s no kinetic energy, no growth, no vitality in my life. Nothing ever happens. \n\nI don’t know how to resurrect myself, I’d need to start going out more I know that, and meeting people… but it’s not so easy… I live in a shithole, a brain-drain where all the successful people leave as soon as they get the chance, leaving behind only losers like me. I dread the thought that the rest of my life could be spent stalking the streets of my dead little town…\n\nMaybe some of you can relate?",
    "comments": [
        {
            "level": 0,
            "comment": "In my early stages in my life I have lots of ‘friends’ which we hangout. I’m there but I felt like I wasn’t so most of the time I ended going home early without telling anyone , just walked off. Nowadays I feel like a robot just go to work and get home asap . Maybe the occasional meet up my friends and talk about life. Other than that I would rather stay at home or sometimes just go to a cafe or a walk with my earbuds in.",
            "score": 4,
            "author": "Signal-Project1131"
        },
        {
            "level": 0,
            "comment": "I've become so isolated and too socially retarded to ever get out of my shell successfully",
            "score": 2,
            "author": "kramerjam36"
        },
        {
            "level": 0,
            "comment": "Generally no one looks for me unless they want something",
            "score": 2,
            "author": "Affectionate_Stop_37"
        },
        {
            "level": 0,
            "comment": "Same. Even when im with people i feel like an outsider and like im not needed since they could hang out without me too since i dobt contribute much not because i dont want to but because i just dont have anything to say.",
            "score": 2,
            "author": "Mat_is_Best"
        },
        {
            "level": 0,
            "comment": "Armor For Sleep - What To Do When You’re Dead\n\nIt’s a concept album I really related to back at the start of 2018 about this guy’s new life as a ghost, his regrets, and grief. Anyway, music can help one feel less alone. Try and find an album you can relate to during this season of your life.",
            "score": 2,
            "author": "tomorrow93"
        },
        {
            "level": 0,
            "comment": "I relate to this so much, no true friends, never been in a romantic relationship. Not being able to talk to someone really does something to you.",
            "score": 2,
            "author": "User8q7782993"
        },
        {
            "level": 0,
            "comment": "This is very INFP behavior. I am one myself. We are so good at being invisible but hate being overlooked.",
            "score": 2,
            "author": "omfgroxy"
        },
        {
            "level": 0,
            "comment": "Seeing everyone leave and move their social status, affects self-esteem which makes you isolate even more. You find yourself surrounded by people who weren't even able to finish high school, addicted to alcohol or drugs.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Wow. I feel invisible as well. My son erased me. My family abandoned me due to my depression. All my friends left. Lost my high school friend of 38 yrs and just last week another friend of 17 yrs. I didn't do anything to cause this. I'm not depressed, just numb. I don't celebrate holidays. No one calls.  W I used to be so social! Now I'm just broken loser. Tried everything to get friend s but I am toxic. Everybody runs away. I need a nice pet. I avoid looking at people in my gym. That's the only place I go..",
            "score": 1,
            "author": "MinuteOver8182"
        },
        {
            "level": 0,
            "comment": "i even ever get called ghost by my peers so...",
            "score": 1,
            "author": "afi28"
        }
    ]
}