{
    "id": "142sy1j",
    "score": 233,
    "title": "I'm so touch deprived its affecting my mental health",
    "author": "maua_mii",
    "date": 1686084860.0,
    "url": "https://www.reddit.com/r/lonely/comments/142sy1j",
    "media_urls": [],
    "other_urls": [],
    "postText": "just one of those nights, very skin hungry, thinking how Its been years since I had any physical contact from someone who actually loves and cares for me and intentionally wants to hold me, just a hug. it gets so hard sometimes that I convince myself that I probably don't deserve it. \n\nI'm turning 23 in a few days and I broke down thinking of how I still have a couple more years or even a lifetime of this.. I'm struggling.",
    "comments": [
        {
            "level": 0,
            "comment": "It's a horrible feeling, not being touched.",
            "score": 62,
            "author": "Traditional_Pick287",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes.",
                    "score": 7,
                    "author": "arkhamnaut"
                },
                {
                    "level": 1,
                    "comment": "It's like being removed from the world, from life even.",
                    "score": 5,
                    "author": "OwlCoat"
                },
                {
                    "level": 1,
                    "comment": "It's even worse when you are around a spouse that doesn't show any affection.  Constant reminder that no one cares enough about you and goes a little further by having someone outright rejecting you every single day. \n\nIt is rough. Every once in a while, I will get a massage solely to help me feel less lonely.. but it gets expensive fast. \n\nGood luck. I hope you find someone soon.",
                    "score": 3,
                    "author": "AnrianDayin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I big time get it. Best thing I  have found is a body pillow for sleeping with my arm around it. I have recently lost my spouse and that is my band aid.",
            "score": 40,
            "author": "Mushbeeguy",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m very sorry for your loss, if that’s worth much of anything coming from an Internet stranger.",
                    "score": 16,
                    "author": "Fluffy-Instance-1397",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Of course it does! We all have value, and I respect you for yours. What you say and do matters.\n\nThank you!",
                            "score": 13,
                            "author": "Mushbeeguy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Body pillow and weighted blanket, seems to be the best thing",
                    "score": 7,
                    "author": "arkhamnaut"
                },
                {
                    "level": 1,
                    "comment": "I recommend this too. It's helpful.",
                    "score": 5,
                    "author": "shiverypeaks"
                },
                {
                    "level": 1,
                    "comment": "I’m so sorry for your loss. Sending you lots of good vibes and a hug. Don’t hesitate to reach out if you need anything either.",
                    "score": 3,
                    "author": "BackgroundContest579"
                },
                {
                    "level": 1,
                    "comment": "Does it have to have a scantily clad anime maiden printed on it?",
                    "score": 1,
                    "author": "Ship_Adrift"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sometimes I think that if I could just have one solid/genuine hug once a week, a lot of my problems would be solved.",
            "score": 50,
            "author": "skellingtonrice",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same",
                    "score": 3,
                    "author": "HoplaMoy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“Skin hungry” “deprived” I love how you express that but I’m sorry about how you’re feeling. I’ve read so many books describing these feelings almost romanticizing loneliness, but feeling like you don’t even deserve human touch and love is hard and I’m feeling the same way. \n\nBut we all do deserve kindness, I understand it’s hard trying to open up and hug someone or ask to be hugged. Maybe start small, appreciate kind words, sympathetic looks and smile at people and see if they smile back. \n\nKeep your hope and patience, we can do this 🫶",
            "score": 14,
            "author": "No-Boat-5859"
        },
        {
            "level": 0,
            "comment": "im 28 and it gets worse and sucks. Waking up already in a sad mood wanting to be held. But nobody in bed. Or when u have a bad day being held  saying its going to be ok. Never having a relationship in all my life. So u lay there in bed alone waiting for the day to end only to suffer tomorrow",
            "score": 12,
            "author": "Renton79"
        },
        {
            "level": 0,
            "comment": "Affection is key to my mental health!!",
            "score": 10,
            "author": "ifonlyYRUso",
            "replies": [
                {
                    "level": 1,
                    "comment": "Humans are social beings and need that physical connection",
                    "score": 3,
                    "author": "maua_mii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can relate to you very well. I forgot what a hug feels like. I don't remember what a kiss feels like. Some people say it feels \"wonderful and soft\" I can't relate. I see see it on TV and it think that's interesting in a scientific way.",
            "score": 8,
            "author": "FeedtheFrog"
        },
        {
            "level": 0,
            "comment": "The world doesn't deserve us",
            "score": 5,
            "author": "JB-Blue_Master55555"
        },
        {
            "level": 0,
            "comment": "i know exactly how you’re feeling, i crave that intimacy so much it hurts sometimes",
            "score": 4,
            "author": "AthenaAssassin"
        },
        {
            "level": 0,
            "comment": "I’m 23 and I feel a very similar way.. It’s crushing. The loneliness and lack of touch becomes painful. Going to sleep each night and thinking about how many more nights like this I have to endure makes everything seem impossible. And I used to think money would solve my problems…",
            "score": 4,
            "author": "hugeshithead"
        },
        {
            "level": 0,
            "comment": "We're all touch deprived, because we are all lonely, we have no friends, nobody knows who we are, nobody cares about us. We are simply nobodies.",
            "score": 5,
            "author": "bluecew"
        },
        {
            "level": 0,
            "comment": "Only 23, and think your touch deprived huh.  Good luck.  It gets worse.😢",
            "score": 14,
            "author": "No-Worldliness9475",
            "replies": [
                {
                    "level": 1,
                    "comment": "It does...",
                    "score": 3,
                    "author": "X_Fredex_X"
                },
                {
                    "level": 1,
                    "comment": "Yeah, OP is young",
                    "score": 3,
                    "author": "arkhamnaut"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cuddle buddies should be a thing. No sex, just hugs and being near someone.",
            "score": 7,
            "author": "Phaile86",
            "replies": [
                {
                    "level": 1,
                    "comment": "100%. I don't understand why it's so normalised in society that only romantic couples have physical contact. While most friendships have short hugs at the most. Meanwhile all single people are touch starved for NO reason",
                    "score": 3,
                    "author": "HoplaMoy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It really is strange. I am an extremely affectionate person and i love cuddling and hugging and just being close to people. Doesn't mean I have feelings for someone...I just don't see affection as something weird.",
                            "score": 2,
                            "author": "Phaile86"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "YES PLEASE",
                    "score": 2,
                    "author": "tdk1910"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Same here… I hope things change soon.",
            "score": 3,
            "author": "Ambitious-Steak-1209",
            "replies": [
                {
                    "level": 1,
                    "comment": "I still have a little bit of hope",
                    "score": 4,
                    "author": "maua_mii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m 24. I used to get upset with myself about it. Eventually, I became numb to it all. My heart is calloused and I’ve convinced myself that it’s better to let go of everything than to care about material validations such as these. Love yourself first.",
            "score": 3,
            "author": "Dee_Dubya_IV"
        },
        {
            "level": 0,
            "comment": "Have you thought of going for a massage?\n\nI do believe there are professional cuddlers for hire as well.\n\nI can offer you a snug internet hug from a hugger, I’m sorry you don’t get hugs op.\n\nEdit: a word",
            "score": 2,
            "author": "chocolatewafflecone"
        },
        {
            "level": 0,
            "comment": "Yeah being touch starved is a real thing that can have profound effects on mental health. I'm in the same boat. I'm not sure where you live but you can look up \"cuddle parties\", they have them in most big cities in the west and you pay like 20 dollars to go to one where people can experience platonic physical touch with other partygoers. It's non sexual with a moderator so you don't have to worry about creeps",
            "score": 2,
            "author": "HoplaMoy",
            "replies": [
                {
                    "level": 1,
                    "comment": "That sounds okay but I guess for me the sort of hug I'm craving is from someone who I already have some sort of connection with yk",
                    "score": 1,
                    "author": "maua_mii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a 23 y/o. I understand what you mean. Though I am not entirely certain if I'm touch deprived or not seeing as I never had anyone that loved me touch me a lot. I am only guessing I am because I need an actual soft hug badly. I sometimes just want someone to put a hand on my shoulder, as weird as that sounds.",
            "score": 2,
            "author": "GranniesNipple"
        },
        {
            "level": 0,
            "comment": "I hope I live to see androids.",
            "score": 2,
            "author": "BrokenheartedAlt"
        },
        {
            "level": 0,
            "comment": "I know Im in for a lonley ride too. Never had anybody apart from an internet girlfriend which was very short lived. I feel the same way. It gets to me sometimes too. I know things aren't going to change, but I don't want to be miserable about it.\n\nI'm tryna just be content in being alone and not caring about women whatsoever. Not looking at couples with envy, not thinking about sex or any sort of desire for someone else or wanting to be adored by someone.\n\nBeing sad over not having anyone won't bring me someone who'd love me. So it's no use.\n\nWe need to learn to learn to live on solo mode before someone else would even care to look our way. Because no one wants a miserable man. Feeling sorry for ourselves will only make us feel worse about us, and dig our hole deeper.\n\nAnd if I die alone, I want to die knowing that at the very least I enjoyed my time on earth solo. And lived a fulfilled life regardless",
            "score": 2,
            "author": "Usernameidk0000"
        },
        {
            "level": 0,
            "comment": "Im 29 and cant say its gotten any easier. Every year seems to be getting darker and im too much of a pussy to kill myself so i guess ill just suffer as long as i can.",
            "score": 2,
            "author": "HIGHCOWBOY"
        },
        {
            "level": 0,
            "comment": "Just go out there be you the real you not the you you think people want to see genuinely be you and I guarantee you’ll find someone that fills ever void in your life anything and everything missing that you want the will fulfill your still young but I promise you within the next couple months you’ll find someone who will hold you tight",
            "score": 2,
            "author": "jizzleton5565"
        },
        {
            "level": 0,
            "comment": "Nah bro don't say that you definitely deserve it, don't worry soon you will find someone that will give you the hug of your life",
            "score": 2,
            "author": "Murky-Check5213"
        },
        {
            "level": 0,
            "comment": "I feel this immensely. Currently feeling this way a lot lately. Me and my expartner showed affection differently, and it just showed me how important it is to communicate and hear each others needs. Men and women need reassurrance, or enjoy the comfort of a partners embrace. Often its something they lacked in their family or other relationships. Nothing wrong with feeling overwhelmed, just dont hold it in and let it become negative. Take the energy and apply it to something you can change in the meantime. You arent alone dude, just need some time and you will find others to share with",
            "score": 2,
            "author": "Alone_Tackle_5201"
        },
        {
            "level": 0,
            "comment": "Hey man, I know this point of view isn't everyone's cup of tea but it's good for me so maybe it'll be good for you too.\nI'm 28, Ive always had long term relationships, but Ive been totally alone, without even friends for years now. \nAt first it was mental torture, it was hard. I saw a video about embracing loneliness and becoming content with just myself.\nGotta say it's helped me massively. Just accepting that the loneliness is with me and that at this point in time it is just me. I had to work with myself quite hard to accept those things but now that I have I can honestly say I'm comfortable with it now. And who knows, somewhere down the track maybe it'll change, in which case that's awesome. But if it doesn't, at least Ive begun mentally preparing for that early on so I can cope as best I can if this is a way of life I'll be living for the whole of my future or a what have you. \n\nWish you all the best, I hope you find what you need, I hope it's what your looking for.",
            "score": 2,
            "author": "Revolutionary-Mark46"
        },
        {
            "level": 0,
            "comment": "Only 23? You're basically a late bloomer, hopefully you can move on",
            "score": 1,
            "author": "arkhamnaut"
        },
        {
            "level": 0,
            "comment": "Oh friend. I feel this so much. My partner of 10 years cheated and left. Sending some virtual hugs for you",
            "score": 1,
            "author": "LawzenRainbow"
        },
        {
            "level": 0,
            "comment": "I do jiu jitsu and it's weird cause I am touching people and getting close to people all the time physically but I feel literally nothing from it",
            "score": 1,
            "author": "KosterBlue"
        },
        {
            "level": 0,
            "comment": "Me too. I haven't had a hug or anything in years",
            "score": 1,
            "author": "blazerend"
        },
        {
            "level": 0,
            "comment": "When's your birthday? Mine is on Sunday. Happy birthday",
            "score": 1,
            "author": "Exact-Run-8495",
            "replies": [
                {
                    "level": 1,
                    "comment": "My birthday is on Tuesday, happy birthday too 🫶🏽",
                    "score": 1,
                    "author": "maua_mii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I put my pillow under my shirt and the pressure feels like someone is by my side..\n\nSigh. Now I'm feeling sad",
            "score": 1,
            "author": "ForzentoRafe"
        },
        {
            "level": 0,
            "comment": "27 here, it doesn’t get easier lmao. Just distract yourself when you’re feeling really deprived.",
            "score": 1,
            "author": "LysolDoritos"
        },
        {
            "level": 0,
            "comment": "Just sit on your hand until it doesn't feel like yours.\nJokes aside.\nI'm sorry you feel this way, genuinely.",
            "score": 1,
            "author": "Orangesuitdude"
        },
        {
            "level": 0,
            "comment": "i cant really relate tbh, i’ve never really liked long hugs and someone all over me it feels quite suffocating but i hope things get better for you soon",
            "score": 1,
            "author": "sonic2cool"
        },
        {
            "level": 0,
            "comment": "4 yrs an counting...",
            "score": 1,
            "author": "TitlicNfreak",
            "replies": [
                {
                    "level": 1,
                    "comment": "same here...",
                    "score": 2,
                    "author": "maua_mii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Completely understand the feeling. Get a massage! It should totally help",
            "score": 1,
            "author": "masterchef227"
        },
        {
            "level": 0,
            "comment": "If you were by me I would offer you a Hug. Since I am not, I will send a virtual Hug. It does get better, you either decide you don't care about it. Or you will put yourself out there and find someone who wants to provide that touch you require. Sometimes, it isn't from a romantic partner. I get touch from friends. A hug here hand on my shoulder just casual touch. I still miss romantic touch, however it is what it is.\n\nStay Strong you will find someone to enjoy touch with again!!",
            "score": 1,
            "author": "jag5x5NV"
        },
        {
            "level": 0,
            "comment": "Yes. I’m also away from my family so even a hug is hard to come by… I just try to hug my friends whenever I see them… but not those long hugs I’ve been craving for 😅",
            "score": 1,
            "author": "MQDSM_"
        },
        {
            "level": 0,
            "comment": "Your 23? 👀…. Buddy. Try being 26 &amp; NEVER experienced any physical contact whatsoever.",
            "score": 1,
            "author": "Aggressive-Radish498"
        },
        {
            "level": 0,
            "comment": "Hug",
            "score": 1,
            "author": "Lisforme"
        },
        {
            "level": 0,
            "comment": "I would be very glad to hug anyone who wants a hug. As it is, I have a baby Yoda.",
            "score": 1,
            "author": "ifyoumustknowyes"
        },
        {
            "level": 0,
            "comment": "This is what happens when you watch too much porn",
            "score": -21,
            "author": "Repulsive_Tap_2736",
            "replies": [
                {
                    "level": 1,
                    "comment": "Physical contact is not inherently sexual.",
                    "score": 11,
                    "author": "Fluffy-Instance-1397"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No one’s touched you atall ?",
            "score": -6,
            "author": "Dio902",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't just want to be touched, I want to be held",
                    "score": 3,
                    "author": "maua_mii",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh yeh I reread your post . You want somebody to love you",
                            "score": 1,
                            "author": "Dio902"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So many geminis. Have you been putting yourself out there? Any family?",
            "score": -11,
            "author": "JellyEllie304"
        }
    ]
}