{
    "id": "1433rmp",
    "score": 2,
    "title": "What do you do when it gets too much?",
    "author": "PersiaStillStands",
    "date": 1686113766.0,
    "url": "https://www.reddit.com/r/lonely/comments/1433rmp",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m at the depression stage of loneliness, and I’ve run out of things to keep me going. I try to make friends and meet people but it seems everyone has their own little group or person to love. I want this to end and I don’t care what happens anymore. Im not living life alone fuck this shit.",
    "comments": [
        {
            "level": 0,
            "comment": "i go to sleep. sometimes i wake up feeling better, sometimes i don't. sometimes i got overwhelmed in the middle of doing something important, so i just kinda have to go through it. it may happen every now and then and it gets kinda tiring but it will pass.",
            "score": 3,
            "author": "frcfulshde"
        },
        {
            "level": 0,
            "comment": "It's all would be good bro.",
            "score": 0,
            "author": "Specialist_Ear_927",
            "replies": [
                {
                    "level": 1,
                    "comment": "No it won’t be… it hasn’t been good for the last 9 years. It’s just been a lonely miserable fucking hell. I’ve tried everything x5, that’s why I’m over it. Suicide is the only thing that’s left.",
                    "score": 1,
                    "author": "PersiaStillStands",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How old are you?",
                            "score": 1,
                            "author": "Specialist_Ear_927",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "40…it’s over for me.",
                                    "score": 1,
                                    "author": "PersiaStillStands",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m 45 and was where you are a few days ago. I’m feeling a lot better. Talking to people on here helped. Getting out of the house helped. I know you’ve tried all that, but sometimes you just have to keep going",
                                            "score": 2,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I really don’t have it in me anymore…..otherwise I would. I’m just completely fucking defeated.",
                                                    "score": 2,
                                                    "author": "PersiaStillStands",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I’m not sure of your situation, but there’s always a glimmer of hope out there. Something beautiful to behold",
                                                            "score": 1,
                                                            "author": "[deleted]"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I hope you’re feeling a bit better. Your username is PersiaStillStands. Embrace that. It will be better. It might be worse at times but it will get better. You just gotta stay strong \n\n You’ve got a great Zappa quote in your post history. One of his mottos was the Varese quote “the modern composer refuses to die”\n\nStay strong",
                                                            "score": 1,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}