{
    "id": "1436kra",
    "score": 8,
    "title": "Just here.",
    "author": "PoptartDandy",
    "date": 1686123335.0,
    "url": "https://www.reddit.com/r/lonely/comments/1436kra",
    "media_urls": [],
    "other_urls": [],
    "postText": "No matter what I do, I always end up alone in the end. Either I try too hard, care too much, or  I’m just too different. I just can’t do anything right. I don’t feel like a likable person or capable of being loved. Don’t want to say I hate myself but I can’t see why anyone would want to be around me. It’s hard to imagine anyone really being there for me. It’s hard to just feel safe and secure with someone. I’ve given people the benefit of the doubt but I just kept getting shat on. I’m so tired. I just want someone to understand and accept me but it never works. I can’t connect with people properly. I’ve been broken down so much, I’m so tired. Even now, I feel like a shitty person for wanting to be close and connect with anyone. This is probably just my depression talking because I ran out of my antidepressants a few days ago, but I just can’t care anymore….",
    "comments": [
        {
            "level": 0,
            "comment": "Oh life’s rough trust me many people feel this way but your expressing it which is the first step so we’ll done keep going",
            "score": 2,
            "author": "Hopeful-Object-4003"
        },
        {
            "level": 0,
            "comment": "I can relate. Even when it goes somewhat in the good direction, I end up being the last choice. I think I have a lot of self-confidence in terms of being a lover or a good person in a relationship, I have a lot of energy to put into a relationship and I want a nice future and battle life with someone I love but it's hard to keep a good mood when you're the one who ends up getting ditched for someone else. Never in my life I could imagine a woman ditching someone for me. It seems so unreal to me.\n\nI sometimes wish I could just supress the feelings of wanting someone. I just don't want to feel the need to be close to someone anymore, it just doesnt work. I really liked the last woman I was seeing and I wish I could just forget everything about all of that and go on with my life.\n\nWe were talking everyday for an insane amount of hours for like 1 month, she was living 2 hours from me (dmed her on insta, had a friend in common back in like 2019) but I went to her house to pick her up, we spent 2 awesome days together, I had her in my arms all night, we were cuddling a lot. She was saying that she wanted to forget her ex, that if he writes to her she wouldnt answer and go back with him. I'm a gullible mf and believed it. It took him 2 days and a couple of DM on insta to get her back and asking her to delete me (and a bunch of her friends) from everywhere. Because it was only one month since I knew her and I had feelings for her she thought I was a manipulative asshole, so yeah right now she's talking with her ex, she's probably not even thinking about me and she think I was trying to manipulate her and I had no real feelings. It's hurting me tbh. This time I can cope about the fact that it's probably not my fault and had no control over everything, tho. Idk. I'm still thinking about impossible scenarios that will never happen like her coming back to me or wtv, k-drama type shit. Maybe I have the self respect of a doormat but I just want her to come back. I miss her so much.",
            "score": 2,
            "author": "Olick"
        },
        {
            "level": 0,
            "comment": "Why feel like a shitty person for wanting to connect? It’s normal and healthy to desire that. Those self critical thoughts are just your mind playing games with you. The real master knows to twist those thoughts into motivation. We are meant to fall, that’s how we learn from mistakes. There’s a lot of people that don’t know the answers in life, but the next best thing is to be there for people and be more realistic about expectations. Sounds like you might wanna do some research or ask the opinions of genuine people as to what you think needs improvement. Most people have opinions, and the more unfiltered they are the better you can get an idea as to where to start.",
            "score": 1,
            "author": "Fawnly"
        }
    ]
}