{
    "id": "145bb7q",
    "score": 17,
    "title": "All that’s left is me now.",
    "author": "SacredBananaBiscuit",
    "date": 1686331574.0,
    "url": "https://www.reddit.com/r/lonely/comments/145bb7q",
    "media_urls": [],
    "other_urls": [],
    "postText": "\nI am at a loss for words. I no longer know what to do, and I don’t want to any longer. My life is going to shit and its all my fault. My “friends” are graduating this year and ill be left with no one. (Not that I had any contact with them anyway). My school career is going terrible, and my parents absolutely hate me for it. Ive never accomplished anything in my life, and I don’t think I ever will. As far as I know I have not had something that would cause trauma. So even if I wanted to, I have no excuse for myself. But instead of living my life and making people around me proud, I want nothing more than to shrivel up in a dark corner and cry. Funnily enough, even crying is not something I am capable off.",
    "comments": [
        {
            "level": 0,
            "comment": "What do you call your parents hating you for not having done well in school if not traumatizing?",
            "score": 2,
            "author": "ActualizingPotential",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well I get where youre coming from. And its true in a sense. However its not exactly that they verbally tell me they hate me. Its more that they expect me to perform perfectly with everything with the things being as difficult as possible. And i have never really been able to that. Now that im growing older and am falling behind i think they have lost their pride in me and only ever show their dissatisfaction and disappointment. Which makes me feel even more guilty because my current education program is incredibly expensive. So, as the above reads i guess hating is the wrong word and it might not be the best parental approach. However i cant seem to think anything other than that they are right to expect more of me. (Sorry if there are grammatical errors english is not my native language.)",
                    "score": 1,
                    "author": "SacredBananaBiscuit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I understood what you stated here. Maybe your struggle with what is right and wrong, whos to blame, what others expect from you...are hindering you from pursuit of your personal goals in life.\n\nWhen resources is allocated to you without a psychological evaluation and an aptitude test.. and too much of those resources are seemingly going to waste than you or the allocator would like.. you are solely to blame?\n\nYour story reminds me, I gotta go make myself proud.",
                            "score": 1,
                            "author": "ActualizingPotential"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "   It sounds like you’re depressed. And when you’re depressed it becomes a chore to just do the basic things. Some days it’s hard just to get out of bed. \n   As for the situations around you, you’re seeing changes and I think they are bothering you because it seems like “everyone else’s life is going great, and mine sucks”. Well I will tell you, people keep things guarded, and you’d be surprised what they are dealing with that you would never even know about. Social media doesn’t help that fact as people typically show what they want people to see, and not always what’s really going on. \nI think every day you spend above ground you should be proud of yourself. I’m not sure your age, but if you’re still in school I’ll assume you’re younger than me (35M), and it took me until my 30’s to really start doing things in life I was proud of. You will have plenty of time for achievement, but first take care of your mental well-being before you become so twisted up inside you can’t untangle. I’m sorry you’re feeling this way, and I hope this helped.",
            "score": 3,
            "author": "Loot_my_body",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much for your support and kind words, it truly means a lot. I do go to therapy but i never even considered that im depressed because people tell me i “smile too much” or am “too happy” for a depressed person. As for not being able to do normal “easy” things. That is definitely something i relate to. I used to be a clean freak. Everything in my room and the surrounding house would be clean or id clean it. Now my room looks like your typical teenager room explosion. I try every day to clean it up but end up doing nothing instead. As you might guess, this makes me spiral even more most of the time. Unfortunately, I am quite a bit younger than you are however for me age isnt really that important when it comes to friendship. If youd like to talk more feel free to dm :)",
                    "score": 1,
                    "author": "SacredBananaBiscuit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know things really suck right now but trust me when I say this. It gets better. It doesn’t seem like that right now but from a year from now things will be different. You’re going through a transitional period and transitions are difficult but remember life is worth living because you never know who you’re going to run into in life. People come and people leave. Some stay and that’s what’s worth living for. I’m still looking for the people to stay in my life so I understand how you feel",
            "score": 0,
            "author": "Throwawayyy2497",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey, thank you for saying this. I do believe that life is worth living and that things eventually will get better. However this is something that is harder for me to believe every single day. I truly do hope that in a year my life will be a happier one. Unfortunately i had the same thought a year ago and it honestly only got worse. I have my ups and downs and believe that as long as i dont give up i will be able to fight through it. Its just so difficult to this while im all alone.",
                    "score": 1,
                    "author": "SacredBananaBiscuit"
                }
            ]
        }
    ]
}