{
    "id": "145s7p8",
    "score": 3,
    "title": "Is it possible to just live?",
    "author": "ewbbod",
    "date": 1686377338.0,
    "url": "https://www.reddit.com/r/lonely/comments/145s7p8",
    "media_urls": [],
    "other_urls": [],
    "postText": "Not in a good way either. If living is just emptiness and things achieved to fill the hole of that realization but never really cherished...it's empty being. I don't know why I'm here and I feel it being all my life never having a clue and the thought likely what found will just be cope...leaves me to thinking it better to just let go entirely. Why go on? For beautiful lies? Meaningful, valuable and just but lies...living is torture and I deserve it lol...I don't know how I feel honestly. I don't know what I'm doing here anymore. I'm lost, my eyes are ridiculously heavy, my heads fucking killing me, my body aches and it's begging for release. 'its not ok, it's never been ok also it's ok to go to sleep' is what it says. 'you were never meant for this world, be still you don't have to suffer anymore, you don't have to hurt anyone anymore, you don't have to hurt anymore'",
    "comments": [
        {
            "level": 0,
            "comment": "It feels so good to imagine I'm.so close that can be tonight but my laugh ruins it...it's never been my world, my spirit belongs elsewhere and if not it's better to be nothing. Anything but here. Just make it stop. Only I can make it stop...no smile...no laughter...a headache but that's the truest thing I feel I'll ever say. That essentially I want to die. Perhaps I don't need to and it'd be shitty but it's the truth. I want to die, I've always wanted to die...that's why I'm so weird... everything contradicts what I can never deny...it's warped me beyond repair and I'm tired...I'll lay there holding myself 'its okay' I'll say until I pass out. It's okay. No more pain.",
            "score": 2,
            "author": "ewbbod",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've once heard of a saying:\n\nIt's natural that you don't fit into this world,\nYou're here to change it.\n\nI believe in this, we're all a factor of change in the universe. We're not supposed to adjust to the world, the world is supposed to adjust to us. It's all about finding your true passion, understanding your strengths and your weaknesses, and putting in the work to get there. And if you do this it'll bring people into your life. What do you love, what are you passionate about? That's what brings people together. You have to project who you are so that others would know if you're right for them or not. Right now it sounds like you're a fan watching a movie without realising that you're actually the protagonist, you can act, you can change, you can cause change to happen. And in the end that's what you're here to do.",
                    "score": 2,
                    "author": "Motor-Ad-2001",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well personally there's nothing in me, never was...all collected knowledge and experience feels usefully  wrong and alienating but that's all there is. I'm not a revolutionary, exceptional or special. I'm a genetic and circumstantial failure of a human being perpetually unsatisfied because being human in itself I experience as functional madness...and thats all there is to make due, convince myself other...to me its all lies, promised to the few that I undeniably hate in the sense there's no limit. Which honestly makes me want to make a mockery of and deconstruct it before my very eyes. Prove how it's all fragile but convincing great illusions...not ridiculous but ridiculously brittle...what you describe though is only possible for you and the few who could relate...I cannot...creation in this world are lies to me. Not pointless but worthless, empty, madness given grace from my perspective...all glass. And I know it'll be in the end. People don't get to choose. What we do is just a moment of blinding bright delusion, an unpromising privilege imo...they will not be able to guard. I will not live for lies. The greatest truth is liberation in the fact you can throw it all away, it means something and yet that means nothing bc anyone can be a forced participant in ones own mad pursuit of needless, delusionally self gratified purging of all they seem fit...and it being so random and ridiculous an action--- a joke, anyone can be a part of irrespective of how deemed valued their experience and their connection and opinion from others... different but the same in respects to how what little choice they'd have in the matter of some unforseen game they'll fall unwilling participant of",
                            "score": 1,
                            "author": "ewbbod"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I heard somewhere that the reason summers (and life in general) seemed so much longer when we were kids is because experiences were all new. And the reason you remember one moment (like the one day you had a flat tire on the way to work, or the day you found a turtle in your yard) is because those were new experiences. You forget all the drives to work where things were not different, and you forget all the times you walked across your yard when there was not a turtle, because you did not see something new. So the way to make your life feel longer is to do completely new things. This is why you remember places you went on vacation, not because it was expensive, but because it was new. So even just exploring the woods with a friend one day, or laying on the roof one night and laughing with your brother, those days will feel long, like the days when we were young. DO NEW SHIT. Much luv",
                    "score": 2,
                    "author": "Audax_xaduA",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Those things may very well be true but it's for that exact reason and the fact I find myself hateful and detached that I feel more cemented in my feeling for freedom...in experiencing life to be a joke...all things meaningful, possible and just yet it makes me want to excommunicate from the experience all together...things so great and yet here I am. It's a sick joke. But really I just mean me. But I know that can extend and unnecessarily avalanche...how ultimately ridiculous life can be no matter where you find yourself or how hard you struggle ridiculousness will ensue. And I see it in my dreams and waking thoughts constantly everyday as if predestined...an indication it's already too far, too gone, what contends only fuels the race towards the finish 'all these things, all this good and yet I find myself hatefully detached'...a contradiction...like how people hold on for something so tight they lose the sense of  what they hold onto is a strand of hair...and I see it in all people in myself and especially by where I find myself currently--- the end, what that means, how ridiculous that can be...how easy the decision to make it as ridiculous as possible. I see it and I'll never unsee it...but yeah all that just being myself besides that I agree. In the general sense people should atleast strive to seek new experiences and evolve whatever they currently find themselves loosing wonder and fulfilment doing so",
                            "score": 2,
                            "author": "ewbbod",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think you are thinking too much. And it can be easy to say, \"well that's just who I am.\" But you control who you are. If you can't control your mind, you can't control anything. I would find an activity where you can mindlessly do something, like painting or the gym. I would get a job where everyone hates the place but the coworkers bond over that. I think a lot too, and I just try to put myself in situations where I have been happy in the past and know that I can just be without thinking. Act First, Think Later.",
                                    "score": 2,
                                    "author": "Audax_xaduA",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's the constant overthinking that keeps me here and unsure if I actually want to go with my more emotional and felt more personally gratifying course of letting go and what that would equate to...part of that is mostly I'm afraid to become nothing but overthinking I find myself I could be wrong...which is funny because existing is actually hell but hells better than nothing I suppose! Lol but yeah that whole bonding thing I don't think I'll do. And idk wtf is wrong w me but I'll just concede on saying I'm too socially retarded, anhedonic, psycho or sociopath to if ever even accomplishing a connection for it not to go to shit lol. \n\nBut yes distractions...they'll never be enough imo but I agree if applicable best to do something fulfilling to turn the brain off more times than not",
                                            "score": 1,
                                            "author": "ewbbod",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Don't label yourself as those things. Then you begin to associate those things with you. And you should go with your more emotional self. \"Mystery, not logic, is what gives us hope and keeps us believing in a force greater than our own insignificance\" Being unsure is ok. Being sure of something you dislike and still doing it? I believe you'll make the right decision, not the easy one.",
                                                    "score": 2,
                                                    "author": "Audax_xaduA",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yk the highest truth I'll ever say is I'm a very very very very very very fucked up and twisted individual. So those things would actually be putting me lightly. And what easiest to me if said explicitly would probably have you kill all charity and benefit of the doubt you've given me. I'm so fucked up I lose the sense of how fucked up until it's too late. Until my arms go numb from hugging the life out of whatever I embrace...like some fucking unintentionally evil fucking monster lol... setting fires to ppls house to have s'mores with the locals lvls of obliviously fucked lmao...person says they're cold I throw them into the fire 'OH NOOOO!'...I'm not meant for people or life. I want to kill myself but I'm afraid of nothing so I deal and all that makes me deal makes me feel crazier than if I let go. I get lonely but I'm too fucking mental my chances are a fucking fantasy lol and if possible more an insult and cementing the joke of my existence when that inevitably fails...when I fuck the life of the people I love and lose the right of such things...not knowing how fucked until it's too late I have to ultimately concede I'm not only definitely evil but insane.\n\n...It's a concerted effort to be and do good, part of me wishes it wasn't that way but idk how true that part is. So to be so unsure of good, for it to feel more alien than being fucked. I'm all those things and more. I just don't externalize it as conventionally expected but I'm the worst person imaginable. Evils standard of evil and the funniest part is I don't try to be. At times I don't want to be. And yet that's not even certain....sorry for the fucking short story lmao don't read all this shit and if you do sorry genuinely lmao...I should simply say I'm evil and insane. Funny I say too much to essentially mean just those things",
                                                            "score": 1,
                                                            "author": "ewbbod"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Smh, I can relate b",
            "score": 2,
            "author": "RavDLC",
            "replies": [
                {
                    "level": 1,
                    "comment": "You know what's crazy is it'll never end atleast imo. Like you think yk what the bottom is but there's no limit. You wouldn't even realize how low you are until it's too late and even then theres more to go and everyone around you will pay for it... beyond tired",
                    "score": 3,
                    "author": "ewbbod"
                }
            ]
        },
        {
            "level": 0,
            "comment": "whys bro poetic",
            "score": 1,
            "author": "SadResist8068"
        },
        {
            "level": 0,
            "comment": "I cant tell if this is like a coping mechanism but its truly fascinating how people are able to dig their own graves this much",
            "score": 1,
            "author": "SadResist8068"
        }
    ]
}