{
    "id": "146x1v3",
    "score": 95,
    "title": "Someone asked me today if i'm 14. I'm 22......",
    "author": "Notwhatuthin_k",
    "date": 1686497932.0,
    "url": "https://www.reddit.com/r/lonely/comments/146x1v3",
    "media_urls": [],
    "other_urls": [],
    "postText": "I hate how I look. Its very hard to be taken seriously when I look like a child while being 22..\nI often feel like I dont fit in this world. \nPeople time tell me \" you ll like it when you are 40\"\nYeah bc getting old is a sure fact like I can't get in an accident and die ( or get cancer etc..). I want to feel included but I cant do anything about it . I tried  changing my outfit but I look silly that way. \nPeople with baby faces, how do you deal with this on a daily basis?",
    "comments": [
        {
            "level": 0,
            "comment": "Same here. I just stopped to care about it at one point. Im a manager now with 14 employees. I still look like 16, but they respect me the same way as i respect them. Looks are not everything...",
            "score": 34,
            "author": "Reiskanzler3000",
            "replies": [
                {
                    "level": 1,
                    "comment": "How do I stop caring? For me the only time im comfortable is being with people who already knows me but I'm in college and met people all the time who asks my age, and its always the same reaction.....",
                    "score": 9,
                    "author": "Notwhatuthin_k",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You just have to come to terms with it. Accept that this isn’t something you can change about yourself. Something you are born with. \n\nIt’s like people who has small penis’s, short, disabilities, ugly, etc. \n\nYou can either spend the rest of your life worrying about something you can’t change or have an enlightenment one day to not let it bother you as much since it’s just so exhausting. \n\nI don’t have the answers though. I’m pretty sure there is a mixed result across the board. Some get over it, some has it bother them less, some cant ever come to terms with it their entire lives, others with opportunities find a way to change it through surgeries, some can’t get it out of their mind and it ruins their lives. \n\nNo easy answer since no one knows others mental state.",
                            "score": 10,
                            "author": "uh-_-Duh"
                        },
                        {
                            "level": 2,
                            "comment": "Its not inherantly about stop caring. Its about building confidantce in the strengths you have and accepting the other parts that are just ok or working to improve them. \n\nIm going to assume your male from the baby face comment, sadly genes play a huge role in that. That doesn't mean baby face is inherantly bad however, i know so many people who get weak at the knees over that. Im a heary motherfucker at 22 and i don't have a full beard cause things like soul patches don't tend to grow till later. \n\nOne of my world changing mindsets was gaining confidance in myself and viewing the rest of the world as something that i can not care about in terms of people. For example, for me. Anyone who trashes someone on the basis of their appearence is automatically not worth the air they breathe in my head. So i write them off. \n\nOf course this took me years to develop and i still am. I have horrid self esteem and i have to jump trough mental hoops to keep me from thinking the worst. But it can be done. \n\nSometimes a hard job can put you over the edge in that case, barwork for example for me was a big player in the desensitising of peoples comments cause i saw them at their worst. Some still surprise me and cause me to be curious but its often out of a question of their mindset and how fucking stupid they have to be. \n\nBut build your confidance and strength in the places you can control, the more power you give yourself the more you can stop worrying about other people. It'll never really go away but if you fix the things you dislike then it goes miles ahead of anything you can't fix.\n\nRemember too that people who trash you on the basis of how you look (and i mean in a mean way, not like you decided to wear a tootoo over black cargo pants or something although if this is something you wanted to do just own it, i make alot od spread sheets for games i play and use tools to do certain stuff. Super nerdy. But i fucking love doing that stuff, i had a dude and his girlfriend laugh at me and i basically turned around like hey don't you disrespect the x i ain't got all the fucking time in the world i need to keep this shit streamlined and i owned what i do. They were actually okay after we talked about stuff, but any time someone turns to me and goes \"you're a fucking nerd\" i go \"you're god damn fucking right i am\" i enjoy this stuff and there isn't a soul alive that can ruin my enjoyment. We ain't got infinite time here on earth, own what time you do have and spend it smiling in good company fuck anyone who trys to steal your time from you.) are not worth your time, they have come up to you and basically said. \"Hi, i've come to inform you that im human garbage and an evolutionary mistake on humanity.\" That's what plays through my head. \n\nDon't be too hard on yourself, work on the things you can work on everyday. Confidance is a fake it till you make it kinda thing, another way to look at it is. Confidance is a habit not a mental state. Which sounds weird but i can atest the more i faked being confidant the more eventually i just was until now im always confidant. \n\nTake care of yourself stranger, we ain't got all the time in the universe. So make the time you do have good.",
                            "score": 3,
                            "author": "xxchillweebxx"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A highschooler (outside of the school, obv) approached my shyly and gave me her number. \n\n….\n\nI’m 29. Rip",
            "score": 28,
            "author": "MisterManSir-",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel you, I had very young boys come to the place I work to and awkwardly try to exchange words with me (probably to spark up something)\n\nI am 23 years old, I wear makeup, why do 18 years olds try to talk to me help",
                    "score": 5,
                    "author": "Loveenglishpeople",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "23 and 18 are not that different looking.\n\nBoth ages can pass for one another.",
                            "score": 11,
                            "author": "vinujob"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Im an high schooler and I’m told that I look like someone from elementary school or 13 max. It’s okay rn other than the fact that the only people that like are the ones that married 16/17 years old when they’re 40",
                    "score": 2,
                    "author": "Fkondoo"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -16,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That sounds extremely awkward.",
                            "score": 22,
                            "author": "ralts13",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People like him are much more common than you think, being alone doesn't sound so bad now does it lol",
                                    "score": 3,
                                    "author": "strangexfantasma"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "😕😕😕😕👀fbi",
                            "score": 4,
                            "author": "smallcoccthrowaway"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This bothers me too sometimes. I always get mistaken for being 12-16 by a lot of people, when I'm in fact 20. I've gotten disgusting comments about it saying that I'm jailbait, shit's weird. I'm not sure I'll get used to it more, though.",
            "score": 14,
            "author": "Masked_Demon"
        },
        {
            "level": 0,
            "comment": "I have a baby face too. People always keep saying i look like a kid..... And idk how to deal with that. I just smile and die a little inside hehe",
            "score": 10,
            "author": "randomuser_505"
        },
        {
            "level": 0,
            "comment": "They lie about that 40 shit. Most people will just end up looking old but with a strange baby face.",
            "score": 28,
            "author": "pseudomensch",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agree.",
                    "score": 8,
                    "author": "Notwhatuthin_k",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep and severely underemployed because \"you don't look old enough to be in a position of authority.\"",
                            "score": 10,
                            "author": "Intelligent_Plan71",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This\n\nIf you truly try to notice, you will see most of people in position of power are tall (like 10 cm more than the average), broad shoulders, was probably looking 24 at the age of 18-20 years old… it’s depressing\n\nBaby faces get nothing",
                                    "score": 6,
                                    "author": "Loveenglishpeople"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm 38 and most people think I'm late 20s still.",
                    "score": 3,
                    "author": "AnotherLostSouls",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well in that case it's good. But some of the ugly young looking fellas are not benefitting from that kind of youthful look.\n\nI hope that has helped you out.",
                            "score": 4,
                            "author": "pseudomensch",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well, not really. I've been single for the past 12 years since my wife cheated on me. But, it is still nice getting comments from people (generally people I work with) when they find out my age. I was at the pub on Friday with some people I used to work with and 2 of them didn't know my age and one spat her drink out when I said, did make me chuckle. Kinda ego boost too I guess that I look good for my age.",
                                    "score": 4,
                                    "author": "AnotherLostSouls",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I kind of get that at 30, but the real test is if I actually look “young” at your age. I don’t think I will because if you look closely you can start to see some wrinkles in the cheek/nose area which is the first sign of aging. To be fair, most of my peers who didn’t get overweight or bald still look relatively the same as their early 20s. Most of the changes are subtle so I don’t think people realize how just keeping weight off keeps you from looking old. Same thing with shaving.",
                                            "score": 1,
                                            "author": "pseudomensch"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Eh I see the opposite, most people around my area look way older. And they don't look the \"mature chiseled modelesque\" type of old, just the worn out tired type of old. It depends on where one lives i guess",
                    "score": 3,
                    "author": "strangexfantasma"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have the same issue. I’m 26 but people think I’m 17. I can’t go to certain places without getting carded (like a liquor store, bar, etc). Also doesn’t help that I have anxiety issues, which I think makes it worse because I’m not the best social butterfly. It gets to me sometimes but I try to not let it ruin my day.",
            "score": 6,
            "author": "oddflow3r"
        },
        {
            "level": 0,
            "comment": "I'm a 22 year old male with baby face.\n\nI seem to never look professional no matter how nicely I dress up. I have a hard time getting jobs, being taken seriously in the workplace or receiving promotions.\n\nMy past manager would constantly say \"You're 18, right?\" And would be shocked when I reminded him of my age.\n\nI'm also quite short in comparison to other men, making me look younger. The more I try to look grown up, the more I'm made fun of by my peers.",
            "score": 5,
            "author": "ryanparrott01"
        },
        {
            "level": 0,
            "comment": "I'm the same age as you and I get this very often.\nHonestly, in my experience I just laugh. Of course it sucks to be seen that way, but I got fed up with being so upset about something I cant really change about myself. I can't change my body, I can't change the way people react to my appearance. I expect people to think I'm a young teen at this point.\nI can have fun with it though. I like to go to the store and buy things you have to be 18-21+ to buy, and see the cashiers absolute confusion. It's just little things like that I can enjoy to make the experience bearable. It may very likely be different in your experience though.",
            "score": 5,
            "author": "AmethystEternal"
        },
        {
            "level": 0,
            "comment": "i've had that happen too, but it wasn't as dramatic what you had happen (someone thought i was 12 while i was 17). also doesn't help that im very short, like \"cute\" stuff and don't dress like most girls my age. It doesn't happen to me on a daily basis so i don't have any tips, sadly :(. people will always comment on others, i personally just laugh with them but that's because i can't stand up for myself 🫠",
            "score": 5,
            "author": "Odd-Estate-77"
        },
        {
            "level": 0,
            "comment": "22, but haven't been told I look 14, youngest was like 16-17. I personally find that smiling makes baby-face look more obvious, which is unfortunate because that means my resting bitch face is what makes me look not as young, so its up to you whether this trade off A) exists and B) is worth doing!\n\nMy sister on the other hand has had this sort of problem for a long time. Being short was possibly the main culprit, but either way she too was being mistaken for being in school at 22. I can't tell you what she did about it, like if makeup, working out, was to address any of it, or just because she wanted to. Given her bubbly but firm personality, and strong drive to do her work properly, I don't believe she suffers from looking young outside of the initial \"oh I thought you were younger\"",
            "score": 4,
            "author": "reasonsnottoplayr6s"
        },
        {
            "level": 0,
            "comment": "I know what you mean... not too long ago I got ID'd for a scratch card (that you have to be 16 to buy), I'm 36. At some point you just stop getting pissed off about it and embrace it, well... at least I did.",
            "score": 5,
            "author": "MDF87"
        },
        {
            "level": 0,
            "comment": "I used to have the same problem. People still guess me 10-15 years younger than I am. I grew a beard and that helps. I know you can’t. I work in finance and it sometimes hindered my career. I ended up marrying young right out of college. By the time my marriage failed I was in my late 30s and it had become a bit of an asset.",
            "score": 5,
            "author": "Ok-Razzmatazz983"
        },
        {
            "level": 0,
            "comment": "Relatable I'm 20 but could pass as 14 apparently it's horrible being the only one to get ided at places 😕",
            "score": 3,
            "author": "Accomplished_Disk384"
        },
        {
            "level": 0,
            "comment": "I'm 21 but get anywhere from 14-19 on average despite being taller than most people. I feel similarly. People often will dismiss me out of conversations or treat me differently because they assume i'm younger, the worst is when actual serious incidents happen and me looking young gets in the way. People always just talk about your skin, your face, how your body looks, etc like its free-reign and how its a \"great trait to have as a women\" but don't often consider its cons. I haven't found anything that, personally works for me besides just keeping to myself. Those people come and go, no matter how annoying I can at least choose to not keep them around me. Hopefully the day will come when people stop assuming shit abt other people after one look lol, til then, fellow baby faces are in ur corner 🫡",
            "score": 4,
            "author": "ZannaNova"
        },
        {
            "level": 0,
            "comment": "GOD I FEEL YOU! when I was 21 I had a summer job and someone asked me what high school I went to. I was a senior.... IN COLLEGE! I also constantly get the \"oh its a good thing ppl think you're young!\" when its NOT. I just turned 23 a couple of days ago and one of the first things I thought was \"damn I hope I at least look like I'm 18 now\". I don't even know how to attempt making myself look older without looking like a teenager whos trying too hard to look like an adult 💀",
            "score": 4,
            "author": "jetsetgemini_"
        },
        {
            "level": 0,
            "comment": "Someone thought I was in my early 20's the other day. I'm 31. It does get annoying.",
            "score": 3,
            "author": "Jmastab"
        },
        {
            "level": 0,
            "comment": "I'm 30, with some gray, and get told I look younger. Especially when I shave.\n\nTrying to get dates can be rough.",
            "score": 3,
            "author": "Rakathu"
        },
        {
            "level": 0,
            "comment": "Most dudes have the life back of growing facial hair. Rough if you're a woman though. I guess the magic of make up for them?",
            "score": 3,
            "author": "ralts13"
        },
        {
            "level": 0,
            "comment": "Same, I'm 23 years old and I don't like what I look like. I hate my ugliness that I cover my face, body, and don't talk in the public. I wish I could change myself but I don't have the money to make myself beautiful.",
            "score": 3,
            "author": "E_LeoTheOne"
        },
        {
            "level": 0,
            "comment": "I hate having a youthful face too, but looking mature isn't always what they make it out to be. And in between looking old and ugly and looking young and ugly I'd rather go with the latter 😅",
            "score": 3,
            "author": "strangexfantasma"
        },
        {
            "level": 0,
            "comment": "Looking older is even worse, I've been told that I'm 40 being 21 bro...",
            "score": 3,
            "author": "Dramatic-Estimate484"
        },
        {
            "level": 0,
            "comment": "I know that feeling,  I'm almost 25, people never belive me. They always think I'm lying and swear I'm 15 😂",
            "score": 3,
            "author": "Gullible-Base-9162"
        },
        {
            "level": 0,
            "comment": "Same here! I look 16 yet I’m 23, I work with people in their 30’s and 40’s but I’m glad I’m not treated like a kid. Today, someone asked me whether I’m done with High School",
            "score": 3,
            "author": "meeyouu-uss21"
        },
        {
            "level": 0,
            "comment": "You are not your face, you are not your thoughts, i think you need to vibrate on a higher frequency. It sounds like “woo woo” however your attitude matters. \n\nThink about your thoughts, what did you just think? Whatever thought you had - you are not that thought - youre the being behind the thought. \n\nA thought is just a thought , but you are\nYou. Whatever you feel is self fueled to some degree. YOU hang on to the negativity, YOU hang on to not feeling worthy. You are worthy, your face is not important. You are.",
            "score": 3,
            "author": "Flashmods",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great advice!",
                    "score": 3,
                    "author": "WasintMeBabe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Im negative naturally, its not good - ive been more positive lately and it shows in my surroundings. For me its a mindset, if i think negatively i spiral downwards, if i think positively - the outcome is so worth it.",
                            "score": 2,
                            "author": "Flashmods"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yep I go through the same im 20 yrs old and people think im like 15 :(.Im either not included im a convo or im being treated like a child and i hate it so much",
            "score": 3,
            "author": "SaltFaithlessness273"
        },
        {
            "level": 0,
            "comment": "In the uk you need to be 16 to buy red bull. I’m 25 and always have to show ID. I feel your pain",
            "score": 3,
            "author": "Tomrodgers98"
        },
        {
            "level": 0,
            "comment": "I think you should embrace how you look. We all have things about our appearance that we are self conscious about. Please don't feel like you don't belong. I'm sure you are beautiful inside and out.",
            "score": 3,
            "author": "Strict_Zebra_3585"
        },
        {
            "level": 0,
            "comment": "I get a baby face usually when I shave my beard off completely. Used to go from 20s to looking 15, was ok until whenever I went out and I'd always get ID checked 🙄  but you kind of just learn to accept it and deal with it? It does get annoying and frustrating sometimes, but you've just got to remember, you're an adult",
            "score": 2,
            "author": "auslad9421"
        },
        {
            "level": 0,
            "comment": "Same here, going to be 23 in a couple of days. People react shocked or surprised when I tell them my age, and they say you look 16-17. One of my grandmothers doctors started laughing and said I look like a 14 year old. \nAt this point I’m unsure what to do about it. It is frustrating.",
            "score": 2,
            "author": "Psychological-Duty17"
        },
        {
            "level": 0,
            "comment": "I know the feeling. I’m a manager for my\nCompany and I have a beard to help me look older. I hate it and shave every 2-3 weeks cause it gets itchy and food and drinks get in it and it drives me crazy. Even then it doesn’t really help. Looking young just makes assholes treat me even worse when I have to deal with them which is unfortunately somewhat frequently since being kind is such a hard thing to do apparently. So I just learned how to talk with a deep edge in my voice and it helps a little",
            "score": 2,
            "author": "FIPYC"
        },
        {
            "level": 0,
            "comment": "I had the worst of both worlds. I always looked like a kid. I finished college looking like a 14-year-old and always looked like a teenager until my mid-20s. Then I hit 25 and almost instantly went bald, looking like a kid with pattern baldness. Only now that I'm in my mid-30s am I starting to look my own age...only bald, which still sucks. I feel you, it's not easy.",
            "score": 2,
            "author": "WalterHenderson"
        },
        {
            "level": 0,
            "comment": "I don't have a baby face but some people think I look like 22-24 when I'm actually 28 this year lol",
            "score": 2,
            "author": "lingmungcha"
        },
        {
            "level": 0,
            "comment": "I don't deal with it being asian i often get people ask me are you the younger sister my 14 years old sister doesn't have baby face .. my only problem is people at the bank keep asking me where is your mother you shouldn't do official stuff like this alone .. (taking my money from my ATM card) it doesn't help that i also 152cm..",
            "score": 2,
            "author": "Deliciousmermaid7873"
        },
        {
            "level": 0,
            "comment": "Same here. Someone knocked on my door trying to sell pest control. They asked if my parents were home. I just turned 30 and live alone. 🙄It always bothered me too, but I found that your personality can change how people treat you. If you operate like someone who deserves respect, people will give it without being prompted. Also, it's more irksome when you're younger. As you get older, you have less time to think about these things and don't care as much.",
            "score": 2,
            "author": "ohlolaoh"
        },
        {
            "level": 0,
            "comment": "It's same with me I'm small with a baby face. Sucks. I've managed to grow a beard now so it helps a little. Still not being taken seriously by many though. It gets easier with age imo. You will have more time to date younger people wich is good. Youth is actually cool.",
            "score": 2,
            "author": "Glum_Star_4906"
        },
        {
            "level": 0,
            "comment": "Same... I'm 24y and i look younger like 13y, add with childish/small voice too, i sound like i'm an anime/cartoon characters. I've learned to accept it.",
            "score": 2,
            "author": "afi28"
        },
        {
            "level": 0,
            "comment": "I'm already 40 and I still look like I'm in my twenties if I shave my face. At this point in life, I've just had to accept that people are going to make judgments about me based on looks no matter what I may think or feel about it. You can't help what people think based on split second impressions of your appearance, they're going to do it anyway. At best, you have to find a way to accept that, and not internalize that reach and make it something negative that weighs on you mentally. Personally, I just assume that anyone who bases their reaction toward me on my appearance is shallow and my interaction with that person will be just as shallow and inconsequential, and I move on with my life. The vast majority of those encounters will not add alany value to your life and can be relegated to the memory trash bin. Does it suck to be looked down on for a youthful appearance, sure. But it won't really affect you when it actually matters in life. Anyone who will add value to your life will not take something as superficial as your looks into account and devalue your existence based solely on that.",
            "score": 2,
            "author": "Future-Ad4318"
        },
        {
            "level": 0,
            "comment": "If I had a baby face I'd be trapping child predators to get them jailed 😅",
            "score": 2,
            "author": "OoGrumpyoO"
        },
        {
            "level": 0,
            "comment": "Don't worry about it, you have ID (?) to confirm your age, try out different hair styles, makeup etc. See if anything helps. Have a professional make over, photo shoot to make you feel good about  yourself.\nIf people had a problem with how you look, it's their problem, not yours!",
            "score": 2,
            "author": "tec6679"
        },
        {
            "level": 0,
            "comment": "I can think of a few people I know that look much younger than they are. \n\nI think in that case it's not a case of what you can do to stop those comments because at the end of the day it's how you look, who cares what they think?\n\nPeople who comment on others insecurities after being told not to though should take a look at themselves rather than you though. Love how you look and your body, how others perceive you isn't your problem ❤️",
            "score": 2,
            "author": "ConnroG"
        },
        {
            "level": 0,
            "comment": "Take it from someone who has a baby face and is in their late 30s.\n\nI used to hate how young I looked but trust me, you’ll love it as you age. I regularly get thought of as being in my late 20s and don’t mind one bit anymore.",
            "score": 2,
            "author": "DoodAbides19"
        },
        {
            "level": 0,
            "comment": "If its someone that you dont have to worry/care about, tell them you are 30 and ask why? with serious face. And watch their confused reaction hehe",
            "score": 2,
            "author": "Lost_13579"
        },
        {
            "level": 0,
            "comment": "I mean, aside from drawing attention, this hardly seems like an issue. But, I guess I'm used to the attention. I am tall, so I'm immediately recognizable and the center of a great deal of attention",
            "score": 2,
            "author": "peteizbored"
        },
        {
            "level": 0,
            "comment": "it is not the looks but your character and achievements that describe.A person may look an adult but may have have a bad character.",
            "score": 2,
            "author": "Reiner_braun123"
        },
        {
            "level": 0,
            "comment": "Wear a fake mustache. Problem solved.",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm a woman...",
                    "score": 6,
                    "author": "Notwhatuthin_k",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dye it pink. Jk, I’m sorry.",
                            "score": 11,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "He literally deleted his account. Self-censoring in 2023 is worse than 1984. Anyway, check this out; it might help: https://ancestralsupplements.com/products/female-enhancement-mixture-w-mammary-femm-by-ancestral-supplements",
                            "score": 2,
                            "author": "mnwss"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "When I was like 24 I got stopped at a mall to show my ID bc you weren’t allowed to be unaccompanied under 16 after 5pm. It really pissed me off back then, along with the comments from patients like “are you even old enough to be a nurse!?” And now in my 30s I almost feel like people say I look younger to be nice, but yes, you do appreciate it later in life.",
            "score": 2,
            "author": "Careful_Eagle_1033"
        },
        {
            "level": 0,
            "comment": "Dude, you'll have to either get used to it or go tk a gym and get some testosterone (assuming you're a dude) because it'll continue in you 30s. Trust me.🤚🏾",
            "score": 1,
            "author": "Blackfist01",
            "replies": [
                {
                    "level": 1,
                    "comment": "Testosterone really ain’t got anything to do with it lol. Eating+working out for a bigger frame can help with the perception of age for sure tho",
                    "score": 4,
                    "author": "RyanB_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm half joking, I'm honestly just suggesting trying to upgrade your visual maturity.",
                            "score": 2,
                            "author": "Blackfist01"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You will be glad later in life.",
            "score": 0,
            "author": "Dempsey64"
        },
        {
            "level": 0,
            "comment": "Grow you a beard lad that’s what I did",
            "score": 1,
            "author": "little_kid13"
        },
        {
            "level": 0,
            "comment": "While it’s not a guaranteed getting ripped usually changes some features to the face especially with semi obese individuals",
            "score": 1,
            "author": "Lower_Reporter_5781"
        },
        {
            "level": 0,
            "comment": "Accept what you can't change and change what you can. No one is perfect in everything, so focus on honing your strengths.",
            "score": 1,
            "author": "Fantastic_Tomato9755"
        },
        {
            "level": 0,
            "comment": "My daughter is 22. She looks like she is 12. She finds the best way to cope with this is to act mature and tell people your age.",
            "score": 1,
            "author": "Successful-Ad-40"
        },
        {
            "level": 0,
            "comment": "Easiest way to live is to not care what others think",
            "score": 1,
            "author": "OhYugiBoii"
        },
        {
            "level": 0,
            "comment": "People with baby faces are lucky.",
            "score": 1,
            "author": "Chapar_Kanati"
        },
        {
            "level": 0,
            "comment": "its better to have a baby face. wouldnt you like to be 99 still looking 50?",
            "score": -2,
            "author": "deLaSlums"
        },
        {
            "level": 0,
            "comment": "Lucky",
            "score": 0,
            "author": "farmer102"
        }
    ]
}