{
    "id": "1472fy1",
    "score": 0,
    "title": "Missing physical touch",
    "author": "Canadian_Bacon024",
    "date": 1686510750.0,
    "url": "https://www.reddit.com/r/lonely/comments/1472fy1",
    "media_urls": [],
    "other_urls": [],
    "postText": "I (M21) have been single for 2 years now. The longest I have been single since I started dating at 15. I miss having someone to hug, lay in bed with, someone to hold. I just crave physical touch quite often. I feel like I'm withdrawing sometimes. It feels like it's been forever",
    "comments": [
        {
            "level": 0,
            "comment": "That truly sucks. However there are people who post in here who’ve had NO physical touch. For me it has literally been forever, save for the occasional quick hug. I’m past the halfway point of my life and being this touch starved is one of the main things that gets me down.",
            "score": 15,
            "author": "LiabilityLad655321",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I'm 37 and never had a girlfriend although I had the opportunities, so I signed up for massage therapy yesterday and it's kind of expensive but we'll see",
                    "score": 6,
                    "author": "banana-yak"
                }
            ]
        },
        {
            "level": 0,
            "comment": "M21 here. Now imagine never having a girlfriend.",
            "score": 9,
            "author": "HANS510"
        },
        {
            "level": 0,
            "comment": "I havent hugged anyone since I was like 10.  Never dated either.  im 18/19",
            "score": 2,
            "author": "AltforMind"
        },
        {
            "level": 0,
            "comment": "You get used to it. I’m 8 years down",
            "score": 2,
            "author": "DapperDan1929"
        },
        {
            "level": 0,
            "comment": "Oh poor baby. Atleast you know people are capable of loving you.",
            "score": 6,
            "author": "Borov-Of-Bulgar",
            "replies": [
                {
                    "level": 1,
                    "comment": "That kind of attitude is exactly why you're lonely",
                    "score": -8,
                    "author": "Canadian_Bacon024",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Your prolly right",
                            "score": 2,
                            "author": "Borov-Of-Bulgar"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah I agree, this sub is drowning in so much self-pity 🤦‍♀️. Almost everyone is just competing here over who's more lonely, it's pathetic.\n\nAnd I get your longing for physical interaction. I've been in a long-distance relationship for the last 3 years and it can be so fucking difficult.\n\nI genuinely don't know how I'd be searching for a partner in the modern climate; the moment you get out of highschool, people get all so serious and awkward to be around. I don't know a single person around me who's in a relationship outside of their past highschool except me. And I was never in a relationship \"in real life\", so there's that. I guess it really must be something to do with social media rotting our brains, causing us to be unable to communicate, I really don't get it.",
                            "score": 1,
                            "author": "eternal_ttorment",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That last paragraph hit so close, it made me go lie in my bed and pull my covers up. Can you blunt the truth a little bit next time?",
                                    "score": 1,
                                    "author": "munkeysunkle13"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What is your problem?",
                    "score": -7,
                    "author": "Canadian_Bacon024"
                }
            ]
        }
    ]
}