{
    "id": "14769hg",
    "score": 3,
    "title": "Don’t have anyone to celebrate victories with!",
    "author": "MrBamboozle91",
    "date": 1686519673.0,
    "url": "https://www.reddit.com/r/lonely/comments/14769hg",
    "media_urls": [],
    "other_urls": [],
    "postText": "Now while I’ve accepted the fact that I’ll be alone and frankly I’m okay with that cause I love the peace that I have right now. I just don’t have the people to celebrate the small victories that I’ve been accomplishing lately like losing a considerable amount of weight and slowly getting to a point in my life where I can be stable on my own among other things.",
    "comments": [
        {
            "level": 0,
            "comment": "Let’s go buddy! You are awesome!! I hope everything will be good for you!! All your efforts are worth it!",
            "score": 1,
            "author": "HydroPhob1a",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s been one hell of a road but got through it still determined to lose more weight though",
                    "score": 2,
                    "author": "MrBamboozle91"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Theres this group on snapchat, were all kinds of broken people talk about their situation, the idea of this group is to help one another to get trough this. If ur intrested pm me here on reddit for more info.",
            "score": 1,
            "author": "hacket69",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the invite but aside from Reddit I don’t really use any other sort of social media platforms",
                    "score": 1,
                    "author": "MrBamboozle91"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great job, I'm proud of you 💪 i've been doing my diet too with fasting. You gave me aspiration to continue.",
            "score": 1,
            "author": "afi28",
            "replies": [
                {
                    "level": 1,
                    "comment": "I will say it was hell the first month but regardless of the time or how busy I was I still went without fail now it’s a habit",
                    "score": 2,
                    "author": "MrBamboozle91"
                }
            ]
        }
    ]
}