{
    "id": "147dc8f",
    "score": 1,
    "title": "My friend's new friend is jealous of me and is making her block me.",
    "author": "tempaccc289",
    "date": 1686539201.0,
    "url": "https://www.reddit.com/r/lonely/comments/147dc8f",
    "media_urls": [],
    "other_urls": [],
    "postText": "So for context I (16F) am autistic and that really makes me struggle to keep friends and make them.\n\nMy best friend Natalia (15F) is in the special ed class too because of tons of complications resulting from being born 4 months early, one of those being she's also autistic, but on the mid functioning end of the spectrum and she has some intellectual deficiencies, she's about on a 9 year old's level.\n\nShe gets bullied a lot at school, luckily school's over. I was the only rock she could lean on. We are basically two peas in a pod and she's always by my side. Last week she met a guy who I will call David (14M) and really clicked with him. David has no disabilities and is neurotypical. \n\nNatalia and her dad picked me up with David in the backseat and we went to see a movie. We got along at first, he seemed nice enough. We got along nicely and I ended up getting his phone number.\n\nWe texted for a little bit and then he started talking to Natalia about the friendship. Natalia said that she can bring me on meetups with David because we're all friends. David argues that he feels like Natalia cares more about me than about him because she always goes to me first to tell me when something's wrong.\n\nIn the group chat David starts asking Natalia to take a break from me so that she can text him only. She agrees to do it, but she's still over here blowing up my phone and not telling him because she's worried he'll turn his back on her like so many other \"friends\" did to her in the past. David only gets a handful of texts in his private messages a day, but tons in the group chat.\n\nI start messaging David about the whole thing and I notice he blocked me. He has an iPhone, so I thought something was up when all my messages were green. In the group chat he says, \"You know what Natso (Natalia's nickname)? If you wanna text with OP all the time, fine I won't be your friend.\"\n\nNatalia doesn't understand why he started getting that tone with her and she starts showing obvious signs that she's getting sad, by spamming the group chat with 40 messages pleading for him to not turn his back on her. He says that he won't as long as Natalia agrees to block me on text message as well as on Roblox and Discord. She seems super hesitant, and super worried. He ends up basically peer pressuring her to block me.\n\nI feel sad because I feel like Natalia is going to let me down simply because she's being almost forced to by some guy she's only known for a week. It's just so sad because she doesn't know any better. She still blows up my phone with messages. I just feel so conflicted and worried since I feel left out now since David is dragging Natalia into his trap.",
    "comments": [
        {
            "level": 0,
            "comment": "That's messed up. What do your friend's parents think of david and all this?",
            "score": 1,
            "author": "LordSunderland"
        },
        {
            "level": 0,
            "comment": "I don’t think David is Neurotypical or at the least he’s just an asshole. I really suggest talking to Natalia’s parents about him. David isolating her is a bad sign.",
            "score": 1,
            "author": "EmoPoet"
        }
    ]
}