{
    "id": "147wxml",
    "score": 1,
    "title": "The only thing I want in life I prolly can’t have",
    "author": "Revolver-Knight",
    "date": 1686602083.0,
    "url": "https://www.reddit.com/r/lonely/comments/147wxml",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m 20 and I have a dream in this life it’s very simple \n\nI want a home and a partner maybe even a wife get married to love, care for and share it with.\n\n\nThat’s all I want I don’t feel like I’ll get anywhere near accomplish that\n\nTalks with my therapist have helped me realize one of the reasons I would want this is my parents cause they had a nasty divorce and relationship and I watched the whole thing\n\n\nFights that never got physical but my parents would accuse eachother of cheating and other nasty shit constantly \n\nThey kept separating then getting back together trying to make it work even when they officially got divorced they still did it luckily now I think they finally given up.\n\nHere’s how bad it was whenever now they are in the same room I instantly feel like I’m 8 again because I’m expecting them to fight.\n\n\nI love my parents they did a pretty good job besides how they handled their own relationship but life is complicated people are complicated \n\n\nIt’s just I wanna know why i want love and companionship so bad like I know why but why am I built like this why do I feel so fucking ugly and im so boring and socially awkward why am i constantly depersonalizing myself and the world \n\nIt all feels so fake and artificial and I get lonely attacks it feels so cold my chest so just tight all want to do is squirm and cry \n\nI have to force myself out of bed \n\nI’m an emotional eater and I feel like shit cause and then I eat then I feel shittier cause I drown my sorrows in milkshakes or whatever food I’m craving  (milkshakes and icecream are a big one lately)\n\n\nIt feels like Nothing I accomplish in life means anything unless I have someone to share it with.\n\nBut I’m too terrified to put my issues or drive someone away with my issues \n\n\nI know I’m a good person and I give a shot about other people but I think I’m just a lot  to deal with \nI remember I used to thank my ex for putting up with me and my nonsense \n\n\nI feel like all I do is distract myself I’m always day dreaming or listening to music playing a game watching a movie obsessing over how it made who wrote it why they wrote it.\n\nI remember even when I was a little kid I used to have day dreams about being in school and Indiana Jones would come and take me on adventures \n\nI love stories like Lord of the Rings or Star Wars for this reasons big vast places where I can just wander and explore and distract myself from my headspace\n\nEven now I have this feeling of wanderlust I just wanna run away or something or just get into my car and drive on the interstate and see where I end up.\n\nI’m so obsessed with wanting someone being wanted and desperation and needyness is such a repellant for people.\n\n\nMy therapist says it’s good I’m self aware the problem is I’m to self aware I’m constantly stuck in my own head and it sucks",
    "comments": [
        {
            "level": 0,
            "comment": "Play it cool, and don't get too clingy or possessive once you meet someone you like. Sometimes indifference is the key to attracting somebody. If you let them know right off the bat that you're lonely and desperate, you're setting yourself up for failure.",
            "score": 1,
            "author": "PowersEasyForLife"
        }
    ]
}