{
    "id": "1486lsi",
    "score": 21,
    "title": "No friends, no family",
    "author": "Stoic_Lambaster",
    "date": 1686631202.0,
    "url": "https://www.reddit.com/r/lonely/comments/1486lsi",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m a 53 yr old man and I don’t really have anyone.   I have a 7 yr old son that I see on the weekends but he’s the only friend I have.   I’ve tried dating apps and subreddits on here to try to make friends or meet a woman(in hopes of starting a serious relationship), but no luck.   Even at work I don’t have any friends, just a bunch of co-workers.   Am I too boring, old, ugly?    I don’t know.    On a planet with 8 billion people I feel as if I’m on a barren planet all by myself.",
    "comments": [
        {
            "level": 0,
            "comment": "This broke my heart :( I wish you the best of luck! You deserve to be happy.",
            "score": 3,
            "author": "West_Lawfulness_2658"
        },
        {
            "level": 0,
            "comment": "I'm really sorry to hear that.\nI don't know if you have tried this, but what are your interests? Maybe reading? Or history? Astronomy? Are there any like hobby groups or clubs in your vicinity? If you find this, then you already have something in common with that person: Interest.\nIt gives you something to talk about.",
            "score": 2,
            "author": "Arch_Stanton1862"
        },
        {
            "level": 0,
            "comment": "58 year old here.....I am in the same boat.  I feel like I am just doing time.....  Hope good things come to you!",
            "score": 1,
            "author": "voidoid78"
        },
        {
            "level": 0,
            "comment": "Well you do have son, most people your age i talked to only regret one thing, not having a kid. He will grow and he will search for your companion more and more and will be great time for you.",
            "score": 1,
            "author": "Federal-Tradition976"
        }
    ]
}