{
    "id": "148eopb",
    "score": 2,
    "title": "I'm trying my best, I think...",
    "author": "ActuallyGotBanned",
    "date": 1686660525.0,
    "url": "https://www.reddit.com/r/lonely/comments/148eopb",
    "media_urls": [],
    "other_urls": [],
    "postText": "Before bed, my head always fill with thought, regrets and many other things that I want to do. I just wanna write everything down here so I can feel better some how.\n\nToday, I was filled with angry, sadness and extremly alone because everywhere I went, I didn't feel welcome at all. Thing just went bad, there was tears, argument between me and my family then my friend.\n\nEveryday I remind myself about ''being alone is different compare to feeling alone\".  I chose to be alone so I can have more time to do my stuff and pushing myself a little bit everyday but today I was extremely overwhelm with negative feelings that I can't stop it. I tried to ride for at least few hours around the city where I live, went to my favourite coffee shop but I can't feel any better. After that I just went home and listened some of my playlist. I just busted in tears after a few songs while thinking how disappointed I am...\n\nI hope you guys doing well, at least better than me.\nThanks for the read and letting me dump my feelings here...",
    "comments": [
        {
            "level": 0,
            "comment": "I'm sorry you're going through such a hard time, man. \n\nWith regards to you saying you prefer to be alone to do your own thing. Why don't you make 1 day a week or even a month to go out and meet people or friends, then you will get that social interaction,  even going on your bike and to the coffee shop will get you meeting and interacting with people, start off small and it won't be so overwhelming.  I'm rooting for you my guy, also, btw. YOUR NEVER ALONE, come on here, and im sure someone will give you the time of day to have a talk with. Keep your chin up and just keep doing what you're doing. P.s. if your playlist is depressing, you will be more likely to feel isolated and alone. Scientific fact there for you. Try put on somehing upbeat.",
            "score": 2,
            "author": "fantasybook1990",
            "replies": [
                {
                    "level": 1,
                    "comment": "That means a lot to me, thank you. I'm appreciate it.",
                    "score": 1,
                    "author": "ActuallyGotBanned",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Any time my dude, reach out if you wanna chat, I'm here if needed",
                            "score": 2,
                            "author": "fantasybook1990"
                        }
                    ]
                }
            ]
        }
    ]
}