{
    "id": "148sag1",
    "score": 1,
    "title": "Dream girlfriend. (Following the trent)",
    "author": "Independent_Ad_1032",
    "date": 1686697639.0,
    "url": "https://www.reddit.com/r/lonely/comments/148sag1",
    "media_urls": [],
    "other_urls": [],
    "postText": "- Doesn't think I'm weird.\n- Is ok with me being a corny romantic.\n- Laughs at my dumb jokes.\n- My love for her is enough.\n\nIs this so hard to ask for?",
    "comments": [
        {
            "level": 0,
            "comment": "same could be said for guys, coming from a girl grrrr!",
            "score": 4,
            "author": "ticklishflowers",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can't argue that. Didn't mean to make it a comparison post though. 🙆",
                    "score": 1,
                    "author": "Independent_Ad_1032"
                }
            ]
        },
        {
            "level": 0,
            "comment": "in this generation this is too much to ask for, even though you as a person totally deserve it",
            "score": 1,
            "author": "lonelylooner",
            "replies": [
                {
                    "level": 1,
                    "comment": "dont lose hopes tho, i hope u find someone that has these things u mentioned.\n\nFor me a perfect one would be :\n1. Loves me\n2. Cares for me and shows it\n\nthats it I guess",
                    "score": 1,
                    "author": "lonelylooner",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you. I think this is what we all want, and it actually ties in with what I want. These are the things I worry about why people seem to avoid me. I still can't believe so many women treat me weird when I am being romantic. It's like their defences go up, and I feel there is something wrong with me. Even though all I want to do is make them feel special because they are important to me. But sadly the world made romantic guys out to be creeps that just want one thing. \nSo my list is not demanding if you read it in context. :)\n\nEdit: Rereading what I wrote, it sounds a bit argumentative. Sorry. That was not intended at all. I thank you for your kind words, and take to heart what you wrote.",
                            "score": 2,
                            "author": "Independent_Ad_1032",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "no no, you are right, I didnt say your list is the problem, you absolutely deserve what you listed and I understand every word u said, I just said that finding it in this generation is hard, things i listed are hard to find too, otherwise u are totally right.Again, I hope someday u find someone that has the things u mentioned",
                                    "score": 2,
                                    "author": "lonelylooner",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you find, and the same for you.",
                                            "score": 1,
                                            "author": "Independent_Ad_1032"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}