{
    "id": "dnixdr",
    "score": 5498,
    "title": "I am dying and no one is coming to my funeral.",
    "author": "ItreallyistheEnd",
    "date": 1572120008.0,
    "url": "https://www.reddit.com/r/lonely/comments/dnixdr",
    "media_urls": [],
    "other_urls": [],
    "postText": "Throwaway because my main account is for positivity and nothing personal:\n\nI am a 72 year old female who just found out I have stomach cancer.\n\nMy whole life I worked as a neurosurgeon and spent my youth and up until my early forties, going through school and trying to become the very best medical doctor.\n\nI never had kids, was way to busy to marry, and only even had any definition by my career title.\n\nMy life was based on my career and focusing on helping others. It wasn't until my 70s did I realize that all of my family is dead and I never had friends. I had collegues and coworkers, but never any friends. Even as a child, I was always the \"lone\" wolf.\n\nI retired 5 years ago and loved my party. It was awesome having people say goodbye and feeling included. But after that, no one checked up on me or even said anything to me after that day. \n\nMy family like mother, father, siblings, died many years ago. It's now just me.\n\nI realized I worked myself to death and never had a life. Never went on any trips, never met a wonderful man and had children. It was always just me and my patients.\n\nNow that I am dying, I really have nothing left. Most people wouldn't want an older friend or romantic partner, and if they do, I now have to worry about them wanting me for my money as I am a multimillionaire.\n\nTo the people reading: Meet people. Most of you are young. Put family and friends first. And live your life more than your career.",
    "comments": [
        {
            "level": 0,
            "comment": "No one might go to your funeral, but please think of all your patients and their families and friends who would not be here today if it were not for you.\n\nBecause of YOU.\n\nI bet they would be there if they knew. All of those people you helped to give their life back.\n\nJust because no one will be at your funeral does not mean that you haven’t made an impact on people’s lives. You are incredible and if I knew you in ‘real life’, I would be there.\n\nIt’s never too late. There are people out there who care. I don’t know if you are religious ( I’m not ) but it might help if you speak to a hospital chaplain. Just a suggestion? They are brilliant at what they do.\n\nAll the very best to you, thank you for service x",
            "score": 1231,
            "author": "ukGirl80",
            "replies": [
                {
                    "level": 1,
                    "comment": "Absolutely this",
                    "score": 99,
                    "author": "compellinglymediocre"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 4,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, it’s really not what I say in public, it’s what I say whenever anyone needs some help or support. Like I said I’m not religious but I do encounter situations like this frequently. \nYou have no clue about my age, sex, location, career etc so I would politely suggest you try and put yourself in others people’s shoes, which the poster has done all of her life. As do most of the other people on this thread.",
                            "score": 24,
                            "author": "ukGirl80"
                        },
                        {
                            "level": 2,
                            "comment": "I’m sorry that you feel that way but hey ho. I work on an Intensive Care Unit and I see people go through this sort of thing on a daily basis. I have looked after retired doctors and nurses facing similar situations. And I have actually attended a funeral of a patient, so I have actually DONE that. \nJust trying to offer some support to someone going through a hard time.",
                            "score": 7,
                            "author": "ukGirl80"
                        },
                        {
                            "level": 2,
                            "comment": "Border crabs, your comments say more you than than they do about me. Peace ✌️",
                            "score": 3,
                            "author": "ukGirl80",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I didn't say anything about you, so leave me alone. Peace",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Geez..... I’m not a fan of being told I’m great either, because I’m really not, but I wouldn’t say that to someone trying to help....",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I want to become a neurosurgeon... I am so sorry you are going through this. :(",
            "score": 182,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's okay. Just head my warning. Live life and meet people. Don't focus on your career your whole life.",
                    "score": 246,
                    "author": "ItreallyistheEnd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am listening..",
                            "score": 28,
                            "author": "aslomocho"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did you regret living your life that way before you found out about cancer? Meaning did you ever wish that you had met people got married have kids at any point before you received the news?",
            "score": 60,
            "author": "Heals_One88"
        },
        {
            "level": 0,
            "comment": "Damn, this really touched me.",
            "score": 46,
            "author": "x59000"
        },
        {
            "level": 0,
            "comment": "I’m so sorry to hear this, but I’m glad there are people like you in the world who dedicated their lives to helping people! When I was little, my dad went in for a risky brain surgery, and if it wasn’t for the skill of the neurosurgeon and the compassion of the nurses, my life and his might have looked very different. As it is, I had a wonderful man to look up to, who taught me how to be smart and compassionate and curious.\n\nI’m sure this must be scary, but I hope you reach out to church groups, cancer support groups, anything. It’s never too late to make friends. Call an old coworker or three you liked, write letters. You have done amazing things, and you deserve to have some comfort.\n\nI wish you the best. Feel free to message me if you ever want to chat!",
            "score": 37,
            "author": "ProbablyNotAVirus"
        },
        {
            "level": 0,
            "comment": "god im scared this is gonna be me.",
            "score": 26,
            "author": "jenovakitty"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 43,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am from Canada.",
                    "score": 29,
                    "author": "ItreallyistheEnd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 17,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Really wonderful! I live in Québec!",
                                    "score": 25,
                                    "author": "ItreallyistheEnd",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 11,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Trying to sneak in on the ladies fortune, arent ya.",
                                                    "score": 35,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 23,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I know this is probably weird and you were not being serious... But I would really, really kind of love for OP to adopt you. Stay strong, OP, and don't give up, yet. Being alive means having a chance.",
                                                                    "score": 15,
                                                                    "author": "ilumyo",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 4,
                                                                            "author": "[deleted]"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": ":(",
                                            "score": 2,
                                            "author": "Moderig"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I hope you're still around",
                                            "score": 2,
                                            "author": "RandomnewUser_22"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "ya me too",
                                            "score": 1,
                                            "author": "AlphaOmega2606"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m so sorry to heart this. I see that no matter our age we are struggling.i wish you the best. Really.",
            "score": 19,
            "author": "Chokolla"
        },
        {
            "level": 0,
            "comment": "Words can’t express how sorry I am. I think it says a lot about you that you close with advice to us. I think you’re a great person who has done a lot of good for a lot of people. I wish I could be there for you. \n\nI’m taking your advice to heart and will think of it in the future. Thank you.",
            "score": 21,
            "author": "traveling_pineapples"
        },
        {
            "level": 0,
            "comment": "I am sorry to hear about this.",
            "score": 18,
            "author": "Peter_Parker12"
        },
        {
            "level": 0,
            "comment": "I would give you a million hugs if I could. Sending my love to you tonight. You are a hero, please remember that at least",
            "score": 18,
            "author": "jaykay814"
        },
        {
            "level": 0,
            "comment": "You could pay for a carer/companion for your final days.\nSet up a charity/trust. \nOrganise charitable events so that you are surrounded by appreciative people In your final days.",
            "score": 14,
            "author": "hotstepperog"
        },
        {
            "level": 0,
            "comment": "My only advice use your money to help the less fortunate or spend it on yourself or do both. See the world? Fund a school in Zimbabwe? Start a scholarship for young women in your career? Be grateful for the first time you see things more clearly, it's never too late and even the smallest loving acts can mean the world to someone.",
            "score": 12,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I'll be your friend! May not be able to go to a funeral, I'm poor as hell; but everyone needs a friend",
            "score": 10,
            "author": "HangryHunter"
        },
        {
            "level": 0,
            "comment": "You obviously have a lot of love and empathy to give and it's not only heartbreaking that you're going through this but that you also even care so much about the feelings of others that you feel led to hide your situation. I would give anything to be able to give you a hug and hang out with you. As long as you're breathing, there could be ways to change the future you see, though. Could you maybe volunteer (if you feel up to it) even if it's at something laid back like an animal shelter? Or could you see if there's maybe a support group? Maybe even start putting your stories out in the world somehow so your wisdom and the things you've seen will leave a legacy?",
            "score": 7,
            "author": "Alicat40"
        },
        {
            "level": 0,
            "comment": "Dam, that's shame really. If I could I would be your friend, and spend as much time with you as possible. Sorry to hear that.",
            "score": 6,
            "author": "TerribleConcentrate"
        },
        {
            "level": 0,
            "comment": "When i see post like this i always wonder if the OP is still around :(",
            "score": 7,
            "author": "Glittering_Wind_4681",
            "replies": [
                {
                    "level": 1,
                    "comment": "Highly doubt it sadly",
                    "score": 4,
                    "author": "Cultural-Promise1227",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your story touched me and I'm sorry you are going through that. Thank you for your precious advice and for what you did in your life!",
            "score": 5,
            "author": "Karkadino"
        },
        {
            "level": 0,
            "comment": "Hello .. despite my profile picture. If you ever what to talk ,please please by all means come and say hello..\nA heart is too valuable not to connect. I have broad shoulders and an understanding ear.\nMy thoughts are with you.",
            "score": 5,
            "author": "jaygee74"
        },
        {
            "level": 0,
            "comment": "Two years late for this but for anyone still lurking: no, the title could not possibly be true. \n\nIt's almost an absolute that her patients and co-workers organized/will organize a funeral for her after her death, and OP will be missed. I have absolutely no doubts that she told the truth for every other part of her story, but she will not have an empty funeral.\n\nIf you are somehow reading this, godspeed you, OP.",
            "score": 6,
            "author": "greatmanyarrows"
        },
        {
            "level": 0,
            "comment": "Much love and peace send to you. Thanks for\nYour services and realize Everything is gonna be all right. Enjoy the ride and we love you. See you. ❤️",
            "score": 8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Where are you from please invite me to your funeral you seem like a person worth mourning",
            "score": 4,
            "author": "peachycreamsicles"
        },
        {
            "level": 0,
            "comment": "This broke my heart so much. Sometimes we think our careers are what define us but it’s more than that. I don’t really know what else to say.",
            "score": 4,
            "author": "Assbait93"
        },
        {
            "level": 0,
            "comment": "*hugs*",
            "score": 5,
            "author": "appleglitter"
        },
        {
            "level": 0,
            "comment": "I think the saddest thing about this post is that she will never see how many people wanted let her know that even though we know nothing about her we will miss her.",
            "score": 4,
            "author": "Pokemon_addict_"
        },
        {
            "level": 0,
            "comment": "I know this isn't much, and there's nothing I can physically do, but if I met you right now on the street I would spend the whole day with you and try new things in the area with you and learn about your life. I know what it's like to feel really empty and alone, and if I were with you right now I would do everything I could to be with you :) \n\nAnd i really do mean that. a few years ago, I regularly went to a local retirement and assisted living home with my class for school, and I really liked spending time with the people there. I remember this one lady, she was in poor health, probably about 80 years old, and when I tried to give her a small Christmas ornament as a gift, she gave it back to me, and I don't remember exactly what she told me, but it was something along the lines of how I should keep it to remembe her and how good it is to share happiness with other people. I am sure she passed soon after, and I swear to you I could never forget that. I keep that ornament around all year, and every time I look at it or move it or touch it I think about her.\n\njust know that while the isolation may be local, it's not long distance.\n\nI like spending time at my animal shelter, it's a really great place with a lot of volunteers, staff, amazing dogs and cats and rabbits, and in my case a reform program for the county jail. have you the ability to do this?",
            "score": 9,
            "author": "stlvng"
        },
        {
            "level": 0,
            "comment": "I spend alot of time with neos because of my back i wish i had had you the ones i see are such mean cold hearted asshats. \nI live in central NY if i had the funds I would go to your funeral make up a wild story poor a drink out and start a rumor you hid all of your money in a park.\nIf you ever want to talk feel free message me",
            "score": 6,
            "author": "browns4sb"
        },
        {
            "level": 0,
            "comment": "The hardest hitting posts on this sub are from people in their twilight years lamenting that they have nothing left and nothing to look forward to. But these posts are usually written introspectively: they only focus on their wants and needs from their own perspective, which insinuates they might be lonely for a good reason. But your post is a refreshing change as you're focusing on others, and instead of having a whinge looking for commiseration you're offering wholesome advice. It honestly sounds like most of your unhappiness stems from being too selfless earlier in life.\n\nWhile things might not look so rosy for you now please remember that doesn't at all mean you haven't lived a meaningful life, or for that matter have spent most of your life unhappily. Can you think of many professions which have improved the lives of others as much as yours? I can't. Most people live selfishly, never contributing to society in any meaningful way. You've already improved society magnitudes more than most people. If someone like you hasn't lived a meaningful and fulfilling life I don't know who has.\n\nI often worry I'm destined towards a fate similar to yours. Do you mind me asking why you never met a wonderful man to have children with? Any advice on what could've helped you find someone in your late 20s / early 30s? Advice on what could've helped someone find someone like you when younger?\n\n&gt; I now have to worry about them wanting me for my money as I am a multimillionaire.\n\nHave you had a look at /r/fatfire? Great sub for smart people with serious money planning for or wondering what to do in retirement.\n\n&gt; To the people reading: Meet people. Most of you are young. Put family and friends first. And live your life more than your career.\n\nIt seems doctors consistently say they wish they had more time and don't care about the money. Some of my smartest friends from school went to med school, had to work horrible conditions as junior doctors, unsuccessfully tried for several years to get into a specialist area like neurosurgery, and eventually quit medicine altogether. And these are exceptionally smart, good caring people, exactly the kind of people who should be doctors, and now most of them work towards making selfish old men richer. They all said that getting into these specialist areas is impossible as the specialists themselves are the gatekeepers and they don't want competition or the hassle of training up their replacements. It seems crazy that all these doctors work such insane hours and are miserable for it, don't know what to do with all their money, patients suffer through worse healthcare and skyrocketing costs, and countless good young people are denied a fulfilling career.\n\nDo you agree with much of this? Perhaps in your final years you could find happiness and fulfillment in helping more people get into med school or become specialist doctors? Or otherwise improve the lives of young doctors, letting them pursue a family and life outside of work? Maybe do something like contribute towards the creation of a new med school or specialist college? Write up some amazing neurosurgery content on [Wikipedia](https://en.wikipedia.org/wiki/Neurosurgery) or similar? Lobby for policies to improve healthcare / structural changes to the medical industry? Help build or plan for new homes to put downward pressure on house prices, so more young people can go live their lives? Offer to assist with the childcare of young doctors' children?\n\nPlease remember that if you want to pursue such endeavors you need to pursue them yourself. As it sounds like you understand, a happy and fulfilling life without loneliness seldom comes looking for you - you need to stay busy and keep proactively looking for it.\n\nGood luck, and thank you for all you've given society.",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I will be there if you want me to 🙂",
            "score": 3,
            "author": "tophatmikey123",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I have a duality of thought that you might shine sone light on. Ive been alone for most of my life (33years) due to some social conditions that happened in my early childhood. It made me very different from most of people, so finding a kindred soul was always obviously unlikelly for me. So i kind of got used to the single life. I always thought it would be wonderfull to have a family but now it seems its increasingly impossible for me in this state of mind. If i wanted to change that i would have to willfully erase who i was up to this point, and that feals like not being me any more.  \n\nSo my question to you is: If you where regreting your descission to live your life the way you did, would you in your realisation change yourself 100% to be that witch can facilitate the life you wish you had, would that not mean you wouldnt be you any more? \n\nIm still young at this point to know what the right choice is so im not sure what to do about it.\n\nP.S. I wish you the best and i thank you for what you have given to the world with your life.",
            "score": 3,
            "author": "TheEvilN"
        },
        {
            "level": 0,
            "comment": "At least you were doing something great with your life, even if it ended up making you alone and full of regret. I am doing absolutely jackshit and STILL feel alone. I am such a pathetic piece of shit.",
            "score": 3,
            "author": "Master_Bateman69"
        },
        {
            "level": 0,
            "comment": "My hero",
            "score": 4,
            "author": "Sblatt"
        },
        {
            "level": 0,
            "comment": "well you are someone that has helped many people, i thank you for your service.  i am a fellow canadian too! west coast though",
            "score": 4,
            "author": "cryoK"
        },
        {
            "level": 0,
            "comment": "Im sorry this is happening to you. Im from\nSouth America and I would like to be nearest to can have talks with you and make you companion. I have worked 31 years old in health field so we would have a lot of things to talk about.",
            "score": 4,
            "author": "rtmfrutilai"
        },
        {
            "level": 0,
            "comment": "its all good most of us, here won't have anyone coming to our funerals either. besides I learned long ago that people and me don't much care for each other.",
            "score": 4,
            "author": "mythicfallen"
        },
        {
            "level": 0,
            "comment": "Wow! I'm so sorry to hear your sick. Thank you for caring for people and taking care of them. You need to be taken care of now. Its your turn. Hopefully you can find someone even just a friend to talk to. You can always DM me if you need someone to talk to. I'm 33 yrs old F I'm sick as well. Not with cancer but I'll be going to the hospital soon.\n Praying for you.  You've blessed so many lives. A dream I wish I could've done throughout my years. I wish I had better words to say to you.  May God Bless you.",
            "score": 6,
            "author": "MediocreJedi32"
        },
        {
            "level": 0,
            "comment": "You sound like an amazing person and I wish I could meet you. I'm sure you can talk to people on r/penpals!",
            "score": 3,
            "author": "carlsonsg"
        },
        {
            "level": 0,
            "comment": "Start booking some travels! Fly here! You fly and meet everyone that comments. Travel and meet people all at once. And free accommodations.",
            "score": 3,
            "author": "XXXtrogdorXX"
        },
        {
            "level": 0,
            "comment": "What you wrote touched me profoundly, and I can’t even imagine how difficult it must be. I hope that throughout my entire life, I can use what you wrote to inspire myself to try really hard to make friends, even if it kills me.",
            "score": 3,
            "author": "Boxofdirtyfeathers"
        },
        {
            "level": 0,
            "comment": "Hey, get your amazing ass out in that world! Who said you don't have time! Go experience it. You'll meet loads. If you can't travel too easily.. go to a retreat. There are so many. You will be with nature and like minded folk in beautiful scenaric places. Go and love life! You DESERVE it. This is your big chance!",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You are not my friend. You are my brother, my friend!",
                    "score": 2,
                    "author": "PashaBiceps_Bot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pasha bicepts",
                            "score": 1,
                            "author": "Thesongbird1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Damn, one shot at life. And this is how it ends",
            "score": 5,
            "author": "braincelaccount"
        },
        {
            "level": 0,
            "comment": "There’s nothing after this life, I truly believe it. However, if there was then you deserve to be at the top table. \n\nI wish I could attend your send off. Poverty and distance preclude that. Bon voyage and bayete. \n\nGo to whatever with your head held high. Thank you.",
            "score": 4,
            "author": "Zo50"
        },
        {
            "level": 0,
            "comment": "I wish I could say something uplifting. But I simply cannot. I am so sorry.",
            "score": 4,
            "author": "okeedokeeartichokee1"
        },
        {
            "level": 0,
            "comment": "I had dreams when I was younger, things that never came to pass.  In my 50's now, spent a lot of time wondering \"why?\".  Then it occured to me, that though I did not end up where I wanted to be, I have helped enable both my kids to be where they want to be.  Like you, they have both choosen to serve others, and they love their jobs.  For me, it provides some peace and contentment.\n\nYou have enabled SO many more people than I ever will.  I understand that may not alleviate the loneliness you currently feel, but no matter how your final days play out, you can rest knowing you did all you could for others.  Whether no one comes to your funeral, or thousands come to show their respects, you are a true Hero.",
            "score": 2,
            "author": "Frraksurred"
        },
        {
            "level": 0,
            "comment": "I'm sure you have impacted many lives through your profession and those people will be forever grateful for you. If I lived in Canada I'd absolutely attend.",
            "score": 2,
            "author": "5astick"
        },
        {
            "level": 0,
            "comment": "I legit cried just now after reading it, thanks for the advice",
            "score": 2,
            "author": "Wenn_03"
        },
        {
            "level": 0,
            "comment": "Dam did she die?",
            "score": 2,
            "author": "Hateme__loveme"
        },
        {
            "level": 0,
            "comment": "If you're at still reading these, I hope you're doing OK",
            "score": 2,
            "author": "Excellent-Piglet7544"
        },
        {
            "level": 0,
            "comment": "wait where are u? ill come to your funeral :(",
            "score": 2,
            "author": "cherrycolaax"
        },
        {
            "level": 0,
            "comment": "Maybe no one goes to your funeral, although I doubt. But this doesn't mean you'll be forgotten.\n\n\nThere is still life. You're not dead. Do the little things that you've wanted to try. Even something like going a specific park, or making a specific dessert. You lived your life for yourself. That's ok.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Thanks for the advice, but I’ll really miss you wish I could attend funeral even though I’m a complete stranger.",
            "score": 2,
            "author": "MikioUchiha98"
        },
        {
            "level": 0,
            "comment": "I really get the no one is coming to my funeral ... It has been running through my head alot lately.\n\nI'm so sorry that you find yourself in this position.  I recently stopped being a full time family caregiver to two autistic family members. Went from 24/7 to a few hours a week and realized how damn lonely it is. I'm trying to find volunteer opportunities that can help get me out. I wish I knew something that helps. Thank you for thinking of others and I hope you find peace",
            "score": 2,
            "author": "NightVelvet"
        },
        {
            "level": 0,
            "comment": "I realized this at 31. I didn’t have great jobs or make great money. I also didn’t spend time with people around me. I wanted to go on trips. I just never had anyone to do it with, didn’t have the time off, or the money. Now I realize that is so important. I lost a job and suddenly had time to take a step back. Ive been too focused on “making it.” The people around me aren’t going to be here forever. \n\nThank you for posting this. I’m sorry you were alone most of your life. I’ve felt pretty alone most of my life. I don’t have a lot of family. I do hope you find some peace. I have friends of all ages. You can find genuine friends. I would probably just leave out the income part. Start getting out and try to enjoy what time you have. If you can.",
            "score": 2,
            "author": "Flickthebean87"
        },
        {
            "level": 0,
            "comment": "You dedicated your life to a noble cause. Even though you have regrets, and neglected your social life, don't ever think for a second that you aren't a positive force on the world.\n\nAlso, there's still time for a last hurrah. However you'd define that, I hope you make the most of it. You certainly deserve it.",
            "score": 2,
            "author": "NaruTheBlackSwan"
        },
        {
            "level": 0,
            "comment": "You sound like an amazing person. Thank you for helping people your whole life. Just think of all the people who don’t have to have funerals yet because of you. You have helped so many people, and I hope you have a great day. I’m sorry that you don’t have anyone close. ❤️",
            "score": 2,
            "author": "Faj1tas"
        },
        {
            "level": 0,
            "comment": "Wow... thank you for writing this. This is one of the things I’m afraid of. Getting to the top of my career and falling with no one around me. I strive to be the career woman first. Make a name for myself. Family, second; friends, third; self love, fourth and so on... I come from a family where I was the first to get a bachelors degree. My parents came with the clothes on their backs to make it here in the states in 1978. I have to prove to them that I even though I’m not a male I can do it. \nI agree with the person who first replied to you. As a doctor, you have impacted a lot of lives. If it wasn’t for my surgeons I would not be alive. The amount of schooling and dedication to their craft helps others immensely. A neurosurgeon, brain md is simply amazing. The human brain is capable of so much. I hope you find solace. Sending internet hugs your way during this crazy time.\nI will take your advice to heart. Thank you again!",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I’m sorry you’re going through this. I’m chronically single and a loner too, so I’ll probably end up the same way.",
            "score": 2,
            "author": "LiveYourDaydreams"
        },
        {
            "level": 0,
            "comment": "That's really hard. I sincerely admire your career and life accomplishments. I too, live in Quebec and have no family other than my daughter. I've always wanted grandparents, and lack human contact. If you want a friend, I'm in Montreal and would absolutely love to chat and then meet. Your funeral will have at least one person, I'll make sure of that!",
            "score": 2,
            "author": "Jingerblush"
        },
        {
            "level": 0,
            "comment": "I am sorry you life has led to a moment you find yourself longing. I fear that is true for most of us, regardless of what we choose for there is too little time and too much to do. But rest assured, your life was a one well lived. You did what you set out to and you achieved what you wanted in life. Perhaps you did not think of the conseqences but who has the time to when you live for a dream. A person so dedicated. So rich in determination than you are the embodiment of living your dream. I respect you from the deepest parts of my being. You have succeeded where most people fail. And as such, your life is a one well lived. \n\n&amp;#x200B;\n\nSet out to make some friends. It is still possible. No point in telling this to a doctor but we both know life doesn't end until the very last heartbeat. Please feel free to come to us all in times you are lonely.",
            "score": 2,
            "author": "Enlight13"
        },
        {
            "level": 0,
            "comment": "Recently the surgeon who removed my wisdom teeth passed away. Even though it wasn’t a life threatening procedure I was very scared about being put under and also had delayed it for way too long due to lack of funds. My doctor was the most kind supportive doctor and I still remember our entire conversation in the operating room as he tried to calm me down. He also gave my a discount of 30% because I was in uni. \n\nHe was an incredibly kind man and I was very upset when I found out he had died. And had I not been concerned it was inappropriate i would have gone to his funeral. I share this little story to say that you will absolutely be mourned and your life has meant a lot to all of your patients. \n\nIf you still have some mobility enjoy the time you have on a fabulous cruise or train tour. You can meet lots of people that way and they don’t need to find out how much money you have. Or go on ultra lavish trips where everyone has their own money.",
            "score": 2,
            "author": "ForgetfulLucy28"
        },
        {
            "level": 0,
            "comment": "This is my nightmare . I am 24 m  and since early this year i realized that i am probably going to die alone and the one thing that scarred me the most is thinking that when i die no one going to come to my funeral that idea alone terrifies me. I have no friends IRL and only have my family.  My only wish is to die before them.",
            "score": 2,
            "author": "RammusK"
        },
        {
            "level": 0,
            "comment": "Its always just going to be you anyway. We all die alone. You’ve lived a life of selflessness and there’s many people who will be living because of you and what you chose to do with your life. Be alone. Don’t be lonely.",
            "score": 2,
            "author": "ladybuggurl"
        },
        {
            "level": 0,
            "comment": "Feels really bad reading this, I'll keep that in mind. Thank you",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I would come to your funeral, even if just to fill a seat, listen to a few prayers and watch you off. Everyone in life deserves friends by their side. I'm still young but struggling through depression, anxiety, loneliness and suicidal thoughts daily. Even at such a young age I understand how meaningful and warming it feels to have anyone stick by your side. I hope you're feeling okay, live your life and kick the rest of its ass while you're still here. Even if just a passing thought or feeling, I hope you have a wonderful day!",
            "score": 2,
            "author": "Cuteranch"
        },
        {
            "level": 0,
            "comment": "I'm sure the patients you saved will love you enough to come if they knew about this. But this sucks though. Cheers.",
            "score": 2,
            "author": "jpredd"
        },
        {
            "level": 0,
            "comment": "Pm me if you need a friend to talk to to",
            "score": 2,
            "author": "questionoranswerr"
        },
        {
            "level": 0,
            "comment": "Fuck. This made me cry. This may not help, but know that I will think of you.",
            "score": 2,
            "author": "chewy_bird"
        },
        {
            "level": 0,
            "comment": "I'm in my forties and my end will be similar, though at a younger age and for different reasons (I'm disabled and dependent on my parents, and will have no one left and no way to live once they're gone). Haven't had any IRL friends since school and none of them wished to keep in touch, only one online friend who lives far away, no significant other, no close relatives who could take me in, health issues, etc. Another big difference is I never did anything useful with my life and by now I don't expect to. My mental issues are too crippling.\n\nIt hurts seeing someone in a similar situation since I don't come across many. The feeling of no one being there for you at the end of an empty life is a painful one. I don't know you but I rather wish I could attend your funeral just so your life wouldn't end in total isolation. No one should have to go through that. :(",
            "score": 2,
            "author": "tehuti88"
        },
        {
            "level": 0,
            "comment": "F",
            "score": 2,
            "author": "Mohamad45"
        },
        {
            "level": 0,
            "comment": "I’m so sorry. I really am. I know none of us can do anything, but I’m really sorry. I think it’s safe to say that we’d all come to your funeral. I know I would. May you be at peace and enjoy your final time, and I’m sorry 💗",
            "score": 2,
            "author": "superbungiechair"
        },
        {
            "level": 0,
            "comment": "Sorry to hear that about your family and friends but to be honest, if you didn't realize it until now, what did you miss out on?  Nothing.  You fulfilled your career and if I had to guess, your patients were like your family.  You must have had a successful life that made you happy.  That's important too.  Like you, I feel like I have no friends.  The difference is that I'm still working and I have realized it long ago.  If I could offer any advice, look to God right now.  Seek Him.  He is your friend when no one else is there for you.  That's the most important relationship you can have.",
            "score": 2,
            "author": "KiDiTa"
        },
        {
            "level": 0,
            "comment": "I’m 29 year old female who has had two brain surgeries in my twenties to remove brain tumours. Funny I had searched for “lonely” in the search bar and this is the post that came up. Since being off work people’s interest has dwindled and none of my colleagues are in touch anymore. I have found recovery to be quite isolating as it is hard to find someone who understands the effects of the whole situation. Anyway I just wanted to say that I appreciate what you’ve spent your life doing, you didn’t operate on me but you have saved lives just as mine was saved. I have a husband, family and best friends and feel lonelier than ever sometimes now so I guess the grass isn’t always greener. I’m not great at putting things into words but I just wanted to say that I’m thankful for helping others like me. I was given a second chance at life, then another, both because of the skills of a neurosurgeon! How amazing is that. I just have so much respect for you and what you’ve done.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This broke my heart. You have lived such a giving life...",
            "score": 2,
            "author": "WSecondAcc"
        },
        {
            "level": 0,
            "comment": "Oh, granny, I am so sorry to hear these words, I want to hug you tenderly",
            "score": 3,
            "author": "yigitaga32"
        },
        {
            "level": 0,
            "comment": "Before you die take psychedelics",
            "score": 1,
            "author": "LikeHarambeMemes"
        },
        {
            "level": 0,
            "comment": "If u think ur life was a waste, it's not. You've helped thousands of people. You brought smiles to those people. Your one of the best people that I've heard. Living for your patients, and saving lives is the most noble thing that I can think of. You were a real life superhero. Better than a superhero, you've save lives without any superpowers and did it with your iron will and determination.  I hope that you can find someone to love until the end of your days. You deserve a happy ending.",
            "score": 1,
            "author": "Sagemaster124"
        },
        {
            "level": 0,
            "comment": "This is a legitimate fear of mine. I'm young (21), yet I really struggle with forming meaningful friendships. In addition, I'm a senior in college. I will attend grad school, but in a few years because I want to explore my life a little. The part that bugs me about myself is the fact that I sit in my dorm sulking and wishing for company, but then, when I start meeting people, I put them on a back burner. This post serves as a motivation for me, yet, I'm stuck on where to go and what to do, as I am also a lone wolf.",
            "score": 1,
            "author": "bbaker78"
        },
        {
            "level": 0,
            "comment": "It's never too late to make a friend, you just need to try. And if you really are a multimillionaire used the money to help your community and maybe it will bring you closer to the people around you.",
            "score": 1,
            "author": "Obelisk_Inc"
        },
        {
            "level": 0,
            "comment": "Op, I am sorry that you feel lonesome at this point. If we had anything at all in common I'd have been a friend, since I'm always looking up to my elders. You sound like you're an awesome lady. At the risk of sounding corny, your legacy will live on in the lives of people who you've helped in your pursuit of being a wonderful healer, focused only on doing well for others. For that, you shall be missed. I know I'll miss you now that I've heard of you. I could never attend your funeral because I have my own set of problems but for what its worth, all of us commenting want you to know we will remember you fondly. I'm gonna read through your older posts (sorry if that sounds creepy) and maybe we can chat, if you'd like.",
            "score": 1,
            "author": "writenicely"
        },
        {
            "level": 0,
            "comment": "Your last paragraph is very important  but at the same time it is *far* easier said than done.  You can't just magically make friends and family when you've never had any to begin with.  In fact that kind of what you are seeing now.\n\nAlso not for nothing, but so what if someone did in fact want you for your money?  If you are dying anyways, that money will be useless.  I'm not exactly talking about someone who is blatantly  a gold digger, but if money greases the wheels to having a relationship  then so be it.",
            "score": 1,
            "author": "Szos"
        },
        {
            "level": 0,
            "comment": "You were selfless in life and that enriched so many people's lives. And to be honest you dodged a bullet not having children. They can rip your heart out...as mine did. \n\nI'm a teacher and I wish I had only had my students. You have provided a wholesome, lifegiving service and perhaps you don't feel fulfilled, but those you've helped will remain grateful.  \n\nI'm sorry you are alone. But no matter what we come into and leave this world alone.  Your advice is good, but remember the more we are involved in relationships, the more others can hurt us.",
            "score": 1,
            "author": "nubbydog1969"
        },
        {
            "level": 0,
            "comment": "Dang this post hits me hard. While there's nothing much I can add, seeing all these comments being super positive, I'd like to say I respect so much your knowledge for the field. \nLike most people here, feel free to send a PM if you feel like talking more about life!",
            "score": 1,
            "author": "SweetlyIronic"
        },
        {
            "level": 0,
            "comment": "You’ve saved countless of lives. You’ve saved hundreds of families years of heartbreak and grief. Because of that, many people in this comment section and I respect you. You’ve made a huge impact on many people’s lives, even if you don’t see it.\n\n When I was born, I was extremely sick. To  the point where I had a low chance of surviving. But the doctors tried their best to treat me. And I survived! The nurse even told my mom that it was a miracle I lived. Because of them, I’m here today. And many of your patients are here alive and well today because of you! I’m pretty sure that if many of your patients had the chance, they would thank you a million times. You’re an incredible person, and I hope you know that.\n\n Even though I’m just a teenager, I would’ve loved to be your friend. You seem like a really sweet lady! Thank you so much for your service.",
            "score": 1,
            "author": "The_Bitch_Is_Here"
        },
        {
            "level": 0,
            "comment": "I would be almost willing to be that if some of your past co-workers knew of your situation, they would not only come to your funeral but come and comfort you in your time of need. I'm sure you touched many lives throughout your amazing career. People assume things about people. I'm sure that the people you do know through work just assume that you have people close to you and don't need them. I assume my self that you had some kind of close relationships with some of the people you worked with. What you said about working less and making more time for family and friends hits home with me. I completely agree. I'm reaching my 50s and just had another child. I'm going to take the time out for this child. I never really did for my other children and it shows in their adult lives. I wish you luck.",
            "score": 1,
            "author": "anima1mother"
        },
        {
            "level": 0,
            "comment": "if i lived in canada i would go to your funeral, i’m sorry this is happening to you",
            "score": 1,
            "author": "GoonPirate666"
        },
        {
            "level": 0,
            "comment": "I can Skype whenever you feel like talking, maybe we can become friends!",
            "score": 1,
            "author": "Askalany"
        },
        {
            "level": 0,
            "comment": "Wow",
            "score": 1,
            "author": "reddittori"
        },
        {
            "level": 0,
            "comment": "Lady, as least you contributed to world in a positive way. I’m pretty sure your ex patient will come to your funeral.",
            "score": 1,
            "author": "throw-goode"
        },
        {
            "level": 0,
            "comment": "Wow, like wow, thought no one notice- thanks genius and a genius.  Wow LMAO",
            "score": 1,
            "author": "Ladyfromspace"
        },
        {
            "level": 0,
            "comment": "You’re a hero. You dedicated your life to doing what you loved and helping those who needed your skills.  You made those life choices because they were right for you at that time.  As surgeons we sometimes feel invincible, but when we’re presented face-to-face with our own mortality it’s hard not to wonder “what if..” and “was it all worth it...” \n\nI may be off here, but you sound like you were hugely respected and admired. People sometimes need a little nudge to come back into your life. If you reached out perhaps they might surprise you.  I can appreciate it must feel like the loneliest time but you don’t have to be alone, if you don’t want to be. \n\nWish you well, from one Surgeon to another.",
            "score": 1,
            "author": "Former_WonderWomen"
        },
        {
            "level": 0,
            "comment": "OP, I'm in medicine and am doing the same thing you did - dedicating myself to medicine even though it's tearing me apart. Thank you for your warning. \n\nI'm sorry the people that know you aren't there for you. Nobody should be buried without a single soul mourning their death. \n\nI hope from the bottom of my heart that you find some peace in your remaining time.",
            "score": 1,
            "author": "fizzy_lime"
        },
        {
            "level": 0,
            "comment": "I don't know if it helps, but it sounds like you helped a lot of people. You may feel alone, but many people are currently with their loved ones because of you, so you will live on in their hearts.",
            "score": 1,
            "author": "DabIMON"
        },
        {
            "level": 0,
            "comment": "My mum just died. If you would like to mother this pregnant 39 year old, then we would both benefit with no ulterior motives. I hurt but I want to do something positive with the pain. Please message me.",
            "score": 1,
            "author": "masonsnest"
        },
        {
            "level": 0,
            "comment": "I don't know you but you sound like an amazing person",
            "score": 1,
            "author": "ObeyTheDj"
        },
        {
            "level": 0,
            "comment": "I’ll come, and you can put it in your will that I can go fuck myself. \n\nI know it sucks, I’m 24 and I actively try but I don’t have many interpersonal connections just because I’m not good at it. But I do love listening to older people. If you want to chat, feel free. If you want me to come, let me know the details, or have someone relay them to me. Or if not, I’ll think of you. You’ve clearly done too much good for the people around you not to be thought of.",
            "score": 1,
            "author": "youremakingmeanxious"
        },
        {
            "level": 0,
            "comment": "holy fuck.. \nI am so sorry.",
            "score": 1,
            "author": "lavenderskyes"
        },
        {
            "level": 0,
            "comment": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/u_tothanim28] [I am dying and no one is coming to my funeral.](https://www.reddit.com/r/u_Tothanim28/comments/dprn5v/i_am_dying_and_no_one_is_coming_to_my_funeral/)\n\n&amp;nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "score": 1,
            "author": "TotesMessenger"
        },
        {
            "level": 0,
            "comment": "If I wasn’t a poor college student I would go to your funeral. My heart is with you. Thank you for the kind life advice!",
            "score": 1,
            "author": "Pistolf"
        },
        {
            "level": 0,
            "comment": "I’m so sorry. I wonder how many doctors share your fate. It’s a shame. The amount of dedication and hours required from doctors seems incompatible with a happy life, yet so many choose it.\n\nMy dad is currently in the hospital for CHF and ventricular tachycardia. We have been to 4 different hospitals in the past month. \n\nAt our last pit stop, the ambulance arrived too late for his emergency ablation, and the doctor went home. He waited hours for us, missing us by minutes at 10:30pm. My brother got him on the phone and begged him to come back, even yelling at the man at one point. Somebody dropped the ball during the hospital transfer, and the new doc thought my father was in much better shape than he was.\n\nSure enough, after my dad’s nurse updated the doc on my dad’s fragile condition (back-to-back vtach attacks), the doc came back in and worked furiously to stabilize my dad until 4AM. He was the only specialist in town who could help my dad. My dad would have died if the doc had not come back in, and I am so grateful for his work, but I have to wonder how often stuff this happens. Doctors are only human. They need sleep like the rest of us mere mortals. We demand so much because the stakes are so high, but it seems like too much pressure for anyone to handle.",
            "score": 1,
            "author": "FullFatVeganCheese"
        },
        {
            "level": 0,
            "comment": "Well, it could be worse. At least you’re not dying &amp; poor. Nothing is holding you back from going on a trip around the world.",
            "score": 1,
            "author": "Zara02"
        },
        {
            "level": 0,
            "comment": "Okay this might sound crazy but maybe you could contact a local newspaper or community organization and they’d be able to spread your story and gather a group of people willing to come? I’ve seen someone do it before and a few hundred people showed.",
            "score": 1,
            "author": "papi_chulo_imstupid"
        },
        {
            "level": 0,
            "comment": "Do something fun with your money!",
            "score": 1,
            "author": "Mugenohara22"
        },
        {
            "level": 0,
            "comment": "As a 25M just starting to build a social life, this was incredibly motivating. Thank you.",
            "score": 1,
            "author": "zqrt"
        },
        {
            "level": 0,
            "comment": "I sent you a message if you wanted to read it... If you want a friend who's also lonely I'm young but I'm around...",
            "score": 1,
            "author": "Forrealaf"
        },
        {
            "level": 0,
            "comment": "I wish you all the best.  You gave your life saving others lives and giving families their loved ones.  There’s so much honor in that.  God bless you❤️",
            "score": 1,
            "author": "Hockeymamax2"
        },
        {
            "level": 0,
            "comment": "Thank you for sharing this. I will be your friend. Not for the money. I’m thankful I found this subreddit tonight. I’m sending all the love and peace",
            "score": 1,
            "author": "planetarydrudai"
        },
        {
            "level": 0,
            "comment": "I cried reading this. It’s not too late to go enjoy your life right now. Spend your hard earned money and treat yourself and live your life to the fullest. You devoted your life to your career, saving the lives of many and that will not be overlooked. Thank you for your service",
            "score": 1,
            "author": "cakepoprocks"
        },
        {
            "level": 0,
            "comment": "I am so sorry to hear that. This is the first Christmas since mz husband left.",
            "score": 1,
            "author": "mrssuzywojo1"
        },
        {
            "level": 0,
            "comment": "If I could I’d pay my last respects to you ...I’ll keep you in my prayers..God Bless ❤️",
            "score": 1,
            "author": "Venusflytrapp"
        },
        {
            "level": 0,
            "comment": "Sounds like you lived a purposeful life. And you’re not dead yet. You are still reaching out, on here. You helped what I assume are countless patients, and their families. Could you still travel? Why not?  I don’t know how debilitating your cancer is, but if there’s gotta be something you can still do. If you can handle being a neurosurgeon, then you are a badass. You can handle going out on your terms. \n\nAnd having coworkers that you liked and had some kind of relationship with is still kind of having friends, in a way. Not quite the same, but they probably knew you better than a “friend” anyway, especially working in a high-level environment.",
            "score": 1,
            "author": "FreshLifeSmile"
        },
        {
            "level": 0,
            "comment": "I would come to the funeral based on the fact you made a difference in peoples lives while sacrificing your own. Thank you for that. I need nothing in return. 😊",
            "score": 1,
            "author": "SMASH1977"
        },
        {
            "level": 0,
            "comment": "Instead of thinking of the lack of people around you, think about all the people you met in all your years and the memories you're leaving them with. \n\nI move around a lot as a kid and young adult so it was pretty hard to maintain or even fortify friendships or anything. The things that gets me though is whenever someone that I'd met years ago pops up and reminds me of things we did, they tell me what a positive effect I had on them and they're happy to have met me. I'm sure that whenever I kick the bucket I won't have many (if any) people come by but it makes me feel better that a happy memory of me still lives on with someone.\n\nI hope you can look back on the greatness you've accomplished and the all wonderful people you touched and feel better ^.^",
            "score": 1,
            "author": "wickked357"
        },
        {
            "level": 0,
            "comment": "I'm a Backend Engineer and I'm a similar person like you. But I have a policy to make sure I don't stay away from my family (My parents and my single sister).\nBut when It comes to love life, I don't approach anyone or is charming enough for someone to approach me.\nI can't get that 'kick' out anything except my job,so I spent most of my time doing coding and viewing tech conferences.\nPS: I'm an Indian, so I do have a chance for arranged marriage but prefer the other way.",
            "score": 1,
            "author": "CapatainParanoid"
        },
        {
            "level": 0,
            "comment": "https://www.reddit.com/r/NVC/comments/93wu62/the_antidote_for_loneliness/?st=K3378BGU&amp;sh=fb7428db",
            "score": 1,
            "author": "NotTrying2BEaDick"
        },
        {
            "level": 0,
            "comment": "I’m worried I will end up like you. I’m really sorry your alone. As far as the money maybe pretend your poor so someone is less likely to use you. I’ve seen some really older people get married so I guess I wouldn’t say that’s impossible just maybe not most likely. Sorry I’m not very positive or helpful but your story is sad and I wish I could help",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Hi I would like to send you a card if that’s ok.",
            "score": 1,
            "author": "bossct"
        },
        {
            "level": 0,
            "comment": "You never know.  Some of your past patients and co-workers might be at your funeral.  And I bet if you reached out to some of your past co-workers they'd be happy to hear from you.",
            "score": 1,
            "author": "JeffinerLynn"
        },
        {
            "level": 0,
            "comment": "You sound like an incredibly fascinating person. I'm very sorry about your diagnosis. I'm 24 and currently working hard on my career. After my relationship recently ended I have realised I don't have any friends or anything going on in life and I'm really struggling with it. I think it would be an absolute privilege to have met you for anyone in your life. I do hope you're holding up okay. If you ever just want a casual chat about anything in life, feel free to message me, sounds like we could both use a friend.",
            "score": 1,
            "author": "brokenbrocolli"
        },
        {
            "level": 0,
            "comment": "Praying that you find a friend and that you find comfort. I know the progression of cancer is hard and I wouldn’t wish it on anyone. Lots of love from NYC.",
            "score": 1,
            "author": "writemex95"
        },
        {
            "level": 0,
            "comment": "Wow :(",
            "score": 1,
            "author": "IMINFINIT3"
        },
        {
            "level": 0,
            "comment": "Sounds to me like you've enjoyed your purposeful life up until now and you're just bored from retirement. If so, that's no problem at all! Keep finding purpose to pursue till the day you die! If you could do it for 70 years, why not just a few more? :)",
            "score": 1,
            "author": "MILFBucket"
        },
        {
            "level": 0,
            "comment": "Hi, i live in Québec to! Im french. And i know this postis from 1 months i hope ur ok. I just wanted u to know that if anything bad appendend to you (hope not) i'd come to your funeral if i know when and where that is a promise (even if im 6 hours aways from montreal) . I'm a 17 girl and i'm very sad. I don't want you to feel sad so if you feel sad or lonely you can dm me anytime",
            "score": 1,
            "author": "sauce-soya"
        },
        {
            "level": 0,
            "comment": "stay strong &lt;3",
            "score": 1,
            "author": "Tkkool7"
        },
        {
            "level": 0,
            "comment": "I can tell that you had to make huge sacrifices throughout your career. Although nobody may be going to your funeral, you have impacted the lives of your patients and those around you during your Career, you've done a great job and left this important message for those of us who are going through a tough situation in our lives. I'll remember this post for as long as I can. Bless your soul ma'am.",
            "score": 1,
            "author": "Redd_JoJo"
        },
        {
            "level": 0,
            "comment": "&gt;I realized I worked myself to death and never had a life. Never went on any trips, never met a wonderful man and had children. It was always just me and my patients.\n\n&gt;Now that I am dying, I really have nothing left. Most people wouldn't want an older friend or romantic partner, and if they do, I now have to worry about them wanting me for my money as I am a multimillionaire.\n\n&gt;To the people reading: Meet people. Most of you are young. Put family and friends first. And live your life more than your career.\n\nPost refers to work-life balance. You have the right subreddit. I think What you need is a charity will and a pegasos.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "If I was a millionaire\nI might buy friends\n\nIf I could pay someone to care about me I think I would",
            "score": 1,
            "author": "warestoretard"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 0,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "well..............you are about to die.?!  \n\n\nbecause you stopped working  \n\n\nGET BACK TO YOUR PATIENTS AND YOU WILL LIVE   \n\n\nits like....when you retired 5 years ago.....it was as if your significant other passed and now your stomach is full of cancer in response to losing your life long loved one......",
            "score": 0,
            "author": "BenningtonSophia",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Sound advice, life is all about balance. Balancing life, love, and bills. One day I will get there.",
            "score": 0,
            "author": "michiganbliss_420"
        },
        {
            "level": 0,
            "comment": "So much this.\n\nThis can happen even when you aren't pursuing a successful career. I've let fear dictate to me who I am and what I do since I was a babe. My father instilled a fear of the world in me so great that I never pursued my dreams. I used to paint and write for the love of it, but because my parents were poor and neglectful, I turned my beautiful hobby into a career choice in order to move away from home. But all that ended up happening was I made myself hate my passions. Everything I painted or wrote was for the eyes of someone else, and people's eyes are critical, so I stopped entirely.\n\nI just managed to get married, but almost threw the opportunity away because I was afraid of committing to someone my entire life. I didn't think I could do it and was afraid I would hurt them. I've wanted kids since I was nine years old but I'm very possibly facing a future without them as my marriage was impulsive and my spouse is very hesitant to have them with someone like me, who still struggles just to get herself to leave the house.\n\nFamily and community, including children, are the most important aspects of life, but I've squandered so much of mine worrying about making mistakes or how others might judge me. I've wasted career and family opportunities, and have damaged people around me through desperate fear-based actions and paranoid delusions of their intentions for me. Cooped up in my house with no one to see and only my spouse to talk to, I feel like a shell of a person.\n\nThat you managed to help people is wonderful, but I feel what you're saying. I could have absorbed myself in my passion, too. Or I could have done what I did; either way, I would have been where I am at now. This is what some people call being in a \"spiritual crises,\" which I realize now is never having cared for my emotional self. I feel left out of and uninvolved in everything, because that's how I carefully fabricated my life.\n\nCareer success means nothing. Money can't buy psycho-emotional wellbeing. We have to be willing to take the risk of \"losing everything\" in order to give ourselves the things we need. Family and community, showing love, and fulfilling a role in your community are the most valuable endeavors we can take.\n\nSince that is the case, maybe it isn't too late for either of us? I know a chemistry teacher, and she grows very attached to her students. They treat her like family and they rely on her wisdom, sometimes even for personal matters. I don't know what timeline you have, but maybe you can briefly teach future med students what you know, and deftly guide them away from making the decisions you made? There are a lot of kids out there who are caving to the extreme pressure of going through medical school and filling their heads with the idea that their work is now going to be their life. I bet they could use a kind teacher like you to help shake them loose and remind them that they're still human.\n\nEven if your time with them was short, the impact could last their lifetime.\n\nI wish you the very best. Also, not everybody doesn't want an older friend. I've been looking for a \"mom\" figure my whole life. There are plenty of people who are, even if they don't state it.",
            "score": 0,
            "author": "Katibel"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "How distasteful. Your last sentence clearly contradicts your first. Pathetic, seriously.",
                    "score": 3,
                    "author": "fractal_imagination"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Really man?",
                    "score": 4,
                    "author": "LoveNowAndForever",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "RIP: Your bloodline.",
            "score": -1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "If I remember anything, I hope I remember this. Thank you, and rest in peace, whatever your name may be.",
            "score": 1,
            "author": "Puzzled_Mind_7656"
        },
        {
            "level": 0,
            "comment": "Please be fake",
            "score": 1,
            "author": "SUSSYsuspendTEST"
        },
        {
            "level": 0,
            "comment": "Believe in the Universe. It lives through you and will always love and care for you. You are not by yourself. Have faith in that thought. Continue your forward actions while avoiding connecting to your memory. Many of us have already shown that we care and are with you in spirit. Many people have had everything you haven't, and it hasn't brought them much joy. At this point, forget about intellectual dissections and simply believe you lived your life. I will be thinking of you. Amen.",
            "score": 1,
            "author": "Forward-Ad-4330"
        },
        {
            "level": 0,
            "comment": "I hope you’re at rest beautiful soul",
            "score": 1,
            "author": "Bigclinc"
        },
        {
            "level": 0,
            "comment": "This made me tear up reading, if you’re still here (im praying you are and by some miracle recovered) I would love to write to you. i am a 15 year old girl, my grandmother who i loved dearly past away in 2020, i miss her more than anything, she had cancer too",
            "score": 1,
            "author": "kris_your_miss"
        }
    ]
}