{
    "id": "dqt63l",
    "score": 1648,
    "title": "At a high school near me a complete loner that somewhat knew an acquaintance of mine killed himself, nobody really cared. At another school near me, an insanely popular girl killed herself because her boyfriend of 4 years left her, and it was on the local news and everyone in my area knew about it.",
    "author": "throwaway63729199363",
    "date": 1572741265.0,
    "url": "https://www.reddit.com/r/lonely/comments/dqt63l",
    "media_urls": [],
    "other_urls": [],
    "postText": "If “Lonely” was a race we’d be the most mistreated, most disregarded race on earth.",
    "comments": [
        {
            "level": 0,
            "comment": "Reading about this pisses me off",
            "score": 385,
            "author": "KnownAsDane"
        },
        {
            "level": 0,
            "comment": "Had this happen at my high school years ago. Kid no one talked to but me and my friends threw himself in front of a train.  It wasn’t even mentioned, no memorial in the yearbook etc. Popular girl kills her self due to her parents divorce by taking a shit ton of ibuprofen. People from several counties over come to her funeral. Whole page in our yearbook about her and “suicide prevention/help”. No one cares about the loners like us, except other loners.",
            "score": 190,
            "author": "SufficientlyUnknown"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 204,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This.",
                    "score": 27,
                    "author": "lovewinsall"
                }
            ]
        },
        {
            "level": 0,
            "comment": "that's so true. I feel bad for the guy that no one cared about",
            "score": 86,
            "author": "Atype1"
        },
        {
            "level": 0,
            "comment": "I can’t put into words how little faith I have in humanity",
            "score": 68,
            "author": "CManns762",
            "replies": [
                {
                    "level": 1,
                    "comment": "You still have faith? I am sure not.",
                    "score": 12,
                    "author": "thisisobdurate"
                },
                {
                    "level": 1,
                    "comment": "It is only natural to happen these things sometimes, no need to be pessimistic about it.",
                    "score": 4,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What I’m trying to say is that I can’t put into words how I feel about this. It’s like 15 things mixed together",
                            "score": 19,
                            "author": "CManns762",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I understand, I am just rationalizing it.",
                                    "score": 4,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Reminds me of that quote from Joker where he’s on the talk show “If it was me dying on the sidewalk you’d walk right over me”",
            "score": 169,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Literally came to stay this as well",
                    "score": 41,
                    "author": "kyatorpo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thats why so many kill themself. Nobody ever gave a fuck about them",
            "score": 212,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It's kind of sad how society is.Popularity is literally everything and hearing something like this happening is just so disgusting",
            "score": 115,
            "author": "K_artsy002"
        },
        {
            "level": 0,
            "comment": "fuck this society man",
            "score": 27,
            "author": "pjiaowobaba",
            "replies": [
                {
                    "level": 1,
                    "comment": "Collapse is the only salvation.",
                    "score": 7,
                    "author": "thisisobdurate",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Are you talking about a collapse, or *the* collapse from far cry 5?",
                            "score": 1,
                            "author": "CManns762",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yea that’s obviously what he’s talking about in a post about suicide. Dipshit",
                                    "score": 7,
                                    "author": "PainIsForTheWeak"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yo to anyone feeling lonely, I’m sending my love to to you. \n\nKnow that there are MANY people out there. Each one is an individual w m/ their own desires and aspirations. Connect my bro’s and sis’s\n\nAll love, life is suffering but we can make it together",
            "score": 27,
            "author": "TheWiseTortuga",
            "replies": [
                {
                    "level": 1,
                    "comment": "Amen man",
                    "score": 4,
                    "author": "SleepySheepyLady"
                },
                {
                    "level": 1,
                    "comment": "Oh, no shit.",
                    "score": 4,
                    "author": "thisisobdurate"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's like when you see dateline or something about true crime, and if the victim was an attractive woman, they mention it like every 10 seconds, in a way that implies the death was more tragic than if it had been an ugly girl",
            "score": 27,
            "author": "LinoLino321"
        },
        {
            "level": 0,
            "comment": "That’s awful...",
            "score": 37,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I wish there wasn't this hierarchy. Everyone should matter equally. The fact that he died alone should make it more of a point of discussion. Because he probably thought no one cared, and unfortunately, he was right. This is absolutely disgusting. We need to appreciate each other more.",
            "score": 19,
            "author": "SkyGirlCloud"
        },
        {
            "level": 0,
            "comment": "Unpopular statement and opinion, but just look back at Amanda Todd. She flashed a man and eas harassed to suicide, tragic but it only made it onto the news back in 2012 because of her infamous video online, and her popularity. Earlier that same year, a little boy was bullied so much that he killed himself at a terrifyingly young age, and only a few months later his father killed himself as he could not handle the grief. This family received no mainstream media coverage, and nowhere near as many people know about them, despite it tragically and permanently impacting their community. It's simply proof that far too many of us go silently into the night, never to be remembered, or mourned by the people we tried so hard to please, while others, be it because they are more socially adept, more attractive, more impactful, or what have you, will be etched into the minds of our classmates, our coworkers, or even our families far deeper than we could ever be. The world is a cold place, it's cruel, unfair and depressing, but suicide is never the answer, and I'm so sorry you and your community were affected by it. Stay strong man, my prayers go out to you and those affected.",
            "score": 25,
            "author": "SleepySheepyLady",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;suicide is never the answer   \n\nWhat about individuals with illnesses that force them to live in constant, horrifying pain? They do exist, and because of our society taking that same stance, that suicide is never the answer, these individuals are forced to go day-by-day in constant suffering unable to end the pain where drugs exist that could instantly and painlessly kill them, ending the pain, that are kept from those in need due to that extreme stance.",
                    "score": 14,
                    "author": "Thesongbird1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hold the firm belief that if you stay strong through pain and suffering, you will be rewarded. I suffer from a handful of chronic illnesses and mental illnesses that make day to day life an uphill battle, but I still believe that suicide is never the answer, no matter how appealing it may seem.",
                            "score": 3,
                            "author": "SleepySheepyLady",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;I hold the firm belief that if you stay strong through pain and suffering, you will be rewarded.\n\nAh, so you think religiously and want others to suffer because of your beliefs.",
                                    "score": 8,
                                    "author": "Thesongbird1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Actually I'm not religious in the slightest, nor do I wish suffering upon anyone. I just believe that survival is its own reward.",
                                            "score": 3,
                                            "author": "SleepySheepyLady",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That idea, that everyones life is a grand worthwhile story and not just arbitrary decisions of some arbitrary species on a arbitrary planet, is religious thinking. There are countless examples of lives that were not worthwhile in the slightest, I could only hope that you agree to that, at least.",
                                                    "score": 8,
                                                    "author": "Thesongbird1",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I am not saying every life is a grand and worthwhile story, nor that life has any more meaning to it than the continuation of the species, but it is a fundamental and evolutionary instinct to survive that drives all of us, whether we consciously acknowledge it or not. I believe you have entered this conversation with too many preconceived notions as to who I am and what my beliefs are, and for that I apologize as it would appear that I have mislead you in some fashion. Take care.",
                                                            "score": 3,
                                                            "author": "SleepySheepyLady",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Why leave the argument? Its obvious you can state your stances, I can state mine, lets figure out the ground here and have a argument?",
                                                                    "score": 1,
                                                                    "author": "Thesongbird1",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Because I have no interest in an argument or debate. Whether you think I'm right or not is your prerogative, just as it is mine to think that you're wrong. Pointless conflict is just that; pointless, and I have no interest in it.",
                                                                            "score": 5,
                                                                            "author": "SleepySheepyLady",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Argumentation is not pointless, it allows us to connect by improving out own stances on topics. The more refined our stances are, the more confident we are in the effect of our decisions, and our output on the world, if any.",
                                                                                    "score": 1,
                                                                                    "author": "Thesongbird1",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I used to believe that but after so many years, so many trials, so much pain and trauma, i find myself forgotten, alone, daily struggling with my finger on the trigger.",
                                    "score": 1,
                                    "author": "Hittman56",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Never give up the struggle man, or all these years were for nothing. Stay strong my guy!",
                                            "score": 2,
                                            "author": "SleepySheepyLady",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "How very sunk cost of you.",
                                                    "score": 3,
                                                    "author": "snow-pollen"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dude I had an almost identical situation involving my brother. An insanely popular kid at my highschool got diagnosed with cancer and he was all over the news, the school threw an assembly for him, and had a fundraiser for him. My brother who is also a loner got a much more deadly rare form of cancer that required him to the Mayo Clinic and New York and nearly bankrupted our family and my dad had to go into the school to talk them down from holding him back a grade because of how many classes he missed",
            "score": 8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "There was one time in 6th grade I had an accident on school property with a barbed wire fence. My throat was slit open and my knee was cut open badly. I missed the rest of the year (about 2 weeks). When the next year rolled around the first day people were making fun of it and saying that I tried to kill myself. From that point forward I had 0 faith in humanity. At the age of 12 I learned that people are assholes. It pretty much ruined any self esteem I had left.",
            "score": 7,
            "author": "NikoBellic8559",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you or someone you know is contemplating suicide, please do not hesitate to talk to someone.\n\n**US:**\n\nCall 1-800-273-8255 or text HOME to 741-741\n\n**Non-US:**\n\n[https://en.wikipedia.org/wiki/List_of_suicide_crisis_lines](https://en.wikipedia.org/wiki/List_of_suicide_crisis_lines)\n \n --- \n \n^^I ^^am ^^a ^^bot.  ^^Feedback ^^appreciated.",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know definitely, humanity was a FUCKING MISTAKE!!!!!!",
            "score": 24,
            "author": "Original_Sundae",
            "replies": [
                {
                    "level": 1,
                    "comment": "Any sentient race is a mistake...",
                    "score": 8,
                    "author": "oldmc07",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "ye",
                            "score": 4,
                            "author": "Original_Sundae"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Which is why my job is with dogs not humans.",
                    "score": 1,
                    "author": "snuggleDoodle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's nice",
                            "score": 1,
                            "author": "Original_Sundae"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s our fate bro. No use trying to change it. I expect this will be how I end up.",
            "score": 6,
            "author": "gnair3"
        },
        {
            "level": 0,
            "comment": "Honestly I think this really highlights how some people don't recognize how fucking lucky they are. This loner kid probably never had a single person who cared about them their whole life and was a champion for living as long as they did. That fucking girl? Had so many friends and was loved by so many people who cared and as soon as something went bad she killed herself. Fucking took a life so many would dream to have. Over. A. Boy. How fucking pathetic.",
            "score": 5,
            "author": "throwwaaa2"
        },
        {
            "level": 0,
            "comment": "I wish there was a support net for loners. Not a online group, but a physical place you could go to. Idk how to put it, like a traveler's lodge.",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This would probably happen to me tbh.  I will pass with like zero notice as no one cares about me whatsoever.",
            "score": 16,
            "author": "idfcatalltbfh",
            "replies": [
                {
                    "level": 1,
                    "comment": "Im sorry to hear that, please don't lose hope! You're welcome to message me any time if you need to talk, I might not know you, and you might think im bullshitting, but I don't want to see anyone feeling this way man, it's not fair to you or anyone else who has to feel this way, everyone deserves to feel loved by someone, even if it's just themselves.",
                    "score": 7,
                    "author": "SleepySheepyLady"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is why some depressed people resort to school shootings and terrorism, a simple suicide won't get you the attention many suicidal people want.",
            "score": 30,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "no one person is worth more than the other. no exceptions.",
            "score": 7,
            "author": "clairerose3"
        },
        {
            "level": 0,
            "comment": "I've seen this happen on numerous occasions too. One of the saddest things ever.",
            "score": 2,
            "author": "NeutralMinion"
        },
        {
            "level": 0,
            "comment": "Heartbreak is different for many people. Who is to say the girl wasn’t depressed, herself? Simply because of her social class should we devalue facts? Mourn the lost. They are lost.",
            "score": 10,
            "author": "Onyx-Leviathan",
            "replies": [
                {
                    "level": 1,
                    "comment": "The point of the post wasn’t why they killed themselves, it was how they were remembered after",
                    "score": 39,
                    "author": "throwaway63729199363",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Right, I understand. But it still sucks that she killed herself. That is a collection of infinite memories shattered into dust. Same for the aforementioned boy. They both deserve to be missed and cared about.",
                            "score": 14,
                            "author": "Onyx-Leviathan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I agree. Ones popularity (or lack thereof) doesn’t devalue them as a human being. What should be focused on is *why* they killed themselves and how this can be prevented in the future. These are real people we’re talking about. Not just social statuses.",
                                    "score": 21,
                                    "author": "SierraPapaYankee",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "100 %",
                                            "score": 1,
                                            "author": "Onyx-Leviathan"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": -20,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If this is how you think then no wonder you have no friends.",
                                            "score": 3,
                                            "author": "DementedWarrior_",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You’re on here too lol",
                                                    "score": -1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "How is that a valid point?\nI’m just looking at this post and I see you so I call you out, that doesn’t mean I agree with your scummy perspective.",
                                                            "score": 1,
                                                            "author": "DementedWarrior_",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Not everyone that doesn’t share your perspective is scummy nor does it mean you have to project",
                                                                    "score": 0,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "In no way did I imply that I think your perspective is scummy just because I disagree with it. I’m calling it scummy because you called a girl who committed suicide’s life comedic. That is what is scummy. Tell me where I am projecting, or is that just your default response to being called out?",
                                                                            "score": 0,
                                                                            "author": "DementedWarrior_",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "The problem is it was just an assumption not a valid callout. Just the pot calling the kettle black.",
                                                                                    "score": 0,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Then again, isn’t it obvious ? More people being affected by her death is a reflection of how she lived. Community saddened by death of super popular girl whereas complete loner’s go unnoticed. I mean, duh...\n\nE: whinny morons... Seriously, use your freaking brain sometimes before falling into your first automatic reaction which is to blame the whole world for your issues. If you don’t think this is the logical outcome then you long to live in an ideal world, which explains why you suffer so much... \nI’m just as miserable as you fuckos but at least I realize it’s my problem.",
                            "score": -8,
                            "author": "rom1bki"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This makes me mad for my fellow outcasts brother and sisters",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Extroverts always win the popularity contest. But I guess it doesn’t matter since they both are gone.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I feel like everyone is losing faith in humanity from this post and I did too. But from a more optimistic point of view, it may not have been that they didn't care. They may have just not known the kid. In the same way that we are going to care and acknowledge it more when a family member dies than someone on the news. Meanwhile the popular girl was closer to more people. I am more upset that nobody got to know him in the first place than the fact that people didn't know about his death. Though they should still care that a classmate died, it isn't their fault for not knowing about it.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Damn :(",
            "score": 1,
            "author": "bladedwater"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Why has humanity come to this?",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Technically it did, without the use of technology, news like this would never spread as fast as it did. Without news, TVs, radio, anything, her death would've became just as silent, just a few more broken hearts.",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s true",
                                    "score": 1,
                                    "author": "throwaway63729199363"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There other perspectives that could be examined here. Popularity usually follows impacting more people. Hence the group grieving to show support to one another. But if a loner were to kill himself he is only affecting a his limited circle of people. Mentioning it would only bring unwanted negative energy so people choose to avoid it. \nThat doesn’t mean no one was saddened by his/her departure, they just can’t do it in public.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I think I’ve had enough Reddit for tonight…",
            "score": 1,
            "author": "JellyfishManiac"
        },
        {
            "level": 0,
            "comment": "Damn... I wish he was the first \"Joker\"...",
            "score": -10,
            "author": "oldmc07"
        }
    ]
}