{
    "id": "dsh1ru",
    "score": 3687,
    "title": "Do you ever get so lonely you start reading old messages from people you liked/loved at the time?",
    "author": "limitless0727",
    "date": 1573050551.0,
    "url": "https://www.reddit.com/r/lonely/comments/dsh1ru",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Yeah, it just makes me more sad tho",
            "score": 291,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same",
                    "score": 57,
                    "author": "BennyJoe2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sometimes.\n\nWhen I do: I usually end up Cringing. lol\n\n(Also, happy cake day)",
            "score": 196,
            "author": "Undatus",
            "replies": [
                {
                    "level": 1,
                    "comment": "True dat",
                    "score": 17,
                    "author": "ashhhkayyy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I delete them. \n\n&amp;#x200B;\n\nI don't really follow anyone on social media anymore but when I did, I deleted the messages and numbers from past loved ones. It's not that I have a problem with them. It's more that they or I may long for the relationship we used to have at some point. I know it would never go back to that. It's unhealthy to keep that connection. Just imo.",
            "score": 93,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I did the same after awhile of continuing to look back and cry and missing them wishing they were still with me, but it's not healthy at all mentally to do that",
                    "score": 22,
                    "author": "chaotic214"
                },
                {
                    "level": 1,
                    "comment": "Same, most of the time those people I used to love are those that hurt me the most.",
                    "score": 11,
                    "author": "Ella_Richter"
                },
                {
                    "level": 1,
                    "comment": "Same here.",
                    "score": 3,
                    "author": "akash595sj"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sometimes. I'v learned it's hurt but I still do it occasionally.",
            "score": 84,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Yeah, I do. No one gives a crap about me, now.",
            "score": 50,
            "author": "Shubhi_",
            "replies": [
                {
                    "level": 1,
                    "comment": "I read them too but I think there might be atleast some people to care about you.",
                    "score": 2,
                    "author": "itscold2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sometimes. A long time ago I worked at a place with this girl. We exchanged a ton of little notes back and forth everyday. I would always save them and take them home and put them in a box. 20 years later I still have the box full of them.",
            "score": 38,
            "author": "Kamonesis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Aww, this is so heartwarming!",
                    "score": 6,
                    "author": "Deoplan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah, that’s EXACTLY what I do. From that once person..\nIt probably makes me sadder to think how I used to not be so lonely but now I am.",
            "score": 25,
            "author": "StrangerHollander",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep. \nFirst it makes me feel better than it goes downhill really fast.",
                    "score": 13,
                    "author": "Mothertruckerer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just got divorced and i do this on almost daily basis. Read those messages where she told me she loved me. Where she told me i made her feel safe, and whole. Where she told me i was her everything.I will never get any messages like that ever again. Not from her, not from anyone else. I'm one of those that don't get a chance of love, and the chance i got well. It went to the shitter. Those 6 years were my only happy years.",
            "score": 19,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's sucks, I'm not married so I don't know what it's really like, but I've been thru similar too often. I feel for u. Stay strong ma brotha",
                    "score": 1,
                    "author": "Nasty_CaribbeanVybz"
                },
                {
                    "level": 1,
                    "comment": "You shouldn't look at it like that, if you say that to yourself then you are drumming it into your subconscious that \"no, it won't happen  again\", and inadvertently you are more likely to end up there. Of course you can have it again, you just have to diversify enough and explore all avenues, especially online.  There are THOUSANDS of \"the ones\" for each of us.  Not just one. Thats bs",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t know if this fits here but I used to Skype a lot with my closest friends and record our conversations. Years later I like to listen to those conversations, partly because a lot of them have walked out of my life and I still feel the pain today. I’m the kind of person for whom it’s extremely difficult to get over things. I am a wizard at ruminating about the past &amp; wasted opportunities. I spend most of my time in my head and rarely in the present because reality sucks.",
            "score": 13,
            "author": "CPT-812",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sounds exactly like me",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It really feels strange reading group chats that have been inactive for like 2 years now. Like damn, I actually used to talk to these people",
            "score": 11,
            "author": "Bobofthebobs1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dude, that's so fuckin depressing. When you see those group chats full of old friends that you know you will never have a relationship with them again",
                    "score": 6,
                    "author": "thebigchiliboii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "All the damn time, I have no friends now so I go back and read text conversations from when I did have a friend here and there",
            "score": 8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I did (and possibly do rarely).\n\nWhat I have learnt is to embrace the loneliness.\n\nFurthermore, from a recent love experience, I have learned that it is better to be alone than to be with someone who may hurt you, or who has hurt you.\n\nMy advice is to try to find other things to challenge your brain/your life and avoid having this habit. At least that is what what I did and it worked for me.",
            "score": 8,
            "author": "AtHighSpeed",
            "replies": [
                {
                    "level": 1,
                    "comment": "'Embracing the loneliness' only works for a period of time.\n\nAfter 33 years of it, I'm pretty much a loneliness guru.  It's become ingrained in who I am.\n\nSo yeah, people who're on the downswing between relationships, it's a good idea to learn how to be comfortable being by yourself and doing things on your own.\n\nFor people like me who've never had any luck with other people and have become somewhat misanthropic because of it, well...the advice is pretty useless/moot.\n\n(edit:  realized post is probably giving off incel vibes.  No, I don't subscribe to that weird little subculture.  Yes, my post will remain the same regardless)",
                    "score": 4,
                    "author": "sovereign110",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm sorry to hear that. I don't know what to say... 😔",
                            "score": 4,
                            "author": "AtHighSpeed",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's fine.  There really isn't anything to say.\n\nI've made some efforts in recent times to become entirely content without the company of others, *ever.* Trying to go against the idea of human beings *needing* social connections to be happy, or at least content.\n\nI believe it's possible.  But I've had no luck so far.",
                                    "score": 5,
                                    "author": "sovereign110"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Being isolated is painful. I feel it too. I wonder what the hell's wrong with me sometimes. I used to think I was alright, a good friend at least, a good person even. Nowadays I look around and feel nothing but disinterest and spite from people around me. I want to feel acceptance and connection but I'm more alone than ever.",
                            "score": 3,
                            "author": "idmissalot"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I would add to that, add other PEOPLE to your life...",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah reading about the times she used to care about me hurts",
            "score": 7,
            "author": "Mohamad45"
        },
        {
            "level": 0,
            "comment": "When i get sad i usually go see my pics with people i loved to only end up being more sad😢",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I guess I'm slightly different from others - as when I read them, it often makes me happy. Granted it's only from messages from years and years ago (never anything recent). But they remind me that I was once happy.",
            "score": 4,
            "author": "Alexander426"
        },
        {
            "level": 0,
            "comment": "or listen to songs that remind me of them",
            "score": 3,
            "author": "beexk"
        },
        {
            "level": 0,
            "comment": "Yeah. I try not to do it at all though, as it just ends up making me feel horrible.",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Yup. It ends up hurting more though. Especially when all those people are people that have ghosted or betrayed.",
            "score": 4,
            "author": "MagikBiscuit"
        },
        {
            "level": 0,
            "comment": "I told her I’d love her forever, and even after we broke up I still kept my promise",
            "score": 4,
            "author": "rn_spade"
        },
        {
            "level": 0,
            "comment": "I sometimes do although it makes me sad. (I must have a masochistic streak in me lol\nBut  it’s also such a sweet sorrow to remember past experiences even if they ended badly.",
            "score": 3,
            "author": "redwitch-fr"
        },
        {
            "level": 0,
            "comment": "I did this until my PC decided it was a bad habit and died on me a few years ago, eating all the saved stuff in the process. Now I delete old messages from those I no longer know, and block them on social media to avoid mistakenly or intentionally dropping in for a check on them.",
            "score": 3,
            "author": "Horseykins"
        },
        {
            "level": 0,
            "comment": "I’m usually the one who gets dumped so part of my coping mechanism is to Eternal Sunshine them from my life (but w/o the brain damage). \n\nI change their name in my phone (but keep it so I don’t make the mistake of accidentally answering if they call), remove their photos...all of it.",
            "score": 3,
            "author": "SassyTechDiva"
        },
        {
            "level": 0,
            "comment": "Yup, all the time. Sometimes even while they talk.",
            "score": 2,
            "author": "thatawkwardbean"
        },
        {
            "level": 0,
            "comment": "Yeah. It's unhealthy. I delete everything.",
            "score": 2,
            "author": "yamboozzled",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same",
                    "score": 1,
                    "author": "Jennywhocaniturnto86"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I spend way too much time doing this, hurts every time. But I guess it gives me good short-term feelings, but afterwards, it gets me missing that person :(",
            "score": 2,
            "author": "darkriderwithin"
        },
        {
            "level": 0,
            "comment": "Yeah. Makes me feel like they still my care about me",
            "score": 2,
            "author": "Broken-Door"
        },
        {
            "level": 0,
            "comment": "All the fucken time 😩😩😩",
            "score": 2,
            "author": "AdityaDas1432"
        },
        {
            "level": 0,
            "comment": "😂 Oh goodness yes, it’s so embarrassing and painful to read. It makes me want to slap myself like what were you thinking?",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I see pictures more than reading. I get sad as fuck.",
            "score": 2,
            "author": "Rachdingue"
        },
        {
            "level": 0,
            "comment": "I deleted them and then just deleted all my social media that they used too so I wouldn’t try to see how they are. Sadly I’m still very lonely but it gets better in time.",
            "score": 2,
            "author": "VampyreQueen-"
        },
        {
            "level": 0,
            "comment": "Yes I did that too until I was absolutely done torturing myself and now when someone hurts me or things are over i delete everything and it helps",
            "score": 2,
            "author": "CharonXVIII"
        },
        {
            "level": 0,
            "comment": "I find myself doing this. I get caught in the deep dark hole of this. In the end it hurts me. So I delete the messages before I have the chance to get trapped in the cycle.",
            "score": 2,
            "author": "MischaBaller"
        },
        {
            "level": 0,
            "comment": "No, and I'm going to get down voted for this, but I think you guys should start setting standards for yourselves.",
            "score": 2,
            "author": "SensitiveThugHugger"
        },
        {
            "level": 0,
            "comment": "I still look at my ex’s Polaroid pictures we took together. I’m nostalgic and it brings me back to that time of euphoria. However, It was my fault it all fell apart. I don’t know If I’ll ever get over her, but I have become a better person.",
            "score": 2,
            "author": "WeedFlavoredMeat"
        },
        {
            "level": 0,
            "comment": "Hard to do that when the relationships ended so badly. I will delete everything immediately and try to erase them from my mind only to regret it a week later. I don’t think holding on to old messages is healthy at all but sometimes just living in a past memory for a moment when that time meant so much to you is alittle healing in a way. I wish I had saved something as I’ve got nothing to read back on. Unfortunately I’ve not made “good” new memories to replace the old ones and it’s quite disheartening",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Yeah all those jokes and memes",
            "score": 2,
            "author": "lonelyBoi0427"
        },
        {
            "level": 0,
            "comment": "I have to avoid that or I’ll never get it out of my mind",
            "score": 1,
            "author": "Jazulupoopoo"
        },
        {
            "level": 0,
            "comment": "I do it all the time",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Fuck yeah",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Read them and use them as inspiration to better yourself in order to form new connections, new friendships and new relationships.",
            "score": 1,
            "author": "ImLloydM8"
        },
        {
            "level": 0,
            "comment": "Aww this is the saddest thing i’ve read today.",
            "score": 1,
            "author": "lokingfinesince89"
        },
        {
            "level": 0,
            "comment": "I do",
            "score": 1,
            "author": "teriyallada"
        },
        {
            "level": 0,
            "comment": "I just look back at simple times.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I try not to do that u_u happy cake day!",
            "score": 1,
            "author": "I_Cant_L00ve_Y0u",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you",
                    "score": 1,
                    "author": "limitless0727"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yup all the time.",
            "score": 1,
            "author": "TheRealTiGrENG"
        },
        {
            "level": 0,
            "comment": "Yep, specially when I can't sleep",
            "score": 1,
            "author": "Watcher_209"
        },
        {
            "level": 0,
            "comment": "I try not to do that it just makes it hurt more",
            "score": 1,
            "author": "dillon_11"
        },
        {
            "level": 0,
            "comment": "it’s not messages it’s the pictures when I start feeling down about being single and alone I look my pictures from happier times sometimes they make me feel better sometimes not",
            "score": 1,
            "author": "lonewolf2054"
        },
        {
            "level": 0,
            "comment": "Happy cake day!\n\nYou should make new friends. It's hard missing people but try to find new people so you don't have to dwell on the past.",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, but i dont really see myself doint it, whenever i try to talk to someone at school i day something and then get ignored, sometimes even by the teachers",
                    "score": 2,
                    "author": "limitless0727",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I understand how you feel it’s the same for me to",
                            "score": 1,
                            "author": "SherSugarBear"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve never really been the kind of guy to message anyone but I often like to remember good conversations we had and listen to music that reminds me of them",
            "score": 1,
            "author": "Vine13BV"
        },
        {
            "level": 0,
            "comment": "Yes",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Yes - makes me sadder also",
            "score": 1,
            "author": "tal53"
        },
        {
            "level": 0,
            "comment": "I do it all the time",
            "score": 1,
            "author": "bigreal74"
        },
        {
            "level": 0,
            "comment": "Yep so so sad :(",
            "score": 1,
            "author": "Steven242"
        },
        {
            "level": 0,
            "comment": "No. I have myself",
            "score": 1,
            "author": "nibadeyy"
        },
        {
            "level": 0,
            "comment": "Just makes it worse\n\nI should delete them, and the pics, but I cant bring myself to",
            "score": 1,
            "author": "PhoenixQueen_Azula"
        },
        {
            "level": 0,
            "comment": "I rarely do it, but instead watch selfies taken with them or common pictures.\n\nBtw happy cake day :)",
            "score": 1,
            "author": "Sz_DavidHUN"
        },
        {
            "level": 0,
            "comment": "No because I deleted all those messages",
            "score": 1,
            "author": "unquenched-thurst"
        },
        {
            "level": 0,
            "comment": "Makes me feel hurt how our friendship is gone",
            "score": 1,
            "author": "SherSugarBear"
        },
        {
            "level": 0,
            "comment": "No, but if I had them I would read them. I usually get drunk and delete them out of feeling anger or sadness. Wish I could read them though. There’s a handful of people I have lost that would make me feel more alive.",
            "score": 1,
            "author": "CinBones"
        },
        {
            "level": 0,
            "comment": "No, deleted it all. That shit would make me depressed again",
            "score": 1,
            "author": "compellinglymediocre"
        },
        {
            "level": 0,
            "comment": "I used to, now I just think about the memories I’ve shared and regret everything",
            "score": 1,
            "author": "krash_azm"
        },
        {
            "level": 0,
            "comment": "that is not healthy to bring back the memories,I wrote my ex wife notes &amp; peoms all the time,she would read through them from time to time,after the divorce,I found some cards she gave me &amp; read them,brought back all the feelings &amp; depressed me,she was a hoochie &amp; had cheated 3 times,after 12 years I had enough.found out way more crap that went on.I burned all the items that had anything to do with her,made me happy.I have always liked to write my feelings for the person I care about,I miss sharing my feelings with someone",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I did it once and I cringed at myself. Never again lol",
            "score": 1,
            "author": "evilhologram"
        },
        {
            "level": 0,
            "comment": "I did. Looked at them. Deleted them. I still want to forget about it. So this post is kind of a big oof to that.",
            "score": 1,
            "author": "cygnusCraft"
        },
        {
            "level": 0,
            "comment": "Just once, an ex-girlfriend from 2 years ago. The messages make me think two things:\nOne. Together, we make a lots of memorys. Some bad others good, it really didnt matter. We had our time together and if i was going to remember her, i couldnt just make all that time be hate or sadness maybe it took me a while but... All the good memorys that we made cant be just become something like jealousy.\nSecond. We both make mistakes we were young and maybe we werent ready for a relationship... But thinking on that i grown up in a way.\nSo i an few words, i hope she is having a good time in his life. The last time i heard from hear she had a new boyfriend and it was a friend so i think they would make a good couple. I hace other things to do that get sad for someone that is not involved in my life anymore but for the old times i wish a happy life to her and you for taking your time. Love you all, your friendly neighborhood spiderman.",
            "score": 1,
            "author": "Niclay101"
        },
        {
            "level": 0,
            "comment": "No, never had anyone like me before. Try being ugly af with no past lovers or relationships. No one even flirts with me smh 🤦‍♀️😭",
            "score": 1,
            "author": "ESSENCE_OF_CARAMEL"
        },
        {
            "level": 0,
            "comment": "I deleted them and it would make me more miserable if I did",
            "score": 1,
            "author": "iman4476"
        },
        {
            "level": 0,
            "comment": "All the time 😔",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This hit a little to close to home",
            "score": 1,
            "author": "thatoneguywiththenam"
        },
        {
            "level": 0,
            "comment": "Yeeaapp. That I do, hoping to make something of it in the future, but just hesitating so much that I end up leaving it to preserve what was. Ah, how great it is to be afraid to live.\n\nArgh, man I'm tired of all of this. I just want to hang out with someone or something again, y'know? Like not out necessity like we have some time to pass between classes, just genuinely flat out hang out for the sake of it.",
            "score": 1,
            "author": "AceAdequateC"
        },
        {
            "level": 0,
            "comment": "Yeah, I started screenshotting some messages sent to me to reread. It hurts everytime but at the same time, i was happy for a bit",
            "score": 1,
            "author": "Gambino4k"
        },
        {
            "level": 0,
            "comment": "Every. Single. Day.",
            "score": 1,
            "author": "uniquely_un-original"
        },
        {
            "level": 0,
            "comment": "I do this a lot at work. I even look back over it if I want to clarify something or if I thought the guy was flirting with me.",
            "score": 1,
            "author": "Geezenstack444"
        },
        {
            "level": 0,
            "comment": "Every day.",
            "score": 1,
            "author": "feelingalone169"
        },
        {
            "level": 0,
            "comment": "Not even necessarily people I loved, I dont know if friends count as liked. But seeing a \"What ate you doing this weekend?\" Or vice versa being responded too. Just being engaged and being wanted in some degree.",
            "score": 1,
            "author": "iggy6677"
        },
        {
            "level": 0,
            "comment": "heck yes",
            "score": 1,
            "author": "DoraTheHoe"
        },
        {
            "level": 0,
            "comment": "I’ve been doing this a lot lately, it hurts so much but it also makes me smile because I remember how happy i was at the time. not everyone was meant to be in ur life forever, at least you learn a few things.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I tend to look at old photographs and videos of “good times “",
            "score": 1,
            "author": "R2ishere"
        },
        {
            "level": 0,
            "comment": "Re-living moments that were, yet are not gonna be again, my #1 hobby",
            "score": 1,
            "author": "DarkestDark2134"
        },
        {
            "level": 0,
            "comment": "It's like a nostalgic sense, I do not know why but feeling the same thing for half a year. Sometimes I feel sad about it, sometimes feel lucky and sometimes feel nothing.",
            "score": 1,
            "author": "itsngocanh"
        },
        {
            "level": 0,
            "comment": "I save emails and letter from friends and family that I find particularly touching and re-read them when I’m feeling isolated. I don’t tend to hold on to messages from past romantic relationships though. I prefer to just move on from those. Happy cake day!",
            "score": 1,
            "author": "HungryArtSloth"
        },
        {
            "level": 0,
            "comment": "I would but I delete my messages if it was truly important I write it down on a piece of paper so I can have it with me all the time",
            "score": 1,
            "author": "D_OS75"
        },
        {
            "level": 0,
            "comment": "All the time. It makes me sad but I like seeing what almost was",
            "score": 1,
            "author": "Atype1"
        },
        {
            "level": 0,
            "comment": "When I miss my old best friend, I read the good messages. Old inside jokes and memories of our time together. What hurts the most about those is how much we said \"I love you.\" He told me I was about as close to perfect as a person could get. He told me he didn't know how he could get through life without me How could you love me so much and believe everyone else over me?\n\nOne night, when I was drunk, I messaged him. I asked him if he ever cried over losing me. I thought that maybe if he cried, we had something worth crying over. Maybe all that time wasn't wasted. But, of course, he said no, and I wish I'd never asked.",
            "score": 1,
            "author": "bobtheburger1"
        },
        {
            "level": 0,
            "comment": "Doing it as we speak",
            "score": 1,
            "author": "ashhhkayyy"
        },
        {
            "level": 0,
            "comment": "No way",
            "score": 1,
            "author": "ShellInTheGhost"
        },
        {
            "level": 0,
            "comment": "Yes but then I just remember how I had loved ones back then and now I don’t have these people in my life anymore. I try to remember the good times tho",
            "score": 1,
            "author": "sadnessincarnated"
        },
        {
            "level": 0,
            "comment": "Nah! It would kill me and I would get just more depressed. Haha.... \n\nBetter to watch some old good comedy movie, drink some alcohol and cry yourself to sleep.\n\nExactly what I do now.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I can’t read any old message since I’ve deleted all of my old messages with people. There’s no newer messages to archive and read since I don’t talk to anybody. Even my parents can’t really stand me nowadays.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Deleted  all messages of exes, not worth reliving those moments and making myself more miserable/wanting to punch them. \n\nBut yes it get lonely, then I'll just accept the feeling and it goes away after a few hours, when I start pampering myself.",
            "score": 1,
            "author": "nomnimm"
        },
        {
            "level": 0,
            "comment": "yes, all my friends left me",
            "score": 1,
            "author": "transgirl05112"
        },
        {
            "level": 0,
            "comment": "😁",
            "score": 1,
            "author": "foreverru"
        },
        {
            "level": 0,
            "comment": "Delete DELETE deleeeeete! Texts, photos, phone number. You only go back to them when you’re most vulnerable/down...",
            "score": 1,
            "author": "PieOfMine"
        },
        {
            "level": 0,
            "comment": "Yeah, old photographer and overthinking stuff related to it too.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Does my Ex count?",
            "score": 1,
            "author": "AlClemist"
        },
        {
            "level": 0,
            "comment": "I'm in this picture and I don't like it.\n\nI haven't seen my best friend in over half a year and haven't had a full on talk with both sides contributing (and lasting more than 6 comments) since July.\n\nI keep going back to his messages over-analysing if I'm over-reacting that we don't talk anymore, if he has contacted me, how much he talks in the conversation etc.\n\n:'(",
            "score": 1,
            "author": "Lone_Digger123"
        },
        {
            "level": 0,
            "comment": "I never had someone to love, accept for my family",
            "score": 1,
            "author": "Ar_gh"
        },
        {
            "level": 0,
            "comment": "I absolutely do. I don’t think it helps though. I hate pictures and old text messages. Makes me feel regret. Makes me feel like I could have done something different or that the outcome is all wrong now. It’s so hard to live in the now. Apathy and alcohol seems to help me. I don’t give a fuck about anyone but my woman and family. \n\nI miss having dreams and hopes. I miss faith. Everything that happened, even if it’s 15 minutes ago, it’s behind you. Learn to apologize, then learn to find someone or something else you’ll grow fond of. I don’t give a fuck if it’s stamp collecting or building LEGO shit.  \n\nI’m sorry. I’m sure it’s different for everyone. But I want to burn every picture, letter and text message that has been sent to me 6+ months ago. \n\nCreate. Take a walk. Be new.",
            "score": 1,
            "author": "loser_kid_111"
        },
        {
            "level": 0,
            "comment": "Yes...",
            "score": 1,
            "author": "ThrowMeAway666x"
        },
        {
            "level": 0,
            "comment": "I do this to relive the moments when I was happy",
            "score": 1,
            "author": "Entisu"
        },
        {
            "level": 0,
            "comment": "I thaught im alone on this one .",
            "score": 1,
            "author": "xnnyhelpthepain"
        },
        {
            "level": 0,
            "comment": "I have a girlfriend who lives a few states away from me and we lived next to each other for a year but my family moved away because our parents found out about our relationship, we texted for a few months afterward but then her dad took her phone. Every now and then I do this but it just makes me sadder.",
            "score": 1,
            "author": "RoyalRomaNoodle"
        },
        {
            "level": 0,
            "comment": "Yes!!! I Lost my best friend from grade school and I go back to read her emails .",
            "score": 1,
            "author": "ChicagoAl333"
        },
        {
            "level": 0,
            "comment": "Yep, only makes it worse",
            "score": 1,
            "author": "Jcuriosity"
        },
        {
            "level": 0,
            "comment": "Literally did this 20 mins ago",
            "score": 1,
            "author": "giveitachai"
        },
        {
            "level": 0,
            "comment": "Yeah actually! Once in awhile I do.",
            "score": 1,
            "author": "Aaronic93"
        },
        {
            "level": 0,
            "comment": "A bitter cycle",
            "score": 1,
            "author": "liquidchipz"
        },
        {
            "level": 0,
            "comment": "yeah all the time, it just hurts to read them cause those people don't feel the same way\n\nit's a different kind of hurt",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Old post but all the time",
            "score": 1,
            "author": "lightgreenspirits"
        },
        {
            "level": 0,
            "comment": "Fuck that’s sad man",
            "score": 1,
            "author": "TheDeppressedDover"
        },
        {
            "level": 0,
            "comment": "Yes absolutely. It hurts but i would rather feel this pain all the time than that unbearable emptiness",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I’ve deleted all the really close ones I’ve had. So many memories I can’t bear to relive and go back to, no matter how much I want to. The past is the past, and I can’t change it",
            "score": 1,
            "author": "A-fine-conversation"
        },
        {
            "level": 0,
            "comment": "Happy memories. Some still manage to make me laugh.",
            "score": 1,
            "author": "S-021"
        },
        {
            "level": 0,
            "comment": "I’m glad I’m not the only who does this, but I’ve only done it once. Reading messages in my old friend group chat makes me wish to go back to simpler times. But I started to delete old messages because I have no more storage lol.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This one hit a little too close to home",
            "score": 1,
            "author": "Eyupmyduckies"
        },
        {
            "level": 0,
            "comment": "Never had any messages from people I've liked or loved. Never had someone like that.",
            "score": 1,
            "author": "Puzzled_Mind_7656"
        },
        {
            "level": 0,
            "comment": "Not often but it is the loneliest feeling ever when i do",
            "score": 1,
            "author": "HowAreYouAliveCreep"
        },
        {
            "level": 0,
            "comment": "Yes",
            "score": 1,
            "author": "Designer-Ad-8762"
        },
        {
            "level": 0,
            "comment": "yup",
            "score": 1,
            "author": "therewasguy"
        },
        {
            "level": 0,
            "comment": "I do this a lot. It’s like time travel",
            "score": 1,
            "author": "Ok_Ratio_6580"
        },
        {
            "level": 0,
            "comment": "A throwback to the good ol' days ...\nAnd then the current reality hits me",
            "score": 1,
            "author": "Retro_Wiktor"
        },
        {
            "level": 0,
            "comment": "Yes. But it hurts so much as they have deleted most of their messages after we broke up, so it's just me talking to no one. It was a toxic relationship that really dragged me down mentally, but if i could get back with them, i would without hesitation. I miss them so much. Can't even send them the good old happy bday and happy xmas texts, as they blocked me pretty much everywhere. I always try tho, even when I know it won't work.",
            "score": 1,
            "author": "oxigen27"
        },
        {
            "level": 0,
            "comment": "Why is this so relatable? I miss those times when I was happy with them.",
            "score": 1,
            "author": "hasnaindx"
        },
        {
            "level": 0,
            "comment": "All the time 😂 or I go bug people",
            "score": 1,
            "author": "cjtsang"
        }
    ]
}