{
    "id": "ma9lzh",
    "score": 1694,
    "title": "I'm 41 today.",
    "author": "BadHabitsDieYoung",
    "date": 1616370834.0,
    "url": "https://www.reddit.com/r/lonely/comments/ma9lzh",
    "media_urls": [],
    "other_urls": [],
    "postText": "No wife. No GF. No kids. No luck in moving forward in my field of work. No support from those above me who have the ability to help me get a leg up. No reason to get excited about the future at all. I'm on autopilot.\n\nI'm completely disconnected from my family &amp; friends through no fault of theirs. \n\nLife has thrown me a shit-tonne of curveballs, and always at crucial moments which has contributed to my need to continually withdraw from any social interaction outside of work and to reel backwards from the thought of more disappointments. \n\nBack on autopilot for the foreseeable future. \n\nHappy birthday to me.",
    "comments": [
        {
            "level": 0,
            "comment": "Happy birthday bro, sorry life doesn't seem to be going your way at the moment. Here's hoping to a brighter future 🥂",
            "score": 222,
            "author": "moomaric",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cheers mate. Appreciate that.",
                    "score": 100,
                    "author": "BadHabitsDieYoung"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Turned 30 today, similar situation as you. Don't worry bro, happy birthday!",
            "score": 97,
            "author": "MILF4LYF",
            "replies": [
                {
                    "level": 1,
                    "comment": "Happy birthday 🎊",
                    "score": 23,
                    "author": "DoubleXhunter",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks mate!",
                            "score": 11,
                            "author": "MILF4LYF"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am 41.. no wife..she decided she wasnt happy..  2 kids.. I had such plans for my family.. now I dunno. I am sucicidal and I am ready to end it.  Wasnt so scared of death.",
            "score": 33,
            "author": "Silencer271",
            "replies": [
                {
                    "level": 1,
                    "comment": "I went thru the same thing as you at the same time except throw in my wife was having a 3 year long affair. Felt the same way as you at the time. But as time goes on it gets better. I’m 52 now and all that sadness is behind me. \nFocus on your kids. I came to find if you make every decision in your life with the emphasis on what is in the best interest of the kids, you cannot go wrong it will steer your life in the better direction.\n always take the highroad with the ex and never  let your anger and hatred get the best of you.  Life does get better. I know you probably think of everything in the context of you doing everything all as one big family. I did that for a long time, but you just have to let it go realize you still have a family it’s just a bit different.  \nI don’t mean to preach but I saw your comment and I thought back to exactly how I felt when all that shit happened to me 11 years ago thought thought maybe I could help with a few words. Peace out Brother.",
                    "score": 17,
                    "author": "edgarp5499",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I dunno. I dont think I will ever recover. She was the only one my heart and mind agreed on. Only person that has ever felt right. I am trying to be the better person but at the samtime you dont understand how horrible i want to be to her either. How I wanna tell her to F off when she needs something or how bad I wanna lash out.  Its so hard to keep it in.",
                            "score": 5,
                            "author": "Silencer271",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh I def lashed out at her, for a short time. I just made sure the kids were not in the vicinity or were any part of it.\nFor a month or two after , I would send her emails alternating from I love her lets try to fix things and telling her to burn in the deepest depths of hell.  \nBut then after a while I just said fuck it and fuck her she is an asshole and she has to live with her asshole self and did the best thing I could for the kids all the time which some times meant helping her out .",
                                    "score": 1,
                                    "author": "edgarp5499",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah I tried to lash out then retreated. Its hard for me mean to her. So I dunno. I feel bad for the kid though. This wasn the life they wanted.",
                                            "score": 1,
                                            "author": "Silencer271"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Had same situation in my late 30s. Don't worry man.  You can have a better relationship with your kids without her.  She'll never be happy for long. My ex wife is in the process of psychologically manipulating her new husband, changing his identity.",
                    "score": 3,
                    "author": "redditloginfail",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah mine claimed she was being manipulated but gave no reasons why. Honestly I was terrified of her and her forever changing mental state. My kids dont like to be with her and my youngest is having nightmares at her house. They like her in small doses but rather be wtih me. I dunno I still miss her.",
                            "score": 4,
                            "author": "Silencer271",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Relationship withdrawal is an ordeal. I've read it's effect on the brain is similar to opiate withdrawal. Eventually you'll feel glad it's over.  Not now, but eventually !",
                                    "score": 3,
                                    "author": "redditloginfail",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think so.. then I see her.. or talk to her and fall back into the life.",
                                            "score": 1,
                                            "author": "Silencer271"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Happy Birthday!!",
            "score": 16,
            "author": "Gullible_Carpet6610"
        },
        {
            "level": 0,
            "comment": "Happy birthday, and may you chance on something nice that would make you feel excited. Hugs!",
            "score": 9,
            "author": "AutomaticNectarine"
        },
        {
            "level": 0,
            "comment": "The strongest people are the loners, not trying to say that in a glamorizing way, it’s a long term drain of character, that does get beyond lonely",
            "score": 9,
            "author": "tkxboxer"
        },
        {
            "level": 0,
            "comment": "For me depression Is me having a low opinion of myself ,I’ve learned over time that when I’m going through the challenging times of depression,I always  feel like I’m a terrible human being.I’ll always see the things I don’t have as opposed to what I do have.I’m also 40,No wife no kids,It’s actually one of the things I’m grateful for,I don’t know many married people who are happy tbh🤔,The biggest problem is we want change ,but are we willing to try to change ?We need to get out of our comfort zone in order to grow,We need to put ourselves in uncomfortable social situations,Until it gets easier,We need to stay hopeful,Life throws curveballs,They do sting.I volunteer once a week ,it’s so unconfortable most of times interacting with new people ,mostly overly confident people.But it gets a little easier every time,Expecting support and a leg up from those above you will just end in resentment.hopefully you can find the vision to see the things you are grateful for.",
            "score": 10,
            "author": "suicidal_but_hopeful"
        },
        {
            "level": 0,
            "comment": "Happy Birthday!! I hope something happens to get you out of auto pilot. Wish you the best 💖",
            "score": 7,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Sometimes autopilot is helpful...and sometimes not and idk where you're at, but it'll be ok. Hbd",
            "score": 27,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Give me one example when auto pilot mode is helpful",
                    "score": -7,
                    "author": "TomahawkIsotope",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Road trips",
                            "score": 12,
                            "author": "Martholomew7052",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Work",
                                    "score": 9,
                                    "author": "Mexican_Biscuit"
                                },
                                {
                                    "level": 3,
                                    "comment": "U better enjoy ur trip than being on autopilot, when u are alone u dont have the choice bro u have to be on autopilot to not think about loneliness n being bored af",
                                    "score": 2,
                                    "author": "Shycel"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Flying?",
                            "score": 2,
                            "author": "Aeonfinis"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "🎉🎉Happy Birthday🎉🎉",
            "score": 6,
            "author": "Mikey-man-bun"
        },
        {
            "level": 0,
            "comment": "Happy birthday mate.",
            "score": 5,
            "author": "ordinarydepressedguy"
        },
        {
            "level": 0,
            "comment": "Im sorry🤗I hope things get better!Happy bday!\nThough i have to say not having a wife or kids doesn't sound too bad you don't have any commitments to anyone else but yourself you can be selfish and follow your passions or travel on the plus side,it beats having a nagging wife or crying children..I hope you can at least make the most of it.On one hand i see that as a plus but than on the other hand i can kinda relate i like having someone by my side and people to love and who love me..Your not alone if that makes a difference.\nIf you need a friend feel free to hit me up,good luck!",
            "score": 4,
            "author": "makemesmileboi"
        },
        {
            "level": 0,
            "comment": "Happy birthday man. Hope things get better for you",
            "score": 5,
            "author": "badlivingsituation2"
        },
        {
            "level": 0,
            "comment": "Happy birthday 🎉🎂😊",
            "score": 5,
            "author": "ThaCharrbounE"
        },
        {
            "level": 0,
            "comment": "I'm sorry to hear you're feeling this way. Happy Birthday anyway.",
            "score": 5,
            "author": "nyx_moonlight_"
        },
        {
            "level": 0,
            "comment": "I feel you. Its similar like me myself I keep breaking records for 'the worst year in my life'. It's like you keep digging below but it's the emptiness that is a deciding factor. At from what you've said, I won't try to comfort you with motivation but rather bring you the acceptance that life doesn't have to happy at all. Not for everyone. Not for us.",
            "score": 4,
            "author": "ciaLaisvis"
        },
        {
            "level": 0,
            "comment": "Happy birthday! I hope things get better between your and your family...",
            "score": 4,
            "author": "nothingisforfree41"
        },
        {
            "level": 0,
            "comment": "Happiest birthday :)\nSorry that you're feeling this way. You're great just the way you are",
            "score": 4,
            "author": "triviacypher"
        },
        {
            "level": 0,
            "comment": "Happy birthday from fellow autopilot. Cheers!",
            "score": 4,
            "author": "ZealousidealFly4848"
        },
        {
            "level": 0,
            "comment": "Happy Birthday. I do hope some good fortune turns things around for you!",
            "score": 4,
            "author": "Paneho"
        },
        {
            "level": 0,
            "comment": "I hope that this post wasn't made to get a congratulations, but for someone to throw you a reality check. I'm pretty close to becoming what you are right now. But i'l soon be making the choice to change it all.\n\nI'm unsure if it's too late for you to mind mediocrity and step out of the shadows. \n\nBut i'd love to have an open discussion about any aspirations within you that are still alive.\n\nMy DM's are always open brother. Let's hope you are too.",
            "score": 3,
            "author": "poikolle"
        },
        {
            "level": 0,
            "comment": "I hope your birthday wasn't too bad. I'm sorry you don't have a decent support base when it comes to your career, that totally sucks and I can't begin to imagine to tough it is. \n\nLife tends to have a way of kicking far too many good people right in the proverbial balls when things start to seem like they're going to get better. Try not to stay in autopilot so long that you burn out and crash, maybe try something new that you know you would enjoy? \n\nIf you want someone to talk to, feel free to message me.",
            "score": 3,
            "author": "Rainbow_Colored_Fox"
        },
        {
            "level": 0,
            "comment": "If you can’t change the situation, try to change the way you feel about it. The circumstances aren’t as important as your attitude about them. No significant other and no children? That sounds like FREEDOM!!! You are free to do whatever you want to do!! Happy birthday!!",
            "score": 3,
            "author": "lisaloveslashes"
        },
        {
            "level": 0,
            "comment": "Happy Birthday man, if you were anywhere in NI I'd say you have a mate to vent to(or msg me). What advice would you give a 28 year old in your situation? Keep in mind I hate crowds (more than 6 people) and love being alone as a habit",
            "score": 4,
            "author": "ObliviousLobster"
        },
        {
            "level": 0,
            "comment": "Life is so fucking shit, a tight warm family in third world can be so much more happier than all the fucks in first world husslin... \nFirst world societies failed socially... I want a gf and friends that can hug me... I don't want a well paid clerical job that will make me miserable and rob my time... I just want love, am skin starving and starving emotionally and i have been for ten years.",
            "score": 5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "10 years? Invest in getting a life coach or some therapy, my friend. Life ain’t over yet. Get a professional second opinion on your life, it would probably help a lot!",
                    "score": 2,
                    "author": "EarthyMeesh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I had for awhile and it helped me alot but only had when i was in uni because it was provided. I performed much better in studies, i was happier, i got a boost.\n\nBut overtime it faded, the person that helped me could not keep up with so many students and when i finished the degree she had to drop me.\n\nBut I felt understood for once, got better at everything with just that, the heavy feels were lifted. I thank psychologists for that. But they gotta hussle as well, now i have to pay if i want to and that will compromise other stuff...\n\nYou pay psychologists for attention. I want attention from someone that only requires my atttention too, thats a friend, a girlfriend. Otherwise ill have to pay to get basic attention, thats not for everyone, its for those that have lots of money, and that makes me sad, because am not rich.",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Your mental health and happiness is important. Consider it an investment in yourself. You are important. This will play a role in your every day thoughts and you attitude about yourself and about life. Find a way to work it into your budget. Look into resources in your area. This would surely be better for you than, say, a Netflix subscription or junk food or something that isn’t serving you. Consider it a gift for your future self. \n\nOr don’t haha I’m no expert. 🙃 sending you good vibes!",
                                    "score": 3,
                                    "author": "EarthyMeesh"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "“No luck in moving forward” \n“Life has thrown me a shit-tonne of curveballs”\n\n... it seems you are throwing yourself a pity party for your birthday, and it seems like you maybe take the victim mindset in life in some ways. This will never help you “get a leg up” or seem likable to your upper coworkers or the people around you. \n\nPay attention to your internal dialogue. Are your constantly filling your head with negative self talk? And What have you done for those around you to help them get a leg up? \n\nMaybe a good birthday gift for yourself this year would be to educate yourself on the victim mindset and a negative internal dialogue, and start being somebody who focuses more on helping those around you. ‘Do unto others as you would have them do unto you’ type of thing. Maybe pick up a habit that will help you feel better about yourself or life, like meditation, yoga, some sort of physical activity that you enjoy, eating healthy, something like that.\n\nHappy birthday to you! I hope you can look around you and feel grateful for the beauty in nature and humans. I hope you find things you enjoy today. Treat yourself to a nice meal, and to some kind thoughts about yourself. I’m sure you’re an interesting and wonderful person with a lot to offer. I hope you start to pay attention to that and realize it! ☺️☀️🥳",
            "score": 4,
            "author": "EarthyMeesh"
        },
        {
            "level": 0,
            "comment": "I know it sounds trite, but you’re still young and you still have time to settle down. I do hope things look up for you. I am hopeful they will. Also, happy birthday❤️",
            "score": 11,
            "author": "areaunknown_",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am wondering at what age people actually stop saying \"you're still young.\" (honest question)",
                    "score": 17,
                    "author": "himmelsleiter",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably 50",
                            "score": 10,
                            "author": "9848683618"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lmao 🤣 41 ain’t young. Quit blowing smoke up his ass. Just be honest",
                    "score": 1,
                    "author": "PinkKushMaster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well to me it is.",
                            "score": 4,
                            "author": "daysinnroom203"
                        },
                        {
                            "level": 2,
                            "comment": "I mean, based on averages, he’s only at the halfway mark. There is a lot left.",
                            "score": 4,
                            "author": "daysinnroom203"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Happy birthday, lovely stranger!",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Happy birthday 🎁 wishing life will get better for you soon! Hang in there.",
            "score": 3,
            "author": "DoubleXhunter"
        },
        {
            "level": 0,
            "comment": "&lt;3 from one stranger from another. I understand. Happy birthday",
            "score": 3,
            "author": "billyfreddy"
        },
        {
            "level": 0,
            "comment": "I wish you all the best bro srsly , giving you all the love I can possibly give",
            "score": 3,
            "author": "rochef2"
        },
        {
            "level": 0,
            "comment": "What kind of hobbies do you have?",
            "score": 3,
            "author": "Ok_Dealer_3380"
        },
        {
            "level": 0,
            "comment": "happy birthday :( stay strong please.",
            "score": 3,
            "author": "Apprehensive_Lime284"
        },
        {
            "level": 0,
            "comment": "Happy birthday bro",
            "score": 3,
            "author": "Loud_Presentation_21"
        },
        {
            "level": 0,
            "comment": "Heyy! Happy birthday man! Stay strong! You still have a lot of life to live, reach out to people. I am here if you want to talk! I'd be more than happy to listen to you. I genuinely wish you the best life has to offer!",
            "score": 3,
            "author": "IamHereForYou132"
        },
        {
            "level": 0,
            "comment": "happy birthday! *hugs*",
            "score": 3,
            "author": "rj92315"
        },
        {
            "level": 0,
            "comment": "Happy Birthday!",
            "score": 3,
            "author": "mybestdayever"
        },
        {
            "level": 0,
            "comment": "I know it isn't much, but I feel the same way you do. Another year, another anniversary of disappointment. I just want to let you know that I am proud of you for turning 41, and can't wait to see what you do with the next year. You are loved, and people want to see what you can do with your life.",
            "score": 3,
            "author": "Nitro7311"
        },
        {
            "level": 0,
            "comment": "happy birthday!! i hope you find a copilot soon",
            "score": 3,
            "author": "madmansmarker"
        },
        {
            "level": 0,
            "comment": "Happy birthday! I'm sorry you're having a rough time... hold on to whatever small positives you can and hopefully you will get out of your funk",
            "score": 3,
            "author": "Hamchunk81"
        },
        {
            "level": 0,
            "comment": " Happy birthday  man, hope that everything will work out for you, you deserve love and happiness. Much love from an internet stranger &lt;3",
            "score": 3,
            "author": "agones91",
            "replies": [
                {
                    "level": 1,
                    "comment": "Happy (ironic) cake day",
                    "score": 3,
                    "author": "WaifuYahu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "thank you, but its not my cake day, there is a bug with my profile, it always says its my cake day but its not :/",
                            "score": 3,
                            "author": "agones91"
                        },
                        {
                            "level": 2,
                            "comment": "OHhhhhhhh you said ironic cake day, I'm so stupid",
                            "score": 2,
                            "author": "agones91"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Happy Birthday dear and know that you are still young and you have years to come (mostly happy i hope)\n\nKnow that your life is worth more than those boxes we tick to confirm we are happy",
            "score": 3,
            "author": "H_241188"
        },
        {
            "level": 0,
            "comment": "Happy birthday bro! \n\nRemember it’s never too late to switch jobs or careers. \n\nYou can meet people through hobbies, games and sports. Meetup has online groups.\n\nDon’t be loyal to a company, they’re not loyal to you.",
            "score": 3,
            "author": "hotstepperog"
        },
        {
            "level": 0,
            "comment": "Dude. Make the most out of your life. You don’t live twice. Quit acting like it. You aren’t old af. You still have time to write your story. Don’t feel sorry for yourself.",
            "score": 3,
            "author": "Ntking51360"
        },
        {
            "level": 0,
            "comment": "Hi,im 40(41 in a few weeks)no g.f. never married,no kids,stuck in same job 23 years,,i wont say it doesnt get me down at times,as it does,but i dont give up hope lol i look at all the people who are getting married and having kids even in their fifties!!still lots of years for you to find happiness mate,chin up and good luck to is both",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Hey, you have a job, a home and freedom that most of the guys in their 40s fantasizes about.",
            "score": 3,
            "author": "Kirkaaa"
        },
        {
            "level": 0,
            "comment": "Thats the dream. You dont need anybody's help. You are better on your own!\n\nGood luck with your future.",
            "score": 3,
            "author": "Feeling_Flow_2754"
        },
        {
            "level": 0,
            "comment": "I'm 43, never married, no kids, I date but nothing ever gets serious thanks to my bipolar, currently unemployed with no prospects thanks to my health issues, no support system of any kind. This time last year I was in acute rehab learning to be a paraplegic. This year I'm back at the hospital with a skin infection bad enough to almost make me lose my leg. I'm also reclined in bed, listening to the tragically hip and eating ice cream and having a pretty decent night. \n\nCreate your own value. Decide what brings you joy and do that. There's always a silver lining if you look. Don't stop looking.\n\nThings will get better for you, of that I'm sure. Happy Birthday, my guy.",
            "score": 4,
            "author": "mouthfullofhamster",
            "replies": [
                {
                    "level": 1,
                    "comment": "Love this. Wonderful advice. Thank you for sharing. I hope for the best for you! ☀️",
                    "score": 3,
                    "author": "EarthyMeesh"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Happy Bday to you man. You can make this bday more special by donating a small sum to your fav charity or orphanage.",
            "score": 4,
            "author": "lonesheephk"
        },
        {
            "level": 0,
            "comment": "Try and make a friend",
            "score": 2,
            "author": "dwayne13ellis"
        },
        {
            "level": 0,
            "comment": "Happy Birthday! I wish you well",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Hbd ... im 33 same position",
            "score": 2,
            "author": "chankinfai"
        },
        {
            "level": 0,
            "comment": "Happy birthday 🎁🎂. Keep your head up. Tomorrow’s a new day. It will be a beautiful one.",
            "score": 2,
            "author": "xlXCtrlAltDeleteXlx"
        },
        {
            "level": 0,
            "comment": "Happy Birthday🖤",
            "score": 2,
            "author": "SnooRegrets9084"
        },
        {
            "level": 0,
            "comment": "Probably doesn’t mean much coming from a 17 year old, but happy birthday man. I hope things look up for you.",
            "score": 2,
            "author": "alternativesnek"
        },
        {
            "level": 0,
            "comment": "No alarms and no suprises",
            "score": 2,
            "author": "Kirklai",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok computer",
                    "score": 1,
                    "author": "Sceenwatcher"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Happy Birthday! 🎉 You're not alone. I hope things get better for you ☺️",
            "score": 2,
            "author": "DreamlikeNile"
        },
        {
            "level": 0,
            "comment": "Happy Birthday. I’m sorry.",
            "score": 2,
            "author": "84lele"
        },
        {
            "level": 0,
            "comment": "Happy birthday brother",
            "score": 2,
            "author": "BurstIntoBlue"
        },
        {
            "level": 0,
            "comment": "I’m just less than half your age but trust me, we’re all here for you. Things will get better and you’ll find the reason to escape autopilot mode soon. My messages are always open if you just want to share your story or have someone to talk to.\nHappy birthday!",
            "score": 2,
            "author": "josh30601"
        },
        {
            "level": 0,
            "comment": "happy bday",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Happy birthday! If you feel that sad, you should tell how you feel to your family, or trusted friend/s. They'll help you out more than anyone.",
            "score": 2,
            "author": "Kray_The_Fin"
        },
        {
            "level": 0,
            "comment": "Happy birthday &lt;3",
            "score": 2,
            "author": "Santa69XD"
        },
        {
            "level": 0,
            "comment": "Happy birthday man. It Is sad that you are alone. Get a hobby and you can enjoy ur days better I guess.",
            "score": 2,
            "author": "MediumAction3370"
        },
        {
            "level": 0,
            "comment": "Happy birthday !!",
            "score": 2,
            "author": "JanPachimari"
        },
        {
            "level": 0,
            "comment": "Hi: am 50 and dependent on my wife. I feel I got cheated to this situation.  stuck. I should be glad your not in my situation. smarter than me. Be glad and be happy.\n\nIf I could, I would have an affair just to make my life more beautiful, and lusty.\n\nfind a friend, better yet a lot of friends and be happy. your free to do what you want. even get married.\n\nHappy birthday",
            "score": 2,
            "author": "Super-Short-Life"
        },
        {
            "level": 0,
            "comment": "Happy Birthday! I'm sorry for your circumstances and hope that good wishes will help. Stay safe and sane, we're rooting for you!",
            "score": 2,
            "author": "WaifuYahu"
        },
        {
            "level": 0,
            "comment": "This is what work and society does to me, I feel ya!",
            "score": 2,
            "author": "Carib0ul0u"
        },
        {
            "level": 0,
            "comment": "Happy birthday.  \nBirthdays do become just another day quickly. Do something nice for yourself and allow yourself a treat. You've made it this far.",
            "score": 2,
            "author": "Able2c"
        },
        {
            "level": 0,
            "comment": "Happy birthday my dude😁",
            "score": 2,
            "author": "TrizMichelle"
        },
        {
            "level": 0,
            "comment": "Happiest of birthdays. I don’t know you but you will be in my thoughts today",
            "score": 2,
            "author": "NoImDirtyDann"
        },
        {
            "level": 0,
            "comment": "Happy birthday buddy. I’ll be in a similar situation this August but 44. There’s always a chance things can turn around.",
            "score": 2,
            "author": "Aggravating_Sun_5547"
        },
        {
            "level": 0,
            "comment": "Happy birthday to you,hang on there,life will offer your greatness soon",
            "score": 2,
            "author": "Desperate-Record490"
        },
        {
            "level": 0,
            "comment": "Happy birthday. I found myself on autopilot for years. Is there anything that above all makes YOU happy?? Please be easy on yourself!  Do something for you!",
            "score": 2,
            "author": "bunnyb2004"
        },
        {
            "level": 0,
            "comment": "Happy birthday, mate! let's drink to that",
            "score": 2,
            "author": "xzerocool277"
        },
        {
            "level": 0,
            "comment": "Snap out of it! There’s still time! Happy birthday.",
            "score": 2,
            "author": "melaningoddess____"
        },
        {
            "level": 0,
            "comment": "Happy Birthday!!",
            "score": 2,
            "author": "general_ironwood5"
        },
        {
            "level": 0,
            "comment": "Happy Birthday.. Treat yourself today.",
            "score": 2,
            "author": "J_Beyonder"
        },
        {
            "level": 0,
            "comment": "Happy birthday dude, and many more to come.",
            "score": 2,
            "author": "Doireallyneedaurl"
        },
        {
            "level": 0,
            "comment": "thats a vibe.",
            "score": 2,
            "author": "indian_child_"
        },
        {
            "level": 0,
            "comment": "Happy birthday.  Virtual hugs, if you want them.\n\nIt's hard to be childless in today's world (I am almost 51 and can't have children).  I hope you enjoy your work, even if you're not 'high up' in your field.",
            "score": 2,
            "author": "Antique-Confidence-4"
        },
        {
            "level": 0,
            "comment": "Happy belated birthday, man. \n\nI sincerely hope you find the strength to get out there and keep trying.\n\nIt's not too late to find someone to love you. It's never too late.",
            "score": 2,
            "author": "LonelyInLA92"
        },
        {
            "level": 0,
            "comment": "Happy Birthday! \nIt's never too late :)",
            "score": 2,
            "author": "Noob_r_"
        },
        {
            "level": 0,
            "comment": "Happy Birthday! Hang in there.",
            "score": 2,
            "author": "PriscaLS"
        },
        {
            "level": 0,
            "comment": "Happy Birthday 🎉🎉 Don’t worry you will soon get off of autopilot and soon love the life your truly deserve",
            "score": 2,
            "author": "Lonelygyal"
        },
        {
            "level": 0,
            "comment": "Happy Birthday dude! That's all I can say. But hope you have a better future.",
            "score": 2,
            "author": "stingraytjm"
        },
        {
            "level": 0,
            "comment": "Happy birthday to you, hope you find a way to feel happy.",
            "score": 2,
            "author": "LauraMart"
        },
        {
            "level": 0,
            "comment": "happy birthday!!!",
            "score": 2,
            "author": "juliusfito"
        },
        {
            "level": 0,
            "comment": "Happy Birthday!",
            "score": 2,
            "author": "theresa080"
        },
        {
            "level": 0,
            "comment": "Happy Birthday bro, I'm dreading my 34 coming up. Try to remember the Pandemic has added so much extra stress. PM if you wanna chat.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Happy late birthday, you still have a lot of life and it’s up to you what to do with it. I hope you are better soon",
            "score": 2,
            "author": "Ebright17"
        },
        {
            "level": 0,
            "comment": "Happy belated birthday",
            "score": 2,
            "author": "CoffyLuvrrr"
        },
        {
            "level": 0,
            "comment": "Happy belated birthday",
            "score": 2,
            "author": "Momchal"
        },
        {
            "level": 0,
            "comment": "happy birthday :)\nyou are stuck, it's ok it happens to the best if us..\nit happend me a few times in life, everytime I decided to change things, changed the envirment job city the people I hang out with, I changed what I could and it helped, you have to keep moving that's how energy flows that's how things move in life.\nthe last time I was stuck I left my job and moved to another city, then I found out about this thing called Faster EFT, it's a way to get rid of trauma and boy did it help, wow, I'm a changed person I have no fear of getting stuck again because I know the root of it and I can control it now and get rid of what's not serving me.\n\nand gratitude is also important, look at all the good stuff in life, you are healthy you are alive go do somthing that you love, take that trip do what makes yiu feel good and be happy life.",
            "score": 2,
            "author": "IAia8668"
        },
        {
            "level": 0,
            "comment": "Colonel Sanders didn't start KFC until he was in his 70's and struggled with failures and depression his whole life. Never give up brother 🤘",
            "score": 2,
            "author": "Mr_Appalachia"
        },
        {
            "level": 0,
            "comment": "Life is short. Move forward and try something new ! We all need connections",
            "score": 2,
            "author": "Mission-Deal"
        },
        {
            "level": 0,
            "comment": "Happy birthday my man",
            "score": 2,
            "author": "Deppresseddummy"
        },
        {
            "level": 0,
            "comment": "Happy birthday man. If you ever want to chat I'm here.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Happy birthday mate",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Man I'm so sorry. Dont know why maybe because it's one of those days but this actually made me tear up a bit. Just know I feel your pain and I wish only the best for you. I hope things can work out in your favor soon. I know it's hard but try to keep your head up. Sending you love.",
            "score": 2,
            "author": "theragedgamerking"
        },
        {
            "level": 0,
            "comment": "I'm 39, and due to mental issues (ADHD, PTSD, depression) and an abusive ralationship, in the same boat as you regarding my hopes/motivation for the future. It'd be nice to have someone like me to talk, so you're very welcome to send a pm.\n\nAnd happy birthday man, at least try to make this day yours!\n\nEdit: just now saw how old this post is...fuck my adhd...",
            "score": 2,
            "author": "Sors57005"
        },
        {
            "level": 0,
            "comment": "Hey man I recommend you check out Jocko Willink his mindset helped me get over my own shortcomings and become someone with perspective.",
            "score": 2,
            "author": "Puzzleheaded_Bus8683"
        },
        {
            "level": 0,
            "comment": "Feeling sorry for you bro. In my early 30s. Similar situ. Hope you get what you need.",
            "score": 2,
            "author": "yoyoioi"
        },
        {
            "level": 0,
            "comment": "Sorry man",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cheers for that.",
                    "score": 2,
                    "author": "BadHabitsDieYoung"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey ya know, you can jump out of a plane tomorrow if you wanted. Just saying. Happy birthday autopilot and happy birthday real you too. He/she’s in there somewhere.",
            "score": 3,
            "author": "aaaggggrrrrimapirare"
        },
        {
            "level": 0,
            "comment": "Spend some time really locking down what you want to do with your life. Pick one or two things you know you can achieve and work towards them. Make a roadmap on how to get there. Consider moving, or even a working vacation. There’s a big world out there. Don’t let yourself get down on life because you don’t have any meaningful connections at the moment. Maybe it’s time for you to shuffle your deck and start a new hand? I’ve been where you are. When you feel down, think about those who don’t have the same opportunities as you. And live for them. If you can’t find a way to do that, there’s no helping your situation.  Every single day, push yourself to be the best “you” that you can possibly be at any given time. Don’t feel bad when you fall short. You’re allowed to have cheat days, and cheat weeks. Just promise yourself you’ll pick up the fight with a vengeance when you can. Like getting back into running, it’s hard at first, but it progressively gets easier and even starts to feel good. Really good. \nLive well, I hope by 45, you can look back and be proud of the decisions you make in the coming weeks and months.",
            "score": 3,
            "author": "Humananswers"
        },
        {
            "level": 0,
            "comment": "49 year old guy here. The best thing I can tell u is to have a plan for your future. Who do you want to bury/cremate u. Do u want to pay for it or do u have a plan for someone else to do it? Treat people well. They may do so in return as long as u take care of yourself and others. Focus on ur future and if those around u",
            "score": 2,
            "author": "8--8",
            "replies": [
                {
                    "level": 1,
                    "comment": "Focus on his future?  Your comment sounded more like focus on his funeral.Seriously 🤦‍♂️",
                    "score": 3,
                    "author": "suicidal_but_hopeful"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well I played video games drank cogniac and Hennessey  and slept with a 20 year old escort for my birthday.All in all not a bad day.\n\nNow your looking at your situation in the wrong light.No wife no kids mean no headaches or drama and alot more money.\n\nAt 41 your ahead of the game as lot of dudes are out here ruined chasing the American nightmare wife kids expensive ass house and car notes.dude you've got it good.\n\nYour free to go where you want when you want no crumb snatchers around nobody nagging you.I will never marry or have children life is pretty good I have a shit ton of money I'm literally looking at pile of it rite now I swear don't even have anything to do with it guess I'll make a donation to another 20 year old.\n\nYou just need direction and pourpose my pourpose is to sleep with as many attractive  women as I can 8s,9s and 10s and live a comfortable life with decent car nice home my direction is make a shit ton of money to finance this comfortable life.\n\nSex snd money thats my pourpose in life.Imagine having a young perky 20 something that your not married to and can't take half  your shit come over and let you do whatever, well make it a reality and don't settle for no uglies cause your lonely. Your a man the world is your domain.\n\nI'm ugly girls don't like me but I have fcked some of the baddest women on the planet and it was good from Belize to Angola.\n\nGet a passport go to thailand that's where you should have celebrated your BD.\n\nIf you really want kids use a surrogate it's pricey but go through an agency. To avoid legal issues with the surrogate.\n\nI have another pourpose bringing and end to marriage male manipulation and suffering.",
            "score": 2,
            "author": "SUEDE2BLACK"
        },
        {
            "level": 0,
            "comment": "Have you considered that you may have undiagnosed ADHD?",
            "score": 1,
            "author": "Analysis_Vivid",
            "replies": [
                {
                    "level": 1,
                    "comment": "kind of a shot in the dark",
                    "score": 6,
                    "author": "ShadowfatherUSMC",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Of course- I know nothing of OP except what he’s posted. It’s all a shot in the dark. I’m a good deal older than OP - and there are things in the story that resonate with my life- undiagnosed ADHD explains what I’ve been through, so I took a shot in the dark and thought maybe OP could check it out.",
                            "score": 6,
                            "author": "Analysis_Vivid"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "stfu",
                    "score": -8,
                    "author": "ciaLaisvis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don’t understand. Why stfu?",
                            "score": 3,
                            "author": "Analysis_Vivid",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Don’t worry about it, people on Reddit are just weird like that sometimes. I understand where you’re coming from. My ADHD had also taken a toll on me at some points",
                                    "score": 8,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "Ok. Firstly,sorry for reacting so wickedly that was childish of me. Its just that there is a strong disagreement in medical society if the ADHD is a real  disorder at all and offering this guy to search for excuses instead of healthy solutions (such as try support group or get into any social group etc) is what made me react this way",
                                    "score": 1,
                                    "author": "ciaLaisvis",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Are you suggesting that adhd is not a real disorder?",
                                            "score": 1,
                                            "author": "Analysis_Vivid",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes, in my opinion there is certain psychological factors as well as nutritional deficiencies (excessive sugar consumption) that effect such behaviour. It has a name because americans just love to label themselves",
                                                    "score": 1,
                                                    "author": "ciaLaisvis"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If I'm still like this in 10 years I am just gonna end it. No need to suffer more than I have to",
            "score": 0,
            "author": "TzatzikiCrisps",
            "replies": [
                {
                    "level": 1,
                    "comment": "No need to end it fam.  Just make up your mind to enjoy your life no matter what. Fuck society. Fuck the system. \n\nGet your money right. Get on the right anti depressants. Smoke some weed, visit Jamaica, go the beach, play video games, Buy a sex robot and enjoy your life.",
                    "score": 2,
                    "author": "PinkKushMaster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree. Fuck society and the system. But that doesn't change the fact that I'm miserable. I take my meds and smoke my weed but thats not all life is about. I don't wanna be lonely anymore and a sex robot is just a huge waste of money imo. I have given myself plenty of time to change things but I always fail at everything I do so I will most likely kill myself in 10 years. And I don't mind that. Death seems freeing and calm.",
                            "score": 2,
                            "author": "TzatzikiCrisps"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Switch things up. If you're not doing much then you should have a lot saved up, go onto the FIRE community and they'll help you retire in a jiffy, if you have spare time then no one is stopping you from learning new hobbies, through hobbies there are groups who share those same hobbies and passions. Facebook groups, Reddit groups, discord groups. Maybe you're a total weirdo who likes so weird type of anime, I'm sure there are thousands like you so don't be afraid to find people who like the same stuff as you.\nLastly before accepting someone in your life you might need to accept yourself, life seems monotonous and you should change that, do sport twice a week even if it's only 10 mins, start appreciating your body more, feeling more confident about yourself and loving yourself before meeting someone else is crucial. Then ultimately dating sites etc but I'm sure you've seen a lot about that already.",
            "score": 1,
            "author": "cakeharry"
        },
        {
            "level": 0,
            "comment": "wow, i see myself writing exactly this post in a few years... what are your options, do you have hobbies?",
            "score": 1,
            "author": "jppcerve"
        },
        {
            "level": 0,
            "comment": "Happy belated birthday!!",
            "score": 1,
            "author": "tireddisapointment"
        },
        {
            "level": 0,
            "comment": "Happy birthday, i hope things turn for the better",
            "score": 1,
            "author": "Google_Doodle"
        },
        {
            "level": 0,
            "comment": "I am on your path.",
            "score": 1,
            "author": "k_anirvin22"
        },
        {
            "level": 0,
            "comment": "Happy Birthday..! Be grateful you have food to eat, a roof over your head and access to internet... how about helping someone in need instead of rolling in self misery? Trust me it will make you feel better.",
            "score": -2,
            "author": "sssskar"
        }
    ]
}