{
    "id": "mfz92f",
    "score": 1095,
    "title": "I don’t need sex...i need hugs and affection",
    "author": "kingjok3r42",
    "date": 1617051152.0,
    "url": "https://www.reddit.com/r/lonely/comments/mfz92f",
    "media_urls": [],
    "other_urls": [],
    "postText": "i’m pretty sure i am by way not the only one. i never had any contact to a girl. and yeah i imagine sex would be really great but...i would do without sex for years for a girlfriend i just can sit on the couch, cuddle with and watch netflix. or cuddle while going to sleep. or to hear words like: i love you or i miss you...sometimes i think if if i really want too much",
    "comments": [
        {
            "level": 0,
            "comment": "I think the word you're looking for is intimacy.",
            "score": 80,
            "author": "shipsAreWeird123",
            "replies": [
                {
                    "level": 1,
                    "comment": "i don’t know this word",
                    "score": 24,
                    "author": "kingjok3r42",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://www.betterhealth.vic.gov.au/health/HealthyLiving/relationships-creating-intimacy",
                            "score": 8,
                            "author": "shipsAreWeird123",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "yeah i guess that’s kind of what i was looking for",
                                    "score": 11,
                                    "author": "kingjok3r42"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think the word is \"companionship\".",
                    "score": 2,
                    "author": "jaritadaubenspeck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe, they seem to be talking about the emotional connection and having someone who actually gives a shit about them.",
                            "score": 3,
                            "author": "shipsAreWeird123"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I often wonder that I’m alone in my way of thinking and how emotional I am, but I’m glad there’s other people out there like me.\nStay strong, I hope you find what you are looking for",
            "score": 125,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks...same to you bro",
                    "score": 35,
                    "author": "kingjok3r42",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You too bro",
                            "score": 8,
                            "author": "Kirklai"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You’re emotional?\nDude,HMU. I’ve been told I’m “sensitive”.",
                    "score": 15,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah but I just feel like it’s more of a “problem” for me because I’m a male. Don’t take this the wrong way at all, but the expectations for us completely different, I wish it wasn’t the case ☹️",
                            "score": 12,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "5 or 6 months ago I had a massive crush on this girl (my first real crush) and i told her about it pretty early but she didn't have the same filings, and recently i was really into this other girl but i don't know if it's because i expressed my feelings to early or she really isn't ready for dating like she said. I also think i have a problem with it, i don't think expressing my feelings is the problem but i think the problem is that im to emotional and can't hold it in me.",
                                    "score": 6,
                                    "author": "MakeMan107",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah I’ve had similar experiences. I’m really sensitive and emotional, I can’t hold stuff inside me without it causing me problems. I’m desperate as clingy for affection and validation.",
                                            "score": 5,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "With that first girl i couldn't eat for 4 ore 5 days and couldn't sleep but when I confessed even though the news were not good i could sleep and eat finally",
                                                    "score": 5,
                                                    "author": "MakeMan107",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah I haven’t been able to sleep properly for the past couple of years. I’m not sure if it’s being stressed at work or maybe the lack of socializing",
                                                            "score": 3,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I've been trying to socialize ang go out with my friends but they are introverted as well so not much success from that, i hope you find someone that will care for you and love you the way you are. Have a wonderful rest of your day and thanks for listening.",
                                                                    "score": 3,
                                                                    "author": "MakeMan107",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Thank you so much, I hope you find the same one day ❤️",
                                                                            "score": 3,
                                                                            "author": "[deleted]"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yea i feel you bro.being emotional can cause problems.i remember a girl i was rly in love with so i wrote many poems for her. now i feel kinda embarrassed for doing it",
                                                    "score": 4,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well I’m not sure what the alternative is for me. Becoming an ordinary emotionless robot like society wants us to be? ☹️",
                                                            "score": 3,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "☹️ i hope you find someone that understands you bro♥️",
                                                                    "score": 3,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Thank you, I hope we all do ❤️",
                                                                            "score": 3,
                                                                            "author": "[deleted]"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I feel ya. Haven’t cried since I was 11. Don’t think I know how to.",
                                    "score": 6,
                                    "author": "Martholomew7052",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's what's wrong with society and big companies that brainwash men into believing it's feminine to cry or have emotions and being feminine is bad. Literally conditioning men into developing psychopathic traits, it's all so fucked up.",
                                            "score": 11,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I can see that and it’s honestly unfortunate that that exists.",
                                    "score": 4,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Toxic masculinity at its finest",
                            "score": 5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That term is in itself, toxic. The toxic masculinity equivalent for women is usually reffered to as internalized misogyny, the term toxic masculinity should be retired and replaced with internalized misandry.",
                                    "score": 3,
                                    "author": "FinallyReborn",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Interesting thought",
                                            "score": 2,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It needs to be said: in a normal relationship, when you actually love someone, sex is just like an addition to cuddles and kissing, a way to show love and affection to the other person. I think that porn really spoils the image of sex irl and people don't talk about it nearly enough. Ps: I wish you luck in finding someone, keep on keeping on.",
            "score": 38,
            "author": "Mateulka"
        },
        {
            "level": 0,
            "comment": "That’s what I want in a relationship, it’s the level of intimacy I crave.",
            "score": 21,
            "author": "PomegranateCrafty804"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 20,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "i guess it is",
                    "score": 13,
                    "author": "kingjok3r42",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 12,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "yep",
                                    "score": 10,
                                    "author": "kingjok3r42"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Seems like it",
                    "score": 5,
                    "author": "Loudanddeadly"
                },
                {
                    "level": 1,
                    "comment": "I recommend you don’t expect anything in life, you either work to make it happen or get lucky.",
                    "score": 5,
                    "author": "JustWaitAMomentOk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No that's the perfect relationship that's how I want all mine to be and it will happen you just got to wait for the perfect moment",
            "score": 32,
            "author": "pleasehelpme9546"
        },
        {
            "level": 0,
            "comment": "Took the words straight outta my mouth, i feel you so hard ;(\n\nI couldnt care about sex, likely cause im asexual but still... all i ever wanted is a hug, someone to cuddle with, to reassure, someone i can comfort on their worst days, to play in the snow with, to lay under the stars and talk about life... true love is a much better feeling than sex, i guarantee...\n\nYou're not alone my guy :'(\n\n(Im a male btw please dont DM me because my reddit avatar looks like a girl xD )",
            "score": 23,
            "author": "AbstractLife1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Guys look it’s a girl spam her DMs!",
                    "score": 21,
                    "author": "JustA_RandomHuman",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Omg, it's too late for me to be laughing like this",
                            "score": 4,
                            "author": "BeefSandwhich"
                        },
                        {
                            "level": 2,
                            "comment": "Nooooo please xD i already got sent a rather \"unpleasing\" photo from a guy thinking im a girl, i dont think i can handle another lmao",
                            "score": 3,
                            "author": "AbstractLife1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Aaaa why are there so many people like me on this sub. This is exactly what I want too and it’s so sad that girls don’t see that from guys nowadays cos of all the shit in the media 😭",
            "score": 10,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "true shit",
                    "score": 6,
                    "author": "kingjok3r42",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sometimes i just feel like if I died the world wouldn’t care or notice and people wouldn’t remember me. Even though I try so hard to be nice to everyone and I am, they just don’t care really",
                            "score": 4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "same... i always tried to be a good person but only got treated like shit. i have absolutely nobody who would care if i killed myself",
                                    "score": 3,
                                    "author": "kingjok3r42",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I feel this. I would care, not sure if that really counts for much but I hope everything gets better for you",
                                            "score": 3,
                                            "author": "anonymic7777"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That sucks man I hope you’re reunited soon.",
                    "score": 3,
                    "author": "Martholomew7052"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dude yes, sometimes the best i can describe it... is like being horny... but for a hug or cuddles not sexually. (there has to be a word for it in another language, probably German or Japanese lol)\n\nThe weirdest thing is, how can my body crave something that has never had?",
            "score": 8,
            "author": "Electric_Fly",
            "replies": [
                {
                    "level": 1,
                    "comment": "same for me",
                    "score": 2,
                    "author": "kingjok3r42"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't know who you are, but i'm just going to give you a hug, to satisfy that need c:\n\n*hugs you tightly*",
            "score": 16,
            "author": "Leafbox_",
            "replies": [
                {
                    "level": 1,
                    "comment": "*replies hug*",
                    "score": 12,
                    "author": "kingjok3r42",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "thanks c:",
                            "score": 8,
                            "author": "Leafbox_"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "giving u a *hug* too",
            "score": 4,
            "author": "westanthis"
        },
        {
            "level": 0,
            "comment": "Dw ur not the only one",
            "score": 3,
            "author": "vPeachycat"
        },
        {
            "level": 0,
            "comment": "I understand that. I'm extremely clingy and cuddly but no one to cuddle with besides my bear.",
            "score": 3,
            "author": "BabyBunnBunn98"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "absolutely",
                    "score": 2,
                    "author": "kingjok3r42"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When you will have a relationship you'll realize love is more about hugs and affection than sex. At least that's what i've learned, and that's how i believe a relationship should be. Sex is important but is the last thing that has to come imo.\n\nOur society makes boys obsessed about losing virginity. Your friends will be like \"did you fuck her duh?\" but thats absolutely not how a relationship should work.\n\nLove is growing up with your partner, getting to know her/him and then having sexual experiences you both feel confortable to have.",
            "score": 3,
            "author": "Just_a_spaghetti",
            "replies": [
                {
                    "level": 1,
                    "comment": "that’s exactly what i said",
                    "score": 1,
                    "author": "kingjok3r42",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know, sorry if it sounded like i was attacking you or something, that wasn't my intencion. \n\nI just feel like today's group mentality puts sex ahead of everything, and people who look for a healty relationship are \"discriminated\" for not looking for instant sex like the cool boys do.\n(At least that's something that i felt in the initial moments of my relationship)",
                            "score": 2,
                            "author": "Just_a_spaghetti"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "And it's not bad to have dreams even though they arent dreams it's life",
            "score": 3,
            "author": "pleasehelpme9546"
        },
        {
            "level": 0,
            "comment": "Ugh... I miss snuggles. \n\nI give you hug.",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "*replies hug*",
                    "score": 0,
                    "author": "kingjok3r42",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Strokes your hair",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is all I want but it’s not something I think I’ll have",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "same",
                    "score": 2,
                    "author": "kingjok3r42",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You’ll have it one day man, don’t worry",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "- First, if you can afford it, and are willing to commit to the care they require for their lifetime, get a pet, one that you can cuddle or that will regularly come to you because they like being around you, like a dog or a cat.\n- Second, make some friends. All relationships start from a place of friendship. Do you have any hobbies? Do you you have anything that you'd like to volunteer some time with? [VolunteerMatch](https://www.volunteermatch.org/)\n- Third, be approachable. In general terms, people like talking about themselves, so ask questions. Be interested in their replies. Ask followup questions. Even if the conversation goes somewhere that you don't find particularly interesting, be genuinely happy for them.\n\nGood luck.\n\nOh yes, and *here* is an internet hug.",
            "score": 2,
            "author": "SweetBearCub",
            "replies": [
                {
                    "level": 1,
                    "comment": "My experience with the second bullet point has always been getting friendzoned. I have tried being friends, and I have tried to be someone she would like to depend on, but at the end it’s just getting mistreated, used or getting to listen she likes someone else. And as someone who needs quite a bit of time to move on (for context, it took me 3 years to get over my first crush and look for someone else), it isn’t exactly a great experience. Maybe I was doing something wrong, IDK, so I gave up hope after the last one.",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sometimes getting stuck in the friend zone happens. Not everyone is going to feel the same way about you as you do about them, that's life.\n\nMy suggestion would be, if you get friend zoned, to have an honest private conversation with them, where you open up and say that as much as you do enjoy their friendship, you were hoping for more. That way, it gets it out into the open, and they can either respond to that, or confirm that you're wasting your time, and allow you to focus your romantic energies elsewhere.",
                            "score": 2,
                            "author": "SweetBearCub"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The only thing I dream about every day is to have somebody I can tell that they’re beautiful. I just want to make them happy. To feel good. \n\nBut I guess not everybody gets to give that. :/",
            "score": 2,
            "author": "SaintStephenI"
        },
        {
            "level": 0,
            "comment": "I wanted exactly that for a long time and I still do but like 3 weeks back I met a girl and we rushed it too much and dated for like 2 weeks and had a good time exactly those things you said you want and I just say it’s one of the best feelings I had but honestly I found out that even though I love this feeling staying single is better for me, I just don’t go well with other people and I end up making them feel miserable, I really hope you’ll find someone one day, keep your hopes up!",
            "score": 2,
            "author": "FinePixCZ"
        },
        {
            "level": 0,
            "comment": "Dude exactly, Like sex is great and all but it doesn't come close to having that emotional connection with someone and just being able to have that person in your life.",
            "score": 2,
            "author": "No-Cap708"
        },
        {
            "level": 0,
            "comment": "Same. Let's be real it's not sex that people want from a relation ship. If it was that the hand would do. Love just hits different.",
            "score": 3,
            "author": "Igneel_Prime"
        },
        {
            "level": 0,
            "comment": "bro you're not alone, I haven't been in a relationship for over two years and I sometimes want the same thing too. Hang in there and you'll find the most perfect one, stay strong and sending u a friendly bro hug!",
            "score": 1,
            "author": "Patience_Fabulous",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks.i never had a relationship so i don’t even know how it feels...but i just can imagine that it has to be a great feeling",
                    "score": 3,
                    "author": "kingjok3r42"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A girl that want sit on man thighs and holding her hand write something on writing desk, this kind of romance we never hear again",
            "score": 1,
            "author": "humble-only"
        },
        {
            "level": 0,
            "comment": "This is so precious.  I hope you get one soon.  Maybe this post will get you one 😘",
            "score": 1,
            "author": "Particular-Cook-6300",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you",
                    "score": 1,
                    "author": "kingjok3r42"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow bro.... I feel you on that one. I Jerk off not cause I’m A sex craved Dude. I’m lonely asf. The only time I interact with a Female it’s when me and her smoke pot together. Other than that I’ve got no one",
            "score": 1,
            "author": "Stoned_Boi999"
        },
        {
            "level": 0,
            "comment": "I mean, they arent mutually exclusive...\n\nBut ya, we are wired to need physical affection and intimacy and human contact. Try looking up some studies on what it does to us to be deprived of that, usually with the word shunning attached. Rejection and isolation trigger the same parts of the brain as physical pain. It is literally physical abuse to be alone long term, and eventually, it will kill. I used to think that was hyperbole until I actually looked into it. That most people try to play it down or disregard that basic human need is terrifying.",
            "score": 1,
            "author": "Kikinaak"
        },
        {
            "level": 0,
            "comment": "I feel you on that is so hard now to get a female friend now everything is about sex or fashion or going to the next big restaurant is like where do we get to bond",
            "score": 1,
            "author": "VegetableIncrease206"
        },
        {
            "level": 0,
            "comment": "I feel... I just moved closer to an online friend recently and was looking forward to meeting her and hopefully cuddling, and then she ghosted me. I just wanna be held man.",
            "score": 1,
            "author": "underwhelmed_panda"
        },
        {
            "level": 0,
            "comment": "Honestly I'm the same way like sex is fine I guess but honestly not what I'm really looking for tbh.",
            "score": 1,
            "author": "GroundbreakingAd8301"
        },
        {
            "level": 0,
            "comment": "Eventually, with the relationship, you are seeking you will love each other enough to want it all sex and it will be fantastic because of the care you have.",
            "score": 1,
            "author": "Optimal-Novel-3458"
        },
        {
            "level": 0,
            "comment": "same bro.... i think ill be alone forever",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Exactly the same, I thought I was rare in wanting it.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Amen. A.... *%#$ing men. I feel you on this.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Most girls i met in my life just want to have sex. I only wish for some intimacy, like you said, lay down and watch some TV and cuddle. I guess that's really too much to ask for. Maybe there are girls like this out there, but who knows if we will ever have a chance to meet",
            "score": 1,
            "author": "Rivennoketsui"
        },
        {
            "level": 0,
            "comment": "Yea I have come to a point that I crave small intimacy and good conversation than sex. It is good to have good sex but it is just an additional pleasure for me at the moment.",
            "score": 1,
            "author": "btuanq"
        },
        {
            "level": 0,
            "comment": "You are not the only one . Well it just feels like you read my mind . The same stuff i think bout everyday too. The worse thing bout me is all my friends i have has gfs an that makes me feel extra bad bout myself an life. But lets hope all of us get what we want and deserve😁",
            "score": 1,
            "author": "Retro0w"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "i am alone and lonely...so...yeah...",
                    "score": 1,
                    "author": "kingjok3r42"
                },
                {
                    "level": 1,
                    "comment": "*virtual hugs* I’ve been there many times and it’s not a nice feeling. Loneliness is one of the worst pains. I’ve always felt different and misunderstood so always struggled with this feeling. When I don’t feel connected with anyone, this world becomes such a lonely place. But don’t give up. I think working on self love is a good first step, also seeing a therapist helps, because you feel listened to and I used to look forward to being vulnerable with another human, it took the edge of that lonely feeling.",
                    "score": 1,
                    "author": "lanaloveslayla"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That is something I want for my whole life...more than anything else...wish you good luck...you will definitely find a girl who feels the same...",
            "score": 1,
            "author": "maxmilian_5629"
        },
        {
            "level": 0,
            "comment": "same, i wish to have these, but never gonna happen, place-and life is not going that,,, and who will even.leave all these 4 billion men and look at me? lol fml",
            "score": 1,
            "author": "MaidrobX"
        },
        {
            "level": 0,
            "comment": "I want both lol",
            "score": 1,
            "author": "pisspoorhuman"
        },
        {
            "level": 0,
            "comment": "Me too",
            "score": 1,
            "author": "JustJohn3"
        },
        {
            "level": 0,
            "comment": "I'm the same way man. I had a couple of traumatic sexual experiences with women, and I have erotophobia now. I do still long for touch though. Before covid I used  to see a cuddle therapist. My ideal relationship would be one in which kissing and cuddling would be as far as we went",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "meanwhile i stopped believe in this",
                    "score": 1,
                    "author": "kingjok3r42",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "i tried",
                                    "score": 1,
                                    "author": "kingjok3r42"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I need the same thing, feeling hugs and affection is what we all need in life. It’s a huge stress reliever and it makes you feel good.",
            "score": 1,
            "author": "Craigifi"
        },
        {
            "level": 0,
            "comment": "What are all those things you talk about...I've forgotten those things...actually both things. Since 2009 when my gf passed away I have felt those things you speak of a total of 1 month. A week in 2011, 3 weeks in 2017 and yes the same woman &amp; that pretty much ended because we live in different countries. I sleep in a bed that's never seen another person except myself since 2010 when I bought my house. Those words are like speaking latin, or greek, or spanish for that matter to me, I hear them but I don't understand them now. I remember once climbing into bed, patty my Angel's butt a couple of time then sliding in behind her &amp; wrapping my arm around her pulling her close every night. Her hand taking hold of mine &amp; we both let out a deep sigh of comfort. But that's long forgotten....I turn off commercials of that old couple walking in the park, cause I want that to be me &amp; I am tired of the tears....for that matter really I have no more of those either....but at 60/M and being disabled, I don't worry about it....its been so long now, sometimes I am more scared of it, cause am so afraid it will go away again.......so I play my games, watch tv and now I am the hermit in my neighbor..........such is life now........",
            "score": 1,
            "author": "mstririshpub"
        },
        {
            "level": 0,
            "comment": "Same.",
            "score": 1,
            "author": "Snoo_54214"
        },
        {
            "level": 0,
            "comment": "I feel this. I’m asexual and I’ve never really craved sex, but someone to cuddle and watch movies with and talk about the meaning of life and death and everything in between with, someone to go on fun dates and adventures with. All men seem to want sex :( being a loner doesn’t help any either",
            "score": 1,
            "author": "Responsible_Demand40"
        },
        {
            "level": 0,
            "comment": "Same-ish.. I hate my life.\n\nIn primary school 5-10 I used to absurdly popular, aka one of the popular kids..\n\nI literally had a gf for like 3 months.. \n\n&amp;#x200B;\n\nSince then my life has been terrible, I've never had one since.\n\n&amp;#x200B;\n\nI get teased all the time by girls who ask me dumb questions like \"Are you from Poland?\"\n\nI've received compliments that are so easy to tell they're just mocking me.. they'll say stuff like \"You could be a model\" after literally saying I could work in an office when im older.\n\n&amp;#x200B;\n\nI wish I couldn't be this lonely..\n\n&amp;#x200B;\n\nI stay inside and alone for practically 18 hours a day, my brother, sister and parents are the only people who stay here too.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Same",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I understand. This pandemic is doing this to everyone.",
            "score": 1,
            "author": "No-System-555"
        },
        {
            "level": 0,
            "comment": "Mate I know exactly where ur coming from. I was once in a relationship with an amazing girl we had a flat(apartment)at the top of floor it was me&amp;her against the world.god I miss it so much.",
            "score": 1,
            "author": "thelastbalrog"
        },
        {
            "level": 0,
            "comment": "Just find a good friend my dude. If you’re friends aren’t fine with showing that kind of affection then they aren’t good friends.",
            "score": 0,
            "author": "Rebel_Scum59",
            "replies": [
                {
                    "level": 1,
                    "comment": "You cuddle with your friends in bed?",
                    "score": 1,
                    "author": "T1M3_TO_LOS3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You don’t cuddle with the homies?",
                            "score": 1,
                            "author": "Rebel_Scum59",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Me and my homies cuddle when we're high",
                                    "score": 1,
                                    "author": "EveryDay1sAParty"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am going all in on saying you reaaaallly need to try sex and more than once and particularly with more than one partner before you make this claim. Yea I love me some hugs and cuddles but I mean sex dude....",
            "score": 0,
            "author": "Forward-Comfort",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nah some people me included need affection.  I wouldn't say I don't want sex but I crave affection and giving affection way more than sex.  I asked a chick I know if she wanted to come over so last night and the night before she came over and we slept together a few times but now I'm just laying here wishing I had a hand to hold.  Even when she was here the first night my mind was in a different world I'm just not here.  I had this young good looking girl next to me and I'm just not present my mind is in lala land",
                    "score": 1,
                    "author": "Elis250"
                }
            ]
        }
    ]
}