{
    "id": "t2fmkp",
    "score": 1744,
    "title": "I realised I am so lonely that whoever talks to me I fall in love with them",
    "author": "[deleted]",
    "date": 1645935350.0,
    "url": "https://www.reddit.com/r/lonely/comments/t2fmkp",
    "media_urls": [],
    "other_urls": [],
    "postText": "To them I must seem pathetic 😔\n\nDoes this happen to you too?",
    "comments": [
        {
            "level": 0,
            "comment": "Oh my gosh yes, I totally get that. Even if it's online, if a guy shows me an ounce of affection, I just start to catch feelings. It really sucks because I know nothing is going to happen and I'm just going to get hurt. So now I've just resorted to not talking to anyone new and just learning to be alone.",
            "score": 277,
            "author": "Jun_0515",
            "replies": [
                {
                    "level": 1,
                    "comment": "Her, I really like talking to you. Me, imagines the rest of our lives together married haha.",
                    "score": 80,
                    "author": "Invisibleman021183",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "this is literally me",
                            "score": 10,
                            "author": "Amphexa"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "same happened to me",
                    "score": 18,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Oh god where are the girls that fall in love with you like that?",
                    "score": 6,
                    "author": "AllYouCanEatJapanese",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Here I am 🙃 I thought this only happened to girls",
                            "score": 5,
                            "author": "Aromatic-Ad-2631"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How do you know nothing is going to happen and you'll get hurt? It's probably good to learn the skill of being comfortable with yourself and the more bone-structure parts of your life though.",
                    "score": 24,
                    "author": "Antonia_l",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "that's very difficult to do",
                            "score": 11,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "please tell me if you find effective coping strategies for this, or just any advice!!!\nI really struggle with this and thought pattern that comes with it terrifies me😞",
                    "score": 4,
                    "author": "Amphexa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The desire to fill the void is powerful.",
            "score": 129,
            "author": "joeprinter",
            "replies": [
                {
                    "level": 1,
                    "comment": "😔",
                    "score": 20,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I totally get this. I've been so lonely in the past that I would basically make up relationships with coworkers and I felt like I couldn't stop. I didn't have much compassion for myself at the time, but looking back at myself I really do.",
                    "score": 10,
                    "author": "SmartStatus5629",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Honest question, how do you stop? I romanticise myself with every new guy I spend 1-1 time with. And esp at 21 y/o and whilst actively taking part in the hookup culture of a vibrant city, this really bloody sucks",
                            "score": 3,
                            "author": "cokevodkatequila",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This fucking hit. I had to say it out loud. I’m going to remember this",
                    "score": 6,
                    "author": "Remarkable_Potato_69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 275,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel the exact same",
                    "score": 54,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I have this too. Anyone who extends a genuine kindness and gives their time to me, I always think 'does this person like me?! Why are they being nice?'",
                    "score": 33,
                    "author": "teamsaxon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yeah exactly this\n\n\nwhen someone shows some kindness, i always start getting extremely suspicious about their ulterior motive, because ain't no way anyone is just nice to me without wanting anything from me",
                            "score": 18,
                            "author": "Krackerlack",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes! Exactly.",
                                    "score": 2,
                                    "author": "nuisance_animal"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Same. And I always mess up everything in the end",
                            "score": 8,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Definitely, here too.",
                                    "score": 2,
                                    "author": "nuisance_animal"
                                },
                                {
                                    "level": 3,
                                    "comment": "Have faith, you'll get it right in time",
                                    "score": 1,
                                    "author": "teamsaxon"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "same, idk how to deal with it :/",
                    "score": 2,
                    "author": "zhuk236"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's not close to pathetic. I develop feelings sometimes towards girls who are nice to me because so few ever have been. If a girl tells me I'm nice or funny, I get that warm feeling and I start having a crush. I've never had a relationship so I can't blame myself. Heck, I've had girls smile at me and I get that warm feeling.",
            "score": 82,
            "author": "Invisibleman021183",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm the same with any guy that is nice to me. I'm mid to late 20s, never been in a relationship, and when guys are nice to me I always wonder if there's something more to it.",
                    "score": 30,
                    "author": "teamsaxon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's like what do they want? Obviously not me.",
                            "score": 14,
                            "author": "Invisibleman021183"
                        },
                        {
                            "level": 2,
                            "comment": "Im in similar circumstances, i end up spending the entire time thinking of them and it consumes me😓.  \n\nIf you do need a friend or someone to talk to tho just say hi:)",
                            "score": 3,
                            "author": "Amphexa",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I got in trouble for joking. I used to be this extrovert who used to mess with people but they didn't like it so I had to stop. My boss said, stop joking around. Nobody likes it. I stopped being friendly on a personal level after that. Professionally, yes, personally, no. I never meant to anger people but, as usual...",
                            "score": 5,
                            "author": "Invisibleman021183",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Omg. So I’m not the only one… \n\nI’m not sure exactly what you mean since you did not specify. Do you mean generally anyone who takes time to converses with you? For me, when someone who I find moderately attractive responds to me, on social media or irl, is kind, and seems engaged in talking to me, I can’t help but begin to fantasize about forming some kind of long term connection with them. \n\nI feel like such a weirdo creep for this but I’m extremely guilty. It’s a terrible behavior and I’m sure it’s why I have attracted mostly toxic people in the past who have taken advantage of me. Also, potential partners often stop talking to me as much pretty early on so I feel like they catch on to it somehow, even though I try to not let it show as best I can. \n\nSorry for rambling. Your post and the comments made me want to share my own experience.",
            "score": 139,
            "author": "crack__head",
            "replies": [
                {
                    "level": 1,
                    "comment": "this is what I wanted to say too exactly",
                    "score": 26,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I resonate with your post about doing everything alone. I’m definitely living the hardcore lonely life as well. My job involves a lot of driving with minimal human interaction, I come home late so everyone I am acquainted with is getting ready for bed (no one to talk to), I distract myself from my desolate existence any way I can (alone, might I add), and then the cycle repeats itself.",
                            "score": 16,
                            "author": "crack__head",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This",
                                    "score": 5,
                                    "author": "Palahubogka"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I really admire you for revealing your vulnerable side. I can relate to so much of what you said 💜",
                    "score": 31,
                    "author": "LisaBee1969",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Unfortunately, that's the part of us that always surfaces... we are constructed in a way that allows us to feel good and give whoever that other person is our heart. It's hard not to invest in others who reach out to us.",
                    "score": 8,
                    "author": "olecountry63"
                },
                {
                    "level": 1,
                    "comment": "If someone who is conventionally attractive messages and compliments me, I get all weird feeling but then my head tells me, she's using you because all the others did. It is true, I am only good for being used it seems. I fantasize about the stupidest things too like going out to dinner together.",
                    "score": 7,
                    "author": "Invisibleman021183"
                },
                {
                    "level": 1,
                    "comment": "Same. That’s why I get nervous now talking to guys because I’m scared my judgment is clouded by the allure of just wanting to be in love so bad ya know",
                    "score": 7,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same here!😔",
                            "score": 2,
                            "author": "Amphexa"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Same! I feel so pathetic! I don't know how to stop this",
            "score": 31,
            "author": "kevinjawn",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same, this happened to me recently too, and I stopped getting response :((",
                    "score": 14,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel this on a personal level. They could be unattractive to me yet when they show kindness in any way, my heart skips a beat and I almost get attached to them. I don't try to change my relationship with them or act different, but I do secretly admire them and in a way, see them as love interests in my head. Still, I'm aware they are just being nice so I don't do anything out of the ordinary.",
            "score": 30,
            "author": "darkstar760",
            "replies": [
                {
                    "level": 1,
                    "comment": "SAME BRO EXACTLY SAME\nTYSM FOR SHARING BC I THOUGHT I WAS JUST AN INSANE PERSON\n\ni still need help fixing this tho \nit’s a terrible feeling 😞",
                    "score": 2,
                    "author": "miserabl3_worthle66"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What if a clingy person gets with a clingy person? Problem solved?",
            "score": 31,
            "author": "ReverseMillionaire",
            "replies": [
                {
                    "level": 1,
                    "comment": "not happening to me",
                    "score": 10,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Yeah I've done that, it isn't pretty. Way too much commitment upfront and I ended up alone in Burlington Vermont in June staying up all night because I couldn't get a hotel room on late notice and I refused to stay with the guy I'd just broken up with and I didn't know anyone else in Burlington and Burlington in June is really cold at night. So don't do that because it's terrible. Very very lonely feeling",
                    "score": 10,
                    "author": "SmartStatus5629"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 77,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This same happened to me and I don't get replies anymore 😔",
                    "score": 14,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 13,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I feel you",
                                    "score": 9,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Don't despair....don't give up. The next opportunity is just around the corner.",
                            "score": -1,
                            "author": "olecountry63",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "don't think so",
                                    "score": 5,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Don't base on what's happened in your past dictate your future....",
                                            "score": -1,
                                            "author": "olecountry63",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "but thats literally the logical thing to do\n\nyou base predictions of the future on past patterns and trends",
                                                    "score": 3,
                                                    "author": "rtrain__"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "But you're not a loser because your heart aches to be loved....it comes down to TRUST. it's a matter of FAITH. At some juncture we have to make a decision to take that leap of faith and allow our hearts to love again.❤️",
                    "score": 1,
                    "author": "olecountry63"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fuck this is so relatable, literally have no friends and by some miracle a girl at uni showed interest in getting to know me and essentially became my best friend after a few months of talking. I wasn't interested in her at first but the more I got to know her the more I started to fall for her cause she's literally the female version of me. \n\nIt was the first time any girl was there for me, cared about me, complimented me etc. For once I felt wanted and it was a good feeling knowing she liked my company as we spent a lot of time together.\n\nThen I completely fucked things up a year later by telling her how I felt and she said we should take some time apart. In reality she wanted me out of her life and cut me off completely. Ngl It destroyed me and I'm still hurt from it but I'm trying my best to better myself and move on.",
            "score": 24,
            "author": "jigsaw7277",
            "replies": [
                {
                    "level": 1,
                    "comment": "was just passing by this Post and noticed your comment, I'm really sorry this happened to you, it must have been really hard, I'm really sorry friend, may you be well and recover from this, I know it's been a while since this comment, but still friend, I'm sorry and get well soon.",
                    "score": 2,
                    "author": "YuukiSnowing"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Max relate man. Don't think i particularly fall in love with them per se but i do think about them a lot. Now in one instance I talked to this girl on reddit. She happens to be from my city as well. I've projected her as my girlfriend in my dreams. That's how much fucked up i am.",
            "score": 17,
            "author": "_mahomes",
            "replies": [
                {
                    "level": 1,
                    "comment": "and you're still talking to her? is she showing good response?",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nah man the only day we talked a lot was the first day. Haven't talked much since then. She doesn't respond to texts for hours or even days",
                            "score": 7,
                            "author": "_mahomes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "same happened to me",
                                    "score": 6,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 51,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "noone ever said or says yes ☹️",
                    "score": 24,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 20,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "that's a big statement you're making there... are you sure to stop trying",
                                    "score": 9,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 29,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "These kinda thoughts are anger-inducing",
                                                    "score": 10,
                                                    "author": "ReddShrom",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 5,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Ye, people have nothing to say in that regard really, neither do I, like, all you can say, that is honest and optimistic I guess, is just the truth, we don't know what the future is gonna be",
                                                                    "score": 4,
                                                                    "author": "ReddShrom"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I would not say you're completely wrong. I see this too sometimes",
                                                    "score": 9,
                                                    "author": "[deleted]"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "AMEN",
                                                    "score": 2,
                                                    "author": "Ok-Strawberry-457"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "“Eventually someone will say yes” omfg",
                    "score": 5,
                    "author": "throwaway0183701"
                },
                {
                    "level": 1,
                    "comment": "I like the bracket loll",
                    "score": 5,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I’ve been rejected in front of like 200 ppl before too feels bad",
                    "score": 3,
                    "author": "Lollijax"
                },
                {
                    "level": 1,
                    "comment": "I know this is an older thread lol but I had a recent experience like this as well, had one great date she gave me multiple compliments, said she wanted to do it again, then kept flaking on me on future plans and acting colder and colder until when asked about the mixed signals she said “I told you I’m not looking for anything too serious” which I assume means I found a better guy in the last two weeks.\n\nIt’s really messed me up…",
                    "score": 5,
                    "author": "alpha95"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You’re not falling in love with them you’re falling in love with the companionship which is completely normal.",
            "score": 16,
            "author": "Introvertedemu",
            "replies": [
                {
                    "level": 1,
                    "comment": "but they ghost eventually and it hurts my heart each time",
                    "score": 9,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s always going to hurt when someone leaves. That just means they weren’t meant for you.",
                            "score": 6,
                            "author": "Introvertedemu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "you're right 😞. Would you like to be friends? you can hit me up if you want",
                                    "score": 5,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think what would be best is to look for friends that exist outside of the internet.",
                                            "score": 3,
                                            "author": "Introvertedemu",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "they left me gradually... it's a big story in itself",
                                                    "score": 4,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can completely relate… I’m so starved of positivity that anyone who treats me with kindness automatically turns into my love interest.",
            "score": 13,
            "author": "MooMilk3435",
            "replies": [
                {
                    "level": 1,
                    "comment": "that's so sweet",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is it towards opposite gender or all of them?\n\nI fall in love with women when I get a little bit of attention from them. It seems clingy and desperate, but I have been so lonely it hurts and my heart just yearns for connection.",
            "score": 13,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm talking about platonic love irrespective of gender",
                    "score": 5,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes i meet someone and they’re not my type at all. But we talk a bit and they treat me nicely and I’m suddenly imagining of dating them. Being lonely sucks",
            "score": 13,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "true it suckss",
                    "score": 6,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Same😭😭",
            "score": 11,
            "author": "Retro0w"
        },
        {
            "level": 0,
            "comment": "Yeah, fam. A girl talked to me in a chem lab like 4 weeks ago and I still fantasize about her actually giving a shit about me at night just to help me get to sleep.\n\nI’ve described it this way before and I think it’s apt: loneliness is like locking a dog in a cage and starving it. Give it enough time, and the dog will start jumping and snarling at just the scent of meat. That’s where my head is at rn. I’m sorry that yours is too, it’s not a fun place to be",
            "score": 10,
            "author": "throwaway0183701",
            "replies": [
                {
                    "level": 1,
                    "comment": "i never even met",
                    "score": 4,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve been there.  Sadly it can be very off putting to the opposite sex who is just being friendly, which makes the situation even worse.  Sorry you’re so lonely.  It will get better some day.",
            "score": 9,
            "author": "LightWonderful7016",
            "replies": [
                {
                    "level": 1,
                    "comment": "when did it change for you? so that i can have a hope life will change for me too",
                    "score": 7,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I went to therapy and took some meds for a few years.  Read some self help books and forced myself to get better at interacting with people.  It’s a skill you have to develop.  If you want change, you have to work at it.  Give yourself small achievable goals.  Literally as easy as make the bed and do the dishes.  Start to stack the wins up.  Small victories over and over, you start to believe in yourself.  Set loftier goals.  Keep working at it.  One day I woke up and i wasn’t so depressed and I felt that I could manage my anxiety.  It took a few years but I have a job I like and a girlfriend now.  I still don’t have lots of friends but I’m working at it.\n\nYou can do this!  Make a small list today of the things you will accomplish tomorrow.  Put “make a list” at the top, when it’s done, cross it off, and that’s your first victory.  Do this everyday.  Believe in yourself.  We all have the same self worth as humans.  Remember that.",
                            "score": 8,
                            "author": "LightWonderful7016",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "that's really inspiring can we be friends",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 4,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You’re welcome to reach out from time to time.  Be careful depending on Reddit for companionship.  Sadly people are dealing with a lot of their own BS and when they are overwhelmed themselves they disappear.\n\nTake the next 5-10 minutes to make your list!  The first steps are the hardest.  It takes a few weeks for things to become habits.  If you want it, take it, it’s there for you, but it’s not “free” and it’s not easy, you have to pay with determination.",
                            "score": 3,
                            "author": "LightWonderful7016",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "what do you mean by BS",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Their own bull shit.  Their own problems and insecurities and worries.",
                                            "score": 4,
                                            "author": "LightWonderful7016",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "got it",
                                                    "score": 2,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You're not alone",
            "score": 10,
            "author": "LisaBee1969",
            "replies": [
                {
                    "level": 1,
                    "comment": "that really helps",
                    "score": 4,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "💜",
                            "score": 3,
                            "author": "LisaBee1969",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "don't make me fall in love with you",
                                    "score": 6,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Awww hugs",
                                            "score": 3,
                                            "author": "LisaBee1969"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "*don't you threaten me with a good time*",
                                            "score": 4,
                                            "author": "teamsaxon"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "😩",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's a sad reality that a great many people have to deal with it seems. Myself included. Personally I've taken to calling it \"infatuated\" as rarely do I truly get to know them before something happens, though it seems I am thankfully good at hiding it or they're kind enough to ignore it, and the feeling is summarily destroyed in a violent manner in my mind. Normally at finding out the object of my affection either has little to no interest in me or is already in a committed relationship. As many people have said, it makes one feel like scum.  \nPersonally, despite looking for a good number of years without any fruits for my labor I've decided to attempt to focus more on other things. If I end up dying a virgin in some freak accident, or as some old tired man, I'll just want it written on my tombstone that \"It's partially my fault for the decline in redheads\"! All joking aside, it seems the best we can do is try to look, hoping and praying that someone will find us interesting and give us a chance.  \n\n\nGood luck to all of you out there. Stay safe, and try your best to stay true to yourself without letting someone change you into something you're not.",
            "score": 8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think infatuation is the best word for it, too",
                    "score": 4,
                    "author": "throwaway0183701"
                },
                {
                    "level": 1,
                    "comment": "thabk you",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Im not going to lie... this is pretty much me in a nutshell.",
            "score": 7,
            "author": "Downfall_Of_Icarus",
            "replies": [
                {
                    "level": 1,
                    "comment": "ahh thanks for telling",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And the other thing is when you get any bit of attention from someone who appeals to you, you ask yourself if they like you or they're just being kind!",
            "score": 8,
            "author": "teamsaxon",
            "replies": [
                {
                    "level": 1,
                    "comment": "true",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yup, limerence is a bitch.",
            "score": 7,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Same here, pal...same here.\n\nEver since I got hurt, abandoned and toyed in the past (I know it's just middle school drama, but it seems that people underestimate preadolescence mental development), I keep attaching myself to people who shows me even a glimmer of appreciation, to the point I fantasy by becoming a woman who dates her male friends.",
            "score": 4,
            "author": "Weepingghost00"
        },
        {
            "level": 0,
            "comment": "At least you still have people talk to you and people to fall in love with..",
            "score": 5,
            "author": "MystixGale",
            "replies": [
                {
                    "level": 1,
                    "comment": "the one i had don't respond anymore",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe someone new will appear soon. in the mean time, there is reddit to curb the loneliness..",
                            "score": 2,
                            "author": "MystixGale",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "which subreddit",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "whichever that have someone who replied. since no one talk to me in real life, at least there are someone like you who reply me here. thank you. i am not so alone now.",
                                            "score": 2,
                                            "author": "MystixGale"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah specially if it is a woman",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "not always the case, but usually the case. I have met amazing and interesting men. And by love here I mean platonic, obviously!",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Me too. Not even girls, just anyone really. Now I’m trapped because I don’t want to leave my job and move out and explore, I just want to stay where I am to be with my friends.",
            "score": 4,
            "author": "Admirable_Elk_965",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm happy you got some friends",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks. I can be your friend if you need one",
                            "score": 2,
                            "author": "Admirable_Elk_965",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "thank youu can you hit me up 😊",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "ahahaha samee",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The worst part is when they pretend the love you and then break your heart and the cycle starts all over again bc now you’re lonely and vulnerable",
            "score": 4,
            "author": "Kitanalove24",
            "replies": [
                {
                    "level": 1,
                    "comment": "noone pretended or in fact for real loved me",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We just feel too deeply",
                            "score": 2,
                            "author": "Kitanalove24"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Same I also get unhealthily attached to people I’ve never met like even if they’re just a random guy in a grocery store",
            "score": 4,
            "author": "Retta_Noona",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Took me a long time to work my way out of this, usually no one talks to me, so when someone finally would, it'd feel like a romantic gesture,  because i was lacking in any sort of affection or compassion. I mean i still am most times, but now i just talk to people anonymously because i know how it feels to just wanna be seen and heard, pretending we're aliens in cloaks or snowmen just makes it easier to refrain from assuming romanticism.",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Me but it’s cause of codependency issues",
            "score": 3,
            "author": "Ickybunni",
            "replies": [
                {
                    "level": 1,
                    "comment": "it might be possible, but i think it's the reason noone end up in liking me",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Same here",
            "score": 3,
            "author": "just_some_toast"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "thankss",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stick to chatting to same sex people to avoid that feeling",
            "score": 3,
            "author": "richardcourdlion",
            "replies": [
                {
                    "level": 1,
                    "comment": "it's irrespective of sex to be honest",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You dont know what love is. And neither do I",
            "score": 3,
            "author": "Dafedub",
            "replies": [
                {
                    "level": 1,
                    "comment": "ohh it's possible",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That is so very relatable.",
            "score": 3,
            "author": "nuisance_animal",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks for sharing",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "have you felt it too?",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is exactly me",
            "score": 3,
            "author": "MuchGiraffe7356",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks for sharing",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "_hello_\n\nNah but seriously, communication is key: to look into who the person really is, to realise what you are saying and think before talking\n\nIt seems pretty basic, but since it so basic, we usually overlook it",
            "score": 3,
            "author": "SoSMan_27"
        },
        {
            "level": 0,
            "comment": "Not abnormal, but you should think about why your falling in love with them. Is it cause your lonely ? Or cause theyre being kind?",
            "score": 3,
            "author": "stonecoldxo",
            "replies": [
                {
                    "level": 1,
                    "comment": "i guess because I'm lonely, because noone has never liked me",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This happened to me a lot for the first few years I was single after a lifetime of codependent relationships. \n\nI attribute this to being in relationships where peace and kindness was a rarity so when I meet some stranger who to this point has nothing wrong with them AND they're kind to me? I'm grateful I remained rational and recognized the unhealthy behavior. \n\nMy point, yes. It happens to a lot of people. I solved this issue by making many friends, even ones I have no attraction to. Fill your world with healthy people.",
            "score": 3,
            "author": "cdaddy555"
        },
        {
            "level": 0,
            "comment": "Same omg. I have a horrific habit of getting attached to ppl to quickly bc I believe they’re interested in me. I look for the tiniest signs off them and just latch on to those for hope if that makes sence",
            "score": 3,
            "author": "ihatetheflyers",
            "replies": [
                {
                    "level": 1,
                    "comment": "It makes perfect sense im going thru that right now 😢😭",
                    "score": 2,
                    "author": "groovyjerome"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Same here anytime a girl talks to me my heart explodes",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I feel the same. I’ve been used to being alone and I get excited when someone showed interest to talk to me or have as a company. Then it just dies down, I’ll get ghosted and I’m back being alone.",
            "score": 3,
            "author": "Regera80"
        },
        {
            "level": 0,
            "comment": "Hang in there",
            "score": 5,
            "author": "LisaBee1969",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm trying",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm sure you are. Just keep at it and keep putting yourself out there Like you did with this post.i really admire that.",
                            "score": 3,
                            "author": "LisaBee1969",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "thanks :)) would you want to be friends? hit me up :)",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sure! I sent you a chat message.",
                                            "score": 4,
                                            "author": "LisaBee1969"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think this is normal. I have a fiancee and 4 kids (blended family) and all I want is a moment to myself. I'm so stressed and tired all the time. \n\nAnd yet, if anyone gives me a little attention, I become infatuated. \n\nIdunno. I also have no friends so maybe I'm broken and not a good example.",
            "score": 4,
            "author": "Annaille",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm broken too 😩",
                    "score": 6,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes this because later on they will stop talking and find someone else it sucks.",
            "score": 2,
            "author": "AlClemist",
            "replies": []
        },
        {
            "level": 0,
            "comment": "ye i relate to this",
            "score": 2,
            "author": "jasspreetk",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I don’t “fall in love,” but there is a bonding I feel to people who are good to me. It’s that sense of safety and connection. \n\nIt’s not pathetic. But be careful. People may take advantage of you.",
            "score": 2,
            "author": "MeowMyster"
        },
        {
            "level": 0,
            "comment": "Its not just u no worries. Everybody falls in love/becomes interested who shows interest. Dont think ur pathetic or sth like that.",
            "score": 2,
            "author": "Professional-Net4770"
        },
        {
            "level": 0,
            "comment": "You are not alone... It's not fun",
            "score": 2,
            "author": "Hrimthura"
        },
        {
            "level": 0,
            "comment": "Ha . I really can relate to this . It’s okay . I mean even if you haven’t met the person, you feel you’ll have more of a connection to them because they’re just so honest",
            "score": 2,
            "author": "Icy-Nectarine2911",
            "replies": []
        },
        {
            "level": 0,
            "comment": "LOL when I was younger this feeling happened to me. Good thing, I rarely acted on it.",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’m not even lonely and i do this",
            "score": 2,
            "author": "Lxqe",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Lmfaoo mee",
            "score": 2,
            "author": "Chicken_McGriddles"
        },
        {
            "level": 0,
            "comment": "Yes",
            "score": 2,
            "author": "Shennu"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wish the best to you :)",
                    "score": 2,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "we are in the same boat",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Used to get that a lot, yeah",
            "score": 2,
            "author": "VicoNee",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Yeah every time I fall, every time it hurts, now I don’t even know what love is",
            "score": 2,
            "author": "Cookiee-4u"
        },
        {
            "level": 0,
            "comment": "Why are we like this? I think I was born this way.",
            "score": 2,
            "author": "growsgreen"
        },
        {
            "level": 0,
            "comment": "We should just all pair up and stay with each other, lol jk not.",
            "score": 2,
            "author": "growsgreen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sure",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I know that feeling too well that I adapted it to love them but I don't show any romantic interest",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "true",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You’re definitely not alone but as time proceeds I realize how garbage these people are and I’m just another background character in their story who’ll they’ll never talk to again . It’s painful honestly",
            "score": 2,
            "author": "Tagalongdog",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It has happened too many times, for some I’m sad far others sorry.",
            "score": 2,
            "author": "silentkido",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I literally have the exact same problem!!! Wow. I develop some sort of feelings for them and always have this thought like “do they like me?” “I hope they won’t leave me” you are totally not alone! I’m here for you.",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "i’m with you. I love everyone I’m close with, and even those I’m only semi familiar with. I just want to be close with people.",
            "score": 2,
            "author": "SabrinaAnnBallbustin",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This hit...like hard...ouch.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Yes. I had 1 incredible evening with a man that resulted in actual sobbing after he left. I felt this sense of love surrounding the encounter though I rationally know it wasn't HIM that was the source. Im glad someone else articulated this",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Why you gotta call me out like that? I think it’s become a genuine problem for me. I just hope to be extremely good friends with everybody and it usually goes to shit",
            "score": 2,
            "author": "BigPianoGuy"
        },
        {
            "level": 0,
            "comment": "Fairly often",
            "score": 2,
            "author": "the_1_that_knocks"
        },
        {
            "level": 0,
            "comment": "Omg I can relate so much and I feel like such a loser whenever it happens!\n\nEdit this sounded really rude but I swear it wasn’t meant like that! I just mean I feel very insecure when that happens bc I realize that I have no friends or nothing and just feels really pathetic like you said",
            "score": 2,
            "author": "_Looking_at_the_sky"
        },
        {
            "level": 0,
            "comment": "Definitely my case... I just can’t even look on nice girls... Better off alone I guess.",
            "score": 2,
            "author": "avgp7",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Omg I just came to this realization myself recently. I haven't had human touch for years and don't have any peer groups around me. Nobody of my same age, interests, lifestyle, work...nothing. So, I ended up getting the weirdest crushes mostly on men 15+ years older than me. Its like being on a deserted island but thats just the way society is now I guess, and after years of isolation when you connect to another human being its like some instinctive survival thing to fall in love or get attached.",
            "score": 2,
            "author": "CadaverCanine",
            "replies": []
        },
        {
            "level": 0,
            "comment": "this is literally me at work.\n\ngod i fucking hate myself",
            "score": 2,
            "author": "dacryphiIiac",
            "replies": []
        },
        {
            "level": 0,
            "comment": "So relatable🥺",
            "score": 2,
            "author": "babybecccca",
            "replies": []
        }
    ]
}