{
    "id": "13g9o80",
    "score": 7,
    "title": "Pitzer orientation trip?",
    "author": "ElHijoMayor",
    "date": 1683959934.0,
    "url": "https://www.reddit.com/r/claremontcolleges/comments/13g9o80",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was recently admitted into pitzer as a transfer and I've been looking at the orientation trips and they look so cool. Any recs? I'm torn between the backpacking one and the kayaking one!",
    "comments": [
        {
            "level": 0,
            "comment": "Both are awesome but I think Catalina reigns supreme. Attracts more students with more diverse interests and personalities than backpacking imo but almost all my friends did one or the other. Can’t go wrong with either. The backpacking part of Catalina doesn’t have that much backpacking… it’s not too much mileage and it doesn’t feel like you’re in the backcountry, so if that’s a factor for you maybe backpacking is better. The backpacking group you get assigned to will depend on your level of experience but no matter what the days don’t have that much mileage to cover. The catalina trips also have varying difficulty in terms of mileage and kayaking currents. \n\nSorry this is kind of everywhere but if you have a more specific question you want answered to help decide pls feel free to ask. I did Catalina for my orientation and then also led it the next year and had friends lead backpacking so I have a sense of both trips but am definitely skewed in terms of amount of information and preference towards Catalina.",
            "score": 3,
            "author": "Playful-Flamingo4931",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You don’t need any experience, I would say at least half my trip had little to no kayaking experience",
                            "score": 2,
                            "author": "Playful-Flamingo4931",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah I think so, but it really just depends on your interests and how you want to spent those first few days. Sounds like you lean towards outdoorsy but the LA focused ones are very cool as well. Honestly all of the trips help you make friends (everyone will be friendly and eager to make friends) and if the outdoor scene is for you, both are a good way to get introductions to the outdoor club. \n\nI would say def bring your own stuff down if you have it. If you don’t have something it’s truly nbd bc the gear closet has so much stuff and pz will make sure you’re prepared and have everything you need for orientation. I liked having my own stuff that I knew fit me well/ you’ll probs be going on trips throughout the school year, esp for breaks and it’s nice to have your own stuff for that (if you want to ofc). But you can always rent from the gear closet is need be. They have a lot of gear!!",
                                            "score": 2,
                                            "author": "Playful-Flamingo4931"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just an FYI but transfer students have their own OA trip! It’s with other transfer students. I think my transfer friends went to the beach.. not 100% sure I could ask them",
            "score": 1,
            "author": "Lilburrito502",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh so you can't choose?",
                    "score": 1,
                    "author": "ElHijoMayor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Unless something has changed since Fall 2021, no, I don’t think so :/",
                            "score": 2,
                            "author": "Lilburrito502",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That kinda sucks but thanks for the info :)",
                                    "score": 1,
                                    "author": "ElHijoMayor"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There are some trips that you can choose and there’s just a specific group for transfers. My OA was like that",
                            "score": 2,
                            "author": "mangodragonfruet"
                        }
                    ]
                }
            ]
        }
    ]
}