{
    "id": "br9hhr",
    "score": 9,
    "title": "Claremont students, you should live off campus! (Guide)",
    "author": "[deleted]",
    "date": 1558439774.0,
    "url": "https://www.reddit.com/r/claremontcolleges/comments/br9hhr",
    "media_urls": [],
    "other_urls": [],
    "postText": "**Live off campus!**\n\nAs Claremont Colleges students, many of us choose to live off-campus during the academic semester, and we also need apartments for our summer internships and research programs. The colleges do not adequately inform students of off-campus housing, however, which is a bit unfair; some students do not want to live in the dorm environment. Although Claremont offers a plethora of apartments, rooms aren’t always easy to find through Craigslist or Facebook. I’m a rising junior at Pomona and have made this post so that more of you can be in-the-know! \n\n**Off-Campus Housing**\n\nThere are three main apartment complexes that are popular for students.\n\n1.) College Park\n\n2.) Claremont Collegiate Apartments\n\n3.) Paseos Apartments\n\n**College Park**\n\nThe most popular off-campus housing is College Park, an apartment community adjacent to the Claremont Colleges. Their community includes two swimming pools, two spas, a gym, and more, while the apartments are fully-furnished with kitchen appliances, a washer and dryer, air conditioning, and a private garage and balcony. While there is no shuttle service, walking from College Park to the campuses is quick (5 to 10 minutes to Pitzer/CMC/Pomona, 10 to 15 minutes to Scripps/Harvey Mudd/Claremont Graduate University). \n\nAt College Park, an apartment with a single bed and bathroom starts at about $1795, while an apartment with two beds is priced at about $2000. Students usually split apartment costs, however, which makes monthly costs of renting off-campus equivalent to living on campus. \n\n**Claremont Collegiate Apartments**\n\nThe Claremont Collegiate Apartments are a fifteen-minute walk from the Claremont Consortium. The Claremont Colleges recommend this apartment complex to students who seek off-campus housing. All housing units include a kitchen and Cable TV, and there are washing and drying machines on the property. According to them, each apartment varies in space and furniture provided. In addition, shuttle service is provided, which makes transportation easy.\n\nSince the Claremont Collegiate Apartments cater specifically to students and faculty at the Claremont Colleges, these apartments are much cheaper; a double unit starts at $880, while a single can range from $1100 to $1780. Some colleges encourage students to live here, however, and give students stipends as compensation; Scripps provides $1,000 in Claremont Cash (per year) to those who volunteer to live here. \n\n**Paseos**\n\nThe Paseos Apartment Homes in Montclair, about a mile and a half from the Consortium, are close to Target and the Montclair Plaza, which has a Macy’s, Nordstrom’s, and more. The apartments have washers and dryers, a dishwasher, microwave, and balcony, plus two communal pools, a gym, and a yoga room. \n\nAt the Paseos, a small studio starts at $1600 a month, while a two-bedroom flat is priced at $2,225, which can be split with another roommate. There is no shuttle service, however, and because this complex is about a 25-minute walk from campus, it is important to factor in a bicycle or car into the total cost. On the flip side, the Paseos is a quick 5-minute walk to Target and the mall, which is an immense advantage. \n\n**My Thoughts**\n\nPersonally, I would choose to live in College Park. The apartment would be relatively close to my classes at Pomona, and I would use a bike to get from the apartment to my classes. I would not mind staying on the meal plan, since the Claremont Colleges food is generally good, but I would also be happy buying food myself. If you do the math, meals at the dining hall are expensive—each dinner is about $17! \n\nThere are advantages to living at each apartment complex, and I encourage all Claremont students to tour each one. It is important that you contact the housing and residence life office of your college to petition to live off-campus before  investing, but once you are approved, your off-campus experience will be something to really look forward to.  The RentHoop app, too, is a great way to connect with others seeking roommates in the area and is highly recommended! It's like Tinder for finding a roommate, and you can even filter potential roommates with 'deal-breakers' so that you are matched with the most compatible person available.",
    "comments": []
}