{
    "id": "hq99u7",
    "score": 3,
    "title": "Economics and Engineering Group/Chat?",
    "author": "Astro_Flux",
    "date": 1594616816.0,
    "url": "https://www.reddit.com/r/claremontcolleges/comments/hq99u7",
    "media_urls": [],
    "other_urls": [],
    "postText": "Econ + Engineering (3+2) incoming freshman here: is there a group/chat of some sort where I could ask questions about the major and talk to others interested in it? If there isn't, is anyone interested in making one with me?",
    "comments": [
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! Yeah, I was planning on taking the CS sequence regardless of whether or not the classes would be on Pomona or Mudd campuses.",
                    "score": 1,
                    "author": "Astro_Flux"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why do you want to pursue Engineering? CMC is known for Economics and you applied to UIUC Engineering and took CS50? If your intention is CS then you should transfer to Pomona/CMC since Mudd is closing its CS department really fast (this year they use the lottery system, which, as you know, isn't good at all).",
            "score": 0,
            "author": "Illustrious_Ant_7008",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;If your intention is CS then you should transfer to Pomona/CMC\n\n? I'm matriculating into CMC, so I'm not sure what you meant by this. But anyway, I want to pursue Economics and Engineering because I think it's the perfect blend of courses for me and I'm genuinely interested in both Economics/Finance and Computer Science. I was just hoping to find others like me who wanted to create a group chat or something.",
                    "score": 3,
                    "author": "Astro_Flux",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, really confused by that previous comment, and awesome that you're going to be 3+2, I definitely know a decent amount of people who do it, and I know that if they're still offering it then you'll be able to get those CS courses. I'm not sure if there is a gc, most people just make study groups with the people in their classes, but definitely check the Facebook groups, they're a lot more active than the subreddit",
                            "score": 2,
                            "author": "chan_biscuits",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Gotcha, thank you so much!",
                                    "score": 1,
                                    "author": "Astro_Flux"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}