{
    "id": "owuz6g",
    "score": 2,
    "title": "BA in 3 years",
    "author": "Ok_Performer_1914",
    "date": 1627961550.0,
    "url": "https://www.reddit.com/r/claremontcolleges/comments/owuz6g",
    "media_urls": [],
    "other_urls": [],
    "postText": "can any upperclassmen/recent graduates provide any insight into how it would look like/if it’s possible to graduate in less than 4 years with at least a dual major?",
    "comments": [
        {
            "level": 0,
            "comment": "you might be able to finish a semester early with a dual degree through a combination of overloading (taking 5 courses/semester instead of the normal 4) and AP credits. I think that even if you could do it quicker than that you would be missing out on things and have a pretty restricted schedule, especially with a dual major. I know a handful who have done what I described above in 7 semesters.\n\nedit: and the ap credits would just be a bonus. mathematically it's doable if you just overload 4 semesters with 5 classes I guess, but obviously fitting in another 4 classes in 6 semesters (graduating in 3 years) would be a challenge and require two semesters overloading with 6 instead of the normal 4. that would require special approval from the registrar which may not be easy to get at cmc, you would need to convince them you have a good reason. can't speak for other colleges.",
            "score": 3,
            "author": "DreSheets",
            "replies": [
                {
                    "level": 1,
                    "comment": "alright! thank you so much for the helpful advice! will see how this goes :)",
                    "score": 2,
                    "author": "Ok_Performer_1914"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The work load would be horrific. Without taking into consideration a dual major, graduating a full year early would require you to more than overload every semester. You would either have to take summer courses or get credit for internships (which requires writing a 40-60 page paper). Taking into consideration a dual major, it would be even harder. Unless you have a wildly pressing need to be out in 3 years I would not advice setting it as a goal.",
            "score": 1,
            "author": "themagicpandaa"
        }
    ]
}