{
    "id": "qx7dhq",
    "score": 1,
    "title": "International Prospective Student Needing Aid- Applying to Scripps",
    "author": "toooldforthegoodfun",
    "date": 1637293293.0,
    "url": "https://www.reddit.com/r/claremontcolleges/comments/qx7dhq",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi all! I’m an international applying as freshman this year and I really like the Claremont Colleges, especially Scripps. However, I will be needing financial aid (a substantial amount of it) and I’m hoping to get some glimpse into the minimum contribution level Scripps requires for an application to be considered, as well as the available scholarships the college offers. I could only find brief mentioning of scholarships ranging from 15k to 28k on the college’s website and not much beyond that. Any sharing from alumni or internationals with similar situation would be a tremendous help. Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "You are not eligible for grants, loans or work-study as an international student. So your financial aid package won’t be as good as a domestic student. International students are expected to make a heavy contribution at Scripps.",
            "score": 2,
            "author": "ResponsibilityGood59"
        },
        {
            "level": 0,
            "comment": "I was a domestic applicant, but I found my financial aid package from Scripps to be very generous due to my demonstrated financial need. Scripps offered me grants, scholarships, work-study pay, federal loans and private 0% interest loans from a special financial aid fund. I still had a manageable expected family contribution, but Scripps was one of the better financial aid packages I received. Your experience may vary as an international applicant though.",
            "score": 1,
            "author": "Nozomi134",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi! Tysm for sharing. Can i pm you tho? I’ve been trying to talk to alumni and learn more about the college but admission counselors and student reps are all unavailable since everyone’s busy with ED1 :(",
                    "score": 1,
                    "author": "toooldforthegoodfun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep, feel free!",
                            "score": 1,
                            "author": "Nozomi134",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Pm!",
                                    "score": 1,
                                    "author": "toooldforthegoodfun",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m currently a 1st yr at scripps pm me if you have any questions!",
                                            "score": 1,
                                            "author": "UnlikelyMarionberry"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}