{
    "id": "qzqktq",
    "score": 10,
    "title": "Is it possible to work while attending Harvey Mudd?",
    "author": "[deleted]",
    "date": 1637601835.0,
    "url": "https://www.reddit.com/r/claremontcolleges/comments/qzqktq",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm a hs senior who is planning on applying to HMC for Physics, but I have heard many stories about the extreme workload. As someone who will probably have to work while I attend college, is it possible to keep up with the workload, my job, and still have time to do college stuff?",
    "comments": [
        {
            "level": 0,
            "comment": "It depends on the job and how many hours you work? I have 2 on-campus jobs right now from work-study, but it only totals up to a little less than 7 hours per week. Although it can be difficult sometimes, my jobs are pretty light in terms of work, so I can usually do some homework during that time. Also, the core curriculum is being changed for your class year (CO '26), so you'll actually have a bit of a lighter workload compared to previous years.",
            "score": 8,
            "author": "yoshi_iv",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey, I know this is off-topic from thread, read one of your post about Information and Computer systems-UCI, do you mind sharing your view point what would be eligible GPA for UCI to consider me above Major?\n\nTIA.",
                    "score": 1,
                    "author": "ChildofLord",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably best to PM me",
                            "score": 1,
                            "author": "yoshi_iv"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "no not a serious job i took semester off to work. barely had time for pet projects/preparing for work with core.\nif you mean oncampus low stress job then yes.",
            "score": 3,
            "author": "ParkingMobile2095"
        },
        {
            "level": 0,
            "comment": "There are some on campus jobs that let you do schoolwork while working! For example, if yours is a job where you’re basically sitting and waiting for students (like checking in students at the gym), you can do homework on the job",
            "score": 3,
            "author": "ChidiTheSoup"
        },
        {
            "level": 0,
            "comment": "No. Please don't.",
            "score": 3,
            "author": "ProtonDeathRay"
        }
    ]
}