{
    "id": "122u4xo",
    "score": 95,
    "title": "Thought provoking podcasts on otherwise unknown happenings/things",
    "author": "Old_Sun_Blue",
    "date": 1679853502.0,
    "url": "https://www.reddit.com/r/podcasts/comments/122u4xo",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm a big fan of This American Life, Radiolab (the older episodes), and The Moth Radio Hour. I love learning about stories/people/events that you wouldn't normally think about but end up finding fascinating when a story about them is told/produced nicely. Any suggestions? Would prefer actual episodes you'd recommend as well. Thank you!",
    "comments": [
        {
            "level": 0,
            "comment": "Decoder Ring! That is a really fun one. They unpack cultural phenomenons that you’ve probably never thought twice about the origins of (ie the history of the mullet, the evolution of America’s attitude towards Bart Simpson, the development of the Segway, etc). Great host and I love the production on that one.",
            "score": 34,
            "author": "franks-little-beauty",
            "replies": [
                {
                    "level": 1,
                    "comment": "Awesome thank you!",
                    "score": 5,
                    "author": "Old_Sun_Blue"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Underunderstood.",
            "score": 10,
            "author": "YoungGazz"
        },
        {
            "level": 0,
            "comment": "Criminal \nThis Is Love\n\ncriminal is about true crime but not just murder and it’s more like this American life than a typical true crime podcast.",
            "score": 8,
            "author": "toastedshark"
        },
        {
            "level": 0,
            "comment": "The Atlas Obscura podcast is a lot of fun.  Sometimes a little too short but well done and interesting.  Happy hunting :-)",
            "score": 6,
            "author": "drunk_on_the_radio",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank ya! Any specific episodes that made you enjoy it enough to recommend?",
                    "score": 1,
                    "author": "Old_Sun_Blue",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The Jadeite Cabbage description sent me down a fun rabbit hole of art from the royal city. And the Lonliest Post Office was another fun one.",
                            "score": 3,
                            "author": "drunk_on_the_radio"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Visit the archive of Reply All. So many crazy stories are unravelled. I’m not a tech person and I thoroughly enjoyed it.",
            "score": 11,
            "author": "Off-With-Her-Head",
            "replies": [
                {
                    "level": 1,
                    "comment": "I really need someone to pick up where Reply All left a void.",
                    "score": 2,
                    "author": "slumbersonica",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Did you listen to Crypto island?",
                            "score": 1,
                            "author": "vfx_4478978923473289",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, ill check it out!",
                                    "score": 1,
                                    "author": "slumbersonica"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Hard Fork has a similar vibe to Reply All, check it out if you haven’t already",
                            "score": 1,
                            "author": "Agent_Michae1_Sc4rn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you! Will give it a listen.",
                                    "score": 1,
                                    "author": "slumbersonica"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Such a shame this pod imploded in the political hysteria of the pandemic. I used to look forward to it.",
                    "score": 5,
                    "author": "MAIN-WAV-EE"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Allusionist\n\nDrilled\n\nHome of the Brave\n\nImmaterial\n\nMoonrise\n\nSidedoor\n\nThreshold",
            "score": 4,
            "author": "Heron78",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are these all podcasts or episodes from one in particular?",
                    "score": 1,
                    "author": "Old_Sun_Blue",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "These are all podcasts",
                            "score": 1,
                            "author": "Heron78"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cautionary Tales",
            "score": 3,
            "author": "thefonz22"
        },
        {
            "level": 0,
            "comment": "You're Wrong About comes to mind immediately.  \n\n99% Invisible should work for you.  \n\nNo Such Thing As A Fish maybe something you'd enjoy.  \n\nInfinite Monkey Cage - it speaks for itself.",
            "score": 19,
            "author": "LakeStLouis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, 99% Invisible would be the gold standard for this imo. I’d start back from the VERY BEGINNING. Roman Mars’ voice is mellifluous bordering on ASMR.",
                    "score": 13,
                    "author": "robotatomica",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I love the episode on averages!",
                            "score": 2,
                            "author": "ties__shoes"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes, You're Wrong About would fit these criteria perfectly! I never cared about princess Di or Karen Carpenter until Sarah Marshall told me about them.",
                    "score": 5,
                    "author": "kaoticgirl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sarah Marshall is seriously the best",
                            "score": 5,
                            "author": "_handstand_scribbles"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "+1 for fish, best podcast of all time",
                    "score": 2,
                    "author": "djsedna"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Darknet Diaries might fit your criteria. There's just a lot about the internet and the crimes and security surrounding it that normal people don't necessarily think about.",
            "score": 3,
            "author": "pipestream",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes! Can get a little tech heavy but most episodes are easily digestible. Here’s a couple I recommend to anyone curious!\n\nXbox Underground \n\nKik\n\nFor Your Eyes Only \n\nThe Carder \n\nJackpot \n\n(not including episode number because I believe it varies depending on where you listen)",
                    "score": 1,
                    "author": "DickTooRadical",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A lot of it goes over my head, too, but I'm quite fond of the episodes where pen testers tell about some of their experiences!",
                            "score": 1,
                            "author": "pipestream"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Anthropocene Reviewed and Mystery Show",
            "score": 3,
            "author": "zzziff"
        },
        {
            "level": 0,
            "comment": "9/12 is so good. It’s about all the ways people and organizations were affected the day after 9/11. For example, one of the episodes is about how the staff at The Onion (satire newspaper) woke up on 9/12 and realized they had to report on the tragedy, but their whole paper was satire - so how do they make jokes about something so somber? every episode is fascinating and surprising. It’s so well done.",
            "score": 3,
            "author": "Nervous-Shark"
        },
        {
            "level": 0,
            "comment": "I love \"This is Actually Happening.\" It's first person accounts of wild and interesting stories. Some are true crime, some are heart breaking, but they are all interesting.",
            "score": 2,
            "author": "FabLightningMcQueen"
        },
        {
            "level": 0,
            "comment": "Timesuck!! Super fun and very educational.",
            "score": 2,
            "author": "Welcom2ThePunderdome"
        },
        {
            "level": 0,
            "comment": "I really like The Weirdest Thing I Learned This Week! It’s by the editors of Popular Science magazine, and they put in a lot of stuff that they researched but couldn’t write full articles about. Lots of fun historical and scientific events that I never had heard of, but are great stories to tell to your unsuspecting friends haha :)",
            "score": 2,
            "author": "godangler"
        },
        {
            "level": 0,
            "comment": "Rumble Strip! Highly applauded by the NYT as a top podcast of 2022. It’s about the lives of everyday Vermonters and it ranges from bonkers to thought-provoking to LOL funny to absolutely heartbreaking.",
            "score": 2,
            "author": "peachboot828",
            "replies": [
                {
                    "level": 1,
                    "comment": "Love the sound of this!",
                    "score": 2,
                    "author": "Old_Sun_Blue"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Reveal podcast does investigative journalism and I’ve really been enjoying their episodes for the reason you put in your post.",
            "score": 2,
            "author": "Ephemera_Hummus"
        },
        {
            "level": 0,
            "comment": "99% Invisible might suit you",
            "score": 1,
            "author": "kaoticgirl"
        },
        {
            "level": 0,
            "comment": "Subscurity is a good one about obscure subcultures - one host researches the topic and the other one has no idea what the topic will be.  Super fun and random\n\nSome good episodes to start with: Professional Bridesmaids (16), Michelin Inspectors (93), Flat Earthers (86).",
            "score": 1,
            "author": "anonymous_scrolling"
        },
        {
            "level": 0,
            "comment": "I will never not recommend **\"Sawbones: A Marital Tour of Misguided Medicine.\"** Dr Sydnee McElroy and her comedian husband, Justin, host a show about medical history. They pick an illness, treatment, or other subject and walk through the history of it. From patent medicines and folk remedies to brilliant doctors and scientists, they chronicle humanity's attempt to fix what ails them. It's at times funny, sad, disturbing, but always interesting.\n\nSome of my favorite episodes include: 276 The World of Warcraft Plague\n\n125 King of Quacks\n\n301 Taint Tanning\n\nPlus, they have holiday episodes, weird medical questions, brand histories, and themed live shows. \n\n\n\nMy new favorite is **A History of Rock in 500 Songs.** The host laid down an outline for the history of Rock music with each episode featuring one or more songs that influenced that trajectory. From its roots in jazz, blues, and folk music through Rock &amp; Roll and its many iterations in the 20th Century. He plans on ending it before the new millennium, encapsulating Rock through the 1990s.  \n\nIt's a good look into the history of the genre, music industry, and American culture overall.",
            "score": 1,
            "author": "dig_dude"
        },
        {
            "level": 0,
            "comment": "I love 30 for 30 for this reason. I don't typically follow sports and these incredible shows make me care about things I've never thought about before. The series about Bikram yoga was fascinating and scary. The episode about WNBA players playing in Russia, wild. Highly highly recommend.",
            "score": 1,
            "author": "meghalady"
        },
        {
            "level": 0,
            "comment": "Behind the Bastards is a great one! I’ve learned about a ton of relatively obscure history from it",
            "score": 1,
            "author": "rocketeerH"
        },
        {
            "level": 0,
            "comment": "Endless Thread is a great one for this! They find obscure stories/people/events and make well produced stories about them. Some of it is silly (ghost story about an imaginary friend) and some of it is incredibly serious (govt sponsored psycholgical torture with MK Ultra). Plus their stories are largely sourced from or are about Reddit and really imo captures the magical feeling of getting insight into other ways of living/thinking that Reddit provides.",
            "score": 1,
            "author": "quintessentialquince"
        },
        {
            "level": 0,
            "comment": "I enjoy “Stuff You Should Know” it definitely has the vibe of very interesting deep dives on random topics",
            "score": 0,
            "author": "Aggravating-Ad-9343"
        }
    ]
}