{
    "id": "123d7ja",
    "score": 20,
    "title": "Recommendations for shows like Mission to Zyxx or Hello from the Magic Tavern?",
    "author": "mid-world_lanes",
    "date": 1679896692.0,
    "url": "https://www.reddit.com/r/podcasts/comments/123d7ja",
    "media_urls": [],
    "other_urls": [],
    "postText": "Anything with a similar vibe to these; i.e., light and goofy serialized comedy fiction with an escapist aesthetic. Open to RPG actual plays with a similar vibe. Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "I really like\n\n[Civilized](https://civilizedpod.com) \\- Dark scifi improv comedy about the last crew of people trying to terraform a hostile planet\n\n[Spaceships](https://spaceships.podbean.com) \\- Comedy about sentient AIs dealing with the sudden die-off of all organics in the universe. Great banter, likeable characters. \n\n[Two Princes](https://gimletmedia.com/shows/the-two-princes/) \\- Fantasy comedy. Really well done, with great actors like Christine Baransky. \n\nAnd maybe even our show [HUMAN-B-GON](https://link.chtbl.com/humanbgon?sid=red). Scifi dark comedy set in the future after the machines have taken over, and robots are hired to 'ethically relocate' stray humans. Warning: violence and stupidity",
            "score": 3,
            "author": "human-b-gon"
        },
        {
            "level": 0,
            "comment": "You might really enjoy Stella Firma, about an incompetent pair of people who work for a company that designs custom planets for (mostly) aliens. Produced by Rusty Quill.\n\nAnother one is Midnight Burger is about a diner that travels across time/space/dimensions. Occasionally a little bit serious, but mostly very, very funny.",
            "score": 4,
            "author": "circadianist"
        },
        {
            "level": 0,
            "comment": "Beef and Dairy Network - absolutely the best",
            "score": 3,
            "author": "6_PP"
        },
        {
            "level": 0,
            "comment": "Not serialized specifically, but the now defunct The Lanalax Corporation was a hilarious absurd improvisational comedy podcast with recurring characters. Their backlog is well worth checking out.",
            "score": 2,
            "author": "russfro"
        },
        {
            "level": 0,
            "comment": "You looking for fantasy or space themed…bc I gotta recommend Batman (The AudioAdventures) the voice cast is deeeep. Just listen to the first 2-3 episodes before checking out the cast. You will be amazed",
            "score": 2,
            "author": "P0dFather"
        },
        {
            "level": 0,
            "comment": "Radiation World \n\nVictoriocity \n\n\nMarsCorp",
            "score": 2,
            "author": "pike360"
        },
        {
            "level": 0,
            "comment": "For DND podcasts I recommend Dungeons and Daddies and Fantasy High (and pretty much anything by Dimenson 20).\n\nFor shows similar to Missoon to Zyxx, Wolf359 is pretty similar but a bit more chill &amp; can be more serious at times",
            "score": 2,
            "author": "Shuyace"
        }
    ]
}