{
    "id": "124vosr",
    "score": 30,
    "title": "True Crime -Podcast Recommendations",
    "author": "meeniebo",
    "date": 1680023789.0,
    "url": "https://www.reddit.com/r/podcasts/comments/124vosr",
    "media_urls": [],
    "other_urls": [],
    "postText": "Any true crime podcasts that don’t have constant tangents or chit chat. I can’t listen to crime junkie because listening to someone tell a story to someone else and they respond just gives me secondhand embarrassment. It feels too performative/Ingenious.\n\nThanks in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "We're gonna throw to a rival here and recommend **Casefile**. One case, no tangents, just the facts as the Narrator sees them.",
            "score": 20,
            "author": "WeirdCrapInAustralia",
            "replies": [
                {
                    "level": 1,
                    "comment": "Casefile is my all time favorite podcast. I used to listen to CJ and morbid and hated it, just wanted a straightforward voice. Binged all the episodes it’s really well done",
                    "score": 3,
                    "author": "pzza6666",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Casefile was my Pokemon Go listening series of choice from roughly episode 25 or 30 (the first ones I remember listening to were the Russell St Bombings and Pru Bird set, and I specifically remember them because I had to go back and start again after them while waiting for new episodes), right up until they covered Milat.\n\nBy then, our podcast was taking off and we'd covered him, so I had no interest in listening to the case. I've tried to dip back in now and then, but the cases are no longer Australian-only, which is what initially drew me to the series, and even if they were, we've either covered them or will cover them ourselves, so no spoilers! \n\nReally wish I could get back into true crime podcasts but, alas, it was not meant to be (so far).",
                            "score": 1,
                            "author": "WeirdCrapInAustralia"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you for your recommendation! I just listened to two episodes. Mike Williams &amp; The Harrison Family. I love how it’s straight forward and easy to follow along.",
                    "score": 1,
                    "author": "meeniebo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Criminal hosted by Phoebe Judge. Great, huge back catalog for you to enjoy.\n\nIf you haven't listened to it yet, Season 2 of Serial is probably my favorite story.",
            "score": 13,
            "author": "HumanAverse",
            "replies": [
                {
                    "level": 1,
                    "comment": "Criminal is THE BEST true crime podcast and it isn’t even close",
                    "score": 4,
                    "author": "thetermagant"
                },
                {
                    "level": 1,
                    "comment": "Yes to both things. Criminal is amazing but also I feel like people all know season 1 of serial or recommend season 3 but I prefer season 2 overall",
                    "score": 2,
                    "author": "Hairy_Buffalo1191",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bowe Bergdahl is beyond polarizing. He's a fuck goof of nearly unprecedented knuckleheadedness and many other failures (both personal and institutional). But oh my how interesting on a personal and sociological level.\n\nI'm on episode 8 of *The Coldest Case in Laramie* right now and it's been a good ride too",
                            "score": 2,
                            "author": "HumanAverse",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I haven’t actually listened since the episodes first dropped so it’s been a while, i can’t really remember what my opinion of him was at the time. I just remember it being particularly good storytelling",
                                    "score": 2,
                                    "author": "Hairy_Buffalo1191",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I guarantee you'll have a different opinion now that we have more distance from the media circus.\n\nI am also a GWOT veteran so it really hits me in a personal way.",
                                            "score": 1,
                                            "author": "HumanAverse",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "To be honest I didn’t even know his story til I listened. I knew his name but that was it. I actually didn’t even realize until looking it up just now how soon after his release the podcast came out. \n\nBut yeah that definitely makes sense that you would have very specific feelings about it",
                                                    "score": 1,
                                                    "author": "Hairy_Buffalo1191"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you for your recommendation I have been listening to Criminal and am obssesed. My two fav episodes so far has been “vanish” and “A bump in the night”",
                    "score": 1,
                    "author": "meeniebo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do yourself a favor and check out Bear Brook. It's a series following a single case with excellent reporting and storytelling. There is a second season about a different crime that's airing now. It's one of my all time favorites",
            "score": 11,
            "author": "FrolfingKurlzz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sooooo good!  This one and Atlanta Monster are some of my favorites.",
                    "score": 1,
                    "author": "Shoddy_Buyer_1902"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Queen of the Con. Host was the victim of a scammer - first season is about his experience, and explaining all the other scams this woman was a part of. Seasons 2 and 3 are the host doing a deep dive on 2 other scammers.",
            "score": 10,
            "author": "Walway"
        },
        {
            "level": 0,
            "comment": "Check out r/truecrimepodcasts \nThere is a great spreadsheet in there for a ton of TC podcasts and recommendations",
            "score": 5,
            "author": "Ginger8682",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep... linked in our weekly stickied threads.  Or in the r/TrueCrimePodcasts/ subreddit you can comment \n\n    !Podsheet \n\nand Automod will reply back with a link.",
                    "score": 2,
                    "author": "loonling"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"The Trail Went Cold\" is excellent, has a huge back catalogue, and stays laser-focused on the topic",
            "score": 4,
            "author": "GhostsOfVegasPast"
        },
        {
            "level": 0,
            "comment": "Park Predators and The Invisible Choir.",
            "score": 3,
            "author": "Beyou74"
        },
        {
            "level": 0,
            "comment": "Counter Clock has a great host and each season is a deep dive into a case. \n\nHell and Gone is another good one, but sometimes you have to force yourself through the slow parts. The most recent season is the best yet.",
            "score": 3,
            "author": "Quackamousse"
        },
        {
            "level": 0,
            "comment": "Seconding Bear Brook. Also loved Bone Valley. Both engrossing, fascinating shows that don't have a bunch of innane chitchat or reading Wikipedia articles. Bother feature real reporting, which sometimes feels unfortunately rare in the genre.",
            "score": 3,
            "author": "endless_thread"
        },
        {
            "level": 0,
            "comment": "Sinisterhood!",
            "score": 3,
            "author": "kittykattlady"
        },
        {
            "level": 0,
            "comment": "Swindled, Scamfluencers. I can’t stand Crime Junkie; she always sounds like she’s just reading a court transcript.",
            "score": 7,
            "author": "Ella0508"
        },
        {
            "level": 0,
            "comment": "I always recommend Timesuck with Dan Cummins. It’s usually hilarious and well researched. However, it’s not all crime. Southern Fried True Crime with Erica Kelly is good. In the Red Clay and Gone South are both gods series. Crime Junkies has been accused of using other podcasts material, verbatim.",
            "score": 4,
            "author": "gorillatoof",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not just accused, but confirmed. Ashley flowers issued a half baked apology and then went on to do it again. They also  pay for assloads of fake reviews and to have online criticism disappeared. About the  scummiest pod network out there.",
                    "score": 1,
                    "author": "bepositiveinstead"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Casefile is the absolute best. One narrator telling the story with decent music/production. The stories are really well researched and sensitive to the victims. Can't recommend it enough!",
            "score": 4,
            "author": "ThePinkDread"
        },
        {
            "level": 0,
            "comment": "Solved Murders or Unsolved Murders, I would also suggest Cults\n\nThese are performative, but it keeps all the side convos out",
            "score": 2,
            "author": "Jen2756"
        },
        {
            "level": 0,
            "comment": "Bear Brook season 1 is fantastic!",
            "score": 2,
            "author": "nuts4peanuts"
        },
        {
            "level": 0,
            "comment": "I really like The Vanished.  The host Marissa talks to families about their missing loved ones, and talk about what May have contributed to their disappearance",
            "score": 2,
            "author": "Sprina50"
        },
        {
            "level": 0,
            "comment": "The Pretend podcast is really good",
            "score": 2,
            "author": "Whyam1sti11Here"
        },
        {
            "level": 0,
            "comment": "I loved Someone Knows Something.",
            "score": 2,
            "author": "passionateamateur"
        },
        {
            "level": 0,
            "comment": "I’ve been a big fan of [Mr. Ballen](https://youtu.be/QRzgmZiZn6U) lately. Unfortunately his podcasts are exclusive to Amazon Music, but he also has a plethora of videos on his YouTube channel. His episodes focus on one story at a time; and he’s brilliant at being very descriptive while still remaining engaging to the listener. He’s really good at painting a picture in your head while he’s describing events. \n/",
            "score": 1,
            "author": "ViolentDiplomat"
        },
        {
            "level": 0,
            "comment": "Cold Cases (may only be on Spotify though so I've only listened to a handful but they seemed very much as you described)",
            "score": 1,
            "author": "Dragonfruit_Friend"
        },
        {
            "level": 0,
            "comment": "Red handed! (Huge catalogue &amp; v in depth). Modern cases, old timey cases. They now do 2 eps a week. One full episode and one short hand episode which is half an hour and covers topics they’ve always wanted to cover.\n\nCrime show! Smaller but all good\nCriminal! Huge catalogue and a bit more light hearted imo \n\nLimited series:\nDeath in ice valley\nCrypto queen\n\nCrime meets history:\nStuff the British stole",
            "score": 1,
            "author": "mhodgy",
            "replies": [
                {
                    "level": 1,
                    "comment": "I cannot stand RedHanded! Very entitled, very opinionated when they shouln’t be. Awful. I’ve listened to a couple of seasons but was always left in a very negative state, and not because of the cases alone, but because of their constant judgments and negativity. \n\nI would recommend Buried Bones. It is a much better true crime podcast in every aspect.",
                    "score": 6,
                    "author": "seramica",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fair enough, each to their own. I really like them. Will have to give buried bones a go",
                            "score": 1,
                            "author": "mhodgy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m sorry if it seemed too harsh! We are all entitled to our likes and thank god we have many options and things to choose from :) \n\nI like Buried Bones because i like the host of Tenfold more wicked (Kate Winkler Dawson) and also Paul Holes (who was a host on “Jensen and Holes: The murder squad” and now also on Small Town Dicks).",
                                    "score": 1,
                                    "author": "seramica"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mr Ballen",
            "score": 1,
            "author": "BobbyBobbyBoy52"
        },
        {
            "level": 0,
            "comment": "Another vote for Mr Ballen",
            "score": 1,
            "author": "lindseyjaye"
        },
        {
            "level": 0,
            "comment": "Thanks for the comments! This is so helpful. I will look through top charts and the true crime category but never get very far!!",
            "score": 1,
            "author": "meeniebo"
        },
        {
            "level": 0,
            "comment": "I haven’t listened to every episode but Ridiculous Crime can be fun",
            "score": 1,
            "author": "Hairy_Buffalo1191"
        },
        {
            "level": 0,
            "comment": "Game of Crimes. One DEA agent and one trooper, both retired, interview other law enforcement folks about major events and happenings.\nFBI Retired Casefile Review. Retired FBI agent interviews other FBI agents.",
            "score": 1,
            "author": "Ralph_O_nator"
        },
        {
            "level": 0,
            "comment": "That Chapter. This dude tells a story and he’s also super funny considering the content. It’s very well done. He just started so not a huge back log but he does have a YouTube channel as well. I’m so stoked he started a podcast!",
            "score": 1,
            "author": "phoebebuffay1210"
        },
        {
            "level": 0,
            "comment": "Big Mad True Crime. Super straightforward but also sassy. No chat, and listener suggestion driven topics.",
            "score": 1,
            "author": "chopfrills"
        },
        {
            "level": 0,
            "comment": "They Walk Among Us.\n\nNo bullshit, straight narrative and usually interesting cases. There is a UK and US version. I think it's great.",
            "score": 1,
            "author": "ningbob"
        },
        {
            "level": 0,
            "comment": "Cold Case Files \n \nCase Files \n\nSerial Killers by Parcast \n\nLast Seen Alive \n\nCold Cases \n\nGraphic Details \n\nBritish Murders \n\nScotland Yard Confidential",
            "score": 1,
            "author": "witty_kity"
        },
        {
            "level": 0,
            "comment": "Another point for Casefile here. Hands down it is the best I've come across. Plus it's an Aussie-based podcast.\n\nCanadian True Crime is one I've recently found. It's hosted by an Australian woman who lives in Canada. The first bunch of episodes are good but a little hit and miss. She found her groove though and I like how she tells the stories.\n\nObscura is another one that's pretty good. The host is just a regular dude. He talks in a funny way (as in, he pauses where I wouldn't usually put a comma in the sentence), but generally his are pretty good.",
            "score": 1,
            "author": "ClassicFantastic787"
        },
        {
            "level": 0,
            "comment": "The Teacher's Pet",
            "score": 1,
            "author": "seethrough_cracker"
        }
    ]
}