{
    "id": "1255zjj",
    "score": 17,
    "title": "Where do you find new podcasts?",
    "author": "misfitheroes",
    "date": 1680045660.0,
    "url": "https://www.reddit.com/r/podcasts/comments/1255zjj",
    "media_urls": [],
    "other_urls": [],
    "postText": "As a listener, do you ever try listening to random podcasts, and have you found anything independent that you like? It seems like most of the recommendations I see are super mainstream",
    "comments": [
        {
            "level": 0,
            "comment": "This subreddit. I just look up a genre I am interested in and put \"reddit\" afterwards. This place usually is the subreddit to show up first.",
            "score": 19,
            "author": "MrCreepySkeleton"
        },
        {
            "level": 0,
            "comment": "I look at Reddit for recommendations. Here and r/audiodrama. \n\nIf you want a few of my personal favorites Everything everywhere, American history tellers, and American scandal are worth a listen",
            "score": 12,
            "author": "eagle00255"
        },
        {
            "level": 0,
            "comment": "There is actually this podcast I found called Trailer Park: The Podcast Trailer Podcast, and it has different trailers each episode for different podcasts and released weekly. I listen on the Pocket Casts app. I included the website for the Podcast, maybe you'll find one here! \n\nhttps://trailerparkpodcast.crd.co/",
            "score": 5,
            "author": "amlynn5257",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's what I was going to say! I also subscribe to Podcast the Newsletter. Her recommendations are always good and they're weekly",
                    "score": 3,
                    "author": "Impossible_View_5127",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I met her at podfest!",
                            "score": 1,
                            "author": "misfitheroes"
                        },
                        {
                            "level": 2,
                            "comment": "[Podcast The Newsletter](https://open.substack.com/pub/podcastthenewsletter/p/roasting-dead-authors-phone-home?r=lsim&amp;utm_campaign=post&amp;utm_medium=email) for anyone interested. Lauren is also on this sub sometimes.",
                            "score": 1,
                            "author": "KweenWithAFlag"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thanks for trailer podcast recommendation. \n\nThis may be a separate thread, but pocket casts wonky search seems to steer me away from smaller podcasts. I stopped using it, because when I type in specific titles of newer podcasts I can’t find them there, even though they’ll emerge if I search a long time.",
                    "score": 1,
                    "author": "luna_dude"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There are podcasts about podcasts. Podcast Playlist from CBC is ok, though I haven't listened to it regularly in a while. I tended to dip in and out of it when I saw an interesting episode. It discusses podcasts, features clips of them. There's also Podcast Radio Hour by the BBC which has finished now, but there's 5 years worth of episodes. Works the same as Podcast Playlist, but with more of a British focus. \n\nI also find podcasts from people mentioning them on Twitter (usually comedians). \n\nThere are SO many podcasts, it's hard to find good independent ones. This subreddit does help.",
            "score": 4,
            "author": "nyecamden"
        },
        {
            "level": 0,
            "comment": "Search for weird things I’m interested in on Spotify. See if that leads to a boring topic podcast or something more interesting. For instance “Horror Queers” popped up on a search for “Hellraiser” alongside the usual movie pods, and that wasn’t a perspective I would normally have sought out. I was fascinated, Now I’m a regular.",
            "score": 6,
            "author": "JossBurnezz"
        },
        {
            "level": 0,
            "comment": "here. or in the true crime podcast sub. I also use this [map sometimes](https://rephonic.com/graph/dna-id), it shows you similar podcasts to the one you introduce (delete 'dna-id' in the search bar and write the name of your preferred podcast)",
            "score": 3,
            "author": "thismakesmesaaaaad"
        },
        {
            "level": 0,
            "comment": "I don't think anyone's mentioned it yet but if you like a podcast check out who made it and follow their other stuff. It could just be the voice or a producer or the studio.   \n\n\nI liked Reply All and checked out Gimlet media's [website](https://gimletmedia.com/shows) where there was Every Little Thing, Heavyweight, 544 Days, Mystery Show and Not Past It.   \n\n\nAnd I looked up Breakmaster Cylinder on [Podchaser](https://www.podchaser.com/creators/breakmaster-cylinder-107ZzlMj6n/appearances) because I like the sound that he creates and know his style only suits a certain kind of podcast. This also led to the Song Exploder episode of the Reply All theme.",
            "score": 4,
            "author": "KweenWithAFlag"
        },
        {
            "level": 0,
            "comment": "If I’m listening to one of my usual pods and they have a guest on that I vibe with then I’ll see if they have a pod.",
            "score": 3,
            "author": "savvy14"
        },
        {
            "level": 0,
            "comment": "I’ve become reliant on posts like this to find more obscure podcasts.\n\nI’d like to recommend Bonanas for Bonanza though. Andy Daly just left Earwolf so he’s gone independent. \n\nI admit I’m a little less adventurous nowadays, but I find some fairly off the beaten path ones. Inside/Out: The Underdogs about a scandal in the Iditarod community is the most recent one.\n\nAlso, it’s dark and roughly produced “Murder at Ryan’s Run” about a murder connected to the MOVE cult.",
            "score": 2,
            "author": "scorpioid_cyme"
        },
        {
            "level": 0,
            "comment": "i searched in google podcasts for fast food reviews and found my beloved doughboys pod",
            "score": 2,
            "author": "vincenicholas"
        },
        {
            "level": 0,
            "comment": "Aside from this sub and the true crime pod sub, I tend to keep older podcasts I enjoyed on my listening app home page and every so often I’ll click on them and find they’ve advertised a new (or new-to-me) series from their production company within the episodes list.",
            "score": 2,
            "author": "ComoSeaYeah"
        },
        {
            "level": 0,
            "comment": "A lot of them are personal recommendations from friends, or shows that feature people I've enjoyed as guests on the shows I already listen to.",
            "score": 2,
            "author": "ringofstones"
        },
        {
            "level": 0,
            "comment": "Mostly from podcasts I already listen to having guests on that I end up liking, then I wander over and check out their podcast. \n\nThe Crime Writers On podcast reviews true crime, media, and often those are other podcast series. Sometimes I'll check in with them and they'll let you know if they thought a podcast series was good or something you ought to check out.\n\nMary Payne Gilbert used to do Payne in the Pod which had other Podcasters onto interview them about how they got started or why they chose their focus of their show. She has not updated that show in awhile, but there were interesting ones I learned of from that show.",
            "score": 1,
            "author": "Kresley"
        },
        {
            "level": 0,
            "comment": "We tend to spend a lot of time in book threads, and tend to find podcasts through there! Shoutout to **Audiomorphs** for rekindling our obsession with the Animorphs franchise.",
            "score": 1,
            "author": "WeirdCrapInAustralia"
        }
    ]
}