{
    "id": "125in14",
    "score": 12,
    "title": "Is there a podcast that's like a radio morning show?",
    "author": "muttonbarley",
    "date": 1680082739.0,
    "url": "https://www.reddit.com/r/podcasts/comments/125in14",
    "media_urls": [],
    "other_urls": [],
    "postText": "Sort of like what Howard Stern used to be, but without the shock jock aspect. Just looking for a fun morning crew kinda thing to listen to at work, that I don't need to pay full attention to. Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "A lot of morning shows are posted as podcasts now I think. I know out of Atlanta, the Morning X Show and The Bert Show both do local morning radio that is also a podcast. I can't speak for how good they are, but they're there.",
            "score": 11,
            "author": "SwirlyGirly42",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks, I'll look those up!",
                    "score": 3,
                    "author": "muttonbarley",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can also stream them live on iHeart radio. I stream live morning radio out of Los Angeles every work day. Same show I used to listen to when I lived there.",
                            "score": 3,
                            "author": "J4M0MU51C",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "https://www.iheart.com/live/177?cmp=ios_share&amp;sc=ios_social_share&amp;pr=false",
                                    "score": 2,
                                    "author": "J4M0MU51C"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was going to say exactly this. I know pretty much ALL the morning shows on my local radio stations release their shows as podcasts; and big ones in Toronto do as well.",
                    "score": 1,
                    "author": "broomlad"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pretty much every radio station in the country puts their shows out as a podcast these days",
            "score": 3,
            "author": "StoJa9",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks, this fact is starting to dawn on me! Know of any good ones?",
                    "score": 2,
                    "author": "muttonbarley",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, I don’t know anything about you, so how would I know what you want to listen to?\n\nIncredible  this got 9 downvotes.",
                            "score": -10,
                            "author": "StoJa9"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dave and Chuck the Freak is a 3ish hour daily morning show that has a podcast. Pretty funny, a little raunchy at times but it's good background noise.",
            "score": 3,
            "author": "GoodbyeTobyseeya1",
            "replies": [
                {
                    "level": 1,
                    "comment": "A little raunchiness is fine, I will give it a listen, thanks!",
                    "score": 2,
                    "author": "muttonbarley"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Chatabix!!!",
            "score": 3,
            "author": "Antallen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Crunch crunch.",
                    "score": 2,
                    "author": "wardyms",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Crunch crunch!!",
                            "score": 1,
                            "author": "Antallen"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Daily Zeitgeist. If you want the NPR vibe, Up First.",
            "score": 2,
            "author": "JossBurnezz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Came here to say both of these. Also Today Explained though I don't know what time it comes out",
                    "score": 2,
                    "author": "endless_thread"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bob and Tom is a syndicated radio show that now puts their whole morning show out as a podcast.  It's great if you like a laugh.",
            "score": 1,
            "author": "Junior-Language-1383"
        },
        {
            "level": 0,
            "comment": "Mark and Lynda podcast if you ever listened to Mark &amp; Brian, it’s that Mark and his wife.",
            "score": 1,
            "author": "marvelous_much"
        },
        {
            "level": 0,
            "comment": "The Steve Dahl Podcast is a daily 90 minute show that I have listened to religiously since around 2009. It's behind a paywall, but he posts free episodes occasionally. You can find them the free ones if you search for them.",
            "score": 1,
            "author": "Frosty_Wafflecone",
            "replies": [
                {
                    "level": 1,
                    "comment": "I live in Chicago. Is he still going? I've heard him a few times. Really boring stuff IMO, but he has been on the radio making a living doing mindless yapping for over 40 years. I find it somewhat Amazing that enough people enjoy him to keep him going.",
                    "score": 1,
                    "author": "slybird",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "His podcast is sunscription-based, and he has done close to 4,000 podcasts over the years. Is there any other podcast with those totals? His demographic is aging, yes, but there are still enough of us, I guess. He has assembled a good team, featuring the witty musician and writer Dag Julen (Poi Dog Pondering). He may be an acquired taste, but I would bet he would accept \"mindless yapping for over 40 years\" as a badge of honor.",
                            "score": 1,
                            "author": "Frosty_Wafflecone",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "*Dag Juhlin",
                                    "score": 1,
                                    "author": "Frosty_Wafflecone"
                                },
                                {
                                    "level": 3,
                                    "comment": "It is a feat for sure. I find it perplexing and amazing.",
                                    "score": 1,
                                    "author": "slybird"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sunday Papers with Greg Fitzsimmons and Mike Gibbons.",
            "score": 1,
            "author": "StickManIsSymbolic"
        },
        {
            "level": 0,
            "comment": "matt and mattingly's ice cream social has a bit of a morning zoo vibe. \n\nYou might enjoy old episodes of \"the comedy button\". Newer stuff isn't so fun, but go back to older stuff and it's a riot.\n\nthe goods from the woods - could be right up your alley!\n\nhollywood babble on , smodcast , jay and silent bob get old , edumacation\n\npodcast but outside\n\nbaby geniuses",
            "score": 1,
            "author": "Narwahl_Whisperer"
        },
        {
            "level": 0,
            "comment": "The Woody and Wilcox Show",
            "score": 1,
            "author": "gonefishcaking"
        },
        {
            "level": 0,
            "comment": "Lex And Terry. I don’t think they’re available as a RSS feed unless you subscribe on their site but they have a free app that plays 24/7.",
            "score": 1,
            "author": "Bigstar976"
        },
        {
            "level": 0,
            "comment": "Preston and Steve have been on in Philadelphia for 20+ years and their show is a podcast every day.",
            "score": 1,
            "author": "funkyted"
        },
        {
            "level": 0,
            "comment": "Jim and Sam Show (Jim Norton and Sam Roberts)\n\nNot current but The Best Show with Tom Scharpling archives \n\nUhh Yeah Dude",
            "score": 1,
            "author": "tiredhippo"
        },
        {
            "level": 0,
            "comment": "The Woody Show is a show like that and their full show is available as a podcast daily.",
            "score": 1,
            "author": "fixerpunk"
        },
        {
            "level": 0,
            "comment": "The Morning Stream with Scott Johnson and Brian Ibbot. Look no further! \n\nComedy, therapy, music, science, it's great.",
            "score": 1,
            "author": "InhibitedExistence"
        },
        {
            "level": 0,
            "comment": "The Ralph Report is great and fits this. Might need headphones though if listening at work",
            "score": 1,
            "author": "swelsh20"
        },
        {
            "level": 0,
            "comment": "The Bob and Tom Show",
            "score": 1,
            "author": "grynch43"
        },
        {
            "level": 0,
            "comment": "John Clay Wolfe. You’re welcome!",
            "score": 1,
            "author": "electriceo"
        },
        {
            "level": 0,
            "comment": "Church of Lazlo on Spotify you won't be disappointed. Great group",
            "score": 1,
            "author": "alliesouth"
        }
    ]
}