{
    "id": "126q063",
    "score": 17,
    "title": "Looking for a specific podcast",
    "author": "Signal_Might_3346",
    "date": 1680189398.0,
    "url": "https://www.reddit.com/r/podcasts/comments/126q063",
    "media_urls": [],
    "other_urls": [],
    "postText": "I listened to an audio drama podcast about a year or so ago. My Spotify history doesn’t go back far enough to find it. \nI *thought* it was by QCode but I can’t find it. \n\nThe plot was that a woman representing the USA was in space, on a space station where a virus had broken out and killed everyone else in the space station. \n\n*possible spoilers below for anyone who hasn’t finished the show*\n\nDuring the podcast, the woman talks to the ai/ship voice. She keeps telling the ship that she has to find “what’s broken” in the ship’s code. The woman had a dog on earth, whose name I believe was Red. She keeps hallucinating the dog. At some point she discovers other people while out on an exploration on a nearby planet (mars maybe?) and those people end up putting the woman on trial for crimes they believe she committed. \n\nIt was fairly short, only one season. \n\nI cannot for the life of me remember the name of it, and Google is not bringing up the right answers. \n\nAny leads?",
    "comments": [
        {
            "level": 0,
            "comment": "I don’t know, but if you don’t get someone who can identify it here try posting in r/audiodrama\n\nLots of experts there.",
            "score": 1,
            "author": "figmentry"
        },
        {
            "level": 0,
            "comment": "I think this is The Broken Code.",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m not finding any podcasts by that name, do you have a link or know where I can find it?",
                    "score": 1,
                    "author": "Signal_Might_3346"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you don’t get an answer here, try r/TipOfMyTongue",
            "score": 1,
            "author": "editorgrrl"
        },
        {
            "level": 0,
            "comment": "Sounds like Magmell",
            "score": 1,
            "author": "be1ngthatguy"
        }
    ]
}