{
    "id": "129x0rk",
    "score": 21,
    "title": "Historical Podcast recs!",
    "author": "Main_Current4984",
    "date": 1680467173.0,
    "url": "https://www.reddit.com/r/podcasts/comments/129x0rk",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey all! I want to get some suggestions for good American history podcasts. I’m looking for podcasts about the start of America, the revolution, the founding fathers, the build up to our independence and stuff like that. \n\nWant a Blowback-like podcast just in the early stages of the country. \n\nHope this makes sense!",
    "comments": [
        {
            "level": 0,
            "comment": "Season 2 of Revolutions by Mike Duncan.  Covers the lead up to revolution, the revolution itself, and the transition from the Articles of Confederation to the Constitution.",
            "score": 13,
            "author": "razedtotheground"
        },
        {
            "level": 0,
            "comment": "American History Tellers did a series on the American Revolution back in 2018. They started the story in 1754. They followed it up with series about rebellion in the early republic, and the Dutch beginnings of New York. Hope that helps!",
            "score": 5,
            "author": "Short_Equivalent_619"
        },
        {
            "level": 0,
            "comment": "You should check out *Ben Franklin’s World.*",
            "score": 3,
            "author": "Mission_Beginning963"
        },
        {
            "level": 0,
            "comment": "Totalus Rankium - American Presidents is biographical, but obviously covers quite a lot about early American history",
            "score": 3,
            "author": "ChronicallyBatgirl"
        },
        {
            "level": 0,
            "comment": "\"The Political History of the United States\" -  far more wide ranging than the title suggests.\n\n\"Pax Britannica - A History of the British Empire\" -  the early American episodes are excellent - as is the entire podcast.",
            "score": 3,
            "author": "kakimiller",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Political History has done the most through coverage of the colonial period that I have seen.  My only annoyance has been a focus on the Northern colonies but they had more wars than the Southern ones.",
                    "score": 2,
                    "author": "Griffen_07"
                }
            ]
        },
        {
            "level": 0,
            "comment": "History that doesn’t suck.",
            "score": 2,
            "author": "seaburno"
        },
        {
            "level": 0,
            "comment": "Behind the Bastards probably has some stuff in that realm",
            "score": 4,
            "author": "JoeBidensBoochie"
        },
        {
            "level": 0,
            "comment": "The Rest is History",
            "score": 2,
            "author": "HobgoblinKhanate1"
        },
        {
            "level": 0,
            "comment": "the history chicks!",
            "score": 1,
            "author": "themadisonjt",
            "replies": [
                {
                    "level": 1,
                    "comment": "or “everything you missed in history class”.  history chicks is great though, they go in depth talking about real and fictional women in history",
                    "score": 1,
                    "author": "themadisonjt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you want a cultural look at this period the Thomas Jefferson radio hour is a reenactor from Monticello talking about some issue as Thomas Jefferson. It’s backed up by all the historical staff at the site.",
            "score": 1,
            "author": "Griffen_07"
        },
        {
            "level": 0,
            "comment": "I like The Dallop, you might have to search around for episodes that cater to your interests if you're being specific",
            "score": 0,
            "author": "Jen2756"
        }
    ]
}