{
    "id": "12bkswf",
    "score": 5,
    "title": "Can someone help me find a podcast about (non-pop) culture?",
    "author": "Environmental-Tune64",
    "date": 1680618485.0,
    "url": "https://www.reddit.com/r/podcasts/comments/12bkswf",
    "media_urls": [],
    "other_urls": [],
    "postText": "Having wearied of political podcasts, i am seeking podcasts that cover art and culture broadly—not popular culture (not scoffing but plenty do this) but rather poetry, literature, new classical music, art pop, performance art, cinema, collectivist politics. Would prefer not just male voices but who can be picky?",
    "comments": [
        {
            "level": 0,
            "comment": "The BBC’s Front Row? Show notes: ‘Live magazine programme on the worlds of arts, literature, film, media and music.’\n\nMostly presented by the bloody wonderful Samira Ahmed. Samira is an outstanding British female journalist and broadcaster. I love her work.\n\nIf you enjoy her voice, she also has a pod called ‘how I found my voice’, which explores how some of the world’s greatest artists and thinkers became such compelling – and unique – communicators. guests include Jude Law, Phil Collins, Graham Norton, Margaret Atwood, Katherine Ryan, Michael Palin, Gloria Estefan, David Lammy and Bernardine Evaristo.",
            "score": 4,
            "author": "StillJustJones",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am going to try this",
                    "score": 2,
                    "author": "mediapoison"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[City Arts and Lectures ](https://www.cityarts.net/audio/) - quite varied interviews, features",
            "score": 3,
            "author": "Repulsive-Dot553"
        },
        {
            "level": 0,
            "comment": "I like Benjamen Walker’s Theory of Everything and Here Be Monsters for this kind of more eclectic content.\n\nAvery Trufelman is also a joy to listen to, although she is a little more focused, her stories always go to places that take me by surprise.",
            "score": 2,
            "author": "scorpioid_cyme"
        },
        {
            "level": 0,
            "comment": "NPR All Songs Considered talks about new artists from around the globe and in a mix of styles.",
            "score": 2,
            "author": "Griffen_07"
        },
        {
            "level": 0,
            "comment": "Pictorial covers art and art history. Its hosted by Quinn and Betty who take turns researching about a topic then share with the other one",
            "score": 1,
            "author": "mynameiscandycain"
        }
    ]
}