{
    "id": "12n4fzl",
    "score": 113,
    "title": "Looking for podcasts that cover 'must know' history (most important events rather than obscure or super specific)",
    "author": "Obvious-Bee-3960",
    "date": 1681568661.0,
    "url": "https://www.reddit.com/r/podcasts/comments/12n4fzl",
    "media_urls": [],
    "other_urls": [],
    "postText": "I like podcasts that cover a topic in 1-2 hours , I want to learn about important historical events, wars , people.",
    "comments": [
        {
            "level": 0,
            "comment": "You could try **In Our Time** it's a BBC radio program released as a podcast where the host will bring on two or three professors, or in some other way experts on a topic, usually the experts are from slightly different specialties related to the day's topic, and they have a conversation about a historical event or person.  Some episodes are more informative and structured than others, but I've never regretted listening to the hour.",
            "score": 48,
            "author": "daehx"
        },
        {
            "level": 0,
            "comment": "The Rest is History has a bit of both obscure and important events. The ep title is a pretty good indicator of how important the event is. Also the hosts are insanely likeable and knowledgeable.",
            "score": 21,
            "author": "14159548210",
            "replies": [
                {
                    "level": 1,
                    "comment": "Already a fan of this one!",
                    "score": 7,
                    "author": "Obvious-Bee-3960"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Short History Of...\" covers a variety of world history events in episodes that are just under an hour. Short, succinct, and enjoyable.",
            "score": 10,
            "author": "PancakeSyrupCat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Looks interesting! Thanks for the rec.",
                    "score": 2,
                    "author": "Calire22"
                }
            ]
        },
        {
            "level": 0,
            "comment": "BBC History Extra might fit but they tend to be 45-60 minutes.\n\nThere are episodes that are more obscure and those that are higher level.  They have a series called \"Everything you wanted to know about...\" (i.e. medieval peasant or rise of Franco\").",
            "score": 6,
            "author": "branzalia"
        },
        {
            "level": 0,
            "comment": "The Dollop is great.",
            "score": 6,
            "author": "BleachingBones"
        },
        {
            "level": 0,
            "comment": "The Rest Is History and In Our Time is all you need",
            "score": 4,
            "author": "scrollingranger"
        },
        {
            "level": 0,
            "comment": "Behind the Bastards has episodes on specific people that highlight and explain the history around them. I never knew Christopher Columbus was such a dick. It's far ranging, episodes are about an hour long but many are 2 or more parters.",
            "score": 8,
            "author": "ookimbac",
            "replies": [
                {
                    "level": 1,
                    "comment": "Come for the history, stay for the A++ Boston accent impressions.",
                    "score": 4,
                    "author": "buttbologna"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"The Rest is History\" highly recommend.",
            "score": 3,
            "author": "kakimiller"
        },
        {
            "level": 0,
            "comment": "I have a different one for you: Swindled. \nReally great podcast. Unique narrator. Talks about historical events that were major crimes.\n\nThe episode about United Fruit was extremely eye opening. The US and United Fruit basically pillaged South America. Don’t know if I’ll ever see bananas the same way again",
            "score": 8,
            "author": "InternationalBand494",
            "replies": [
                {
                    "level": 1,
                    "comment": "Love swindled!!! I wouldn't say it's \"must know\" history, but very informative non the less!",
                    "score": 3,
                    "author": "Elegantly_never",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah. It’s not a history podcast per se. But it does dive into history at times.",
                            "score": 2,
                            "author": "InternationalBand494"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sounds great, I'll check it out!",
                    "score": 2,
                    "author": "Obvious-Bee-3960",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Be ready, the narrator uses very dry wit.",
                            "score": 3,
                            "author": "InternationalBand494"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Love Swindled. The extremely dry wit of the narrator is top notch and no ads!",
                    "score": 2,
                    "author": "Longjumping-Ad-9837",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He’s so unique. Love his style",
                            "score": 1,
                            "author": "InternationalBand494"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Asset",
            "score": 2,
            "author": "WetFart-Machine"
        },
        {
            "level": 0,
            "comment": "I enjoy TIMESUCK by Dan Cummins.",
            "score": 2,
            "author": "ImWezlsquez"
        },
        {
            "level": 0,
            "comment": "Pax Mongolica episode of Conflicted blew my mind, I knew almost nothing about Genghis Kahn and his grandson Kublai.\n\nAlso really liked the Crash of ‘29 series.",
            "score": 1,
            "author": "scorpioid_cyme",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you enjoyed that, Hardcore History has a series about the Mongols. It’s very very good",
                    "score": 4,
                    "author": "InternationalBand494",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I think maybe I’ve worked my way up to tackling Hardcore History, thanks for the endorsement.",
                            "score": 5,
                            "author": "scorpioid_cyme",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The Wrath of the Khans episodes are only an hour and a half each. He made these before he started making 6 hour long ones.\n\nAnd thank you, I’m gonna check out Conflicted now.",
                                    "score": 3,
                                    "author": "InternationalBand494",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I hope you like it. The crash of 29 episodes were like a movie for me. Loved them. Not all the other episodes are doing it for me but seems he’s getting exponentially better with time.",
                                            "score": 2,
                                            "author": "scorpioid_cyme",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I really like it! It’s just my style, one person giving facts. Thank you!",
                                                    "score": 2,
                                                    "author": "InternationalBand494"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Real Dictators. Some you’ll know all about and others maybe not. Either way you’ll learn more. Usually 2-4 episodes a dictator.",
            "score": 1,
            "author": "sisfala"
        }
    ]
}