{
    "id": "12p7dxt",
    "score": 9,
    "title": "Weekly General Discussion &amp; FAQ Thread - April 17, 2023",
    "author": "AutoModerator",
    "date": 1681718418.0,
    "url": "https://www.reddit.com/r/podcasts/comments/12p7dxt",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/podcasts/wiki/faqs1)",
        "https://www.reddit.com/r/podcasts/wiki/podcastsubreddits)."
    ],
    "postText": " Please use this thread to share podcasts you're currently listening to, to ask for recommendations, **give critiques and complaints in a civil manner**, and to chat about general podcast-related things. This is not a thread to promote your podcast **nor is it a place to rant about things about podcasts that annoy you - these comments will be removed.**\n\nAlso, please check out our wiki info pages including [listener FAQs](https://www.reddit.com/r/podcasts/wiki/faqs1) and our [list of other podcasting subs](https://www.reddit.com/r/podcasts/wiki/podcastsubreddits). You might find the answer to your question on one of those pages. If not, please feel free to submit all frequently asked questions (FAQs) here.\n\nIndividual FAQ posts will be removed and users will be directed to post their question here in this thread. Be as specific as possible - \"looking for a new podcast\" is a bit broad.\n\nIf you are helping / answering a question, be polite and not condescending. People are here to find out information.\n\nPlease report any posts or replies that don't follow these rules. Thank you all!",
    "comments": [
        {
            "level": 0,
            "comment": "any mystery podcasts recommended that do not involve murder? can’t handle that rn",
            "score": 3,
            "author": "lilac_congac",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably not a “mystery” in the way you mean, but Payne Lindsey’s High Strange podcast seems to be trying to take a sober, grounded and exhaustive look at reports of UFOs.",
                    "score": 1,
                    "author": "tlinclay71",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "listened to it. thanks for the rec. i respect payne. pretty good listen and the angles he got it. ufos will always be tough to tackle but i like this view.",
                            "score": 2,
                            "author": "lilac_congac",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Glad you enjoyed it 😄",
                                    "score": 1,
                                    "author": "tlinclay71"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Have you listened to Dead Eyes? Despite the name it isn't about murder.",
                    "score": 1,
                    "author": "trumpetcrumpets"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Listening to a pod called The Mantawauk Caves. It’s something else. If you liked Rabbits and the The Black Tapes, I recommend.",
            "score": 3,
            "author": "Necessary_Pea315"
        },
        {
            "level": 0,
            "comment": "Looking for non-crime podcast recommendations, ongoing or already ended is fine. I have been listening to too much true crime podcasts the last couple of days and I need to take a break. I'm having panic attacks while trying to sleep, thinking someone's gonna break in, so I really need to avoid these types of podcasts for the time being. I'm a nerd, so nerdy ones would be appreciated.",
            "score": 2,
            "author": "adelgirl",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gastropod is about the science, history, and culture of food. It ranges from food fraud to does your spoon affect how food tastes, to why do US mangos taste bad.\n\n\nOur Fake History debunks historical myths like was Queen Elizabeth a man, how was Troy rediscovered, and who invented rock and roll.",
                    "score": 1,
                    "author": "Griffen_07"
                },
                {
                    "level": 1,
                    "comment": "Snap Judgement is really incredible!",
                    "score": 1,
                    "author": "xanaxdyke"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For anyone who listened to Tiffany Dover is Dead, they released a new update!!",
            "score": 2,
            "author": "GoodbyeTobyseeya1"
        },
        {
            "level": 0,
            "comment": "helloo im looking for recommendations that are similar to hey now hey now by emily &amp; barney. laidback girly funny chats about anything pop culture",
            "score": 1,
            "author": "pricesandvices"
        },
        {
            "level": 0,
            "comment": "Can anyone recommend a podcast player that has folders to organise podcasts by entire podcast (rather than just episodes).\n\nSo if I wanna find something on history I have a folder of all the history pods subscribed to in one place.\n\nTried Spotify, stitcher, pocketcast, Google podcast player.\n\nNone seem to offer it.\n\nThanks!\n\nEdit. Podcast addict seems to have decent filter options.",
            "score": 1,
            "author": "dann_uk"
        },
        {
            "level": 0,
            "comment": "I have forgot the name of a podcast and it’s really bothering me!\nIt was a male narrator I’m pretty sure, and he told a sort of spooky story.\nI vaguely remember it was about a hiker who was deep enough in the woods he assumed he was alone but felt he was being followed after hearing noises nearby (hells gate? Devils tower?)",
            "score": 1,
            "author": "jordan350"
        },
        {
            "level": 0,
            "comment": "Really enjoyed this episode:\n\nhttps://podcasts.apple.com/us/podcast/bud-light-with-bobby/id1314757098?i=1000610080083\n\nIt’s Friday Night Movie podcast. Just three people who bring in people with an interesting perspective and have a conversation (mostly about movies and tv, but here about the whole bud light kerfluffed). \n\nIt may be that my comfort with the format is because I’m Gen X and these are elder milleniels having a thoughtful conversation.",
            "score": 1,
            "author": "luna_dude"
        }
    ]
}