{
    "id": "12tde2h",
    "score": 23,
    "title": "I'm having a hard time with the podcast Violation",
    "author": "RevolutionaryArt7189",
    "date": 1682020975.0,
    "url": "https://www.reddit.com/r/podcasts/comments/12tde2h",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm finding this podcast an incredibly difficult listen. It's a podcast about a man serving a life sentence for murdering a kid. He did so in cold blood, before going on the run, and belatedly turning himself in (not confessing for quite some time afterward). He has never shown any insight into his crime, nor offered the family of the victim any reason for it.\n\nThe host is completely sympathetic (and gullible) towards everything the murderer says, while being dismissive and disdainful of the family of the victim. The contempt in her voice whenever she's talking about the victim's family is palpable, while she speaks gushingly about the murderer.\n\nThe man is serving a life sentence - he is let out on parole and somehow thinks he's a free man (that's not what parole is), breaks the rules, and is all pikachu faced when he ends up back in the slammer. All the while the host speaks with disgust at the idea that victims should speak with parole officers, as if they have no business knowing what the criminal is doing, depsite the criminal continuing to serve a LIFE SENTENCE for murdering their child.",
    "comments": [
        {
            "level": 0,
            "comment": "Murdering a kid is a weird way to put it without mentioning he was a kid himself. \n\nThe host generally does take Jake at his word, but a lot of the stuff he says is impossible to realistically fact check.  My takeaway (and I think the main takeaway the podcast wanted to drive home) is just the sheer arbitrariness of the Justice system and how reform is absolutely needed to set stricter guidelines.",
            "score": 5,
            "author": "Stunning-Equipment32"
        },
        {
            "level": 0,
            "comment": "Thank you! I had to go back and re-listen to the first episodes to see if I had missed something. While I completely believe the critique of the justice and parole system in general, I can’t really say anything about the actual case the podcast is about because they *never* actually talk about the crime in any detail, and importantly, Jake’s explanation of what happened. He brutally *stabbed* a friend at summer camp and went on the run. \n\nIf they wanted to make a commentary on the parole system then PLEASE, I believe it is systemically racist and discriminatory and fundamentally broken. Should Jake be on parole? Who knows, it feels like the podcast doesn’t feel it needs to explain why it is supporting him so heavily. Meanwhile, they are insulting to the victim’s family and the family of Jake’s new wife. \n\nI had to stop and rewind with the last episode. Is she presenting Martha’s ex husband as being unreasonable? Martha literally married a convicted murderer and introduced the kids to him *without* telling her ex who has shared custody. This is a MAJOR deal what the actual fuck why are we pretending Martha and Jake are reasonable and the victims in all this?",
            "score": 3,
            "author": "OctoPied-Piper"
        },
        {
            "level": 0,
            "comment": "It’s my favorite podcast right now. The host is not gullible, and I’m grateful she’s exposing the problematic system of parole, mass supervision, and mass incarceration. The lengths the Kanes have gone though (private investigator, GPS tracking, etc) to ensure wideman stays in prison are troubling to say the least. He murdered a kid when he was also a kid. It is awful what he did. The host doesn’t gloss over that fact.",
            "score": 6,
            "author": "miaomy",
            "replies": [
                {
                    "level": 1,
                    "comment": "How is the Kane’s behavior troubling?!? Widens. MURDERED their son! I would do the same thing if I were them.",
                    "score": 4,
                    "author": "Huge-Vermicelli-9418",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don’t think you are asking in good faith. That, or you haven’t listened to the podcast, which lays out problems with juvenile sentencing, over surveillance, and—most important to your ‘question’ —the parole system. The host goes on to detail the specific problems with the Wideman case. She also acknowledges the incredible (indelible) pain and destruction Wideman inflicted on the Kanes when he murdered their son. She doesn’t question their anger and refusal to forgive.\n\nReturning to our question, it seems as though you aren’t asking in good faith, you haven’t listened closely to the podcast, or you have a stunted imagination.",
                            "score": 3,
                            "author": "miaomy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I actually think the host does gloss over that fact. You really have to hunt to find out what actually happened. Then, when you do, you realize it’s far WORSE than the host is implying. \n\nThe moment the host realized she would never get the Kanes to cooperate with the podcast and tell their side, she should’ve junked the story.",
                    "score": 0,
                    "author": "BrokenEspresso",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I completely disagree. One thing I feel is fundamentally different between myself and other commenters is I don't believe in the prison system. I believe multi-decade sentences and our juvenile justice system are particularly egregious. And I'm not naive: My father was a county-level judge for a major metropolitan area for 30 years, and decided dozens and dozens of cases involving homicide. and I have taught public school in a juvenile prison in Chicago (teaching teenagers who had brutally murdered others). \n\n The podcast isn't meant to get us to like Wideman. He did something horrific when he was 16, he has been in jail for \\~30 years, during which time he became a model prisoner. the podcast asks the important and difficult question of what we do as a society in a situation like this. life sentences for youth offenders are unconstitutional in 23 states and D.C. in nearly every other \"developed\" country, a life sentence at any age is exceedingly rare because it is considered barbaric and inhumane. do we really want to live under a government with a shrouded parole system in which people with power use minor legal technicalities to determine someone's fate? it's unfortunate the Kanes refused to talk—especially since they've actively/vocally campaigned to keep Wideman in prison for decades—but by your logic, very few important stories would ever be told.  The Marshall Project and NPR are known for their in-depth and measured reporting, and  my sense is the Kanes knew their methods would be closely examined (and they wouldn't always look good.)",
                            "score": 5,
                            "author": "miaomy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If the reporter’s goal was to show how unnecessarily complicated and tenuous the parole system is, she could have picked a better case. This was a high profile case of a murderer who seemed manipulative and didn’t really explain why he committed the heinous crime. There’s many black and brown people who are in jail for lesser offenses and don’t get the parole opportunities that man did.",
            "score": 2,
            "author": "needmorethancoffee"
        },
        {
            "level": 0,
            "comment": "The investigative podcast is a format I thoroughly enjoy, and one of the reasons I enjoy it is the facts are overlaid with interpretation by the host that I’m at liberty to disagree with (and I frequently do disagree with their assumptions and conclusions).\n\nThe host is very much biased towards wide man but never tries to obscure that fact and presents plenty of evidence and alternative facts that allow the viewers to reach their own conclusions.",
            "score": 2,
            "author": "Stunning-Equipment32"
        },
        {
            "level": 0,
            "comment": "Oohhh, looked it up. This is the Wideman case. That’s a part of The Coldest Case in Laramie and was a complete surprise to me. I think I’ll give this a listen for the biographical aspects (I am a fan of his father’s writing) while keeping your concerns in mind. Thank you for your takeaway.",
            "score": 1,
            "author": "scorpioid_cyme"
        },
        {
            "level": 0,
            "comment": "I listened to the podcast, I also have a same problem with it. She is biased.",
            "score": 1,
            "author": "Character_Future2274"
        },
        {
            "level": 0,
            "comment": "I completely agree. What a bizarre case to use to shine light on our broken parole system. Why not use a case in which the victim’s family pushes for the perpetrator’s parole and the parole board upholds his sentence? \n\nThis case feels so cut and dry, and frankly, they haven’t convinced me one bit that he wouldn’t offend again once the regimented environment of prison was stripped away.",
            "score": 0,
            "author": "BrokenEspresso"
        }
    ]
}