{
    "id": "12tl34l",
    "score": 66,
    "title": "Any recommendations on podcasts by therapists/ for mental health?",
    "author": "ModeEnvironmental481",
    "date": 1682038294.0,
    "url": "https://www.reddit.com/r/podcasts/comments/12tl34l",
    "media_urls": [],
    "other_urls": [],
    "postText": "Looking for podcasts for self help/mental health that you have found to be actually helpful.",
    "comments": [
        {
            "level": 0,
            "comment": "I really enjoy “The selfwork podcast” by Dr Margaret Rutherford. “The hardcore self help podcast with duff the psych” by Robert Duff is another great one.",
            "score": 10,
            "author": "Kiitkkats"
        },
        {
            "level": 0,
            "comment": "The mental illness happy hour is fantastic",
            "score": 8,
            "author": "Darth_Tjader_"
        },
        {
            "level": 0,
            "comment": "honestly the Blindboy podcast. it's not his focus, but he speaks about his own mental health + it in general in a constructive &amp; soothing way, imo",
            "score": 7,
            "author": "cinnamus_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Strong second here. Blind boy is developing and learning techniques in real time to cope with his own mental health issues and sharing them with his audience. Plus he is a good cunt with some great hot takes. Yert!",
                    "score": 7,
                    "author": "werewookie7"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dear Therapists is solid. It’s two therapists talking to a guest and then discussing the situation themselves (not an actual therapy session). The situations are all unique and may not directly apply to you but there are always some good takeaways",
            "score": 6,
            "author": "tupelobound",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, I listen to all of this one! It’s both interesting and i like learning from licensed therapists. I also like that it’s two different therapists, so you get more than one perspective (also male and female).",
                    "score": 1,
                    "author": "HighContrastShadows"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s not just in your head is great. Takes away from the sole the focus on the individual",
            "score": 5,
            "author": "Komplizin"
        },
        {
            "level": 0,
            "comment": "Where should we begin with Esther Perel. It's real couple therapy sesions and her advice for the problems the couples mention.",
            "score": 13,
            "author": "Tiramissu_dt",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m surprised this isn’t higher. She is the most gifted intuitive therapist I’ve ever seen. Even when she goes against her instincts, somehow it’s the right call. It’s like watching an artist at work. Huzzah Esther!",
                    "score": 6,
                    "author": "werewookie7"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really enjoy “This Changes Everything”. It’s mainly based around relationships but they discuss a variety of things and are very funny. Always feel good after listening.",
            "score": 3,
            "author": "Teneshy"
        },
        {
            "level": 0,
            "comment": "Being Well is my current favorite. Informative and helpful.",
            "score": 3,
            "author": "LuckySmellsMommy"
        },
        {
            "level": 0,
            "comment": "The Tara Brach podcast has some really good episodes on using meditation to help deal with some mental health issues.  I’m listening to the ones on dealing with anxiety and depression now and finding them helpful.",
            "score": 4,
            "author": "Elsbeth55",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also, the Binchtopia podcast sometimes references Tara Brach's work!",
                    "score": 1,
                    "author": "xanaxdyke"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I enjoy the Savvy Psychologist. They are short and useful",
            "score": 3,
            "author": "blueberrybasil02",
            "replies": [
                {
                    "level": 1,
                    "comment": "Me too, although I found myself forgetting what I learned because they’re so short and snackable haha",
                    "score": 1,
                    "author": "HighContrastShadows"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I like Bewildered by Martha Beck and The Cure for Chronic Pain by Nicole Sachs (some episodes are about physical, some about mental illness)",
            "score": 3,
            "author": "Nee_le",
            "replies": [
                {
                    "level": 1,
                    "comment": "This sounds perfect. Really struggling mentally thanks to chronic Illness",
                    "score": 2,
                    "author": "ModeEnvironmental481"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I mostly just listen to the ones that ruin my mental health",
            "score": 10,
            "author": "jprefect",
            "replies": [
                {
                    "level": 1,
                    "comment": "I also listen to the news",
                    "score": 10,
                    "author": "_momocita__",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, that one was TOO dark. I had to step away.  Now I just listen to murder and genocide stories from history.  Much more relaxing.",
                            "score": 7,
                            "author": "jprefect"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fuck yeah BtB",
                    "score": 3,
                    "author": "rocketeerH",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You know it",
                            "score": 3,
                            "author": "jprefect"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Psychology in Seattle is a podcast that has been going for *over 10 years* now, from Dr. Kirk Honda, a psychologist, family therapist. I first learned of it from the 90 Day Fiance scenes reaction videos he started doing during pandemic times. From there found out he also had that long running podcast that explores many more issues. He speaks a lot about attachment theory and how that can affect one's relationships and reactions later in life. Since he is also teacher for other therapists, he's very good at explaining psychological theories and concepts in a way that's easy for laypeople to digest (and sometimes using popular reality TV show conflict scenes as an example basis to do so).",
            "score": 6,
            "author": "Kresley",
            "replies": [
                {
                    "level": 1,
                    "comment": "Interesting! I’m not OP but thanks for explaining the background",
                    "score": 3,
                    "author": "HighContrastShadows"
                },
                {
                    "level": 1,
                    "comment": "Big favorite of mine too. I like the combination of Kirk's empathic stance and Umberto's silly humor.",
                    "score": 2,
                    "author": "WednesdayTiger"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“Hidden Brain” for some interesting neuroscience",
            "score": 5,
            "author": "TherapyBites",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good idea! (Um, username doesn’t check out?)",
                    "score": 2,
                    "author": "HighContrastShadows",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://podcasts.apple.com/us/podcast/hidden-brain/id1028908750",
                            "score": 2,
                            "author": "TherapyBites"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Would recommend Psychology in Seattle!! The host is a therapist and talks about a wide range of issues",
            "score": 4,
            "author": "GrapefruitNo801"
        },
        {
            "level": 0,
            "comment": "The psychology Podcast for sure!!!",
            "score": 2,
            "author": "thefabiopodcast"
        },
        {
            "level": 0,
            "comment": "Minding Your Mind is an excellent Aussie podcast worth a listen. One of the two hosts is a psychiatrist, professor and leading commentator on mental health in Australia.",
            "score": 2,
            "author": "Calire22",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!",
                    "score": 2,
                    "author": "HighContrastShadows"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Radio Headspace for quick reflections/meditative thoughts to start your day.",
            "score": 2,
            "author": "Equal-Golf-5020"
        },
        {
            "level": 0,
            "comment": "I listen to 'Dear Therapists with Lori Gottlieb and Guy Winch' and 'Radio Headspace'",
            "score": 2,
            "author": "Phoenixrising_86"
        },
        {
            "level": 0,
            "comment": "Disorderland \n\nThe Dream Season 2 \n\nUnf*ck your brain \n\nFuck Therapy \n\nSad to Savage \n\n10% happier \n\nThe Anxiety Doctor\n\nThe self esteem and confidence podcast\n\nOver coming anxiety \n\nThink positive \n\n(I’m a mental health professional)",
            "score": 2,
            "author": "Physical-Dingo-1143"
        },
        {
            "level": 0,
            "comment": "If anyone here is Dutch, “de Podcast Psycholoog” is really good. Doesnt help you much if you’re not dutch tho",
            "score": 3,
            "author": "zimflo"
        },
        {
            "level": 0,
            "comment": "Okay for me tinx is really good at putting things into perspective and it calms my anxiety about things so much. She has topics on everything!",
            "score": 1,
            "author": "natural_woman_"
        },
        {
            "level": 0,
            "comment": "I mostly listen to Purpose by Jay shetty. It's one of the finest podcasts I've heard with lot of different guets and insights on mental health and well being.  I would want u to definitely consider that one",
            "score": 1,
            "author": "Ishhhh_03",
            "replies": [
                {
                    "level": 1,
                    "comment": "Be careful with his stuff because there are allegations that he is a fraud.",
                    "score": 1,
                    "author": "Neilpoleon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What allegations are there on him? I didn't knew abt it .. but even if it is the podcast is helpful so doesn't matter",
                            "score": 1,
                            "author": "Ishhhh_03",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Here is a good quote from u/safaparksasquatch that sums up a lot of people's sentiments.\n\n*\"This guy really grinds my gears. He was never a monk in any way, consistently plagiarises other people's work with no credit and passes it off as his own \"wisdom\". He only started crediting people when he got called out. He's basically this generation's Deepak Chopra - shilling the whole modern Guru trope to white people. What monk who preaches not to be non-materialistic lives in a multi-million dollar mansion? Props to his grifter skills though.\"*",
                                    "score": 1,
                                    "author": "Neilpoleon"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I like to cherry pick his casts - he does help interpret some challenging concepts. After awhile, I started to feel a bit icky about his building a media empire based on being a “monk”, so it’s more one I pop in to.",
                    "score": 1,
                    "author": "HighContrastShadows"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I too would like to find some",
            "score": 1,
            "author": "Soundsf1ne",
            "replies": [
                {
                    "level": 1,
                    "comment": "Have you tried Dear Therapists? They are too busy to post new content all the time, but they do a great job. I love when they follow up with people after they give advice",
                    "score": 1,
                    "author": "HighContrastShadows"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Depresh Mode is pretty entertaining with some very funny guests, and also has good mental health advice.",
            "score": 1,
            "author": "Heron78",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great title!",
                    "score": 1,
                    "author": "Calire22"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wrestling With Depression and It's Not Just In Your Head",
            "score": 1,
            "author": "moon_librarian"
        },
        {
            "level": 0,
            "comment": "For pure cognitive behavioral therapy, i sometimes listen to Dr David Burns’ podcast, “Feeling Good.” He targets therapists but also answers questions from the public. He’s a former Stanford psychiatrist who learned about CBT from one of the greats in the field. Decades ago he started trying to show patients how to do it themselves. \n\nIt is very “authentic”, meaning they don’t do a lot of editing and it’s not slick. So it can feel a little slow at times. But I usually learn something and appreciate his doing it.\n\nSlight heads up that he might say meds are risky except in cases of serious mental illness. My take is that he thinks people would benefit greatly from using CBT before altering their brain chemistry. It doesn’t diminish my respect for his techniques",
            "score": 1,
            "author": "HighContrastShadows"
        },
        {
            "level": 0,
            "comment": "The Psychiatry and Psychotherapy Podcast with David Puder MD has great, reliable information. \n\nhttps://www.psychiatrypodcast.com/psychiatry-psychotherapy-podcast",
            "score": 1,
            "author": "HighContrastShadows",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks; checking it out now.",
                    "score": 1,
                    "author": "Calire22"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Following for my patients",
            "score": 1,
            "author": "kinkycountrygal"
        },
        {
            "level": 0,
            "comment": "Pod Therapy is my go-to. It's a good mix of humor, help, and education.",
            "score": 1,
            "author": "Astrophages"
        },
        {
            "level": 0,
            "comment": "Oversharing - it’s hosted by two sisters, one is a psychologist and the other is a podcaster. It’s very relatable and they provide helpful tips on dealing with anxiety, social pressures, etc. I personally love hearing the listener submitted social scenarios and their take on how to tackle them through a therapist’s perspective.",
            "score": 1,
            "author": "kitsym14"
        },
        {
            "level": 0,
            "comment": "Disordered.\n\nFor anxiety",
            "score": 1,
            "author": "TileMosaics"
        },
        {
            "level": 0,
            "comment": "Starship Therapise is great!",
            "score": 1,
            "author": "agirlnamedbreakfast"
        },
        {
            "level": 0,
            "comment": "Other People’s Problem!",
            "score": 1,
            "author": "ylw0"
        },
        {
            "level": 0,
            "comment": "Gosh you guys are amazing! Thank you so much!! This gives me hope.",
            "score": 1,
            "author": "ModeEnvironmental481"
        },
        {
            "level": 0,
            "comment": "If no one has already mentioned it - the Happiness Lab!",
            "score": 1,
            "author": "xanaxdyke"
        },
        {
            "level": 0,
            "comment": "Mark Groves\nMantalks\nAlexandra Solomon",
            "score": 0,
            "author": "fayedcircus"
        }
    ]
}