{
    "id": "12tobe8",
    "score": 10,
    "title": "Podcast for D&amp;D/board gaming teen",
    "author": "elpetrel",
    "date": 1682046065.0,
    "url": "https://www.reddit.com/r/podcasts/comments/12tobe8",
    "media_urls": [],
    "other_urls": [],
    "postText": "My young teenager is really into geeky, immersive world type board games, as well as D&amp;D. Anyone have suggestions for \"entry level\" podcasts that might appeal to someone like that? By entry level, I mean pretty instantly engaging and accessible for someone just starting to listen to podcasts. I want to give him some things he can listen to on his headphones or smart speaker that might spark his imagination more or go in depth on interesting topics. Like smarter you tube, ha! \n\nHe is more into fantasy and characters than violence or horror. Anything too dark or scary would not work.",
    "comments": [
        {
            "level": 0,
            "comment": "[Imaginary Worlds](https://podcasts.apple.com/us/podcast/imaginary-worlds/id916273527) is the first one that came to mind. He can look around the episodes for ones that interest him in particular, they're self contained",
            "score": 3,
            "author": "scamper_"
        },
        {
            "level": 0,
            "comment": "If he’s into story at all and a mature young teen, I suggest you check out The Adventure Zone. It’s the first podcast I ever listened to as a dedicated fan. Look for Reddit discussions about Balance, which is the name of the first season. My son had to bribe me into listening - and then we listened during every drive for all 69 episodes. Three brothers and their dad play D&amp;D. It starts off jokey and by the last episode you’re in awe of where the DM has taken the story (and maybe shedding some tears). \n\nMy kids were in their late teens, maybe other Redditers can chime in on a good age to start this. Not that I mind some crude humor or f-bombs, but in terms of the length and emotional tone of the story.",
            "score": 3,
            "author": "Wonderingfirefly",
            "replies": [
                {
                    "level": 1,
                    "comment": "This does sound like something he would really enjoy.",
                    "score": 2,
                    "author": "elpetrel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ve never played D&amp;D in my life (although I do like fantasy), and I liked it so much I actually listened to it all over again on my own. And when this season ended, they did continue doing other story arcs; I haven’t listened to them all yet, but the first one seems to be everyone’s favorite.",
                            "score": 1,
                            "author": "Wonderingfirefly"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just started listening to Late to the Party and I'm really loving it. It's basically a group of people sitting at a table roleplaying D&amp;D. The editing is really great so there's never a slow moment.",
            "score": 2,
            "author": "Plane_Chance863",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good editing can make such a difference in conversation based shows. Thanks!",
                    "score": 1,
                    "author": "elpetrel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just a note on language - they don't swear much, and the worst words are bleeped over, but language such as \"you bet your ass\" and \"what the hell\" do appear.",
                            "score": 0,
                            "author": "Plane_Chance863"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Party of One!! Every episode features the host playing a different 2 player tabletop game with a different guest. It covers basically every genre you can imagine and tells some incredible stories.",
            "score": 2,
            "author": "whathohamlet",
            "replies": [
                {
                    "level": 1,
                    "comment": "This sounds perfect!!!",
                    "score": 1,
                    "author": "elpetrel"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Critical Role?",
            "score": 2,
            "author": "DWCourtasan2"
        },
        {
            "level": 0,
            "comment": "Depending on your views on adult language, Glass Cannon podcast. They play Pathfinder rather than D&amp;D itself, but it's an excellent cast and very story focused.",
            "score": 0,
            "author": "Mobryan71"
        }
    ]
}