{
    "id": "12vbkvk",
    "score": 15,
    "title": "Kate Casey",
    "author": "deadliftsandsarcasm",
    "date": 1682181679.0,
    "url": "https://www.reddit.com/r/podcasts/comments/12vbkvk",
    "media_urls": [],
    "other_urls": [],
    "postText": "Anyone listening to her podcast series about her life? Seems a little sensationalized and “Forrest Gumpy” to me. Thoughts?",
    "comments": [
        {
            "level": 0,
            "comment": "I have a couple of her Reality Life episodes in my queue, including a Kate’s Life episode about the Hershey School. I have to work up to listening to them, because I can take her only in small doses.",
            "score": 3,
            "author": "Short_Equivalent_619",
            "replies": [
                {
                    "level": 1,
                    "comment": "I kind of feel the same about taking her in small doses and I wondered what your reasons are. For me, it’s something about the way she pronounces certain words. That’s one of the main things that irks me and I know it’s such a petty thing but I can’t help it. \n\nIn general I do like her, but I don’t subscribe to her podcast, she has a gazillion episodes so every now and then I’ll just look at what she’s recently put out and listen to certain things that are interesting to me.",
                    "score": 4,
                    "author": "odessapasta",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think for me, it’s the tone  of her voice. She’s not shrill by any means, but her voice isn’t soothing, either. It just hits me at the wrong spot.",
                            "score": 2,
                            "author": "Short_Equivalent_619"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I listened and have enjoyed them. I’ll admit that over the years I have found her to be a little odd in certain ways, but the episodes about her own life have been really interesting to me.",
            "score": 1,
            "author": "odessapasta"
        },
        {
            "level": 0,
            "comment": "I am and they are some of my favorite episodes. I find her life very interesting.",
            "score": 1,
            "author": "pool_family",
            "replies": [
                {
                    "level": 1,
                    "comment": "Don’t you think it seems a bit far fetched?",
                    "score": 2,
                    "author": "deadliftsandsarcasm",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don’t think so. I find her life interesting but nothing out of the ordinary. What parts do you think seem far fetched?",
                            "score": 1,
                            "author": "pool_family",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Have you listened to the episodes specific to her life? She puts herself in the middle of the Monica Lewinsky scandal, giving the FBI tips that she believes solved a crime, the IRA or whatever…..her “best friends” dying (but she is not aware they were even sick)….seems like she’s a master of making herself a retrospective center of things in a very Forrest Gump type of way.",
                                    "score": 2,
                                    "author": "deadliftsandsarcasm",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes I have. I see it differently. She says she was a intern during the ML scandal at the WH and that guy in the video liked her, I don’t see either of those things as big deals. And she saw the hijacker at the post store, which again I don’t see as a big thing. Just interesting tidbits from someone’s life. I think most of us interesting stories like these.",
                                            "score": 1,
                                            "author": "pool_family"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve been enjoying them but the self-aggrandizing is too much. She’s convinced her dad was secretly working for the Sinn Fein instead of just being a narcissist who didn’t want kids. I also hate her mentioning seeing Mohammed atta in Virginia Beach. Who cares.",
            "score": 1,
            "author": "FilmoreFelines",
            "replies": [
                {
                    "level": 1,
                    "comment": "ALL OF THIS!!!",
                    "score": 1,
                    "author": "deadliftsandsarcasm"
                }
            ]
        }
    ]
}