{
    "id": "131qitk",
    "score": 64,
    "title": "Looking for a podcast that dives into unique/strange/interesting animal biology",
    "author": "Alwaysssss",
    "date": 1682685460.0,
    "url": "https://www.reddit.com/r/podcasts/comments/131qitk",
    "media_urls": [],
    "other_urls": [],
    "postText": "Title. I'm interested in a podcast that explores interesting biology/physiology of different animals. Doesn't have to be completely academic, but I would like it to skew more informational than entertaining. But a little humor never hurts.\n\n If anyone has recs that relate I would love to hear them. Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "Creature Feature is great. The host is an evolutionary biologist",
            "score": 16,
            "author": "MarsScully"
        },
        {
            "level": 0,
            "comment": "Very timely I just discovered Just The Zoo Of Us and currently listening to one of their episode about rats haha",
            "score": 7,
            "author": "hazyrosy"
        },
        {
            "level": 0,
            "comment": "Not a podcast, but in case you haven't heard of him, I think you'll really enjoy Ze Frank's YouTube videos! A perfect combination of humour and information.",
            "score": 5,
            "author": "lissa524"
        },
        {
            "level": 0,
            "comment": "Oligies. The host interviews specialists in a wide array of fields, including animals.",
            "score": 19,
            "author": "Known_Sheepherder650",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ologies*\n\nThis is the podcast. There are 350+ episodes, many on specific animals. Dive into the feed and listen to whatever interests you",
                    "score": 5,
                    "author": "dumbmother"
                },
                {
                    "level": 1,
                    "comment": "came here to say ologies. Can't recommend it highly enough!",
                    "score": 2,
                    "author": "Violinist-Rich"
                },
                {
                    "level": 1,
                    "comment": "Came here to say this.  So many great and interesting episodes.",
                    "score": 3,
                    "author": "Playf1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "30 animals that made us smarter from the BBC, about bionics technologies\nCreature Feature from iheart",
            "score": 4,
            "author": "arctosmilan"
        },
        {
            "level": 0,
            "comment": "Tooth and Claw might be a good one to dive in to. It has more do to with wild animal encounters and how to handle them bit there is a lot of information throughout the stories. They're also really funny and clever so that never hurts!",
            "score": 3,
            "author": "Sudden-Chipmunk260",
            "replies": [
                {
                    "level": 1,
                    "comment": "I second tooth and claw!",
                    "score": 1,
                    "author": "allioli76"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not a podcast, but there’s an excellent audiobook (or regular book) called Other Minds that’s about the fascinating neurology of octopuses and cuttlefish. Highly recommend!",
            "score": 3,
            "author": "youeggface"
        },
        {
            "level": 0,
            "comment": "Common Descent podcast.  More about dinosaurs than \"modern\" biology, but not exclusively.  It's pretty academic with a smidge of humor.",
            "score": 3,
            "author": "burner01032023"
        },
        {
            "level": 0,
            "comment": "Biology of Superheroes looks at natural inspirations for superpowers. I  remember an episode talking about mantis shrimp.",
            "score": 2,
            "author": "104boiledhotdogs"
        },
        {
            "level": 0,
            "comment": "BBC Crowd Science. Listeners phone in and email science questions. A good number of people ask questions about their pets or animals found in their city like raccoons or coyotes.",
            "score": 2,
            "author": "NCResident5"
        },
        {
            "level": 0,
            "comment": "In Defense of Plants is a cool podcast.  It's not exactly what you asked for, but in the same neighborhood.\n\nI thought of it because a lot of the episodes are about pollinators.  (Bees, wasps, etc).  \n\nBesides animal biology there's the obvious botany stuff, with a helping of paleo-botany and paleo-biology",
            "score": 2,
            "author": "melcheae",
            "replies": [
                {
                    "level": 1,
                    "comment": "Paleo-botany AND paleo-botany?!?  :O",
                    "score": 1,
                    "author": "IHatrMakingUsernames"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Wild Episode. The host has a really gentle voice, not the kind of podcast where you need to skip a bunch of annoying intro music or updates, or unnecessary banter, etc. I find it really calming lol. It’s my palate cleanser podcast at the moment. The host picks unusual animals and discusses the kinds of things you mentioned. He also has a subtle and sometimes sarcastic? sense of humour, which I really like. It instantly became a favourite of mine. I tried to listen to creature feature because it always gets recommended for this kind of podcast request, but it did nothing for me. I forget what they were talking about, but I remember something they said wasn’t accurate and I thought that if I, someone who is not an expert, could pick that out, it did not bode well. Someone said the host is an evolutionary specialist or something, so maybe the detail just wasn’t evolution oriented. Tooth and claw is good, lots of banter and stuff but actually pretty funny, not usually unique animals, but so far the 10 or so episodes I’ve listened to have still been really interesting.",
            "score": 1,
            "author": "delicioushandcream"
        },
        {
            "level": 0,
            "comment": " It isn’t a podcast, but if you haven’t seen this guys TikTok’s, they’re worth a look:\n\nhttps://www.forbes.com/sites/ariannajohnson/2022/07/20/viral-tiktok-star-and-self-proclaimed-internet-zoologist-mamadou-ndiaye-just-released-a-book-about-terrifying-animals/",
            "score": 1,
            "author": "luna_dude"
        },
        {
            "level": 0,
            "comment": "It’s an NPR one off, but well worth a listen and you might decide you want to read the book mentioned. It’s a feminist scientist’s look at female animals. https://www.npr.org/2022/06/26/1107702875/best-of-forget-everything-you-thought-you-knew-about-female-animals",
            "score": 1,
            "author": "Wonderingfirefly"
        },
        {
            "level": 0,
            "comment": "'Species' is very good. One episode per species but he always uses the animal to demonstrate another point. Try the Malleefowl episode",
            "score": 1,
            "author": "Normal_Librarian6572"
        },
        {
            "level": 0,
            "comment": "Robert Sapolsky 25 lectures on YouTube",
            "score": 0,
            "author": "Environmental_Ad_387"
        }
    ]
}