{
    "id": "131qhb7",
    "score": 7,
    "title": "How do i totally remove a podcast feed from Downcast?",
    "author": "jordn613",
    "date": 1682685359.0,
    "url": "https://www.reddit.com/r/podcasts/comments/131qhb7",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m using Downcast on iOS and for the life of me cannot get rid of a few podcasts. I’ll delete the podcast and then inevitably when I refresh my feeds they’ll pop back up again. How do I permanently remove a podcast’s feed from this app??",
    "comments": [
        {
            "level": 0,
            "comment": "Downcast is the best podcatcher in my opinion but it really *sucks* at iCloud sync. Make sure to switch the sync off if you don’t need it (More &gt; iCloud Sync &gt; all off). It might help that issue.",
            "score": 3,
            "author": "TheGayGuy_GER",
            "replies": [
                {
                    "level": 1,
                    "comment": "Doesn’t seem to have :( How is it possible that it’s still retaining these podcasts after I’ve seemingly scrubbed them from the app? Is there something else I could be missing?",
                    "score": 1,
                    "author": "jordn613",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That is really weird. Ok, first: restart your phone. \n\nThen you could try this: Go to the podcast list, open the one you want to delete, click the settings wheel down right and deactivate the „auto-refresh feed“ option. The podcast should stay in your list, but no longer download new episodes. If you use playlists, you could move it into a separate one and forget about it. \n\nAnother idea is to delete it in a different way. I know two ways, you can try both: \n-\tIn the podcast list, swipe the podcast title to the left and click delete\n-\tIn the podcast list, click „edit“ and then click the ⛔️ symbol next to said podcast\n\nMy last idea is to export all your subscriptions via the settings, then delete the app, reinstall it and reimport the subscriptions. Maybe deleting the podcast works after that. But before you do that, better contact their support via the contact form at https://support.downcast.fm, they should be able to help.",
                            "score": 1,
                            "author": "TheGayGuy_GER"
                        }
                    ]
                }
            ]
        }
    ]
}