{
    "id": "134w37b",
    "score": 30,
    "title": "Recommendation request: podcast on critical thinking and logical reasoning.",
    "author": "zafar_bull",
    "date": 1682963624.0,
    "url": "https://www.reddit.com/r/podcasts/comments/134w37b",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, I just went through a podcast that discussed some of the popular bestselling books that I could have also easily thought to be really bad works and factually incorrect too however I didn't. I just agreed to whatever was being sad in the podcast, something I also should have noticed by my own readings. \n\nI am hoping to learn about critical thinking and be a able to identify bad argument quickly. \n\nTha ks",
    "comments": [
        {
            "level": 0,
            "comment": "The Skeptic’s Guide to the Universe has been running for a billion years and is essentially a podcast about critical thinking, spotting logical fallacies, etc. I haven’t listened to it in a long time but it played a huge role in how I take in information.",
            "score": 11,
            "author": "cussbunny"
        },
        {
            "level": 0,
            "comment": "You Are Not So Smart might fit this bill.",
            "score": 8,
            "author": "scorpioid_cyme",
            "replies": [
                {
                    "level": 1,
                    "comment": "Came here to say this ✅",
                    "score": 1,
                    "author": "SelfSufficientHub"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are you referring to \"If Books Could Kill\"?  If so, Michael Hobbes has an earlier podcast he was on called \"You're Wrong About\".  Start at the beginning because he left that pod over a year ago and I find it less compelling without him. \"Behind the Bastards\" is another great one. If you are interested in debunking weight loss/dietary myths, Michael Hobbs, yet again has a podcast (IMHO, his best work) called \"Maintenance Phase\".",
            "score": 5,
            "author": "magicmom17",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, that's the one. \n\nThanks for the recommendations. I will check them out.",
                    "score": 2,
                    "author": "zafar_bull"
                }
            ]
        },
        {
            "level": 0,
            "comment": "for a slightly different angle, might I recommend Oh No Ross &amp; Carrie? they do really thorough, well researched investigations of fringe topics and pseudosciences, and are humorous yet compassionate. there was recently an episode where Carrie gave a talk on how fact check + spot bad “experts”.",
            "score": 5,
            "author": "keraobject"
        },
        {
            "level": 0,
            "comment": "Cautionary Tales by Tim Harford is great!",
            "score": 4,
            "author": "ColorOfTheFire",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes! This one is like a series of case studies in logic fallacies and common ways of mistaken thinking.",
                    "score": 3,
                    "author": "collectiveanimus"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Michael Shermer",
            "score": 5,
            "author": "Amazing_Ad1404"
        },
        {
            "level": 0,
            "comment": "The daily stoic might be up your alley as well as what others have recommended",
            "score": 3,
            "author": "FullGrownHip"
        },
        {
            "level": 0,
            "comment": "There is a podcast on Spotify called Thinking Clearly. I enjoy it very much, and I definitely recommend it.\n\nEncyclopedia Britannica also has a list of podcasts that are categorized by subjects.",
            "score": 2,
            "author": "undercoverhellcat"
        }
    ]
}