{
    "id": "1352vj3",
    "score": 153,
    "title": "Looking for podcasts that do deep dives into various topics!",
    "author": "tap_water_hex",
    "date": 1682978915.0,
    "url": "https://www.reddit.com/r/podcasts/comments/1352vj3",
    "media_urls": [],
    "other_urls": [],
    "postText": "I need something new to listen to on the bus. I’m looking specifically for a podcast that doesn’t have a single topic but every episode is something different. What those episodes are can be pretty much anything but I’m looking specifically for true stories and real history, etc. I just want to know a bunch about some different topics! \nI love collecting random bits of information that’s really in depth but useless so that’s the kind of thing I’m looking for. It can be history, true crime, science. Anything really!",
    "comments": [
        {
            "level": 0,
            "comment": "*In Our Time*, on BBC with Melvin Bragg as the host. Hundreds of episodes ranging over history, philosophy, science, math, you name it. The format is Bragg interviewing a panel of three Oxbridge (or other British) scholars, starting from a general introduction to the topic and then diving into some of the interesting details. Really great stuff, if you have a bit of an academic bent.",
            "score": 50,
            "author": "lazzarone",
            "replies": [
                {
                    "level": 1,
                    "comment": "Definitely, it's basically the premise of the show and the breadth of the topics is fantastic. Also, has been going for decades now, so a huge library to browse through as some will be more interesting to OP than others (probably, it's definitely the case for me anyway).",
                    "score": 9,
                    "author": "robin-redpoll"
                },
                {
                    "level": 1,
                    "comment": "Anything else like this? I don’t want the fucking banter, I want the rigor!",
                    "score": 1,
                    "author": "biolox"
                },
                {
                    "level": 1,
                    "comment": "I love that one",
                    "score": 0,
                    "author": "werewookie7"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fall of Civilizations.",
            "score": 23,
            "author": "Mobryan71"
        },
        {
            "level": 0,
            "comment": "Not really stories but Ologies is great if you wanna amass a lot of information about random stuff.",
            "score": 50,
            "author": "hamletstragedy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ologies is fascinating! The host’s commentary in post also makes me laugh out loud regularly. I love her approach to new topics. Not afraid to ask the “silly” questions that any layman might have, while still being respectful. It’s refreshing.",
                    "score": 7,
                    "author": "dundundununun"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The podcast Criminal does a great job of covering a lot of random topics that are related to crime. There is a topic on medical autopsies, another covers insurance fraud, and others talk about historical crimes like the riot against strikebreakers.",
            "score": 16,
            "author": "Neilpoleon"
        },
        {
            "level": 0,
            "comment": "time suck",
            "score": 15,
            "author": "Bougainville70",
            "replies": [
                {
                    "level": 1,
                    "comment": "What's great about Timesuck is that it doesn't limit itself to just one topic. Dan covers maybe more true crime than other subjects, but he also covers history, cults, etc.",
                    "score": 5,
                    "author": "ArsenicWallpaper99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The cult episodes are my favorites!! Cult! Cult! Cult!",
                            "score": 3,
                            "author": "reddit_user_70942239"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I dunno. I would rate it 3 out of 5 stars. Wouldn’t change a thing",
                    "score": 2,
                    "author": "Difficult_Essay_9134"
                },
                {
                    "level": 1,
                    "comment": "His coverage of the night witches is my favorite ep by far",
                    "score": 1,
                    "author": "TheGroomedGrizzly"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stuff you should know",
            "score": 61,
            "author": "Peanutbutter36",
            "replies": [
                {
                    "level": 1,
                    "comment": "Complete guide to everything if you want more humor.",
                    "score": 4,
                    "author": "AnistarYT"
                },
                {
                    "level": 1,
                    "comment": "Yes!! I came to say Stuff You Should Know!!! \n\nAlso there is Horrifying History which covers everything from Nostradamus to The Dark Truth about Disney to Some true crime. It's a great mix\n\nI also like The Conspirators which has an eclectic mix of everything from psychic spy's to old haunted castles to kids who build nuclear power things to some true crime \n\nHuman F*ckery where a psychology PhD and a journalist pick a subject out of a hat and compete to tell the most FD up true crime story. Each week is a different topic. It's pretty interesting.\n\nDeathbed Confessions but it's only on Spotify\n\nMr.Ballen if you're a fan of the strange dark and mysterious delivered in story form. He's the best!!!! His podcast is only available on Amazon Music but it's free to download and he also has a TON of content on YouTube",
                    "score": 2,
                    "author": "Due_Donkey2725"
                },
                {
                    "level": 1,
                    "comment": "The best",
                    "score": 3,
                    "author": "CarlCherry007"
                },
                {
                    "level": 1,
                    "comment": "Hm, not really deep dives, I believe OP was asking for that. What I listened to (and stopped because of that) were episodes of 5-6 minutes each.",
                    "score": -5,
                    "author": "nikola_1975",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then you must be listening to only the Shorties or the very first episodes they did because about 85% of the episodes are easily an hour.",
                            "score": 8,
                            "author": "cheesecakefairies",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, I starter with first episodes. I understand this gets better, time to get back to it in that case. Thanks.",
                                    "score": 3,
                                    "author": "nikola_1975"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Stuff They Don’t Want You to Know is more paranormal and conspiracy focused but I learned a lot from it, too.",
                    "score": 1,
                    "author": "sinnerforhire"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Dollop",
            "score": 12,
            "author": "sativarita",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love the Dollop!",
                    "score": 1,
                    "author": "Substantial_Win_5134"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Let me introduce you to Mr. Dan Carlin, and his podcast Hardcore History. He’s the GOAT, no kidding.",
            "score": 10,
            "author": "kilaueasteve",
            "replies": [
                {
                    "level": 1,
                    "comment": "A thousand times yes.",
                    "score": 3,
                    "author": "Louisey_kat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Decoder Ring and American Hysteria are my faves for this.",
            "score": 10,
            "author": "Simpvanus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Love Decoder Ring.",
                    "score": 5,
                    "author": "terrorvicky"
                }
            ]
        },
        {
            "level": 0,
            "comment": "99% Invisible",
            "score": 9,
            "author": "lightscamerasnaction",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mostly design related so maybe a little narrower in subject matter than what the OP was looking for, but varied enough and accessible enough that even if you're not a design nerd you'll love it. One of my favourites. Definitely recommend.",
                    "score": 4,
                    "author": "craigerstar"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you don't mind crude humor and the hosts going off on tangents then you should try The Last Podcast on the Left. \n\nThey do fantastic research and make me laugh so hard I almost crash my car. They cover true crime, cults,  paranormal topics and lately have done some great history topics. They say this summer they are doing a huge historic series but haven't said on what. Rumor has it, it may be a series on the Vietnam War.",
            "score": 8,
            "author": "PhearThePhish"
        },
        {
            "level": 0,
            "comment": "If you like Ken Jennings and Jon Roderick, they have a podcast called Omnibus, in which they catalog obscure and interesting aspects of humanity for our future earth inhabitants to gain some insight into what made us tick.",
            "score": 8,
            "author": "werewookie7",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hilarious and informative!",
                    "score": 2,
                    "author": "lightthenations"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do Go On is a great Australian podcast. Three hosts and every week one of them picks a topic and presents it like a gradeschool report. The other two often interject and rift a lot. Really funny but they do really great research on their topics. And cover everything from bank and art heists, war heroes, celebrity feuds, and odd stories from history. \n\nOne of my favorites was about the true story that inspired the book Moby Dick. Real wild stuff",
            "score": 8,
            "author": "Jordieboisterous"
        },
        {
            "level": 0,
            "comment": "You're Wrong About by Sarah Marshall (her voce can be irritating but interesting guests)",
            "score": 20,
            "author": "Lazy-Hooker",
            "replies": [
                {
                    "level": 1,
                    "comment": "I personally really like her voice! Fun podcast.",
                    "score": 12,
                    "author": "Many-Strain6076"
                },
                {
                    "level": 1,
                    "comment": "I love this one.",
                    "score": 7,
                    "author": "Odd_Requirement_4933"
                },
                {
                    "level": 1,
                    "comment": "Michael Hobbes is an me of my favorite podcasters but I can’t stand Sarah Marshall, she ruins it for me!",
                    "score": 0,
                    "author": "manymanyminis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Her laugh is obnoxious",
                            "score": 1,
                            "author": "Lazy-Hooker"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Every Little Thing - people dial in with a question about an ungoogleable thing, and the host brings on experts to explain. Lighthearted and short. Not super investigative but worth a listen! Try the one about flamingoes first.",
            "score": 5,
            "author": "birdgebirdbrains"
        },
        {
            "level": 0,
            "comment": "Just The Gist fits this perfectly. They give you just the gist of an interesting story/subject, and I always find their choices interesting! I usually fast forward the chat part to get to the story though as one of the hosts can be a bit annoying",
            "score": 7,
            "author": "Speecyspicypotato",
            "replies": [
                {
                    "level": 1,
                    "comment": "They’ve actually separated the chat from the subject bit, so now it’s a story episode and a Breaking Nooz episode a week. But I agree, I love the podcast. Start with Stuart Simple vs Anish Kapoor, it’s an awesome dive into a petty feud in the art world",
                    "score": 4,
                    "author": "Cloquelatte"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Avery Truffleman’s podcasts:\n\nArticles of Interest \n\nNice Try",
            "score": 5,
            "author": "ESPiNstigator"
        },
        {
            "level": 0,
            "comment": "This Podcast Will Kill You - deep dives into specific diseases and illnesses.  They're very engaging, and get right into the details of the biology, history, and current status of it.  Highly recommend.",
            "score": 4,
            "author": "jil3000"
        },
        {
            "level": 0,
            "comment": "Behind the Bastards",
            "score": 24,
            "author": "AleWatcher",
            "replies": [
                {
                    "level": 1,
                    "comment": "Came here to say this",
                    "score": 1,
                    "author": "puffin2012"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Throughline or The Gray Area... both are exceptional.",
            "score": 4,
            "author": "SnowshoeTaboo"
        },
        {
            "level": 0,
            "comment": "Dr Karl.. unexplainable.. naked scientist",
            "score": 3,
            "author": "Amazing_Ad1404"
        },
        {
            "level": 0,
            "comment": "No such thing as a fish has lots of random topics, not so much a deep dive but lots of random tidbits. \n\nI also really liked the futility closet, I excitedly waited for every single episode, but my husband would always  say it's dry.",
            "score": 3,
            "author": "lady-finngers"
        },
        {
            "level": 0,
            "comment": "Freakonomica radio is very interesting.\n\nETA: they discuss a variety of topics, consult with professors from different universities. \n\nAlso from the same authors/producers, a game show called “tell me something I don’t know” \n\nThey’re very easy to listen to, especially on long rides/drives.",
            "score": 5,
            "author": "FullGrownHip"
        },
        {
            "level": 0,
            "comment": "The Constant, a History of Getting Things Wrong",
            "score": 3,
            "author": "obnock",
            "replies": [
                {
                    "level": 1,
                    "comment": "Mark Chrisler does an amazing job of research of topics and covers many angles that a story may have. Better yet, he is a playwright and presents the story in a great manner. His sense of humor is right up my alley, but may annoy others.\n\nThe most recent episode was on the eruption of Mt. Pelee in Martinique. The episode was much more than I ever expected from the story.",
                    "score": 1,
                    "author": "amh_library"
                }
            ]
        },
        {
            "level": 0,
            "comment": "History of Rock Music in 500 Songs. - Best podcast in world currently.",
            "score": 4,
            "author": "RobLA12",
            "replies": [
                {
                    "level": 1,
                    "comment": "It really is terrific.",
                    "score": 3,
                    "author": "kilaueasteve"
                },
                {
                    "level": 1,
                    "comment": "This is my absolute favourite one.",
                    "score": 2,
                    "author": "Hellofromunderthebed"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Timesuck. Psychology in Seattle.",
            "score": 4,
            "author": "Kissmethruthephone",
            "replies": [
                {
                    "level": 1,
                    "comment": "Timesuck is perfect for what he’s looking for",
                    "score": 1,
                    "author": "Kongpong1992"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Blindboy podcast. A mixture of topics, well made and he’s funny.",
            "score": 3,
            "author": "NowTheCherryBlossoms"
        },
        {
            "level": 0,
            "comment": "Stuff you should know and Hidden Brain",
            "score": 8,
            "author": "Big_Will_2374"
        },
        {
            "level": 0,
            "comment": "Reply All",
            "score": 8,
            "author": "babybutters",
            "replies": [
                {
                    "level": 1,
                    "comment": "RIP",
                    "score": 8,
                    "author": "terrorvicky"
                },
                {
                    "level": 1,
                    "comment": "Came here to mention this one",
                    "score": 2,
                    "author": "ru_bato"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Underunderstood",
            "score": 3,
            "author": "s_white"
        },
        {
            "level": 0,
            "comment": "Ologies and Behind the Bastards are the first two that come to mind. Ologies talks to experts about various science topics and they get super niche and in-depth. Behind the Bastards talks about all the terrible people throughout history, with some spin-offs on policing in America and the rise of fascism. To get an idea of how in-depth they can get, they did a 7 part series on Kissinger.",
            "score": 3,
            "author": "bearface93"
        },
        {
            "level": 0,
            "comment": "You're Dead To Me is a podcast by the BBC. Every episode they pick a topic/person from history and bring together an expert (most often academic) and a comedian to discuss it. It's really nice and you learn so much!",
            "score": 3,
            "author": "Anoukx"
        },
        {
            "level": 0,
            "comment": "99% invisible",
            "score": 3,
            "author": "echizen01"
        },
        {
            "level": 0,
            "comment": "Maintenance Phase",
            "score": 7,
            "author": "annamulzz",
            "replies": [
                {
                    "level": 1,
                    "comment": "And, also, Michael’s other podcast, If Books Could Kill, which is about the fallacies in self-help books on all different sorts of topics. It’s good!",
                    "score": 5,
                    "author": "LadyChatterteeth",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes!! It’s so good!!",
                            "score": 2,
                            "author": "annamulzz"
                        },
                        {
                            "level": 2,
                            "comment": "I love anything Michael Hobbes is on!",
                            "score": 0,
                            "author": "manymanyminis"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Blindboy podcast https://play.acast.com/s/blindboy",
            "score": 4,
            "author": "overduesum"
        },
        {
            "level": 0,
            "comment": "Try the Brady Heywood podcast. Looks at engineering  failures",
            "score": 2,
            "author": "frmie"
        },
        {
            "level": 0,
            "comment": "unobscured and grim &amp; mild go deep.  city of the rails and svetlana svetlana were my faves so far this year.  both single-subject, single season shows.",
            "score": 2,
            "author": "housemeat"
        },
        {
            "level": 0,
            "comment": "Lex Fridman Podcast\n\nGreat interviewer with access to high level players in a full spectrum of topics",
            "score": 2,
            "author": "CouchedCaveats",
            "replies": [
                {
                    "level": 1,
                    "comment": "Has lex ever had a female guest?",
                    "score": 2,
                    "author": "akat_walks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes.",
                            "score": 1,
                            "author": "CouchedCaveats",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I found a [stats page](https://lfplibrary.netlify.app/stats/)! About 11% of guests were women. And JRE has about 6%.",
                                    "score": 2,
                                    "author": "akat_walks",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What are you doing here? I don't think you're the OP and I've no interest in engaging with you in their post.\n\nAre you here to troll? This seems an odd channel for whatever sort of activism this is. \n\nPlease stop engaging on this thread",
                                            "score": -2,
                                            "author": "CouchedCaveats"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This American life",
            "score": 2,
            "author": "DearEmu32"
        },
        {
            "level": 0,
            "comment": "**I Don't Know About That with Jim Jefferies**\n\nJim's a comedian from Australia. He talks about something different every episode and brings on an expert to help out. Subjects include hockey, scientology, star wars, pizza, dinosaurs, American Revolution, wine, survivalism, solar power, BDSM, dark web, pirates, cocaine trafficking, and more. He's all over the place and funny but you might learn something too. There's a couple hundred episodes and counting. I'm a fan. You might be too.",
            "score": 2,
            "author": "craigerstar"
        },
        {
            "level": 0,
            "comment": "“Well there’s your problem” has a new topic each episode. They do deep dives into engineering disasters and systemic failures that have happened (buildings collapsing, bridges falling, trains derailing, boats sinking, etc..) Episodes are a bit long, but overall I find it SO fascinating. \n\nThe Mont-Blanc tunnel one was one of my favorites. I always learn stuff along the way about infrastructure &amp; how things work.",
            "score": 2,
            "author": "tsktsk579",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yay Liam!",
                    "score": 2,
                    "author": "zachrtw"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[Ologies](https://www.alieward.com/ologies) is brilliant. I truly cannot imagine anyone not liking it.",
            "score": 2,
            "author": "Rainbowape"
        },
        {
            "level": 0,
            "comment": "Simon Whistler has some great podcasts: The Casual Criminalist, Decoding the Unknown, and Into the Shadows. His writers do some excellent research and try to present the true crime stories as compassionately as possible, which I appreciate. Just be prepared for Simon's tangents in those first two!",
            "score": 2,
            "author": "dontpokethecrazy"
        },
        {
            "level": 0,
            "comment": "Last Podcast on the left. True crime. Cults. And my favorite Aliens/cryptids. The extended network is great with politics and fraudsters. No dogs in space is a music deep dive. \n\nLotsa good shit and they are hilarious.",
            "score": 2,
            "author": "jilliandoodles"
        },
        {
            "level": 0,
            "comment": "Mysterious Universe \n\nIt has been my favorite podcast for years now",
            "score": 2,
            "author": "ChipmunkBackground46"
        },
        {
            "level": 0,
            "comment": "Behind the bastards, timesuck, last podcast on the left. All great shows and very entertaining",
            "score": 3,
            "author": "runnerboiii"
        },
        {
            "level": 0,
            "comment": "Ologies!",
            "score": 4,
            "author": "Rae_UK"
        },
        {
            "level": 0,
            "comment": "Radiolab",
            "score": 3,
            "author": "TabuTM"
        },
        {
            "level": 0,
            "comment": "Radiolab",
            "score": 3,
            "author": "Mountain_Aardvark350"
        },
        {
            "level": 0,
            "comment": "You're wrong about.\n\nPerfect match to your requirements and an excellent show with a good back catalogue.",
            "score": 3,
            "author": "Capon-breath"
        },
        {
            "level": 0,
            "comment": "If Books Could Kill\n\nThey break down non fiction books with bad ideas, and in the process you end up learning quite a bit about those topics and how the books influenced society for the worse",
            "score": 2,
            "author": "miniboes"
        },
        {
            "level": 0,
            "comment": "The Blindboy Podcast - hot takes on mythology, history, psychology, art and culture. And all delivered in the most wonderful Irish accent.",
            "score": 2,
            "author": "abacusabyss"
        },
        {
            "level": 0,
            "comment": "Something you should know. \n\nInteresting but not incredibly in-depth, two topics per episode, love this one for light but interesting distraction \n\nStuff to blow your mind.\n\nVery in depth, more scientific, it often gives me things to look op or study. Wide range of topics and lots of episodes to listen to",
            "score": 0,
            "author": "Just-watch-me-now"
        },
        {
            "level": 0,
            "comment": "You want 'There is no such thing as fish', thank me later.",
            "score": 0,
            "author": "zerosdfd"
        },
        {
            "level": 0,
            "comment": "Scene on Radio",
            "score": 1,
            "author": "Patchewski"
        },
        {
            "level": 0,
            "comment": "The rabbit hole detectives is my current favourite.",
            "score": 1,
            "author": "allgone79"
        },
        {
            "level": 0,
            "comment": "Friends on Fire",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "The Dog Walk",
            "score": 1,
            "author": "poop_break_666"
        },
        {
            "level": 0,
            "comment": "Around the World in 80 Days",
            "score": 1,
            "author": "Rycecube"
        },
        {
            "level": 0,
            "comment": "“Everything Everywhere” is excellent.  It fits exactly what you were describing.  It’s only about 14 minutes on average, so if you are looking for an in depth discussion it will not be what you are looking for.  But if you want to learn about, we’ll, everything everywhere than you will probably love this gem of a podcast.",
            "score": 1,
            "author": "J3sus_Saves"
        },
        {
            "level": 0,
            "comment": "Im sure that it’s been said but: Stuff you should know and Timesuck, and science with dr Karl",
            "score": 1,
            "author": "Difficult_Essay_9134"
        },
        {
            "level": 0,
            "comment": "Sci Guys",
            "score": 1,
            "author": "Plane_Contract6144"
        },
        {
            "level": 0,
            "comment": "Outlaw Oceans is an excellent but intense podcast with much detail and information",
            "score": 1,
            "author": "alisonk13"
        },
        {
            "level": 0,
            "comment": "Have you listened to Slo Mo?\n\nMo Gawdat was the Chief Business Officer of Google [X]",
            "score": 1,
            "author": "DMGlowen"
        },
        {
            "level": 0,
            "comment": "Satan is my Superhero is awesome! Every episode is inspired by a deep dive into religious nonsense and other conspiracies , along with historical facts, music,  movies, science, art, gaming.... funny and punchy but also very informative. Latest episode is about Pokemon and all the claims to satanic/ devil worship/ dark magic. Pretty funny  \n\nBBC have the Documentary Podcast, half hour episodes on different topics around the world, I listened to one recently about women and children bring blackmailed with internet porn in south Korea and how misogyny is a new word and concept. \n\nIndoctrination is another fascinating pod about cults and high control groups \n\nLove and Radio have a huge backlog of interesting stories too.",
            "score": 1,
            "author": "Head-Hedgehog8223"
        },
        {
            "level": 0,
            "comment": "In our time?",
            "score": 1,
            "author": "viewisinsane"
        },
        {
            "level": 0,
            "comment": "Hmmmm…Have ya tried “Bitter old cat lady”? We do have lotsa fun but some serious discussion as well.",
            "score": 1,
            "author": "Bitteroldcatlady1"
        },
        {
            "level": 0,
            "comment": "Try “Criminal”. The stories are great and the hosts voice is a bonus. I think you’ll like it!",
            "score": 1,
            "author": "CindysInMemphis"
        },
        {
            "level": 0,
            "comment": "Ologies may be something up your alley.",
            "score": 1,
            "author": "Idontthinksotimmy"
        },
        {
            "level": 0,
            "comment": "Just the Gist\n\nThey cover different topics each week and often of something you think you know about but you realise you actually didn’t.",
            "score": 1,
            "author": "Up_and_ATEM"
        },
        {
            "level": 0,
            "comment": "Psychology in Seattle! \nNot just about psychology.",
            "score": 1,
            "author": "bellypoint"
        },
        {
            "level": 0,
            "comment": "Everything Everywhere Daily is perfect for this!!",
            "score": 1,
            "author": "Creative_Vegetable"
        },
        {
            "level": 0,
            "comment": "The UFO Rabbit Hole. I’ve always been skeptic and cynical about the topic, but I binged this entire series in a few weeks. It’s more than just things flying through the sky. This podcast digs into science, religion, history, and reality.",
            "score": 1,
            "author": "redditgiveshemorroid"
        },
        {
            "level": 0,
            "comment": "I really loved „The Leap“ by KQED. They don‘t make new episodes anymore, but you might enjoy listening through their catalogue. I even remember the title of my favorite episode:“Suddenly everybody’s favorite communist“ - it’s a ridiculous story of a dude from San Francisco who’s never really done anything remarkable and then just decides to go to northern syria and fight against ISIS alongside the Kurds.",
            "score": 1,
            "author": "cucumberblueprint"
        },
        {
            "level": 0,
            "comment": "BBC in our time, science or History",
            "score": 1,
            "author": "SuitableWestern3066"
        },
        {
            "level": 0,
            "comment": "Bandsplain is crazy deep dives into famous bands history and influences.",
            "score": 1,
            "author": "ackers24"
        },
        {
            "level": 0,
            "comment": "Some episodes of Getting Curious with Jonathan van Ness will fit the bill",
            "score": 1,
            "author": "Autodidact2"
        },
        {
            "level": 0,
            "comment": "Behind the police",
            "score": 1,
            "author": "QTIPLYLES"
        },
        {
            "level": 0,
            "comment": "BBC Arts and Ideas is great for discussion about a wide range of subjects. Usually about 20 mins long.",
            "score": 1,
            "author": "SnooStrawberries7898"
        },
        {
            "level": 0,
            "comment": "No such thing as a fish, if you want just a ton of facts, and comedy.\n\n99% invisible, haven't listened to as much but it is still extremely good.",
            "score": 1,
            "author": "UnderCatViper",
            "replies": [
                {
                    "level": 1,
                    "comment": "No such thing as a fish is so fun. I’ve been listening for years and never get tired of it.",
                    "score": 2,
                    "author": "kannron",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Literally listened to the whole catalogue twice.",
                            "score": 1,
                            "author": "UnderCatViper"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "One podcast I like is For Fact’s Sake. Basically, they Google random facts and discuss a different topic every week. They’ve done presidents, fast food restaurants, libraries, etc.",
            "score": 1,
            "author": "I_Scream_Panda"
        },
        {
            "level": 0,
            "comment": "99% invisible. Stuff you should know.",
            "score": 1,
            "author": "Voodoo_People78"
        },
        {
            "level": 0,
            "comment": "Mysterious universe",
            "score": 1,
            "author": "Creative_Artist2467"
        },
        {
            "level": 0,
            "comment": "Literature and History Podcast is excellent!",
            "score": 1,
            "author": "akat_walks"
        },
        {
            "level": 0,
            "comment": "History of Rome",
            "score": 1,
            "author": "Canadianwarlord2021"
        },
        {
            "level": 0,
            "comment": "He Said,  She Said",
            "score": 1,
            "author": "HopefulWillingness94"
        },
        {
            "level": 0,
            "comment": "Keeping It Real",
            "score": 1,
            "author": "HopefulWillingness94"
        },
        {
            "level": 0,
            "comment": "Criminal on apple podcast",
            "score": 1,
            "author": "Only-Yogurtcloset-23"
        },
        {
            "level": 0,
            "comment": "Timesuck",
            "score": 1,
            "author": "DanIsAManWithAFan"
        },
        {
            "level": 0,
            "comment": "If you like pop culture history, Too Much Information is one of my all time favorites! Each episode, the two hosts do a deep dive into the making of a different classic movie, TV show, album or song. They've only been doing it for about a year but they've already done more than 100 episodes — and the research that goes into it is CRAZY. They even did a three part, six-hour episode on the making of James Cameron's 'Titanic' for the 25th anniversary. (They don't call it \"Too Much Information\" for nothing!) But it's all so entertaining and they're hilarious. So deep and thorough. They both have written for places like Rolling Stone, Entertainment Weekly and MTV, so they really know their stuff. If you like pop culture history, you'll love this. \n\nhttps://podcasts.apple.com/us/podcast/too-much-information/id1618071214",
            "score": 1,
            "author": "sweaterguy67"
        },
        {
            "level": 0,
            "comment": "Decoder Ring\n\nHidden Brain\n\nThis American Life\n\nBehind the Bastards\n\n99% Invisible\n\nRadioLab\n\nDeath, Sex &amp; Money\n\nSnap Judgement\n\nThe Dork Forest",
            "score": 1,
            "author": "Serious-Equal9110"
        },
        {
            "level": 0,
            "comment": "Well, Radiolab. Here I quote the description: \"Radiolab\": This podcast explores the mysteries of science and the human experience, covering topics like the science of sleep, the history of anesthesia, and the psychology of fear.",
            "score": 1,
            "author": "thefabiopodcast"
        },
        {
            "level": 0,
            "comment": "Wind of Change was SUCH a good podcast! It’s only one season and about one topic but I found it absolutely fascinating and I was so drawn in. It asks, Did the CIA write “Wind of Change” for the Scorpians to end the Cold War? It really will get you thinking!",
            "score": 1,
            "author": "LevelMom"
        },
        {
            "level": 0,
            "comment": "I love JB Smoove’s podcast.\n\n[“May I Elaborate - Sound Wisdom From JB Smoove”](https://open.spotify.com/episode/5CV92145LX33gl110LncxE?si=oeuQvouWT_mv9a9Z6xv13Q)",
            "score": 0,
            "author": "AD480"
        },
        {
            "level": 0,
            "comment": "That's called...podcasts...",
            "score": 0,
            "author": "waxonmain"
        }
    ]
}