{
    "id": "1389ip3",
    "score": 10,
    "title": "Any recommendations on podcasts for women of color for self worth?",
    "author": "shadybadgal",
    "date": 1683257757.0,
    "url": "https://www.reddit.com/r/podcasts/comments/1389ip3",
    "media_urls": [],
    "other_urls": [],
    "postText": "Corporate America is making me burnt out and I am so tired all the time. I have no passion. I feel lifeless. No drive. My boss is toxic and makes my question my ability at work so I’d love a podcast about self worth.",
    "comments": [
        {
            "level": 0,
            "comment": "I love hearing what Savannah has to say on the Female Dating Strategy.",
            "score": 2,
            "author": "Conscious-Magazine50",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ll check it out. Thank u!",
                    "score": 2,
                    "author": "shadybadgal",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Of course! Even though I'm not even straight and not even trying to date  I love that podcast for how they dissect culture and how to interact in the world.",
                            "score": 2,
                            "author": "Conscious-Magazine50"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Isn't that the femcel community that was banned off reddit for toxicity?",
                    "score": -2,
                    "author": "JimmyRecard"
                }
            ]
        },
        {
            "level": 0,
            "comment": "We wear black. Fantastic podcast",
            "score": 2,
            "author": "Ash6791"
        },
        {
            "level": 0,
            "comment": "Try Our Body Politic.\nhttps://ourbodypolitic.com/",
            "score": 1,
            "author": "the_nicker5fcrew"
        },
        {
            "level": 0,
            "comment": "Try The Nod.\n\nThe Nod’s older episodes which are 30-60 min long are fantastic. A variety of formats, tones and topics; all African-American. \n\nIn mid-2020, The Nod morphed into a daily video show on Quibi (RIP), with 7-8 minute episodes. They continued to podcast the audio of the Quibi videos. I didn’t enjoy those; they were too rushed and lacked the unfolding of the stories that older versions had. \n\nTyping this is inspiring me to go re-listen to the full length episodes. I hope this helps in your fight to be your true self within Corporate America’s culture. Stay strong!",
            "score": 1,
            "author": "Serious-Equal9110"
        },
        {
            "level": 0,
            "comment": "Code Switch",
            "score": 1,
            "author": "Trystiane"
        },
        {
            "level": 0,
            "comment": "Homecoming by Dr. Thema, current president of the APA. It’s an amazing podcast for everyone but especially women of color. She has many episodes around burnout, finding your joy, setting boundaries, building community, etc. I always feel better after listening.",
            "score": 1,
            "author": "Firefliesfast"
        },
        {
            "level": 0,
            "comment": "I’m sorry you’re feeling this way! I hope you have outlets outside of work where you find joy. It’s not a self worth podcast but it helped me out of a dark time - why won’t you date me with Nicole Byer. She has a different guest on every week and she’s just a ray of sunshine.",
            "score": 1,
            "author": "soniyas20"
        },
        {
            "level": 0,
            "comment": "This isn’t quite what you are looking for, but you might find “Yo, Is This Racist” cathartic. It’s hosted by a Tawny Newsome (a black woman) and Andrew Ti (a Chinese-American man) and they often talk shit about how bad corporations and the corporate world is.  It can be a bit loose, but they are consistently hilarious.",
            "score": 1,
            "author": "Novela_Individual"
        },
        {
            "level": 0,
            "comment": "Girl, Let's Chat\n\nShe Did That",
            "score": 1,
            "author": "Anthony-Z-Z"
        }
    ]
}