{
    "id": "138zeh7",
    "score": 31,
    "title": "Can anybody recommend any podcasts about events in the Congo under Leopold II?",
    "author": "pope_of_chilli_town_",
    "date": 1683316373.0,
    "url": "https://www.reddit.com/r/podcasts/comments/138zeh7",
    "media_urls": [],
    "other_urls": [],
    "postText": "Not too fussed about the length; surface knowledge or a deep dive are both fine. Thank you.",
    "comments": [
        {
            "level": 0,
            "comment": "Sorry, I should mention I've already listened to one (Behind the Bastards).",
            "score": 9,
            "author": "pope_of_chilli_town_"
        },
        {
            "level": 0,
            "comment": "Not a podcast, but king leopold's ghost is a very well researched book on the topic if you are into audiobooks",
            "score": 7,
            "author": "hihihihihihellohi"
        },
        {
            "level": 0,
            "comment": "Hey there, I can’t recommend a specific podcast or episode but I‘d look either for more general terms (History of Congo, History of Africa) or more specific terms (Patrice Lumumba, Joseph Kasavubu, Mobutu Sese, …). In case you stumble upon something interesting, please share :)",
            "score": 6,
            "author": "_awake"
        },
        {
            "level": 0,
            "comment": "Noble Blood did an episode about him in 2020. He was also mentioned in an episode of Dan Snow’s History Hit last year, as part of a larger discussion about corruption.",
            "score": 3,
            "author": "Short_Equivalent_619"
        },
        {
            "level": 0,
            "comment": "Timesuck episode 72 is The Colonial Devastation of Africa. It's a broad overview with some dark humor mixed in, but there's some good info there.",
            "score": 3,
            "author": "PortraitOfAHiker",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love Timesuck and I'm all up to date with the episodes and this is drawing a total blank for me. I'll have to go back and listen.",
                    "score": 2,
                    "author": "pope_of_chilli_town_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Behind the bastards did a two-parter about him. If by chance you enjoy non fiction, you should read King Leopold's Ghost by Adam Hochschild!\n\nEdit : Behind the bastards also did a two-parter on Henry Morton Stanley, in which King Leopold plays an important role.",
            "score": 6,
            "author": "lateral_asteroid"
        },
        {
            "level": 0,
            "comment": "Not sure if they have covered this, but In Our Time from the BBC is a good shout for this kind of topic.",
            "score": 2,
            "author": "otterpockets75"
        },
        {
            "level": 0,
            "comment": "I haven't listened to it yet, but Our Fake History has a three-parter on the \"Congo Free State.\" Episodes 80-82.",
            "score": 2,
            "author": "julieputty",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just what I was looking for, thank you.",
                    "score": 1,
                    "author": "pope_of_chilli_town_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Behind the Bastards has a great two parter episode on Leopold then an episode on what happens after.",
            "score": 0,
            "author": "WillyTheHatefulGoat"
        }
    ]
}