{
    "id": "13g1laf",
    "score": 13,
    "title": "Looking for something that is funny, but also lower energy",
    "author": "dariasniece",
    "date": 1683936515.0,
    "url": "https://www.reddit.com/r/podcasts/comments/13g1laf",
    "media_urls": [],
    "other_urls": [],
    "postText": "My favorite podcast is Hey Riddle Riddle. For their 200th episode, one of the hosts asked people to describe the show in one word, and 75% of the people who answered answered with \"chaos.\" I love it, but it is sometimes really out there. Scenes get derailed and come unhinged immediately, if the answer to a riddle is bad, sometimes the hosts get legit angry, and there's a fair amount of overtalking and just a lot of chaotic energy. I love it, but there are times when it is just too much stimulation and I'd like something a little less manic or chaotic but still funny.\n\nI think part of this might have to do with a lot of the shows I listen to have male hosts or mostly male hosts. I have listened to one or two podcasts that essentially had like five dudes taking turns to crack a joke on a particular subject without anyone really laughing or acknowledging anyone else's joke. Maybe I should try a few more shows with female or mostly female hosts.\n\nIn a similar vein, I'd prefer something that doesn't talk about a ton of TV or new movies or the like. Sometimes that makes me feel like there's just so much content out there that I could be trying but instead I'm listening to people talk about the content instead of experiencing it. I don't mind podcasts with ads, we all need to get paid after all, but I don't want to walk away from a podcast feeling like I need to watch another five shows.\n\nIn another thread, someone recommended Everything is Alive for kids. I have listened to that one a bit and I think it fits. I'll try downloading a few more episodes for when I'm in one of those moods.\n\nFeel free to recommend anything. Typing this out, it sounds like I'm a fragile flower ready to tilt over at any second, but I'm really not. It's just sometimes I want a bit of a calmer energy than usual and I don't have something to fill that void at the moment. Thanks in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "I don't know if this will fit but whenever I need a lighter podcast that makes me laugh, I listen to No Such Thing as a Fish. 4 hosts (3m, 1f) and each brings a fact they learned that week. I love the energy of this show so much.",
            "score": 3,
            "author": "termanatorx",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ll check it out, thanks!",
                    "score": 1,
                    "author": "dariasniece"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Straightiolab! It’s two gay guys who have on straight or gay comedians and they talk about straight culture lol. It won vultures comedy podcast of the year. Its just silly and my straight friends actually love it!",
            "score": 3,
            "author": "zeroicestop",
            "replies": [
                {
                    "level": 1,
                    "comment": "This really appeals to me! Should I start at the beginning or could I jump in anywhere?",
                    "score": 2,
                    "author": "Kalysia",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Jump in anywhere! The newest season they got picked up by iheart and they’re much more polished, but the chaos of the older episodes is still hilarious. I really like the Kim young booster episodes. Or the Bowen Yang episodes. “Dinner Parties” with Alison Roman was really funny lol! \n\nWith all podcasts, of course there’s a flop or two, but they’re pretty consistent with great episodes !",
                            "score": 1,
                            "author": "zeroicestop"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dr gameshow comes to mind",
            "score": 2,
            "author": "ben_jammin11"
        },
        {
            "level": 0,
            "comment": "I second No Such Thing As A Fish, and something in a similar vein but more historical focus would be The Randomly Generated History Club (2 men, one woman). Funny and factual but minimally chaotic!",
            "score": 2,
            "author": "EliPB2509"
        },
        {
            "level": 0,
            "comment": "[Norm Macdonald on radioshows for hours and hours](https://youtu.be/F_3-ZPK13cA)\n\nThe guy made phonecalls an artform",
            "score": 3,
            "author": "Itscoldinthenorth",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!",
                    "score": 1,
                    "author": "dariasniece"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Personal Best, If I Were You, Normal Gossip and Podcast but Outside.",
            "score": 1,
            "author": "Beyou74",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ll look into them, thanks!",
                    "score": 1,
                    "author": "dariasniece"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bananas. Weird/funny news stories hosted by 2 guys that are bffs. They keep it light and apolitical. If they have a guest it’s always a woman or a NB person. I like it when I’m feeling overstimulated.",
            "score": 1,
            "author": "LuckySmellsMommy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 0,
                    "author": "dariasniece"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Podcast for laundry",
            "score": 1,
            "author": "ben_jammin11"
        },
        {
            "level": 0,
            "comment": "Off Menu is about food and while it can get a little out of control on occasion it's mainly chill but funny. Tons of episodes too.",
            "score": 1,
            "author": "PickScraped"
        },
        {
            "level": 0,
            "comment": "I like Dan Snows history podcasts. The guests often speak a lot more than he does and there’s a like of female guests",
            "score": 1,
            "author": "HobgoblinKhanate1"
        },
        {
            "level": 0,
            "comment": "My Brother, My Brother, and Me. The McElroy brothers are three are comedians who have done everything from live role-playing game story arcs (the adventure zone, check out the first series) to TV. MBMBAM is “an advice show for the modern era“ that’s been running since 2010. They started by taking funny or serious questions posed to them or to the Internet and giving answers ranging from the helpful to the ridiculously hilarious. These days they answer fewer questions and just do more riffing on general things, but they’re always entertaining. Language alert!",
            "score": 1,
            "author": "Wonderingfirefly"
        },
        {
            "level": 0,
            "comment": "If you like random, just void filler that's not so chaotic - these Australian guys (comedians?) started a show earlier this year. (NSFW)\n\nIt's super lofi. Fine to have in the headphones. Spotify link. \n\nhttps://open.spotify.com/show/0HKNAj1fqE4h2S9LFzicK1",
            "score": 1,
            "author": "black-ed-waifus"
        },
        {
            "level": 0,
            "comment": "I'm not sure how much to your taste this will be but there's a new podcast called 'bromantic' I listen to, it's literally just two dudes telling each other facts, would you rathers etc. They literally have something like 'just come chill out and laugh with us in their description. Well worth a listen imo.",
            "score": 0,
            "author": "Severe-Pineapple816"
        }
    ]
}