{
    "id": "13iejds",
    "score": 52,
    "title": "Podcasts that give you something to talk about with others that are also funny?",
    "author": "HoustonTexan",
    "date": 1684171838.0,
    "url": "https://www.reddit.com/r/podcasts/comments/13iejds",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, I’m looking for a podcast that has content that can start a conversation that’s also funny. I’m okay with interview style shows though I find they’re often times either too serious or basically only interview comedians. Basically, I'm looking for shows like Hidden Brain, Radiolab, and Planet Money that actually have some humor to them. Something where an interesting topic is explored kind of like how The Dollop does with history but with other topics. Any recommendations are appreciated, thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "I reckon you are looking for ‘No such thing as a fish’.\n\nFun fact based pod from the researchers from the BBC show QI. It’s the team discussing their 4 favourite facts of the week… and they just riff around each subject for 10 mins or so. The pod has been going about 10 years. It’s ace and regularly tops the U.K. pod charts. It’s great for sparking thoughts, discussions and the like.",
            "score": 35,
            "author": "StillJustJones"
        },
        {
            "level": 0,
            "comment": "You're Dead To Me (history)\n\nThe Curious Cases of Rutherford and Fry (science)\n\nDo Go On (a lot of history but also all kinds of other topics)\n\nThe Rest Is History and Half-arsed History are not always funny (depends quite a bit on the topic), but quite often they are (not laugh out loud comedy, though)\n\nThe already mentioned No Such Thing As A Fish is perfect for this kind of thing, obviously.\n\nI'd also recommend the Museum of Curiosity, but it's technically not a podcast (it's a BBC radio show, but you can listn to the show and archives for free via the BBC sounds app - not sure if that is true worldwide, but it does work here in Germany, so not limited to the UK)",
            "score": 10,
            "author": "calijnaar"
        },
        {
            "level": 0,
            "comment": "Ologies is fun! The host interviews various experts about their fields of study. Some guests are funnier than others, but usually it's pretty entertaining. I've learned a lot of random factoids.",
            "score": 7,
            "author": "hamletstragedy"
        },
        {
            "level": 0,
            "comment": "BEHIND THE BASTARDS.\n\ntry the last czar of Russia Nicholas the 2nd episode",
            "score": 7,
            "author": "therantwriter",
            "replies": [
                {
                    "level": 1,
                    "comment": "this!",
                    "score": 1,
                    "author": "Head-Mastodon"
                },
                {
                    "level": 1,
                    "comment": "I came to say the same!",
                    "score": 1,
                    "author": "SeriouslySinisterPod"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I like \"Hard Fork\" from the New York Times. Not a \"comedy\" podcast but the guys are naturally funny with great chemistry. Plus it is all about the latest in tech (and mainly AI now) which is always an interesting topic for conversation.",
            "score": 5,
            "author": "CovfefeFan"
        },
        {
            "level": 0,
            "comment": "Underunderstood is good for this. They answer questions that can’t just be googled. I find myself bringing up random episodes of theirs in conversation all the time",
            "score": 4,
            "author": "redninja24"
        },
        {
            "level": 0,
            "comment": "Another British one of specialists with one comedian that's on a variety of topics from space exploration to human genome to mathematics is called \"The Infinite Monkey Cage\". Worth a listen.",
            "score": 3,
            "author": "Different_Section799"
        },
        {
            "level": 0,
            "comment": "Try \"Really, No, Really\"  with Jason Alexander (George from Seinfeld).  The only drawback is the audio levels are sometimes off and his co-host, though well meaning, is a bit of a mush mouth, so if your headphones aren't top notch, or you are listening amidst background noise, it can be hard to make out what he is saying.  Subject matter and content is interesting, and humorous.",
            "score": 3,
            "author": "Petrofskydude"
        },
        {
            "level": 0,
            "comment": "if you missed \"reply all\", listen.  even if it's a dead show, its also a neat and funny time capsule of things happening near the Internet.",
            "score": 3,
            "author": "ilovefacebook"
        },
        {
            "level": 0,
            "comment": "I really appreciate the Michael Hobbesian podcast universe for the mix of informative, fun, great kinda connection between hosts:  ‘maintenance phase’ (Aubrey Gordon/Michael Hobbes), ‘you’re wrong about’ Sarah Marshall, used to do it with Michael Hobbes), ‘if books could kill (Hobbes and Peter Shamshiri) ‘you are good’ (Sarah Marshall &amp; Alex Steede)",
            "score": 7,
            "author": "Upstairs_Sorbet_5623",
            "replies": [
                {
                    "level": 1,
                    "comment": "Came here to say this.",
                    "score": 2,
                    "author": "TerryOrcutt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really love The Omnibus, hosted by Ken Jennings and John Roderick. \nGreat banter, always learn something new, they have the format down to a finely-honed-edge.",
            "score": 2,
            "author": "DJ_McBlah"
        },
        {
            "level": 0,
            "comment": "I'm a huge fan of Sawbones, ostensibly a show about medical history foibles but has drifted into modern topics of late (pandemic etc). It's got a more than 10 year backlog I think. It's fun, and educational! Funucational!",
            "score": 2,
            "author": "Smelltastic"
        },
        {
            "level": 0,
            "comment": "Decoder Ring is an awesome show that can prompt some fun discussion. It’s not designed to be funny, but there are many comical moments and the writing can be very witty. The show is all about debunking cultural myths.",
            "score": 2,
            "author": "ennsync"
        },
        {
            "level": 0,
            "comment": "Russel Kane- evil genius or man baggage. Very funny and sometimes very insightful",
            "score": 1,
            "author": "Happy_Assumption7983"
        },
        {
            "level": 0,
            "comment": "How Long Gone",
            "score": 1,
            "author": "Commercial_Author_75"
        },
        {
            "level": 0,
            "comment": "F**kface\n\nSearch it like that with the asterisks. 3 best friends (and sometimes a producer/editor chime in) they just talk. About anything and everything and it's absurd and funny",
            "score": 1,
            "author": "NapsAndCats88"
        },
        {
            "level": 0,
            "comment": "THAT PETER CROUCH PODCAST    pass the pod. Enough said",
            "score": 1,
            "author": "ukswitchon"
        },
        {
            "level": 0,
            "comment": "Big fan of Middle of Somewhere",
            "score": 1,
            "author": "BeardLaws"
        },
        {
            "level": 0,
            "comment": "Check out Out For Smokes. It's a bit dark sometimes, but it's funny and they cover a plethora of topics.",
            "score": 1,
            "author": "ThatCowardlyDog"
        },
        {
            "level": 0,
            "comment": "Profiteers vs. The People seems to be a decent mix of those two ideas - they talk about culturally significant people, but they keep it light",
            "score": 1,
            "author": "imbadatdecisions"
        },
        {
            "level": 0,
            "comment": "Redbarradio.net\nRedbar Radio.",
            "score": 1,
            "author": "jestcurses"
        },
        {
            "level": 0,
            "comment": "the basement yard",
            "score": 1,
            "author": "YEET-HAW-BOI"
        },
        {
            "level": 0,
            "comment": "Do You Need A Ride podcast.",
            "score": 1,
            "author": "JMT2492"
        },
        {
            "level": 0,
            "comment": "My first Million is kind of like that, but take numbers and guests claims with a pinch of salt but they have discussed interesting ideas and stocks that are down.",
            "score": 1,
            "author": "Naive_Reach2007"
        },
        {
            "level": 0,
            "comment": "Under Understood and (though it's ended) Every Little Thing",
            "score": 1,
            "author": "newpenzance"
        },
        {
            "level": 0,
            "comment": "Don't listen to podcasts to improve your conversation. Listen to them because they are enjoyable. If you want funny watch standup comedy on tiktok or youtube.",
            "score": -11,
            "author": "AssistTemporary8422"
        }
    ]
}