{
    "id": "13m4yve",
    "score": 2,
    "title": "Podcast that goes through the Bible start to finish and discusses it in a historical / philosophical point of view.",
    "author": "Trainwreak_Dog",
    "date": 1684523801.0,
    "url": "https://www.reddit.com/r/podcasts/comments/13m4yve",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm looking for one that really digs into the history and philosophy of the Bible or alternatively other religious texts but from start to finish. ( I want to read as many religious texts as possible over the next few years but I'm starting with the Bible because I was raised in that religion) \nI don't care if it's done by an atheist, Christian or other but one that really studies the text. \nI've heard super evangelicals do it and aithests do it for the sake of poking fun but I'm looking for a podcast or even an online class that goes over it as more of a piece of history and work of literature and philosophy.",
    "comments": [
        {
            "level": 0,
            "comment": "History in the Bible is awesome because it’s not religious but also done by someone who seems to enjoy the Bible for its stories and history. \n\nThe host is likable and some fascinating insights into the history and context of the Bible.\n\nIt does sometimes devolve into just a summary of the books in question which wasn’t interesting to me.  \n\nSo I ended up skipping around some of the episodes.",
            "score": 4,
            "author": "lolpdb",
            "replies": [
                {
                    "level": 1,
                    "comment": "History in the Bible is 10000000% the right answer.",
                    "score": 2,
                    "author": "statue4103"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Vacation Bible School discusses each book from an academic/secular perspective and interviews guests of different persuasions with some sort of expertise in the book's themes. But it's a lot more fun than my description made it sound! The only drawback is they post irregularly.",
            "score": 2,
            "author": "PandoraPineapple"
        },
        {
            "level": 0,
            "comment": "In addition to History in the Bible, which has already been mentioned, I highly recommend Literature and history.  Has a run of episodes for both the old and new testaments.  Also has episodes on Gnosticism, Zoroastrianism, manicheanism, and other religions/philosophies bouncing around the area when Christianity and modern Judaism were forming.    This is exactly what you are looking for:  a thoughtful, sincere discussion of the texts and the historical context in which they were produced as well as an analysis of the possible authors of the texts. Plus, the host is an incredibly talented presenter. This is a gem of a podcast.  After listening to the Bible episodes I don’t see how you could resist listening to all the rest of the episodes!",
            "score": 1,
            "author": "mdthornb1"
        },
        {
            "level": 0,
            "comment": "Sunday school dropout",
            "score": 1,
            "author": "No_Establishment8364"
        }
    ]
}