{
    "id": "13omjaq",
    "score": 204,
    "title": "Podcasts like Behind the Bastards without the constant giggling and random tangents?",
    "author": "anongasm_",
    "date": 1684749743.0,
    "url": "https://www.reddit.com/r/podcasts/comments/13omjaq",
    "media_urls": [],
    "other_urls": [],
    "postText": "Can you guys recommend me podcasts like Behind the bastards without the annoying guests who go on random tangents and cut in constantly and the constant giggling at random points. I love the topics covered but I can do without the points I mentioned above. Any recommendations?",
    "comments": [
        {
            "level": 0,
            "comment": "Swindled.",
            "score": 104,
            "author": "LakeStLouis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Top tier podcast",
                    "score": 28,
                    "author": "paperpenises",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Swindled is a S tier podcast for sure u/swindledpodcast 🤝",
                            "score": 15,
                            "author": "lil_intern"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "such a fantastic podcast! I do enjoy that he doesn't over emphasize on the jokes he does slip into the show.",
                    "score": 20,
                    "author": "kagah"
                },
                {
                    "level": 1,
                    "comment": "Thanks for your suggestion! Listening to it now and love it. I am another who can't handle any more podcasts about real life stories that are peppered throughout with quivering laughter and snarkery.",
                    "score": 17,
                    "author": "TerriBillz"
                },
                {
                    "level": 1,
                    "comment": "I couldn’t listen to it. The narrator is too monotonous for my taste.",
                    "score": 8,
                    "author": "_awake",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I've got to be in the right mood for it, for sure.",
                            "score": 7,
                            "author": "LakeStLouis"
                        },
                        {
                            "level": 2,
                            "comment": "I just sampled it and turned it off within 10 seconds for the exact same reason",
                            "score": 2,
                            "author": "Reverendpjustice",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Give it a chance just listen to one full episode",
                                    "score": 1,
                                    "author": "dakillachuy"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Blowback",
            "score": 35,
            "author": "ithsoc",
            "replies": [
                {
                    "level": 1,
                    "comment": "Indeed, Blowback is the gold standard by which all others shall be judged.",
                    "score": 8,
                    "author": "microphove"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree. I like edited podcasts that talk about something in depth without all the banter. I don't even need the 'listener' guest reacting to everything, it's tiresome.\nI also find it super annoying that a lot of podcasts have a team and yet don't edit things out. I would appreciate a shorter, cleaner conversation. \nI still listen to BtB but in terms of history, Revolutions is pretty good and otherwise I listen to more journalistic type podcasts",
            "score": 28,
            "author": "sea_munster",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good Writing is a skill that is often not recognized until it is gone",
                    "score": 6,
                    "author": "mediapoison"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 11,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I like his guests from his cracked days, and those dudes that have the podcast on Alex Jones though the one guy is kind of loud",
                            "score": 5,
                            "author": "Ramstepp"
                        },
                        {
                            "level": 2,
                            "comment": "Uhh... Not the products and services that support this podcast? They are definitely not real blame (but may or may not result in serious injury and/or death)",
                            "score": 2,
                            "author": "ttminh1997"
                        },
                        {
                            "level": 2,
                            "comment": "I just want Paul F Tompkins as his permanent guest",
                            "score": 2,
                            "author": "PM_ME_CODE_CALCS"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Real Dictators",
            "score": 38,
            "author": "Outside_Revenue3905",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed! Fabulously done pod.",
                    "score": 3,
                    "author": "KansasAvocado"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I like You're Dead to Me for some unusual history",
            "score": 13,
            "author": "fuckyourmagicgenie"
        },
        {
            "level": 0,
            "comment": "OP, that’s not very cash money of you…",
            "score": 12,
            "author": "CatCactus007"
        },
        {
            "level": 0,
            "comment": "Swindled",
            "score": 11,
            "author": "plantglutton"
        },
        {
            "level": 0,
            "comment": "How about Knowledge Fight?",
            "score": 10,
            "author": "Soggy_Bicycle"
        },
        {
            "level": 0,
            "comment": "I started out really enjoying Behind the Bastards, but stopped listening for exactly the reasons you mentioned.  It is incredibly annoying.  I'm so sick of podcasters who try to constantly force being funny and/or derail the topic and it's becoming increasingly more common.",
            "score": 46,
            "author": "KevinStoley",
            "replies": [
                {
                    "level": 1,
                    "comment": "Never met anyone who laughs nervously?  The guys life is constantly researching the grimmest people and events in this world.  Gallows humor and inappropriate laughter is expected. I had this realization after a visit to the hospital and overhearing people working there acting like complete shit heads a few rooms over.  Soldiers are in a similar boat.  Construction workers too.",
                    "score": 7,
                    "author": "Doondory",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A little humor and/or a random tangent is fine every once in awhile.  But when it starts to take over and distract from the main purpose of a podcast, then there’s a problem.\n\nThere’s countless podcasts out there, many focused on or by comedians.  I’ll listen to one of those if I want comedy.  \n\nBut if I’m listening to a podcast about shitty horrible people, that’s what I expect, not amateur wannabe comedians trying to constantly be clever and funny.",
                            "score": 6,
                            "author": "KevinStoley",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't this it's a \"problem\" so much as it isn't your preference. Personally, I think the level of humor on Behind the Bastards is perfect, and the show is less enjoyable when they play it too straight. \n\nAll that said, there are times I love a well-written and well edited podcast. When done properly they can be super engrossing.",
                                    "score": 1,
                                    "author": "asciidan"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Excellent point :)",
                            "score": 1,
                            "author": "TakeshiKovacsSleeve3"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s the Ridiculousness of podcasts.",
                    "score": 0,
                    "author": "Barbarossa7070",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s a ridiculous comparison, whether you like it or not Robert does great research",
                            "score": 5,
                            "author": "HILLIAM_SWINNEY"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Constant, it's focused more on screw ups on a group/society level rather than individual bad people, but probably still on-brand for what your looking for.",
            "score": 21,
            "author": "GLaDONT"
        },
        {
            "level": 0,
            "comment": "I would pay good money for something like BtB or Knowledge Fight without the 'funny' banter.",
            "score": 58,
            "author": "nevearz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Knowledge Fight isn’t quite as bad as BtB. Robert has too many people fanboying all over him, each trying to get in a funny quip before the other. Many times his points go over their heads or they make horrible analogies. When I first started listening to BtB there it was just Robert and some dude with a southern accent that could pretty much match Robert’s level of knowledge on a topic. I miss that guy. I just let the episodes pile up until I’m in the mood to listen to one. Once I hit play, if I hear the voice of a fanboy, I just delete it and try another.",
                    "score": 48,
                    "author": "CWHats",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I loved his recent Andrew Tate episodes cos it was just him and the other two, no special guests.",
                            "score": 12,
                            "author": "SwirlingAbsurdity"
                        },
                        {
                            "level": 2,
                            "comment": "Hey, the southern guy is comedian Billy Wayne Davis. He's on some other podcasts too, and has some of his own. He's a very sweet guy, good friend of mine, and polished comedian. He's from Tennessee and lives in Los Angeles, likes cannabis and such. \n\nEnjoy.",
                            "score": 52,
                            "author": "RandyTheSnake",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Billy Wayne is my favorite BTB guest. I keep hoping he’ll return; it’s been too long!",
                                    "score": 7,
                                    "author": "Serious-Equal9110"
                                },
                                {
                                    "level": 3,
                                    "comment": "Thanks!",
                                    "score": 4,
                                    "author": "CWHats"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Sometimes it's this woman who sounds like she's in love with him. She and his female producer will spend the entire episode going on about what a naughty boy Robert is and it's fucking annoying. One time this guest was high or drunk or something and wouldn't stop making lewd comments.",
                            "score": 5,
                            "author": "MuttonDressedAsGoose"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "*Behind the Bastards* host Robert Evans recorded an audiobook version of his non-fiction book, *A Brief History of Vice*\n\nIt's not about the recently deceased media empire\n\n[https://www.audible.co.uk/pd/A-Brief-History-of-Vice-Audiobook/B01II68RR0](https://www.audible.co.uk/pd/A-Brief-History-of-Vice-Audiobook/B01II68RR0)",
            "score": 23,
            "author": "Cannaewulnaewidnae"
        },
        {
            "level": 0,
            "comment": "Yeah if behind the bastards would stop being shitty morning radio I would love it.",
            "score": 38,
            "author": "duckinradar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Successful podcasts tend to lose their focus",
                    "score": 12,
                    "author": "mediapoison"
                },
                {
                    "level": 1,
                    "comment": "Personally, I like the banter. Ever notice how he usually has a comic as a guest when they discuss a Nazi? They're talking about the most evil people that have lived. Comic relief is welcome and necessary, in my opinion.",
                    "score": 5,
                    "author": "Dre_wj",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 12,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey now, Paul F. Tompkins is great",
                                    "score": 4,
                                    "author": "Dre_wj"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don’t want to hear Sophie why does she chime in",
                    "score": 1,
                    "author": "SnackPocket",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I love BTB but Sophie does get a little annoying 🤦",
                            "score": 2,
                            "author": "Jynandtonics"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think it a sign of burnout.",
                    "score": -1,
                    "author": "protobacco"
                }
            ]
        },
        {
            "level": 0,
            "comment": "True anon goes into the various jeffery epstien adjacent bastards in politics, finance, culture etc. They do go off on tangents but their deep dives are well researched and entertaining.",
            "score": 16,
            "author": "Onion-Fart",
            "replies": [
                {
                    "level": 1,
                    "comment": "They can still get pretty fucking annoying sometimes, though.",
                    "score": 3,
                    "author": "microphove"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not to be a dick but listen to some audiobooks if you want straight info. Part of the reason I really like The Dollop or BtB is the jokes in between. Spoon full of sugar helps the medicine go down.   \nAlso making relative light about some of the least humorous subjects in history takes real skill when done well.",
            "score": 16,
            "author": "OrangeSundays19"
        },
        {
            "level": 0,
            "comment": "Swindled \nThe Opportunist",
            "score": 4,
            "author": "sage-brush-"
        },
        {
            "level": 0,
            "comment": "\"What a Creep\" \nSimilar to Bastards but it's more focused and to the point. No tangents and the female hosts do a hilarious job of their Creep subject bios. They finish with a non-creep subject who does good deeds.",
            "score": 4,
            "author": "Successful-Side8902"
        },
        {
            "level": 0,
            "comment": "I liked BTB until a couple of 'celebrity' guests wouldn't shut up and ruined the episode. Didn't figure there was much point of continuing in further after that",
            "score": 16,
            "author": "skeletonbuster",
            "replies": [
                {
                    "level": 1,
                    "comment": "Celebrities think they are smart because they get attention for being on a sit com",
                    "score": 2,
                    "author": "mediapoison"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Crimes of the Centuries",
            "score": 3,
            "author": "lemmegiveitatry"
        },
        {
            "level": 0,
            "comment": "Ghost Stories for the End of the World if you wanna go DEEP.",
            "score": 3,
            "author": "elguapo87"
        },
        {
            "level": 0,
            "comment": "I’m glad you said this. I love this topics, I do think Robert Evans has a great delivery at times, but the giggling, the jumping in and Evans just know-it-all, been-there-done-that persona gets old to me.",
            "score": 3,
            "author": "tmille74"
        },
        {
            "level": 0,
            "comment": "I know what you mean. And it’s not even close to the worst offender; The Dollop, Trashfuture and WTYP all make BtB seem dry and deadly serious by comparison.",
            "score": 4,
            "author": "microphove",
            "replies": [
                {
                    "level": 1,
                    "comment": "I listened to the dollop from the beginning. Can’t even follow the episodes any more. The “improv” just goes too far and away from the story.",
                    "score": 8,
                    "author": "HinterlandCannaQLD",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know, right!? I managed to get through a few early ones, but that host’s forced wheezing laughter at his own weak jokes just became unlistenable very quickly.",
                            "score": 2,
                            "author": "microphove"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I want to like The Dollop so badly but Gareth won't ever shut up. Screaming the same \"joke\" for three minutes doesn't make it any funnier, dude.  There was a period of BTB with lame guests who make \"jokes\" and the \"INVEST IN REGAN GOLD\" ads that was tough.",
                    "score": 3,
                    "author": "muchandquick",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah it’s pretty egregious. I started the BtB six-parter on Kissinger, but the Dollop guys are unfortunately guest co-hosts and his obnoxious browbeating made me give up halfway through the first episode. Unlistenable.",
                            "score": 3,
                            "author": "microphove"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I also want to love The Dollop so much but that zoo crew opener and joke joke joke makes me sad.",
                    "score": 2,
                    "author": "SnackPocket"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hate all the fucking blathering and opining and lame attempts at humor on BTB and SYSK. They take a great premise and fuck it all up.",
            "score": 11,
            "author": "ExistingPosition5742"
        },
        {
            "level": 0,
            "comment": "Good Assassins.",
            "score": 2,
            "author": "TrackVol"
        },
        {
            "level": 0,
            "comment": "Generation Why has two hosts who usually stick to the story and have minimal banter.",
            "score": 2,
            "author": "YouHadMeAtTaco"
        },
        {
            "level": 0,
            "comment": "I know.. who likes this Zoo crew crowd?? no thanks!",
            "score": 2,
            "author": "thisismySFWprofile"
        },
        {
            "level": 0,
            "comment": "I’m glad I’m not the only one. I hate the giggling. I stopped listening a few years ago because of that.",
            "score": 2,
            "author": "WanderingVerses"
        },
        {
            "level": 0,
            "comment": "It’s worth listening to the great and good Liar City (RIP)",
            "score": 2,
            "author": "jhaars"
        },
        {
            "level": 0,
            "comment": "Stuff They Don't Want You To Know. Similar topics but the tone is a lot more serious.",
            "score": 2,
            "author": "tittyswan"
        },
        {
            "level": 0,
            "comment": "I also find BtB insufferable. Try \"Bad Gays.\"",
            "score": 4,
            "author": "decline_and_fall_"
        },
        {
            "level": 0,
            "comment": "They went off one day on some side bar, I realized how much time had past and felt high jacked. Then I switched back to stuff you should know and omnibus",
            "score": 2,
            "author": "mediapoison"
        },
        {
            "level": 0,
            "comment": "Asshole Court might work (AHC Podcast). Three affable guys take turns telling each other about a person and they rank them on an asshole scale. They don’t have the sardonic edge of Evans and they can still be a little tangential but definitely less of a “spirited” listen.",
            "score": 2,
            "author": "scorpioid_cyme"
        },
        {
            "level": 0,
            "comment": "The Daily Beans is good for news and politics. Pretty strict format and all the “fun” stuff is at the end and can be skipped if you’re not in the mood.",
            "score": 1,
            "author": "TechKnowNathan"
        },
        {
            "level": 0,
            "comment": "Listen to an ebook if you don't like conversation and guest interaction.",
            "score": -50,
            "author": "30dollarydoos",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -8,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The only sources that I could find that say bellingcat is a cia front seemed to be linked to shady websites and obvious Russian propaganda sites.",
                            "score": 3,
                            "author": "bryant_modifyfx"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What was it like to have your sense of humour surgically removed? I think you are confusing a feature with a bug here...",
            "score": -9,
            "author": "GStewartcwhite"
        },
        {
            "level": 0,
            "comment": "Know Your Enemy is pretty good for looking the intellectual underpinnings of conservatism.",
            "score": 1,
            "author": "jonny_sidebar"
        },
        {
            "level": 0,
            "comment": "UNFTR!",
            "score": 1,
            "author": "BeerDude24"
        },
        {
            "level": 0,
            "comment": "I mostly love it but something about his laugh seems so nervous forced it takes me out!",
            "score": 1,
            "author": "SnackPocket"
        },
        {
            "level": 0,
            "comment": "I like the podcast but i often find the tangents a little boring because they make references i don’t understand lol. (Maybe it’s because I’m several years younger and have never lived in LA? Not sure)",
            "score": 1,
            "author": "meg_bb"
        },
        {
            "level": 0,
            "comment": "Sad that a lot of podcast have background noise but to each their own I guess!",
            "score": 1,
            "author": "thedrowningfishpod"
        },
        {
            "level": 0,
            "comment": "I get you with the giggling. I would normally like the Cognitive Dissonance podcast but their cackling ruins the show for me. Cackling is like nails on a chalkboard for me.",
            "score": 1,
            "author": "sundogmooinpuppy"
        },
        {
            "level": 0,
            "comment": "Lions led by donkeys.  it has some banter but a lot less.it’s very military history focused though.  it’s rather good and is a similar vein to BtB and the Dollop",
            "score": 1,
            "author": "Lucky-Carrot"
        },
        {
            "level": 0,
            "comment": "slate political gabfest.  it’s very very very very very centrist though",
            "score": 0,
            "author": "Lucky-Carrot"
        }
    ]
}