{
    "id": "13wrpko",
    "score": 0,
    "title": "Podcast that talks openly about sex like \"we're having gay sex\" with Ashley gavin",
    "author": "AlainH1213",
    "date": 1685552277.0,
    "url": "https://www.reddit.com/r/podcasts/comments/13wrpko",
    "media_urls": [],
    "other_urls": [],
    "postText": "I want a podcast were everyone is chill and friendly and just openly talk about sex and sexlife and sexual experiences... like the podcast from Ashley gaving \"we're having gay sex\"",
    "comments": [
        {
            "level": 0,
            "comment": "The Viral Podcast, Savage Lovecast and Guy's We Fucked.",
            "score": 2,
            "author": "Beyou74"
        },
        {
            "level": 0,
            "comment": "This might be a weird one and not a lot of episodes (only 6?) but [Dying for Sex](https://podcasts.apple.com/us/podcast/dying-for-sex/id1495392900) is about a woman who found out she's got terminal cancer and who then leaves her marriage and leads her craziest, sexiest life. The podcast is her and her best friend talking about these escapades. It's partly about living and partly about dying and I really enjoyed it.",
            "score": 1,
            "author": "KweenWithAFlag",
            "replies": [
                {
                    "level": 1,
                    "comment": "And Risk has some episodes that deal with sexy subjects. [Slave](https://www.risk-show.com/podcast/slave/) was really well told: \n\n&gt;Mollena Williams tells the story of how mixing racial tension with erotic role-play can become a very high-risk activity.",
                    "score": 1,
                    "author": "KweenWithAFlag",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Aaaaand I've heard Sex With Emily (Dr. Emily Morse shares her expertise on sex, relationships and everything in between!) and Banging Book Club (ended in 2019, three friends read a book about sex every month) are really open and educational.",
                            "score": 1,
                            "author": "KweenWithAFlag"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ew",
            "score": -3,
            "author": "Effyouredditcrap",
            "replies": [
                {
                    "level": 1,
                    "comment": "Each to their own. No need to be rude.",
                    "score": 2,
                    "author": "KweenWithAFlag"
                }
            ]
        }
    ]
}