{
    "id": "1416s3a",
    "score": 8,
    "title": "Weekly General Discussion &amp; FAQ Thread - June 05, 2023",
    "author": "AutoModerator",
    "date": 1685952016.0,
    "url": "https://www.reddit.com/r/podcasts/comments/1416s3a",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/r/podcasts/wiki/faqs1)",
        "https://www.reddit.com/r/podcasts/wiki/podcastsubreddits)."
    ],
    "postText": " Please use this thread to share podcasts you're currently listening to, to ask for recommendations, **give critiques and complaints in a civil manner**, and to chat about general podcast-related things. This is not a thread to promote your podcast **nor is it a place to rant about things about podcasts that annoy you - these comments will be removed.**\n\nAlso, please check out our wiki info pages including [listener FAQs](https://www.reddit.com/r/podcasts/wiki/faqs1) and our [list of other podcasting subs](https://www.reddit.com/r/podcasts/wiki/podcastsubreddits). You might find the answer to your question on one of those pages. If not, please feel free to submit all frequently asked questions (FAQs) here.\n\nIndividual FAQ posts will be removed and users will be directed to post their question here in this thread. Be as specific as possible - \"looking for a new podcast\" is a bit broad.\n\nIf you are helping / answering a question, be polite and not condescending. People are here to find out information.\n\nPlease report any posts or replies that don't follow these rules. Thank you all!",
    "comments": [
        {
            "level": 0,
            "comment": "Is the sub doing anything to protest against reddit's new API policy?",
            "score": 6,
            "author": "Living_Dummy678"
        },
        {
            "level": 0,
            "comment": "Is the sub planning on doing anything for this?\n\nhttps://www.reddit.com/r/Save3rdPartyApps/comments/13yh0jf/dont_let_reddit_kill_3rd_party_apps/",
            "score": 5,
            "author": "truedufis21"
        }
    ]
}