{
    "id": "142cnuq",
    "score": 13,
    "title": "Podcasts with unsettling stories that DON’T focus on paranormal things?",
    "author": "AndyJaeven",
    "date": 1686050202.0,
    "url": "https://www.reddit.com/r/podcasts/comments/142cnuq",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m looking for a new podcast to listen to at work. I quite enjoy ones where a narrator reads stories about scary/unsettling/etc. stuff that aren’t entirely focused around typical paranormal stuff like demons and ghosts but instead more “science” based. I don’t mean strictly non-fiction stuff, more that it COULD happen in real life or that I can imagine myself as the character in the story if that makes sense. Basically science fiction stuff. \n\nSome good examples of other podcast that show what I mean are: SCP Foundation, The Noclip Podcast, and the ‘Let’s Read’ podcast\n\nAny suggestions are greatly appreciated. Thank you in advance.",
    "comments": [
        {
            "level": 0,
            "comment": "This Is Actually Happening",
            "score": 11,
            "author": "nutellatime",
            "replies": [
                {
                    "level": 1,
                    "comment": "Came here to recommend this",
                    "score": 1,
                    "author": "knows_ur_real_name"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kinda in a similar vein- \"what was that like\" is a podcast where people who went through or did something are interviewed. It's often about life or death situations- being robbed, losing an arm, animal attacks, plane crashes, etc.\n\nNow that I'm thinking about it, there's a pretty popular podcast about animal attacks. \"tooth &amp; claw\"",
            "score": 9,
            "author": "Sir-Mocks-A-Lot"
        },
        {
            "level": 0,
            "comment": "Let’s Not Meet",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Cautionary tales - some episodes are pretty unsettling...",
            "score": 3,
            "author": "termanatorx"
        },
        {
            "level": 0,
            "comment": "Youtube, Scary Interesting",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Lore is a very good one that might fit what you're looking for.",
            "score": 1,
            "author": "Bigman61"
        },
        {
            "level": 0,
            "comment": "Check out Campfire: Tales of the Strange and Unsettling (Rank 78/100) and Deeply Unsettling (Rank 1/100) or Unsettled: Journeys in Truth and Conciliation (Rank 25/100)",
            "score": 1,
            "author": "Initial_Penalty_601"
        }
    ]
}