{
    "id": "142z81q",
    "score": 18,
    "title": "Podcasts about WRITING science fiction?",
    "author": "DoubleDeadline",
    "date": 1686100567.0,
    "url": "https://www.reddit.com/r/podcasts/comments/142z81q",
    "media_urls": [],
    "other_urls": [],
    "postText": "I just want a hard sci-fi writing podcast. But google has utterly failed me.\n\nI can't find any writing podcasts that are ONLY about writing science fiction. I'm specifically looking for a podcast about writing HARD science fiction. So, no FTL, no artificial gravity, no reactionless drives, no violating the laws of physics. Just a podcast about science and fiction and how the two relate. Something like the Artifexian youtube channel, about science based world-building and exploration of social issues that result from specific technologies that are possible in our near future. Artifexian has a podcast, yes, but one of the two hosts HATES hard science fiction, and likes fantasy exclusively. I am trying to find a podcast ONLY about hard science fiction writing, but all I can find are podcasts reading science fiction, sci-fi audio dramas, or writer podcasts full of people who HATE hard sci-fi or constantly talk about fantasy.\n\nI just want a hard sci-fi writing podcast. Can anyone please help me?",
    "comments": [
        {
            "level": 0,
            "comment": "Not a podcast, but the YouTube channel by Isaac Arthur goes deep into the hard scifi topics. It's basically a podcast, the visuals are not really necessary to follow. Maybe it's possible to somehow just listen to them.",
            "score": 1,
            "author": "PoshCushions"
        },
        {
            "level": 0,
            "comment": "I would like to know this as well!  \n\nIf you’re a hard sci fi lover, have you read the expanse?",
            "score": 1,
            "author": "Leonardo_DiCapriSun_"
        },
        {
            "level": 0,
            "comment": "Writing Excuses, which was started by sci fi writers. “Fifteen minutes long, because you’re in a hurry, and we’re not that smart.”\n\nStarted by folks like Brandon Sanderson and Mary Kowal Robinette. MKR is still there, with others now.",
            "score": 1,
            "author": "Khabita"
        }
    ]
}