{
    "id": "1453ihm",
    "score": 253,
    "title": "Scamanda",
    "author": "Iamseeinthebsnow",
    "date": 1686312583.0,
    "url": "https://www.reddit.com/r/podcasts/comments/1453ihm",
    "media_urls": [],
    "other_urls": [],
    "postText": "I rarely post here but this podcast is so good that I was trying to find a place to listen ahead. I just wanted to throw that out there to anybody who enjoys investigative journalism podcast series. I recommend this, it's better a very long time since I've actually went out of my way to make sure I catch the next episode. It is really so good. If anyone can recommend anything in the meantime similar or any investigative journalism I may not have caught, that would be great. Highly recommend but it's only every Monday.\n\n\nEdit to add I believe that I found the recommendation here and if I did thank you so much to that person!",
    "comments": [
        {
            "level": 0,
            "comment": "Bonus: Scamanda Pod gives us all a reason to love Mondays.",
            "score": 46,
            "author": "AwfullyAmerican",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's been a really long time since I found one that I really was into I thought it was turning into like movies, real hard to find a good movie these days. But this one gives me hope again",
                    "score": 16,
                    "author": "Iamseeinthebsnow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I listen to it on Monday morning at my desk. Monday mornings are better now.\n\nThe other podcast I've been listening to is The trial of Lucy letby.\n\nIt doesn't end here and Something was wrong are two others I have enjoyed some of, but not all.",
                            "score": 9,
                            "author": "Mispict",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It takes me about an hour to get to work and I work from home on Mondays, so as hard as it is I always listen to it on Tuesdays on the way to the office. But to be honest I couldn't wait last week lmao",
                                    "score": 1,
                                    "author": "Iamseeinthebsnow"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You’ll really like Believe in magic.",
                            "score": 9,
                            "author": "ams3000",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I recently stayed up until 4am binging Believe In Magic, but what a wild ride that got extremely dark, cannot recommend enough!",
                                    "score": 5,
                                    "author": "aspiringpigcake"
                                },
                                {
                                    "level": 3,
                                    "comment": "Ty!!!!",
                                    "score": 1,
                                    "author": "Iamseeinthebsnow"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I wish I could up vote this am infinite amount of times.",
                    "score": 6,
                    "author": "its_edamame"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There are some threads about Scamanda over on r/truecrimepodcasts with suggestions for other podcasts. This is my favorite genre of TC. \n\nYou’ll like Sympathy Pains\n\nNobody Should Believe and Believe in Magic are heavier pods about Munchausen.\n\nAnd if you’ve not listened to Pretend: The Stalker — fasten your seatbelt.",
            "score": 36,
            "author": "scorpioid_cyme",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sympathy pains had me screaming! It just gets wilder and wilder every episode.",
                    "score": 10,
                    "author": "ClearHelp9370",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "She hasn’t been the subject of a podcast but check out the 20/20 episode The Cancer Bride (pretty sure that is the name of the episode).\n\nI can’t get enough of people faking cancer.\n\nThere is an episode of Missing Pages where the scam artist’s back is against the wall and her last ditch attempt to explain why her Italian writing seminar isn’t going to happen is because she can’t walk on cobblestones because she has “ankle cancer.” I know that is a spoiler but it’s really a footnote (so to speak, haha).\n\nI love this stuff.",
                            "score": 4,
                            "author": "scorpioid_cyme",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m obsessed with them too! I don’t know why haha. Maybe because they deadass will just say “ankle cancer” and expect people to believe them 😭\n\nLike, the audacity and complete disregard for social norms is insane to me. \n\nThanks for the recommendations, I definitely will be watching.",
                                    "score": 7,
                                    "author": "ClearHelp9370",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Argh, I wrote a great reply to you but looks like it didn't stick. I'll just hit the high points ...\n\nI think for me the fact that someone would use one of the worst things that could happen to someone (seriously, fuck cancer) as a tool to manipulate others is such a pure distillation of lack of empathy, I am apparently endlessly fascinated by it.\n\nAlso, I'm getting old and there is so much catharsis in this global stage for people who are just full of bullshit. The number of compulsive liars I've dealt with over the years, without much recourse, I get some kind of justice, even if it's by proxy.",
                                            "score": 5,
                                            "author": "scorpioid_cyme",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That’s a great point about the utter lack of empathy— like I think the way we as a society understand that quality is that it manifests in physically or verbally attacking other people. But  illness fakers sort of turn that inside out and the harm to others is indirect and hard to quantify. But it is harmful. \n\nI… actually have an illness faker / possible factitious person in my family and no one will call her out (including me) because of the drama and bullshit that would ensue. Probably will never happen. So seeing these people have to publicly answer for draining the energy out of everyone who cares about them is definitely cathartic. \n\nThere’s also the schadenfreude of it all!",
                                                    "score": 6,
                                                    "author": "ClearHelp9370"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "👍 Sorry you're post didn't stick  but this one is just as good. I am a little bit older too I don't know what you mean by older. But I completely feel you here great posting.",
                                                    "score": 2,
                                                    "author": "Iamseeinthebsnow"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I saw some crazy stuff about identifying as whatever you want. This chick was identifying as disabled you know just to collect money. Then I saw something else about another chick who literally cut her eyes out so she could be blind. And cashing in on that if I'm not mistaken,  I don't remember exactly.",
                                            "score": 1,
                                            "author": "Iamseeinthebsnow"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The number of scammers out there holy smokes. Reminds me of tiktok and the number of grifters",
                                    "score": 2,
                                    "author": "Iamseeinthebsnow",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s awful. You might like the podcast “The Perfect Scam” as well.\n\nI hope these podcasts have a chilling affect on scammers because people will learn how to spot the signs. \n\nSomething like this is outrageous and hurtful but there are people whose lives are ruined by scammers. \n\nOther podcasts: Filthy Ritual; A Very British Cult",
                                            "score": 2,
                                            "author": "scorpioid_cyme",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ty!!",
                                                    "score": 2,
                                                    "author": "Iamseeinthebsnow"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Ankle cancer has me roaring 😂",
                                    "score": 2,
                                    "author": "jamiekynnminer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Would you look at that, all of the words in your comment are in alphabetical order.\n\nI have checked 1,573,254,338 comments, and only 297,547 of them were in alphabetical order.",
                                            "score": 2,
                                            "author": "alphabet_order_bot"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It was hilarious. Really recommend the episode, it’s Anna March. Won’t spoil the reaction but it had me laughing even harder.",
                                            "score": 1,
                                            "author": "scorpioid_cyme"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Also the ever evolving truth season 1",
                    "score": 7,
                    "author": "capercrohnie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "OMG, you are so my hero right now.",
                            "score": 3,
                            "author": "scorpioid_cyme",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They also have epsidoes here and there in the later seasons but season one is exclusively Jessica Cornell also a cancer faker and scammer in many ways",
                                    "score": 2,
                                    "author": "capercrohnie",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The number of them being listed as in the number of scammers is gross. I can't believe how many people are out here doing this",
                                            "score": 1,
                                            "author": "Iamseeinthebsnow"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ty!! I heard this quite a bit",
                            "score": 1,
                            "author": "Iamseeinthebsnow"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Bless you for this!  I just discovered s Amanda this week and devoured it, not realizing it was still airing new episodes!",
                    "score": 7,
                    "author": "young_coastie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah! Me too! Episode 5 ended and I was waiting for the next one to start and then I saw there were no more and was so disappointed. 😩",
                            "score": 3,
                            "author": "whatever7131"
                        },
                        {
                            "level": 2,
                            "comment": "That’s the worse! Sympathy Pains will hopefully scratch that itch",
                            "score": 2,
                            "author": "scorpioid_cyme",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I got to save this one right now",
                                    "score": 3,
                                    "author": "Iamseeinthebsnow"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I know right how disappointing was that I did the same thing. I'm like what I got to wait a week now?",
                            "score": 1,
                            "author": "Iamseeinthebsnow"
                        },
                        {
                            "level": 2,
                            "comment": "Omg same!!!",
                            "score": 1,
                            "author": "Xenawarriorx0x"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "All excellent recommendations",
                    "score": 3,
                    "author": "mediocreartichoker"
                },
                {
                    "level": 1,
                    "comment": "Great thank you so much. So the last one that you said the pretend one about the stalker, can you just DM me that someone else said that too I'm having a hell of a time finding that one",
                    "score": 2,
                    "author": "Iamseeinthebsnow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I believe it is okay to post web links in this sub. I’m not sure what app you use to listen. \n\nhttps://pretendradio.org/episodes/",
                            "score": 3,
                            "author": "scorpioid_cyme",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you so much it'll redirect me to my own app.",
                                    "score": 2,
                                    "author": "Iamseeinthebsnow",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I got it thank you finally I have the right one",
                                            "score": 1,
                                            "author": "Iamseeinthebsnow"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I also just followed somebody's link to an actual subreddit for that podcast alone",
                    "score": 1,
                    "author": "Iamseeinthebsnow"
                },
                {
                    "level": 1,
                    "comment": "I think I already replied to you I think I told you the trouble I'm having with this pretend one. I keep thinking I find it but then you say the stalker I don't see that I just need to see the cover art or something or the link because I keep asking. I'm having a struggle finding it",
                    "score": 1,
                    "author": "Iamseeinthebsnow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s season 12 of the “Pretend” podcast. The whole season is called “The Stalker”.",
                            "score": 1,
                            "author": "Affectionate-Big3676"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This podcast is so well done! The voice of the actress who reads Amanda’s blog posts makes me SO annoyed at Amanda so she’s doing a great job. 🤣",
            "score": 43,
            "author": "zero_and_dug",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes! She’s so good, really nails the false modesty",
                    "score": 13,
                    "author": "off-shoulder"
                },
                {
                    "level": 1,
                    "comment": "Oh my god I’ve been saying exactly this, her voice makes me hate her so much 😂 she’s really got the tone spot on",
                    "score": 8,
                    "author": "spy-on-me"
                },
                {
                    "level": 1,
                    "comment": "So smug, perfect.",
                    "score": 8,
                    "author": "ididitforcheese",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As annoying as it is, it makes me think that that's exactly how she is",
                            "score": 5,
                            "author": "Iamseeinthebsnow"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I LOVE her too!",
                    "score": 8,
                    "author": "Putrid_Sherbert_8569"
                },
                {
                    "level": 1,
                    "comment": "It's too good. I could barely handle it.",
                    "score": 7,
                    "author": "Odd_Requirement_4933"
                },
                {
                    "level": 1,
                    "comment": "Ah yes and the typing is definitely there to constantly annoy.",
                    "score": 3,
                    "author": "ams3000"
                },
                {
                    "level": 1,
                    "comment": "Lmao! Me too but I picture that's what she really sounds like from what I know about her character so far loll how badly I want to look her up to hear her real voice and see her, but it'll give me spoilers",
                    "score": 1,
                    "author": "Iamseeinthebsnow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I also found the rec here! I'm so hooked",
            "score": 13,
            "author": "newpenzance"
        },
        {
            "level": 0,
            "comment": "Okay, with a review like this, Scamanda is absolutely being moved up my list! Thanks! \n\nFrom the description, it sounds like it has similar themes to \"Sympathy Pains\". Highly recommend.",
            "score": 12,
            "author": "KweenWithAFlag",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep it's typically not my avenue based on the description. So I went with the recommendation here, definitely not wrong. Like I'm disappointed that I have to wait till the next Monday",
                    "score": 2,
                    "author": "Iamseeinthebsnow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This Podcast is crazy.  \n\nI just know in a few years it will turn into a full HBO documentary.",
            "score": 12,
            "author": "DeeDeeW1313",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm really shocked I haven't heard more traction on it",
                    "score": 1,
                    "author": "Iamseeinthebsnow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m seconding this! I haven’t had an audio only podcast I have looked forward to more in YEARS",
            "score": 11,
            "author": "marytoddlinkinbio"
        },
        {
            "level": 0,
            "comment": "I am adding my name to the list. I too wish we could listen early. Haven’t been this excited about a podcast in a minute.",
            "score": 11,
            "author": "Own_Advantage_8253",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah it's tough it's a tough world. Tough to find good music tough to find good movies, even books, I feel like everything is just so easily available that anybody can do it and there's no real substance to it",
                    "score": 1,
                    "author": "Iamseeinthebsnow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is one of best podcasts I have heard in years, I look forward to each episode coming out and I’m truly invested in the story.",
            "score": 11,
            "author": "Poodlepied",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same! I find it hard to find pods with the storytelling style that I like..this one nails it!",
                    "score": 3,
                    "author": "ScarlettLM"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I literally can’t even lie about me or someone in my family being sick (like with a cold) to get a day off from work. Too worried about the karma.",
            "score": 10,
            "author": "marvelous_much",
            "replies": [
                {
                    "level": 1,
                    "comment": "The karma gods aren't going to be upset with you for using the sick time you're entitled to. Your boss can afford it and you deserve to enjoy your life.",
                    "score": 6,
                    "author": "PoopOnYouGuy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "LOUDER",
                            "score": 3,
                            "author": "Iamseeinthebsnow"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You earn that time, you take that time. You don't even say why. You say I can't work today, I'm ill. And then you say nothing more. ❤️",
                    "score": 2,
                    "author": "Iamseeinthebsnow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes! It was on Reddit that I found out about Scamanda. It is great!",
            "score": 9,
            "author": "JustNKayce"
        },
        {
            "level": 0,
            "comment": "The last episode talked about her trips to NYC for “medical care.” It makes me so angry that she was using people’s donations to live it up in the Big Apple. 🤬",
            "score": 9,
            "author": "Cultural_Spend_5391",
            "replies": [
                {
                    "level": 1,
                    "comment": "Frfr. For the first time ever I got to see.. blah blah blah. That did burn me up man. Lol.  Like get your eyes off that Rockefeller tree or whatever the hell Sorry I don't know what it's called. You don't deserve it.",
                    "score": 2,
                    "author": "Iamseeinthebsnow"
                },
                {
                    "level": 1,
                    "comment": "I’ve never heard anyone call it the big apple in real life this gave me a chuckle 😁",
                    "score": 2,
                    "author": "Yoma73",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Showing my age. lol",
                            "score": 1,
                            "author": "Cultural_Spend_5391",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m 40! Usually that makes me the eldest on any given Reddit threads 👵🏻",
                                    "score": 1,
                                    "author": "Yoma73",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lol, I’ve got 10 years on you",
                                            "score": 1,
                                            "author": "Cultural_Spend_5391"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[“What a Creep” podcast interview with “Scamanda” journalist Charlie Webster](https://podcasts.apple.com/us/podcast/what-a-creep/id1460298336?i=1000615463020) \n\nThis interview with Scamanda podcast host/journalist is a lovely listen if you can’t get enough Scamanda content in your life. I found it last weekend while impatiently waiting for the next Scamanda episode drop on Monday.",
            "score": 8,
            "author": "wave_of_illusion",
            "replies": [
                {
                    "level": 1,
                    "comment": "Awesome thank you so much for this!",
                    "score": 1,
                    "author": "Iamseeinthebsnow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Trying to take these screenshots of the names and add to my notepad as quickly as possible",
                            "score": 1,
                            "author": "Iamseeinthebsnow"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They put crack in this show fr 😭😭 it's so addictive",
            "score": 7,
            "author": "No-Interaction1494",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hahahah love this comment",
                    "score": 2,
                    "author": "Iamseeinthebsnow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What's it about? All my description shows is \"Amanda is a wife. A mother. A blogger. A Christian.\"",
            "score": 7,
            "author": "effenlegend",
            "replies": [
                {
                    "level": 1,
                    "comment": "Amanda is a wife. A mother. A blogger. A Christian.\nA charming, beautiful, bubbly, young woman who lives life to the fullest.\nBut Amanda is dying, with a secret she doesn’t want anyone to know.\nShe starts a blog detailing her cancer journey, and becomes an inspiration, touching and captivating her local community as well as followers all over the world. \nUntil one day investigative producer Nancy gets an anonymous tip telling her to look at Amanda’s blog, setting Nancy on an unimaginable road to uncover Amanda’s secret. \nAward winning journalist Charlie Webster explores this unbelievable and bizarre, but all-too-real tale, of a woman from San Jose, California whose secret ripped a family apart and left a community in shock.  \nScamanda is the true story of a woman whose own words held the key to her secret. ",
                    "score": 13,
                    "author": "RHOWC",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hey, thanks for posting this!",
                            "score": 6,
                            "author": "effenlegend",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You’re welcome! 😊 I started listening to the podcast right after I looked it up and posted this, and I’m on episode 2 now. It’s really good, so far!",
                                    "score": 6,
                                    "author": "RHOWC"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thank you!!! I didn't get back here on time to answer.",
                            "score": 2,
                            "author": "Iamseeinthebsnow"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm sorry I didn't see your question quick enough but people got it covered here it's really good. Give it a listen it's not a typical one I would listen to either but as soon as I started I couldn't stop. I mean based on the description. I just took the recommendation from here.",
                    "score": 2,
                    "author": "Iamseeinthebsnow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think I'm on the 4th episode :)  It is good.  I'd like to find more like this.",
                            "score": 2,
                            "author": "effenlegend"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Come join r/scamandapodcast because it's an amazing subreddit with lots of behind-the-scenes info! :)",
            "score": 8,
            "author": "calamitytamer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great!!!! Ty!!!",
                    "score": 1,
                    "author": "Iamseeinthebsnow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Scamanda has been shocking and compelling. Calling her a sociopath doesn’t even begin! 😳 \n\nRecently, I was very moved by Wild Child, a two-parter on The Secret Room. The harrowing experience of a teenage girl who was sent to “Wilderness Therapy.” \n\nThat, in turn, led me to a seven part series (more in the investigative journalism genre) on The Opportunist about Gayle Palmer, a woman who operated a Wilderness Therapy program in Utah where a young girl died a terrible death just nine days into the program. \n\nThe troubled teen industry is horrifying. Hundreds of children have been tortured, suffered life-long trauma, many of them not surviving. But very little has been done to stop it over the last 30 years. \n\nNeither are an easy listen. Both podcasts are gut-wrenching and brought me to tears. But it’s an important topic. Most of these programs are nothing but very expensive, sanctioned child abuse.",
            "score": 7,
            "author": "shantyirish",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just finished listening to the Opportunist on Gayle Palmer too. The way those kids were treated was horrifying. I kept thinking what was the point of hiking for miles in the desert in the summer? And without enough water with guides with no medical training. The scariest part is that it’s still a thing, specially in Utah.",
                    "score": 4,
                    "author": "vanessabh79",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Behavior modification through starvation, exhaustion and physical and psychological torture. How can it even be legal? The Troubled Teen Industry is absolutely shameful yet it continues. Utah is a “parent’s rights state,” I believe, giving parents all decision making power over minor children. I think there is a cultural aspect in Utah that also enables these kinds of programs. (This may be the same in North Carolina where these programs also abound.) Reading the posts from survivors in the subreddit r/troubledteens is just heartbreaking.",
                            "score": 3,
                            "author": "shantyirish",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s true! Torturing teens into compliance, then gaslighting them to believing they deserved it and that it worked!",
                                    "score": 4,
                                    "author": "vanessabh79"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Are these little kids? I can't do it. Anything that has to do with torturing any small children I can't walk into. So as weirdest this is older children as in teens late teens okay it's a little bit easier but I can't do anything with small children..",
                            "score": 1,
                            "author": "Iamseeinthebsnow",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I am a horror movie fanatic as in tattoos collectibles, and I draw the line even there at certain ones I don't know why I just can't.",
                                    "score": 1,
                                    "author": "Iamseeinthebsnow"
                                },
                                {
                                    "level": 3,
                                    "comment": "They’re teenagers, considered “problem youths” by their parents or their church. Sometimes their big crime was getting caught smoking pot.",
                                    "score": 1,
                                    "author": "vanessabh79"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wild Child was great.  Other stories on the Secret Room are excellent too.  I wasn’t impressed with the first several episodes but when Ben Hamm became the sole host it took off and he does an outstanding job.",
                    "score": 5,
                    "author": "Ohwhatagoose",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So agree. Ben respectfully allows the guest to really tell their story. I appreciate his thoughtful, empathetic (only very occasional) interjection. He really is, as you said, outstanding.",
                            "score": 3,
                            "author": "shantyirish"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Always been really really into true crime, but I like investigative journalism true crime, however since this one I've been moving into other areas. Depending if I can handle it. I can't handle anything about children. So before I listen to this one is it in any way heart-wrenching towards children?",
                    "score": 2,
                    "author": "Iamseeinthebsnow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I completely understand. Yes, you may want to avoid it. Though podcasts often make me emotional, these truly made me cry. What the children endured is described in graphic detail (without being exploitive). Even listening to the stories told by now adults at the end of the Gayle Palmer series — I'm still thinking about them. The trauma they endured is never-ending.😢",
                            "score": 1,
                            "author": "shantyirish"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I finished that one as well. I'm utterly stunned that this woman isn't in prison with her \"counselors\" for abuse and murder",
                    "score": 1,
                    "author": "jamiekynnminer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Everything here is good, but I'll also add:\n\nThe Missionary is a 19 year old Christian girlie (complete with blog posts) who goes to Uganda to save children and may have pretended to be a medical professional. It's really good.\n\nSweet Bobby is an insane catfish with medical issues, and that's just the first episode. It is a twisty one.",
            "score": 7,
            "author": "SeasickEagle",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ooof, The Missionary is so good even though the story is so shocking.",
                    "score": 5,
                    "author": "KweenWithAFlag"
                },
                {
                    "level": 1,
                    "comment": "Ohhhhhhh ty that one sounds good! I was always really into true crime but they're becoming redundant. Thank you so much",
                    "score": 2,
                    "author": "Iamseeinthebsnow"
                },
                {
                    "level": 1,
                    "comment": "Sweet Bobby I saved I started the first episode, and I'm not sure why I didn't go any farther yet",
                    "score": 2,
                    "author": "Iamseeinthebsnow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I just listened to Sweet Bobby and honestly thought it was a little boring. I'm listening to Scamanda now and am also obsessed, the production is excellent.  I'm excited to check out the other recs suggested on this thread.",
                            "score": 1,
                            "author": "jdq31"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've been listening as well and I just feel more rage every episode. I've watched young women die of cancer, including my mom and my cousin. The fact that anyone would fake that for money and popularity not just once but multiple times is enraging.",
            "score": 7,
            "author": "PromptElectronic7086"
        },
        {
            "level": 0,
            "comment": "Ypu should definitely  check out the Stalker series from the Pretend Podcast, it's  kind of similar.. and totally nuts!",
            "score": 5,
            "author": "bonnet_ganker",
            "replies": [
                {
                    "level": 1,
                    "comment": "I finally got it!!!",
                    "score": 2,
                    "author": "Iamseeinthebsnow"
                },
                {
                    "level": 1,
                    "comment": "Okay You're the fourth person to say that and I can't find it I've tried everything I've asked for a couple people to DM it to me but I don't have it yet just a link of some sort",
                    "score": 1,
                    "author": "Iamseeinthebsnow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s season 12 https://podcasts.apple.com/us/podcast/pretend-a-true-crime-podcast-about-con-artists/id1245307962",
                            "score": 1,
                            "author": "vogueing"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I need to second everyone's recommendation of The Stalker episode of the the Pretend podcast. It's an insane ride and you can see the host at times get sucked in to their bullsh;t. It's a fascinating look at how these people's mind's work and how others can get sucked into it. I need an second season about it. The whole family is just an awful lot. And if 'audacity' was a walking human being, it would be the mother.",
            "score": 4,
            "author": "finntastic74",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's a really popular recommendation so I think people are calling it two different things because they must do different seasons right? At first I couldn't find it and then I think I found it and then I heard something about the stalker season which I don't see. So I've asked a couple people to send me the DM or a picture of the cover art I want to make sure I'm in the right place",
                    "score": 1,
                    "author": "Iamseeinthebsnow"
                },
                {
                    "level": 1,
                    "comment": "Got it!!! I think for real this time",
                    "score": 1,
                    "author": "Iamseeinthebsnow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just started it last night &amp; stayed up til 2:30 am bc I COULD NOT STOP LISTENING! I saw the recommendation on here as well.",
            "score": 5,
            "author": "Careless_Freedom_868",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know and once a month I'll usually Google like the top podcasts of the month or whatever to see what's going on and I am shocked that I haven't heard more about this one",
                    "score": 2,
                    "author": "Iamseeinthebsnow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I tried and I just can't get into this mommycast.",
            "score": 5,
            "author": "PoopOnYouGuy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lots of repeating in the first three episodes. Intentionally dragged out.  The latest episode was more interesting but it's not an all timer by any means.",
                    "score": 3,
                    "author": "CreativeWaves"
                },
                {
                    "level": 1,
                    "comment": "I feel like that sometimes everybody likes something and then I try it and I'm just not getting it. Totally appreciate the different opinion. What's one of your favorite podcasts I'd find it interesting to see What kind of podcast really grasps you. This isn't my typical kind of listen either which is why it's also so odd that I'm so addicted to it. So good",
                    "score": 2,
                    "author": "Iamseeinthebsnow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "She really does, so smug. That actress nailed it.",
                    "score": 3,
                    "author": "ididitforcheese"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m hooked on scamanda right now!! So good",
            "score": 5,
            "author": "Aggressive_Pie_9103"
        },
        {
            "level": 0,
            "comment": "I just discovered this podcast and binged them all in a day. It makes me look forward to Mondays!",
            "score": 4,
            "author": "inumaw"
        },
        {
            "level": 0,
            "comment": "I've been listening to Your Own Backyard. Great investigative journalism.",
            "score": 10,
            "author": "paperpenises",
            "replies": [
                {
                    "level": 1,
                    "comment": "OUTSTANDING podcast.",
                    "score": 6,
                    "author": "thewickednoodle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm at episode 7 of 8, where it starts wrapping up. &gt;!I know that Paul Flores gets convicted of the murder, and at the time when these episodes came out, Paul was free. So I'm really excited to find out what happened to start a new trial which I'm sure will be covered. !&lt;",
                            "score": 5,
                            "author": "paperpenises",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I didn’t know what happened when I listened to it just a few months ago, and I really had to force myself not to look it up!",
                                    "score": 3,
                                    "author": "thewickednoodle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I just had to see what they looked like since I picture podcasts in my head like a movie. I couldn't resist!",
                                            "score": 4,
                                            "author": "paperpenises",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I didn’t look until after and they were nothing like I pictured. I probably should have done what you did!",
                                                    "score": 3,
                                                    "author": "thewickednoodle"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I listened to that one as it was released, since I had a friend who lived in SLO at the time, and I still remember the excitement of seeing a new episode pop up! Chris Lambert seems like just a wonderful person and an excellent investigative journalist. Kind of turned me off for a lot of true crime based off of how respectfully he handled everything.",
                    "score": 3,
                    "author": "SpiffyPup"
                },
                {
                    "level": 1,
                    "comment": "Is it still the same case or do they do different cases",
                    "score": 1,
                    "author": "Iamseeinthebsnow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's one case.",
                            "score": 1,
                            "author": "paperpenises"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I like it a lot. I wish it moved a little faster. They are really stretching this thing out.",
            "score": 9,
            "author": "mayor0fsimplet0n"
        },
        {
            "level": 0,
            "comment": "Ooh thank you! Just added to my feed. It looks good!",
            "score": 3,
            "author": "termanatorx"
        },
        {
            "level": 0,
            "comment": "Thanks for this! I’ve been trying to find a new binge since I finished Who the fuck is Hamish.",
            "score": 3,
            "author": "swarleyknope",
            "replies": [
                {
                    "level": 1,
                    "comment": "I read your post wrong, and I thought you were asking that question and I was going to say I don't know who the fuck that is. But what is that about?",
                    "score": 2,
                    "author": "Iamseeinthebsnow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s an Australian podcast about a con artist who ends up taking a lot of individual people’s money while forming some really close relationships with them. \n\nIt’s super “WTF?! “ but also makes you really sad for the people he exploited. \n\n(IMHO it doesn’t feel as icky as some other crime podcasts, because it’s also kind of empowering for the victims to share their stories since it makes other victims recognize that it could really happen to anyone and they shouldn’t be blaming themselves or ashamed for falling for it). \n\nI got the recommendation from this sub too!",
                            "score": 1,
                            "author": "swarleyknope"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank for the tip OP! Looks fascinating. Subscribed!",
            "score": 3,
            "author": "bafflingboondoggle",
            "replies": [
                {
                    "level": 1,
                    "comment": "It came from here originally the recommendation, I'm shocked to haven't seen it places. I google all the time like what's the newest most listened podcast or the newest top rated just to try to get ideas and I am shocked I haven't seen it anywhere else but here",
                    "score": 2,
                    "author": "Iamseeinthebsnow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thanks, just binged up to date.",
            "score": 3,
            "author": "Autodidact2"
        },
        {
            "level": 0,
            "comment": "Scamanda is really good. I see most of the other similar ones I would recommend on here already but I’ll throw in *Sweet Bobby* for a twist. Lol It’s a different type of con story, the catfish kind, but a good one. …meaning absurdly terrible! \n\nI’ll second *Believe in Magic* - very well done, and *No One Should Believe Me*. Just finished this last one. it’s different, hosted by sister of someone w/ munchausen by proxy, mixes in interviews w/ abusers’ families and one brief interview w/ someone that actually has munchausen and is in recovery. (?) (not sure what you call it!)\n\nScamanda I think is malingering vs munchausen, but I similar in the cancer con. \n\nAlso *Suffer the Little Children* has a four-part series on Munch by Proxy but FYI it’s darker/more serious in tone from what I remember. Not that the others aren’t extremely serious, but more of focused on the abuse, if that makes sense.",
            "score": 3,
            "author": "Real_Foundation_7428",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great thank you so much. This is a great post. I took those names down too",
                    "score": 1,
                    "author": "Iamseeinthebsnow"
                },
                {
                    "level": 1,
                    "comment": "I work in psychiatry so the term malingering just popped out at me. I think she's more like a money-grubbing lying greedy scammer. The malingers we have in psychiatry are more of the types that I just want to place to stay for the night haha. But the term brought me to work. On a Sunday. Lol",
                    "score": 1,
                    "author": "Iamseeinthebsnow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Scamanda is definitely going to be made into a series or lifetime movie.",
            "score": 3,
            "author": "T2ThaSki"
        },
        {
            "level": 0,
            "comment": "I love it so much. I don’t even want to google what she looks like because I don’t want to spoil the ending for myself",
            "score": 3,
            "author": "Feeling_Excitement90",
            "replies": [
                {
                    "level": 1,
                    "comment": "Know what you mean because I googled it to see if there was like a platform or a patreon for it and an article came up immediately and I had to close it I was like oh no no it's going to ruin it",
                    "score": 1,
                    "author": "Iamseeinthebsnow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There is a subreddit that has lots of her actual blogs and photos.  You can find it if you do a search on this topic.",
                            "score": 1,
                            "author": "Euphoric-Ad4045"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve been listening through this straight through since I read your recommendation 😄\n\n(I keep thinking about how excited her (former) friends probably felt to get a chance to totally dish on her shenanigans 😂)",
            "score": 2,
            "author": "swarleyknope",
            "replies": [
                {
                    "level": 1,
                    "comment": "I totally got the recommendation here. I will always Google what are the newest most listed podcast or top listened podcast of the month just to try to find something so I came over here to look and it's completely shocking that this is the only place I saw the recommendation",
                    "score": 2,
                    "author": "Iamseeinthebsnow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’d been trying to stay off Reddit &amp; forgot about this sub! But now I am on third binge based on suggestions in the replies to this post alone (while waiting for tomorrow’s episode of Scamanda😊)",
                            "score": 1,
                            "author": "swarleyknope"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m listening to it now! On episode 3, it’s wild so far!",
            "score": 2,
            "author": "The1983"
        },
        {
            "level": 0,
            "comment": "Here are a few I haven’t seen mentioned that you might like if you haven’t listened already: The Coldest Case in Laramie, Sent Away, White Lies (there are 2 seasons, haven’t listened to season 2 yet), This Land, Will Be Wild",
            "score": 2,
            "author": "KateEffEee",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ty!!",
                    "score": 1,
                    "author": "Iamseeinthebsnow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've started listening to Scamanda but not fully gotten into yet! Will persereve! The Trial of Lucy Lettby is worth a listen, it's very hard hitting due to the nature of her alleged crimes though just to flag.",
            "score": 2,
            "author": "aspacetobelieve",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ty!!!",
                    "score": 1,
                    "author": "Iamseeinthebsnow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you for Posting about this! I was instantly hooked on This podcast. Especially being from the Bay Area, I was like how haven’t I heard of this nut case?!",
            "score": 2,
            "author": "bludreamsnlaserbeams",
            "replies": [
                {
                    "level": 1,
                    "comment": "I got it from here. It's shocking that I'm always googling like the newest most listen podcast or the best current podcast or whatever I can do to find something good to listen to. It's shocking that it's not anywhere else but here. I'm wondering why it has n't gotten more traction",
                    "score": 1,
                    "author": "Iamseeinthebsnow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you so much everybody I didn't expect so many responses so I am like quickly screenshotting the names editing to crop and throwing them in my notepad before I lose them all. You guys are awesome, holy cow so many great recommendations",
            "score": 2,
            "author": "Iamseeinthebsnow"
        },
        {
            "level": 0,
            "comment": "The Opportunist podcast was also really interesting, especially the Sherry Shriner season.",
            "score": 2,
            "author": "dreafea505"
        },
        {
            "level": 0,
            "comment": "Great story and a well done podcast but it is told  in an excruciatingly slow way.",
            "score": 2,
            "author": "pugnacious3333"
        },
        {
            "level": 0,
            "comment": "Seconding this. What a journey this one has been!",
            "score": 3,
            "author": "cavehag"
        },
        {
            "level": 0,
            "comment": "Wild Boys was a binge-worthy pod that had me hooked the same as Scamanda. 🤓",
            "score": 1,
            "author": "dreafea505",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, Wild Boys was good.",
                    "score": 1,
                    "author": "anonymoustu"
                }
            ]
        },
        {
            "level": 0,
            "comment": "We all have different tastes. I found it babbley and akin to super low-brow drama and pure gossip. Not my cuppa.",
            "score": 1,
            "author": "EUblij"
        },
        {
            "level": 0,
            "comment": "I'm loving the transcriptions on Musixmatch.",
            "score": 1,
            "author": "Realistic-Dream-4917"
        },
        {
            "level": 0,
            "comment": "It’s so good !",
            "score": 1,
            "author": "runthehall"
        },
        {
            "level": 0,
            "comment": "Does anyone have a link to her blog?",
            "score": 1,
            "author": "mr_silas"
        },
        {
            "level": 0,
            "comment": "Why is Nancy so freaking annoying though? Almost took me out of it. \n\nAlso the first 4 episodes could have easily been condensed into 2.",
            "score": 1,
            "author": "Inside_Connection881",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thought the same thing. Way too drawn out",
                    "score": 1,
                    "author": "Fast-Description-969"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I really like the story, but the back and forth instead of chronological story is starting to drive me nuts. They’ll mention something in one episode then go back and talk about it again 1 or 2 episodes later. It’s hard to follow the timeline. Anyone else?",
            "score": 1,
            "author": "Illustrious-Drive-86"
        },
        {
            "level": 0,
            "comment": "I just found this podcast today and binged the whole thing. Here is also the subreddit to discuss episodes.    r/Scamandapodcast",
            "score": 1,
            "author": "Texas_Crazy_Curls"
        },
        {
            "level": 0,
            "comment": "Just here to say I really appreciate this podcast. Very well researched and very well produced.  I will be following them for any future shows.  \n\nThis story is something else.",
            "score": 1,
            "author": "theidealbt"
        },
        {
            "level": 0,
            "comment": "This is a very good pod.",
            "score": 1,
            "author": "jamiekynnminer"
        }
    ]
}