{
    "id": "14748fc",
    "score": 4,
    "title": "Looking for podcast recommendations about mysteries/phenomenons?",
    "author": "kronosin",
    "date": 1686514928.0,
    "url": "https://www.reddit.com/r/podcasts/comments/14748fc",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve been searching for podcasts revolving around those but I can’t really find one I like. I like episodes focusing on things like the skinwalker ranch or something like DB Cooper-esque mysteries. TIA!",
    "comments": [
        {
            "level": 0,
            "comment": "* WhatIf Podcast\n* Necronomipod (try the newest ep from today)\n* LastPodcastOnThLeft\n* Nighttime (for Canada stuff)",
            "score": 2,
            "author": "Wydliez",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oddball (about the Betz Sphere)",
                    "score": 1,
                    "author": "Wydliez"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Unbelievable Podcast\n\nThe unbelievers podcast\n\nLast podcast on the left\n\nNecrinomipod\n\nThe why files",
            "score": 1,
            "author": "mesosalpynx"
        },
        {
            "level": 0,
            "comment": "**Last Podcast on the Left** has precisely what you're looking for",
            "score": 1,
            "author": "Lauren_DTT"
        },
        {
            "level": 0,
            "comment": "I feel like this is such an oversaturated topic in podcasts, and it's crazy difficult for me to sift through the hundreds upon hundreds in the attempting-comedy obnoxious multi-presenter style (LPOTL, etc) to find any that I really enjoy.  \n\nSo hijacking this to pick up any recommendations",
            "score": 1,
            "author": "bad_bart",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel the same way, there’s so many podcasts that somewhat “focus” on these things that I’m looking for but I feel as if it’s never quite what I want and/or I can’t get down with the hosts (which I realize there’s rarely ever podcasts that will cover EXACTLY what I’m looking for). Either that or I just don’t have the time/patience to try out the numerous podcasts that touch on a similar topic. I’ve tried LPOTL in the past and it just doesn’t do it for me. I’ve yet to find the time to try out these recommendations so I’m hoping one of them hits. Hope the same happens for you 🫡",
                    "score": 2,
                    "author": "kronosin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Red web",
            "score": 1,
            "author": "xoxobritxoxo"
        }
    ]
}