{
    "id": "147mh08",
    "score": 30,
    "title": "Has Those Conspiracy Guys become more right-wing post-pandemic?",
    "author": "IRE0906",
    "date": 1686571546.0,
    "url": "https://www.reddit.com/r/podcasts/comments/147mh08",
    "media_urls": [],
    "other_urls": [],
    "postText": "Used to listen to TCG and only got back into it recently. Often when listening to newer episodes, I find it surprising that I ever got into it when a lot of the views misalign with my own. \n\nListening to the MLK episode and surprised to hear them speak sympathetically about the BLM movement. It's almost a completely different podcast from later episodes. Is the general consensus that the show became more right-wing in recent years, or is it my imagination?",
    "comments": [
        {
            "level": 0,
            "comment": "I gave up on this show before the pandemic, so I don't know whether Gordo has become more right wing. What put me off was one too many 'Alex Jones was right about some things' about things Alex Jones was *not* right about, and a serious case of the 'just asking questions' about things that have been answered a hundred times before.",
            "score": 50,
            "author": "JasonSuriname",
            "replies": [
                {
                    "level": 1,
                    "comment": "Absolutely this, you've hit the nail on the head. I think the biggest example of this was the cork podcast festival where he began to question climate change (or it may have been the global response to climate change? His point became diluted very quickly) and there happened to be a number of environmental scientists in the audience. About three or four people were able to rebuke his point and he still wouldn't concede. It was a bit of a grating listen.",
                    "score": 18,
                    "author": "IRE0906",
                    "replies": [
                        {
                            "level": 2,
                            "comment": " &gt; It was a bit of a grating listen.\n\nOof, I can't say I've heard that episode/exchange, but I can definitely imagine that it would be unpleasant. Especially given Gordo's insistence on being needlessly vulgar like an edgy teenager.",
                            "score": 3,
                            "author": "JasonSuriname",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, can't say I recommend it as a pleasant listen, but it did cut through the normal echo chamber of the podcast. That and the episode on the 27 club, which descended into an argument with one contributor saying he wouldn't come back on the show again.",
                                    "score": 5,
                                    "author": "IRE0906"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And part of my beef with the idea of \"conspiracy theorists have gotten some things right!\" is that they're looking at the wrong metric.\n\nAlex Jones (and every other theorist) makes a million and a half outlandish claims. \n\nIf your assessing someone's reliability as a source, you can't just look at whether they were right sometimes, but how *often* they were right.\n\nIf you fire enough bullets, you'll eventually hit a bullseye. But I can't tell how likely your *next* shot will be a bullseye unless I know how many times you missed, too.\n\nAnd by definition, conspiracy theorists miss *a lot*.",
                    "score": 4,
                    "author": "slayerx1779"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It was before the pandemic.  Used to listen to every episode but once Paul left the show, it went downhill big time.  Stopped listening for awhile, and then decided to check out an episode right before the 2020 election, in which Gordo said something like it was crunch time and if Q really knew something it was time to share.  That was it for me.  Not worth it to even see what they're doing these days.  Used to be a pretty fun show but damn has it crashed and burned.",
            "score": 5,
            "author": "Syrioforel79"
        },
        {
            "level": 0,
            "comment": "I think Gordo has always been right leaning, not just since the pandemic. Not necessarily his contributors and guests but defo Gordo is for me. Doesn’t really bother me, wouldn’t be of similar views on most things with him. But still enjoy the podcast, he is one entertaining, funny mofo.",
            "score": 11,
            "author": "gortna",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fair point, you're probably right. It doesn't bother me necessarily, even though I'd be a fairly hardcore lefty myself. I've just found it to be a lot more noticeable in more recent episodes. Maybe it's not his views, but that he is a little more antagonistic and argumentative towards his guests in recent years",
                    "score": 3,
                    "author": "IRE0906",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I love how you’re implying that RIGHT learners are “more antagonistic and argumentative” lmao",
                            "score": -5,
                            "author": "Diligent_Worker1018"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Conspiracy theories generally lead people right because they blame things on people or cabals that are really mainly capitalism",
            "score": 5,
            "author": "Klutzy_Housing_9896"
        },
        {
            "level": 0,
            "comment": "Wait hollup... Speaking sympathetically about BLM is rightwing? \n\nLegit confused here not trying to start shit.",
            "score": 5,
            "author": "pixelsinner",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry, I might've phrased that strangely. I mean I thought the newer episodes are more right-wing, but in the older episodes they spoke sympathetically about BLM, implying they used to be more left-wing.",
                    "score": 6,
                    "author": "IRE0906",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oooh ok yes that makes sense now. You did have me scratching my head for a sec! \n\nI think (unfortunately) many people got even more polarized following COVID. I used to love anything and everything conspiracy related, as a guilty pleasure entertainment of sorts. Now I find it difficult to consume it because too many people went off the deep end about it and are taking it way too far. I don't have a problem with being politicized or anything but there's a limit. Don't think these guys are quite there yet but I think you are correct that the tone definitely shifted a bit.\n\nMy question would be is it played up for the audience..? That's the other sad truth these days. Too many people can't critically think anymore and believe everything they are told by \"media\"....",
                            "score": 1,
                            "author": "pixelsinner",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That might be it, I never considered that! I would say they have to play up for their audience. And unfortunately, these audiences aren't goofy alien enthusiasts anymore, but something far more sinister.\n\nIf you are interested in the funny, weird, non-political conspiracy theories, I'd recommend \"The Conspiracy Theory Test\" podcast. They stick firmly to the escapism, fun elements, and are vocally against radical far-right actors.",
                                    "score": 4,
                                    "author": "IRE0906",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh cool thank you! Never heard of that one I'll give it a whirl.",
                                            "score": 1,
                                            "author": "pixelsinner"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If there was ever a time and reason to be pushed to one side or the other it was the pandemic.",
            "score": 4,
            "author": "utopianexile"
        },
        {
            "level": 0,
            "comment": "Definitely, I noticed it a couple years ago. I remember putting on an episode and being kind of shocked that his guest was a QAnon nutjob. Lots of ranting about Fauci, anti-vax, and general conservative brainrot stuff starting back then, from what I remember. It's a shame, it used to be a really good show.",
            "score": 2,
            "author": "thePirate_Fish"
        },
        {
            "level": 0,
            "comment": "Everyone has. And blm turned out to be complete garbage.",
            "score": -4,
            "author": "pablomcpablopants",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not for real estate agents.  The leaders of the blm movement were a boon to them.",
                    "score": 4,
                    "author": "Lurkolantern"
                },
                {
                    "level": 1,
                    "comment": "Weird how you still can’t say that without downvotes. I’m still waiting to here where the money went. Surely the positive impacts should be the plentiful with all of the resources went their way…",
                    "score": -1,
                    "author": "CockerTheSpaniel"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you’re looking for a conspiracy podcast with chill hosts who aren’t right wingers, may I suggest The Hypothetical Institute?",
            "score": 1,
            "author": "MenaceBunny",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh great, thanks! Always looking for recommendations. I know you didn't ask for it, but if you're looking for the same thing, I recommend The Conspiracy Theory Test",
                    "score": 2,
                    "author": "IRE0906"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; I find it surprising that I ever got into it when a lot of the views misalign with my own. \n\nIt's kinda crazy how common it is in todays age to just simply say \"You don't agree with me politically? Well I will not consume anything you produce whether it's politically focused or not\"\n\nI feel like these echo chambers are going to start errupting pretty soon.",
            "score": -21,
            "author": "PepeMasterRace",
            "replies": [
                {
                    "level": 1,
                    "comment": "A cursory glance at the rest of the thread (or even the rest of that paragraph) would have shown you that I am in fact consuming what they produce. \n\nDespite what the various internet-based moral panics may lead you to believe, differing media outlets have always pushed opposing agendas, and consumers have always gravitated to the ones that align with their own beliefs.",
                    "score": 13,
                    "author": "IRE0906",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; A cursory glance at the rest of the thread (or even the rest of that paragraph) would have shown you that I am in fact consuming what they produce.\n\n\nThis response has nothing to do with anything Pepemasterrace wrote.",
                            "score": 1,
                            "author": "Lurkolantern",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well they wrote in response to my post, so yes it does. If they want a soapbox to philosophize completely independently from the rest of the post, they should obviously do it somewhere else.",
                                    "score": 1,
                                    "author": "IRE0906"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 19,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There are plenty of right wing people who think that trans people should have rights and that abortion should be free and legal. Believe it or not, you also have right wing people who believe in public healthcare.\n\nRight wing views in my country believe all of these things.\n\nThis is the sort of echo chamber speak I'm saying is bad. Some well known right wing person has a specific view on something then you believe everyone who is right wing believes that way. Most people are one policy voters, they care about one thing more than anything else and they vote on what furthers that interest.",
                            "score": -12,
                            "author": "PepeMasterRace",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 10,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Jesus Christ that escalated quickly! I mean there's a difference between having some conservative views - say, economically - and being full out right wing nutjob, no? To flat out say anyone on either side of the political spectrum is unilaterally the extreme of said side seems slightly reductive maybe? Talking both sides here.\n\nI'm not looking to start a troll war I'm just uneasy with labels. Labels are what get people radicalized.",
                                            "score": 1,
                                            "author": "pixelsinner",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 2,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I totally get what you're saying. It's true that in the IS things are devolving rapidly it seems. I'm not American but I still remember when yes, there was polarization and conservative vs liberal, but there was still some discourse. Now... Not so much. I work in Florida for a few months a year and... Ouch. So I 100% understand where you're coming from.\n\nI guess I'm uneasy because it seems like actions don't matter anymore and you can't have diverging opinions. Once you have a label, you're done. Court of public opinion and so on. Calling (for example) a actual racist, racist is appropriate. But I've seen a lot of labels by association rather than giving the individual the chance they deserve (to be a good human or prove they're a turd, goes both ways).\n\nAnyway I'm rambling but I understand what you're saying. In your shoes I'd surely think alike. To use the Nazi analogy once more, there's a part of me that wants to focus on Germans after WWII more than Germans during the 3rd Reich...",
                                                            "score": 1,
                                                            "author": "pixelsinner",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 2,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "&gt;*You* can ignore the signs and try to be an enlightened centrist all you want, I really don't give a shit what makes *you* uneasy. What makes *me* uneasy is the actual, literal Christofascism that's on the rise right now in the West. \n\nI get your point, but I find that saying things like \"I don't give a shit about you and your opinions\" isn't constructive. Not sure if you meant it as a personal attack or not but that paragraph really soured the conversation, and that's kind of my point. I actually agree with you! I'm not a Christofacist as you put it - it's funny because I'm a pretty vocal atheist actually - so why just gear down to camping your opinions? Now if I had said things that painted me a rightwing crazy, sure. But I'm left trying to find what I said that triggered this.\n\nI'm not pretending to be holier than thou, I say things like that all the time. But then I wonder what's the point of conversation if that's what we revert back to...\n\nMy family lived through both WW in Germany and Slovakia. They also lived under Soviet dictatorships. My mother went through religious wars in the middle East and is a refugee. I know full well what sort of shitty things humans can do to humans. I'd go so far to say that I've lost most hope in the human race really. But I try...\n\nIf we listen to eachother we avoid a LOT of this. There will always be idiots and horrible assholes, but a lot of people are just... Scared. Things in the US are on a different level, like Russia, but I believe many people behind their guise of freedom seeking and patriotism, still see that things are falling apart in the world and that's what motivates their tribalism. I'm just trying to do my best to see the person behind the ideas.\n\nBut hey. This is just Reddit and we're all just semi anonymous nobodies on the internet, right? So from one nobody to another, don't let the hate get to you. Be well.",
                                                                            "score": 1,
                                                                            "author": "pixelsinner"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; I will believe it when I see it, because your country's (UK) conservative party has been trying to dismantle the NHS for a long time now in favor of a small government and privatized services.\n\nI still get all the same services for free at the point of use as I have my entire life. Nothing has changed. I'm sure you hear that we have massive long waits for A&amp;E and we cannot get seen as well right? I was in A&amp;E a few weeks ago and I was seen in 30 minutes and X-Rayed in an hour. It's all just media cherry picking stats from the busiest areas and weaponising them to fear monger and get clicks.\n\nI'll end the conversation here though, as your tone is very condescending and you clearly don't want to have a real adult conversation, you are deep in the echo chamber of us vs them and are incapable of fathoming someone from a different background or upbringing could have any other belief other than your own. That's quite rich from a group of people who preach acceptance of others, but I guess that doesn't count if I disagree with you on something.",
                                            "score": -8,
                                            "author": "PepeMasterRace",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’m British, and you’re a bullshitter.",
                                                    "score": 8,
                                                    "author": "worotan",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Look at his username",
                                                            "score": 1,
                                                            "author": "jprefect",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "What about my username? You do realise that in England Pepe the Frog is just a meme and holds no political meaning at all? I don't give a shit about the clown show that goes on in America every 4 years. Look at my account history if you feel that a username somehow makes me a troll or racist, I just play video games and like the pepe meme format. It was a meme long before whatever the fuck happened in 2016.",
                                                                    "score": 0,
                                                                    "author": "PepeMasterRace",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Well, it did happen, and you do know that it means, so, I guess you're fine being associated with a racist symbol, (the master race bit is **hilarious** too).  Which makes sense, given the terrible attitude you've expressed in this thread.  \n\nJust me calling attention to it basically caused you to tell on yourself. You realize that, right?",
                                                                            "score": 1,
                                                                            "author": "jprefect",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "There isn't really anything to tell, if you must know, the name derives from a debate with a friend who believed the Wojak meme had now overtaken the Pepe meme as the best meme format because it could be used in many different scenarios and the Wojak character could be made into anything, someone who works at McDonalds, someone who was a CEO, someone in the Armed Forces, a Crackhead, A stoner. My argument was that Pepe was that long before Wojak even existed, hence, PepeMasterRace.\n\nI love that in your eyes though, just the mere thought that I am Right Wing, even though in a country thousands of miles from your own and I have a username that involved a very widely used meme over the entire internet, that is somehow undoubted evidence that I am a racist or something. Even though you have access to my entire post history and there is not a single post that would suggest I hold those beliefs.\n\n\n&gt; I guess you're fine being associated with a racist symbol\n\nAlso, it's not a racist symbol in any country besides clown world America. It's just an internet meme.",
                                                                                    "score": 0,
                                                                                    "author": "PepeMasterRace",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There’s a big difference between say being liberal and listening to a conservative podcast about shrinking the federal government versus listening to a podcast about whether we’re being controlled by Jewish space lasers and if HRC is running a pedo ring from the nonexistent basement of a pizza parlor. \n\nThe former is a difference in ideologies. The latter is racist misinformation designed to grift and confuse a political base. \n\nParticipating in racist disinformation doesn’t make you respectful of both sides. It’s irresponsible and complicit.",
                    "score": 4,
                    "author": "Wooster182",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; There’s a big difference between say being liberal and listening to a conservative podcast about shrinking the federal government versus listening to a podcast about whether we’re being controlled by Jewish space lasers and if HRC is running a pedo ring from the nonexistent basement of a pizza parlor.\n\n\nTo be fair, the context of this discussion is literally about conspiracies.",
                            "score": 1,
                            "author": "Lurkolantern"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's a sad state of affairs when one side approves of removing rights women have had protected for decades, undermining minority struggles for equality, and outright calling for the end of certain minorities' existence. That side hardly has anything to do with what is traditionally considered \"politics\" anymore. They merely disguise their inhumanity with the word and bemoan the loss of a world where we could appreciate each other's \"political\" differences. I lost a best friend because of how his views changed over the course of the Trump presidency. I couldn't stand to be around him because he radiated his contempt and disregard for other human beings. I imagine it's much the same for some people and the media they consume.",
                    "score": -1,
                    "author": "CultCombatant",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Name checks out. Definitely a cultist. If I tell you I'm half Chupacabra, and you dispute that, you're not calling for the end of my existence. You're saying I'm lying about myself. Congratulations, you're right wing. Fucking bigot.",
                            "score": -9,
                            "author": "SlurpGoblin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It has been 0 days since a simple question on Reddit spiralled into a transphobic rant.",
                                    "score": 12,
                                    "author": "IRE0906",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is my favorite defense mechanism. You asked a question about a conspiracy theorist podcast. Then a commenter brings up transgenderism for absolutely no reason. Then when someone points out how silly and dishonest this is, the response is, \"why are you people pushing culture wars? Quit being such a transphobe.\" Ok, but I didn't bring it up homie. If you don't like people calling you out for lying, you should quit lying.\n\nAlso your comment is disgustingly chupacabraphobic.",
                                            "score": -6,
                                            "author": "SlurpGoblin",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Wha... What just happened?",
                                                    "score": 3,
                                                    "author": "pixelsinner"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Nah they didn't though. You're trolling posts and looking for any reason to go on a tirade. Enjoy your hatred, I guess.",
                                                    "score": 1,
                                                    "author": "IRE0906",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's literally in writing big guy. Scroll up and tell me the other commenter didn't bring the topic up",
                                                            "score": 0,
                                                            "author": "SlurpGoblin"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You're the one bemoaning the loss of \"the good old days\" because the two sides can't just respect each other's differences. Completely disingenuous.",
                                                    "score": 0,
                                                    "author": "CultCombatant",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Totally different person left that comment. Like you realize the trans movement is saying out loud what your goals are, and that you want to push hormones and cosmetic surgery on children, right? I don't want your respect under any circumstances.",
                                                            "score": 1,
                                                            "author": "SlurpGoblin",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Nobody's pushing anything.  That's a lie you've been fed over and over until you believe it.  You have the right to be left alone to make decisions about your own life.  That's what trans people want too.",
                                                                    "score": 1,
                                                                    "author": "jprefect",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Oh ok cool. So I can choose to exclude grown men from sharing the bathroom with my wife and daughter? No, because you demand everyone partake in your degenerate lie.",
                                                                            "score": 0,
                                                                            "author": "SlurpGoblin",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Do grown men not share the bathroom with our sons and brothers today already?  \n\nThe fact that you refuse to accept their identity is one thing.  That's your problem.  There's no law against private citizens being assholes to other private citizens.  No one is locking you up for using the wrong name or pronoun.  \n\nRegardless, public restrooms work the same for men and women, so.... What exactly are we saying here?  Only men commit assault? Only women are victims? Only female children are worth protecting? Public bathrooms are scary places where people get raped frequently?  What exactly is your argument in fact?",
                                                                                    "score": 2,
                                                                                    "author": "jprefect",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "But calling for their \"eradication\"?",
                                    "score": 2,
                                    "author": "CultCombatant"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Abbie Richards has a tiktok account that digs into origins of conspiracies and misinformation. Might be something you would be interested in.",
            "score": 0,
            "author": "Wooster182",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sounds great, thanks for the recommendation!",
                    "score": 2,
                    "author": "IRE0906"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stuff it with wood",
            "score": -1,
            "author": "smoulderwood"
        }
    ]
}