{
    "id": "9n0a37",
    "score": 674,
    "title": "Stop. Talking. Over. Guests. When. You. Interview. Them.",
    "author": "fitzrhapsody",
    "date": 1539184056.0,
    "url": "https://www.reddit.com/r/podcasts/comments/9n0a37",
    "media_urls": [],
    "other_urls": [
        "https://news.uchicago.edu/big-brains-7-richard-thaler))"
    ],
    "postText": "\"So my answer to your question is, I *do* like it...\"\n\n  \"MM-HMM...\"\n\n\"...when this kind of thing comes up, because it's GOOD,\"\n\n  \"Yep!\"\n\n\"...when people think about this sort of thing. And we do need that,\"\n\n  \"Right!\"\n\n\"...if we're going to get to the same goal—\"\n\n  \"Of course!\"\n\n\"that we're heading towards, and ultimately that's, I think, a reasonable thing\"\n\n  \"Definitely.\"\n\n\"—to want to do. I think that goes without saying.\"\n\n  \"Sure.\"\n\nThese little verbal confirmations are unnecessary and EXTREMELY DISTRACTING. You can tell within about 10 seconds whether a podcaster is a good/seasoned interviewer or they've never interviewed a person in their life.\n\nLook, I get it. We all have verbal tics. And it's very tempting to verbalize your agreement with someone. But stop it. When you ask a question, BACK OFF THE MIC. Smile and nod. You can give your guest a nonverbal affirmation of what they're saying, and it won't distract or annoy listeners. I have literally deleted podcasts (including *an interview* [*with a Nobel Prize winner*](https://news.uchicago.edu/big-brains-7-richard-thaler)) because every time the guest is explaining something interesting, I get a completely unnecessary guttural utterance from the host. It is egregious and can absolutely ruin an otherwise good podcast interview.\n\nOne or two OCCASIONAL affirmations is allowed, like on JRE or a few other shows. But listen to Freakonomics or Hidden Brain or Sam Harris, and you don't get much of it, if at all. Get out of your guest's way. Your listeners will thank you.",
    "comments": [
        {
            "level": 0,
            "comment": "Michael Barbaro: \"HMMMM\"",
            "score": 78,
            "author": "wennah",
            "replies": [
                {
                    "level": 1,
                    "comment": "Huh!",
                    "score": 11,
                    "author": "PeaceIsOurOnlyHope"
                },
                {
                    "level": 1,
                    "comment": "I feel like his hmmms and huhs (and Sarah Koenig's) were the inspiration for how Peter sounds in American Vandal. Although I guess you could argue it's a common tone used by journalists doing podcasts.",
                    "score": 9,
                    "author": "digitall565",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sarah has this one drawn out yet stark ‘mmmWHy’ that is incredibly awkward, ill placed, and insanely pretentious (from an Asia interview i think) that I’ve never been able to let go of. ",
                            "score": 1,
                            "author": "kittymctacoyo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fresh Air is a masterclass in interview technique, tbh.  I know it's not everyone's cup of tea, but Terry Gross is a fuckin pro, and it totally shows in her interviews.  I feel like she strikes an excellent balance in this regard.",
            "score": 110,
            "author": "jdunmer1018",
            "replies": [
                {
                    "level": 1,
                    "comment": "Terri Gross is the best in the business. ",
                    "score": 44,
                    "author": "ColinSays",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For me, Public Radio shows/podcasts and ex-Public Radio podcast producers make some of the best podcasts I listen to.",
                            "score": 15,
                            "author": "notanimalnotmineral",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They actually have a budget.",
                                    "score": 9,
                                    "author": "Onesharpman"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Funny you wrote that. When I was first reading OP’s post, my brain immediately went to Terry Gross as an expert example. ",
                    "score": 6,
                    "author": "diybarbi"
                },
                {
                    "level": 1,
                    "comment": "I love Fresh Air and the insights Terry Gross is able to draw out of interviewees, and maybe it’s just been more noticeable recently, but it seems like she is often guilty of what OP was talking about. I would say that I don’t think this type of thing bothers me when it’s used to keep a sharp focus on the topic / question, but it does bother me when the interviewee is in the middle of responding to the question that was asked. \n\nIn my mind this sharply contrasts with Jesse Thorn’s interviewing style. He will ask frequently rambling questions that include a lot of mentions of how the interviewee’s work or experiences relate to his, but when the guest responds with often comparably long-winded answers, they usually go interrupted.\n\nStill, I enjoy the final outcome of both interviewers and they are at the top of their class, so while some aspects of their styles may irrationally bug me, I can’t really argue with the result.",
                    "score": 4,
                    "author": "bomblol"
                },
                {
                    "level": 1,
                    "comment": "I time my lunch break so I can listen to her. ",
                    "score": 3,
                    "author": "Thirty_Helens_Agree"
                },
                {
                    "level": 1,
                    "comment": "I can’t stand Terry Gross. She’s constantly doing what OP is talking about, and she answers questions for the interviewer as she’s asking them.  She’d rather talk about what her answer to the question is than let us hear what the interviewee has to say.  Oh, and she tries really hard to put her own words and opinions in other peoples’ mouths. ",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "THIS! I'm a journalist and one of the first things we were taught was literally \"do not talk while the interviewee is speaking\". If anything, the interviewee should be uncomfortable with your silence because that's going to make them try to fill it, which will make them open up more. ",
            "score": 42,
            "author": "gorjusgeorgus",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is awesome. And a life skill honestly.",
                    "score": 10,
                    "author": "Smoldero",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I dunno if it makes for the best podcast listening experience though. ",
                            "score": 3,
                            "author": "ground__contro1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Edits!",
                                    "score": 9,
                                    "author": "stolenpuppy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The discomfort of the interviewee would still probably be pretty noticeable. ",
                                            "score": 4,
                                            "author": "ground__contro1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Fair point.",
                                                    "score": 1,
                                                    "author": "stolenpuppy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It is a great life skill tho, I do it on a semi regular basis. ",
                                                            "score": 1,
                                                            "author": "ground__contro1"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Har Har Har ",
                            "score": 2,
                            "author": "gorjusgeorgus"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Send this to Dax Sheppard.",
            "score": 56,
            "author": "wednesdayware",
            "replies": [
                {
                    "level": 1,
                    "comment": "YES!! I had to stop listening to his podcast because his interruptions and self-centeredness was bugging me so much.",
                    "score": 20,
                    "author": "AKinKC",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For real. I think he's probably a good guy, but he is not a good listener. ",
                            "score": 13,
                            "author": "Smoldero"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He just said -- on this week's episode, I think? -- that he heard the feedback and is working on it.",
                    "score": 14,
                    "author": "MerryTexMish",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He said it on his second episode too. I stopped listening. He didn’t stop interrupting. \n\nThere are too many great interviewers out there to be giving my ear to that. YMMV",
                            "score": 11,
                            "author": "meakbot"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I agree! Love him and his podcast but he does this a ton",
                    "score": 11,
                    "author": "tatertottytot"
                },
                {
                    "level": 1,
                    "comment": "UGH I KNOW!!!! He annoys me so much!! And his interjections are all about him. ",
                    "score": 10,
                    "author": "sandstorm619"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's because in a normal conversations those responses are used to let the speaker know that you are listening and following along to what they're saying. But you're right, when in a podcast setting it comes across as annoying since you're in a setting in which it's assumed you should be listening and following along. I make sure to tell my guest to avoid this before every conversation, but even then it will still slip in every once in awhile, even from my side, because it's such a common trait of conversation. If it happens too much in an episode I'll lower the dbs of whatever side it's on so it doesn't outmatch the side that's speaking.",
            "score": 44,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I learned in my communications class about this and it's often encouraged, actually.\n\nBut I definitely see how it's distracting in podcasts. \n\nEdit: spelling heh",
                    "score": 10,
                    "author": "maceyscreator",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Your Communications class encouraged it? I've been trying to stop giving these kinds of verbal listening confirmations, when having conversations, because I think it's almost like interrupting the person and I don't want to do that. ",
                            "score": 1,
                            "author": "Smoldero",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It was actually when we were discussing the different types of interrupting and this was classified as an example of a \"good interruption\".\n\nOf course, they also said we should pay attention to how the other communicates and if they appear annoyed by the interruptions try and stop. So I think being aware of it is the best anyone can do lol ",
                                    "score": 7,
                                    "author": "maceyscreator"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is a big problem with interview-style podcasts. The ego of the host overtakes the anecdotes from the guest :(",
            "score": 41,
            "author": "Twisted_Dragonfly",
            "replies": [
                {
                    "level": 1,
                    "comment": "well i think its more the fact that few podcasters are trying to do interviews and most see themselves (like JRE) as just \"conversations\". Acknowledging and nodding along to what your interlocutor says is a big part of 1-on-1 convos irl",
                    "score": 5,
                    "author": "deadobese",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "JR is actually pretty good about not interrupting.  there are times he'll go like 20 minutes without making a sound.",
                            "score": 1,
                            "author": "transoceanicdeath"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 54,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The last rhonda Patrick podcast he was amazingly quiet when she was going into deeper science. It was impressive ",
                    "score": 13,
                    "author": "Halfoatfullgluten",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Great episode! ",
                            "score": 1,
                            "author": "seamore555"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "JRE is less an interview and more a hangout/conversation. But it's an odd one for OP to use as an example.",
                    "score": 31,
                    "author": "mannotron",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Perhaps I haven't heard enough JRE. When I said \"interrupt\" I meant with \"mmhmm\" or \"uh huh\" tic kind of things. It's fine to interrupt a person in a conversation if something catches your attention and you want to push them on it.",
                            "score": 6,
                            "author": "fitzrhapsody"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He also knows when to completely shut up.",
                    "score": 5,
                    "author": "Feastyoureyesonmyd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "His ability to shut up is directly proportionate to how high he is. ",
                            "score": 15,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What is JRE?",
                    "score": 3,
                    "author": "Eftersigne",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Jolly Roman Empire",
                            "score": 17,
                            "author": "lookforlight",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "that actually sounds awesome",
                                    "score": 5,
                                    "author": "Eftersigne"
                                },
                                {
                                    "level": 3,
                                    "comment": "Jolly Rancher Empire.",
                                    "score": 5,
                                    "author": "Chicken421",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "that sounds like a podcast for people on psychedelics ",
                                            "score": 2,
                                            "author": "Smoldero",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Or one of those criminal investigation podcast that looks into the deep dark underbelly of a nefarious fruit flavored hard candy manufactorer.",
                                                    "score": 2,
                                                    "author": "lookforlight"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 11,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you!",
                                    "score": 5,
                                    "author": "Eftersigne"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Jordan peteRson Enchanter.",
                            "score": 2,
                            "author": "quit_complaining",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "boooh",
                                    "score": 3,
                                    "author": "deadobese"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've tried to listen to this podcast many times and if the guest is someone I really want to hear, I will muddle through. I really pretty strongly dislike Joe Rogan's interview style, to me he comes off as pretty arrogant and doesn't seem to care what his guest has to say much of the time.",
                    "score": 2,
                    "author": "moondazed"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As an editor, I cut ALL that shit out if they were recorded remotely. It fucks up my life if they were in the same room though. \n\nNot only is it incredibly annoying and distracting as a listener, it’s harder to work around as an editor. ",
            "score": 12,
            "author": "TKellzzz",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree that its hard to work around. do you remove the ''mmmms'' or keep them in?\n\nside question: what do you do when your guest keeps using the same set of words as filler words ''e.g. ''you know'', do you keep it in or remove it?\n\n&amp;#x200B;",
                    "score": 4,
                    "author": "Solarbg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I remove most of them, if I can maintain a natural sounding flow. That’s mainly what I’m getting paid for. I’ll try several different things in order to remove crutch words and keep a natural pace, but if I can’t get it sounding right in 10 seconds or less, I’ll revert to the original, leaving everything in and move on. \n\nIf you can hear an edit, I’m doing a bad job, and I don’t want the audience to lose trust in the host or guest, thinking that someone is fiddling with the content, you know? ",
                            "score": 2,
                            "author": "TKellzzz"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love Getting Curious with Jonathan Van Ness... but the constant interruptions drive me nuts. That being said, it really feels like his (over)enthusiasm is what draws in listeners.\n\nDo you think that in a certain format the interview is just the conversation starter and what people people really want are the interruptions and tangents?\n",
            "score": 20,
            "author": "ohbenjamin59",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m glad you mentioned this, because this was driving me crazy just this morning when I was listening to the Erin Gibson/Nicole Byer episode. I love him to death but I was really questioning whether or not he was on something. ",
                    "score": 6,
                    "author": "summer-blonde"
                },
                {
                    "level": 1,
                    "comment": "Came here to mention this!",
                    "score": 1,
                    "author": "PostModernLobster"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Huh. I really like those little 'still listening' affirmations. It feels like a real conversation rather than a stiff interview. To each their own I suppose.",
            "score": 8,
            "author": "ExPatAm"
        },
        {
            "level": 0,
            "comment": "Step 1: Record on separate track\nStep 2: if the guest is talking delete whatever’s on your track ",
            "score": 5,
            "author": "mattfuckyou"
        },
        {
            "level": 0,
            "comment": "Every host on How Did This Get Made",
            "score": 8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Paul Sheer who I respect as a comedian might be the most frustrating podcast host, I can't listen to HDTGM anymore, had to switch to We Hate Movies  ",
                    "score": 4,
                    "author": "pappabutters",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Listened to Unspooled yet?  Much better.",
                            "score": 1,
                            "author": "Manofwood"
                        },
                        {
                            "level": 2,
                            "comment": "I think for me it was Jason who ruined it. The guy loves yelling, interrupting and one-upping everyone. And I just didn’t really find him funny ",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love the guy, but I literally stopped listening to Star Talk because he'd have a cool guest on with very little time to speak, then not STFU!",
                    "score": 2,
                    "author": "BraddlesMcBraddles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "NdGT is fascinating to listen to, though that also includes NdGT.  He is enthralled with all of the knowledge he has on tap and is never shy to let it flow whenever the opportunity arises.",
                            "score": 1,
                            "author": "bedebeedeebedeebede"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "h3 lol",
            "score": 4,
            "author": "Sp0range"
        },
        {
            "level": 0,
            "comment": "Yeah... Totally this. I run interviews on my show every week. Thankfully I realised early on to shut the hell up. Mainly because I listened back and realised I was doing it and how annoying it was. Also helps if you can record yourself on a separate track to the interviewee. That way you can at least delete any excessive hums and yeahs.",
            "score": 3,
            "author": "Daveydje"
        },
        {
            "level": 0,
            "comment": "Yeah, this doesn't bother me. It happens in life and is fine. And it's fine for me when it happens in podcasts I listen to.",
            "score": 5,
            "author": "HunterLatherer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same. I’ve never noticed or cared. Admittedly there’s some things I do care about that annoy me. But this isn’t one of them. ",
                    "score": 2,
                    "author": "N1ck1McSpears"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You should see the unbox therapy video where he \"interviews\" Dave lee. ",
            "score": 2,
            "author": "aaronryder773"
        },
        {
            "level": 0,
            "comment": "bill simmons is a great host and never does that to his guests",
            "score": 2,
            "author": "zer0xray",
            "replies": [
                {
                    "level": 1,
                    "comment": "I find Rogan the same way. gives his guests lots of space when they need it.",
                    "score": 1,
                    "author": "bedebeedeebedeebede"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I agree so much so much ",
            "score": 2,
            "author": "Halfoatfullgluten"
        },
        {
            "level": 0,
            "comment": "Mmmmhmmmmmmm?\n-Sean and Hayes",
            "score": 2,
            "author": "TerryTungleman"
        },
        {
            "level": 0,
            "comment": "I make a point of deleting at least 90% of the affirmations I do. In my editing doc, I literally have a list called \"yeah/mm hmm\" where I timestamp all of the times I made an audible sound while the guest is talking and then go through and mute them.",
            "score": 2,
            "author": "ofwindandsea"
        },
        {
            "level": 0,
            "comment": "You must also hate subtitles",
            "score": 2,
            "author": "foxenforumz"
        },
        {
            "level": 0,
            "comment": "Lookin at you, Marc Maron. (Still love you tho.)",
            "score": 2,
            "author": "Mashlomech"
        },
        {
            "level": 0,
            "comment": "Adam Carolla must have the award for this. He interviews anyone from Mike Tyson to Jeff Dunham and they hardly get a story in edgewise. ",
            "score": 2,
            "author": "BoredBoredBoard"
        },
        {
            "level": 0,
            "comment": "Omg yes. ",
            "score": 2,
            "author": "Fabulousmo"
        },
        {
            "level": 0,
            "comment": "If you're doing a remote interview, and a lot of the professional podcast interviews are remote, then having these audio cues is important for the guest. That said, they could be edited out with work in post.\n\nI know that in some parts of Asia, it's common and even polite, to provide that audible feedback. So it's a cultural difference as well.",
            "score": 2,
            "author": "gkanai"
        },
        {
            "level": 0,
            "comment": "Kara on recode decode",
            "score": 4,
            "author": "talyakey",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh Kara, such a love-hate relationship with her interviews. I like that’s she’s tough and asks strong questions, but sometimes she just has an agenda against white male tech people. I like confrontational interviewers to an extent, but you can’t let your biases kill that rapport.",
                    "score": -1,
                    "author": "paper-tigers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Down voters at least speak your mind.   This is a measured comment.",
                            "score": 1,
                            "author": "Dannyhealy"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can see where where you're coming from with this. I don't want to be a hypocrite so I have to admit that I do this in my own podcasts.\n\n&amp;#x200B;\n\nWe have to keep in mind that their are multiple styles of interviews and the big two to keep in mind are professional and casual. for podcasters reading this, just make sure to establish which one you want for your podcast. I do agree with the OP that it can get annoying at some times (I know its a hypocritical statement).  But there's a thin line between sounding like a robot interview and sounding like a casual interview.\n\n&amp;#x200B;\n\nTo be honest, I do enjoy the like words here and there because it shows that the host or the guest is listening plus it makes the flow of the conversation seem more natural and less scripted. I feel that it would ruin the follow and even make my guest uncomfortable if I kept telling them to not interrupt with single words. Of course I try to keep my own interruption to a minimum since I want to reduce the editing time (that's my reason why i restrain my self) but sometimes I get into the discussion and react as if it was a normal conversation since I want my guest to feel a ease.\n\nBottom line, if you are making a interview podcast or any type of podcast for that matter, you will never satisfy every listener in that genre. Don't get discouraged and keep doing your podcast the way it makes you comfertable since its the only way you will learn to improve and make it your own. Everyone will have an opinion about  your podcast and ask you to change something (e.g. your voice, your guest, your topic, your time, etc.)\n\n&amp;#x200B;\n\nI am well aware that this post creator likes interview podcasts but might not like mine for the reason they mentioned above, and thats ok. BTW i don't mean to disrespect your post. I completely understand your point of view.\n\n&amp;#x200B;\n\nThank you, [u/fitzrhapsody](https://www.reddit.com/user/fitzrhapsody) for your post. I know some people will take this in consideration and improve their podcast.\n\n&amp;#x200B;\n\nI'm sorry if I offended you an any way.\n\n&amp;#x200B;\n\nTake care,",
            "score": 4,
            "author": "Solarbg"
        },
        {
            "level": 0,
            "comment": "My friend and I have only just started podcasting, but we've been quick to check ourselves in this regard.\n\nHe's actually going to be relocating very shortly, and we're likely going to try to continue the show via Skype or Google or something.\n\nOur technical skills and budget are very limited, but we may try a video chat or something.\n\nPOINT IS, I've learned that giving each other NONVERBAL cues is very effective, not only for creating an enjoyable audio presentation, (no one likes hearing people talk over each other) but also for helping to structure the flow of conversation.\n\nWe did a show with 3 people in the room, and all throughout we were silently shooting each other goofy faces and signal gestures that served to tip the current speaker off to the fact that someone had a comment queued up and ready to go, so be ready to let them jump in.\n\nLong story short, be conscientious, both as a listener and speaker.\n\nYour audience will appreciate it, as will your co-hosts and guests.",
            "score": 2,
            "author": "CatchingUpOnCinema"
        },
        {
            "level": 0,
            "comment": "Sometimes it's an audio-only interview where the host and guest aren't in the same room so the cues feel more necessary, much like a phone call. ",
            "score": 1,
            "author": "Dragmom"
        },
        {
            "level": 0,
            "comment": "Steve Austin does this thing where he asks the question then follows it up with a \"because.... blah blah blah\"",
            "score": 1,
            "author": "breticles"
        },
        {
            "level": 0,
            "comment": "It also has to do with connections. Often they are talking remotely, via skype or the like. You can't talk over each other, like on a landline or in person.",
            "score": 1,
            "author": "fsacb3"
        },
        {
            "level": 0,
            "comment": "My God. I started transcribing things and I get a lot of podcasts. I never noticed it before but now it drives me absolutely fucking nuts. I've also noticed how long the interviewers occasionally ramble on for and their guests barely get to talk.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Man you’d hate Harmontown",
            "score": 1,
            "author": "ground__contro1"
        },
        {
            "level": 0,
            "comment": "As much as I love Jonathan Van Ness and Getting Curious, this kills me every time I listen to his show.",
            "score": 1,
            "author": "GlamrockShake"
        },
        {
            "level": 0,
            "comment": "the podcast Criminal Injustice has great content, but I finally stopped listening to it because I couldn't stand how much the host interrupted the guests and talked over them.",
            "score": 1,
            "author": "moondazed"
        },
        {
            "level": 0,
            "comment": "This is a cue you pick up from conversation. If you are doing an interview in person, but not recording it, you really don't want to come across as you're not listening. So you do affirmations that you are with these verbal cues.\n\nJust gently remind people when they are recording their voices that their verbal tics are also on display. If you got filler words, axe them. If you got uhhhs and ummms, delete them. Etc. etc. etc.",
            "score": 1,
            "author": "cmentis"
        },
        {
            "level": 0,
            "comment": "I was listening to Kara Swisher interview the former CEO of Cisco today and she is SO BAD FOR THIS!  Her’s weren’t even little confirmations like “yup” and “mmhmm”, but rather she would literally talk over the guest, interrupting what they were saying mid sentence and just continue speaking right over them.  It was unbelievable!",
            "score": 1,
            "author": "escargot3"
        },
        {
            "level": 0,
            "comment": "If I’m recording over the internet I need to occasionally give that affirmation that I hear them so we don’t think a disconnection has happened which will making editing quicker and easier.",
            "score": 1,
            "author": "CJFresh"
        },
        {
            "level": 0,
            "comment": "Firstly, I completely agree with you. It annoys the hell out of me too.\n\nI feel I can present a reason this happens (egos aside) and a solution. Assuming the interviews take place over Skype or Discord (audio only) then it is habit to provide cues to the interviewee that you are listening. Obviously this would be a nod or something face-to-face.\n\nBoth myself and my co-host do this when interviewing and the solution is really simple: just silence your audio tracks during the interviewee's response. If you aren't recording multiple tracks I highly recommend it as it makes this sort of edit so much easier.",
            "score": 1,
            "author": "tomwilko"
        },
        {
            "level": 0,
            "comment": "conveniently adds \"an interview with a nobel prize winner\"",
            "score": 1,
            "author": "bassagammin"
        },
        {
            "level": 0,
            "comment": "Cough Dax Shepard\n\"How did that make make you feel?  I'll tell you how it made me feel....\"",
            "score": 1,
            "author": "TheRealGuncho"
        },
        {
            "level": 0,
            "comment": "I listened to a podcast interview between Tony Robbins and Gary V and they were both just shooting into the mic as hard and fast as they could.  I really wanted Gary to back off and let Tony talk and when Gary was giving context to a question Tony would just throw his 2 cents in too.  It drove me nuts.  Two super successful people and I couldn't pay attention to their wisdom for all the talking over each other they did.",
            "score": 1,
            "author": "GravityUndone"
        },
        {
            "level": 0,
            "comment": "What if the person you interview is going on and on endlessly? What if you come up with an idea you feel you will forget if you don't say it now? What if the person is going to a topic you don't want to talk about? ",
            "score": 1,
            "author": "snapmehummingbirdeb"
        },
        {
            "level": 0,
            "comment": "You haven't heard Kara Swisher's Recode Decode",
            "score": 1,
            "author": "kamasutra971"
        },
        {
            "level": 0,
            "comment": "Listen. To. Better. Podcasts?",
            "score": 1,
            "author": "artfulpain"
        },
        {
            "level": 0,
            "comment": "I agree to some extent. There's certainly no reason to keep them all in, but removing all of your reactions to your guest would sound strange. If it's supposed to be a conversation, let it sound like one (still cut 60% of them). If it's more of an interview, remove 90% of your reactions.",
            "score": 1,
            "author": "ocdhandwasher"
        },
        {
            "level": 0,
            "comment": "This is why I largely stopped listening to Jim Harold's stuff.",
            "score": 1,
            "author": "njgreenwood"
        },
        {
            "level": 0,
            "comment": "If you are looking for a one to one comparison, I recently made a conscious effort to stop this habit.\n\nEpisode with:\n\nhttps://soundcloud.com/the_comments_section/ep-5-who-do-you-think-q-are-part-1\n\nEpisode without:\n\nhttps://soundcloud.com/the_comments_section/ep-7-sjws-have-ruined-comedy\n\nE: spelling error",
            "score": 2,
            "author": "The_Comments_Section"
        },
        {
            "level": 0,
            "comment": "Scott Aukerman on CBB bugs me soooo bad with this. Sometimes his guest will be in the middle of a joke or anecdote and he will just totally derail the conversation from what they were talking about",
            "score": 1,
            "author": "PMmeWhatyoulovemost"
        },
        {
            "level": 0,
            "comment": "Nate Duncan is another serial interrupter...I love his NBA pod, but sometimes I have to turn it off it's so bad.",
            "score": 1,
            "author": "justin_quinnn"
        },
        {
            "level": 0,
            "comment": "Is it just me, it does it seem that conservative slanted shows do this more than progressive shows?",
            "score": 0,
            "author": "lime-link",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s just you",
                    "score": 5,
                    "author": "ground__contro1"
                },
                {
                    "level": 1,
                    "comment": "For example...?",
                    "score": 0,
                    "author": "stolenpuppy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well for example shows like Glenn Beck and Rush Limbaugh don't spend much time letting guests talk and shows like Fresh Air and NPR ones seem to really try to understand a guests perspective and do a lot of listening.",
                            "score": 5,
                            "author": "lime-link",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Interesting! I was curious as to what you categorized as conservative-slanted, since I was thinking more of podcasts and not radio shows. \n\n*edit: mistyped spelling",
                                    "score": 1,
                                    "author": "stolenpuppy"
                                },
                                {
                                    "level": 3,
                                    "comment": "I don’t know fresh air but NPR does have a reputation to uphold being National Public Radio and all, and also being subsidized by tax dollars. They may have a liberal slant in what they choose to present but I don’t know if it’s fair to compare something like NPR to Rush Limbaugh, which is essentially a politically themed entertainment program. It’s almost apples and oranges. I don’t compare documentaries to reality tv. ",
                                    "score": 1,
                                    "author": "ground__contro1"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "triggered.",
            "score": -3,
            "author": "vegathechosen"
        },
        {
            "level": 0,
            "comment": "And it has been written.  Woe to those that do not heed the call, for the wrath will be wrought with the burning ire of a thousand suns, delivered unto the foolish podcaster by the keyboard sharpened by whet stones taken from the club of Hrugnir. Warriors of the Internet rejoice!  For today is a good day to whine.",
            "score": -4,
            "author": "lovegiblet"
        },
        {
            "level": 0,
            "comment": "This doesn't bother me at all.",
            "score": 0,
            "author": "seamore555"
        },
        {
            "level": 0,
            "comment": "If you don’t like it when hosts speak over the guests, you should check out Failing Upwards™️, the only podcast that matters",
            "score": -6,
            "author": "773219"
        }
    ]
}