{
    "id": "f8ystt",
    "score": 728,
    "title": "Those who continuously release new episode despite the number of listeners they get are the real MVPs",
    "author": "Solarbg",
    "date": 1582580710.0,
    "url": "https://www.reddit.com/r/podcasts/comments/f8ystt",
    "media_urls": [],
    "other_urls": [
        "https://www.reddit.com/user/Janmmurphy/)",
        "https://www.amplifimedia.com/blogstein/2018/8/22/how-many-of-the-550000-podcasts-are-actually-active](https://www.amplifimedia.com/blogstein/2018/8/22/how-many-of-the-550000-podcasts-are-actually-active)"
    ],
    "postText": "These days we hear about a lot of people having thousands of listens per episode and how fast their podcast is grown (absolutely nothing wrong with sharing that). But I want to take a moment and give a virtual high five to the podcasters who continuously release new episode even when they only have a handful of listeners.\n\nAn important thing to keep in mind is that even if an episode only get 1 listener, there's a possibility that your episode just made that person's day a whole lot better.\n\nIn a day and age where we focus on the number of followers and listens we shouldn't forget that those listeners are real people who enjoy your podcast and listen to it for multiple reason, whether its to help them get through a hard day, have a few laughs, relax or anything else. I might get some heat for this but as a podcaster I believe that I owe it to my listeners (no matter how many listens) to create content where they can walk away with new information, some laughs and anything that will improve their current situation.\n\nI understand that some people stop podcasting because other priorities come first and that's completely understandable and I'm not bashing you in anyway (thank you for releasing some episodes).\n\nAnyways, to those who keep releasing new episode regardless of the number of listeners they get, are the real MVPs.\n\nI remember reading somewhere that a lot of podcast don't make it pass the 10th episode (I wish I can find that article). If anyone knows of it please share it. \n\nEdit1 : As most people mentioned, the most important thing is to make sure you enjoy doing your podcast and I completely agree with that. Sorry I missed that point. Have a great day.\n\nEdit2 Here's the link I was talking about  thanks to /u/[Janmmurphy](https://www.reddit.com/user/Janmmurphy/) for finding it.\n\n[https://www.amplifimedia.com/blogstein/2018/8/22/how-many-of-the-550000-podcasts-are-actually-active](https://www.amplifimedia.com/blogstein/2018/8/22/how-many-of-the-550000-podcasts-are-actually-active)",
    "comments": [
        {
            "level": 0,
            "comment": "I feel it's more important to enjoy making the podcast. We're only 7 episodes in but we're all having so much fun. A lot of people worry about the numbers instead of enjoying the process.",
            "score": 105,
            "author": "HCMoviesPodcast",
            "replies": [
                {
                    "level": 1,
                    "comment": "This has been our philosophy, we have a small number of listeners but have had some seriously awesome feedback from people who’ve benefitted from our lighthearted, positive, and fun discussion.  It makes it that much more fun when people enjoy what you’re already having fun doing!",
                    "score": 22,
                    "author": "fromthemidpod"
                },
                {
                    "level": 1,
                    "comment": "What is your podcast? I will give it a listen. You can pm me with the link if you like.",
                    "score": 7,
                    "author": "mmsood99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;\tHCMoviesPodcast",
                            "score": 12,
                            "author": "dannythetwo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Are you guys on Overcast? I couldn’t find it.",
                                    "score": 1,
                                    "author": "supermarketsweeps25",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[here ya go](https://overcast.fm/+Kvj11W5LA)",
                                            "score": 2,
                                            "author": "dannythetwo"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[this is it](https://overcast.fm/itunes1495096256/highly-caffeinated-movies)",
                                            "score": 1,
                                            "author": "HCMoviesPodcast",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you!",
                                                    "score": 3,
                                                    "author": "supermarketsweeps25"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I get it. My buddy and i are like 40+ episod es in, coming up and doing this for a year, and at most we get like 4 or 5 listens the first week a new episode is out, but we love doing it. We like sitting down and just talking to each other about whatever we feel like that week. I think the most listens we have on one episode is like 90 lol but that's not why we do it. We do it because it's fun and it brings us closer together.",
                    "score": 5,
                    "author": "InProductionStudios",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What is the name of your podcast?",
                            "score": 1,
                            "author": "HCMoviesPodcast",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In Production Studios. You should be able to find us on spotify, podchaser, and a few other places. If you want links let me know.",
                                    "score": 2,
                                    "author": "InProductionStudios"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Give it time.  You’ll feel the pain in no time.  We meet every other Thursday.  When you’re ready.",
                    "score": 2,
                    "author": "misplacedprodigies91"
                },
                {
                    "level": 1,
                    "comment": "\"The Process\"\nJoel Embiid",
                    "score": 2,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I hear you bro! I'm working on my own and it's hard. Especially when the following episode gets let's views than the previous one. I'm gonna check yours out though!!",
                    "score": 1,
                    "author": "beingthevictor"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This was a very good pick me up. We’ve been at it for over 70 episodes and I don’t think we ever would have made it that far if we didn’t enjoy the experience.",
            "score": 22,
            "author": "Kiorein"
        },
        {
            "level": 0,
            "comment": "Thank you!  I started my podcast in December.  I get about 10-20 listeners per episode.  I just uploaded my 6th episode on Saturday.  I do it because I love it.  I have about 82 followers between my social media accounts so that also helps keep me going.  People who listen to my show enjoy my content and this subreddit helped me gain more confidences so  I’m more than happy to keep going.\n\nI think I’d keep podcasting even if no one listened. I just want to put myself and my content out there.  There’s always someone out there willing to listen, so I keep that in mind while I make my episodes.",
            "score": 14,
            "author": "TeaPartyBiscuits"
        },
        {
            "level": 0,
            "comment": "Hahahaha its funny cause I was just reflecting on our small audience compared to the amount of shows we've done. Thanks for this post it was a good pick me up.",
            "score": 30,
            "author": "Gitoff_Mylon"
        },
        {
            "level": 0,
            "comment": "People forget why they start podcasts. Do it for yourself and whoever wants to listen.",
            "score": 10,
            "author": "zem6",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly. We actually just had an episode about why we started our podcast and how it showed us who are real friends really are.",
                    "score": 2,
                    "author": "InProductionStudios"
                },
                {
                    "level": 1,
                    "comment": "Exactly right!",
                    "score": 0,
                    "author": "PP_Dragon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I needed this today. Thanks!",
            "score": 17,
            "author": "Stacebob"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is oddly similar to my situation! I do one podcast with my brother for the sake of experimenting with different health/fitness/nutrition protocols.\n\nMy second podcast is exactly your second podcast! I interview local non-profits and people they have impacted. Couldn’t agree more with you that it’s so encouraging to meet people who truly just want to make their communities a better place. It’s what keeps me going! So cool to hear about somebody else doing this in another city. Keep it up!!",
                    "score": 2,
                    "author": "anonymous2134"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You gotta make your podcast for the fun. Listeners are a nice bonus. I think we have around 30-40 regular listeners right now. But we would keep on makinging the show if there was only 1. It gives me an excuse to regularly hang out with my best friend and feel productive about it.",
            "score": 18,
            "author": "Funkbuqet",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is exactly how my buddy and I feel about it. We decided that as long as we enjoy doing it we're going to keep doing it.",
                    "score": 2,
                    "author": "InProductionStudios"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Podcasters that do this are super into their subject matter, and if you keep listening you are too :) It's a great thing even though the general listening public aren't into it.",
            "score": 5,
            "author": "Majestic_Owl"
        },
        {
            "level": 0,
            "comment": "That is my friends. They are 53 episodes in, release one every week, and are pretty damn consistent about it. Also very consistent with their weekly Twitch schedule.\n\nWe've accepted that not much will come from it besides a really fun hobby and an excuse to play and chat video games.\n\nSuper GG Radio if anyone cares! I'm sure the guys would appreciate any additional views/listens/downloads outside our friend group lmao.",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "My podcast partner and I have put out over 600 episodes - one (pretty much) every weekday for almost 2.5 years now.Each episode is a self-contained improvised choose your own adventure story that all takes place within a shared universe. It's really silly and weird. \n\nWe started out pretty small, with a daily audience of 10 or so. Now we're around 375-400 pretty much every day. We've done it exclusively through word of mouth. \n\nThe key to being reliable is that it's been about having fun. Recording our show is my favorite part of the week. If it weren't so fun to do, I doubt I would've kept it up this long.",
            "score": 5,
            "author": "aaronbrookscomedy"
        },
        {
            "level": 0,
            "comment": "I’ve been doing my podcast about America’s Got Talent for 3 years and we probably have dozens of listeners. I have a great partner and we love doing it for fun. It’s not polished, it’s not fancy. It’s very raw and I do all my own editing. I feel like I accomplished something every week we put something out.",
            "score": 3,
            "author": "cpatterson1177"
        },
        {
            "level": 0,
            "comment": "It completely depends what you're doing the podcast for, I suppose!\n\n&amp;#x200B;\n\nAs someone who has performed live comedy and has a podcast, I've seen a lot of people coming through performing for years and years who are actually not very good, but don't really understand it. They also don't seem to enjoy performing, but they are addicted to the idea of being a comedian and the very very rare occasional adrenaline rush of getting maybe a laugh for one joke.\n\nWhen I see podcasts that continue for years despite having only 100 listeners I probably accidentally apply that same lens to that situation - I think, why are they doing this podcast, they're not doing well at all. But that's probably a very flawed way to look at things. People can sit around and talk to their friends on microphones for fun and that's fine, that's enough!",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's us! Our podcast does very small numbers (like on average smaller than even the folks in here calling themselves small).. But here we are 211 episodes in, because the part of the show I love is the work preparing and recording.\n\nI hate the work it takes to get it online afterwards, but we have a few very loyal listeners that give us feedback and that's enough for me to keep putting the show out in public I guess.",
                    "score": 1,
                    "author": "Deadpool1205"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I used to get down on myself (and I still do from time to time) for our listenership being smaller than I wanted it to be, and/or because we haven't had any noticeable growth in the last two years. But at the end of the day, I make our podcast because I enjoy doing it, and I release on a strict schedule no matter what because I would be disappointed in myself if I didn't. \n\nBut part of me does get a little annoyed when I see other podcasts skyrocket into popularity despite lower-effort episodes and inconsistent schedules. Shortly after we began three years ago, another podcast started that had the exact same format and subject matter as us, but their first episode had more listeners than we'd ever gotten in like two months and they got bigger and bigger.\n\nIt's tough being a small podcast, but like I said, I'm doing this because I want to do it, not because I expected to get famous. (But getting famous would have been cool.)",
            "score": 3,
            "author": "UltimaGabe"
        },
        {
            "level": 0,
            "comment": "Yeah this is good advice. My podcast is coming up on 120 episodes and we only have about 70 regular listeners. That said, I am planning to end it soon, but more because I'm not that enthused on the topic anymore.",
            "score": 5,
            "author": "Govannan"
        },
        {
            "level": 0,
            "comment": "Hey guys, we are new to podcasting, does anybody have any tips or experiences that motivated them during a early point in their podcasting time?",
            "score": 2,
            "author": "horsinaroundcomedy"
        },
        {
            "level": 0,
            "comment": "It can definitely be hard to keep pouring all this time and money into a show with a tiny audience. But I don't know what I'd do if I gave up",
            "score": 2,
            "author": "Drigr"
        },
        {
            "level": 0,
            "comment": "Two years into our show and just broke 40 episodes, and we barely get 100 listeners per episode. But we’re doing it for the sheer love of it, and we’ve actually had some pretty dope guests. One being the actor Jon Gries who played Uncle Rico on Napoleon Dynamite.",
            "score": 2,
            "author": "ZeroFuxGiven"
        },
        {
            "level": 0,
            "comment": "Shout out to The Fall of the Roman Empire. It is amazing to listen to a professional historian for a change. But, for some inexplicable reason, I feel I am the only person listening to his episodes.",
            "score": 2,
            "author": "hobahobaparty"
        },
        {
            "level": 0,
            "comment": "It reminds me of Public Access tv back in the day. Whenever it watched it I always felt like I was the only person watching, and I could tell the creators were really into it because otherwise why would they go to all the trouble. \n\nThere's something that turns me off a bit about massive shows that were never homegrown projects, that instead were spawned from some media conglomerate or hosted by some major celebrity with a built in audience. I get the feeling it's just their job, and yeah, most people would make a podcast if it made them enough money.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Yeah I’m only 7 episodes in mine ! I’m having a ton of fun with it and it helped curb my social anxiety speaking into a mic . It’s a way to express myself in a fun manner to where I Hope I make someone’s day a little better (:",
            "score": 2,
            "author": "Jrickkk"
        },
        {
            "level": 0,
            "comment": "This is so encouraging! I just finished up my 19th episode. I have 40 or so listeners. I reached out to other podcasters for advice and was so surprised at their helpful suggestions. I am  learning so much through creating a podcast. That's what I love most. I never would have learned about sound editing and things. I love to be learning and this is really stretching me out of my comfort zone.",
            "score": 2,
            "author": "vanillasky22"
        },
        {
            "level": 0,
            "comment": "I've been making media stuff like podcasts and YouTube for years.   \nThe number one rule I follow is to make it fun for you to do, since if you go into the game with money in mind you'll most likely not make it past a few episodes, and also get depressed.  \n\n\nI've found with my most recent podcast has been the least successful in terms of listeners by far, this could be due to a number of factors, the thing is it's by far been the most fun to create and keep up.  Currently getting bellow 10 listeners per episode for about 30 episodes in. Still, might be a few things to tighten up and get working to help that, but currently that's not my focus in life right now.  \n\n\nHigh five back",
            "score": 2,
            "author": "TrojinCat"
        },
        {
            "level": 0,
            "comment": "Amen!  Thank you for helping us all keep perspective.  I've loved the creative outlet podcasting provides.  Several of my family and friends listen to it and that is enough to keep me happy.  Of course, I do what I can to promote it and would love to have thousands of listeners, but so long as it is fun to me, I'll keep going!",
            "score": 2,
            "author": "crimsonlaw"
        },
        {
            "level": 0,
            "comment": "I'd like to accept this award on behalf of the 100 episodes I have produced and the 15-20 listens I get per episode. Going on 5 years strong now! Thanks family members that listen to the show, but don't tell me (or give feedback), the friends I've suckered into listening, and randomly whoever lives in San Jose and Mountain View California, as you are my top two cities despite me living in Canada and knowing no one there!",
            "score": 2,
            "author": "dgapa"
        },
        {
            "level": 0,
            "comment": "This is a great post.  If I impact 1 person, then it's all worth it.",
            "score": 2,
            "author": "itsdebatablepodcast"
        },
        {
            "level": 0,
            "comment": "It's interesting. My numbers get about 600-700 listens per ep over a couple of weeks. Since signing with acast, they've changed what a 'listen' actually is to bring it in line across the industry to promote transparency and ease for advertisers. Before that it was counting about 1,200 and 1,400.\n\nSo by basically having half the numbers, even though I know the parameters have changed, it means that I've lost a bit of the enthusiasm. It's also hard to find the time to write, research, record and edit whilst having a full time job, a 3 hour commute, and 2 young kids.\n\nHowever, I still try and get an episode a week up, but finding it much more difficult. I think the 10 episodes make sense. But as people have said here, it's got to be fun.\n\nI'm not having as much fun as I did have, and I feel a lot of the audience have moved on. I also feel like dipping my toes into producing other podcast series have fallen flat. So at a bit of a crossroads as I should be focusing my attention to other things, but if I take a break again, I know I will lose even more of my audience.\n\nI'm kinda just thinking out loud sorry. But yes, please make sure it's always fun, if it doesn't get the numbers then don't worry. I've got a bit of 'the numbers ' and if anything I've enjoyed it less.\n\nIf you think it's a get rich and famous thing, then don't bother. If it's enjoyable, do it. Why not? All my creative endeavours are because they are just fun to do and they will be around forever. Just enjoy it and stop if you want to stop!",
            "score": 2,
            "author": "anewwinter"
        },
        {
            "level": 0,
            "comment": "Wholesome content",
            "score": 2,
            "author": "thzatheist"
        },
        {
            "level": 0,
            "comment": "Here is the article you requested. Hope it helps. \n\n[https://www.amplifimedia.com/blogstein/2018/8/22/how-many-of-the-550000-podcasts-are-actually-active](https://www.amplifimedia.com/blogstein/2018/8/22/how-many-of-the-550000-podcasts-are-actually-active)",
            "score": 2,
            "author": "Janmmurphy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you very much for sharing it. I'll add it to the post",
                    "score": 2,
                    "author": "Solarbg"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you for recognizing the “little guys” we dedicate a lot of time and effort into the shows we produce and share with our communities large or small!",
            "score": 2,
            "author": "LIFECastPodcast"
        },
        {
            "level": 0,
            "comment": "I think podcasts need the love and time you’d give to your sport or business or dare I say child or pet. You need to be listening to it in order to develop it irrespective of no. of listeners. Kudos to everyone putting in a big effort.",
            "score": 2,
            "author": "TheKnowShow"
        },
        {
            "level": 0,
            "comment": "It’s just fun lol how could you not? If you’re in it for money then you’re probably dumb. Probably.",
            "score": 2,
            "author": "imon1percent"
        },
        {
            "level": 0,
            "comment": "You're the real MPV for taking the time to thank us little guys&lt;3  I'm on episode 14 of my podcast and I usually get 30-100 views (I only post on YouTube) and I appreciate every single one of them!",
            "score": 2,
            "author": "SpeedRacinJason"
        },
        {
            "level": 0,
            "comment": "It's nice to hear this. I do a show and have fun doing it. It's an oversaturated topic but it's so fun.\n\nI've recorded shows with others and have had them on my show too. Podcasters, like horror fans seem to be very close knit, especially those of us smaller shows.\n\nAnd yes, I've heard most shows dont go past 10 either. Probably because they get discouraged or bored or life happens.",
            "score": 2,
            "author": "RockabillyOx"
        },
        {
            "level": 0,
            "comment": "Thanks for this. It's more important to enjoy the process and make that one person's day.",
            "score": 2,
            "author": "zlatan868"
        },
        {
            "level": 0,
            "comment": "I read this post at the perfect time. We just posted our 80th episode (haven't missed a Sunday release since we started) and I was talking about it with a casual acquaintance. They asked how many listeners we had after all this time and when I told them, they said \"oh that's it?\" Not intended to be hurtful but it give me a few moment's pause.  \n\n\nBut hey we have a fantastic time doing it and in many cases it gives us an excuse to hang out together and watch some movies/tv shows we may not have otherwise! Sometimes an email or comment comes in from someone I don't know saying they are enjoying the show and it's moments like that which make it worth it.",
            "score": 2,
            "author": "the_hudge",
            "replies": [
                {
                    "level": 1,
                    "comment": "For people reading this, I would like to give a shout out to this podcast  [So Do We Still Like This](https://anchor.fm/so-do-we-still-like-this) for being awesome and passionate podcasters. Keep it up.",
                    "score": 1,
                    "author": "Solarbg"
                },
                {
                    "level": 1,
                    "comment": "Since I saw some people sharing their shows, I will do the same. You can [find us here](https://anchor.fm/so-do-we-still-like-this/)  . We revisit movies, shows, books and even food from our childhoods/the past to see how we feel about them now. We also try and introduce someone new to it so we can see how does a newcomer feel about Space Jam, 3 Ninjas, and much much more.",
                    "score": 1,
                    "author": "the_hudge"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've been doing my podcast for a year now and I have more listeners than I did when I started, but it's not a huge amount. I'm not concerned about it, though. It's a niche podcast about running, I promote it a lot, at races, have great guests and I even have a sponsor. Growth takes time. I love it no matter the numbers.",
            "score": 1,
            "author": "MarthaRunsFar"
        },
        {
            "level": 0,
            "comment": "Thanks very much! 40 episodes over two years and average downloads is 30!! The real treat is that we enjoy making them and in the future when we are old we can listen back and enjoy!",
            "score": 1,
            "author": "whatsallthataboutpod"
        },
        {
            "level": 0,
            "comment": "Thanks for this. The podcast I'm on doesn't have really any view on our listener base and we got into it for the fun. \nIt's nice to be in such company.",
            "score": 1,
            "author": "Likwidchicken"
        },
        {
            "level": 0,
            "comment": "Thanks for this! My second season has got a few more listeners but my favourite thing is hearing postive feedback from people in my discord 😀",
            "score": 1,
            "author": "BizGamr"
        },
        {
            "level": 0,
            "comment": "Thanks for this!   \n\n\nI basically stopped looking at the numbers a long time ago-now I just make sure it goes live in the right fashion. Doing 2 Episodes/per week since the start, with the most love and happiness (if not more) :)",
            "score": 1,
            "author": "init__27"
        },
        {
            "level": 0,
            "comment": "I started mine just to make my friends laugh and I haven't gotten that many strangers to catch on to it but those that have are tickled by my work the same way my friends are",
            "score": 1,
            "author": "hoofglormuss"
        },
        {
            "level": 0,
            "comment": "I've been thinking the same things - I've just started with my podcast, so it has almost been an opportunity while the numbers are low to make mistakes, to learn, and to figure out all the post-production stuff. It's getting there, and most importantly - it's fun.",
            "score": 1,
            "author": "jonbeckett",
            "replies": [
                {
                    "level": 1,
                    "comment": "p.s. it's at [https://anchor.fm/jonbeckett](https://anchor.fm/jonbeckett) \\- I talk to bloggers and writers each week about their journey :)",
                    "score": 0,
                    "author": "jonbeckett"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My brother and I just announced that we will keep making our episodes even if we are the only people listening to it. We have fun producing it and it is nice having a hobby that is creating versus consuming. \n\nWe launched December 1st and have released an episode every Sunday since and stay about a week or two ahead of schedule. We are going for consistency in release as our primary goal. We average about 40 to 50 downloads an episode and just released episode 12. \n\nLove the hobby and the challenge it presents.",
            "score": 1,
            "author": "LoktheNomad"
        },
        {
            "level": 0,
            "comment": "Hell ya.",
            "score": 1,
            "author": "TheeSpinks"
        },
        {
            "level": 0,
            "comment": "Those who make podcasts for fun and not to profit off of them are the real MVPs. Sure, there is nothing wrong with someone wanting to profit from what they are making, but listening to a true indie podcast being produced for the love of the medium and topic is a thing of beauty.",
            "score": 1,
            "author": "Rob_N_Banks"
        },
        {
            "level": 0,
            "comment": "Yes!  I really like Hysterical History because of this.  And the content of course.",
            "score": 1,
            "author": "aRocks313"
        },
        {
            "level": 0,
            "comment": "We probably have as many episodes we're sitting on as we have released. Not to mention conversations that at the end we say \"...we should've recorded that\". And we do it(and will continue to) all for our handful of listeners.",
            "score": 1,
            "author": "gg8414"
        },
        {
            "level": 0,
            "comment": "I think it's so easy to forget, too, that the listeners your show has have NO idea what your numbers are - they just listen because they like what you're putting out there!  And if it's impacting them in a positive way, but you decide to call it quits because \"your numbers aren't high enough,\" that could totally bum them out.\n\nNot to say you should keep at something when you stop enjoying it, obviously, and you're 100% entitled to stop a show whenever you want to for whatever reason, just a reminder (for myself, too) that impact isn't just measured in numbers!  Love this post!",
            "score": 1,
            "author": "gbird2015"
        },
        {
            "level": 0,
            "comment": "Thanks for the motivation! I'm just staring out, at episode 5 rn and it has been really fun so far. I don't have too many listeners, but I love having these great conversations where I can grow and for someone to enjoy!",
            "score": 1,
            "author": "Someli_Studios"
        },
        {
            "level": 0,
            "comment": "What a wonderful post! While I am seeing steady growth in my podcast, Dr. D’s Social Network, I have to say my main motivation is that I love talking to my guests about really fascinating and unique topics. It just helps with sharpening my verbal sword and increasing my ability to help others in whatever way I can. I love helping others and having a podcast is a really fun and meaningful way to do that. Thanks again for the post! \n\nDarian Parker",
            "score": 1,
            "author": "DoctorDarian"
        },
        {
            "level": 0,
            "comment": "This was super uplifting thanks! I constantly find myself wanting to give up. We have a hard time pulling in more then 10-15 listens sometimes. I have an awesome cohost who keeps me going and wanting to do this. I truly do enjoy this small thing we created. Sorry I sound super cheesy.",
            "score": 1,
            "author": "smileithappens_"
        },
        {
            "level": 0,
            "comment": "Completely agree. Been listening to one as of late and the guy who uploads them to YT gets about 500-1K views and never any comments. But his first season has like 30+ episodes and he still continues. \n\nIt's insane and I love it.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I needed this reminder today!",
            "score": 1,
            "author": "sammiesamiam"
        },
        {
            "level": 0,
            "comment": "Hear hear! Great post. And yes, thanks to those out there doing it!!",
            "score": 1,
            "author": "WeAreClouds"
        },
        {
            "level": 0,
            "comment": "I guess this makes me an MVP. Thanks OP",
            "score": 1,
            "author": "Machine_Fears_Love"
        },
        {
            "level": 0,
            "comment": "Cheers to that. On episode 31 and only get about 30 listeners per episode. Gotta do it for the love, not the numbers!",
            "score": 1,
            "author": "IllumineCollect"
        },
        {
            "level": 0,
            "comment": "My buddy and I gave the movies by minutes treatment to SOUTHLAND TALES for about 5 listeners per episode, two of which were US, and I'd do it again. I got to hang out with my friend and talk about a weird movie. I love his dog too. And we got high. There are so many reasons to commit to your podcast that have zero to do with listeners.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I feel the same. Our community is growing little by little, but very discouraged at the last of day one downloads for a new release. 75 ish. Isn’t cutting it after a year. Very discouraging",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "107 episodes in with about 200 listens an episode, MAYBE, but I enjoy the creative outlet! I appreciate this post &lt;3",
            "score": 1,
            "author": "emhig"
        },
        {
            "level": 0,
            "comment": "Ugh. This. I've had podcasts I love get dropped because the creators weren't getting the listens they were looking for and moved onto something else. Absolutely within their rights, but damn it sucks",
            "score": 1,
            "author": "SortYourRecycling"
        },
        {
            "level": 0,
            "comment": "I used to really care how many listen to my show, 3 years later I don't even check anymore. Its pure fun for me and the evolution of the shows just adds to that.\n\nHigh five back at ya.\n\n(a quick check out of curiosity, 50ish downloads an episode)",
            "score": 1,
            "author": "DeanTheSkip"
        },
        {
            "level": 0,
            "comment": "Our podcast series SP Filmviewers has just started out, only got nearly 10 episodes up, but its fun to discuss the films I watch/rewatch with my partner - and that's the most important thing, having fun :)",
            "score": 1,
            "author": "PP_Dragon"
        },
        {
            "level": 0,
            "comment": "Dude we are also a channel with very few subscribers but we have already recorded a few episodes and plan a timely release. There are a lot op people who push down the new creators. Good to know that there is someone who has some appreciation and understanding on what we go through. Thanks mate.",
            "score": 1,
            "author": "TheCoffeeTableTalks"
        },
        {
            "level": 0,
            "comment": "Thanks, I love you.",
            "score": 1,
            "author": "WriterAN"
        },
        {
            "level": 0,
            "comment": "I feel this, our podcast gets anything between 15-30 listens per episode. (monthly)   \nWe love just doing it to be honest, and despite sometimes with a full time job kids and general life it can be a push with what we do for the podcast, we still manage to get it out.   \n\n\nThere was one episode we had to record 3 separate times and had to record in a totally new way the third time due to issues with the tech and such. Ended up on recording editing and publishing on the last day we could to get it up on the right month.",
            "score": 1,
            "author": "DecadeParade"
        },
        {
            "level": 0,
            "comment": "Thank you for posting this. It gets a little disheartening when you take the time to do the podcast, edit it, and promote it to get 20 listeners. If I didn't get to so it with my friends and enjoy doing it it would be hard to keep going.",
            "score": 1,
            "author": "griftersilladvised"
        },
        {
            "level": 0,
            "comment": "Encouragement is needed! We're about to post our tenth episode and although we are getting slowly increasing download numbers its always nice to hear something positive like this to keep on going! :)",
            "score": 1,
            "author": "VinctoPub"
        },
        {
            "level": 0,
            "comment": "Yeah cool one , my podcast is new and just got 6episodes. I have made some audience but not as much as I do but that’s still keeps me going and delivering and hopefully I’ll grow big soon",
            "score": 1,
            "author": "Hairy-Magician"
        },
        {
            "level": 0,
            "comment": "We are on Episode 23 now, barely any listeners as far as I can tell (I have Podbean analytics and that's it). Sound quality was terrible to start with too, but has improved now. It is our baby and the handful of downloads are really appreciated. We love making it and will carry on, hoping for steady growth. We don't have much money between us at all so advertising and expensive equipment are just not an option for us. We have fun with what we do have though!",
            "score": 1,
            "author": "The-Madhouse-Podcast"
        },
        {
            "level": 0,
            "comment": "Absolutely love this. I’m on year 2 of podcasting and the first thing I discovered is its an absolute grind to get listeners without having clout. But it’s a fun thing to do nevertheless.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I just started my podcast and I haven't had an astronaumical amount of listeners but whenever I tell someone I have a podcast they're ready to listen or ask to be on the show. So I'm taking it day by day and enjoying the process.",
            "score": 1,
            "author": "kikiingwithcoco"
        }
    ]
}