{
    "id": "gpo1wg",
    "score": 721,
    "title": "What are some podcasts like Lore.. but good?",
    "author": "KevinDabstract",
    "date": 1590319194.0,
    "url": "https://www.reddit.com/r/podcasts/comments/gpo1wg",
    "media_urls": [],
    "other_urls": [],
    "postText": "Lore is a super interesting concept, the way it takes on the darker/ more unexplainable side of human history, discusses all that sort of thing that kinda feels like it lurks in the shadows of history.\n\nBut Jesus Christ it's the single most boring podcast in history. The man behind it can't write for his life, it feels stilted and awkward, and he really just meanders until he makes a point but not in an interesting way. So it's really a super wasted opportunity for something that could've been great.\n\nSo are there any podcasts that deal with the same sort of thing but in an interesting way that y'all would reccomend?",
    "comments": [
        {
            "level": 0,
            "comment": "I make a podcast that deals with material in the same vein called Dark Histories. To be completely honest, you may just find it equally as boring though, since it's another one man show. Have a look if you fancy it. It deals with the same sort of fringe history, from old medieval folklore to Victorian poisoners. In the early days I didn't really target any specific era, but I find myself carving out a niche in the Victorian/Georgian period quite a lot these days, though I do try and break it up. In general I tend to approach stuff from a sceptical viewpoint and examine the social history rather than \"I'm not saying it was ghosts but.. GHOSTS.\" [This is the Website if you do fancy it.](http://darkhistories.com)\n\nOthers that I enjoy are [Blurry Photos](http://www.blurryphotos.org/) and [Monster Talk](https://monstertalk.skeptic.com/).",
            "score": 132,
            "author": "lemonsodahair",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love Dark Histories! Thank you for your hard work, deep dive research, and great insights.",
                    "score": 48,
                    "author": "LaBigotona",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My absolute pleasure and thank you for listening!",
                            "score": 27,
                            "author": "lemonsodahair"
                        },
                        {
                            "level": 2,
                            "comment": "Mate, your podcast is the best! Just put a friend onto to it for lockdown listening and he devoured the lot in a couple of days. Thanks for all your hard work!",
                            "score": 18,
                            "author": "comajones"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'll be sure to check it out!\n\nAlso I don't particularly have anything against one man band podcasts, I actually prefer them, just the host of Lore is superrrr boring. The Memory Palace is my favourite podcast ever just bc it's one man bandish haha",
                    "score": 23,
                    "author": "KevinDabstract",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "ahhh I love memory palace too! Hope you get on with it :)",
                            "score": 11,
                            "author": "lemonsodahair"
                        },
                        {
                            "level": 2,
                            "comment": "I feel the same about Lore and Cabinet of Curiosities. The subjects are fantastic, but Aaron Mahnke's voice is grating and his \"wordplay\" is annoying (and I LOVES me some wordplay). But Noble Blood is really good, mostly because Mahnke isn't narrating.",
                            "score": 11,
                            "author": "bonechompsky",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Love Noble Blood!",
                                    "score": 1,
                                    "author": "imangryignoreme"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Definitely check out Blurry Photos. When it was two hosts it was brilliant. (It may still be with the one host, I just haven't listened since then.)",
                            "score": 2,
                            "author": "enfanta"
                        },
                        {
                            "level": 2,
                            "comment": "Came here to suggest Memory Palace, it's so well done!",
                            "score": 2,
                            "author": "chapmanh9"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I really like your podcast! I’d definitely recommend it to OP",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you!",
                            "score": 2,
                            "author": "lemonsodahair"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I love your show! I started listening a few months ago!",
                    "score": 2,
                    "author": "paradoxical_pandas"
                },
                {
                    "level": 1,
                    "comment": "Love Dark Histories!",
                    "score": 2,
                    "author": "w1ddersh1ns"
                },
                {
                    "level": 1,
                    "comment": "Loved your two-parter on Roch Thériault! Need to burn through the rest of your catalogue.",
                    "score": 2,
                    "author": "PristineDecision"
                },
                {
                    "level": 1,
                    "comment": "Dark Histories is one of my favorite podcasts of all time. I have been listening for years. Ben writes and tells a great story. Would highly recommend. Check it out.",
                    "score": 2,
                    "author": "VonnDB"
                },
                {
                    "level": 1,
                    "comment": "Subscribed :)",
                    "score": 2,
                    "author": "totoropoko"
                },
                {
                    "level": 1,
                    "comment": "I love Dark Histories.",
                    "score": 1,
                    "author": "PogueBlue"
                },
                {
                    "level": 1,
                    "comment": "I LOVE your podcast. It's so well researched and your voice is so soothing.",
                    "score": 1,
                    "author": "Fran_From_Bethel"
                },
                {
                    "level": 1,
                    "comment": "Great podcast .. love lore too",
                    "score": 1,
                    "author": "MUFCmattrn"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think you might like Radio Rental. It’s the opposite of Lore",
            "score": 44,
            "author": "nineteensixty",
            "replies": [
                {
                    "level": 1,
                    "comment": "I need new episodes of this soooooo bad!",
                    "score": 17,
                    "author": "baddies_n_nightgowns",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "God, me too",
                            "score": 7,
                            "author": "nineteensixty"
                        },
                        {
                            "level": 2,
                            "comment": "I know I thought it would be out by now!",
                            "score": 3,
                            "author": "Failsafe88"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ugh I need MORE! Rainn Wilson is such a genius on it.",
                    "score": 7,
                    "author": "astra_galus"
                },
                {
                    "level": 1,
                    "comment": "I actually like Lore, but Radio Rental is my jaaam. Anyone have any updates on new episodes? I feel like I’ve been checking in for months now!",
                    "score": 3,
                    "author": "Skwr09"
                },
                {
                    "level": 1,
                    "comment": "The airplane episode was out of this world",
                    "score": 3,
                    "author": "Hormiga95",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Which podcast is that from?",
                            "score": 1,
                            "author": "thegameksk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Radio Rental, first episode.",
                                    "score": 1,
                                    "author": "Hormiga95",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; Radio Rental, first episode.\n\nTY",
                                            "score": 1,
                                            "author": "thegameksk"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you so much for this! First episode was very gripping!",
                    "score": 1,
                    "author": "imlazyyy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Criminal with Phoebe Judge",
            "score": 35,
            "author": "xxXmgXxx",
            "replies": [
                {
                    "level": 1,
                    "comment": "One of my favorite podcasts. \n\nThis is Love is good too.",
                    "score": 5,
                    "author": "43percentmarshmallow"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Noble Blood! Great storytelling, good voice, honestly, my only complaint is episodes are too short. (I couldn’t get through even 1 episode of Lore)",
            "score": 15,
            "author": "imbeingsirius",
            "replies": [
                {
                    "level": 1,
                    "comment": "man I love podcasts with short episodes, I'm a bigger at heart, so that sounds right up my way! thanks!",
                    "score": 3,
                    "author": "KevinDabstract"
                },
                {
                    "level": 1,
                    "comment": "This is the same production group as Lore too.. but I agree! The host of Noble Blood just started a new one called Popcorn Book Club to delve into book-to-film things",
                    "score": 2,
                    "author": "spaceistheplaceace"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lore used to be really really good and to an extent I still enjoy it today (as more of a sleep aid than anything else) but I think the show started to go downhill when Aaron Mahnke the host started taking on other projects.   \n\n\nHe now hosts two other shows, Unobscured and Cabinet of Curiosities while also producing a fair few others and it seems that he no long actually writes the scrips for Lore which I feel explains the somwhat lacklustre recent presentation.\n\nTheres also the fact that however many hundred episodes in I guess you start to just run out of interesting notable spooky shit to write about. \n\n&amp;#x200B;\n\nAs for podcasts in a similar vein that do it well, Unexplained is my personal favourite but might not be your cup of tea if you're sick of the 'monotonic male voice tells you about a ghost' format.",
            "score": 88,
            "author": "MarshallMarks",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve been waiting sooooo long for Unexplained to come back!",
                    "score": 7,
                    "author": "RoRoRicardo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Right!? Got so excited for the lockdown livestresm episode but it was just the Hexham heads episode again... (Which I've been lucky enough to see live in London before!) Always up for some more Richard McLean....... Smith.",
                            "score": 7,
                            "author": "MarshallMarks"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "man I listened to two episodes of Cabinet of Curiosities today, bc it sounded like such an interesting concept and.. that's the worst podcast I've ever heard, hands down. You can tell he's so clearly leaving out so many details to get the \"omg it's so spoooooky effect\", and it already has all the problems of Lore only doubled. Really can not reccomend.",
                    "score": 31,
                    "author": "KevinDabstract",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah i found cabinet super underwhelming and unaubscribed after the first few.",
                            "score": 12,
                            "author": "MarshallMarks"
                        },
                        {
                            "level": 2,
                            "comment": "Listened to a few episodes until I realized that ever story ended with some kind of Einstein twist. Lore hasn't been good in years.",
                            "score": 6,
                            "author": "penis-penis_penis"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’m Richard McLean ... *weird kind of long pause* ... Smith. I love him!",
                    "score": 5,
                    "author": "peachesnjeans",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "During the live show he definitely played the pause up, hes self aware hahaha",
                            "score": 1,
                            "author": "MarshallMarks",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I love that. Hope he is able to put out new eps soon, I really miss him!!",
                                    "score": 1,
                                    "author": "peachesnjeans"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I dunno, when unsubscribed I sorted oldest to newest and the first ep was vampires. A little overdone, but that’s fine. Nope, it was mostly about Vlad the Impaler with some new info I hadn’t heard about another historic figure. It wasn’t enough of a new angle for me to listen to more.",
                    "score": 3,
                    "author": "Givemeallthecabbages"
                },
                {
                    "level": 1,
                    "comment": "I distinctly remember getting The Axeman of New Orleans (title like that), episode 25 or 30 or so. Last one I enjoyed. He just became harder to enjoy after that.",
                    "score": 1,
                    "author": "hoodatninja"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The stories would be interesting, but the tangents on how they tell us something about the human condition are really cheesy and delivered like they're deeply profound. Every time he says *you see, X is a lot like Y* I immediately mentally check out.",
            "score": 92,
            "author": "OutlookFair"
        },
        {
            "level": 0,
            "comment": "Astonishing legends is perfect for this. Long episodes, well reserarched and produced with minor sound effects to high standards to immerse you in it. Astonishing legends is the one to listen to",
            "score": 43,
            "author": "miggins1610",
            "replies": [
                {
                    "level": 1,
                    "comment": "I second this! Really good podcast with the exact kind of thing you are looking for",
                    "score": 8,
                    "author": "Kalypso13",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I third!  The guys are much more energetic and inquiring than whatzisname on Lore. I don’t listen much anymore, because the eps are long and my interests are more in the true crime arena. But their episodes on Amelia Earnhardt are really good!",
                            "score": 5,
                            "author": "malhoward"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I love Astonishing Legends, they get a bit out there sometimes. I am very skeptical, but they do good research and put a lot of time into the show.\n\nIf you want to go on the flip side, Just a Story is amazing they deal with more historical stuff. And their side podcast Audio Dime Museum is really good too.",
                    "score": 7,
                    "author": "Failsafe88"
                },
                {
                    "level": 1,
                    "comment": "I LOVED this podcast so much but they started to make more and more episodes about ghosts and paranormal and sadly that's not my cup of tea. I still check from time to time episodes that I might find appealing though.",
                    "score": 7,
                    "author": "godril90"
                },
                {
                    "level": 1,
                    "comment": "I like their one-off episodes but their series are soooooo long. Sometimes the minutiae becomes brain-numbing.",
                    "score": 3,
                    "author": "marshmallowicing"
                },
                {
                    "level": 1,
                    "comment": "I really adore those guys so much.  They really do come at each topic with everything they've got; they're fantastic researchers and deal out healthy doses of skepticism when the topic warrants it.  \n\nThey really helped me survive a year of third shift at an aging Kirkbride Asylum after I graduated college.",
                    "score": 2,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "But it's not eerie like Lore. It's presented as though it were factual information.",
                    "score": 2,
                    "author": "i-touched-morrissey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don't see you reccommending anything else. This imo is the closest out there. If you think theres something better go ahead",
                            "score": -4,
                            "author": "miggins1610",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh, but I did. And I listen to AL every time there's a new episode. Lore is more literary while AL is more fact-based.",
                                    "score": 6,
                                    "author": "i-touched-morrissey",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Magnus is an audio drama. Nothing really close to lore. Lore is non fiction storytelling. AL is non fiction and presented more factually yes but still in a sort of story way",
                                            "score": 2,
                                            "author": "miggins1610",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I don't think Lore is non-fiction in the sense that fairies are real or changelings really happened or ghosts exist, but the belief in these things is historically real.",
                                                    "score": 2,
                                                    "author": "i-touched-morrissey"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you haven’t given it a try, listen to The Conspirators. It reminds me a lot of Lore, but the narrator is a bit more colorful a character , and tells a good story. It’s also really not much about conspiracy theories, but just really interesting topics. I rarely see it mentioned anywhere , but believe it deserves more attention. I find it educational, entertaining, and a fun listen.",
            "score": 11,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I have been on the lookout for a similar podcast but haven't found anything yet. Best I have is some episodes of Stuff to Blow Your Mind, Skeptoid and maybe Myths and Legends.\n\nThe problem with most podcasts that deal primarily with the unexplained phenomenon is that they are a little too eager to believe it all. There is zero enquiry, or critical thought and more emphasis on attempts to scare the listener.\n\nBut if a scare is what you are looking for then maybe Spooked?",
            "score": 43,
            "author": "totoropoko",
            "replies": [
                {
                    "level": 1,
                    "comment": "+1 for Spooked. The narrator (Glynn Washington) has an amazing radio voice and the stories are told by the people who actually experienced them. \n\nHe also did a series on Heavens Gate that was very well done.",
                    "score": 14,
                    "author": "NomTook"
                },
                {
                    "level": 1,
                    "comment": "+1 for Myths and Legends. It's not got the same dark tone as Lore, and it's definitely more based on old literature, but the storytelling is top notch and the host interjects some more humour and life into it.",
                    "score": 17,
                    "author": "mattfolio",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Another plus one for Myths and Legends, as well as a rec for Unexplained (which someone mentioned above!)",
                            "score": 10,
                            "author": "fantasticfoodhistory",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Another plus one for Myths and Legends. I so wanted to enjoy more, but I can’t get past his voice.  There’s just something about it. I love the setup of Myths and Legends episodes.",
                                    "score": 2,
                                    "author": "sraydenk"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "man skeptoid seems like exactly what I was looking for from Lore. Thanks for the reccomendation!",
                    "score": 7,
                    "author": "KevinDabstract",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In the opposite direction are old episodes of Coast to Coast. They’re so interesting, fun and hilarious at times. The host had a great way if handling callers and letting them talk. Treating them with respect even though they were calling in about giant birds carrying children off to the nests of lizard people.",
                            "score": 5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Art Bell and George Norry always made me laugh by acting like the people calling weren't complete nutters.",
                                    "score": 8,
                                    "author": "Abadatha"
                                },
                                {
                                    "level": 3,
                                    "comment": "If you like Coast to Coast you might like the podcast Monsters Among Us. The format is very similar with people calling in and the host comments at the end of the calls. Sometimes he suggests logical explanations but he also totally entertains the wild theories too. Imo it's fun listening to people tell their weird tales in their own words/voices-- maybe I enjoy the human interest aspect even more than the spooky cryptids haha. Either way, I reccomend the pod!",
                                    "score": 3,
                                    "author": "shedoesntknowwhy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thanks!",
                                            "score": 1,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Dude so much this. Coast to Coast is what got me started on paranormal radio. If we are going down this rabbit hole then apart from some Art Bell Coast to Coast on YouTube, Mysterious Universe also touches on some content similar to Lore but the hosts are very charismatic and sound like they enjoy hanging out as much as researching their content.",
                                    "score": 2,
                                    "author": "El-Lobo-Loco"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If you enjoy Skeptoid, you might enjoy Monster Talk. They get a little goofy sometimes, but they discuss paranormal things with actual researchers and experts. It was the first podcast I found where the hosts were genuinely interested in the paranormal but able to look at it objectively without believing everything little thing.",
                            "score": 1,
                            "author": "Donna_Smeagol"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not exactly the same genre but History of Rome by Mike Duncan is great because he breaks down the, well, entire history of Rome, but separates information that was most likely propaganda from the actual fact and points out motifs and reoccurring themes in their propaganda that further pushed their ideals and all.",
                    "score": 5,
                    "author": "SammyMhmm",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;Mysterious Universe \n\nHistory of Rome is an amazing Podcast!",
                            "score": 1,
                            "author": "thegameksk"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you like Myths and Legends (which I totally do) there’s a Greek Mythology podcast called ‘Myths Baby’ which is an awesome sometimes snarky, feminist, and always entertaining.",
                    "score": 2,
                    "author": "ConfusedGuildie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Our Fake History is great.  Separates truth and myths of popular and weird history.  https://ourfakehistory.com/",
            "score": 8,
            "author": "secretSanta17"
        },
        {
            "level": 0,
            "comment": "Not joking: Lore is my go-to insomnia podcast bc it literally sends me to sleep every time. Never have heard a whole episode.",
            "score": 15,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Timesuck",
            "score": 7,
            "author": "CanyonPegger"
        },
        {
            "level": 0,
            "comment": "Casefile has some episodes which are more mystery-themed than just straightforward true crime, and it’s really listenable (much moreso than Lore) but I completely agree with you - great concept ruined by a style I can’t enjoy.",
            "score": 16,
            "author": "hashtagcrunkjuice",
            "replies": [
                {
                    "level": 1,
                    "comment": "I like Casefile, but dear mother of god the amount if ads.",
                    "score": 6,
                    "author": "Lordmonocrona"
                },
                {
                    "level": 1,
                    "comment": "Your mileage may vary on Casefile - I can't listen to it at all because it's so monotone. I keep going back to try because it's so highly regarded, but I unfortunately zone out every time.",
                    "score": 6,
                    "author": "despitethenora",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I really burnt myself out on Casefile due to the bland nature of it. Swindled is a great example of a monotone voice that is listenable because of the great production value of the music and writing. Wish Casefile was that way.",
                            "score": 7,
                            "author": "DruggistJames",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Swindled is so good.",
                                    "score": 4,
                                    "author": "time4listenermail"
                                },
                                {
                                    "level": 3,
                                    "comment": "Huh, I actually think the Casefile writing is stronger than the Swindled writing. I’m not a fan of all his little side comments, I find them a lil cheesy.",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I find him mostly funny but we can agree his production value is top notch.",
                                            "score": 1,
                                            "author": "DruggistJames"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I've listened to several full episodes, but I couldn't tell you which ones or what happened in them. It's so unfortunate - I know it's well researched! I just can't listen to it.",
                                    "score": 2,
                                    "author": "despitethenora"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Omg I always see it mentioned on here and I was like what am I missing??? it's so monotone I absolutely cannot stand it.",
                            "score": 3,
                            "author": "sierraeve"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Unexplained is really good, but it doesn't really go into the history of folk lore. It's definitely a good listen though.",
            "score": 5,
            "author": "boobiesrkoozies",
            "replies": [
                {
                    "level": 1,
                    "comment": "Surprised more people didn't add that as well. It's not my favorite, but it's certainly worth checking out at least for a few episodes. Really enjoyed his episode on the Dyatlov Pass Incident.",
                    "score": 2,
                    "author": "abox4711"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Unexplained, Unexplained Mysteries, Morbid Curiosity, Strange Matters, Bedtime Stories*, Futility Closet.\n\nI'm with you on Lore, 100%; overhyped, guy has no narrative voice whatsoever.\n\n*EDIT: There are several podcasts with this name--I'm talking about [this one](https://podtail.com/en/podcast/bedtime-stories-1/)",
            "score": 13,
            "author": "capsaicinintheeyes",
            "replies": [
                {
                    "level": 1,
                    "comment": "The voice.... the worst part of it",
                    "score": 5,
                    "author": "CountOrlocksEars"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Know exactly what you mean, never understood the popularity. I love \"Historium\", I don't know why it isn't hugely well known, the topics are fascinating,not always creepy but usually so. The research is deep but most importantly the guy always finds the best angle to bring it to life. He only does an episode like once or twice a month but every episode just blows my mind, sometimes in relation to stuff I have never even heard of. I recommend \n\n\"The Cages of Münster\" \nThe story of a bizarre Anabaptist revolution in 1500s Germany, they take over a city, people starve, orgies, skin flaying, and an ill advised war that they were sure they would win, it's got it all.\n\n \"Last of his Kind\" \nThe tragic story of Ishi, last of the Yahi tribe. Have some tissues ready.\n\n\"The Second Son of God\"\nTaiping rebellion, China,1850, guy decides he is the second coming of Jesus, 30 million people die.yep, it gets weird.\n\n\"Dark Tide\"\nA silo of molasses bursts in Boston, dozen are killed as entire streets are filled with brown gold, many health and safety laws are proposed for the first time in America.\n\n\"The Battle of Blair Mountain\" \n1921, West Virginia  thousands of coal miners strike in the biggest armed uprising since the Civil War, the U.S. government ultimately resorts to using the Air Force to bomb them off the mountain killing hundreds, largely it is a forgotten war.\n\n\"The Great Emu War\"\nAustralia once declares war on a bunch of birds(no really), and lost.(yes really)\n\n\n\n\"Almost a Thousand\" \nChristman Genipperteinga may well be the world's most prolific serial killer, and reportedly left 960 bodies in a cave in Germany. We see this through the eyes of the woman he held captive for seven years and impregnated multiple times, absolute nightmare fuel.\n\n\"Still They Danced\"\nThe fatal dancing plague of Medieval Europe, thought to have been caused by ergot poisoning.\n\n\"Landmark\"\nThe 1839 slave rebellion, in which we get a small taste of the life of a slave on the sugar plantations of the Caribbean, honestly it haunts me months later to think about what those people went through, should be required reading for every school kid if it wouldn't scar them for life.\n\n\"The Man Who Saved The World\"\n The story of Vasili Arkopov, he saved your life and the life of everyone you know.",
            "score": 12,
            "author": "BubbleGuts01",
            "replies": [
                {
                    "level": 1,
                    "comment": "omg that sounds right up my street! kinda reminds me of The Memory Palace, maybe just the way you described it idk, so I'll definitely have to be sure to check this one out!",
                    "score": 2,
                    "author": "KevinDabstract",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Enjoy! 👍",
                            "score": 1,
                            "author": "BubbleGuts01"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think \"Dirty History\" is the podcast you're looking for. The whole concept of the show is to cover topics often overlooked because they are dark or extreme.",
            "score": 5,
            "author": "Jawa4200"
        },
        {
            "level": 0,
            "comment": "I think it’s his voice. He has the most boring voice and his inflections are weird and wrong haha.",
            "score": 10,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I don’t know why more people aren’t suggesting Unexplained podcast. I feel like I’ve been a cheerleader on reddit for him but RMS puts out a quality podcast and has a pretty decent backlog.",
            "score": 3,
            "author": "MichaelFraust"
        },
        {
            "level": 0,
            "comment": "I thought I was the only one who hated it! Thought it would give insight into the origins of the stories and how they evolved (that is what I was interested in). It’s the most cringe thing I’ve listened too",
            "score": 3,
            "author": "bungledbees"
        },
        {
            "level": 0,
            "comment": "lore be like \\*interesting half fact\\* \\*5 minutes of 3 piano notes over ambience\\* \\*rest of fact\\*",
            "score": 3,
            "author": "temple2temple2temple"
        },
        {
            "level": 0,
            "comment": "I hated that podcast, too! It felt like the dude was reading a Wikipedia article. \n\nMyths and Legends is good but it's less about dark history and more about mythology. But some mythology is dark!",
            "score": 3,
            "author": "AssMaster6000"
        },
        {
            "level": 0,
            "comment": "Knifepoint Horror is straight up the best horror podcast. Doesn't get enough credit or attention. The writing and storytelling is just so tight and somber.",
            "score": 2,
            "author": "mas_one"
        },
        {
            "level": 0,
            "comment": "You should try Pleasing Terrors, it basically covers everything you wanted from Lore. Mike is an amazing storyteller, which presumably comes from his years working as a ghost tour guide.",
            "score": 2,
            "author": "KnockOnce_ForYes"
        },
        {
            "level": 0,
            "comment": "Creepypod.com",
            "score": 2,
            "author": "MoBetta77"
        },
        {
            "level": 0,
            "comment": "Bedtime Stories.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Box of Oddities is amazing and the hosts, Jethro and Kat, are some of the funniest people I have listened to in a podcast.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Try the loremen podcast. Interesting and funny",
            "score": 2,
            "author": "elamb127"
        },
        {
            "level": 0,
            "comment": "I have another podcast much like u/lemonsodahair called \"Mania\". It has the usual themes of darker stories, and much like lemons', it's all painfully researched and strives for historical authenticity. I only dip into folklore every now and then, though. I'm more prone to factual stories and individuals that are nefarious in nature. *Mania* investigates the 1300's - early 1900's.\n\nWhere it differs from other horror podcasts is that the tales are told with a spotlight on the *antagonist.* Rather than vilifying them, *Mania* attempt to understand and tell the story from *their* perspective, even if they're downright villains. I also weave fiction into the story if historical recounts have missing details, and then I sparse out what's true and false at the end.\n\nI derive a lot of my descriptions of death and other macabre details from my real-life experience as an undertaker. I like to think it adds some real spice.\n\nThe tagline of the show is *\"These are the stories of monsters whose voices are lost in history.\"*\n\nWhat a lot of my listeners enjoy is my particular style with prose and storytelling. I've been writing dark fiction for six years--hopefully it counts for something. It's funny what you said about *Lore*, basically the only reason why I got up and started my own podcast was that I was so fed up with his execution of such a great concept, I decided to come up with my own twist.\n\nI'll leave [Mania's website here](http://harlequingrim.com) for anybody who might be interested.",
            "score": 2,
            "author": "Harlequin-Grim",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just subscribed. Thanks!",
                    "score": 1,
                    "author": "subsetsum"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Try Memory Palace. His voice is soothing AF.",
            "score": 2,
            "author": "simbaismylittlebuddy"
        },
        {
            "level": 0,
            "comment": "Sawbones is great but not at all spooky. It’ll give you that nasty history fix but also leave you smiling",
            "score": 5,
            "author": "d_chs",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve always wanted to like sawbones, but there’s something about the dude narrator that I find so obnoxious",
                    "score": 4,
                    "author": "nineteensixty",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is it because he acts stupid? I'm having a break from sawbones and trying to remember why he grated on me occasionally",
                            "score": 4,
                            "author": "Everest_95"
                        },
                        {
                            "level": 2,
                            "comment": "Justin McElroy? That's just his personality. But yeah, I'm a big fan of the McElroy brothers but they can be annoying and grating sometimes - I have to take long breaks from their podcasts from time to time.",
                            "score": 7,
                            "author": "magic_is_might"
                        },
                        {
                            "level": 2,
                            "comment": "If you like a legal version of it, try Court Appointed. It’s produced by friends of the McElroy’s that are much, much more tolerable. Tagline is: “A lawyer and a dude.”",
                            "score": 2,
                            "author": "BigbyWolf343"
                        },
                        {
                            "level": 2,
                            "comment": "I found him super obnoxious at first too, but after listening to the Adventure Zone, he really grew on me.",
                            "score": 2,
                            "author": "lailaaah"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Myths and Legends with Jason Wiesner, it focuses less on history and more on well, myths and legends, but it has the feel I think you may be looking for.",
            "score": 3,
            "author": "The_400076th_pawn",
            "replies": [
                {
                    "level": 1,
                    "comment": "An excellent writer when compared to Aaron Mehnke",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m Pursuit of Knowledge is a great new History Podcast. Not sure if it falls exactly under the same category but it’s definitely worth the listen for those who love history. [Spotify - In Pursuit of Knowledge ](https://open.spotify.com/show/4lPOTe1Fs9rbDgcLvJf0Ug?si=8n1qSwYjThCruR1NY0SSIQ)",
            "score": 1,
            "author": "Ludorew_Media"
        },
        {
            "level": 0,
            "comment": "Real life ghost stories is pretty fun, they do supernatural stuff but also like legends and other topics. One that has similar content which you might prefer is the conspirators at one point they were covering the same stories for a few weeks and I preferred the conspirators take and story telling on them",
            "score": 1,
            "author": "cmlea1"
        },
        {
            "level": 0,
            "comment": "I came here to reccomend Dark Histories and Astonishing Legends but it looks like those are already getting talked up so I just wanna second those, they're both great. A few less popular ones I really like are Strange Matters and Just a Story. Strange Matters took a minute to find their footing so the earlier episodes sound very different but I really enjoy their show. Just a Story does amazing research, but their hosts have a lot of personality, so you'll hafta see if it's the kind of show you like. I also wanna throw in Stuff You Missed in History class, it's more lighthearted but occasionally delves into creepier content.",
            "score": 1,
            "author": "TopGolfUFO"
        },
        {
            "level": 0,
            "comment": "You may enjoy the Memory Palace, and if you don't, at least they are really short.",
            "score": 1,
            "author": "EatYourCheckers"
        },
        {
            "level": 0,
            "comment": "Hallowed Histories is good, but very specific to the UK.",
            "score": 1,
            "author": "wackashell"
        },
        {
            "level": 0,
            "comment": "If you want a good laugh while listening yo weird stories, try : This paranormal life.",
            "score": 1,
            "author": "mademoiselle_mimi"
        },
        {
            "level": 0,
            "comment": "I've been enjoying Noble Blood a lot recently, and if you don't mind dark subjects being treated in a lighter way, I would strongly recommend Sawbones, which looks at medicine and the often wild ways it's made people behave throughout history (grave robbing, riots, scams, kidnappings, etc.)",
            "score": 1,
            "author": "lailaaah"
        },
        {
            "level": 0,
            "comment": "I'm trying to get into The Magnus Archives, but it kind of gets tedious. Still pretty creepy though.",
            "score": 1,
            "author": "i-touched-morrissey",
            "replies": [
                {
                    "level": 1,
                    "comment": "honestly I tried going through that bc I'm a nightvale Stan and I really just can't get the hype tbh",
                    "score": 1,
                    "author": "KevinDabstract"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some podcasts that I listen to are:\n\nCryptid Cartography- they pick a random place on Google Earth and find mysteries, cryptids, and more in that area\n\nThree Spooked Girls is also pretty good they go into conspiracies, mysteries, and hauntings.\n\nYour Haunted Holiday is good too because they go to specific places and they talk about their experiences.",
            "score": 1,
            "author": "curlyconspiracies"
        },
        {
            "level": 0,
            "comment": "Kowabana :true Japanese scary stories is the only one I can think of that I didn't notice mentioned already.",
            "score": 1,
            "author": "Grendelsire"
        },
        {
            "level": 0,
            "comment": "Mortis media",
            "score": 1,
            "author": "gmastermike"
        },
        {
            "level": 0,
            "comment": "Some to check out are The White Vault, Tania, Rabbits. I’ve never listened to lore, but those are good ones to check out.",
            "score": 1,
            "author": "Lynda73"
        },
        {
            "level": 0,
            "comment": "Most of these have already been mentioned, but here are ones I listen to:\n\n&amp;#x200B;\n\n* Astonishing Legends\n* Mysterious Universe\n* Mythical Monsters (by parcast)\n* Mythology (by parcast)\n* Myths and Legends\n* Our Fake History\n* Skeptoid\n* Supernatural with Ashley Flowers (by parcast)\n* Tales (by parcast)\n* Unexplained Mysteries",
            "score": 1,
            "author": "-Unverified-",
            "replies": [
                {
                    "level": 1,
                    "comment": "Parcast has such a generic feel, I listened to Cults and hearing the exact same disclaimers every episode will drive a man crazy. We get it, you aren't professional (insert blank) but you have done a lot of research for the show. Ugh",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Audio Dime Museum. It's a bit more theatrical but absolutely well done an i love it. Only problem is there aren't many, and they have stop producing them.",
            "score": 1,
            "author": "Failsafe88"
        },
        {
            "level": 0,
            "comment": "Well, I was going to recommend the Memory Palace but it looks like you're already into that. So instead I'll recommend Myths and Legends as well as Fictional. Both are done by the same guy. He has a dry humor that I really enjoy.\n\nAs the name suggests, Myths and Legends is myths and legends from around the world. Since there are a lot of version of different stories, he'll generally pick and choose what makes the most sense narratively, but will also mention what he's left out or the gist of alternate versions.\n\nFictional is him telling crib notes versions of classic literature. It's funny, and it's nice getting the basics of each story that I personally would have never read.",
            "score": 1,
            "author": "mstarrbrannigan"
        },
        {
            "level": 0,
            "comment": "Spirit podcast does lots of spooky ghost stories and fantasy creatures.",
            "score": 1,
            "author": "whenindebt"
        },
        {
            "level": 0,
            "comment": "If you’re into medical history:\n- sawbones\n- this podcast will kill you\n\nIf you like true crime, which also covers various things like the mothman and generally cool stories that are not always crime related.\n- my favorite murder\n- the murder squad\n\nI like the premise of Lore but also have the same issues you do with it.",
            "score": 1,
            "author": "cinnamonduck"
        },
        {
            "level": 0,
            "comment": "Mysteries Abound",
            "score": 1,
            "author": "Lemonjello23"
        },
        {
            "level": 0,
            "comment": "The adventure zone",
            "score": 1,
            "author": "Baby-Baphomet"
        },
        {
            "level": 0,
            "comment": "Astonoshing Legends may fit the bill for you.",
            "score": 1,
            "author": "simplejack66"
        },
        {
            "level": 0,
            "comment": "Warhammer 40k podcasts are from the grimdark future.",
            "score": 1,
            "author": "hi2019wasdead"
        },
        {
            "level": 0,
            "comment": "Unexplained &amp; Astonishing Legends",
            "score": 1,
            "author": "chriscove"
        },
        {
            "level": 0,
            "comment": "Dan Carlings hardcore historys",
            "score": 1,
            "author": "myc89"
        },
        {
            "level": 0,
            "comment": "The Memory Palace",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Please explore Knifepoint Horror.  The guy is a genius. Start a year or two back and work forwqrd.",
            "score": 1,
            "author": "smazsyr"
        },
        {
            "level": 0,
            "comment": "This is kinda the basic batch of history podcasts but if you haven't tried Dan Carlin's Hardcore History podcasts you're really missing out. For that really dark stuff I'd try his series on WW1 or the one about the Khans. I forget the names of either series but he does a great job of creating a historical narrative that is both entertaining and informative. He does a single longer episode about Imperial Japan invading China, that ones pretty dark too.",
            "score": 1,
            "author": "ElessarKhan"
        },
        {
            "level": 0,
            "comment": "Supernatural with Ashley Flowers\nSimilar stories but she delivers them straight, no meandering or stringing disparate stories together, brings in a tiny bit of explanation/ science without \ndebunking, more just when reality is stranger than fiction. Very fun podcast.",
            "score": 1,
            "author": "StrangeYam5"
        },
        {
            "level": 0,
            "comment": "Mysterious universe is good. They cover a wide range of stuff so every episode won’t hit what subject you are looking for but look at the website and previous episodes for one you are interested in. It’s pretty funny at times as well",
            "score": 1,
            "author": "greylienS13"
        },
        {
            "level": 0,
            "comment": "I’m a huge fan of Myths &amp; Legends",
            "score": 1,
            "author": "War34Eagle"
        },
        {
            "level": 0,
            "comment": "I went from lore to old gods of Appalachia and while not exactly the same it is hands down the best podcast I've ever listened to and scratches a very specific itch I didnt even realize I had",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "\"Spooked\" by snap judgement. So good",
            "score": 1,
            "author": "Le_Tree_Hunter"
        },
        {
            "level": 0,
            "comment": "Royal Blood is really good, the guy from Lore is a producer but its a different voice and writer and its much better IMO",
            "score": 1,
            "author": "thisquadrantisntsafe"
        },
        {
            "level": 0,
            "comment": "Try Myths and Legends",
            "score": 1,
            "author": "lime-link"
        },
        {
            "level": 0,
            "comment": "It's pretty successful. Has a tv adaptation etc. I can't listen to it because it puts me to sleep.",
            "score": 1,
            "author": "playtrix"
        },
        {
            "level": 0,
            "comment": "Cold Case Murder Mysteries has been very entertaining. The podcast host goes deep in to the psychological aspect of the murders. His take on evolutionary reasoning is very interesting.",
            "score": 1,
            "author": "mimoparkins"
        },
        {
            "level": 0,
            "comment": "I'd definitely recommend Timesuck, the host is hilarious but does a good job when they tackle some of the horror/true crime/dark history topics. He also has a podcast with his wife called Scared to Death that is great if you're just looking for paranormal stories. Both have a fair amount of comedy injected as well, it that's what you're in to!",
            "score": 1,
            "author": "SanguineP3nguin"
        },
        {
            "level": 0,
            "comment": "I really like mysterious universe.",
            "score": 1,
            "author": "VoodooLabs"
        },
        {
            "level": 0,
            "comment": "My fave is Jim Harold’s Campfire!  People call in with true creepy paranormal experiences.",
            "score": 1,
            "author": "jennie_mac_"
        },
        {
            "level": 0,
            "comment": "I really enjoy The Ghost Story Guys. Two very smart Canadian authors with personal paranormal experiences and a penchant for blue humor.",
            "score": 1,
            "author": "cinnysuelou"
        },
        {
            "level": 0,
            "comment": "Spooked with Glynn Washington is really amazing. It’s pretty different than Lore but in the same vein. Glynn Washington is a really amazing storyteller.",
            "score": 1,
            "author": "MostGuest7"
        },
        {
            "level": 0,
            "comment": "Rusty quill is always fun, its like lore with a over arching story in the background",
            "score": 1,
            "author": "Nyakun"
        },
        {
            "level": 0,
            "comment": "Box of Oddities, The Conspirators (love it), and of course, Bigfoot for Breakfast 😁!!!  Same type of subject matter, but keeps your attention a little more.",
            "score": 1,
            "author": "bigfootforbreakfast"
        },
        {
            "level": 0,
            "comment": "Spirits is a different vibe (two cohosts that are more conversational and chatty but also super well researched) but it’s ok the same subjects and is a delight.",
            "score": 1,
            "author": "perry1236"
        },
        {
            "level": 0,
            "comment": "It’s less supernatural and more true crime but ‘my favourite murder’ is really good. The hosts are really engaging to listen too.",
            "score": 1,
            "author": "madam-pamplemousse"
        },
        {
            "level": 0,
            "comment": "Supernatural with Ashley flowers",
            "score": 1,
            "author": "maripop90"
        },
        {
            "level": 0,
            "comment": "The Conspirators. I literally just posted a rec for it on the sub :)",
            "score": 1,
            "author": "Devils_Advocaat_"
        },
        {
            "level": 0,
            "comment": "I can't recommend the exploring series enough",
            "score": 1,
            "author": "nerdy-gay-werewolf",
            "replies": [
                {
                    "level": 1,
                    "comment": "Like actually I know you probably won't notice this but seriously it's amazing and deals with exclusively lore wonderfully, mainly from the SCP universe but also from DND, lovecraft, and warframe",
                    "score": 1,
                    "author": "nerdy-gay-werewolf"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you think the Lore podcast is bad, you should watch the show on Amazon Prime ugh",
            "score": 1,
            "author": "rae_versace"
        },
        {
            "level": 0,
            "comment": "Mysterious Universe!",
            "score": 1,
            "author": "yama_knows_karma"
        },
        {
            "level": 0,
            "comment": "Ugh if you actually find something I’d be curious. I used to listen to Lore but I just can’t listen to the host anymore. Everything is over explained like he’s trying to teach children. Fascinating content, terrible execution.",
            "score": 1,
            "author": "donotbemad"
        },
        {
            "level": 0,
            "comment": "I like \"Myths and Legends\" a lot. The host retells folk stories and fairy tales with a modern feel to them. He toes the line of calling out how silly most of the stories are, while still respecting the context that they were originally told in. \n\nHe has another podcast that he's starting back up again where he retells short stories from what I think is mostly the 1800's. Equally as good, but he doesn't have nearly as much content produced on that podcast.",
            "score": 1,
            "author": "wannabeknowitall"
        },
        {
            "level": 0,
            "comment": "Last podcast on the left \n\nTimesuck\n\nNo such thing as a fish",
            "score": 1,
            "author": "FootballFriend987"
        },
        {
            "level": 0,
            "comment": "The Last Podcast on the Left covers a load of topics of the creepy and macabre",
            "score": -1,
            "author": "Know_Hope1918"
        },
        {
            "level": 0,
            "comment": "Last podcast on the left?",
            "score": 0,
            "author": "reddave88"
        },
        {
            "level": 0,
            "comment": "You should try The Last Podcast On The Left. It's a comedy show about things like the supernatural, lore, criptids, the occult, true crime, weird/crazy stories, and stuff in that general area. All while making jokes or funny takes on it all. It's not exactly Lore but it plays with that genre a lot and always has fun with it.",
            "score": 0,
            "author": "RubyLocks67"
        },
        {
            "level": 0,
            "comment": "This sounds like some serious resentment.",
            "score": -4,
            "author": "baallday36"
        },
        {
            "level": 0,
            "comment": "Box of Oddities. Does it waaaay better than Lore",
            "score": 0,
            "author": "mf9812"
        },
        {
            "level": 0,
            "comment": "Were you hired?\n\nWhat’re your rates?",
            "score": -4,
            "author": "Ahmad_this_thing"
        }
    ]
}