{
    "id": "grz9ba",
    "score": 1650,
    "title": "Does anyone else find it strange to listen to a podcaster for a long time without knowing what they look like, and then finally watch a video of them talking?",
    "author": "classy_barbarian",
    "date": 1590639344.0,
    "url": "https://www.reddit.com/r/podcasts/comments/grz9ba",
    "media_urls": [],
    "other_urls": [],
    "postText": "It's like my imagined version of what they look like never aligns with that they actually look like in real life and it makes my brain feel all funny.",
    "comments": [
        {
            "level": 0,
            "comment": "Very few podcasters look like how I imagined them when I finally look them up, but the most shocking one to me was Roman Mars. He looks absolutely nothing like he sounds.",
            "score": 172,
            "author": "sally__shears",
            "replies": [
                {
                    "level": 1,
                    "comment": "So I just looked up Roman Mars and he actually looks almost exactly how I pictured him! Lol. I love how human brains are so different",
                    "score": 39,
                    "author": "DeciduousTree",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I just had the same experience. I don't know how I could hear the glasses!\n\nFor me, Jonathan Goldstein and Peter Sagal look the least like what they sound- to the point where I feel some kind of dissonance when watching them talk.",
                            "score": 6,
                            "author": "WTaggart"
                        },
                        {
                            "level": 2,
                            "comment": "Same - Spot on for how I would have imagined him",
                            "score": 8,
                            "author": "usereddit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm reluctant to look him up because I live his voice but what if my brain doesn't like the way he looks?",
                                    "score": 3,
                                    "author": "JumpedUpSparky",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You need to face your biggest fears in life... open it...\n\nhttps://res.cloudinary.com/sagacity/image/upload/c_crop,h_2369,w_1669,x_0,y_131/c_limit,dpr_auto,f_auto,fl_lossy,q_80,w_640/Roman_Mars_irwcpy.jpg",
                                            "score": 5,
                                            "author": "usereddit",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Roman mars' hair = 99% invisible",
                                                    "score": 5,
                                                    "author": "nicholt"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I saw his TED talk first somehow.",
                    "score": 15,
                    "author": "Adiustio"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 12,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh damn, I just did this one cause I'd never looked him up before. Don't do it. It is similarly disconcerting.",
                            "score": 8,
                            "author": "sally__shears",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh. Wow.  Yeah.  I thought Nate DiMeo would be a wiry young guy with shaggy hair and a kind of melancholy, Edgar Allen Poe-type appearance.  \n\nHe looks nothing like Edgar Allen Poe.",
                                    "score": 6,
                                    "author": "wizard_oil"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was coming here to say this! He is my podcast-voice crush for sure, but definitely not what I expected.",
                    "score": 7,
                    "author": "MerryTexMish"
                },
                {
                    "level": 1,
                    "comment": "Why did you do that to me?! However, he and the *Lore* guy look kinda alike.",
                    "score": 5,
                    "author": "thatG_evanP"
                },
                {
                    "level": 1,
                    "comment": "I've just googled his photo and he doesn't look anything like I thought he would. Although I couldn't tell you what I thought he would look like.",
                    "score": 6,
                    "author": "KatAnansi"
                },
                {
                    "level": 1,
                    "comment": "This is actually me when I looked up Michael Barbaro. I thought he was waaaay younger than that.",
                    "score": 4,
                    "author": "assuasiveafflatus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I just had double whiplash from him looking way older than I expected, googling his age, and finding out he's a lot younger than his picture had just made me think.",
                            "score": 1,
                            "author": "notevaluatedbyFDA"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Roman looks EXACTLY how I would have imagined \n\nLooks like it’s just up to someone’s personal interpretation",
                    "score": 3,
                    "author": "usereddit"
                },
                {
                    "level": 1,
                    "comment": "I'm so afraid to google him now. Maybe keep the curtain unveiled.",
                    "score": 3,
                    "author": "DogBacon"
                },
                {
                    "level": 1,
                    "comment": "&gt; Roman Mars\n\nOh holy shit, I expected him to look like Roman Reigns, the pro-wrestler for some reason.",
                    "score": 3,
                    "author": "Abadatha",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I expected him to look like Greek Ares.",
                            "score": 8,
                            "author": "Dark_Tsar_Chasm"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Tbc podcasters need to focus a lot on voice, so it makes sense. I'm not quite in the field per se, but I'm close enough to say I spend an inordinate amount of time playing with my voice to sound good (dnd podcasting plus some voice work)",
                    "score": 2,
                    "author": "ig-fantasticide"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Welcome to how every fan of NPR feels",
            "score": 107,
            "author": "will592",
            "replies": [
                {
                    "level": 1,
                    "comment": "Actually, the only one that ever really surprised me was Garrison Keilor. That man could tell a story, create an interesting place and had a good voice, but holy fuck did he have the face for radio.",
                    "score": 30,
                    "author": "Abadatha",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe because I grew up watching him on PBS, his face fit him _perfectly_ in my mind. I was literally thinking about him today. Time to revisit Lake Wobegon.",
                            "score": 17,
                            "author": "JoyfulCor313",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That man is a modern Mark Twain. Tells fantastic, American tales, writes great satire. I miss him, and the Guy's All-Star Shoe Band and the whole cast and show. Live From Here is great, and I do love Chris Thile, but the story telling just isn't right without Keilor.",
                                    "score": 10,
                                    "author": "Abadatha"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ahh, I love the \"face for radio\" phrase so much. It sounds like a compliment, then you think about it",
                            "score": 4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "When I was in journalism school years ago, they actually had “the talk” with kids who were good journalists but weren’t likely to be hired for on-camera positions. \n\nAnd yes, they would use that exact phrase. Brutal, but the point was to redirect them in a way that had more potential for success.",
                                    "score": 20,
                                    "author": "MerryTexMish"
                                },
                                {
                                    "level": 3,
                                    "comment": "And everyone IN radio absolutely hates it. Want to get shit talked fast? tell someone in radio they have a \"face for radio\", you will be hated for the rest of your life.",
                                    "score": 2,
                                    "author": "ninfan200"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 15,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Kai is actually fairly handsome and I think looks quite a bit like he sounds. Somehow I always imagined him doing his broadcasts in sunglasses tho",
                            "score": 12,
                            "author": "strcy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Do you ever have your back turned to the TV and then think, \"Wait, I don't have the radio on...\" only to turn around and realise Terry Gross is the one being interviewed on PBS?",
                    "score": 4,
                    "author": "tr33sc00ter"
                },
                {
                    "level": 1,
                    "comment": "Brooooo Sean Rameswaram",
                    "score": 2,
                    "author": "fetus-wearing-a-suit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It makes me realize how judgmental I am of peoples looks",
            "score": 71,
            "author": "RaindropsInMyMind"
        },
        {
            "level": 0,
            "comment": "When I started listening to My Favorite Murder, I looked up a picture of the hosts briefly. Somehow, my mind switched them; I always pictured Karen with Georgia's face, &amp; vice versa. It's never not fucked with me when I see a video of them.",
            "score": 49,
            "author": "axepixie",
            "replies": [
                {
                    "level": 1,
                    "comment": "I thought Karen was WAY younger. After hearing about her raucous past I just assumed because, typically, people who spend their 20s drunkenly screaming into the night have a raspy voice and it only gets deeper with age. \n\nI made an ass out of me.",
                    "score": 16,
                    "author": "OttoManSatire",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I literally came to the comment to add a post amount MFM. For some reason in my head whenever I listened to the podcast I pictured the two of them as conjoined twins. Still doesn’t feel like I’m looking at the real them when I see their videos",
                            "score": 10,
                            "author": "Fucklers"
                        },
                        {
                            "level": 2,
                            "comment": "I could listen to Karen read the phone book, but for some reason I couldn’t listen to the podcast anymore. I think I’m incompatible with Georgia’s personality which doesn’t allow me to enjoy listening to them.",
                            "score": 3,
                            "author": "bebeni89",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I love Karen’s voice too. Have you tried listening to Do You Need a Ride? It’s her other podcast if you need a Karen fix.",
                                    "score": 2,
                                    "author": "28tek",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is so funny, back when I first started listening (around ep 10ish) I kinda pictured Georgia as black. Something about her idiolect reminds me of an old friend.",
                            "score": 1,
                            "author": "Tippovertopp",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Even though I even spent the day watching Karen clips on YouTube, I still picture her as the lead singer from the Bangles. Complete with side glances. Probably because Karen's comedy was musically based.\nFor reference: https://youtu.be/mu_pNeqAQ-U",
                    "score": 4,
                    "author": "Lady_Scruffington"
                },
                {
                    "level": 1,
                    "comment": "I did this too!! And then when I watched an interview of them months later I was honestly shocked",
                    "score": 2,
                    "author": "Rusatus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Glad it's not just me",
                            "score": 1,
                            "author": "axepixie"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yep, same thing for me :)",
                    "score": 2,
                    "author": "Haselrig"
                },
                {
                    "level": 1,
                    "comment": "I knew her from Mr. Show in the later 90's, so I have kept an eye on her for years, seeing what she was up to.",
                    "score": 2,
                    "author": "andsendunits"
                },
                {
                    "level": 1,
                    "comment": "I did the same with Stuff You Missed in History Class, I swapped Holly and Tracy's voices with their pictures, and they don't look alike so it's a bit of a mind meld.",
                    "score": 1,
                    "author": "ilovebeaker",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "the mcelroy brothers threw me for such a loop when i first looked them up.",
            "score": 55,
            "author": "succulentIy",
            "replies": [
                {
                    "level": 1,
                    "comment": "I had to watch the TV show to tell their voices apart.",
                    "score": 16,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I couldn't tell travis and justin apart until I saw them live :/",
                            "score": 10,
                            "author": "awyrdreams",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I started with TAZ, and I couldn't tell them apart until I learned the characters. I didn't start listening to MBMBAM until i finished Balance, so by then I was set.",
                                    "score": 5,
                                    "author": "EmpJoker"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same here lol, I listened to taz for ages without having any idea what any of them looked like.",
                    "score": 5,
                    "author": "themaxiac"
                },
                {
                    "level": 1,
                    "comment": "The painted fingernail always throws me too.",
                    "score": 3,
                    "author": "nemoomen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't know what I thought they would look like, but it wasn't [what PJ and Alex from Reply All look like.](https://images.ctfassets.net/7zvnbvwi2m0t/5N1JtxaGXBvMTI6R1NSj8D/7a0a4ee53f51e1fbd2df0408ae7d5fba/PJ__Vogt_and_Alex_Goldman_Reply_All_Blog_Size.jpg)",
            "score": 23,
            "author": "nemoomen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, totally!",
                    "score": 3,
                    "author": "ilovebeaker"
                },
                {
                    "level": 1,
                    "comment": "I searched for a picture of Alex Goldman earlier after thinking this same thing.\n\nAnd here we are, a year later, to just say he looks absolutely NOTHING like I thought he would!",
                    "score": 2,
                    "author": "BristolRocks"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When I saw the voice actor who plays Cecil in Welcome to Nightvale, I was very taken aback. I pictured him looking totally different.",
            "score": 28,
            "author": "hydrangeasinbloom",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think I originally pictured him like the stereotypical 40'ish year old man in a suit from the 1950's because of his voice. So when I looked up what he looked like, I was pretty surprised. Of course now it makes total sense.",
                    "score": 8,
                    "author": "BondraP",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, exactly! I pictured an old timey radio announcer with black brylcreem hair, wearing 1950s style clothing.",
                            "score": 3,
                            "author": "hydrangeasinbloom"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Pretty close, although I expected him to look older.",
                    "score": 4,
                    "author": "Abadatha"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The only podcasters that looked how I imagined was Josh and Chuck from Stuff You Should Know. Mike from Sword and Scale didn’t look like I thought he would.",
            "score": 18,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "No way! Josh and Chuck are two that looked completely different than how I had pictured them. So funny how our brains work. I actively avoid looking up podcast hosts now because I find it to be such a weird experience when my imagined conception of hosts is so far off from reality.",
                    "score": 19,
                    "author": "Bladio22",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Edit: I realized my first comment made it look like I didn’t want to check out SYSK or Josh and Chuck! Not the case! Still love them!!!\n\nYeah I don’t like checking  out what podcasters look like anymore either!!! I keep it a mystery.",
                            "score": 5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's such an odd experience, one that I wasn't fully prepared for. I wasn't really aware of how much my mind had created faces for podcast hosts until I realized how jarring it was to see the discordance between what my mind had cooked up and what they actually look like.",
                                    "score": 2,
                                    "author": "Bladio22"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I always imagines their faces and voices swapped. Chuck just looks like he has Josh's voice lol",
                            "score": 5,
                            "author": "i_found_the_cake"
                        },
                        {
                            "level": 2,
                            "comment": "I find it helps a lot if you specifically look up a video. Just looking at pictures isn't enough, you need an actual video of them talking for your brain to connect the podcaster with what you're seeing.",
                            "score": 3,
                            "author": "classy_barbarian",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It was actually a video that I came across for my first experience seeing their faces. Messed with my mind! Haha It was so odd hearing voices that I'm so accustomed to but seeing faces that clashed with the faces that I was expecting.",
                                    "score": 1,
                                    "author": "Bladio22"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I pictured Josh looking more like Chuck and Chuck looking more like Josh, so that was kinda weird when I actually saw them.",
                    "score": 3,
                    "author": "imaBEES",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Really?! It’s so funny how our minds work.",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Josh and Chuck looked a lot like how pictured them but different enough that it confused me",
                    "score": 3,
                    "author": "falconview",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think Josh looked more like I thought he would than Chuck did.",
                            "score": 3,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I felt this way with stuff you should know. I never realized the one guy looks like he is in a metal band and rides a cruiser.",
            "score": 15,
            "author": "R0b6666",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha chuck is in a cover band called “el cheapo” but they don’t play metal.\n\nThis video is from 10 years ago. His wife is on vocals\n\n\nhttps://youtu.be/k2mymbWeyrg",
                    "score": 7,
                    "author": "lebrilla",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thats cool! I never seen his band.",
                            "score": 1,
                            "author": "R0b6666"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "SYSK is one for me too. It is such a bizarre experience to have listened to voices for many hours and formed an image of those people in your mind only to have that image be so far from the reality.",
                    "score": 5,
                    "author": "Bladio22"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I prefer not to know most of the time, but if I'm like 200 episodes deep in a podcast, I might as well know what these people look like. I'm basically addicted to their show at that point to fuck it.",
            "score": 13,
            "author": "Arkaedia"
        },
        {
            "level": 0,
            "comment": "I just looked up Phoebe Judge last night. I was expecting her to look like Sarah Paulson for some reason.",
            "score": 13,
            "author": "doublejinxed"
        },
        {
            "level": 0,
            "comment": "I always look them up immediately.",
            "score": 10,
            "author": "Plato428BC",
            "replies": [
                {
                    "level": 1,
                    "comment": "I do it too. It’s better listening if you can put a face to the voice.",
                    "score": 6,
                    "author": "snooperandapooper",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Good idea! I think I’ll start doing that.",
                            "score": 3,
                            "author": "Cyprus_Lou"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is a good idea and I think I'll be doing it from now on.",
                    "score": 2,
                    "author": "thatG_evanP"
                },
                {
                    "level": 1,
                    "comment": "I like how shows like Magic Tavern will put everyone's social in the description so I can look them up",
                    "score": 1,
                    "author": "Captain_Arrrg"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've had this issue since it was just radio.",
            "score": 8,
            "author": "thatG_evanP"
        },
        {
            "level": 0,
            "comment": "Honestly, of all the podcasts that I listen to I know what 6 of them look like. Dan Carlin, David Crowther and Mike Duncan have spent countless hours educating me, and Arnie Niecamp, Adal Rafai and Matt Young have taken me on an adventure with so many laughs. Oh, I also know what Jason Wiser looks like.\n\nEdit: This isn't a huge surprise to me usually anymore after spending years listening to A Prairie Home Companion on NPR and then finally seeing Garrison Keilor's face was... quite the shock.",
            "score": 8,
            "author": "Abadatha",
            "replies": [
                {
                    "level": 1,
                    "comment": "I still can't get over Dan Carlin looking like an older Joe Rogan type. I pictured him as a maybe 70-ish bookish guy.",
                    "score": 3,
                    "author": "notevaluatedbyFDA"
                },
                {
                    "level": 1,
                    "comment": "Mike Duncan looked exactly as I thought he would. David is the best though. I can totally see him in his little garden shed talking about English history as birds chirp in the background. It's the quaintest picture imaginable.",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, and he's a genuinely nice and polite guy. Although he does yell at me in the groups because I swear like a sailor.",
                            "score": 1,
                            "author": "Abadatha",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Mike or David?",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "David. I've not had the pleasure of interacting with Mike Duncan yet. Conversely, I've had some fairly interesting back and forths with Chris Stuart who host's The History of China, but I have absolutely no clue what he looks like.",
                                            "score": 2,
                                            "author": "Abadatha",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "With David you should probably watch your language around British History Dad.  As for Mike, have you considered forming a vanguard revolutionary committee against him?\n\nEdit: I thought you had said you have unpleasant interactions with mike, but mostly I wanted to make the Revolutionary vanguard joke. Chris seems like the nicest guy in the world. I have always felt the history of china hasnt gotten near the acclaim it deserves.",
                                                    "score": 2,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah. I love David, and I'm glad he's healthy again. Can't wait for the return of the Russian Revolution too.\n\nI completely agree. Chris is thorough, keeps it interesting and is obviously very much in love with the subject matter. I think the reason he doesn't get a ton of love is more about the subject matter. A lot of English speaking people probably don't have a ton of interest in the history of China. Which is sad, because it's so long and storied.",
                                                            "score": 2,
                                                            "author": "Abadatha",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I just looked up Jason Weiser because Myths and Legends might be my favourite podcast of them all, and holy SHIT. He didn't have a beard when I pictured what he looked like!",
                    "score": 2,
                    "author": "sassy-in-glasses"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The guy that does Swindled (I think?) choses to remain totally anonymous. His podcast could make some desperate enemies.",
            "score": 7,
            "author": "OttoManSatire",
            "replies": [
                {
                    "level": 1,
                    "comment": "He is a concerned citizen.",
                    "score": 1,
                    "author": "siggyapolis"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Okay, with podcasts, I feel like it's totally normal and of the google age. If it's Delilah from Lite 98.7, I never want to know what that woman's face looks like. It would be like matching a face to God. It's just too big for me to think about.",
            "score": 7,
            "author": "grannyzeniba"
        },
        {
            "level": 0,
            "comment": "I find that when I first start listening to a podcast, if the hosts’ voices sound very similar or if there’s 3 hosts, I have to look up a video of them talking so I can take a few minutes to take a mental note of who is who.",
            "score": 7,
            "author": "themedievalsnowman",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have been listening to the Sklar Brothers for at least 6 years, still can't tell them apart while listening.",
                    "score": 3,
                    "author": "ejh3k"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I imagine that’s what happened when people first saw Rick Astley",
            "score": 7,
            "author": "NerdTalkDan"
        },
        {
            "level": 0,
            "comment": "Ira Glass. When I saw him live his opening bit was about how weird it is to see his voice coming out his mouth and it is so true.",
            "score": 8,
            "author": "Im_Alek",
            "replies": [
                {
                    "level": 1,
                    "comment": "I thought he would look like a late 90s alt-pop singer! Like a hip, lean version of Guy Fieri. Nope.",
                    "score": 2,
                    "author": "wizard_oil"
                },
                {
                    "level": 1,
                    "comment": "Facts",
                    "score": 1,
                    "author": "beantub"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This effect is why books are better than movies IMO",
            "score": 13,
            "author": "collapsingwaves"
        },
        {
            "level": 0,
            "comment": "I've made it a habit of actively avoiding watching videos of my favourite podcasters because of this. On a couple occasions I've seen videos of a few of the podcasters that I've listened to for many hours, and it just weirds me out to discover that they look so drastically different from the image my subconscious has developed.",
            "score": 6,
            "author": "Bladio22"
        },
        {
            "level": 0,
            "comment": "It’s okay, you can just say PJ and Alex from Reply All.\nPhoebe Judge from Criminal somehow both met my expectations and didn’t.",
            "score": 10,
            "author": "discipleanonymoose",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow I just looked them up. Absolutely not what my brain image looked like. I also cannot tell their voices apart though, so I have no idea which one is which",
                    "score": 4,
                    "author": "SortYourRecycling"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The girls on This Podcast Will Kill You look exactly how they sound.",
            "score": 6,
            "author": "OttoManSatire",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think they look reversed",
                    "score": 3,
                    "author": "fetus-wearing-a-suit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "YOU TOO!??!! I thought it was a weird detail to add to my previous post, but yeah. Deff did a double take.",
                            "score": 3,
                            "author": "OttoManSatire"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "No, because I'm old enough to have grown up on radio, and am thoroughly familiar with the concept of \"a face for radio\".",
            "score": 5,
            "author": "Mobryan71"
        },
        {
            "level": 0,
            "comment": "I thought Robert Evans would look like a poor man's Stephen Colbert. When I came across a picture of him he looked so different from what I imagined I assumed I was looking at a different Robert Evans.",
            "score": 5,
            "author": "jakes_ina_wheelchair",
            "replies": [
                {
                    "level": 1,
                    "comment": "To me his face completely fits his voice and personality. I did have trouble before I saw a photo trying to pin down what I expected him to look like, though.",
                    "score": 3,
                    "author": "wafflesos"
                },
                {
                    "level": 1,
                    "comment": "Lmao he will forever exist in my head as the weird coworker who's entire face is super red for some reason popping into a cracked video",
                    "score": 3,
                    "author": "SortYourRecycling"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think gestalt psychology puts people in certain categories for you once you know their face and you perceive everything as you would from that specific category of people. It kinda creates limits. \n\nSo I prefer not to know.",
            "score": 6,
            "author": "LossomoFilms"
        },
        {
            "level": 0,
            "comment": "If I have listend to a podcast long enough, the actual people can't overwright my mental image of them.",
            "score": 6,
            "author": "The_Sceptic_Lemur"
        },
        {
            "level": 0,
            "comment": "I used to sell wholesale over the phone - had about 30 customers I would talk to every day. When I met them after about a year, I found I still visualized them in the way I built them in my head. Except for joe - joe was exactly how I pictured him - French Canadian with a perfect mustache. And one guy I pictured being a 300lb red head. Turns out he was a 150lb bald guy. I liked the fat redhead guy better.",
            "score": 5,
            "author": "gswya123"
        },
        {
            "level": 0,
            "comment": "It’s like watching the Simpsons for 20 years and then seeing the voice actors do the voices on camera. Super weird.",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "The McElroy brothers taught me it is absolutely imperative to look up hosts at the beginning of your listener experience",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "The same thing used to happen with radio DJs for us old people.\n\nAll that being said, where does your interpretation of a voice come from? My guess is that movies and television create certain expectations of what people look like based on their voice.\n\nIt's the one thing you're watching where stereotypes always play out. The sexy woman never/rarely has a bad voice. The guy with the high pitched voice is always the nerdy guy. The guy with the deep voice is always the cool/suave guy.\n\nIn reality, voice has nothing to do with how you look physically and can match any type of voice with any type of look. Real life plays against type, media plays directly to type.\n\nI also think our expectations of media is that celebrities are good looking, that is the nature of the world. Then you see a successful podcaster in real life and see that they're exactly the opposite of what the world sets our expectations to be.\n\nIt really should make you wonder what other assumptions you're making based on things you rarely/never think about or consider. All this stuff is baked in our brains through consumption and upbringing.",
            "score": 3,
            "author": "huxley00"
        },
        {
            "level": 0,
            "comment": "It's like when a book is turned into a movie/tv show. Characters never look like I imagine them.",
            "score": 3,
            "author": "bluebaron423"
        },
        {
            "level": 0,
            "comment": "Am I the only one that usually dosen't want to see how the host of the podcast I listen to looks like?",
            "score": 3,
            "author": "Debe_",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve often looked up who the story is about when listening to things like true crimes, but never even thought to look up the Podcaster! I’m with you, I don’t want to know, lol.",
                    "score": 2,
                    "author": "it-needs-pickles"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I listened to Fresh Air for years without knowing what Terry Gross looked like. I was pretty confident that my mental picture of her was accurate but I was wrong, lol",
            "score": 3,
            "author": "parisjackson2"
        },
        {
            "level": 0,
            "comment": "Word of advice . Don't look them up .It'll just ruin the podcast for you.",
            "score": 3,
            "author": "river912"
        },
        {
            "level": 0,
            "comment": "Big NoSleep fan. Some of the VA look exactly how I expected, but there are a few that just really threw me off. Watching their live shows is a trip",
            "score": 3,
            "author": "effybeanz"
        },
        {
            "level": 0,
            "comment": "Yeah I totally felt this with Reply All.",
            "score": 4,
            "author": "careerthrowaway10"
        },
        {
            "level": 0,
            "comment": "I don’t know why, but this is so true to me",
            "score": 2,
            "author": "Hello-there-people-"
        },
        {
            "level": 0,
            "comment": "Yes! Haha. It's like a shock. Especially if they don't look like what you'd imagined. (Not sure if they would be considered a podcast, but) I remember having that feeling the first time WatchMojo showed the face of the WatchMojo lady, Rebecca. 😂. I'm used to seeing her now, but it was weird at first.",
            "score": 2,
            "author": "TunukaMedia"
        },
        {
            "level": 0,
            "comment": "I just looked up Willa Paskin of Decoder Ring.\n\nMy mental image was of a stylish young African American woman with big, natural hair and bright lipstick wearing vintage clothes and statement jewelry.\n\nWilla Paskin looks nothing like what I had assumed!  It's interesting how the mind will invent a whole image.",
            "score": 2,
            "author": "wizard_oil",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm part of a French-speaking network of amateur podcasters and it was a common occasion for me to just spend time around people for a while without knowing who they are. Worse was that I have a quite unique name for people who speak French and we did live shows with video (damn, I tried too hard to have an edgy look), add that I was part of the team that gathered all the people in the network and people used to know me without me recognizing them. Sometimes, it even took me a few days to finally have that moment when I was just \"Oh but you're that person ! Sorry I didn't recognize you before !\"",
            "score": 2,
            "author": "TheAlmightyLloyd"
        },
        {
            "level": 0,
            "comment": "I dont want to see them as  I have an image in my head of what they look like and then they turn out looking totally opposite.",
            "score": 2,
            "author": "debcom"
        },
        {
            "level": 0,
            "comment": "I did some work on a local radio host's house and let me tell you, talking to him made it really hard to maintain eye contact because it was like a fake voice was coming out of his mouth.",
            "score": 2,
            "author": "ninjaplatapus94"
        },
        {
            "level": 0,
            "comment": "This used to happen when listening to music before the internet. People rarely look how they sound when you picture their singing voice.",
            "score": 2,
            "author": "XmossflowerX"
        },
        {
            "level": 0,
            "comment": "The NPR woman who does the interstitials. (\"Supported by the Pew Charitable Trust, and by...\") Such a smooth, buttery voice, with subtle inflections. I picture Stephanie Marsh, the gorgeous blond DA from Law &amp; Order. Nope.",
            "score": 2,
            "author": "savagela"
        },
        {
            "level": 0,
            "comment": "I'm afraid to look up Kai Risdal from Marketplace. In my head he's such a stud.",
            "score": 2,
            "author": "savagela"
        },
        {
            "level": 0,
            "comment": "After the midnight gospel I've been bringing the Duncan Tressell podcast and at first I couldn't believe that was him. But after enough vids his voice matched how he looked perfectly haha",
            "score": 2,
            "author": "Jediknightbong"
        },
        {
            "level": 0,
            "comment": "The \"Stuff You Should Know\" guys surprised me.  I watched a video of them on YouTube and thought, \"Yep, that's what I imagined.\"  Then they started talking, and I realized their voices were reversed with the faces I imagined.",
            "score": 2,
            "author": "Neomaycry"
        },
        {
            "level": 0,
            "comment": "I’ve recently started listening to Jasck Maate’s Happy Hour. My sister also listens to it and watches his YouTube videos too. In my head Robbie Knocks, who features on a few of his podcasts, looks like Piers Morgan. Apparently this is not the case 😂",
            "score": 2,
            "author": "proudheights"
        },
        {
            "level": 0,
            "comment": "I try not to look anyone up unless I really like listening to the podcast. I'm usually surprised each time, I am curious of how people thing I look compared to how I sound.",
            "score": 2,
            "author": "gomo89"
        },
        {
            "level": 0,
            "comment": "I didn't know John McWhorter (host of Lexicon Valley) was black until he played the race card on one of his episodes... Two years after I started listening to his show.",
            "score": 2,
            "author": "stooge4ever"
        },
        {
            "level": 0,
            "comment": "Terri Gross! I saw her on an episode of This is Us and it BLEW MY MIND to actually see her speak with the voice I’ve heard for so long. It was the weirdest, awesomest thing ever.",
            "score": 2,
            "author": "lilafowler1"
        },
        {
            "level": 0,
            "comment": "Stephen Dubner from Freakonomics Radio.\n\nHe has a young, bright cheery hopeful voice! \n\n...And he looks like your cool late-50’s uncle from jersey who smokes a pack a day and works as a newspaper editor.",
            "score": 2,
            "author": "Lexingtoon3"
        },
        {
            "level": 0,
            "comment": "Its kinda the same thing when you read a book and you imagine the character one way but then you see the tv show or movie and the character just doesnt match so yeah not strange at all in my mind.",
            "score": 1,
            "author": "EnviedAnathema"
        },
        {
            "level": 0,
            "comment": "couple of my listeners have said the same thing, always amuses me",
            "score": 1,
            "author": "Souless__x"
        },
        {
            "level": 0,
            "comment": "Same with radio! They don’t look like they sound!",
            "score": 1,
            "author": "Irishlass83"
        },
        {
            "level": 0,
            "comment": "I have the same thing with audiobooks or reading books and then watching the movies",
            "score": 1,
            "author": "JackOSF"
        },
        {
            "level": 0,
            "comment": "Totally. I also kinda find it weird because you listen to them all the time for years, sometimes listening to episodes multiple times so you feel like you get to know them really well, or feel like you do, without them ever knowing anything about you or that you exist.",
            "score": 1,
            "author": "8ltd"
        },
        {
            "level": 0,
            "comment": "For years I imagined dan Carlin from hardcore history would look like Wallace Shawn (vizzini in princess bride) just from the pitch of his voice.",
            "score": 1,
            "author": "killagorilla91"
        },
        {
            "level": 0,
            "comment": "Especially CGP Grey.",
            "score": 1,
            "author": "dimsumvampire",
            "replies": [
                {
                    "level": 1,
                    "comment": "CGP Grey has written about this exact topic: [Faceless Voices](https://www.cgpgrey.com/blog/faceless-voices)",
                    "score": 1,
                    "author": "threelonmusketeers"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Before I Googled what Mike and Gibby from True Crime All the Time looked like, I imagined them each looking like the other. Took me a while to get used to the Patreon videos they do.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I still don't know which one is Chuck or Charles?",
            "score": 1,
            "author": "SafeSalt"
        },
        {
            "level": 0,
            "comment": "Billy Wayne Davis. I expected him to have way more hair and wear a flannel shirt.",
            "score": 1,
            "author": "wafflesos",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha. He looks pretty much how I expected him to, but I also always pictured him wearing a flannel for some reason.",
                    "score": 2,
                    "author": "WarOfTheRobots"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mike duncan from revolutions/history of rome pretty much looks like he sounds",
            "score": 1,
            "author": "Mymom429"
        },
        {
            "level": 0,
            "comment": "Most of the podcast hosts I listen to I intentionally never look up. I would rather enjoy my brain's version of what they look like than actually know what they look like, it fuels the narrative in my brain about who they are and why they do what they do.",
            "score": 1,
            "author": "AdmiralPlant"
        },
        {
            "level": 0,
            "comment": "Not a podcast, but this exact thing happened when I saw 3Blue1Brown’s face for the first time. Voice def doesn’t match the face for me.",
            "score": 1,
            "author": "Prit717"
        },
        {
            "level": 0,
            "comment": "Growing up we always listened to one radio station because we loved the DJ's of the morning show. They had great voices and they were really entertaining. I always had an image of what they looked like just based on their voice... one was deep with a loud powerful laugh and the other was higher and softer with a full out laugh that sounded more like a chuckle when full out laughing. \n\nThen in college I happen to hang out with some broadcasting students and end up at a party where I got to meet these two guys who were such a large part of my life (5 times a week for a better part of 20 years). \n\nI'll never forget the moment I heard their voices in the other room and my friend immediately asked what was up and I asked if there was any chance Chris and Mike (not real names) were there. They ended up knowing them well enough to introduce me and I got to meet them (I would compare my reaction to how I would probably handle meeting Tom Hanks). I'll never forget how awesome and down to earth they were (you always hear don't meet your hero's).\n\nFunny thing is I had them wrong. The guy who had the deep voice with the booming laugh was the tallest and lankiest bastard I have ever seen and the other guy was short and almost round (not fat but because he had a barrel chest with being so short it was more of an illusion).",
            "score": 1,
            "author": "deardot"
        },
        {
            "level": 0,
            "comment": "Mine was the ever elusive Kingstown Ted from the Horror, Etc podcast. Now, this was an early podcast, well before the boom. You rarely got to see people back then, but after a couple hundred episodes, he had a guest appearance on a video-based show. Felt like catching a glimpse of bigfoot :)",
            "score": 1,
            "author": "Haselrig"
        },
        {
            "level": 0,
            "comment": "For some reason I thought Payne Lindsey was black/mixed for the longest time. I was definitely mistaken",
            "score": 1,
            "author": "swhitty17"
        },
        {
            "level": 0,
            "comment": "personally it has not happened to me, but it is interesting to think",
            "score": 1,
            "author": "Jekuro11"
        },
        {
            "level": 0,
            "comment": "Malcolm Gladwell - holy crap \n\nAlso the guys from Stuff You Should Know. I went to a live show and it was a strange experience",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Ya its like seeing who voices a cartoon character. Cartoons voice themselves hmph for this I'm campaigning the #NotMyReality slogan for all u ppl out there who are tired of finding out that mr krabs cursed. And that podcasters arent floating microphones",
            "score": 1,
            "author": "melodynomite"
        },
        {
            "level": 0,
            "comment": "I always thought Joshua Johnson from 1A was a white dude.",
            "score": 1,
            "author": "Oracle365"
        },
        {
            "level": 0,
            "comment": "First happened with Rush for me, 20-25 years ago.",
            "score": 1,
            "author": "AdamF778899"
        },
        {
            "level": 0,
            "comment": "It's not a great example because they have their photos on the show art, but Anthony Carboni and Jeff Cannata of We Have Concerns are sooo damn handsome. Oof!",
            "score": 1,
            "author": "scruff_and_stuff"
        },
        {
            "level": 0,
            "comment": "I listened to car talk for years. Boy was that a surprise",
            "score": 1,
            "author": "tiggahiccups"
        },
        {
            "level": 0,
            "comment": "Thats why we put our podcast on YouTube, as well. 😁",
            "score": 1,
            "author": "samedamnlife"
        },
        {
            "level": 0,
            "comment": "Listening to The Adventure Zone was a tRIP, at first I had trouble differentiating which voice was which McElroy but then I watched MBMBAM and suddenly it all made sense and they looked vERY different from what I’d pictured",
            "score": 1,
            "author": "thatsmagicbaby"
        },
        {
            "level": 0,
            "comment": "It’s like reading a book and not knowing what the characters actually look like until a movie gets made",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Well I have bern told I have a face for radio so I'm sure people feel this way about my podcast but then not many people listen to it. But then i use my pod cast more as a way to stay sane and not have to pay for therapy. Just decompress and bitch about movies.",
            "score": 1,
            "author": "GODHATHNOOPINION"
        },
        {
            "level": 0,
            "comment": "Oh God. Especially Mike Boudet.\n\nErica Kelley looks just like I pictured though.",
            "score": 1,
            "author": "v0ness"
        },
        {
            "level": 0,
            "comment": "Reply All. Totally unexpected.",
            "score": 1,
            "author": "tbutz27"
        },
        {
            "level": 0,
            "comment": "I remember a long time ago a podcast I listened to for a while with no knowledge of the hosts, I finally looked them up and they looked NOTHING like I thought they would. The next like 5 episodes I listened to after that were super weird. It was like \"who are these people\"",
            "score": 1,
            "author": "SortYourRecycling"
        },
        {
            "level": 0,
            "comment": "That's why Michael Barbaro is such a treat.",
            "score": 1,
            "author": "i_found_the_cake"
        },
        {
            "level": 0,
            "comment": "Conrad thompson",
            "score": 1,
            "author": "Seeker3789"
        },
        {
            "level": 0,
            "comment": "Isaac Arthur looks exactly like his voice sounds lmao",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Jim Clemente looks nothing like he sounds.",
            "score": 1,
            "author": "incognitomutha"
        },
        {
            "level": 0,
            "comment": "I imagine it can destroy the world you have pictured in your head lol.\n\nWhen GoT first started, I was super pumped because I had read the series and loved it. But then, When I first saw Robert Baratheon, and subsequent characters after that which did not fit what I had in my head, I couldnt watch it.\n\nRobert Baratheon in particular was so far from what I imagined, I didnt watch any further than ep1 until recently, when my wife wanted to watch the show.",
            "score": 1,
            "author": "TCopperpotMD",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh man, I've never read the books but I heard the absolute worst character recreation was Euron Greyjoy. Apparently in the books he's supposed to be the most brutal, hardcore, badass warrior in all of westeros. In the show he's a fucking dweeb.",
                    "score": 1,
                    "author": "classy_barbarian",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This was always the case with radio. \n\nAfter years of listening to djs - people were always surprised to see what they actually looked like. Never mind the fact that people just expected radio djs to look like hollywood actors (who go to great lengths to look fit, teeth fixed, etc etc etc...., and this... was often NOT the case. ;)",
            "score": 1,
            "author": "PulledToBits",
            "replies": [
                {
                    "level": 1,
                    "comment": "lol yeah, Howard Stern is probably a great example of that. I love Stern btw, I really wish he put his show in podcast form because it's great but Sirius XM paid him to be exclusive to their business. I think the guy would be a lot more famous at the moment if he had switched to podcasting.",
                    "score": 2,
                    "author": "classy_barbarian",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes. We form this mental picture of them and of course they look completely different.",
            "score": 1,
            "author": "sevenyeardust"
        },
        {
            "level": 0,
            "comment": "I do that all the time. I always imagine something totally different than what I eventually see.",
            "score": 1,
            "author": "TheGriddlePodcast"
        },
        {
            "level": 0,
            "comment": "It's the new radio",
            "score": 1,
            "author": "discwrangler"
        },
        {
            "level": 0,
            "comment": "Dan Carlin looks exactly how you expect him to",
            "score": 1,
            "author": "San7129"
        },
        {
            "level": 0,
            "comment": "Happens all the time with not only podcasters, but YouTubers who do face reveals",
            "score": 1,
            "author": "Awkward_demon"
        },
        {
            "level": 0,
            "comment": "100% ATP hosts do not match their voices.",
            "score": 1,
            "author": "JumpedUpSparky"
        },
        {
            "level": 0,
            "comment": "Only when they're ugly",
            "score": 1,
            "author": "TheEmissary064"
        },
        {
            "level": 0,
            "comment": "Alex Blumberg (Gimlet CEO) says audio is the most \"honest media\", and it removes first impression judgment you tend to have of people when u first look at them",
            "score": 1,
            "author": "meiyiyeap"
        },
        {
            "level": 0,
            "comment": "Yup, and it's even worse with naritive ones.  You get an idea (or even a specific description) of what their character looks like and then see the voice come out of someone completely diffrent.",
            "score": 1,
            "author": "HiddenChymera"
        },
        {
            "level": 0,
            "comment": "Longtime NPR listener... it’s super weird",
            "score": 1,
            "author": "primetimemime"
        }
    ]
}