{
    "id": "o4nu28",
    "score": 662,
    "title": "Thank you horror podcasts for helping me normalize non-heterosexual relationships.",
    "author": "[deleted]",
    "date": 1624252823.0,
    "url": "https://www.reddit.com/r/podcasts/comments/o4nu28",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m gonna tell the truth and shame the devil as my country cousins say. I didn’t realize how much I had issues with gay couples until I started hearing a ton of horror stories with gay couples, both male and female. I thought I was an accepting “if it exists then it’s normal” kind of dude, but when I first heard a story that featured a gay couple I had a small nagging feeling that said “hey… this ain’t normal man.” Which is obviously bullshit. But I don’t wanna judge 4 years ago me. But now when I hear it i don’t even bat an eye. So thank you no sleep podcast, mr creepypasta and creeps mcpasta for helping me normalize same sex relationships. I know it may sound strange but that shit matters. Because a loving consenting relationship is a loving consenting relationship, regardless of the gender or preference of the carbon-based entities in the relationship.",
    "comments": [
        {
            "level": 0,
            "comment": "What a positive message man. Very appreciative of this",
            "score": 60,
            "author": "toiletmonke"
        },
        {
            "level": 0,
            "comment": "The Magnus Archives is another great horror podcast which normalizes non-heterosexual relationships. Though if I recall correctly, many of these relationships don't appear until later in the series.",
            "score": 103,
            "author": "Dpan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Welcome to Night Vale too! Although it's more quirky/creepy than full-on horror I suppose.",
                    "score": 48,
                    "author": "carbonatedbitch"
                },
                {
                    "level": 1,
                    "comment": "There were plenty of non-heterosexual relationships in the statements early on, but relationships within the main cast in general didn’t start until seasons 4/5",
                    "score": 14,
                    "author": "whyrwehere7119",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh, I see. Thanks for pointing that out!",
                            "score": 4,
                            "author": "Dpan"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The Magnus Archives was the first podcast I thought of while reading this.",
                    "score": 9,
                    "author": "Cass_Q"
                },
                {
                    "level": 1,
                    "comment": "Im on episode 9 and loving it so far!",
                    "score": 3,
                    "author": "Pineapplewolf9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank you Mr. PussyDamage for being both 1) being honest about your own innate prejudices, 2) overcoming them, 3) sharing.\n\nNot easy to self reflect and grow.  \n\nCheers",
            "score": 155,
            "author": "ethanthesimpleton"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 16,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! I’ll add it to my list!",
                    "score": 5,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "And if you like Horror Queers, Gaylords of Darkness!",
                    "score": 5,
                    "author": "Scrumpelz"
                },
                {
                    "level": 1,
                    "comment": "Thanks for the tip, that sounds super interesting!",
                    "score": 3,
                    "author": "cloudyRM"
                },
                {
                    "level": 1,
                    "comment": "It’s awesome! Finals Girls is great too- not always queer but looks at horror movies from a feminist perspective that also involves gender and sexuality :)",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah, media matters.  For me, it was the Rocky Horror Picture Show that Comedy Central would play every Halloween.  I grew up in a rural, Southern Baptist town, so I had no words for any of this stuff, but damn, Tim Curry looked cool.\n\nTook me a while, but I realized why he was the villain, too--not for the way he dressed but his actions--though I'd never had a conversation on consent in my life, just 'keep your legs closed.'\n\nInterview with the Vampire did the rest.  I had no words for what Louis and Lestat were to each other, but I saw it clear as day.\n\nThis was all back in the 90s, when I was just starting to hear and see this stuff on TV.  By the time I saw Golden Girls and shows like it, I thought... oh, there's a word for that, ok.\n\nSo hearing a podcast did it for you makes me feel old but also proud and nostalgic.",
            "score": 14,
            "author": "mandym347"
        },
        {
            "level": 0,
            "comment": "Aww! As a queer person I just want to thank you for your vulnerability in sharing. I’m glad horror podcasts helped you be really honest with yourself and ultimately align your feelings to your values 💖",
            "score": 68,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "“Align your feelings to your values.”\n\nNever heard anyone articulate that very messy and complicated process so succinctly. Sometimes it can be so hard to get your inner monologue to reflect what you know is right. Worth the effort though.",
                    "score": 15,
                    "author": "efilebafyak",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Absolutely! I’m a therapist so finding language for messy human processes is something I’m slowly learning to do 💖",
                            "score": 5,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is kinda off topic, but lots of these story telling podcasts I've listened to have opened up my eyes to how important child development and child psychology is. One traumatic event when you're a child will end up strongly influencing the adult you grow up to be.",
            "score": 9,
            "author": "paperpenises"
        },
        {
            "level": 0,
            "comment": "Thank you for this. I think a lot of people will appreciate this ❤️",
            "score": 18,
            "author": "kittensmittenstitten"
        },
        {
            "level": 0,
            "comment": "LIFE IS ABOUT GROWTH AND GOOD ON YOU FOR GROWING!\n\nIf anyone looks at themselves from 10 years ago chances are so many views and feelings would have changed. I’m certainly not the same person and I won’t be in more years to come. Very refreshing and honest post, thanks for making my morning more optimistic!",
            "score": 7,
            "author": "Tiedyegamer"
        },
        {
            "level": 0,
            "comment": "As a queer person, it makes me so happy to read stuff like this, thanks for sharing! \nWe all have internalised homophobia and it's not easy to dismantle it, so hats off to you.\nI remember moving from Italy to the UK and being astonished when I would bump into gay couples (gay men) being affectionate in public, because I never saw them growing up back home! I have to admit that it made me slightly uncomfortable even though I am queer myself because I wasn't used to it. I was very young and thankfully I have met so many queer couples of any gender that I stopped feeling like this",
            "score": 19,
            "author": "cloudyRM",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much for this response! 👍🏾❤️🙏🏾",
                    "score": 11,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is the best post I've read in a long time! 😍",
            "score": 12,
            "author": "TurnedUpDead"
        },
        {
            "level": 0,
            "comment": "Yay, good for you, that’s awesome! And thanks for making yourself so vulnerable and sharing this :)",
            "score": 4,
            "author": "Nee_le"
        },
        {
            "level": 0,
            "comment": "The Blood Crow Stories is three different multi episode stories which all feature queer characters. The first has a very awesome polyamorous male/male/female relationship which I thought was just the coolest. \n\nAnyway dude, good job on growing and learning as a carbon based life form.",
            "score": 8,
            "author": "driftwood-and-waves"
        },
        {
            "level": 0,
            "comment": "Can you reccomend some good horror podcasts? I'm thinking of doing my own, and want inspiration",
            "score": 3,
            "author": "GlyphCreep",
            "replies": [
                {
                    "level": 1,
                    "comment": "The ones I listen to are Creepy, Darkness Prevails, Knifepoint Horror, Mr Creepypasta’s Storytime, Creeps McPasta Creepypasta Radio, This Paranormal Life (not a story podcast but still awesome) and of course, the NoSleep Podcast (this one has the best production value and is the most revered from what I can tell, though it doesn’t necessarily have the best stories). \n\nIf you are looking for inspiration, check out any of those, but look around online to see which stories people have voted as their favorites instead of just jumping in blind. In general, many of these podcasts overlap with the stories so you may hear one or more of them on multiple podcasts, but all in all they’re pretty solid podcasts. Personally I’m partial to the first fifteen episodes of Creepy, where they get into a lot of urban legend type stuff (secret rooms at Disney, haunted video games, etc.). That’s just my personal preference because I love urban legends. As far as the nosleep podcast, you can find polls on Reddit that will tell you what people’s favorites are. I love butter street hitchhiker, my pet monster and Whitefall to name a few.\n\nLast but certainly not least, two of the nosleep stories have their own separate podcasts, and I like both:\n\nThe Left-Right Game and Borrasca",
                    "score": 4,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I gotta shout out Old Gods of Appalachia as well. Really well made, awesome storytelling featuring a lot of strong female leads and non-het relationships as well.",
                            "score": 8,
                            "author": "SkinValidateMe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And let's not forget canonically ace female leads! Love me them Old Gods.",
                                    "score": 3,
                                    "author": "commandantskip"
                                },
                                {
                                    "level": 3,
                                    "comment": "Agreed!  Since you like Old Gods you might check out Unwell also, it’s fantastic!",
                                    "score": 2,
                                    "author": "starlight1978"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So glad to hear your personal growth! If you're looking for more queer friendly horror podcasts check out Unwell, A Midwestern Gothic Mystery",
            "score": 3,
            "author": "ForgottenFae"
        },
        {
            "level": 0,
            "comment": "This is really uplifting news. Thank you for sharing!",
            "score": 3,
            "author": "Olympia2718"
        },
        {
            "level": 0,
            "comment": "Good man.",
            "score": 3,
            "author": "PalmTreePhilosophy"
        },
        {
            "level": 0,
            "comment": "Yo gotta say congratulations. Like others have said it’s pretty retrospective of you to be aware of the potential discrimination you held and to actively challenge it. Isn’t it interesting that it was this in your life that caused it to surface and change!? It just goes to show the tiniest thing can impact you. Thank you for sharing this!",
            "score": 12,
            "author": "Muzaffar23"
        },
        {
            "level": 0,
            "comment": "Wholesome feels AND horror suggestions in one post?\nVery glad I looked at this group ❤️",
            "score": 2,
            "author": "SpineofGorgax"
        },
        {
            "level": 0,
            "comment": "Its cool to see common interests enabling you to understand people with different world views. That lens truly helps you realign your own perspective. Cheers!",
            "score": 2,
            "author": "HorrorBullFilmSchool"
        },
        {
            "level": 0,
            "comment": "Alice isn't dead and earth break normalize this too!",
            "score": 2,
            "author": "BusinessPin7652"
        },
        {
            "level": 0,
            "comment": "Weird a podcast is what it took to teach you empathy like the rest of us but good for you, dude 👍",
            "score": 1,
            "author": "CanadianSweater",
            "replies": [
                {
                    "level": 1,
                    "comment": "I feel like that was a back-handed compliment, but in case you were serious, please allow me to explain.\n\nIt didn’t teach me empathy, it helped me realize that I still had a blind spot. I realized I had a snag that I’d never noticed before. \n\nEmpathy allows me to “be more accepting of criminals and abusive parents because they have had horrible lives that have led them to that decision and instead of judging them I empathize, though I do not approve.”  I generally associate empathy with something people choose, and/ or something bad or depressing, and not with people being born the way they are.\n\nI never associated that with the homosexual/ trans/ bi/ queer community. I’m not “tolerant of those who identify differently because they had a horrible life that led them to that decision.” I am learning to accept that not everyone is like me, and - as long as their lifestyle isn’t immediately harmful to others - I’m good with it! And that is what these podcasts helped me with\n\nEdit: by “harmful to others” I mean endangering lives in some way (rape, murder, etc.)",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        }
    ]
}