{
    "id": "seuw37",
    "score": 518,
    "title": "The Always Sunny in Philadelphia podcast is a fantastic transition from show to podcast",
    "author": "christiandb",
    "date": 1643388120.0,
    "url": "https://www.reddit.com/r/podcasts/comments/seuw37",
    "media_urls": [],
    "other_urls": [],
    "postText": "The show has been out since December and started off as a show where 3 of the stars (Charlie, Glenn and Rob) sit down and talk about each episode of the show. Seemed like FX forced content as an accompaniment to the tv show.\n\nHowever, overtime, the show has been morphing into something really special. It’s unapologetically always sunny in podcast form. The hosts talk about their real lives but with the cadence of the show itself. A lot of times they barely touch on the show and talk about getting into fights, finding dead bodies while filming, crazy actors they’ve worked with and industry stuff that’s super interesting.\n\nBest of all, they seem to really like each other. After 15 years, their chemistry is on point. It’s undeniable how much everyone loves Charlie and after the last episode, where they added a video element, You can see why. That dude brightens up a room. Shout out to Meghan, tech ops, who brings the outside laughter. \n\nI’m not a diehard always sunny fan but I look forward to every episode. Genuinely funny. Check it out",
    "comments": [
        {
            "level": 0,
            "comment": "I am honestly so glad that it didn’t turn out to be a typical rewatch companion. I love the banter and the realness, like when they talk about stuff that worked or didn’t.",
            "score": 82,
            "author": "darlenesclassmate",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same here. I really enjoy the process of how it started, working through the kinks and now finding their groove as Danny has become apart of the show. It all started with making movies and shows for their friends. It's inspiring to listen to",
                    "score": 19,
                    "author": "christiandb",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The “Charlie Got Molested” episode is really interesting. They acknowledge that it’s a fairly offensive underlying joke, but explain why they did it.",
                            "score": 1,
                            "author": "Denver650"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "and the best part is Stephen Spielberg drops in once in a while ;p",
            "score": 60,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "he might be a little shy with the video portion now",
                    "score": 22,
                    "author": "christiandb"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 31,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same here. They hooked me by releasing like three initially. Now I'm fiendin",
                    "score": 13,
                    "author": "christiandb",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've recently discovered this podcast as well. I love the TV show but haven't seen probably about 75% of the shows. So I'm glad they talk about whatever they want as well.\n\nWhat's great is that since each show is it's own podcast we have a shitload to come if they want to keep going with this. I wouldn't be disappointed if they just shot the shit and didn't talk about the show at all to tell you the truth.",
                            "score": 2,
                            "author": "richvide0"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s basically “what if the gang were actually decent, intelligent people?” I love it",
            "score": 23,
            "author": "Xena_bro"
        },
        {
            "level": 0,
            "comment": "That podcast taught me that parking is a very controversial topic",
            "score": 19,
            "author": "Adventurous-Idea-518",
            "replies": [
                {
                    "level": 1,
                    "comment": "Definitely a lot of LA-centric discussion but they make it interesting hah",
                    "score": 5,
                    "author": "Saquon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The episode about Rob at the In-N-Out was extremely unexpected and very interesting. And it had nothing to do with the show. It's rare to see someone so openly discussing toxic masculine culture like that. I'm already a fan of the show, but that episode was something special.",
            "score": 91,
            "author": "PartyMoses",
            "replies": [
                {
                    "level": 1,
                    "comment": "favourite ep so far!",
                    "score": 3,
                    "author": "cordialconfidant"
                },
                {
                    "level": 1,
                    "comment": "I agree. I loved this episode. I read your comment before I got to this episode so I was looking forward to it. I loved the questioning of Rob's actions being the right or wrong decisions. Makes you think.",
                    "score": 3,
                    "author": "richvide0"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Agreed, it's very listenable. It's pretty clear how those personalities made such a successful show, just surprising that they still get along and have such chemistry after all this time.",
            "score": 15,
            "author": "regallll"
        },
        {
            "level": 0,
            "comment": "I'd honestly hoped the real people would be slightly less neurotic than the characters in the show... but damn are they close to the real thing.",
            "score": 52,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Glenn's little spat with Rob over his Highschool girlfriend was amazing.",
                    "score": 24,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Which episode?",
                            "score": 7,
                            "author": "namenumberdate"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Could not agree more! Only 16 eps in it is already a favorite, one I bump to the top of my queue whenever it drops. Go listen!",
            "score": 25,
            "author": "stexlo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I have podcasts I \"save\" for when I know I'm gonna have to take a long drive or do something tediious/I don't like.\n\nThis podcast immediately became one of them",
                    "score": 9,
                    "author": "Saquon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Its so fucking funny. I loved the suspense the first time I listened to the \"Mac fights over a burger\" episode.",
            "score": 21,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I believe it was \"Mac Gets In A Fight at the Hamburger Store\" lol",
                    "score": 9,
                    "author": "ohverychill"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Couldn't agree more! I have been enjoying listening to them talk and I actually liked watching the video for the last episode. \nIt feels like every successful tv show is now getting a podcast. Just saw the podcast for New Girl.",
            "score": 5,
            "author": "miketheeagle"
        },
        {
            "level": 0,
            "comment": "It’s my new favorite podcast - by far. Absolutely a joy to hear them chat.",
            "score": 6,
            "author": "Upset_Airport"
        },
        {
            "level": 0,
            "comment": "i just found it 4 or 5 weeks ago  and love it.  sometimes it feels like your just listening to an episode of the show.",
            "score": 4,
            "author": "tim8104"
        },
        {
            "level": 0,
            "comment": "It's quickly become my favorite podcast and the only one that I make sure to rewind if I miss even a small piece of the episode.",
            "score": 3,
            "author": "SaltyHatch"
        },
        {
            "level": 0,
            "comment": "Would you recommend it to someone who has never watched any of the show?\n\nI've seen clips of it as thats unavoidable and im aware of a lot of the memes, i have enjoyed what i've seen but i generally dont sit down in front of anything long enough to watch episode after episode.  I do however consume a lot of podcasts.",
            "score": 3,
            "author": "86for86",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, I would. They have really distinct personalities and it works together in harmony. It’s like if the podcasts that talk about movies were talked in detail about the creative process as well.\n\nCheck out the first two and if you like them you’re in the right place :)",
                    "score": 2,
                    "author": "christiandb"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Excellent recommendation!",
            "score": 3,
            "author": "likalukahuey"
        },
        {
            "level": 0,
            "comment": "This is the most exciting thing i've read in ages thank you 🤩",
            "score": 3,
            "author": "buxomblossom"
        },
        {
            "level": 0,
            "comment": "Where's Dee?",
            "score": 3,
            "author": "thejesiah",
            "replies": [
                {
                    "level": 1,
                    "comment": "They couldn't budget in a bird handler.",
                    "score": 3,
                    "author": "DinosaurAlive"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This podcast is great! If anyone is a fan of workaholics check out their podcast on Spotify called \"this is important\" lots of laughs!",
            "score": 6,
            "author": "Educational_Pea4558"
        },
        {
            "level": 0,
            "comment": "so glad to see the Always Sunny podcast recommended here! little did i know that i would be so intrigued with 3 dudes talking about parking for over 30 minutes, alas here i am listening to it for a second time",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I absolutely love their podcast. As someone interested in production the back end stuff is gold.",
            "score": 2,
            "author": "venturoo"
        },
        {
            "level": 0,
            "comment": "It really sucks they don’t drop as much! Cut that cut that cut that cut that",
            "score": 2,
            "author": "Ok_Western5937"
        },
        {
            "level": 0,
            "comment": "Thx I've been looking for a new podcast, I'll definitely give it a try.",
            "score": 2,
            "author": "spreadingdepression"
        },
        {
            "level": 0,
            "comment": "I just discovered it now its perfection. I absolutely love these guys sense of humour. Also the fact D isnt on it is pretty funny.",
            "score": 2,
            "author": "XXLpeanuts"
        },
        {
            "level": 0,
            "comment": "Thanks for this dude. damn it kind of grows on you!",
            "score": 2,
            "author": "kira_the_deathgod"
        },
        {
            "level": 0,
            "comment": "I LOVE IT SM I came to this thread to write about it 💓",
            "score": 2,
            "author": "RepresentativeAd315"
        },
        {
            "level": 0,
            "comment": "Check out this podcast recommendation video\nhttps://youtu.be/Uxopb_0BMKo",
            "score": 2,
            "author": "tendersloth"
        },
        {
            "level": 0,
            "comment": "So, I haven’t watched the latest series, I don’t have the means to watch it, but was holding back on listening to the pod  because I thought they were doing an episode-by-episode thing. But they’re not?? Will they spoil episodes for me if I listen before I’ve watched?",
            "score": 3,
            "author": "babybuttoneyes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not really, they talk about the episodes, what worked and didn't work and their feelings about it. It's not like a directors commentary or anything where they're going frame by frame. \n\nI don't know by spoiled, if you're impressionable, they might have personal opinions that can shape how you enjoy the show ( for example, they really didn't like the first season, they rag on it).",
                    "score": 3,
                    "author": "christiandb",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ohhh, I assumed it was just starting from the newest season , as it came out at the same time. Okay, I’m off to download some pods! Thanks",
                            "score": 2,
                            "author": "babybuttoneyes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "enjoy :)",
                                    "score": 2,
                                    "author": "christiandb"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Workaholics podcast This Is Important is better. Always makes me laugh.",
            "score": -2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Second recommendation today",
                    "score": 1,
                    "author": "christiandb",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sorry shouldn't say better I guess but it's just different and more jokey. I love it it's hilarious.",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        }
    ]
}