{
    "id": "yv30h3",
    "score": 915,
    "title": "Anyone else completely skip live episodes?",
    "author": "Upset_Ad9532",
    "date": 1668440324.0,
    "url": "https://www.reddit.com/r/podcasts/comments/yv30h3",
    "media_urls": [],
    "other_urls": [],
    "postText": "Even on my favorite pods I can't stand this shit. It's like a renaissance of the canned sitcom laughter format of the 90s. \n\nFeels like an episode of Full House when you get an audience titter after Every. Single. Sentence.  Hahahaha",
    "comments": [
        {
            "level": 0,
            "comment": "always. the laughter, the bad sound quality",
            "score": 249,
            "author": "DelayedLightning",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m sure every podcaster knows this. They see their numbers. But, they make money off of their super fans that paid for tickets. It’s not a big deal.",
                    "score": 47,
                    "author": "89LeBaron",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And luckily usually it's a skippable one, like a Halloween or April Fool's one.",
                            "score": 11,
                            "author": "Dozinginthegarden"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes! Thought I was the only one. \nThe flow is always off and they’re just not as engaging as recorded episodes.",
            "score": 57,
            "author": "bludreamsnlaserbeams",
            "replies": [
                {
                    "level": 1,
                    "comment": "The absence of a good editor becomes painfully obvious when listening live.",
                    "score": 42,
                    "author": "Marisleysis33",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Holy shit that’s what it is! Those awkward pauses are edited out aren’t they, I’ve never noticed until now",
                            "score": 1,
                            "author": "CraftyDad1980"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "“How did this get made” has got to be the worst about that.",
                    "score": 6,
                    "author": "thezoomies"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah huge waste of time listening to minutes of applause and waiting for laughs to die down. Almost always a 10 minutes sidetrack about something that is happening live while the hosts joke about how it sucks for the listeners. \n\nYes, it does suck and your jokes about it don’t make it any better.",
            "score": 76,
            "author": "mentalbreak311",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or for the podcast, they record and insert descriptions of what is happening on stage. Yeah I'd rather not.",
                    "score": 1,
                    "author": "LaeliaCatt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love certain podcasts that record live. The Dollop, Behind the Bastards, and the like. I actually attended a recording of The Dollop recently and absolutely loved it.",
            "score": 20,
            "author": "banjono",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was actually thinking that some of the dollops best episodes are live recordings. NY to Paris for one.",
                    "score": 8,
                    "author": "RecommendationBrief9"
                },
                {
                    "level": 1,
                    "comment": "I can’t stand the live Dollops, but I would like to go to a live show. It’s like they forget the podcast audience and I feel that I miss so much visually.",
                    "score": 3,
                    "author": "CWHats",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I went to a live Dollop recently and was very disappointed.  It didn't just suck on audio.  It also sucked in person.",
                            "score": 1,
                            "author": "abracadavars",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you think it suck on audio, what would compel you to go to a live show?",
                                    "score": 4,
                                    "author": "CWHats",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Most importantly because my husband got tickets but also because I really used to enjoy the show.",
                                            "score": 1,
                                            "author": "abracadavars"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The Dollop is a blast. I tend to avoid live shows because I feel like seeing the hosts in person breaks the spell a bit. Like, I saw Radiolab live, and after my interest dropped way off. Same with when I saw David Sedaris live. Maybe it's because podcasts have the illusion that they're just speaking to you, and seeing them speak to others shifts the dynamic.",
                    "score": 1,
                    "author": "buckybadder"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I always skip live episodes. And bonus episodes. And reruns. And \"we read your mail\"/listener call-in episodes. And interview episodes, if it's not an interview based podcast. And promotional episodes. And trailers. And crossover episodes. I archive them all when I find a new podcast so I know exactly how many \"real\" episodes have been released before I dive in. \n\nYeah... I'm picky lol.",
            "score": 157,
            "author": "CantHugEveryPlatypus",
            "replies": [
                {
                    "level": 1,
                    "comment": "I kind of like the “listener mail” ones but not whole episodes. Stuff you should know does a segment of that at the end of each episode but it’s a couple of minutes. Otherwise, 100% agree with you on all of that!",
                    "score": 26,
                    "author": "withdavidbowie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hate all the sidebar stuff. The 5 minutes intro, the mail call, talking about the drive to work. I'm here to listen about black holes! Gimme!",
                            "score": 13,
                            "author": "the_author_13",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I can handle that, as long as they include when the actual show starts in the description. Untucking the republic came up with the perfect solution, which is releasing the “show notes” for each show as a separate episode.",
                                    "score": 3,
                                    "author": "thezoomies"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I do exactly the same. It's the good kind of picky.",
                    "score": 6,
                    "author": "Laffenor"
                },
                {
                    "level": 1,
                    "comment": "I also skip any phone in sections of episodes I'm listening to. I just don't care enough about random people who are calling in.",
                    "score": 6,
                    "author": "el_ferritoboy"
                },
                {
                    "level": 1,
                    "comment": "Always Sunny has fun call in ones",
                    "score": 8,
                    "author": "wazzle13",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Especially when Steven Spielberg calls in.",
                            "score": 8,
                            "author": "danstymusic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I feel like I'm in the minority but I always fast forward through Spielberg bits lol\n\nIt wasn't that funny to me to start, it's a pretty one note joke to run into the ground, and it's pretty grating\n\nI feel better getting that off my chest lol",
                                    "score": 5,
                                    "author": "ohverychill"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is the only podcast where I listen to every episode no matter the format. Even if it's not my favorite format, I enjoy it. Even the live shows.",
                            "score": 2,
                            "author": "mumblewrapper"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh god, listener mail shows are the worst!  I also hate guest host episodes on podcasts that are really dependent upon one person’s personality/humor. I’m looking at you Robert Evans, when I go to listen to an episode of “It Could Happen Here: Daily with Robert Fucking Evans”, and there’s no Robert Evans. Just don’t put out a show that day bruh, it’s diluting your brand.",
                    "score": 3,
                    "author": "thezoomies"
                },
                {
                    "level": 1,
                    "comment": "One exception: the mailbag episodes of We Hate Movies between 2014 and 2020 are fantastic.",
                    "score": 2,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I do the same exact thing",
                    "score": 2,
                    "author": "alexd9229"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes—sinisterhood has become almost unlistenable because all they play anymore are live shows. I also hate interview episodes on shows where that isn’t the normal format",
            "score": 18,
            "author": "SwirlyGirly42",
            "replies": [
                {
                    "level": 1,
                    "comment": "I get that they're on tour...but Sinisterhood has been phoning it in for like 3 months now. Why not just take a break?? If it's not a live episode, it's an easy, fluff episode about a haunted house. I genuinely wonder if there are people who find the ghost/haunting episodes interesting, because for me they're just as bad as the live episodes.  Reallyyy hoping they get back to the business of in studio true crime content soon.",
                    "score": 10,
                    "author": "HarperLeesGirlfriend",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I enjoy their episodes about the ghosts/hauntings, though I prefer it when they cover true crime. I'm also sick of all cryptids no matter who covers them.",
                            "score": 8,
                            "author": "FireGn0me"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yup. Not every show, but most of them. It’s everything you said, plus the inevitable visual gags. That’s not anyone’s fault, it’s natural for people to express themselves physically when they know they can be seen, but it’s not a very good listening experience. \n\nAlso, most shows change their format for live shows in order to involve the audience. Again, probably a good call for the live show, not a great listening experience.",
            "score": 11,
            "author": "BarelyClever"
        },
        {
            "level": 0,
            "comment": "I can't stand live podcasts. I'm not listening to a podcast to \"hear\" visual jokes, or listen to constant crowd noises and bad audio. If they want to do live shows then keep it off the podcast feed.",
            "score": 10,
            "author": "OutlyingPlasma"
        },
        {
            "level": 0,
            "comment": "I like the podccast No Such Thing As A Fish (trivia and fun facts type of show) and it feels like it's at least 50% live shows. This one doesn't suffer too bad from the live aspect because the sound quality is okay and they're working a lot off of prepared material, just like a studio show.",
            "score": 10,
            "author": "soingee",
            "replies": [
                {
                    "level": 1,
                    "comment": "Very true.",
                    "score": 2,
                    "author": "CWHats"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah, they're awful and ruins the chemistry of every show. The hosts are always way more self-conscious.",
            "score": 8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I always skip live episodes, I assume they only serve to keep the posting schedule whilst touring.",
            "score": 24,
            "author": "BrokenPetal"
        },
        {
            "level": 0,
            "comment": "I HATE live episodes they are so terrible",
            "score": 8,
            "author": "longtallchrissy"
        },
        {
            "level": 0,
            "comment": "Always.",
            "score": 6,
            "author": "regallll"
        },
        {
            "level": 0,
            "comment": "I've noticed MBMBAM cuts out the laughter from their live episodes and I greatly appreciate it",
            "score": 7,
            "author": "1d420",
            "replies": [
                {
                    "level": 1,
                    "comment": "I actually love their live shows and have missed them greatly for the last few years. Not sure why but they’re generally my favorites; same with TAZ (with a few exceptions) and some of the Sawbones live shows (“Ho-Ho sick?” Gets quoted a lot around here). \n\nMcElroys were my introduction to podcasts so it took me a while to figure out why everyone hates live shows; then some of my other shows started introducing them and, yep, straight in the trash they go.",
                    "score": 1,
                    "author": "lilsmudge"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Comedy Bang Bang live episodes (at least the proper tour ones and not the convention shows are pretty good). Most of them incorporate some sort of running gag and several have added to their characters back-stories enough that it warrants a listen if you’re a big fan. The regular podcast is improv anyway so it’s not too different in nature. Audio quality is spotty on the earliest shows though.",
            "score": 6,
            "author": "iglomise"
        },
        {
            "level": 0,
            "comment": "I hate when \"how did this get made\" involves the audience in their live shows. Its always extremely cringe because the audience members are trying to be comedians every time.",
            "score": 34,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Audience questions and 2nd opinion songs are the worst. \n\nBut I do like how the team, especially Jason, responds to audience energy.",
                    "score": 12,
                    "author": "melodypowers"
                },
                {
                    "level": 1,
                    "comment": "Some dude proposing to his girlfriend at a HDTGM show is one of the most annoying things I've ever heard on a podcast.",
                    "score": 5,
                    "author": "invisiblecows",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or that one guy who said he was \"the jason\" of his friend group. I almost died of secondhand embarrassment.",
                            "score": 9,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Omfg yes that was the worst! However, I did enjoy Jason shutting it down.",
                                    "score": 4,
                                    "author": "invisiblecows"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I tried to like HDTGM but so much of the show requires you to also have seen the (often obscure) movie. They'll talk about the plot out of order and say vague things like, \"what about that shirt he wore? Right? It was like, wow!\" Then on some live shows they'll play clips that 100% do not translate to audio-only well. Just too frustrating.",
                    "score": 3,
                    "author": "soingee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Glad I’m not the only one. After seeing it recommended so much, I was very annoyed and disappointed.",
                            "score": 4,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I enjoy their live episodes but always end up skipping out on the audience questions because of the secondhand embarrassment! I even try to power through cause rarely someone makes a good point or has a good question.",
                    "score": 2,
                    "author": "trumpetcrumpets"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I usually do, and mostly because audio quality tends to be BAD",
            "score": 13,
            "author": "Id_Rather_Beach"
        },
        {
            "level": 0,
            "comment": "Almost always.",
            "score": 5,
            "author": "Daxos157"
        },
        {
            "level": 0,
            "comment": "Every time",
            "score": 5,
            "author": "Agile-Young949"
        },
        {
            "level": 0,
            "comment": "I skip all of the live episodes until I've heard all of the others. They're not as good but sometimes you can wind up with fun bits. For example, Gareth Reynolds from the Dollop will tell audience members to stfu if they keep interrupting, which is good for a laugh.",
            "score": 4,
            "author": "blipken"
        },
        {
            "level": 0,
            "comment": "100% always skip. Thought i might be alone in this, so glad to see lots do it",
            "score": 3,
            "author": "Natural_Bit_1756"
        },
        {
            "level": 0,
            "comment": "Yep, always skip. Usually it's simply because there's too much chitter chatter and filler.",
            "score": 4,
            "author": "Marisleysis33"
        },
        {
            "level": 0,
            "comment": "I like live episodes on the Dollop because that's when they have fun guests and it's otherwise identical. I'm really liking the Past Times with a guest each time.",
            "score": 9,
            "author": "standard_candles",
            "replies": [
                {
                    "level": 1,
                    "comment": "I almost like the live shows better but I'm not sure why.",
                    "score": 2,
                    "author": "serlindsipity",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think it's a mixture of him saving good ones for live shows, the added comedian, and the feedback from the audience that is sometimes really funny",
                            "score": 3,
                            "author": "standard_candles"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They're rarely good. Can be OK when it's a comedy podcast, Chapo Trap House had good live episodes. When it's fiction, it sucks. Night Vale did one of the most important episodes live and it just ruined it.",
            "score": 15,
            "author": "edfirmley",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh, I was so bummed when Night Vale did that!",
                    "score": 8,
                    "author": "fesnying",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Night Vale live shows seem to just boil down to “Look at all these callbacks with appearances from our most wacky voice actors” \n\nLike I swear to god they just had what’s his face who voices Steve and Hiram just sit there doing 5 different voices by himself for 5 minutes and it’s like he’s good, but is it *that* good? And man the Faceless Old Woman’s improv… oof. The audience apparently loved it, maybe I’m the old and out of touch one lol \n\nLike don’t get me wrong they’re absolutely great voice actors and all that but I dunno, something about the live format kinda killed the flow. \n\nI think Kevin and Lauren handled this the best tbh, any live episodes with them were great except that one with the weird standoff with Tamika who I simply don’t care for. But Kevin and Lauren’s chaos is in such a way that live or not it’s just fun to listen to.\n\nAll in all I don’t mind them terribly, but I don’t revisit them as often as the other episodes, I would probably visit them even less if they weren’t plot related, and I do wish they weren’t.",
                            "score": 9,
                            "author": "NocturnalToxin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The one I remember (I think the first one) had several pivotal moments ruined by audience reactions totally bumming up the pacing.\n\nNight Vale has some fine actors, but it also has a lot of actors who frankly are totally miscast. Mara Wilson as the Faceless Old Woman is a disaster. In general, it was much better when most of the secondary characters were reported on instead of heard.",
                                    "score": 2,
                                    "author": "edfirmley"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I get it! I listen to Beautiful Anonymous and generally love that podcast, but I always skip the live episodes.  There's also a couple of live episodes from Radiolab and this American life that I couldn't handle.",
            "score": 3,
            "author": "I_Am_Zampano",
            "replies": [
                {
                    "level": 1,
                    "comment": "Radiolab has one of my favorite live episodes ever, the one with War of the Worlds! That being said...I believe it's the only live episode of any podcast that I can stand so, I guess it's also defaulted as my favorite.",
                    "score": 1,
                    "author": "ovrqualifiedovrpaid"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah they frequently suck. I don’t like recording of live music, either. The leveling is usually off and the sound quality is poor and I am too distracted",
            "score": 3,
            "author": "duckinradar"
        },
        {
            "level": 0,
            "comment": "Yep.",
            "score": 3,
            "author": "be47recon"
        },
        {
            "level": 0,
            "comment": "Levar Burton reads has some decent live episodes with musical accompaniment and interviews.",
            "score": 3,
            "author": "hotairbalooner"
        },
        {
            "level": 0,
            "comment": "It depends on the show, but usually, yeah. I used to love How Did This Get Made hut then for like a year every single episode was live and I completely lost interest.",
            "score": 3,
            "author": "UltimaGabe"
        },
        {
            "level": 0,
            "comment": "I often skip them too",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I feel like I’ve been living under a rock lol I rarely come across live ones in the shows I’m subbed to.  What are some common ones that do these?",
            "score": 3,
            "author": "projectdavepodcaster",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's becoming a newer trend for some of the more popular podcasts, especially the left leaning political genre. \n\nThe specific episode that inspired this post was today's TrashFuture episode about Neom. Super disappointing, I love hearing about that shit but the canned laughter and the pause for laughs format just murdered the vibe. \n\nAlso happens on like Chapo or Trillbillies.",
                    "score": 2,
                    "author": "Upset_Ad9532"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I thought I was alone in this. It’s a completely different dynamic. The host are now playing for laughs from the crowd and often the format changes to engage the audience in some kind of exchange that I get nothing from as a listener. But hey…the audience paid their money so they have all the right to enjoy themselves",
            "score": 3,
            "author": "Concerned_Kanye_Fan"
        },
        {
            "level": 0,
            "comment": "Yes. So annoying. Podcasters feel they need to yell when they're in front of a live audience and maybe they do but that ain't good radio. Unlistenable",
            "score": 7,
            "author": "vincenicholas"
        },
        {
            "level": 0,
            "comment": "Yep. I don’t like live recordings of music either for a similar reason (the crowd noise is obnoxious and sound quality is almost never that great).",
            "score": 6,
            "author": "withdavidbowie"
        },
        {
            "level": 0,
            "comment": "Always!",
            "score": 2,
            "author": "BiscuitCat1"
        },
        {
            "level": 0,
            "comment": "Yep. One of my favouritw podcasts \"You're Dead to me\" recently published a live episode on a subject I'm very much interested in: the history of fandom.\n\nCouldn't make it through more than the intro.",
            "score": 2,
            "author": "PatsysStone"
        },
        {
            "level": 0,
            "comment": "Absolutely!\n\nI also hate \"live version\" music. It's just sub par on quality, and it's not like you get the experience from listening to a concert or show when you're alone in your car anyways.",
            "score": 2,
            "author": "Laffenor"
        },
        {
            "level": 0,
            "comment": "\"Lavar Burton Reads\" has a pretty good live show that I enjoy.  Other ones...not so much.",
            "score": 2,
            "author": "ChessTiger"
        },
        {
            "level": 0,
            "comment": "It depends on the pod. There are some that are actually awesome, like \"Improvised Star Trek\" or \"Off Book\", but i will usually skip live eps due to bad audio.",
            "score": 2,
            "author": "Hayabusa71"
        },
        {
            "level": 0,
            "comment": "Dam this is making me re think doing all our ep live....",
            "score": 2,
            "author": "Masters-Of-None"
        },
        {
            "level": 0,
            "comment": "They’re actually my favourite. I stopped listening to a lot of podcasts because of how over-produced they are.",
            "score": 2,
            "author": "clisare"
        },
        {
            "level": 0,
            "comment": "Yeeeeeep. Glad I'm not alone!! I need consistent audio to stay tuned in and focused so they just don't work for me.",
            "score": 2,
            "author": "Disirregardlessly"
        },
        {
            "level": 0,
            "comment": "1000000%. especially sucks for beautiful anonymous",
            "score": 2,
            "author": "stonewall000"
        },
        {
            "level": 0,
            "comment": "Rick Glasmans recent one is the only one I didn't hate, thought it was extremely well produced like everything he does.",
            "score": 2,
            "author": "LocoCoopermar"
        },
        {
            "level": 0,
            "comment": "I also feel like they try extra hard to be entertaining for the audience so it never feels or sounds as natural",
            "score": 2,
            "author": "octopolar"
        },
        {
            "level": 0,
            "comment": "It's doable, recording that audio well, if not a little difficult to mix. What drives me nuts is the celebrities (aka wealthier) podcasters who dont bother paying an audio engineer to do that for them, and then our ears have to suffer for their stinginess",
            "score": 2,
            "author": "Last_VCR"
        },
        {
            "level": 0,
            "comment": "It's like an inside joke, you had to be there.",
            "score": 5,
            "author": "Questi0nable-At-Best"
        },
        {
            "level": 0,
            "comment": "Not usually my cup of tea unless there's a really good master of ceremonies who can keep things moving and contributions which don't lose momentum.",
            "score": 4,
            "author": "Glitz-1958"
        },
        {
            "level": 0,
            "comment": "For MBMBAM the live shows can be some of their best, so I never skip them!",
            "score": 5,
            "author": "booksnwalls",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup, MBMBAM is an exception. \n\nAdventure Zone is a real mixed bag with live shows though. The audience is always irritating, and sometimes the format leaves them rushing through stuff by the end, but often the core idea is good and funny so it still justifies the listen.",
                    "score": 5,
                    "author": "BarelyClever",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "100% agree. Some of the TAZ live shows are great but others have been lacklustre. I don't feel as bad giving them the pass (hoping the Brennan Lee Mulligan Dadlands 2 is recorded though!)",
                            "score": 2,
                            "author": "booksnwalls"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ever since they revamped the live show format and question portion it’s become MUCH more listenable at that.",
                    "score": 4,
                    "author": "EclipseoftheHart"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love live episodes. The ones you listen to are probably badly recorded and edited",
            "score": 3,
            "author": "FelicityAzura"
        },
        {
            "level": 0,
            "comment": "My question for everyone posting who seems to agree - so you skip the live eps when they’re in your feed. What about if you had the chance to actually go to see the podcast live though? Would you do that?\n\nOften podcasters put on live shows because it’s a much more effective way of generating income than hoping people will review, like and share the podcast, and maybe subscribe. \n\nPlus it’s a fun way to meet listeners in person. And sure, it’s not always great to listen to on the feed but it does give the podcaster some content so they can occasionally take a break.",
            "score": 1,
            "author": "d20Benny",
            "replies": [
                {
                    "level": 1,
                    "comment": "I honestly can say I have no interest in attending a live podcast. In my mind it's the same thing as attending a filming of Jimmy Fallon or some shit. \n\nThe appeal of podcasts as a media medium is that all interaction is on my terms. I respect that people gotta do what they need to make bank, but I'm not going to subject myself to it. \n\nIf I wanted ad pivots and awkward pauses for audience laughter I would watch cable talk shows.",
                    "score": 1,
                    "author": "Upset_Ad9532"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I used to and still do often but usually now i give them a shot first because sometimes they are funny or i learn cool trivia about the podcast I wouldn't have found otherwise.",
            "score": 1,
            "author": "Final-Attention979"
        },
        {
            "level": 0,
            "comment": "Hahahaha",
            "score": 1,
            "author": "visionsofvader"
        },
        {
            "level": 0,
            "comment": "Always",
            "score": 1,
            "author": "AccordingStruggle417"
        },
        {
            "level": 0,
            "comment": "I agree as well.  Facial expressions come in so much during the live. One person will roll their eyes or give a WTF look that gets the audience laughing but all we hear is a \"don't give me that look\".  Save the lives for YouTube.",
            "score": 1,
            "author": "Gumbopudding"
        },
        {
            "level": 0,
            "comment": "Depends, but yeah. A lot of the time hosts seem to really high on vamping it up for the live crowd and it feels pretty cringey",
            "score": 1,
            "author": "RockMeIshmael"
        },
        {
            "level": 0,
            "comment": "TrashFuture are the only pod where the end result doesn't suffer, although the guests are rarely as tight. You can tell those boys perform on stage a lot.",
            "score": 1,
            "author": "BigNoisyChrisCooke"
        },
        {
            "level": 0,
            "comment": "If anyone remember The Superego Podcast, they did these bits where they improvised a book they never read (called Forgotten Classics) The Wuthering Heights and Red Badge of Courage episodes are absolutely hilarious and brilliant and they didn’t use a live audience. All the other books they did were in front of a live audience and they are hardly as funny. I wish they did 100 more books",
            "score": 1,
            "author": "-CoachMcGuirk-"
        },
        {
            "level": 0,
            "comment": "Yeah. Unless it's harmontown. Then I skip the dead episodes.",
            "score": 1,
            "author": "BLARGITSMYOMNOMNOM"
        },
        {
            "level": 0,
            "comment": "Yes. I also can no longer tolerate podcasts with more than 1 ad in an episode.",
            "score": 1,
            "author": "Jim_from_snowy_river"
        },
        {
            "level": 0,
            "comment": "Depends on the show. But I often skip episodes with a guest host or where one of the regular hosts is absent.",
            "score": 1,
            "author": "OrbFromOnline"
        },
        {
            "level": 0,
            "comment": "I listen to very few live events of podcasts that are usually not. The ones I do genuinely enjoy usually do something completely different than the regular one.\n\nRadiolabs live shows are still the peak of the \"event\"  live shows, a live show that translates and navigates the two contexts, the show/live shows. \n\nComedian fronted  podcasts that change their format for the liveshow are quite likely to work, as they're usually already very comfortable in that environment. Marc Maron and Pete Holmes are the top of my list for that, but there are so many contenders. In both these cases the long form interview is changed to a group of people chit chatting (and sometimes sneaking material in). A relatively recent Pete one that's worth seeking out had Jimmy Carr as a guest. Delightful.",
            "score": 1,
            "author": "TheColorWolf"
        },
        {
            "level": 0,
            "comment": "I generally agree, however some podcasts are better live imo. How Did This Get Made for instance, is usually funnier with a live audience.",
            "score": 1,
            "author": "BiilZbubb"
        },
        {
            "level": 0,
            "comment": "Ill listen to a live taped podcast. How Did This Get Made does live recordings fairly often. It 99% of the time is a good recording",
            "score": 1,
            "author": "neutron5000"
        },
        {
            "level": 0,
            "comment": "Something rhymes with purple and the Allusionist both have lovely live shows. It would be better to see them live, but they are fun and sound fine",
            "score": 1,
            "author": "MigookinTeecha"
        },
        {
            "level": 0,
            "comment": "Conan's love episode with Bill.Burr recently was incredible.",
            "score": 1,
            "author": "Slipperytitski"
        },
        {
            "level": 0,
            "comment": "I only listen to live eps if there's a guest I know.",
            "score": 1,
            "author": "spoderman509"
        },
        {
            "level": 0,
            "comment": "Two things I skip Live episodes and whenever a guest is “calling” in. It’s 2022 you can have a headset and internet connection.",
            "score": 1,
            "author": "McCorkle_Jones"
        },
        {
            "level": 0,
            "comment": "Really depends on the podcast for me and the level of production value sound-wise they're able to pull off live or not. Especially ongoing narrative stuff like \"Hello From The Magic Tavern\" for example, I'm always pretty \"meh\" on the live ones because it sounds like it would've been a lot of fun to be there, but too much crowd noise and too many obviously visual gags you're not seeing just get too distracting/irritating.\n\nCertain podcasts though, like \"Doug Loves Movies\" or back when \"Haontown\" was still a thing, definitely don't have the same energy *unless* they're done live.\n\nEdit: I just realized I only listed comedy stuff as examples, and I will say more serious informative lecture/interview/Q&amp;A stuff done live usually works a lot better imo. Probably because the crowds are a lot mellower &amp; less interruptive (probably because they're usually more sober than some people are typically for a comedic show.)",
            "score": 1,
            "author": "SirDigbyChickenC-Zer"
        },
        {
            "level": 0,
            "comment": "100%. I’d rather have good content than regular content.",
            "score": 1,
            "author": "crepuscularcunt"
        },
        {
            "level": 0,
            "comment": "I went to Comedy Bang Bang! live this year, so I gotta disagree. Live eps arent what I prefer though, I usually dont relisten to them as much. The pods I listen to usually don’t do a ton of live eps so when they’re there its a fun departure of form.",
            "score": 1,
            "author": "MichaelEMJAYARE"
        },
        {
            "level": 0,
            "comment": "Yep",
            "score": 1,
            "author": "Clover1970"
        },
        {
            "level": 0,
            "comment": "I will listen to live if the guest is interesting but otherwise no. It's a totally different feel and I'm not a fan. Especially when Conan does it, because at that point, isn't it basically just his old show?\n\nThe only exception is StarTalk which was mostly live with recorded segments before the pandemic, but it's not primarily a comedy podcast so the audience wasn't really noticeable.",
            "score": 1,
            "author": "fleegle2000"
        },
        {
            "level": 0,
            "comment": "I’ve never found the issue with live podcasts tbh, wondering if the ones I’m listening to are just the rare good podcasts at it because I never have problems with the audio like other people seem to",
            "score": 1,
            "author": "pedroplaysguitar"
        },
        {
            "level": 0,
            "comment": "couldn’t agree more, OP. also can’t stand how everyone in the audience thinks it’s their big break so during the Q&amp;A part they tell some super long annoying story. like theyll be added to the pod if they make people laugh etc.",
            "score": 1,
            "author": "JAGriff95"
        },
        {
            "level": 0,
            "comment": "Yep. Same for cross promotions. If you host show A and the new episode this week in your feed is show P, then I auto delete it. I will not be bait and switched.",
            "score": 1,
            "author": "Altrosmo"
        },
        {
            "level": 0,
            "comment": "Motorola phones:\n\nLong press volume up = skip forward. I have mine set to 60 seconds. I set skip back 30 seconds. All from my pocket. \n\nCant imagine not having skip for *any* podcast.",
            "score": 1,
            "author": "GQ_Quinobi"
        },
        {
            "level": 0,
            "comment": "No. They're not usually my favorite episodes, but I don't skip them.",
            "score": 1,
            "author": "BottleTemple"
        },
        {
            "level": 0,
            "comment": "I can't stand the sound of clapping, so I have to skip live shows. I thought I was the only one who passed on those! Same reason I can't listen to wait wait don't tell me anymore.",
            "score": 1,
            "author": "GoldieLox9"
        },
        {
            "level": 0,
            "comment": "So as a (mostly retired at this point) podcaster (Improvised Star Trek), here's what I'll say about putting up live eps in feeds: It's something people ask for. I really like having live shows as an experience that exists between performers and the live audience but alot of listeners to shows are completists and essentially demand you put those live shows up. Which is fine! It's not usually hard to record them and publish them. But I totally get why that listening experience might not be for everybody.",
            "score": 1,
            "author": "seanofkelley"
        },
        {
            "level": 0,
            "comment": "I get mad when there is a live episode on feeds I have set to auto-download. That way I can't even let the hosts know I don't like live episodes. lol \n\nMy problem isn't the applause or laughter. When recording with an audience present the whole vibe changes. The hosts are more \"on\", want to entertain and try to be extra funny. I find that exhausting.",
            "score": 1,
            "author": "BubiBalboa"
        },
        {
            "level": 0,
            "comment": "This made me laugh. I do it all the time",
            "score": 1,
            "author": "lyrico2"
        },
        {
            "level": 0,
            "comment": "I hate live episodes and always skip them. The energy and banter feel very different in front of a live audience and I don't care for it.",
            "score": 1,
            "author": "VenusGirl111"
        },
        {
            "level": 0,
            "comment": "yep, never EVER listen to the live shows.",
            "score": 1,
            "author": "howardhughesbrain"
        },
        {
            "level": 0,
            "comment": "I never listen to live episodes - same with concerts on albums",
            "score": 1,
            "author": "_smartin"
        }
    ]
}