{
    "id": "208tg0",
    "score": 1,
    "title": "Rowing at Harvey Mudd?",
    "author": "Fizzysist",
    "date": 1394645499.0,
    "url": "https://www.reddit.com/r/harveymudd/comments/208tg0",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, I'm in high school and considering attending Harvey Mudd. I'm a rower, and have seen a few mentions of rowing as a club sport on the website, but haven't been able to find anything official. Do any of you know if there's rowing on campus or near campus?\n\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "I'm on my phone so I can't look up the link, but a few years ago the Claremont Colleges Rowing Club was pretty active.",
            "score": 2,
            "author": "science-man-29"
        },
        {
            "level": 0,
            "comment": "I'm not a rower, and off the top of my head I can't think of anyone I know who rows here, but I can tell you that most athletics at HMC are part of the CMS (CMC - Mudd - Scripps) athletics consortium. [Here's the website](http://www.cmsathletics.org/landing/index). I can't find any mention of rowing there, either, but maybe my search-fu is weak. There also doesn't seem to be a listserv for rowers in the mail system.\n\nYou could always start your own club!",
            "score": 1,
            "author": "BobRedshirt"
        },
        {
            "level": 0,
            "comment": "There's definitely a rowing club/team. They practice god awful early in the morning.",
            "score": 1,
            "author": "mikasaur",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great, thanks! Do you know if there's a webpage or contact list? I can't find any info anywhere.",
                    "score": 1,
                    "author": "Fizzysist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hmmm, it's been several years since I graduated so I'm not too familiar with their website anymore.\n\nDefinitely look for CMS (Claremont Mudd Scripps) sports rather than Harvey Mudd sports. Harvey Mudd itself doesn't really have any teams.",
                            "score": 1,
                            "author": "mikasaur"
                        }
                    ]
                }
            ]
        }
    ]
}