{
    "id": "13upurh",
    "score": 2139,
    "title": "The \"Telling someone you're from Luxembourg\" starter pack",
    "author": "Priamosish",
    "date": 1685352274.0,
    "url": "https://www.reddit.com/r/starterpacks/comments/13upurh",
    "media_urls": [
        "https://i.redd.it/oghfhyjl5s2b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Hey /u/Priamosish, thank you for submitting to /r/starterpacks! \n\nThis is just a reminder not to violate any rules, located [here](https://reddit.com/r/starterpacks/about/rules). Rule breakers can face a ban based on the severity of their rule violation.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/starterpacks) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "\"you mean luxemburg, Kyrgyzstan?\"  \n^(my favorite bit of trivia about Luxemburg is that there's one in kyrgyzstan.)",
            "score": 398,
            "author": "aurumtt",
            "replies": [
                {
                    "level": 1,
                    "comment": "What about Luxembourg, Belgium. Next to Luxembourg and is actually bigger than Luxembourg.",
                    "score": 175,
                    "author": "swaggut",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i am from BE, i'm not going to impress anyone with that well known fact.",
                            "score": 45,
                            "author": "aurumtt"
                        },
                        {
                            "level": 2,
                            "comment": "They took it from us and turned it into a dump.",
                            "score": 43,
                            "author": "Priamosish",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean, as a Dutchman, i’d say thats pretty on-brand for Belgians to do when they get land.",
                                    "score": 40,
                                    "author": "EngineeringLow2186",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Gedekoloniseerd",
                                            "score": 18,
                                            "author": "skrattar69",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "gerekoloniseerd",
                                                    "score": 6,
                                                    "author": "officialtvgamers16"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Sounds kind of like the European version of Kansas City",
                            "score": 3,
                            "author": "Freedom_7",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "KC is vastly underappreciated.",
                                    "score": 3,
                                    "author": "pinktastic615"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Or the one in Wisconsin. There's also a Belgium in Wisconsin where a lot of luxembourgish emigrants live. Luxembourg, Wisconsin has more Belgians though.",
                            "score": 1,
                            "author": "pa79"
                        },
                        {
                            "level": 2,
                            "comment": "Luxembourg used to be bigger but someone felt like it wasn't small enough and its still like that. This means that Luxembourgish irredentism is a valid concept which is weird.",
                            "score": 1,
                            "author": "na_far_sjol"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "bro woke up and choose to rule Bohemia and holy roman empire",
            "score": 147,
            "author": "Salty-Ad9221"
        },
        {
            "level": 0,
            "comment": "The last Portuguese colony?",
            "score": 70,
            "author": "frankabard",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lussemburgo, caralho!",
                    "score": 36,
                    "author": "Priamosish"
                },
                {
                    "level": 1,
                    "comment": "?",
                    "score": 2,
                    "author": "middleearthpeasant",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "14.5% of the total population of Luxembourg are Portuguese immigrants, according to Wikipedia.",
                            "score": 24,
                            "author": "MrsButtercheese"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yess our benelux/flag buddies are appreciated for sure. Hyped to see luxembourg in eurovision next year.",
            "score": 58,
            "author": "blizzardspider"
        },
        {
            "level": 0,
            "comment": "So you are like super rich?",
            "score": 123,
            "author": "AndrexPic",
            "replies": [
                {
                    "level": 1,
                    "comment": "Surprised this isn’t a bigger thread here. It and Monaco are almost like if a Swiss Babk were a country.",
                    "score": 71,
                    "author": "echoGroot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hope for them it ain’t Credit Suisse",
                            "score": 6,
                            "author": "Mplayer1001"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I went to Luxembourg this summer and I was actually surprised with the number of homeless and beggar people. Not unusual fat all or a city but it's somewhat shocking if the stereotype is Luxembourgian having the highest gdp per capita in the EU.",
                    "score": 6,
                    "author": "JML65",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Luxembourg’s GDP per capita is extremely inflated by the fact that compared to other countries an absurdly high percentage of its workforce doesn’t even reside in Luxembourg and therefore don’t count as inhabitants of Luxembourg all while providing labor and consumption that counts towards Luxembourg’s GDP figures. It’s like how any big city gets lots of people commuting there from the surrounding areas, only that in this case the surrounding areas are technically located in neighboring countries and therefore the commuters only increase Luxembourg’s GDP but not the “per capita” of Luxembourg’s GDP per capita figures.",
                            "score": 10,
                            "author": "PhenotypicallyTypicl"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s so hard to be rich starterpack.",
                    "score": 12,
                    "author": "Shadowstar1000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know someone from there, he doesn’t like how everyone speaks French instead of the native language which only like a few hundred thousand people speak",
            "score": 84,
            "author": "UwU_Zhenya15",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love linguistics and normally I am of the opinion that all languages are beautiful but holy fuck Luxembourgisch is the ugliest thing I have ever heard. This coming from someone that speaks Swissgerman and conversational Dutch.",
                    "score": 93,
                    "author": "RodwellBurgen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; this is coming from someone that speaks Swissgerman and conversational Dutch\n\n\"Burgers taste horrible. This is from someone who eats feces and gargles urine for a living.\"",
                            "score": 172,
                            "author": "Priamosish",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What a great response haha",
                                    "score": 43,
                                    "author": "Appropriate_Tell4261"
                                },
                                {
                                    "level": 3,
                                    "comment": "Lmao fair",
                                    "score": 52,
                                    "author": "RodwellBurgen"
                                },
                                {
                                    "level": 3,
                                    "comment": "Well that escalated quickly",
                                    "score": 12,
                                    "author": "BabyOnRoad"
                                },
                                {
                                    "level": 3,
                                    "comment": "Right? Silly take really. Luxemburgers are delicious",
                                    "score": 3,
                                    "author": "QuantumQuadTrees8523"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My seiss teacher said in Luxemburg they speak also swiss german, so if Luxemburg is ugly, then swissgerman is as well",
                            "score": 5,
                            "author": "ItzBooty",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Your teacher is incorrect. Swiss german is a dialect of German, Luxembourgisch is a separate language. Luxembourgisch has influences from Dutch, Swiss-German doesn’t (at least not how I speak it and hear it spoken)",
                                    "score": 14,
                                    "author": "RodwellBurgen",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; Luxembourgisch is a separate language. Luxembourgisch has influences from Dutch, Swiss-German doesn’t (at least not how I speak it and hear it spoken)\n\nThat description of the language is a bit inaccurate though. It's essentially a Moselle-Franconian dialect of German that has had a significant vocabulary influence from French, and tbh for most of the French loan words, there is a German equivalent. Its no more or less similar to Dutch than any other German dialect from the Southern Eifel and Moselle regions. If anything I would argue that its more similar to Hochdeutsch than Swiss German is. \n\nLuxembourgish being seen as a distinct language instead of a dialect is due to cultural/historical rather than linguistic factors, such as the two world wars. It only became recognised as a national language in 1984.",
                                            "score": 2,
                                            "author": "stonedturtle69"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "She was suprised how well the luxemburg ppl spoke the swiss german well",
                                            "score": 0,
                                            "author": "ItzBooty",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This is because everyone in Lux speaks 15 languages, not because Swiss German is what is spoken in Luxembourg",
                                                    "score": 3,
                                                    "author": "thrattatarsha"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Find me 3 people in Luxembourg who speak swiss german.",
                                                    "score": 1,
                                                    "author": "pa79",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "done\n\nsource: i made it the fuck up (i haven’t been to luxembourg)",
                                                            "score": 1,
                                                            "author": "idonttalkatallLMAO"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If you hear teenagers of non-Luxembourgish origins speak the language, I agree it sounds terrible, but that's because of the way it is \"verbally\" learnt and spoken among young people (since we don't really learn it in school). However lately I've come to appreciate the language when spoken in a more articulate way and with a more comprehensive vocabulary by actual Luxembourgish people. Still I wouldn't call it a nice sounding language (neither would I call other germanic languages that; I even prefer Luxembourgish to German since it's less rigid, it flows better, more similarly to French I'd guess), but at least it has its own particularity and keeps up a sense of national identity.",
                            "score": 1,
                            "author": "Leo-Bri",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Very interesting, thank you! As far as germanic languages go, I find English and Hanover-Deutsch to be pretty pleasant.",
                                    "score": 1,
                                    "author": "RodwellBurgen"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I heard like 20 percent of the country is Portuguese or of Portuguese descent so the other main language now is probably Portuguese",
                    "score": 7,
                    "author": "Damerstam"
                },
                {
                    "level": 1,
                    "comment": "As someone from Luxembourg, I agree",
                    "score": 3,
                    "author": "oofersIII",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As someone who moved here 5 years ago, I agree too. Unfortunately my french was atrocious and I had to focus on that first.\n\nNow I just watch RTL online and try to absorb some vocabulary while trying to apply to the INL classes every semester 😅",
                            "score": 2,
                            "author": "gerbileleventh"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A few hundred-thousand people is a lot of Luxembourgians, the country has like 650k inhabitants",
                    "score": 2,
                    "author": "fleamarketguy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So how many shell companies and banks that only exist on paper have their physical address as your home?",
            "score": 12,
            "author": "derioderio"
        },
        {
            "level": 0,
            "comment": "Laughed at Luxemburger more than I should have",
            "score": 11,
            "author": "ALIENkas"
        },
        {
            "level": 0,
            "comment": "Oh, the one in japan? Nice man, I like anime",
            "score": 9,
            "author": "lonelymooncake"
        },
        {
            "level": 0,
            "comment": "Don’t forget the classic “oh wow you’re the first luxembourgish person i’ve met”",
            "score": 19,
            "author": "BaboonGibbon"
        },
        {
            "level": 0,
            "comment": "🇳🇱❤️🇱🇺",
            "score": 28,
            "author": "Mplayer1001",
            "replies": [
                {
                    "level": 1,
                    "comment": "more vibrant flag",
                    "score": 7,
                    "author": "GoldElectric"
                }
            ]
        },
        {
            "level": 0,
            "comment": "as a dutch person i can confirm i know next to nothing about your country 🤷 looks neat tho",
            "score": 14,
            "author": "Danenel"
        },
        {
            "level": 0,
            "comment": "I always think about the Smiths’ song, “Ask,” when I hear someone mention Luxembourg.",
            "score": 5,
            "author": "Rowdy_Puppy",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think of China whenever I listen to that song because I used to mishear \"shyness is nice, but shyness can stop you\" as \"Chinese is nice, but Chinese can stop you\".",
                    "score": 2,
                    "author": "Epaveroupacumer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel like it's only part of the Benelux because just Bene sounds awkward",
            "score": 4,
            "author": "DrugsAlligator"
        },
        {
            "level": 0,
            "comment": "I’ve heard of this country, I have heard nothing about this country.  Is pretty much where im at",
            "score": 4,
            "author": "Idunnosomethingwitty"
        },
        {
            "level": 0,
            "comment": "Czechs actually know you too, you have delivered some finest rulers to Bohemian throne (John, Charles IV and Sigismund).",
            "score": 3,
            "author": "BohemianSpoonyBard"
        },
        {
            "level": 0,
            "comment": "Putting the \"Lux\" in BeNeLux",
            "score": 4,
            "author": "BplusHuman"
        },
        {
            "level": 0,
            "comment": "Did you know that a single lightning strike in Luxembourg killed more than 500 people?",
            "score": 5,
            "author": "Forsaken-Squash4376"
        },
        {
            "level": 0,
            "comment": "Yooooo my country!",
            "score": 11,
            "author": "Camellossellos",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey we found the rest of the Luxerburguers",
                    "score": 17,
                    "author": "middleearthpeasant",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not actually Luxembourgish but still live there",
                            "score": 4,
                            "author": "Camellossellos",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Is it a nice place to live? I think about visiting there and maybe spending some months. But I am afraid european people might be racist (I am south american) and the place expensive to live on.",
                                    "score": 1,
                                    "author": "middleearthpeasant",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The people are not at all racist, maybe a little stuffy but never racist. 25% of our population is Portuguese and we have refugees from syria, Eritrea etc. It's nice I guess, Very quiet, very little crime. Kind of bad weather. But life is very expensive. Rent is astronomically high, not quite New York or Hong Kong but still very high. Groceries is not too expensive but eating out is very expensive.",
                                            "score": 8,
                                            "author": "Camellossellos",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "25% portuguese? Wow that would be great for me, I am from Brazil. But the high cost of living is a problem. I earn my money in a 'weak' coin and I lose a lot of purchasing power when converting to other exchanges.",
                                                    "score": 2,
                                                    "author": "middleearthpeasant",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah all the regular jobs are held by portuguese people, theres even towns with majority portuguese Inhabitants. But why do you want to live in Luxembourg anyway?, Germany is much cheaper",
                                                            "score": 2,
                                                            "author": "Camellossellos",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I am not sure about where I want to go yet, but I think about Luxemburg because I seems like a very nice a quiet place. I lived my whole life in one of the biggest cities in the world and I wanted something that would be the complete oposite. And you said crime rate is very low, this is very important for me. \n\nMaybe germany would also be nice, even Portugal. I am still thinking a lot about where to go.",
                                                                    "score": 1,
                                                                    "author": "middleearthpeasant",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Interesting. I love Brazil, Been to Sao paulo, Rio, Manaus,Belem,Brasilia,Recife,Salvador, super nice people and great food, especially arroz com feijão preto. Portugal is like my second home, been there 20+ times and love it very much. Compared to these places Luxembourg kind of sucks",
                                                                            "score": 2,
                                                                            "author": "Camellossellos",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Brazil is a place full of highs and lows. There is a song in here that call Rio de Janeiro a \"purgatory of beauty and chaos\" and that is a very precise definition. We have a very nice weather, nice people and good food. But the crime rate is very high and job opportunities are awfull. \n\nI don't see myself abondoning brazil forever but I would like to know how it is to live somewhere else. \n\nNice to know that you have visited so much of Brazil. If you ever come back to Brazil you should visit Bonito or lençóis maranhenses. Both those places are amazingly beautiful.",
                                                                                    "score": 2,
                                                                                    "author": "middleearthpeasant",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The swiss know where you are, and many other balkan coutnries",
            "score": 3,
            "author": "ItzBooty"
        },
        {
            "level": 0,
            "comment": "The country Luxembourg has a smaller land are than the metropolitan  are I live in (Houston)",
            "score": 3,
            "author": "hyuqena8t"
        },
        {
            "level": 0,
            "comment": "I watched this Netflix documentary about Luxembourg. It was about a police officer who investigated a military unit for smuggling drugs. \n\nThere was another documentary with the same guy investigating prostitution.",
            "score": 3,
            "author": "CA_Dweller",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't think that was a documentary, but rather our only netflix crime show called Capitani.",
                    "score": 2,
                    "author": "Priamosish",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, it was a joke",
                            "score": 2,
                            "author": "CA_Dweller"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My cousins live their for 5 years and I thought it was just a city in England which is where they are from . And I thought that Prague was also it’s own country they lived their for 6 years .",
            "score": 3,
            "author": "FaithlessnessGlass19",
            "replies": [
                {
                    "level": 1,
                    "comment": "Congratulations, you're in the top 1% of Americans for European geography!",
                    "score": 3,
                    "author": "furywolf28"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s surprisingly big and rural though. For a while it was just a country I drove through quickly on the way to other places but when I actually went and explored it I was pretty impressed, nice forest trails and beautiful valleys with castles and villages in the hills.",
            "score": 4,
            "author": "hyperxenophiliac"
        },
        {
            "level": 0,
            "comment": "No tanks?",
            "score": 2,
            "author": "Cocaimeth_addikt"
        },
        {
            "level": 0,
            "comment": "people use luxembourg to mock my name QwQ",
            "score": 2,
            "author": "Coreforce216",
            "replies": [
                {
                    "level": 1,
                    "comment": "HA! Coreforce216, more like Luxembourg amiright?",
                    "score": 28,
                    "author": "NotJustAnotherHuman",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nono you dont understand, my name is lux qwq",
                            "score": 3,
                            "author": "Coreforce216",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "so luxembourg, how does it feel being named after a country?",
                                    "score": 5,
                                    "author": "fart-flinger",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "3:",
                                            "score": 2,
                                            "author": "Coreforce216"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "oh shit  \n\nfucking \n\ngot emmm",
                            "score": 1,
                            "author": "MetaphoricalMouse"
                        },
                        {
                            "level": 2,
                            "comment": "Nah, he’s more like Liechtenstein today",
                            "score": 1,
                            "author": "Actedpie"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "let’s just use it for storage",
            "score": 2,
            "author": "ChessLandsknecht"
        },
        {
            "level": 0,
            "comment": "Hey you're only a little smaller than Akron, OH.",
            "score": 2,
            "author": "hiro111",
            "replies": [
                {
                    "level": 1,
                    "comment": "With maybe 0.1% of the crap you'd get in Ohio.",
                    "score": 1,
                    "author": "Priamosish",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't know, Cedar Point is pretty great.",
                            "score": 2,
                            "author": "hiro111"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Back in the 90s there was a Luxembourg grand prix, in Germany. In Südschleife, not Hockenheim",
            "score": 2,
            "author": "ersteliga"
        },
        {
            "level": 0,
            "comment": "I worked for a company from Luxembourg and we always got the grand dukes official birthday off as a holiday.",
            "score": 2,
            "author": "Bloorajah"
        },
        {
            "level": 0,
            "comment": "People don’t know about your small insignificant country wow",
            "score": 2,
            "author": "MichiganMan7676"
        },
        {
            "level": 0,
            "comment": "I've been to Luxembourg, nice place\n\nI can remember getting lost trying to find the hostel, we're walking around where we thought it was, we're on a bridge, look down over the side, there it is, 100m down\n\nI also remember having the least trouble speaking French there, people spoke slow enough for me to understand them",
            "score": 2,
            "author": "otherpeoplesknees"
        },
        {
            "level": 0,
            "comment": "I always thought luxembourg would be one of those tiny european country for rich snobs like Monaco, Liechenstein etc.",
            "score": 3,
            "author": "BigHead3802"
        },
        {
            "level": 0,
            "comment": "I would not think any of these things if someone told me they were from Luxembourg",
            "score": 2,
            "author": "patch616"
        },
        {
            "level": 0,
            "comment": "Dëse Post ass voll a ganz korrekt",
            "score": 2,
            "author": "oofersIII"
        },
        {
            "level": 0,
            "comment": "I'm gonna be honest. you guys dont matter a shit to anyone.",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "And your self-esteem depends on that?",
                    "score": 12,
                    "author": "Priamosish"
                },
                {
                    "level": 1,
                    "comment": "Yeah, just a major banking and finance hub, but who cares about money?",
                    "score": 8,
                    "author": "Halleyscomet85"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've always thought living in Luxembourg would be nice. I've looked up the requirements as an American.",
            "score": 1,
            "author": "Halleyscomet85"
        },
        {
            "level": 0,
            "comment": "I still find it mad that a small practically city state has its own language",
            "score": 1,
            "author": "PigeonInAUFO"
        },
        {
            "level": 0,
            "comment": "I am Durch and can confirm I know and appreciate Luxembourg (:",
            "score": 1,
            "author": "Rijsouw"
        },
        {
            "level": 0,
            "comment": "I know that really good Neofolk artist comes from there.",
            "score": 1,
            "author": "ABB0TTR0N1X"
        },
        {
            "level": 0,
            "comment": "get some land then",
            "score": 1,
            "author": "guilllie"
        },
        {
            "level": 0,
            "comment": "As someone who has lived in Belgium, no",
            "score": 1,
            "author": "Cuzwhynot--"
        },
        {
            "level": 0,
            "comment": "Some of the Luxembourg royal family vacation in my hometown. They are actually quite nice, especially compared to the other summerfolk.",
            "score": 1,
            "author": "NoahSavedTheAnimals"
        },
        {
            "level": 0,
            "comment": "Yeah well what do you expect, you couldn't have many more jokes of this type because they wouldn't fit in the country smh",
            "score": 1,
            "author": "mirodk45"
        },
        {
            "level": 0,
            "comment": "you meant Lichtenstein right?",
            "score": 1,
            "author": "Fengsel"
        },
        {
            "level": 0,
            "comment": "Can you imagine being from Andorra?\n\nNah me neither! Andorrian losers",
            "score": 1,
            "author": "janhetjoch"
        },
        {
            "level": 0,
            "comment": "So Ronaldo scored against you guys",
            "score": 1,
            "author": "No_Consideration1545"
        },
        {
            "level": 0,
            "comment": "Oh, Germany? Yeah I know where that is 😆",
            "score": 1,
            "author": "AbrahamLincolnsToe"
        },
        {
            "level": 0,
            "comment": "I realized I must've crossed it in my travels through europe without even realizing it.\nMy only knowledge of Luxembourg is [this](https://www.youtube.com/watch?v=-2x8i0ewGdM)",
            "score": 1,
            "author": "Cactocat"
        },
        {
            "level": 0,
            "comment": "Mais du coup les gars vous parlez français ou pas ? Parce que je suis jamais sûr",
            "score": 1,
            "author": "0000_v2",
            "replies": [
                {
                    "level": 1,
                    "comment": "Bongchour mon tcher ami, bieng sûr on parl fronsé ici.",
                    "score": 2,
                    "author": "Priamosish",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah ouais carrément l'accent avec !",
                            "score": 1,
                            "author": "0000_v2"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I absolutley understand, as I am a native Luxemburger (I am not a naive Luxemburger, not have I ever visited it)",
            "score": 1,
            "author": "Sir-Xcalibur-6564"
        },
        {
            "level": 0,
            "comment": "So are you French or German?",
            "score": 1,
            "author": "multiplechrometabs"
        },
        {
            "level": 0,
            "comment": "i watch jacksucksatgeography",
            "score": 1,
            "author": "apestogetherstronk12"
        },
        {
            "level": 0,
            "comment": "Amirite?",
            "score": 1,
            "author": "bgoeso"
        },
        {
            "level": 0,
            "comment": "Me: is there actually a Duke in the Grand Dutchy? I feel like there has to be....",
            "score": 1,
            "author": "pinktastic615"
        },
        {
            "level": 0,
            "comment": "Hoi4 players when they meet someone from Luxembourg:",
            "score": 1,
            "author": "allan11011"
        },
        {
            "level": 0,
            "comment": "How do you like your commute to France for groceries?",
            "score": 1,
            "author": "saccharinefish"
        },
        {
            "level": 0,
            "comment": "Oh, so you're from Lexington, Kentucky? That's so cool dude!",
            "score": 1,
            "author": "SpaceGhostBurp"
        },
        {
            "level": 0,
            "comment": "Wait so how does the average individual look like?",
            "score": 1,
            "author": "uselessneighbour"
        },
        {
            "level": 0,
            "comment": "I've travelled up France, Belgium, The Netherlands, then into German, so on a map, I PASSED THE DUCHY ON THE LEFT HAND SIDE.",
            "score": 1,
            "author": "FileInside"
        },
        {
            "level": 0,
            "comment": "I once correctly guessed a couple was visiting from Luxembourg as a sbarro worker.  They were understandably freaked out since nobody had guessed that before, but it made sense to me since they were speaking in a weird French-German chimera language.",
            "score": 1,
            "author": "Doctah_Whoopass"
        },
        {
            "level": 0,
            "comment": "Liechtensteiners: Are we a joke to you?",
            "score": 1,
            "author": "MountainTitan"
        },
        {
            "level": 0,
            "comment": "I feel like the opposite of this is the guy who insists on telling you he's from \"Europe\" and makes this big performance of sidestepping your question when you ask where exactly because you've probably never heard of it. Then they finally give in and it's some vanilla medium-sized country like Slovakia.",
            "score": 1,
            "author": "suedehelpme"
        },
        {
            "level": 0,
            "comment": "Belgians also know it lol",
            "score": 1,
            "author": "iamdanni3"
        },
        {
            "level": 0,
            "comment": "Not anyone’s fault you live in a country that isn’t really cared for. Especially the fact that it’s in Europe and many countries in Europe are much more popular",
            "score": 1,
            "author": "avationlover69"
        },
        {
            "level": 0,
            "comment": "I consider myself good at geography and if someone told me they were from Luxembourg I would still assume they were rich lmao",
            "score": 1,
            "author": "Arietem_Taurum"
        },
        {
            "level": 0,
            "comment": "Idk maybe be from a real country next time instead of way to avoid taxes.\n\nEdit: Sarcasm\n\n-Here i was being sarcastic in referring to Luxembourg as not a \"real country\" and using the stereotype of Luxembourg as a tax haven. This is in the context of the original post where the OP, or original poster, was joking about what they normally hear when they say they're from Luxembourg. They were joking about how most people, due to Luxembourg relatively small size and lack of global inpact, generally dont know where where Luxembourg is or what Language they speak. Generally getting mistaken for a microstate like Monaco. My joke was in the form of advice, how if they didn't want to be unknown they should instead change to be from a \"real country\" instead. This is obviously outlandish advice because obviously Luxembourg is a real country. The outlandish nature of this advice makes it humorous.",
            "score": -4,
            "author": "Kurrurrrins",
            "replies": [
                {
                    "level": 1,
                    "comment": "Define \"real country\".",
                    "score": 1,
                    "author": "Priamosish",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would a real country would be larger than 1000 square miles (2589.99 square kilometers) \n\nwith a population larger than 640,064 (according to 2021 census, and more than I thought it would have... huh) \n\nnot have a latitude of 49.611622\nnot have a longitude of 6.13195\n\nnot be partitioned by Prussia, Belgium, and France.\n\nOh and especially have more than 12 Cantons\n\nAlso God forbide if it is landlocked with an ocean climate. That would just be ridiculous\n\nSomething like that you know\n\nEdit: Sarcasm\n\n-sarcasm refers to the use of words that mean the opposite of what you really want to say. I am doing this for comedic effect. As you can see I am listing criteria I believe would disqualify a country from being a \"real country\". This criteria though are assorted random facts about Luxembourg. From its size to population as well as its climate. The point is for the list to be entirely arbitrary and outlandish.",
                            "score": 1,
                            "author": "Kurrurrrins",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well good news, nobody cares about your arbitrary criteria and we'll still be here when nobody remembers your name anymore...",
                                    "score": 1,
                                    "author": "Priamosish",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My man I'm literally just being sarcastic. Do you want me to include the /s? I mean come on my criteria was literally just attributes of Luxembourg. I get that it is hard to denote sarcasm through text but Jesus man. I did everything to spell it out without literally spelling it out.\n\nThere I spelled it out for you",
                                            "score": 2,
                                            "author": "Kurrurrrins"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lmao, this post is apparently so offensive, everyone in Luxembourg got together to downvote it.",
                    "score": 0,
                    "author": "Vitruviansquid1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How's the country to grow a career? Is it better than US , Australia in terms of it?",
            "score": 0,
            "author": "ProfessionalFine1307"
        },
        {
            "level": 0,
            "comment": "Luxembourg is genuinely really nice, it’s like warm Belgium",
            "score": 0,
            "author": "No-Transition4060"
        },
        {
            "level": 0,
            "comment": "i knew a guy who came as a transfer student from luxembourg and honestly i had no idea what it was before i met him 😭 such a beautiful country im thankful for the knowledge i have now",
            "score": 0,
            "author": "Tall_Peace7365"
        },
        {
            "level": 0,
            "comment": "oh mäi Gott, Ech geduecht ech déi eenzeg Persoun vun do war 🤣",
            "score": 0,
            "author": "icommitedarson69"
        },
        {
            "level": 0,
            "comment": " Brit here I’ve spent the day in Luxembourg! Fascinating little country will definitely have to visits again at some point!",
            "score": 0,
            "author": "rstar345"
        },
        {
            "level": 0,
            "comment": "u/repostsleuthbot",
            "score": 0,
            "author": "Cantuccini",
            "replies": [
                {
                    "level": 1,
                    "comment": "I didn't find any posts that meet the matching requirements for r/starterpacks.\n\nIt might be OC, it might not. Things such as JPEG artifacts and cropping may impact the results.\n\n*I'm not perfect, but you can help. Report [ [False Negative](https://www.reddit.com/message/compose/?to=RepostSleuthBot&amp;subject=False%20Negative&amp;message={\"post_id\": \"13upurh\", \"meme_template\": 294702}) ]*\n\n[View Search On repostsleuth.com](https://www.repostsleuth.com/search?postId=13upurh&amp;sameSub=false&amp;filterOnlyOlder=true&amp;memeFilter=true&amp;filterDeadMatches=false&amp;targetImageMatch=100&amp;targetImageMemeMatch=96)\n\n---\n\n**Scope:** Reddit | **Meme Filter:** True | **Target:** 96% | **Check Title:** False | **Max Age:** Unlimited | **Searched Images:** 313,141,742 | **Search Time:** 0.6884s",
                    "score": 1,
                    "author": "RepostSleuthBot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve never met someone from Luxembourg but it’s a very nice country",
            "score": 0,
            "author": "SapphireLungfish"
        }
    ]
}