{
    "id": "13uxsqe",
    "score": 202,
    "title": "The 'you need to be more stylish' starterpack",
    "author": "No-Access606",
    "date": 1685373643.0,
    "url": "https://www.reddit.com/r/starterpacks/comments/13uxsqe",
    "media_urls": [
        "https://i.redd.it/ghjauv8kfs2b1.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Hey /u/No-Access606, thank you for submitting to /r/starterpacks! \n\nThis is just a reminder not to violate any rules, located [here](https://reddit.com/r/starterpacks/about/rules). Rule breakers can face a ban based on the severity of their rule violation.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/starterpacks) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Um ackshyually this isn’t accurate at all, I’m exactly like this and I’ve been dating my discord egirl kitten for 3 weeks. Idk why she only talks to me when her nitros about to expire\n\nAnyways I’m downdooting your meme OP, this isn’t very Keanu Reeves big chungus wholesome 100",
            "score": 46,
            "author": "justaMikeAftonfan"
        },
        {
            "level": 0,
            "comment": "middle schooler starter pack",
            "score": 11,
            "author": "go_morb_urself"
        },
        {
            "level": 0,
            "comment": "He paused his game to be here. And you're laughing?",
            "score": 12,
            "author": "Gestice"
        },
        {
            "level": 0,
            "comment": "I'm not gonna cry, I'm not gonna be upset, I'm perfectly calm",
            "score": 13,
            "author": "RiskhMkVII",
            "replies": [
                {
                    "level": 1,
                    "comment": "When I was making this I realised that I just did a starterpack of me",
                    "score": 12,
                    "author": "No-Access606"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Seriously describes 5th/6th grade me",
            "score": 3,
            "author": "EyeComplete9192"
        },
        {
            "level": 0,
            "comment": "I was wearing similar clothes when I graduated school. Had to play drums for the school band and the people who designed the theater apparently did not think of air conditioning in summer. Errybody else was sweating in a smoking.",
            "score": 2,
            "author": "EchelonNinja"
        },
        {
            "level": 0,
            "comment": "Oh look it's my friend Douglas. If you add in anime/VGM then it's literally my friend Douglas.\nI often wonder if that guy has any life plans other than hanging around in his parents' house getting free games and free microtransactions, and genuinely asking why our other friend won't hand over their money to Sony so they can play games online on their PS4 with us.\n\nIt's a lack of self-awareness, and of the world around him that simply astounds me. But hey at least he's not a bigot.",
            "score": 2,
            "author": "Wario-Man"
        },
        {
            "level": 0,
            "comment": "i wanna bully one of them right now",
            "score": 3,
            "author": "Bustinforahit"
        },
        {
            "level": 0,
            "comment": "eh, jsut make a few changes, expand your horizons, have social skills\n\nWomen make up half the population guys",
            "score": 2,
            "author": "Aardvark515"
        },
        {
            "level": 0,
            "comment": "oh, my boyfriend is exactly like this.",
            "score": 1,
            "author": "SELF-iSH_"
        },
        {
            "level": 0,
            "comment": "OP, please stop making starterpack memes about me.",
            "score": 1,
            "author": "Fairytaleautumnfox",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dark souls 2 fan activities",
                    "score": 1,
                    "author": "bigturtlegg"
                }
            ]
        }
    ]
}