{
    "id": "13x68k8",
    "score": 593,
    "title": "Having a day off from work starter pack",
    "author": "kanaajrally",
    "date": 1685587860.0,
    "url": "https://www.reddit.com/r/starterpacks/comments/13x68k8",
    "media_urls": [
        "https://i.redd.it/389rums3mb3b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Hey /u/kanaajrally, thank you for submitting to /r/starterpacks! \n\nThis is just a reminder not to violate any rules, located [here](https://reddit.com/r/starterpacks/about/rules). Rule breakers can face a ban based on the severity of their rule violation.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/starterpacks) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Your upstairs neighbors dog whines and whimpers because their owner is gone",
            "score": 43,
            "author": "SolarSailorFlynn",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s sad",
                    "score": 9,
                    "author": "Wise_Control",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It happens even when I'm home. Seems like there's no recurring time period for it, just any time of day. Makes me wonder why they have a pet if they aren't around for it.",
                            "score": 9,
                            "author": "SolarSailorFlynn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s just abuse. People shouldn’t own pets if they don’t have time for them",
                                    "score": 6,
                                    "author": "Wise_Control",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I agree.",
                                            "score": 2,
                                            "author": "SolarSailorFlynn"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "people have work, dude. If \"not having time\" means being at work, nobody would have pets",
                                            "score": -2,
                                            "author": "HotBear39"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "oh yeah been there. had the upstairs whimpering dog, and downstairs, a fucking kickboxing gym.\n\nthe gym moved in half way through my lease and ruined my life. 6am, 12pm, 3pm, and 6pm classes. the sand bags were basically bolted to my floor.",
                    "score": 3,
                    "author": "donniedenier",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yikes lol. I'd go insane if I was a homebody.",
                            "score": 3,
                            "author": "SolarSailorFlynn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "those were pre-covid times. i was still an extrovert with an office job and it still drove me absolutely insane. i get woken up at 6am in the worst way, and as soon as i get home and kick off my shoes, it’s time for round two.\n\ni’m not aggressive or violent in any way. always been chill as a cucumber; but i had so many violent thoughts on how to make it go away.",
                                    "score": 1,
                                    "author": "donniedenier"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly this is one of my pet peeves during summer. There is never silence, the entire day is just filled with the sounds of machines. Cars, jackhammers, drills, hammers, saws, mowers. Just an endless WHHHRRRRRR BUM BUM BUM BUM DDDDDDDDDDD KTKTKTKT until sunset",
            "score": 37,
            "author": "Denpants",
            "replies": [
                {
                    "level": 1,
                    "comment": "Don’t forget the impromptu lawn party right next door that has students in their 20’s competing to be as loud and obnoxious as possible, shitty DJ music, and keeping it going until 2 AM because fuck you on exactly your day off.",
                    "score": 5,
                    "author": "norwegianboyEE"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Missing bad weather that wasn't forecast, having to do shopping, school runs and other stuff you might not usually do because \"you're off work so it's easier for you to do it\" and people from work contacting you anyway.",
            "score": 11,
            "author": "Big_Dave_71"
        },
        {
            "level": 0,
            "comment": "* That's the day the street sweepers come through your neighborhood at 7am\n\n* Neighbors on all sides have their yard guys show up by 8am, including the one that needs a chainsaw \n\n* You get at least 2 calls from work because of course something went down on your day off, or someone had a question but not the patience to wait for you to come back",
            "score": 10,
            "author": "TheBeardedSingleMalt"
        },
        {
            "level": 0,
            "comment": "The leaf blower one is painfully accurate where I live.",
            "score": 9,
            "author": "JustAnotherAviatrix",
            "replies": [
                {
                    "level": 1,
                    "comment": "My neighbor will go for hours with her leaf blower. Her yard is maybe 600 square feet.",
                    "score": 3,
                    "author": "FilteredAccount123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The bottom two happen even at work, man. Just this morning, a group of coworkers started discussing very loudly near my desk, so I put on headphones to drown them out, but then they got even more rowdy than before for some reason. \n\nAt least I got a long smoke break.",
            "score": 6,
            "author": "Mannyqueen"
        },
        {
            "level": 0,
            "comment": "Auditory Processing Disorder starter pack",
            "score": 12,
            "author": "Who_GNU"
        },
        {
            "level": 0,
            "comment": "That one coworker who ignores the reminder that you’re off and instead keeps adding you to emails saying you’ll have X or Y done by end of day.",
            "score": 3,
            "author": "ohlookahipster"
        },
        {
            "level": 0,
            "comment": "Trying to take a nap but it also happens to be the sunniest day of the week.",
            "score": 3,
            "author": "MoneyKilla25"
        },
        {
            "level": 0,
            "comment": "City decides now is the perfect time to dig up the street",
            "score": 3,
            "author": "THATDUDEROBO"
        },
        {
            "level": 0,
            "comment": "Some jackass lights up a bonfire in your neighborhood so you can’t have the windows open when you are home on your day off.",
            "score": 2,
            "author": "Havingfun922"
        },
        {
            "level": 0,
            "comment": "I took today off cause it's my bday and i got woken up at 6:30am by someone leaf blowing. It's fucking JUNE WHAT IS THERE TO LEAF BLOW?!?!",
            "score": 2,
            "author": "WombleFlopper"
        },
        {
            "level": 0,
            "comment": "Isn’t the point of headphones for you to put them on so things get louder?",
            "score": 1,
            "author": "Power_of_Atturdy",
            "replies": [
                {
                    "level": 1,
                    "comment": "I put them on to drown out the noises outside",
                    "score": 2,
                    "author": "kanaajrally"
                },
                {
                    "level": 1,
                    "comment": "No, that's hearing aids haha",
                    "score": 1,
                    "author": "DarkSparkyShark"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Eight hours suddenly feels like two hours, and before you know it...",
            "score": 1,
            "author": "legendarydrew"
        },
        {
            "level": 0,
            "comment": "You guys are getting days off?",
            "score": 1,
            "author": "Yoko_Kittytrain"
        },
        {
            "level": 0,
            "comment": "downstairs neighbor decides to cook a seven course meal with the largest pots and pans known to man at 9 am. Then washes an entire year's worth of dishes afterward.",
            "score": 1,
            "author": "Doublejimjim1"
        },
        {
            "level": 0,
            "comment": "So true, especially the leaf blower. One of mankind's dumbest inventions.",
            "score": 1,
            "author": "ShitVolcano"
        }
    ]
}