{
    "id": "141syfu",
    "score": 390,
    "title": "Cocomelon For Middle Schoolers Starter Pack",
    "author": "WaddlesJP13",
    "date": 1686001464.0,
    "url": "https://www.reddit.com/r/starterpacks/comments/141syfu",
    "media_urls": [
        "https://i.redd.it/47tw8sovr94b1.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Hey /u/WaddlesJP13, thank you for submitting to /r/starterpacks! \n\nThis is just a reminder not to violate any rules, located [here](https://reddit.com/r/starterpacks/about/rules). Rule breakers can face a ban based on the severity of their rule violation.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/starterpacks) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I thought the Cocomelon of the middle schooler set was memes such as \"Bro, come over here, come over here! Check out my new shoes! They're the brand new ONE, TWO BUCKLE MY SHOOOE, THREE, FOUR, BUCKLE SOME MORE! FIVE, SIX, NIKE KICKS! -laughs- That is so fire!\" and Peaches.",
            "score": 66,
            "author": "mimitchi33",
            "replies": [
                {
                    "level": 1,
                    "comment": "Though, I do think the song is catchy. AI DIO cover is now carved in stones of my mind's cave.",
                    "score": 6,
                    "author": "TheOriX-LoL"
                },
                {
                    "level": 1,
                    "comment": "Jesus H. Christ, creativity down the toilet.",
                    "score": 2,
                    "author": "telsm2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "you forgot the worst of all “ohio” most annoying unfunny shit ever.",
            "score": 41,
            "author": "ChampCyndaquil",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;BRO OHIO LOOKIN UNREAL BRO SHEIT MANE I THINK I LOST MAH MUNNEY IN DA SKINWAKKUH CABIN SHEIT MANE\n\nGun, head, please, now.",
                    "score": 7,
                    "author": "telsm2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Bro💀 Only in Ohio 💀 HAHAHA ONLY IN FLORIDA HAHAHA THE ROCK TURN INTO FUNNI ONE TWO BUCKLE MY SHOE, THREE TWO-\n\n*pEAcHeS, PeACHeS, PeachES, PEaches, Peaches-Only in Obamaland 💀💀💀💀*\n\nOnly in sussyville 💀💀\n\n[https://imgflip.com/memetemplate/263909335/Hang-Myself-Harry](https://imgflip.com/memetemplate/263909335/Hang-Myself-Harry)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n*Mind if I join you?*",
                            "score": 2,
                            "author": "Swanx22"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "“Look how cool I am hahaha I like memes!!! I like funny memes! Down in Ohio one two buckle my shoe mr beast!!! Hehehaha”",
            "score": 26,
            "author": "blorbasuar64",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Hahahaha baller, crusher funny!!1 Hahaha soy virgin Ohio vs. GigaChad Patrick Bateman 💀💀 Ohio Obama Peaches, ahahhaha1!! Burger King whopper, whopper, Obama!!1 \\*Raid Siren sound effect\\* \\*Multiple explosion sound effects\\* OH NOES SUSSY BAKA💀💀💀💀😭 Ohio, only in Florida, only in Obama Peaches one, two, buckle my Baller amogus 🤯🤯🤯🤯💀\n\nMr.Breast Ohio only???????????!\"",
                    "score": 2,
                    "author": "Swanx22"
                }
            ]
        },
        {
            "level": 0,
            "comment": "my friend you appear to be missing walter white and the bape kid",
            "score": 12,
            "author": "awsomesause161"
        },
        {
            "level": 0,
            "comment": "I hate content like this. It's extremely annoying and unfunny.",
            "score": 30,
            "author": "halaayman"
        },
        {
            "level": 0,
            "comment": "Holy shit true. Every time i try to find some funny memes on YT i gotta see this shit",
            "score": 6,
            "author": "lllIIIlIIIlI",
            "replies": [
                {
                    "level": 1,
                    "comment": "The sad part is, videos by people who have about 600 or simply a thousand subscribers upload shitposts that get more than 8 thousand views.\n\nMemes were always meant to be silly, but they were different back in the day. And since the evolution of meme culture, from posts you found on the Something Awful forums to homosexual Africans, things can continue to change no matter if the meme is stupid or not.\n\nI dunno, I might be inaccurate in viewing meme culture.",
                    "score": 3,
                    "author": "telsm2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i dont know why but that stupid red arrow with the circle is so fucking unfunny that it loops all the way around and makes me laugh my ass off every time i see it",
            "score": 5,
            "author": "Arietem_Taurum"
        },
        {
            "level": 0,
            "comment": "Imagine what the final boss looks like",
            "score": 5,
            "author": "Low-Routine775"
        },
        {
            "level": 0,
            "comment": "“But it’s funny because it’s supposed to be ironic” I don’t care",
            "score": 5,
            "author": "Epic-Toaster-Man"
        },
        {
            "level": 0,
            "comment": "Oh noooo i remember when i used to watch these all the time",
            "score": 3,
            "author": "creative_name-_-"
        },
        {
            "level": 0,
            "comment": "disappointed to say this was my entire sense of humor a few years ago",
            "score": 3,
            "author": "redhawk2006"
        },
        {
            "level": 0,
            "comment": "You forgot the idolization of Patrick Bateman and the obsession for Breaking Bad despite never touching the series.",
            "score": 1,
            "author": "Swanx22"
        }
    ]
}