{
    "id": "144q4im",
    "score": 107,
    "title": "Random Person who pops-up out of nowhere on facebook to argue starterpack",
    "author": "chrissypharaoh",
    "date": 1686270418.0,
    "url": "https://www.reddit.com/r/starterpacks/comments/144q4im",
    "media_urls": [
        "https://i.redd.it/v8p2b9lpzv4b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Hey /u/chrissypharaoh, thank you for submitting to /r/starterpacks! \n\nThis is just a reminder not to violate any rules, located [here](https://reddit.com/r/starterpacks/about/rules). Rule breakers can face a ban based on the severity of their rule violation.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/starterpacks) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "The fucking super filtered blonde chick with glasses hahaha. She's always either also anti vax or really into an MLM.",
            "score": 13,
            "author": "NotExactlyNapalm",
            "replies": [
                {
                    "level": 1,
                    "comment": "Home schooled kids",
                    "score": 3,
                    "author": "KAG25"
                },
                {
                    "level": 1,
                    "comment": "Yep. This exact girl proceeded to berate and insult me in the comment section for being married \"too young\" (I'm 25) and how I am \"problematic\" because of it. Sounds like she was jealous tbh.",
                    "score": 2,
                    "author": "Defiant_Raven"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Even Worst, just comes into a discussion to correct people's spelling",
            "score": 3,
            "author": "KAG25"
        },
        {
            "level": 0,
            "comment": "I made one comment on a FB post about how I don't PERSONALLY agree with kids under 10 getting facial piercings (I even made sure to add a 'to each their own' at the end to show I respect other parents choices), only for this psycho bitch to stalk my entire profile and berate me in the comment for being married at \"too young\" of an age and how \"problematic\" I am for it (I'm 25 btw...). I blocked her stupid ass immediately. Honestly, if people feel the need to stalk your profile to come up with an insult, they already fucking lost the argument. Also why do they always seem to be blondes???? They all look almost exactly like one of the example pictures shown of the blonde chick... Just an observation... \n\n\n\nEdit: spelling",
            "score": 3,
            "author": "Defiant_Raven",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also, who the fuck thinks 25 is too young to be married? \n\nHonestly though, if I see someone say \"problematic\" on Facebook I just block them. Like, sure, stuff absolutely can be problematic sometimes, but facebook people aren't using it to call out racism, they are using to to say that using soap will kill your kids. (This is a real fight I had recently with a girl like that)",
                    "score": 2,
                    "author": "NotExactlyNapalm",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know right??? I get like under 21 being young, but 25??? The fuck. \n\n\n\nAnd wait what?? Someone actually thinks that using soap will kill kids? She probably thinks vaccines cause autism too.",
                            "score": 2,
                            "author": "Defiant_Raven"
                        }
                    ]
                }
            ]
        }
    ]
}