{
    "id": "100dmv5",
    "score": 4,
    "title": "CISA admission difficulty",
    "author": "wilbur9991",
    "date": 1672554617.0,
    "url": "https://www.reddit.com/r/BCIT/comments/100dmv5",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am looking for get into bcit cisa, it seems the admission is not as hard as cst, my high school math score is 76, ielts is 6.5\n\nIs my chance high to get in to cisa?",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I got it, thanks! Btw, Ismaili Canuk are you in CISA, could we add for like discord or anything else for further question of CISA?",
                    "score": 1,
                    "author": "wilbur9991",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I see, thx again!",
                                    "score": 2,
                                    "author": "wilbur9991"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am in the second term of CISA and have just completed term 1. Admission was pretty easy and some of my mates didn't apply till 4 months prior to the start of the course in September. So it doesn't really matter but I would prefer applying sooner than later to get into a good set of class.",
            "score": 3,
            "author": "Own-Calligrapher-794",
            "replies": [
                {
                    "level": 1,
                    "comment": "I got it, thx a lot! Btw, does cisa has co-ops?",
                    "score": 2,
                    "author": "wilbur9991"
                }
            ]
        },
        {
            "level": 0,
            "comment": "At orientation, we were told that there will be quite some opportunities for a good job with good starting pay. The projects are there to test ur knowledge and to gain the experience of working with irl situations.",
            "score": 2,
            "author": "Own-Calligrapher-794"
        },
        {
            "level": 0,
            "comment": "The last term does I think. If it doesn't, it still has alot of irl situation labs and projects in term 2 and term 4 which are pretty good",
            "score": 1,
            "author": "Own-Calligrapher-794",
            "replies": [
                {
                    "level": 1,
                    "comment": "are irl situation helpful for getting job after graduation?. BTW, is getting job easy after graduation? Like if in cst, it will be really hard to get job without co-ops for foreigners",
                    "score": 1,
                    "author": "wilbur9991",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "CISA, unfortunately does not offer co-op, it's the only program that does not offer it. Why? I don't know. Usually after CISA, there are a few Cert's you can study for. CCNA, CompTIA+ etc, to boost your experience and qualification. Without cert's you'd probably land a helpdesk that's paying mid 40k yearly, whereas with certs you can land a good admin job, 80K+",
                            "score": 1,
                            "author": "Character_Art9724"
                        }
                    ]
                }
            ]
        }
    ]
}