{
    "id": "104kxzz",
    "score": 25,
    "title": "Support Education over Parking Fee Inflation!",
    "author": "Melopeeps",
    "date": 1672980106.0,
    "url": "https://www.reddit.com/r/BCIT/comments/104kxzz",
    "media_urls": [
        "https://www.burnabynow.com/local-news/petition-launched-over-planned-bcit-parking-rate-increases-6334479"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "https://chng.it/5dzMjH9PVJ",
            "score": 9,
            "author": "Melopeeps"
        },
        {
            "level": 0,
            "comment": "I find the fact that it's one price from whenever you pay till 6 am the next day the worst. It used to be a 24 hour period which I could time to cover the afternoon classes one day and morning the next. Even worse for part time students who come from 6-9pm and pay the same rate as students parking all day.",
            "score": 6,
            "author": "MennoMateo"
        },
        {
            "level": 0,
            "comment": "Lame response from BCIT. The worst part is the management is probably laughing and scoffing with their $100k + salaries with no empathy for students. Probably hoping for this to blow over so the changes can kick in.\n\nI understand a 5% increase but not 68%.",
            "score": 7,
            "author": "DomGT"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's BCIT most people have to. most of us had a job while in school and public transit makes it impossible to do both.",
                    "score": 3,
                    "author": "_PeanuT_MonkeY_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You also don't have to pay a ticket given by impark. They apparently tow around ~4 tickets, but you can get a new license plate for 21 dollars.",
            "score": 2,
            "author": "Thick_Sheepherder_39",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m up to 13 now and I haven’t paid a single one haha. They’ll eventually start sending letters and calling from “city collection company” (which is actually owned by impark) to try and spook you into paying them. I called their bluff and sent them a letter urging them to take the matter to court if they believe a legally valid debt exists and to stop contacting me otherwise. Never heard anything from them after that lol",
                    "score": 1,
                    "author": "MindYourOpSec",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know this comment is late but you were up to 13 tickets under 1 license plate and never got towed? Don't they tow you around 3 tickets?",
                            "score": 1,
                            "author": "Affectionate_Cost759"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is literally so stupid",
            "score": 1,
            "author": "tyvmpicks"
        }
    ]
}