{
    "id": "11dlj94",
    "score": 1,
    "title": "Employment in Vancouver for Ame?",
    "author": "Kelmeme24",
    "date": 1677528769.0,
    "url": "https://www.reddit.com/r/BCIT/comments/11dlj94",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello people, \n\nI'm planning to do Ame category M but I have been hearing people graduating and moving away from Vancouver to find work with the diploma. I live in Burnaby and I'm a bit worried if the airport here is  employing any AME graduates at all or  will I have to move later to find work?\n\nThanks.",
    "comments": [
        {
            "level": 0,
            "comment": "I know somebody working at MTU doing turbines. I believe Kelowna Flightcraft has a presence here. There have to be other providers at the airport for things like US airlines but I don't know who they are anymore.\n\nBetter resource: http://avcanada.ca/forums2/viewforum.php?f=27&amp;sid=fa81e547fffbd325e5a2c926d23743b0",
            "score": 1,
            "author": "lubeskystalker"
        },
        {
            "level": 0,
            "comment": "It can be hit or miss with finding work at YVR. Right now you’ll have a okay chance at finding work as an apprentice but be ready to be a ramp agent or working in stores for a year.",
            "score": 1,
            "author": "ShadeLurk"
        },
        {
            "level": 0,
            "comment": "Just don’t. I graduated and it is quite difficult to find a job in Vancouver area. You probably have to move around or out of BC. Well, at least during Covid was my time. The market also pay low for apprenticeship. About $18 to $25 max after a few years.\n\n\nGood things about the AME Diploma is that you basically have a pass to any interview that related to turn wrench. I got in apprenticeship job at a marine dealership and currently in a maintenance team for city buses. Really better pay/pension and easier on the body.",
            "score": 1,
            "author": "Glittering-Aspect741"
        }
    ]
}