{
    "id": "11dx5tt",
    "score": 2,
    "title": "Need advice. Should I give up my plans on an aviation career and join the computer information technology program?",
    "author": "Thoughtlessmonkey95",
    "date": 1677559635.0,
    "url": "https://www.reddit.com/r/BCIT/comments/11dx5tt",
    "media_urls": [],
    "other_urls": [],
    "postText": "So my goal is to go to school for aviation. I understand the job market and everything.\n\nBCIT has a an aviation program that’s bridged with a flight academy however it cost over $80,000 and I really can’t afford that as much as I want to.\n\nI also don’t want to put myself 80k in debt with loans. I know there’s subsidized schools, but need to stay in BC.\n\nAnother program that caught my eye is CIS. Honestly I’m just interested in it as I heard it has great pay, it’s not something I have a passion for like aviation.\n\nAny advice?",
    "comments": [
        {
            "level": 0,
            "comment": "Where do you wanna see yourself in 10 years? As a Pilot or IT guy? Answer this question then you’d know what do you actually want.",
            "score": 3,
            "author": "Same_Championship253"
        },
        {
            "level": 0,
            "comment": "If you don’t have passion for IT then programming will make your life hell. On the other hand you will be under debt, if you pursue aviation but you will enjoy each and every moment of all the hard work you will be putting in. Your choice!",
            "score": 3,
            "author": "PHD_CommonSense"
        },
        {
            "level": 0,
            "comment": "I dropped out of commercial pilot training to do Comp Sci. My rationale:\n\n* Didn't like the future of the industry (Automation / cheapening / cross-country commuting).\n* Wasn't interested in moving to the Tundra to work at Joeassic Park to try to accumulate hours.\n* Overall didn't want to make fun into work. \n\nI'm now paid more than I otherwise would be in my pilot journey, and I'm fulfilling my aviation bug by paragliding. When I'm a little bit more financially stable I'll try to get access to something powered and on floats for weekend fun.\n\nHaving said all that, it's not necessary to spend $80k at BCIT for a career in aviation. I know more than one person who went CPL -&gt; Instructing -&gt; Regionals -&gt; Mainline without ever going after a degree. Even if you want both, you can do a CPL now for probably half that number, and a PTS bachelors degree later.\n\nDo what will make you happy, if you're happy and motivated you will find a way to pay for it.",
            "score": 2,
            "author": "lubeskystalker"
        },
        {
            "level": 0,
            "comment": "Whatever your heart tells you",
            "score": 1,
            "author": "jin_kxm"
        },
        {
            "level": 0,
            "comment": "Honestly it's going to come down to you and no one can make your choices for you, but if it helps I was in the same position and I decided not to take the BCIT program for flight and do Comp Sci instead.\n\nSome notes and options to think about:\n\n* As someone mentioned below, you could go to PFC directly and not worry  about the degree from BCIT. Still expensive obviously.\n* I dropped out of BCIT's CIT/CST program because I hated coding. I went on to have a very successful career in IT Ops. There are many flavors of IT and CS and if you have an aptitude or desire for a specific area then maybe pursue certifications.\n* Above all, it might cost money or time to try it out. It might not be for you, you might hate it, time finding that out is not time wasted. \n\nAnyway, I'm of the mind that it is better to be disciplined and work hard at something you only kind of like in order to support the lifestyle you want. I have heard many things that doing passion for your job ruins the passion, but I wouldn't know anything about that first hand.",
            "score": 1,
            "author": "scubapilot89",
            "replies": [
                {
                    "level": 1,
                    "comment": "What program did you do?",
                    "score": 1,
                    "author": "Repulsive-Theme5363"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Both seem like choices without much future.\n\nCanada is pushing against commercial air travel, so your best bet as a pilot could be working for very niche government occupations like fire and rescue.\n\nSoftware jobs are pretty much gone in the last few months, and if the economy recovers, the competition will be insane. Higher interest rates mean much less startups meaning much less need for software engineers. Even less need if you consider that ten junior developers can be replaced by five junior developers assisted by AI.",
            "score": 1,
            "author": "NotNow_NotEver_",
            "replies": [
                {
                    "level": 1,
                    "comment": "What program do you see a future with?",
                    "score": 1,
                    "author": "Thoughtlessmonkey95",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Anything with government subsidies. Education, medicine, green tech.",
                            "score": 1,
                            "author": "NotNow_NotEver_"
                        },
                        {
                            "level": 2,
                            "comment": "General labour, government sector, hospitals, daycare are all very demanding right now.\n\nTech is in a wonky stage right now.",
                            "score": 1,
                            "author": "YUNO_TALK_TO_ME"
                        }
                    ]
                }
            ]
        }
    ]
}