{
    "id": "11ehyv8",
    "score": 3,
    "title": "Architecture Building Technology",
    "author": "pastaidente",
    "date": 1677613736.0,
    "url": "https://www.reddit.com/r/BCIT/comments/11ehyv8",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi im a grade 12 student that got into the Architecture and Building Technology full time program and was just had some few questions:\n\n1. How hard is the course-load and how hard are the courses?\n2. will I be able to balance a social life and school life?\n3. Is there any opportunities for a social life?\n4. are the 10 classes a semester extremely difficult?\n5. are there anything speciality offered for first years/freshman?\n\nThank you",
    "comments": [
        {
            "level": 0,
            "comment": "Don't expect to have much of a social life if you want to do well. It's tough, but manageable.\n\nNot sure what you mean with #5 ?",
            "score": 5,
            "author": "neko_cat08"
        },
        {
            "level": 0,
            "comment": "Course load is a lot but more manageable than I expected. It’s 8 courses for the first 2 semesters but I personally found a good chunk of time for social life outside of school while maintaining a decent gpa. Although when comparing my free time to my friends at like sfu and ufv it’s definitely a lot less. Overall I don’t think the classes are difficult but I’ve heard differing opinions from others. Mainly 2-3 “hard” classes in each semester",
            "score": 3,
            "author": "Local_Refrigerator48"
        },
        {
            "level": 0,
            "comment": "There’s already a couple really good posts about the ABT program in the bcit subreddit one from a first year rn, just look it up. But it can be really challenging, you will make new friends or at least be forced to in order to succeed. The courses I would say are more frustrating and exhausting than difficult, frustrating due to questionable teachers (ken) and assignments (manual graphing (getting phased out finally)) or irrelevant topics (ie most of structures you will never EVER do unless you become a structural engineer). Time management is pretty important but regardless your gonna have some late nights. Free time is pretty limited especially compared to other universities but it also depends where you live and if you spend most of ur time commuting. And what do you mean anything specialty for first years ? I’m currently a 2nd year so if you have any questions ask away.",
            "score": 2,
            "author": "Allen-snackbar"
        },
        {
            "level": 0,
            "comment": "Apart from your classmates, don't expect too much social time during each semester.",
            "score": 1,
            "author": "mapleleafr67"
        }
    ]
}