{
    "id": "12eq4j2",
    "score": 5,
    "title": "GIS BTech Experiences",
    "author": "excitedcantaloupes",
    "date": 1680883575.0,
    "url": "https://www.reddit.com/r/BCIT/comments/12eq4j2",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm thinking about applying for the GIS BTech 2 year program, to transition out of utility field tech work.  Looking for some experiences or insights to how the program is in terms of quality, workload and post grad job prospects.\nCheers!",
    "comments": [
        {
            "level": 0,
            "comment": "I'm most of the way through the ADP, which is the same first year of the BTech program. It's essentially the same but minus the work experience component of the BTech and is good enough if you don't already have a degree.\n\nThe program is well taught with instructors who care about what they're doing.\n\nWorkload: A lot to say on this.\n\nFall term you take 9 courses at once, but you technically do 10 in total. Two of the courses are 5 weeks long and you take them back to back (ArcGIS 1 and ArcGIS 2). One of the courses is project planning which has no exams.  A good idea, which I wish I did, would be to take one or two courses in part time studies beforehand. However, I personally found that the course load was manageable. It's a matter of working on assignments as soon as you get them in lab. The difficulty of the first semester is really the workload itself, but of course some classes will be harder or easier depending on your background. Past fall term the course workload is much more manageable\n\nThe main takeaway for workload is that if you can make it through the fall term, you're good to go. Also, the few folks who did not make it through or past the fall were people who decided GIS was not for them and dropped out. Basically, nobody failed out of it. Show up to your labs and make the most of the time you get and ask for help from your set if you get stuck on something.\n\nThe other big component of the program is that there is an industry sponsored project/practicum. Keep in mind that if you do BTech, you have to do the project.\n\nProject: You work on your own, with some help from an industry sponsor you are doing the project for. Relation to your sponsor is like being a consultant for them basically.\n\nPracticum: You work within the sponsor company. More of a being like their employee.\n\nThe project/practicum component is the part that makes the post grad job prospects pretty high. It's a chance to get hands-on industry experience as part of the program.",
            "score": 3,
            "author": "heroofwinds9",
            "replies": [
                {
                    "level": 1,
                    "comment": "Another question: What are the laptop requirements for the program, or what laptop capabilities would you recommend?",
                    "score": 1,
                    "author": "excitedcantaloupes"
                }
            ]
        }
    ]
}