{
    "id": "12saioj",
    "score": 2,
    "title": "How competitive is the Business Management diploma?",
    "author": "seymourbutts____",
    "date": 1681939100.0,
    "url": "https://www.reddit.com/r/BCIT/comments/12saioj",
    "media_urls": [],
    "other_urls": [],
    "postText": "My goal right now is to do two/three semesters part time, and apply for the 3rd level of the full time diploma (to eventually go into the BBA program). I didn’t get good grades in high school besides an 85 in English 12, but I am doing OPMT 0199 to upgrade my Math 11. How competitive are the full time diploma admissions? What should I be prepared for?",
    "comments": [
        {
            "level": 0,
            "comment": "Business management allows you to join second year or you have enough experience or the required credits.",
            "score": 2,
            "author": "ItchyCryptographer89"
        },
        {
            "level": 0,
            "comment": "Have you already inquired regarding your plan?\n\nBetter ask BCIT regarding your plan in general. Also you need to do good in your part-time courses.\n\nIt is doable but with the advise of the program department.",
            "score": 1,
            "author": "Hellsgate_chan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes I figured maintaining good grades and a good GPA is key",
                    "score": 1,
                    "author": "seymourbutts____"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some programs don't allow you to apply part way through a FT program so like the other person said double check with the department.",
            "score": 1,
            "author": "Ok_General_6940",
            "replies": [
                {
                    "level": 1,
                    "comment": "Business Management does allow you to come in part way in second or third tier!",
                    "score": 1,
                    "author": "seymourbutts____"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s not really that competitive, with a huge dropout rate.",
            "score": 1,
            "author": "tyvmpicks",
            "replies": [
                {
                    "level": 1,
                    "comment": "Shit lol, why the huge dropout rate, if you know?",
                    "score": 1,
                    "author": "seymourbutts____",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A lot of people from high school apply for the program thinking it’s easy and just simply can’t catch up. Most of the mature students make it through.",
                            "score": 1,
                            "author": "tyvmpicks",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fair enough. I’m technically a mature student and do run a small business already so I think I should be okay. Thanks for the insight",
                                    "score": 1,
                                    "author": "seymourbutts____"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not competitive at all. I suggest you apply right away. 1 level not competitive, I am 100% sure you will get accepted! Advanced placement is competitive, because they only accept # of student who dropped off, and there are so many part-time students want to get into the fulltime. Fulltime, $3000 tuition a term. Part-time, $750 a course. Do the math.",
            "score": 1,
            "author": "Jiji0206"
        }
    ]
}