{
    "id": "13qbhqs",
    "score": 2,
    "title": "Question: Advising on Marketing and Business Management Full time at BCIT and UBC Marketing &amp; Masters",
    "author": "BirthdayMurky5949",
    "date": 1684903909.0,
    "url": "https://www.reddit.com/r/BCIT/comments/13qbhqs",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am looking into going into the Marketing Management full time diploma then BBA at BCIT. Which option would be better opportunity wise and salary wise? Or would it be better to just do the full time Business Management diploma and specialize in Marketing in my BBA year. I am worried for low paying positions and lack of decent job opportunities. I want to be able to work at big marketing companies, work my way up, etc. Would the Mark Management Entrepreneurship option be better? Or the Digital Marketing &amp; Brand Strategy option. Also would you recommend UBC Marketing, or is BCIT just as good. I am worried that UBC will have opportunities for internships and co-ops at big companies, but BCIT will not. It is a good, locally known business school but what about internationally? Or in Toronto? I am conflicted, although the UBC marketing could take me up to 2-3 years more than the BCIT BBA in Marketing, so would it be better I just go to BCIT for the BBA, then try to get into UBC of UofT, or a top school for a masters in marketing to advance my career and work in a big company?",
    "comments": [
        {
            "level": 0,
            "comment": "Whatever school you choose won't matter if you don't know how to create your network.\n\nYes schools have connections also and the prestige carries over to some degree INITIALLY.  But a lot fails to realize that creating your network is something you need to establish.\n\nChoose the school that will give you the best fundamentals. Depends on whether you prefer practical application or more on theory. But you need to do your part to expand your network.\n\nI am friends with those who study in different school and I can tell you straight that the opportunity is not to far off whichever school you choose.\n\nStudy and build your network while showing your capabilities. That's how you should ride for success.",
            "score": 2,
            "author": "Hellsgate_chan",
            "replies": [
                {
                    "level": 1,
                    "comment": "That gives me relief, I appreciate it thank you. The thing is with BCIT I can graduate with my BBA by 23, and with UBC I would graduate at 24-25 if things go well with transfer. It would also be an additional calculus, econ, and stats, that I would have to take and do well in B+ at least in all. That's why I am thinking maybe it would be smarter to go to Mark Manag. in BCIT finish BCIT at 23, do masters at UBC or UofT or UCLA for the connections with big companies and finish that by 25. And then start my internship in the states at a big company, work my way up and increase my salary and network through those connections. I understand what your saying, I am worried that even if I carry over the UBC transfer route it would be unstable in terms of transferring, and I could go AP at BCIT and finish early. Go take a masters for the connections, I'm not sure. Been so conflicted and I have to make a decision soon. \n\nThe same age. Only thing would be I've heard that MBA programs are useless, and this would be for marketing /digital marketing I guess. Any thoughts on this? I'm also wondering your opinion on whether Entrepreneurship or Digital Marketing&amp;Brand Strategy would be a smarter option for Marketing Management at BCIT in terms of future opportunities. Thanks for your advice",
                    "score": 1,
                    "author": "BirthdayMurky5949",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well this is just based on the companies I work with.\n\nDigital Marketing is something I would consider. A lot a looking for good digital marketing person.  Entrepreneurship is not bad tbh but from my knowledge it focuses more in running business which I think you can grasp when you are working than just learning. \n\nAlso, Marketing in general for me is the key for a successful business. There are shitty companies out there but do well because of good marketing. \n\nI don't know why they keep on saying MBA is useless, but in my opinion everything is useless if you don't know how to utilize it. Though in general, Master's are for those who also plans to go to academe or want to expand their knowledge/specialization.\n\nRegarding network, you should start as early as you can. Go to meet-ups and company tours, join gatherings and events, be active in the community. There are plenty out there. If you are an introvert, then you should learn how to connect. You can still be an introvert and be able to connect to a lot. If you are an extrovert, it is easy to approach people but you can still be bad at making network. All I am saying is just go out there and create your network.\n\nAs we speak, you making some network with me because you respond to my comment.   \n\n\nLast thing I want to tell you is that, listen to other's opinion and make a rational decision that will suit your needs. Remember, we all have different situation and needs.",
                            "score": 1,
                            "author": "Hellsgate_chan"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "UBC will take you further. They have the connections and prestige known worldwide. Also their courses are transferable to any uni in Canada and perhaps internationally. \n\nBcit is a good school. They will teach you practical and will get you ready for the field. I’ve had tons of friends finish marketing and they never had an issue finding work. \n\nWith my network finishing marketing from both schools. I’d say UBC will meet what you are looking for better than BcIt.",
            "score": 1,
            "author": "CdnCharKueyTeow"
        },
        {
            "level": 0,
            "comment": "BCIT only has connections with small, local companies. UBC has connections with big companies all over the world. If you want to work in Toronto or the States, go to UBC. \n\nIf you want to stay in Vancouver and don't mind working for smaller, lesser known companies, BCIT is good enough.",
            "score": 1,
            "author": "Striking-Ad-3270",
            "replies": [
                {
                    "level": 1,
                    "comment": "While local companies are primarily where some marketing management students end up, I will say that about 20 of the grads from my class are working at international agencies - in Toronto, NYC, etc. \n\nThey started their internships there. OP, I'd say it depends on what matters most to you. \n\nI'm biased obviously because I did the program, but I did it at 27 instead of a master's, got into the career I wanted and now make close to 200k a year 8 years after graduating\n\nEdit: the BCIT program in comm has a lot of good internship placements the top students usually get, at agencies that have offices in Toronto, NY etc.",
                    "score": 3,
                    "author": "Ok_General_6940",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That helps a lot thank you! Did you do the Mark Management program/diploma at BCIT?  Also, you said the top students in BCIT comm get good internship placements at large offices, do you know if that includes marketing? So your saying BCIT does have those connections but fewer spots-for top students only. Which is fine, I'm willing to put in the work, although at the same time I feel that all the clubs in UBC are good for experience and BCIT doesn't have that, if I'm assuming. Although if your making a decent salary from the BCIT program that shouldn't matter. Can I ask if your position is in marketing? My goal is to move to the states. The thing is with BCIT I can graduate with my BBA by 23, and with UBC I would graduate at 24-25 if things go well. It would also be an additional calculus, econ, and stats, that I would have to take and do well in for UBC. That's why I am thinking maybe finish BCIT at 23 with my BBA and some internships from BCIT, do masters at UBC or UofT or UCLA for the connections with big companies and finish that by 25 to land a starting role/internship at a big company where I can work my way up. The same age I would be if I graduated from UBC with an undergrad. Only thing would be I've heard that MBA programs are useless, and this would be for marketing /digital marketing I guess. Any thoughts?",
                            "score": 2,
                            "author": "BirthdayMurky5949",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey! I did graduate from the program. \n\nMarketing management has five branches, one of which was comm (I think they renamed it digital). That branch has an entire networking event for people who want to get an internship, and some of those are the high level internships you're looking for.\n\nComm is marketing (just a way of saying one of the 5 branches of the program, sorry it was confusing). \n\nI am a Director of Marketing at a US agency. You do have to do math and econ in first year at BCIT but it's worth it. \n\nThere are also clubs at BCIT - here's how the MA did in the US competitions this year - https://www.burnabynow.com/local-news/bcit-students-shine-at-international-marketing-meet-6880324",
                                    "score": 2,
                                    "author": "Ok_General_6940",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If it was me, I'd do BCIT. But like I said, I'm biased",
                                            "score": 1,
                                            "author": "Ok_General_6940"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You want to move to the States? Then UBC. UBC has connections with companies based in Toronto and the States and companies based in those two places tend to be more famous and prestigious than Vancouver ones.",
                                    "score": 2,
                                    "author": "Striking-Ad-3270",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What about after a few years experience, and potentially a masters from ubc or uofT 5-6 years down the line. I’d still be saving 2 years for my undergrad, and I’m thinking the masters programs should provide the same connections? But I’m not sure . Thoughts?",
                                            "score": 1,
                                            "author": "BirthdayMurky5949"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you! The thing is with BCIT I can graduate with my BBA by 23, and with UBC I would graduate at 24-25 if things go well. It would also be an additional calculus, econ, and stats, that I would have to take and do well in. That's why I am thinking maybe finish BCIT at 23, do masters at UBC or UofT or UCLA for the connections with big companies and finish that by 25. The same age. Only thing would be I've heard that MBA programs are useless, and this would be for marketing /digital marketing I guess. Any thoughts?",
                    "score": 1,
                    "author": "BirthdayMurky5949"
                }
            ]
        }
    ]
}