{
    "id": "13qwslh",
    "score": 9,
    "title": "Medical Laboratory Science MMI through Zoom? Should I be nervous?",
    "author": "PracticalFarm8592",
    "date": 1684960235.0,
    "url": "https://www.reddit.com/r/BCIT/comments/13qwslh",
    "media_urls": [],
    "other_urls": [],
    "postText": "Just got an email saying saying I’m invited to an MMI but I’m not quite sure how it’s going to go down/the format of it. Is it a simple interview or will we also be quizzed on medical knowledge? \n\nAlso I’ve heard that not a lot of highschool students get in and that they prefer people with post secondary experience, is that true? My highschool graduating ceremony is literally tomorrow lol!",
    "comments": [
        {
            "level": 0,
            "comment": "While they do prefer post secondary applicants, we did have a couple of highschool students in my year.\n\nThe MMI will be a mix of a simple interview and biology knowledge, so make sure you brush up on your biology notes before you go and practice your interviewing skills with someone.",
            "score": 1,
            "author": "Ceary",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks! what kind of bio knowledge? like super hard questions or labelling cells or?",
                    "score": 1,
                    "author": "PracticalFarm8592",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Labelling cells, very basic stuff.  Although it seems that other people have done it online, in which case their experience is probably more accurate.  All in all it shouldn't be too difficult so don't worry too much :)",
                            "score": 2,
                            "author": "Ceary"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congratulation! May I ask which day you have been scheduled for MMI and what is your GPA and Casper?",
            "score": 1,
            "author": "Past-Application-821",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you! my MMI has been scheduled on june 13th, not sure what time and idrk what my GPA is but my average for grade 11 and 12 is ~88% which is pretty low so im surprised they even offered an MMI! As for Casper, I’m not sure… I know my results have been delivered but I can’t see it!",
                    "score": 1,
                    "author": "PracticalFarm8592"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have my interview the same day as you. I'm trying to gather information as well but it's hard because the online interview is a new thing.\n\nSeems like it should not ask science specific questions but if they do it will be simple cell labeling and some chemistry conversions (how to do do a dilution or convert from moles to grams).\n\nFrom what I understand the questions are designed to see your ethics, reasoning, hearing acuity, color/shape identification, and possibly other standard interview type questions (what is your intent?).\n\nLet me know if you find out any details because the practice MMI questions online are geared towards med school students and the questions are beyond the scope of what they should be asking us.\n\nP.S. you should be able to see your Casper result on the website, they report it as a % of the top, for example mine just said you scored in the top 75-100% which is a pretty wide margin.",
            "score": 1,
            "author": "Par31",
            "replies": [
                {
                    "level": 1,
                    "comment": "yeah lol i just finished a few mins ago that was weird haha",
                    "score": 2,
                    "author": "PracticalFarm8592",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yes it was confusing",
                            "score": 1,
                            "author": "MARWAATEF"
                        }
                    ]
                }
            ]
        }
    ]
}