{
    "id": "147veqp",
    "score": 4,
    "title": "Considering Employment, What Are the Best Certificate Courses?",
    "author": "Magical_Astronomy",
    "date": 1686598223.0,
    "url": "https://www.reddit.com/r/BCIT/comments/147veqp",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi guys. I’m a new immigrant, who is looking forward to make some money before pursuing higher education. Generally speaking, what certificate courses would make it easier for me to get a job? I won’t mind if it would be a hard job or require working in remote areas.",
    "comments": [
        {
            "level": 0,
            "comment": "If you are a Canadian citizen or have your PR, you can take the Gas Turbine Technician program for free in less than a year. Not only is tuition covered, but you'll also have a job at MTU waiting for you once you pass and graduate. Here’s the details: https://www.bcit.ca/programs/aircraft-gas-turbine-technician-certificate-full-time-1030certts/",
            "score": 8,
            "author": "bleedinglime",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sorry what do you mean by tuition is covered? I don’t see any info about tuition on this page",
                    "score": 1,
                    "author": "AppleFragrant6876",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There’s a blue box at the top of the page that says: The Aircraft Gas Turbine Technician program is currently being offered tuition free through federal funding for domestic students only. For more details see Funded Gas Turbine Program.",
                            "score": 1,
                            "author": "bleedinglime"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Welding. Any of the trades related to construction. Construction is huge in BC",
            "score": 8,
            "author": "tf_86",
            "replies": [
                {
                    "level": 1,
                    "comment": "I heard that while its hot for journeymen it can be difficult to impossible to get an apprenticeship for a lot of trades. I personally haven't applied for apprenticeships yet so I dont know first hand. Hopefully it's not as hard as people have said.",
                    "score": 1,
                    "author": "everfragrant",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It takes time to get in as an apprentice but keep at it. Get into a trade union.",
                            "score": 1,
                            "author": "Dire-Dog"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Definitely this, there are white collar certificates that are good too vut theyre not as hot as construction",
                    "score": 1,
                    "author": "BitCloud25"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Plumbing seems pretty recession and AI safe",
            "score": 4,
            "author": "EquivalentAu"
        },
        {
            "level": 0,
            "comment": "Hey I am an immigrant myself \n\nWhat was your career before you moved to Canada?",
            "score": 2,
            "author": "Hellsgate_chan",
            "replies": [
                {
                    "level": 1,
                    "comment": "was a student before moving to Canada, only had experience of part-time working in supermarkets before",
                    "score": 2,
                    "author": "Magical_Astronomy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Certificates can help especially if you have a job already, but if you want a better job then you need at least a diploma..",
                            "score": 1,
                            "author": "Hellsgate_chan"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Learn to weld.",
            "score": 1,
            "author": "sonofkrypton66"
        },
        {
            "level": 0,
            "comment": "Welding/auto, IT and real estate seem to be the big ones here",
            "score": 1,
            "author": "Eas_Mackenzie"
        }
    ]
}