{
    "id": "p48ei3",
    "score": 30,
    "title": "Anyone nervous about in-person classes in a couple weeks?",
    "author": "the_buddy_guy",
    "date": 1628949133.0,
    "url": "https://www.reddit.com/r/BCIT/comments/p48ei3",
    "media_urls": [],
    "other_urls": [],
    "postText": "With the spike in covid and other universities pushing for mask/vaccine mandates, I wonder if in-person classes will help at all.\n\nI'm in a position where I still need to wear a mask. It does stress me out a bit being in a confined room with other who aren't masked. \n\nWhat if a student gets covid? Do they just have to not attend class for 2 weeks? I feel that with BCIT's workload, that would be challenging for a student who misses 2 weeks worth of labs/lectures.",
    "comments": [
        {
            "level": 0,
            "comment": "You can still wear a mask and I suspect a lot of other people will be wearing their masks too. \n\nYou can control what you can control and can influence others to do similar things. A lot can change in two weeks, so keep that in mind.",
            "score": 4,
            "author": "captmakr"
        },
        {
            "level": 0,
            "comment": "It would feel silly, but wearing an N95 is an option.\nLordco sells the 3M ones with an exhalation valve.\n\nIf anyone wants to make fun of you for wearing that, I'll metaphorically fight them",
            "score": 6,
            "author": "Player_Four"
        },
        {
            "level": 0,
            "comment": "Did you get a vaccine? 95%+ of people in BC who are getting covid now aren't vaccinated.",
            "score": 7,
            "author": "baranohanayome",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes I have been vaccinated, but as I said, I'm in a position that I can severely harm a family member if I get them sick. Yes, even if you are vaccinated, you can still spread covid to others.",
                    "score": 14,
                    "author": "the_buddy_guy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This might be a difficult decision, but you may need to move out. I couldn't imagine going to school or work in that situation - mask or no mask.",
                            "score": -3,
                            "author": "baranohanayome",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's my infant son, not about to abandon my family. \n\nWe could have a whole debate about the vaccines and such but my point is I'm abit stressed about going into a room full of people, most probably not wearing masks (some could not be vaccinated) for hours each day. \n\nSFU and UBC are pushing for mask and/or vaccines which I'm curious to see BCIT's stance or if they're just going to follow guidelines.",
                                    "score": 13,
                                    "author": "the_buddy_guy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I can see why you're worried. I just don't see how you're gonna get around it long term. Like after you graduate you're gonna go out to work right? I assume people at your job site are gonna be unmasked or unvaccinated. Getting to campus you're probably gonna take transit \nwith unmasked and unvaccinated people (unless you're fortunate enough to afford a car). \n\nAs for what BCIT is doing, my understanding is that they're scrapping big lectures. Lectures will be held online while labs are in person with your set. This limits the number of people you're exposed to to about 30. Obviously this is program specific so you need to either tell us what you're taking or contact the program area directly.",
                                            "score": 2,
                                            "author": "baranohanayome",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes it is challenging. They are working on a vaccine for under 12 yr olds by eoy which would be great, but I still have to be careful. \n\nYou are right though, I'll need to figure it out when I'm looking for work unless I find something remote. \n\nScrapping big lectures helps I guess, with cases going up so quickly I wonder if Dr. Henry will mandate masks again.",
                                                    "score": 1,
                                                    "author": "the_buddy_guy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Very well could happen. They've reintroduced the mask mandate in the Okanagan and I could see that happening province wide if it gets bad out here.",
                                                            "score": 1,
                                                            "author": "baranohanayome"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yea I'm worried too, especially since everytime someone gets sick they'll likely miss class.",
            "score": 3,
            "author": "BitCloud25",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or maybe if someone has mild symptoms, they might just hide it and attend class.",
                    "score": 8,
                    "author": "the_buddy_guy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just a thought, talk to your prof(s) or program head/dean and explain your concerns.  Their contact info is on the website or just call the main BCIT switchboard to get put through, though many won’t be back in the office until the last week of august.\n\nIf I was your prof, I’d have no problem asking the rest of the class to help out by requesting to voluntarily continue wearing masks at least until the current spike settles down.\n\nMost would voluntarily wear masks. If there were some hardcore anti-maskers they should be in groups together and have students with masks in other groups so everyone is as comfortable as possible.\n\nI suspect many profs will be asking students to hold the line (hold the wall!) for everyone’s safety.",
            "score": 2,
            "author": "throwaway-bcer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, I did talk to the program head about this and he said it's the responsibility of BCIT's president who is going to just go off of the BC guidelines. \n\nCases are going up so much, I'm sure we'll be at 1000 in Sept and by then Dr. Henry might mandate masks indoors again, but who knows. \n\nThanks for idea though.",
                    "score": 5,
                    "author": "the_buddy_guy"
                }
            ]
        }
    ]
}