{
    "id": "wx0qve",
    "score": 4,
    "title": "Mechanical engineering degree",
    "author": "Forreallllz",
    "date": 1661390634.0,
    "url": "https://www.reddit.com/r/BCIT/comments/wx0qve",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone! I am just wondering has anyone here applied for mechanical engineering program with a trade degree? \n\nI have my automotive service technician  diploma and want to go back to school. However, I don’t know  whether would I be able to use it as a stepping stone to ME.",
    "comments": [
        {
            "level": 0,
            "comment": "When I was in the MET (mech engineering technology) program there were people who had their Red Seal in plumbing, carpentry, machining, and some others that worked construction for a decade or two. I think they all did the Tech Entry program to upgrade and prepare.",
            "score": 3,
            "author": "No_Sch3dul3",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am planning to do this too. The only problem is that TE program does not have part time option and I don’t want to quit my job either before going into ME.",
                    "score": 1,
                    "author": "Forreallllz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There might be an option to do academic upgrading through your local high school district. I don't know if it costs money, but I know in high school, a long time ago, I was able to take online courses on my own. \n\nIf BCIT admits you because of your background without taking additional coursework, I'd recommend spending some time on Khan academy reviewing the math, physics, and English curriculum. Math and physics are critical to understanding nearly every course in the program.",
                            "score": 1,
                            "author": "No_Sch3dul3"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am heading into my second year of the Mechanical Engineering Tech program for the degree. I have a red seal in Automotive Service, but because I did not do my schooling at BCIT I did not get a boost to my GPA. They did, however, give me an unconditional entry despite not quite having the prerequisites complete at the time of my application. It is not likely that the service technician diploma will translate to much more than hands-on experience.",
            "score": 2,
            "author": "Silver-Breath-6616",
            "replies": [
                {
                    "level": 1,
                    "comment": "D’m you!",
                    "score": 1,
                    "author": "Forreallllz"
                }
            ]
        }
    ]
}