{
    "id": "xlo2if",
    "score": 3,
    "title": "Hey, I am actually discontinuing my MBA at UCW, and joining a certification course at BCIT. Is it worth the switch? As UCW being private and has a bad academic track record, how does BCIT stand?",
    "author": "StartingGroundZero",
    "date": 1663909308.0,
    "url": "https://www.reddit.com/r/BCIT/comments/xlo2if",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That really was informative, what about the future perspective for a certificate, any idea ? I already have a Mechanical Engineering degree, so will the certificate be of any extra help?",
                    "score": 1,
                    "author": "StartingGroundZero",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you're looking for an MBA that will help land you a job while building a very strong network, go to UBC or UofT... SFU could be an option but honestly, most MBA programs will require some kind of work experience and possibly managerial/supervisory experience too... Also, I was informed by program heads at BCIT, that they will be starting their own MBA program... however the details aren't fully disclosed to the public and are leaning towards not an MBA... here's a snippet of BCIT's wording on the program:\n\n\"This master's degree will not be an MBA because our alumni already have the business administration background. The focus of this master’s will be on advanced business topics such as digital transformation, business sustainability, and innovation.\"",
                            "score": 2,
                            "author": "sonofkrypton66"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great knowing all your ideas, i now officially joined BCIT myself 🔥",
            "score": 1,
            "author": "StartingGroundZero"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just got mine too. Id appreciate this info too !",
                    "score": 1,
                    "author": "grasstafarian"
                }
            ]
        }
    ]
}