{
    "id": "xuqb9e",
    "score": 11,
    "title": "Front End Web Development Current or Past Students!!",
    "author": "Huge-Plankton-5616",
    "date": 1664819349.0,
    "url": "https://www.reddit.com/r/BCIT/comments/xuqb9e",
    "media_urls": [],
    "other_urls": [],
    "postText": "Has anyone taken or currently enrolled in the Front End Web Development course? If so how is the workload and just the overall program? Any tips for future students? \n\nThanks in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "I'm currently in the program and I can tell you right now that if you have a job whether it's full or part time, you're going to want to consider quitting your job while doing this program. Oh you can also say good bye to your social life too. This program is highly intensive and the course load is a lot. We're three weeks in and it feels like I've been in school for 3 months already and like I'm barely surviving\n\nAnother tip I have is try to actually review all your class materials in advance - everything is extremely intense and fast paced and there's no time for slacking. If you miss a class, it may set you pretty far behind if you're someone who has trouble grasping concepts. Don't put off getting any assignments or projects done because some projects cost you your whole grade. Which if you fail a class you pretty much can't continue the program.\n\nExample: we only had maybe 4 photoshop classes before the instructor assigned a FINAL project worth your entire grade in the course and gave us 1 and a half weeks to complete. His grading standards and expectations of the project is EXTREMELY high and he's advised that for beginners, the project takes at least 50 hours to complete. On top of that, you have other assignments and projects to work on and you also need time to study/learn months worth of material that may be hard to grasp becaue the lectures go pretty fast. When I say fast, I mean that the material they cover goes fast. You're learning four months worth of material in 6days.\n\nI've taken programs that were condensed (8 classes per semester mon-fri 8am-4pm) and nothing compares to the pressure that comes with this program.\n\nI think it's a really great program but you've got to be prepared to handle the workload. Good luck!",
            "score": 5,
            "author": "Affectionate-Ad1714",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow holy smokes, thank you so much for this, good luck on the rest of your program.",
                    "score": 1,
                    "author": "Huge-Plankton-5616"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm curious as well!  I'm going to be in the January intake, and I'm so excited! ❤️",
            "score": 1,
            "author": "Infinite-Dreams",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm in the January intake too! Was hoping for in-person delivery though, but oh well",
                    "score": 1,
                    "author": "Cjvxcii",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same here, I'm sure online will suffice!",
                            "score": 2,
                            "author": "MetedIce"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Any updates?",
                    "score": 1,
                    "author": "NVCTSjanklys",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh, sure!  Sorry for the delayed response.  We're about half way through right now!  Just had our week long spring break. :)\n\nIt's a great program... My first time taking classes online, and I love this way of schooling.  (No commute is nice!)  \n\nLectures are during the AM, and the PM is free lab time to work on your assignments.  The instructors are very kind and helpful, and you can tell they want you to succeed.  They're quite forgiving with their marking, IMO, not too strict, and they give a lot of detailed feedback.  If you're interested in the material and you try your best, you will do well.  Having a blast so far -- can't believe it's already been 3 months... I'm kind of sad thinking that it's half way done already, honestly.  It's the first time I've ever enjoyed school. \n\nThe workload depends on your time management skills and how well you pay attention in class, IMO.  If you can absorb most of the material during class and get started on your assignments early, the workload isn't bad at all.  It's quite reasonable overall.  I myself have poor attention and time management skills, so I find myself scrambling to finish stuff sometimes when the big projects are due, but I haven't experienced any massive amounts of stress.  The assignments are, for the most part, quite interesting and enjoyable to me.  There are no tests, by the way, just assignments and projects.",
                            "score": 2,
                            "author": "Infinite-Dreams",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Happy to hear you’re having a great time, I’m really excited to apply. I personally don’t like online schooling however if I don’t make it into the September in person intake I’ll definitely consider the October online intake. Thank you for the insightful update!",
                                    "score": 1,
                                    "author": "NVCTSjanklys"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Myself and other students in class have had mental breakdowns already lol",
            "score": 1,
            "author": "Affectionate-Ad1714"
        }
    ]
}