{
    "id": "ybzvfa",
    "score": 5,
    "title": "Power and Process Engineering",
    "author": "824BlackMamba",
    "date": 1666578715.0,
    "url": "https://www.reddit.com/r/BCIT/comments/ybzvfa",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello,\n\nI have a few questions regarding getting accepted into the program, courses required, and possible pathways I could take after completing it.\n\nWould I lose my seat or get kicked out of the program if I fail a course during my grade 12 year? \n\nI am currently taking AP Calculus and AP Chemistry as it is very difficult for me to maintain high grades in those classes. I was wondering if I am required to take 1st year Chemistry and/or 1st year Calculus for Power and Process Engineering.\n\nFinally, I am curious about the different pathways I could take if I finish the program.\n\nWhat trades would you recommend to combine with 3rd class Power Engineering? I am thinking of Instrumentation Technician, Millwright, and/or Electrician.\n\nWould I be able to upgrade to Electrical Engineering since Power Engineering is a subfield?\n\nHow long would it take to become a 1st class Power Engineer?\n\nThanks for the help!",
    "comments": [
        {
            "level": 0,
            "comment": "In America, Power Engineering is a sub-field of Electrical Engineering. In Canada, it is **not** an engineering degree at all - typically they are operators for boilers and other such things. Engineers have their own regulatory body, power engineers are governed by TSBC, and trades are governed by their respective regulatory bodies (sometimes TSBC as well, in BC).\n\nThe math requirements are literally low as balls. Like **foundations** of math 12 or pre-calc 11 or 12. They literally teach you math right from how to use fractions and exponents and how to do algebra. I wouldn't stress a lot about that, as long as you meet the entrance requirements. They didn't even have a wait list this year (for the first time) so try and get good grades, but worst-case scenario you probably won't have to worry about competition for getting in.",
            "score": 3,
            "author": "OW_FUCK"
        },
        {
            "level": 0,
            "comment": "You don't need AP subjects for Power and Process Engineering. You don't need AP at all inorder to apply  to any program at BCIT. Just the programs listed on the website. I would recommend you to go for Electrical engineering and then decide whether you want to pursue Power and process engineering.\nElectrical engineering is a very broad major consisting of many subfields. You learn many different discipline, which why you see electrical engineers working in a software positions. Going from electrical to power would be possible, but I doubt the other way is. \nAs for trades, I wouldn't go for what's right with Power and process engineering, but what you may enjoy on the side. Trades is a completely different discipline, so there's really no 'combining'.",
            "score": 3,
            "author": "Successful-Depth5404"
        },
        {
            "level": 0,
            "comment": "For Electrical Engineering, you cannot apply directly if you have completed Power Engineering since they are two different fields (one is engineering and the other is trades-based). If you want to pursue Electrical Engineering, you must complete one of the 3 options: ECET (you can apply directly from 2nd term tho), Robotics, or Biomedical Engineering (you must also complete a few more prerequisite courses in order to apply).",
            "score": 2,
            "author": "Iszem"
        },
        {
            "level": 0,
            "comment": "Hi there!\n\nI'm currently a first year P&amp;P student so I can (also) help you with some of your questions. To answer your first question regarding your seat, I doubt you will lose it. As long as you have the requirements of Physics 11, Pre-Calc 11 or 12, and English 12, you will be eligible in getting into the program, however, you may be waitlisted. If you have good grades, then you will be secured. In addition, since you are taking AP Calculus and AP Chemistry, those can further secure your position even if you are not able to maintain grades to your standard. Due to the requirements, they'll see you have the knowledge to think further beyond than what they expect of you.\n\nSince Power &amp; Process Engineering is a trade, you cannot transfer your courses to other programs. It has its own: \"POWR.\" You may be used to seeing more transferable courses such as \"PHYS,\" \"MATH,\" etc. It wouldn't be possible to transfer to Electrical Engineering strictly off Power &amp; Process Engineering as they're both different fields.\n\nA trade that is good in tandem with Power &amp; Process Engineering is being a Millwright. If you would like to be an electrician in combination with a power engineer, you will have the certification to do more electrical work with the systems you will be operating. As power engineers, unless we have a certification or ticket to extend our boundaries, we are limited to how high voltage of equipment we are allowed to operate.\n\nLastly, 1st Class Power Engineering, and sometimes 2nd is more of a managerial role. If you came to the program with the motivation of doing more \"hands on\" work, then you should stay as a 3rd or 4th Class. To answer your question, the lowest amount of time required to get a 1st Class is a bit less than 6 years. This however, is highly unachievable due to the requirements to get a license. You can learn more about it here: [https://www.technicalsafetybc.ca/technologies/boilers-pressure-vessels/power-engineer-certification](https://www.technicalsafetybc.ca/technologies/boilers-pressure-vessels/power-engineer-certification)",
            "score": 1,
            "author": "c_sual"
        },
        {
            "level": 0,
            "comment": "I think the progeam you are looking for is the ECET Power and Industrial Controls option. \n\nPower engineering is a weird, grey area disipline. BCIT hosts power engineering under the mechanical trades department (while NAIT and SAIT seems to treat it as a engineering technology program.)\n\nPeople consider power engineering as a trade but it's kind of a grey area, especially if you are pursuing a 1st or 2nd class ticket then you will be away from the tools. \n\nPower engineers operate and maintain boiler and refrigeration systems. By definition, you are an operator and a ticket is required by law depending on the type of pressure vessel and heating surface of a common header. \n\nAs for math and engineering courses, the two year diploma does have a calculus course and you should beable to transfer your credits. Alot of the courses are similar to mechanical engineering but much simplier. I don't know if the AP chemisty course can be used for anything.\n\nIf you want to pursue a trade (an actual trade) like millwright or electrician, I think you are better off for the general program and stay as a 4th, get a job then work for your hours if the job offers it.\n\nIf you want to pursue electical engineering degree, just go straight to ECET and maintain a high gpa for the first year (competitive to the top 32 students.) If you still want a power engineering ticket later, you can take online courses instead. \n\nDefinitely do some research on the bcit programs. Although the power engineering program is under trades, it's very different from a traditional trades program and heavy in theory. The program is still difficult and you do have a large course load (first term has 9 courses!)",
            "score": 1,
            "author": "YoungesterJoeey"
        }
    ]
}