{
    "id": "z6ev3f",
    "score": 2,
    "title": "Can I buy course material before I start?",
    "author": "agentspliff604",
    "date": 1669588391.0,
    "url": "https://www.reddit.com/r/BCIT/comments/z6ev3f",
    "media_urls": [],
    "other_urls": [],
    "postText": "I would like to buy and read the level 4 electrical books and prepare before the class starts in a few months. Can I purchase the books from the book store?",
    "comments": [
        {
            "level": 0,
            "comment": "Yes",
            "score": 2,
            "author": "rb993"
        },
        {
            "level": 0,
            "comment": "Learn about plcs. That was the section that got me good. I still to this day don't actually understand plcs, but my instructors plc test was a bunch of practice quizzes that I kept spamming and remembered the answer to.",
            "score": 2,
            "author": "nigkaplz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for the advice. How much of the stuff carries on from 3rd year? Been almost a decade since I did 3rd year. Don't remember as much as I would like, but going over previous years work. My work partner said pretty much everything is new, not much from other years.",
                    "score": 1,
                    "author": "agentspliff604",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe only 1 unit carries on from previous years and it's called trades concepts. It's all the math you did from level 1 to 3. Everybody does bad on that test. Everything else is brand new. Read this, memorize that.",
                            "score": 2,
                            "author": "nigkaplz"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awesome.  Thanks",
            "score": 1,
            "author": "agentspliff604"
        },
        {
            "level": 0,
            "comment": "Of course. Bill all your expenses to me. Learning at BCIT and VCC is very practical. If you have any questions, we can informally chat about what you are studying and see where your knowledge level is at. Also, get a hold of Gerry Warne and Brendan from the Annacis island campus for me.",
            "score": 1,
            "author": "Dividend__Investor"
        }
    ]
}