{
    "id": "148p550",
    "score": 424,
    "title": "Samurai Frog done by Karly Alberts at Musume Ink Waipahu, Hawaii",
    "author": "AncientNectarine",
    "date": 1686689036.0,
    "url": "https://www.reddit.com/r/tattoos/comments/148p550",
    "media_urls": [
        "https://i.redd.it/oc2fjy2hku5b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Thank you for the submission, AncientNectarine! Please make sure your post follows the guidelines found in the sidebar, or it will be removed. If you're asking a question, please delete your post and ask in the pinned Weekly Discussion thread.\n\n###Users, please report any comments that break rules, such as ANY comments on personal appearance (both insults and compliments), promotion, or unnecessary rude judgment.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tattoos) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "You’ll always have my upvote if a frog is included\n\nLooks great dude",
            "score": 23,
            "author": "Inuhazrd",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! You'd love half my sleeve. Frogs brewing beer haha",
                    "score": 10,
                    "author": "AncientNectarine",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh hell yeah that’s awesome! 😂",
                            "score": 3,
                            "author": "Inuhazrd"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Amazing can’t wait to get my first sleeve finished in a couple of days so excited",
            "score": 3,
            "author": "bruggeandburned"
        },
        {
            "level": 0,
            "comment": "Cool frog.",
            "score": 2,
            "author": "DiamondEyedOctopus"
        },
        {
            "level": 0,
            "comment": "Who on Oahu is a good suggestion to contact about a traditional hand poked?",
            "score": 2,
            "author": "Subject-Sufficient"
        },
        {
            "level": 0,
            "comment": "Very nice! How far along is the healing?",
            "score": 2,
            "author": "FoxySirDidymus",
            "replies": [
                {
                    "level": 1,
                    "comment": "This picture was taken the day i got it done. So far I'm 2 weeks in and need to get the blues touched up",
                    "score": 2,
                    "author": "AncientNectarine"
                },
                {
                    "level": 1,
                    "comment": "Yeah is this healed or new ish? I'm happy with my hand tattoo so far but it's only been 5 days and I can already see a massive colour change whish has me upset.\n\n\nDon't get me wrong the tattoo is still amazing but I'm now wondering how faded it will go and how many times I'll have to top it up after the years",
                    "score": 1,
                    "author": "texanghost",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This pic was day of. Yeah it definitely will fade a decent amount if you use your hands a lot. I work with my hands and my right hand i got back in feb needs loving. The top of the hand is fine but fades as it gets into the knuckles and fingers",
                            "score": 3,
                            "author": "AncientNectarine"
                        }
                    ]
                }
            ]
        }
    ]
}