{
    "id": "6lj5k3",
    "score": 19800,
    "title": "Arm band to commemorate a year traveling the world. Artist:Hanzi at Bloody Ink studio, Kuala Lampur",
    "author": "mdleast1986",
    "date": 1499311696.0,
    "url": "https://www.reddit.com/r/tattoos/comments/6lj5k3",
    "media_urls": [
        "https://i.redd.it/d0556c8x5w7z.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "If you are visiting /r/tattoos for the first time, or visiting from /r/all, please be aware of ALL of the rules in the sidebar and stickied threads before posting. Common issues that WILL get you banned are any comments on personal appearance, any discussion about pricing, and trolling.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tattoos) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Looks great. I'd say a full year is worth commemorating!",
            "score": 338,
            "author": "dinoslauri"
        },
        {
            "level": 0,
            "comment": "All my life I thought I would never find a tattoo concept that would be cool enough to convince me to get my skin inked for life.\n\nUntil now. ",
            "score": 747,
            "author": "foo_fighter",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 237,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 81,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well I regularly trash it anyways",
                                    "score": 30,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 45,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That meme tattoo actually gave me a new perspective on getting a tattoo. I don't have any because I've been obsessed with waiting for something with \"meaning\" enough to put on my body - but isn't the point of a tattoo to look nice/aesthetic? If I sat around and waited for something \"meaningful\" to jump out at me, then I wouldn't ever settle on anything. I'm just looking for a design that I like now, because fuck it I want a badass looking tattoo",
                                    "score": 36,
                                    "author": "brodymitchell",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There are a few tattoos based on the voyager golden plate pulsar map that I always thought were nice.",
                                            "score": 10,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I wanted to get that on my forearm, however my tattooer advised against it as the lines and dots are so close together and they will blend together over time, so I went with the solar system instead",
                                                    "score": 8,
                                                    "author": "JAGoMAN",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I mostly like it on the torso, but I am far to hairy either way.",
                                                            "score": 4,
                                                            "author": "[deleted]"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Can I see what yours looks like?",
                                                            "score": 2,
                                                            "author": "brodymitchell",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[sure!](http://i.imgur.com/A85eLZ0.jpg)",
                                                                    "score": 5,
                                                                    "author": "JAGoMAN"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The point of a tattoo is whatever the point of your tattoo is. It's *your* skin. Your choice. The people who get something meaningful aren't more or less valid than the spongebob tattoos... if it all had to be meaningful, biomechanical probably wouldn't exist as a genre \\^_^",
                                            "score": 8,
                                            "author": "ughzubat"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I feel the best kind of tattoos are ones that are a collaborative effort between the artist and client to find something both are happy with. If you find an artist that you gel with creatively as well as on a personal level, that's when I think you can get some awesome stuff done.",
                                            "score": 4,
                                            "author": "micosurv"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": 3,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Can we see? ",
                                                    "score": 3,
                                                    "author": "underablanketofsnow",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 1,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The bad ones sound more interesting lol",
                                                                    "score": 2,
                                                                    "author": "underablanketofsnow"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I've always had this perspective and I'm happy that's been the case. For me it's important that my tattoos don't mean too much for me, because first of all it actually is very tiresome in the long run to explain it to people who ask, and I hate seeming pretentious to others and myself. But most of all, we all change so much that a very personal and meaningful tattoo is like taking a bet: either you have a great story for it when you're 40, or you'll regret it. I was about to tattoo \"sXe\" (straight edge, no alcohol/drugs lifestyle) on my neck when I was 16 or 17 and then I literally started drinking 6 months later. I went ahead and did a tattoo that took me 5 minutes in Photoshop instead and thought it looked dope instead of that, and I still like it.",
                                            "score": 2,
                                            "author": "dsgstng"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yo man. This is how I felt for years, until a couple weeks ago I just walked in and got one cause I thought it was cool. No regrets, or else yeah I probably would never get one",
                                            "score": 1,
                                            "author": "barricay"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": " Tattoos can be whatever you want them to be. But I have yet to answer the question \"Am I sure I would like this tattoo a year from now?\"",
                            "score": 5,
                            "author": "Dwight_kills_her_cat"
                        },
                        {
                            "level": 2,
                            "comment": "God damn all that points out to me is the clean line work, especially on that text",
                            "score": 1,
                            "author": "AndrewHainesArt"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "http://instagram.com/tattoohanzhi\n\nHis profile is inspiring. I've gotten one from Hanzi, I'm glad to see him here!",
                    "score": 20,
                    "author": "tofutales",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That skelton playing a guitar is insanely good. Would love a modified version of that as a grateful dead tattoo ",
                            "score": 6,
                            "author": "BAMFndPI"
                        },
                        {
                            "level": 2,
                            "comment": "Thanks for the link, and WOW what an artist!",
                            "score": 2,
                            "author": "Strongcarries"
                        },
                        {
                            "level": 2,
                            "comment": "Thanks for that link. This guy is good! I don't have a tattoo, but have been wanting one since forever! I even have the design in my head and everything. I'll be returning home to KL next week. Might go have a chat with Hanzi. ",
                            "score": 1,
                            "author": "alma_vh"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I had the exact same thought! Now to just travel for a year!",
                    "score": 40,
                    "author": "irritus"
                },
                {
                    "level": 1,
                    "comment": "Same here. I'm 40 and have been saying for years \"if I ever come up with a tattoo idea that I'll still think is awesome when I'm 80, I'll get one.\" This concept, execution, and the meaning behind it is pretty damn close to fulfilling that requirement.",
                    "score": 23,
                    "author": "nvanprooyen"
                },
                {
                    "level": 1,
                    "comment": "same! Love this ink",
                    "score": 4,
                    "author": "iLiBB"
                },
                {
                    "level": 1,
                    "comment": "Poor OP started a tattoo trend. ",
                    "score": 3,
                    "author": "Uhmerikan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've worked in a tattoo shop for three years. Believe me, this idea is nothing new. Probably have one of these roll through every month. ",
                            "score": 15,
                            "author": "dwdw182",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same here!!!",
                    "score": 4,
                    "author": "ForgottenPhenom",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So this one has a lot of story for me. I climbed the second highest volcano in Indonesia on my own in 20 hours, learned to surf, spent weeks being a beach bum in Thailand and hiked through the jungles in Thailand over four days. \n\nSo that's the story ",
                            "score": 42,
                            "author": "mdleast1986",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you don't mind me asking how old are you and what country are you from? That sounds amazing ",
                                    "score": 8,
                                    "author": "Catfondler",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "30 and from the UK. You can travel for SO CHEAP in Asia! I spent 6 weeks in India and spent about £500 all in. Vietnam is so unbelievably cheap, and if you go to the right places in other countries you can live for like $15 a day easy",
                                            "score": 23,
                                            "author": "mdleast1986",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Stupid question but could you get by on english? Or did you learn enough of the language to get by?",
                                                    "score": 6,
                                                    "author": "Toddpole-",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Barely learned any to be honest! Most places are really good for tourism and there's always others to help out ",
                                                            "score": 7,
                                                            "author": "mdleast1986",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Did you like Malaysia? ",
                                                                    "score": 5,
                                                                    "author": "themonsterbrat",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I'm still here and it's amazing! Highly recommended ",
                                                                            "score": 10,
                                                                            "author": "mdleast1986",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Can you give more information on this? I'm getting out of the military and have been planning a ton and feel like I've got it all figured out... BUT would love perspective/do's/don'ts of someone who has already done it. Thanks!",
                                                                                    "score": 5,
                                                                                    "author": "Strongcarries",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I just came here to say the same thing. ",
                    "score": -1,
                    "author": "Attack_Symmetra"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Woah how many arms do you have",
            "score": 62,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "A lot. ",
                    "score": 4,
                    "author": "mintim4"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just saying, it's Kuala Lumpur not Kuala Lampur.",
            "score": 120,
            "author": "prismenchow",
            "replies": [
                {
                    "level": 1,
                    "comment": "#fail",
                    "score": 78,
                    "author": "mdleast1986",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "At least that was not tattooed to your arm!",
                            "score": 109,
                            "author": "Magento",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That was my first thought and I scrolled desperately back up to check.",
                                    "score": 22,
                                    "author": "MundiMori"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Dude where is it in KL? I'm in KL and have been pondering a tattoo for myself.",
                            "score": 2,
                            "author": "ixora7",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bloody ink is in one of the malls in Bukit Bintang. It's quite a \"local\" mall but it's pretty decent. There's loads of studios there but this was the one that came the highest rated from what I found ",
                                    "score": 14,
                                    "author": "mdleast1986",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Please tell me you watched them pull all of the equipment out of autoclave bags, they wore gloves and everything was wiped down before you got tattooed ",
                                            "score": 4,
                                            "author": "nopunchespulled",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Bloody Ink is in Sungai Wang - it's that one surviving old-school, low-end mall among a sea of high-end ones. The mall _is_ slowly dying, but you can still smoke in there, rent is cheap, there's still relatively okay foot traffic, it's near major tourist spots, etc. so tattoo shops love it there.\n\nMost times, you DO have to watch them - because they MAKE you look as they're  setting up + autoclaving + opening new needles. Then they make you sign a form confirming all of that. ",
                                                    "score": 6,
                                                    "author": "themonsterbrat"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah of course. All good ",
                                                    "score": 3,
                                                    "author": "mdleast1986"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Ak okay its near BB huh. I'll go check em out. Cheers mate.",
                                            "score": 1,
                                            "author": "ixora7"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Kuala Lampah lah",
                    "score": 9,
                    "author": "siaolangbohsalah",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Waste of a year. lol \n\nKoala Lumpir . ",
                    "score": 13,
                    "author": "truth_alternative"
                },
                {
                    "level": 1,
                    "comment": "Just KL, much easier, ok lang",
                    "score": 2,
                    "author": "BAMFndPI"
                }
            ]
        },
        {
            "level": 0,
            "comment": "for 16 years I've been pondering whether to get a tattoo or not. This made the balance tilt a little bit. Awesome art.",
            "score": 162,
            "author": "El_Shakiel",
            "replies": [
                {
                    "level": 1,
                    "comment": "You know, if something has been tempting you for 16 year, I think you should address it. Life is short sometimes, go do all the things",
                    "score": 213,
                    "author": "TeeMR",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well if that's the way to say he is 16 years old, not that much",
                            "score": 63,
                            "author": "Acipenseridae"
                        },
                        {
                            "level": 2,
                            "comment": "I think about it too but can never find one I like enough. Now I find one I like and I'm broke. Great",
                            "score": 6,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "thing is, I cant even keep the same fuckin wallpaper on my PC for a month straight. I'm scared AF i'll grow bored of any tattoo - no matter how cool it is =(",
                            "score": 3,
                            "author": "El_Shakiel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You will never grow tired of it, just think of it as a picture of your life at that particular time. You will always have memories associated with every tattoo, some good some bad, but they are your memories so fuck it, go get inked. ",
                                    "score": 11,
                                    "author": "BAMFndPI"
                                },
                                {
                                    "level": 3,
                                    "comment": "i got two tattoos on sort of half-whims. nothing THAT committed, but the thing about tattoos is at some point, they just become a part of your skin. like a mole or freckle. it's really just the first step committing to the tattoo that's the hardest part i think.",
                                    "score": 3,
                                    "author": "Cebolla"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Do it! Do the thing man! You got this! ",
                    "score": 12,
                    "author": "ThisisGabeB",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do all the things! :D",
                            "score": 1,
                            "author": "frysynberg"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Start small, somewhere not to noticeable and see how you feel. ",
                    "score": 3,
                    "author": "Kumbackkid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's what I did. I gradually got bigger and more visible tattoos over the course of 20 years. I'm about to get a half sleeve and I'm almost 38.",
                            "score": 3,
                            "author": "ClariceReinsdyr"
                        },
                        {
                            "level": 2,
                            "comment": "that's what my ex used to say :/\n\n",
                            "score": 3,
                            "author": "El_Shakiel"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dude! Killer concept and execution. Awesome piece!",
            "score": 41,
            "author": "gottismydriver"
        },
        {
            "level": 0,
            "comment": "Tattoo is cool and all, but have you considered chopping off your leg, then getting a prosthetic one with a chalkboard surface?",
            "score": 42,
            "author": "MCA2142",
            "replies": [
                {
                    "level": 1,
                    "comment": "meta",
                    "score": 6,
                    "author": "awsnapitsrachel"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Matt Damon",
            "score": 31,
            "author": "All_Isay_isMattDamon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Username checks out",
                    "score": 13,
                    "author": "fatenuller"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It appears the fad of tattoo armbands did not go out of style; they just moved from the upper arm down to the forearm.\n\nAll joking aside, the tattoo looks great!",
            "score": 14,
            "author": "jerdub1993"
        },
        {
            "level": 0,
            "comment": "Man, I'd put a needle through my testicles to be able to travel for a year...",
            "score": 13,
            "author": "PSIStarstormOmega",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why not both?",
                    "score": 13,
                    "author": "corylew"
                },
                {
                    "level": 1,
                    "comment": "Or you know, you could just travel without doing that...",
                    "score": 5,
                    "author": "wahhagoogoo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh wow didn't know that was just an option. \n\nLet me drop all my bills and commitments right now and travel the world to really understand myself!",
                            "score": 3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yea, you should",
                                    "score": 3,
                                    "author": "wahhagoogoo"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "OP is exploiting the economics of \"Cheaper to live in other countries\" which makes everything cheaper.",
                    "score": 2,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "You could also just save up some money ",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The funny thing about being poor is that saving money is pronounced \"surviving\"",
                            "score": 20,
                            "author": "PSIStarstormOmega",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I've spent right around the poverty level for many years and have had a wonderful time. It's pretty easy to make more money than that. ",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have been drawing, searching, and talking to people trying to design something like this. But you have gone and completed my search! I know know exactly what I want. Thank you! \n\nI won't copy you I promise 👌🏽",
            "score": 5,
            "author": "Rafa_Ultimate"
        },
        {
            "level": 0,
            "comment": "Great piece, perfect to commemorate a life memory. Wish I had the time and money to travel the world for a year. I would probably have the world map inked on my back after that adventure. ",
            "score": 11,
            "author": "BAMFndPI",
            "replies": [
                {
                    "level": 1,
                    "comment": "It isn't as expensive as you'd think. Travel cheap and you can get it done for a few thousand. ",
                    "score": 11,
                    "author": "GeekDad12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Depends where you go.",
                            "score": 4,
                            "author": "SunMakerr",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If someone wants to see the world they dont need to go to Milan or Paris and spend tonnes of money. If you are not wealthy most of the price of travelling should be on plane tickets. You can live cheaply in foreign countries. ",
                                    "score": 3,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's no where near as expensive as most people think. I started working remotely and have been traveling for over a year. Don't plan on stopping for years to come.",
                    "score": 4,
                    "author": "wahhagoogoo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I work in web development and programming but the options to work remotely are endless. \n\nIt really depends on your skills and what you are willing to learn. Start learning something now and try to create some remote income streams or get a few freelance projects.  \n\nMore and more companies are going fully remote now\n",
                                    "score": 1,
                                    "author": "wahhagoogoo"
                                },
                                {
                                    "level": 3,
                                    "comment": "It has a lot more to do with drive than any particular skill set. Cultivate the right mentality about learning and trying and that's really the primary skill set you need to work remotely ... actually that's probably a solid way to think about many things. ",
                                    "score": 1,
                                    "author": "inksaywhat"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was thinking about doing that. Getting an outline of all the places on my back, and then getting them filled in with something as I visited them.",
                    "score": 1,
                    "author": "TheNameIsFletch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Get a map and do this. No way you're getting a map big enough to color in that won't look tacky as fuck",
                            "score": 21,
                            "author": "DerangedDesperado",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ooh, I'd love to see a picture if possible.\n\nBut after talking it over, I don't think I could derive much meaning from it apart from the fact I'm travelled to X, Y, and Z. I think it probably is best to keep a map, and then pin photos etc of memories on it.",
                                            "score": 1,
                                            "author": "TheNameIsFletch"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Never liked that idea, tbh. It makes it seem like you travel to places just to \"check a box,\" so to speak. Plus, you could spend a night in the Nairobi airport and fill in Kenya. Point is that filling in a place on a map says nothing about what that place meant to you or how you actually spent your time there.",
                            "score": 7,
                            "author": "sparkly_nonsense",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'd have rules for it if I was to do it. I'd have to be there on a trip, not just a waypoint in a journey. But yeah I see what you mean about it doesn't represent what the place meant. I'm taking the whole idea back to the drawing board anyway after someone pointed out cost and fading, but thanks.",
                                    "score": 1,
                                    "author": "TheNameIsFletch"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That idea has been done a lot, this one is fresh, I really like it.",
                            "score": 4,
                            "author": "Hibs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh yeah, I love this idea and admit it is different. Just you are limited to how many places you can represent on your body.",
                                    "score": 3,
                                    "author": "TheNameIsFletch"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ha, all the places I've enjoyed the most are generally not the places I'd want to get a tattoo...",
                            "score": 2,
                            "author": "GeekDad12"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My partner was tattoed by miao at bloody ink, an amazing shop if yall are in KL",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah my fiancé did too! She did some great work ",
                    "score": 6,
                    "author": "mdleast1986",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is the elbow supposed to look like a radiating sun? If so props for creative placement. ",
                            "score": 2,
                            "author": "LDHolliday",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sadly I can't take credit for that 😩",
                                    "score": 5,
                                    "author": "mdleast1986",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'll give you credit. ",
                                            "score": 3,
                                            "author": "LDHolliday"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NZ on my bucket list, don't think I have ever seen a picture from there that was not awe inspiring. ",
            "score": 2,
            "author": "BAMFndPI",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just arrived here on my travels. It's rained... Non stop. Which is a change when I've managed to chase purely summer and warm sunny weather for 9 months. ",
                    "score": 1,
                    "author": "MadeNew"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great tattoo! I got something similar but smaller as my first tattoo before we left to travel the world. \n\nAn outline of a mountain wave and tree. We've been away 9 months now and on country number 8. ",
            "score": 4,
            "author": "MadeNew",
            "replies": [
                {
                    "level": 1,
                    "comment": "1. How do people jump back into the workforce after taking a year off to travel?\n\n\n2. How do you not go insane sitting in a office after traveling for a year?",
                    "score": 4,
                    "author": "ChocPretz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I couldn't answer either of those questions yet as I'm not going home for another 6 months at least. Just arrived in New Zealand for 5 weeks with a camper van. \n\nI had an alright job that I enjoyed back home so the idea of work isn't too horrifying. Although, I did give that up and I'm not ready to go back just yet.  ",
                            "score": 1,
                            "author": "MadeNew"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm hoping to get something similar around my thigh. Somewhere around the area that it's visible in running shorts. I've been living all over Asia for two years, Spain before that, Alaska, all over the West Coast. But I haven't been in an English speaking country for almost five years. ",
            "score": 3,
            "author": "corylew"
        },
        {
            "level": 0,
            "comment": "Fantastic concept",
            "score": 3,
            "author": "nomad80"
        },
        {
            "level": 0,
            "comment": "Where did you travel to?",
            "score": 3,
            "author": "mazzamunchkin",
            "replies": [
                {
                    "level": 1,
                    "comment": "SEA probably",
                    "score": 4,
                    "author": "troller_awesomeness",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "India/SE Asia/Australia/NZ/Fiji. 10 months and ten countries in so far",
                            "score": 14,
                            "author": "mdleast1986",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What was your budget to travel 1 year? And do you work during your travels? ",
                                    "score": 5,
                                    "author": "ExpFim",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "SEA is pretty much the defacto place for cheap travel I'm sure India is even cheaper. Easily offset costs incurred in aus and nz. I'd guess around eight to ten thousand. I've heard of people living in sea for six months for 3k, really depends on how much time is spent where.",
                                            "score": 6,
                                            "author": "DerangedDesperado",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thanks for the answer! ",
                                                    "score": 5,
                                                    "author": "ExpFim",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I traveled with my fiancé and we had about 15k each for everything. Within that cost we've both got 3 tattoos, paid for flights, hired canpervan in aus and NZ, and all the other Things like food and transport. In Asia we've been living on about £500 a month each in most countries ",
                                                            "score": 11,
                                                            "author": "mdleast1986",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "How much did you end up spending and how much time did you spend in aus and nz ",
                                                                    "score": 3,
                                                                    "author": "DerangedDesperado",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Two months in aus driving Melbourne to cairns and 6 weeks doing all of NZ. Could have spent months in NZ",
                                                                            "score": 9,
                                                                            "author": "mdleast1986",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Just got to NZ now from 6 months in Aus. Anything you recommend not missing? \nHow much longer are you going for, and what countries do you still have to visit? \nIf you get the chance you've gotta get to Japan and Taiwan before you had home! They were favourites for my girlfriend and I. ",
                                                                                    "score": 1,
                                                                                    "author": "MadeNew",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Sorry. we're still traveling now! We will spend just short of £30k I reckon by the end of it ",
                                                                            "score": 6,
                                                                            "author": "mdleast1986"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I've been travelling for over a year now, you can do it a lot cheaper than people realise. \n\nI'm in Thailand at the moment, you can live better on $500/mo than you could for 4k/mo in most states. A lot of countries are even cheaper.\n\nI've been working remotely and don't plan to stop travelling for years to come.",
                                            "score": 3,
                                            "author": "wahhagoogoo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's awesome! How did you got the remote job/ also tried to find a job locally?",
                                                    "score": 1,
                                                    "author": "ExpFim",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I work for myself in programming and web development. I taught myself a lot of it while I was travelling actually. \n\nNah I don't really want to work for anyone else, especially in Asia. I might get an office when I head to Europe but I love not being stuck anywhere and moving around freely.\n\nNothings stopping you man, take the leap.",
                                                            "score": 3,
                                                            "author": "wahhagoogoo",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The leap is already booked. One way ticket to SK and then let's see where the journey will finish. ",
                                                                    "score": 2,
                                                                    "author": "ExpFim",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Nice one man. If you're interested in remote work, look into meet ups at any co-working spaces and go talk to people.\n\nIt can be a bit of a grind but it's so liberating not having to answer to anyone or anywhere to be.",
                                                                            "score": 1,
                                                                            "author": "wahhagoogoo",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yea will gonna look more into those possibilities. ",
                                                                                    "score": 1,
                                                                                    "author": "ExpFim"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "came here to say this. sorted by controversial to find it but i totally agree. the thing about fads is you dont recognize them until they are gone :/",
                    "score": 5,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Who cares. Let people live. ",
                    "score": 7,
                    "author": "nonothatsnono",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ok mr I'm not basic. ",
                                    "score": 3,
                                    "author": "nonothatsnono"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love this",
            "score": 3,
            "author": "lowbike1"
        },
        {
            "level": 0,
            "comment": "Great concept, nice lines, good details and I love that it goes around and around..",
            "score": 2,
            "author": "-mr-X"
        },
        {
            "level": 0,
            "comment": "Never thought I'd want a tattoo but man, that looks amazing.",
            "score": 1,
            "author": "MrTeddyHunter"
        },
        {
            "level": 0,
            "comment": "This was kinda a tattoo I had in mind after I took a month long road trip around the US! Literally imagined the Mountains, Pine Trees, Palm trees, and cacti on mine!",
            "score": 1,
            "author": "Mikecich"
        },
        {
            "level": 0,
            "comment": "Awesome tats!",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is the first tattoo that I would get personally. Beautiful work and meaning. ",
            "score": 1,
            "author": "Faedaine"
        },
        {
            "level": 0,
            "comment": "Artists name means \"Chinese character\" in Chinese, pretty funny",
            "score": 1,
            "author": "RevolutionaryNews"
        },
        {
            "level": 0,
            "comment": "So so so in love with this ",
            "score": 1,
            "author": "thburningiraffe"
        },
        {
            "level": 0,
            "comment": "As someone living in KL currently about to get my first tattoo this is super relatable.  Love SE Asia and not super excited to come back to the states but Ya gotta do what Ya gotta do.",
            "score": 1,
            "author": "Haattare"
        },
        {
            "level": 0,
            "comment": "I got tattooed there a couple months ago by Han as well. Cool shop, gotta go back to get mine finished soon.",
            "score": 1,
            "author": "theragequiter"
        },
        {
            "level": 0,
            "comment": "How much money was required for you to travel like that? I've been wanting to do something similar but I don't have a lot of money to work with. ",
            "score": 1,
            "author": "lonesomesoul95",
            "replies": [
                {
                    "level": 1,
                    "comment": "In another comment OP said that he was travelling with about $30K as a budget (split between two people)",
                    "score": 1,
                    "author": "TheMechanicusBob",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh ok, thanks. ",
                            "score": 1,
                            "author": "lonesomesoul95",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Correction. That's pounds not dollar. Probably a bit less to be honest but we spent 4 months in aus NZ and Fiji. Stay in Asia you could halve that budget easily",
                                    "score": 1,
                                    "author": "mdleast1986",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Do you have a write up or anything anywhere? I'd be curious to know more about your trip. ",
                                            "score": 1,
                                            "author": "lonesomesoul95",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah sure. Donewithadulting.wordpress.com",
                                                    "score": 1,
                                                    "author": "mdleast1986"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love this design! Great reason to get it and the attention to detail on each object is insanely well done. ",
            "score": 1,
            "author": "jedixking98"
        },
        {
            "level": 0,
            "comment": "Jesus Christ this is the exact tattoo I was thinking about getting. Bravo",
            "score": 1,
            "author": "Coos-Coos"
        },
        {
            "level": 0,
            "comment": "This tattoo is so damn amazing ffs!!!!!",
            "score": 1,
            "author": "axilane"
        },
        {
            "level": 0,
            "comment": "Ah shit there goes my idea. \n\nEdit: I love the tattoo though. The line work is satisfying.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Nice four arm tat. ",
            "score": 1,
            "author": "whenthishappens"
        },
        {
            "level": 0,
            "comment": "This is such a cool concept!",
            "score": 1,
            "author": "agentfem"
        },
        {
            "level": 0,
            "comment": "I would love to have this!",
            "score": 1,
            "author": "justinanderson279"
        },
        {
            "level": 0,
            "comment": "Love it, great tattoo!  Cheers",
            "score": 1,
            "author": "Captn_Aubrey"
        },
        {
            "level": 0,
            "comment": "Right now there is only one thing that motivates me, literally only one, and it's traveling.",
            "score": 1,
            "author": "Erickjmz"
        },
        {
            "level": 0,
            "comment": "I want do something similar since im from the Caribbean and now live in the Rocky Mountains. \"Best of both worlds\" sort of theme. ",
            "score": 1,
            "author": "devil_dog_0341"
        },
        {
            "level": 0,
            "comment": "That's *really* fuckin' nice.",
            "score": 1,
            "author": "icallshenannigans"
        },
        {
            "level": 0,
            "comment": "That's really awesome, sweetheart!! What a lovely selection! ",
            "score": 1,
            "author": "candi_girl420"
        },
        {
            "level": 0,
            "comment": "dude this is SWEET. Its been a few years since my last tattoo and I think you've just pushed me over the edge",
            "score": 1,
            "author": "IdolBone"
        },
        {
            "level": 0,
            "comment": "I've been thinking about doing something similar! I love it.",
            "score": 1,
            "author": "pronounverbnoun"
        },
        {
            "level": 0,
            "comment": "Wow, I'm in love with this tattoo, amazing! ",
            "score": 1,
            "author": "1lyserg2"
        },
        {
            "level": 0,
            "comment": "I want to make some sort of Far Cry joke, but that ink is legit. ",
            "score": 1,
            "author": "zachatree"
        },
        {
            "level": 0,
            "comment": "That's pretty fucking cool",
            "score": 1,
            "author": "jsondergaard"
        },
        {
            "level": 0,
            "comment": "That is amazing ",
            "score": 1,
            "author": "sgtdarck5"
        },
        {
            "level": 0,
            "comment": "Love it!!!!! Really cool :D",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Hey! I got my first rib piece from that shop. They were pretty awesome. &lt;3\n\nYour tattoo is so lovely and detailed. ",
            "score": 1,
            "author": "cupcaikebby"
        },
        {
            "level": 0,
            "comment": "This is beautiful. I hope I can find a similar and meaningful idea.",
            "score": 1,
            "author": "InformationFetus"
        },
        {
            "level": 0,
            "comment": "wow thats a great design and work looks amazing!",
            "score": 1,
            "author": "rushingoat"
        },
        {
            "level": 0,
            "comment": "This is BADASS",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I love it!  This is exactly the kind of style I'd want if I ever decide to get inked myself.  Saving this one for later reference.  Thank you for sharing!",
            "score": 1,
            "author": "SnapshotNautilus"
        },
        {
            "level": 0,
            "comment": "I love this tattoo! I was actually planning on getting something pretty similar, maybe a bit larger, like a half sleeve size. But this is beautifully done! ",
            "score": 1,
            "author": "Nebulous_Fujiwara"
        },
        {
            "level": 0,
            "comment": "So fucking cool ",
            "score": 1,
            "author": "cajunmoonlight"
        },
        {
            "level": 0,
            "comment": "What places did ya go?",
            "score": 1,
            "author": "ademonlikeyou"
        },
        {
            "level": 0,
            "comment": "It is almost like you took the trip to justify a tattoo!",
            "score": 1,
            "author": "daveklem"
        },
        {
            "level": 0,
            "comment": "temporal partial copy \nhttps://m.imgur.com/a/uBKs6",
            "score": 1,
            "author": "vocalico"
        },
        {
            "level": 0,
            "comment": "love it",
            "score": 1,
            "author": "Ryeyo"
        },
        {
            "level": 0,
            "comment": "This looks great! What comes after the pine trees?",
            "score": 1,
            "author": "yukonwanderer"
        },
        {
            "level": 0,
            "comment": "Thinking about getting a similar style tattoo. Curious how this holds up with time with the shading in the waves and fine detail in the trees. Especially on an area that gets a lot of sun. DO you have any pictures of it now after 4 months?\n",
            "score": 1,
            "author": "E-ratic_Professional"
        },
        {
            "level": 0,
            "comment": "ahh looks awesome .. very tight ! ",
            "score": 1,
            "author": "Rick_n_Roll"
        },
        {
            "level": 0,
            "comment": "I love this style! It looks amazing! ",
            "score": 1,
            "author": "tulip92"
        }
    ]
}