{
    "id": "8bcc2z",
    "score": 40129,
    "title": "Finally got to do something creative with my ugly shoulder scar thanks to Chris Earnhart at Arcade Tattoo, CA.",
    "author": "SloDilf1493",
    "date": 1523401611.0,
    "url": "https://www.reddit.com/r/tattoos/comments/8bcc2z",
    "media_urls": [
        "https://i.redd.it/970qihh6s5r01.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "If you are visiting /r/tattoos for the first time, or visiting from /r/all, please be aware of ALL of the rules in the sidebar and stickied threads before posting. Common issues that WILL get you banned are any comments on personal appearance, any discussion about pricing, aftercare/medical advice or questions, and trolling.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tattoos) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "What’s your story about this scar and tattoo ?",
            "score": 1259,
            "author": "BernardRillettes",
            "replies": [
                {
                    "level": 1,
                    "comment": "My money is on arthroscopic surgery for the labrum or to correct instability after dislocation(s). Just a guess though!\n\nDope tattoo regardless! Have a scar along my collarbone after a break 2 years ago and always wanted to do something with it! Really like this one!\n\n\nEdit: based on everyone's replies this probably isn't from arthroscopic surgery for more minor and/or superior labral tears because they leave three separate, small scars; two anteriorly and one posteriorly.\n\nScars like this seem to be more indicative of surgery to stabilise the shoulder following repeated subluxations/dislocations like a Bankart repair (which if we were gonna be pedantic is still arthroscopic surgery of the labrum but is more related to anterior-inferior labral damage that allows the shoulder to dislocate). Really interesting to hear back from so many people who have had similar surgeries. Thanks for the replies!",
                    "score": 786,
                    "author": "iknowthatfagel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I had a Bankhart procedure done, and the scar looks identical, most injuries are fixed with a less invasive surgery, he tore it big or wore down his bone cup from many dislocations",
                            "score": 202,
                            "author": "sunshine_lax_bro",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "my right shoulder looks exactly the same. And in fact, its twinged a bit right now from a subluxation that seems to have pinched something in the process. Hurts like hell. Left shoulder has the \"three holes in front, one in back\" from the Orthroscopic procedure. ",
                                    "score": 42,
                                    "author": "capodecina2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I have the three holes in front, one in back thing on my left from a shoulder injury years ago. My labrum is torn in my right should also, but it hasn’t really affected my day to day until recently. I sneezed while driving the other day and it subluxed. Hurts like hell. \n\nI should probably get it fixed but i’m worried about the down time. I’m not 17 anymore and 6 months of no exercise would be awful. How long was your recovery for each?",
                                            "score": 17,
                                            "author": "BugOnARockInAVoid",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "6 months is kind of pushing it at least in my experience. When I had the labrum tear it actually coincided with a baseball player I was following, he had a tear early in the season and was able to make it back before the season ended. Anyway a guy like him showed that it was possible, so I used it as a mentality when I rehabbed. I had most of my mobility in the 4-5 week post op, I started rebuilding stability in months 2-3, months 3-5 of rehab I started to test my confidence with little bits of weight as a cheat outside of rehab and by 6 months that shoulder was the stronger of the two. It did come with challenges even in the first year I would lift and feel some odd discomfort but I was assured it was more likely scar tissue as it was structurally sound. I thought that I would have strange pains and aches with the shoulder but shoot I’m nearly 5 years removed from the shoulder repair and I haven’t had any bother.",
                                                    "score": 7,
                                                    "author": "belaveri1991",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "recovery? never. Its always going to be a weak spot. Especially in the gym. Oh sure, bench whatever, but shoulder exercises are practically out, and like you said - sneeze while driving and you are spending the next few days in misery. Mine didnt even really go anywhere, just must have twisted wrong - or even rolled over in my sleep and slept funny. Who knows?  \n\nIm not going to bother getting it fixed again. Im 45 and I dont need that downtime and the rehabilitation. Its easier to just suck it up and drive on until it works itself out. Until the next time, and the next. ",
                                                    "score": 9,
                                                    "author": "capodecina2",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "So just had a shoulder tendonesis to \"repair\" a torn labrum. I am 43 and they said that if you aren't in your 20's they rarely try to reattach or fix the labrum. Mine was torn so that when my bicep flexed it pulled on the tear. The tendonesis consists of the actually cutting the bicep tendon from the labrum and reattaching it with a screw into your upper arm. So if you can live with it.. live with it. The rehab took a year and it's still keeping me out of the gym other than to hit the treadmill, and just getting there took 6 months. ",
                                                            "score": 9,
                                                            "author": "boookworm0367",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I had the same repair, but a slightly different injury. I didn't have a labrum tear, instead my bicept was sliding out of the groove, causing it to pull on all my other muscles. So they moved the ucept, and scoped the shoulder. After the first three months of therapy I had hit a wall with my ROM (very little ROM), and ended up changing therapists. The new therapist has been brutal but in less than 3 months I have 98% of my ROM back, and we are working on strengthening. \n\nI agree completely that this has been a long hard road, but loking back I would do it again in a heartbeat.",
                                                                    "score": 3,
                                                                    "author": "ersogoth",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Every time I hear how Andrew Luck is going to come back at 100% from his labrum tear I scoff a little inside. Even with the best medicine money can buy, it will NEVER be 100 percent again. I mean the guy said he still hasn't thrown a football yet. What's it been 18 months since he hurt it. This shit is permanent. ",
                                                                            "score": 7,
                                                                            "author": "boookworm0367",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah, I know it won’t recover fully, but i’m only 25 and very physically active. I have like 75% mobility in the one I had repaired and it doesn’t impede my performance that much. I don’t expect any better from the other, but the torn one is starting to shift around all the time now. \n\nI was more asking how long it took after each before you could start exercising again? Even just running or light body weight upper body stuff.",
                                                            "score": 5,
                                                            "author": "BugOnARockInAVoid",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "easily 4-6 months. They say \"6 weeks\" but invariably you will do something to strain it or even roll over on it, which just hurts like hell and takes longer to heal.\n\nYou are 25? I would say do it, its a choice between getting it fixed where it will never really be 100% and some downtime you can recover from for the most part. OR continue to have periods of time where it randomly gets messed up and leaves you in pain and your arm practically useless for days on end, and gets worse over time to where it's happening more often than not. My age? meh...I dunno. But if I was your age, it wouldn't even be a question, and I would be getting it done right away. ",
                                                                    "score": 7,
                                                                    "author": "capodecina2",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Shit. 4-6 months is gonna suck, but that’s what I was thinking too. You’re right. I’ll probably get the ball rolling. No reason to put it off. \n\nAppreciate the input and hope yours starts feeling better soon.",
                                                                            "score": 4,
                                                                            "author": "BugOnARockInAVoid",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I'm 33, and tore my labrum in August. Went down a skate ramp for the first time a fucked up. Had surgery to repair it in October. I have two holes in the front and one in the back, and my surgeon was nice enough to avoid my tattoo. I was back to work as a bus driver in mid-December, and back to playing roller derby in February. The originally said that I would be in my immobilizer until the end of April. I just started moving gently when I felt like I could. Lots of ice. And ALWAYS going to my physical therapy appointments and doing my home exercises. Oh, and LOTS of water. I generally drink quite a bit, but started drinking only water after my injury. Being properly hydrated is one of the best things you can do for your recovery.\nHope everything goes as well for you as it did for me!",
                                                                                    "score": 6,
                                                                                    "author": "KittyTwister"
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I’ve gotten three latarjet surgeries on my shoulders. Similar scar to this. 4-6 months for sure until working out again but my problem was when I felt like I could lift again I’d go too hard and re hurt the shoulder. I had all of these surgeries between 15-18. \n\nBiggest advice is to take things slow. The better it heals now the better it will treat you in the future. I had to start looking at how my actions were going to affect me physically 20 years down the road instead of a few weeks down the road as I had been doing before.\nYou almost feel like you are invincible at that young of an age.\n\nAlso best thing that I ever did for shoulder recovery was yoga. Went from daily shoulder pain and having to take Vicodin everyday to pain free!\n\nWish you the best of luck with your endeavors. \n\n",
                                                                                    "score": 5,
                                                                                    "author": "Soonerforlife32",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Damn, this is pretty wild but I just got off the phone with my sister who is having the surgery tomorrow morning. Shoulder issues run on my father's side in my family. He had both sides worked on and my right side used to separate at least once a week. I learned my limits and began weight lifting which has kept it in socket for years now, barely.  My sister however dislocates hers in her sleep on a regular basis and needs the surgery or it's going to destroy her later in life.",
                                                                                    "score": 4,
                                                                                    "author": "Coachcrog"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Hey don’t think that way . I had labrum repair surgery along with some bone shaving in my right shoulder. Since surgery and rehab that has actually become my strong shoulder. ",
                                                                    "score": 5,
                                                                    "author": "belaveri1991"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "6-18  months homie.\n\nI had a torn labrum for years from hockey and left it until the year I broke my clavicle and reached my deductible. During PT they noticed the shoulder issue an MRI showed it was 2/3 torn.\n\nAnyway, I had the surgery and it hurt like hell. I did PT and followed instructions. Spent a year off the ice and I don’t remember any specific times I hurt it but it’s hockey and falls happen. \n\nSo 18 months of no sleeping on that side and the shoulder actually feeling worse I went back and he sends me for another and guess what? I tore the last 1/3 and had to have another one. That’s three years ago and I’m so terrified of hurting it again I haven’t played since. \n\n6-18 months and I would caution you that 6 months isn’t enough. \n\nAnother thing, it doesn’t feel great still to this day and only in the last year could I sleep on it. I have a very high pain threshold and this surgery fd my shit up. \n\nI wouldn’t recommend it to anyone if I’m being honest.",
                                                    "score": 2,
                                                    "author": "Eloping_Llamas",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes same here. It's actually a sexy scar. Girls think I got stabbed. Then I stab them with my penis and pee inside them as is the accepted ritual of sex. End communication. ",
                                    "score": 14,
                                    "author": "smashsmash341985"
                                },
                                {
                                    "level": 3,
                                    "comment": "I had the same surgery, but mine are four dot sized scars a little smaller than a dime. ",
                                    "score": 4,
                                    "author": "GlowInTheDarkNinjas",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Mine was a Mumford Procedure for a separated shoulder, same scar as well.",
                                    "score": 2,
                                    "author": "robambro"
                                },
                                {
                                    "level": 3,
                                    "comment": "I dislocated my shoulder 4 years ago, it “slips” about once a month under certain pressure or with a certain movement similar to when I dislocated it. What’s the surgery like? What’s the down time? I’m a welder and need use of my shoulder. ",
                                    "score": 2,
                                    "author": "SomeTexasRedneck",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My shoulders have been dislocating regularly since I was in my late teens.  I'm now in my early 30s.  It's always uncomfortable when it happens, is sore for a few days, and really just frustrates me because it keeps me from getting more aggressive with things that I love (rock-climbing, throwing a football, etc.) and occasionally even performing mundane tasks.\n\nAlso wondering what kind of surgery I should be looking into.",
                                            "score": 2,
                                            "author": "--Peregrine--"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Scar looks too big for arthro surgery. I got scoped on both shoulders and my scars are two smaller scars on each side. /u/sunshine_lax_bro's explanation makes sense.",
                            "score": 21,
                            "author": "justinbreaux"
                        },
                        {
                            "level": 2,
                            "comment": "I have the exact same scar from a Latarjet procedure done to replace my labrum from 30+ dislocations. My sister and dad have smaller arthroscopic scars from a Bankart procedure also from shoulder dislocations. ",
                            "score": 16,
                            "author": "dukersdoo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How did you dislocate it so many times? Sorry if too personal",
                                    "score": 9,
                                    "author": "hugitoutguys",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "First dislocated my right one (one I had surgery on) falling on it playing soccer. Then with every dislocations it just came out easier and easier. Sneezing, sleeping, tying my shoe, it got pretty absurd.  Im too stretchy ",
                                            "score": 21,
                                            "author": "dukersdoo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You should see if you have Ehlers-Danlos Syndrome, dislocations, flexible joints and stretchy skin are some of the easier to find symptoms ",
                                                    "score": 13,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah there’s definitely something fucky with my body. Also tore my ACL skiing, always rolling my ankles, and big valgus angle on my forearms. Wohoo",
                                                            "score": 4,
                                                            "author": "dukersdoo",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Definitely look into it, I was just diagnosed a few months ago at 30",
                                                                    "score": 6,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Did you have similar problems before? What has changed since you’ve been diagnosed? ",
                                                                            "score": 4,
                                                                            "author": "dukersdoo",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I had dislocations (not as many as you) multiple joint pain then I found out I had a mitral valve prolapse. My spine is loose and weak so I get terrible headaches, back pain, and other stuff. I am a very mild case and likely only found out because I work for a top rated oncologist in NYC he sent me to a few specialists and checked enough boxes on the list. ",
                                                                                    "score": 2,
                                                                                    "author": "[deleted]"
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Has that diagnosis lead to any form of treatment. I also am gumby.",
                                                                            "score": 3,
                                                                            "author": "Howdoyouusecommas",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "My dad was reaching for his seatbelt and dislocated the shoulder opposite the one he was reaching with. I was always a little thrown by that",
                                                    "score": 1,
                                                    "author": "RichardCity",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah I once shot a full court basketball shot with my right arm and my left shoulder dislocated. And I didn’t even make the shot",
                                                            "score": 5,
                                                            "author": "dukersdoo"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "[this boxing clip is a good example](https://www.reddit.com/r/Sportsmanship/comments/6w0bbb/boxer_relocates_opponents_shoulder/?st=JFUH9Y9X&amp;sh=398a27ac) ",
                                                            "score": 3,
                                                            "author": "dukersdoo"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I also had severe instability in my shoulder from baseball and by extension football.\n\nMy surgeon used a golf tee analogy for me: the socket is the golf tee and the ball of your humerous is the golf ball. Damage to the tee results in any wind knocking the ball off i.e. a dislocation/subluxation.\n\n\nMine should would come out of place throwing, tackling, sleeping on my stomach with my arm under my face; basically anytime my elbow was above my shoulder.\n\n It is generally repaired with a bone graft from the coarcoid process.",
                                            "score": 1,
                                            "author": "Captingray"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That's a really big scar though even for shoulder surgery. My brother had surgery on his labrum and the surgeons made like 3 small incisions.",
                            "score": 11,
                            "author": "gzzh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I had a biceps tenodesis done in February. Three small scars (front, top, back) and one 2 1/2 inch long one on the front of my shoulder.",
                                    "score": 1,
                                    "author": "SandyDFS",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I had surgery to repair a torn pectoral tendon, and my scar looks similar. Could be that. ",
                            "score": 7,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Roger that. Judo throw recipient was mine. Yours? ",
                                    "score": 3,
                                    "author": "Lance_Henry1",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Yup got one too, leaves a big ass scar. I am betting torn pec. Mine was down Jan 5th if this year. ",
                                    "score": 2,
                                    "author": "austic"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'm getting that surgery in a few months more than likely.... why did this make me so nervous ",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "My scar is a little lower and not as wide, but had the surgery 20 years ago so it is not as harsh as it used to be. \n\nThe recovery was painful but I was just glad the dislocations stopped. I've had some pretty bad injuries in my life, compound fracture...near fatal motorcycle accident but there's nothing like the sickening pull of a dislocation..the sort of pain your mind panics when experiencing. \n\nA week before the surgery I went to flick on a lamp, large lampshade and had to sort of do a down and up motion.\n\nThen WHOMP. Its dislocated and I am screaming for help (was 17) and I was so tired of it happening I just sat there crying until my Grandpa ran in and tried to force it back into the socket. It took a while.",
                            "score": 2,
                            "author": "Morning_Star_Ritual",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I had my labrum repaired and they did it all with 4 small incisions.  I had torn 3/4 of it too so no small tear",
                            "score": 2,
                            "author": "_miles_teg_",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Ok so now that the comments have slowed down. The comment about the labrum repair and arthroscopic surgeries were dead on. Some jack wagon botched 2 arthroscopic surgeries at which time my shoulder dislocated enough times that my should joint wore away so had to get bone bolted in there.  Scars been there for a few years now and it’s stable so I wasn’t afraid to get it drawn on and not just get cut up again.\n\nHow it happened: shoulder dislocated more times than I could count but originally it was from mma and lifting\n\nStory for the tattoo: I’m not a commercial diver but I’ve been diving since high school and I’m currently working towards getting my master diver. All my other tattoos revolve around the sea or diving so this was the 1st thing that came to mind. Also do minor metal working on my spare time.\n\nWill the hair grow back: yes I got the tattoo a couple of weeks ago so the kelp is currently growing back. Thankfully it’s not too thick in that spot so the diver shows up great\n\nSorry to the dude posing as my lawyer, that shit was hilarious\n\nThanks to all the positive feedback. You guys are awesome.",
                    "score": 49,
                    "author": "SloDilf1493",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Reminds me of the comic \"The Underwater Welder\" by Jeff Lemire. Basically a twilight zone episode about fatherhood. It's amazing if you're interested. ",
                            "score": 2,
                            "author": "letloosethekraken"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not gonna lie, OP's lack of response leads me to believe this might not be OC.",
                    "score": 32,
                    "author": "nopointinlife1234",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Hello,\n\nI am  OPs legal counsel and will speak on his behalf about said scar and tattoo.\n\nMy client pleads the 5th and will not respond to questioning about said scar and tattoo.\n\nThank you,\n\nLawyer.",
                    "score": 95,
                    "author": "TheRealCIA",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's treason then.",
                            "score": 16,
                            "author": "Stonn"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It bothers me OP didn’t reply to the top comment here.",
                    "score": 102,
                    "author": "Silent_As_The_Grave_",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The other replies all point to major procedures, but I have a similar scar on my shoulder that was from a melanoma removal",
                    "score": 5,
                    "author": "TWS85"
                },
                {
                    "level": 1,
                    "comment": "That looks like a hypertrophic or keloid scar. Any issues in getting a tattoo if your skin is prone to this kind of scarring? I was told there was thus scared off tattoos by a doctor ",
                    "score": 2,
                    "author": "palmallamakarmafarma"
                },
                {
                    "level": 1,
                    "comment": "Probably a latterjet procedure.\n\nSource: matching scar",
                    "score": 1,
                    "author": "Captingray"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a friend of mine said after my recent surgery, scars are just tattoos you don't pay for.",
            "score": 684,
            "author": "h2g2Ben",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well in a way you pay for them (medical bills) but more like tattoos you don’t design. ",
                    "score": 267,
                    "author": "Red_fire_soul16",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Only if you live in a 3rd world country like the US. Free healthcare FTW!",
                            "score": 319,
                            "author": "Conspireignite",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In Brazil we have \"\"\"\"\"free\"\"\"\"\" healthcare. It sucks. In practice, many people still have to pay loads of money for health insurance/medical bills. Unfortunately, FTL :(",
                                    "score": 18,
                                    "author": "Felipe_Smith2469"
                                },
                                {
                                    "level": 3,
                                    "comment": "Taxes blah blah blah",
                                    "score": 37,
                                    "author": "PowerTrippinModMage",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "yay lower taxes and unaffordable healthcare",
                                            "score": 90,
                                            "author": "WildVelociraptor"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 80,
                                            "author": "[deleted]",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "How did you know?  😂",
                                            "score": 3,
                                            "author": "Red_fire_soul16"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Ahhh isn’t that the truth unfortunately. Healthcare is a business in the “good” ole USA. Not really a way to change that now that they only see dollar signs instead of real patients. ",
                                    "score": 20,
                                    "author": "Red_fire_soul16",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oof. Honestly. This past winter I got a case of bronchitis so nasty it was hard to leave my dorm. I barely ate. One day I woke up at 5pm, body so weak I was sure closing my eyes would mean I’d never open them again. So naturally, I did what any rational American would do - deliriously called an über to take my feverish ass to the hospital cuz using our emergency services costs like a tenth of my yearly tuition. \n\nOne day I’m just gonna die cuz I don’t wanna deal with our bullshit medical costs. Yay America, land of appalling expenses. ",
                                            "score": 36,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "At least you get it. As a Canadian, I’ve extolled the virtues of our health system only to be downvoted into oblivion by “MURICANS” who were clearly much more free than I am. ",
                                                    "score": 24,
                                                    "author": "speedkillz",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "yeah they seriously don't understand it's wild. Like, if I'm sick I can jsut go to the hospital and they take care of me.  \n\nyes, if it's a cold I will wait around and they will get to me 12 hours later. but if it's serious they fix that shit. for free.  \n\nAnd they always argue taxes, but thing is...you don't have to account for taxes. it's an expense the same way time spent asleep instead of working is an expense...it's whatever fucking number it is and you just live with it. doesn't affect your day to day life at all.",
                                                            "score": 9,
                                                            "author": "rumballytron"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "What university doesn't mandate students have health insurance, whether through them or otherwise? I know my state university does.",
                                                    "score": 10,
                                                    "author": "1sagas1",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That's mandated? I've never heard my university bring up anything about that. ",
                                                            "score": 7,
                                                            "author": "[deleted]"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I had emergency only (emergent care only?) insurance and the university had a health center where you could see a doctor for free. ",
                                                            "score": 3,
                                                            "author": "twitrp8ted"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Even with insurance, not everything is covered. Out of pocket costs will still bite you in the ass, severity depending on what kinda plan you have. My college has a student health center but the resources there are pretty lacking and for emergency care you need to go to the local hospital",
                                                            "score": 2,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah! Hurray for two year waiting lists!\n\nHonestly, nowhere has a decent healthcare system figured out. ",
                                    "score": 2,
                                    "author": "iWantToBeARealBoy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Here in Aus it's pretty alright. I can get doctors appointments and ultrasounds bulk billed meaning I don't have to pay. I even got a cat scan bulk billed ($800 AUD upfront). Obviously not everyone is eligible but I'm a young student with health problems. But anyone who doesn't earn a specific amount is eligible for health care cards and bulk billing. Saves lives man. ",
                                            "score": 3,
                                            "author": "[deleted]"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "In Canada we still have a private sector so you can pay and have scans, surgeries, specialist appointments, etc sooner and it’s still cheaper than the US. If I wanted to see a specialist tomorrow I can pay $1000 and see whoever and whenever, phone calls, etc for a year and after the year I am just put on a billing list and see them in the public sector (source: have done this) where, honestly, I still have barely any wait time if there is any. There’s definitely drawbacks, it’s not a flawless system by any means, but as someone with a chronic illness who has had excellent, swift care, I have very few complaints if any.  (i 100% get that this is anecdotal though and you will have people on the opposite side because they’ve had a horrible experience with the system). ",
                                            "score": 2,
                                            "author": "-leeson"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Idk I have a few big scars (most definitely not that big lol) that I didn’t pay for medical care for, although I probably should have haha. Had a horse doctor stitch me up once though lol worked on his ranch and they figured stitches are stitches ",
                            "score": 17,
                            "author": "13pts35sec",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey whatever works. I’m guessing besides needing stitches your internals were okay so again whatever works. ",
                                    "score": 4,
                                    "author": "Red_fire_soul16"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Only in the 3rd world. Everyone else gets them free at the point of use. ",
                            "score": 4,
                            "author": "Chair_Toaster"
                        },
                        {
                            "level": 2,
                            "comment": "If we’re getting technical, there are places in the world where you don’t personally pay for healthcare.",
                            "score": 4,
                            "author": "CaliCat000"
                        },
                        {
                            "level": 2,
                            "comment": "Medical bill?",
                            "score": 2,
                            "author": "Beanzii"
                        },
                        {
                            "level": 2,
                            "comment": "Well, I live in Israel, I've had surgery, broken legs and arms, and have been hospitalized countless times, and I've paid nothing.\n¯\\_(ツ)_/¯\nAnd to top it all off, I'm not even supposed to be here, they occupied us and keeping us by force, thank God for that, otherwise I'd have to go back to Syria and God knows how shitty that place is.",
                            "score": 2,
                            "author": "miar2704"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh I paid alright! Fortunately got hurt while I had decent health insurance or I would be paying more then it cost to tattoo my whole body! ",
                    "score": 5,
                    "author": "Tinyrobotzlazerbeamz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was thinking about a steam train going up my leg scar... this might inspire that!👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻",
            "score": 133,
            "author": "anemptykoolaidcup",
            "replies": [
                {
                    "level": 1,
                    "comment": "I broke my ankle last year.  Been thinking of making it my first tattoo as well i like the welder and a locomotive idea.",
                    "score": 14,
                    "author": "Alextryingforgrate"
                },
                {
                    "level": 1,
                    "comment": "I have a scar on my chest that I want to get Joe the camel with his mouth around it so it looks like he's smoking it",
                    "score": 24,
                    "author": "sasquatch9301"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’s not an ugly scar, it’s a badass scar (that you just made even more badass).",
            "score": 176,
            "author": "pandawomp",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Underwater welding is the most dangerous job on earth or so I hear",
            "score": 108,
            "author": "MataUchi",
            "replies": [
                {
                    "level": 1,
                    "comment": "I work as an commercial diver in Norway. Welding is one of the most dangerous jobs we do, but the most dangerous i would say is underwater cutting (oxy-arc)(cutting metal at 7000°C). When you are cutting metal underwater it will release a gass that can explode if ignited, and if you are not experienced enough with drainage of gas, it will gather in spaces and most likely explode. Most likely you will blow your eardrum out, but in worst case scenario you will be knocked out or even die by the explosion.",
                    "score": 51,
                    "author": "CutiePieNOR",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Holy shit that sounds really scary, I would not be able to do that.\n\nBtw your English is really good",
                            "score": 14,
                            "author": "MataUchi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I bet that's because he listens to English audiobooks to combat boredom during underwater cutting and welding ;)\n\nEdit: some call him... the diver Stig ;)",
                                    "score": 7,
                                    "author": "CreamyCoffee"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 61,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was for the workers repairing the Death Star.\n\nBut that was in a galaxy far, far away...",
                            "score": 17,
                            "author": "jam_rok"
                        },
                        {
                            "level": 2,
                            "comment": "Deep galaxy welding is the most dangerous job in the nebula.",
                            "score": 5,
                            "author": "onenastyenemy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 13,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I saw that really terrifying old-timey documentary/safety video about the subject",
                            "score": 3,
                            "author": "SpaceShipRat"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Showed this to my boyfriend who has a scar from his pacemaker surgery. Made him smile!",
            "score": 67,
            "author": "pixeltune",
            "replies": [
                {
                    "level": 1,
                    "comment": "Woo! Another hearty starty member! We have jackets! ",
                    "score": 59,
                    "author": "Oodalay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Showed this comment to my father who sells and helps implant pacemakers, he got a good laugh out of \"hearty starty\" and said he's gonna start calling them that to annoy his co-workers, so big ups from someone in the industry for the nickname 👍",
                            "score": 34,
                            "author": "Jestola"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Love me some under water welding tat art !",
            "score": 114,
            "author": "jonny72091",
            "replies": [
                {
                    "level": 1,
                    "comment": "Awfully specific...",
                    "score": 12,
                    "author": "an_angry_Moose",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "God I love scars...and i love this tattoo ",
            "score": 74,
            "author": "crunknizzle",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 11,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Happy 🍰 day my dude!",
                    "score": 5,
                    "author": "voicefromthecloset",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "thanks! ",
                            "score": 2,
                            "author": "crunknizzle"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Cake day!",
                    "score": 7,
                    "author": "DomFonzAlf"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Really good idea, really well done, and it works very well with your scar. That's a fucking cool tattoo, man!",
            "score": 29,
            "author": "HookDownSmokeUp",
            "replies": []
        },
        {
            "level": 0,
            "comment": "He’ll be diving in the weeds when that chest hair grows back....poking his head out...welding. Killer ",
            "score": 50,
            "author": "kirk_nash4",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Why is he welding his hand",
            "score": 5,
            "author": "that1azian",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My dad was an underwater welder with the Seabees back in the day. He’s going to love this. \n\n(I have to print off a picture and mail it to him.) ",
            "score": 28,
            "author": "udayserection"
        },
        {
            "level": 0,
            "comment": "/r/Subnautica ",
            "score": 10,
            "author": "Logan8686"
        },
        {
            "level": 0,
            "comment": "The scar is badass, not ugly.",
            "score": 17,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I love this! I just wish that SPG wasn’t loose...",
            "score": 5,
            "author": "madmansmarker",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's probably broke...\n\nAs a former Ironworker I know that anything less than solid steel is breakable. Even solid steel gives it up if you try hard enough. ..",
                    "score": 3,
                    "author": "Tekmantwo",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shouldn't the welder be at the top or bottom of the scar?",
            "score": 9,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Maybe it's just me, but I have never been put off by scars. With that said, that's a beautiful tattoo man.",
            "score": 6,
            "author": "VaultDweller108"
        },
        {
            "level": 0,
            "comment": "Awesome! I've seen better welds though 😉",
            "score": 3,
            "author": "wheelinfullsize",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gotta be a weldor, aintcha?..lol.",
                    "score": 2,
                    "author": "Tekmantwo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Might not be allowed but I feel like this belongs in r/welding. That's a nice bead. ",
            "score": 3,
            "author": "GrizFyrFyter1"
        },
        {
            "level": 0,
            "comment": "It's not ugly, scars are beautiful. That's a rad tat though. ",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Does hair grow back after a tattoo? I think this will actually look cool if it does as the hair might add to the underwater effext",
            "score": 6,
            "author": "HaHaSoRandom",
            "replies": [
                {
                    "level": 1,
                    "comment": "You can always say it's a tattoo with 3D algae :D",
                    "score": 2,
                    "author": "wakerdan"
                },
                {
                    "level": 1,
                    "comment": "The hair is fine. They just shave the area so the hair doesn’t get in the way during the tattoo process. It’ll grow back",
                    "score": 2,
                    "author": "-Unnamed-",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awesome choice! Complements the scar well, tbh.",
            "score": 3,
            "author": "chungustheskungus"
        },
        {
            "level": 0,
            "comment": "I think your scars look fucking awesome dude. Sweet tat too ",
            "score": 3,
            "author": "frumpypump"
        },
        {
            "level": 0,
            "comment": "First off, no scars are ugly. They tell a story and are unique to the person .  Second, bomb tattoo :)",
            "score": 3,
            "author": "Shelbutter"
        },
        {
            "level": 0,
            "comment": "this tattoo makes me want to “dive” into the history of that scar!",
            "score": 2,
            "author": "beat_theheat"
        },
        {
            "level": 0,
            "comment": "SICK!",
            "score": 2,
            "author": "spookychimp"
        },
        {
            "level": 0,
            "comment": "Creative. Have a pretty gnarly scar myself and have been trying to come up with a good idea - won’t steal this one but it certainly provides inspiration!",
            "score": 2,
            "author": "StagBoyz"
        },
        {
            "level": 0,
            "comment": "This is badass",
            "score": 2,
            "author": "Unlikely-Candle2439"
        },
        {
            "level": 0,
            "comment": "That’s a commercial diver broco burning a shoulder and it’s awesome",
            "score": 2,
            "author": "koyoteturtle"
        },
        {
            "level": 0,
            "comment": "Love it :)",
            "score": 2,
            "author": "CoffeeGhosts"
        },
        {
            "level": 0,
            "comment": "Deep sea as fuck",
            "score": 2,
            "author": "DEEP_SEA_MAX"
        },
        {
            "level": 0,
            "comment": "nice!",
            "score": 2,
            "author": "former_human",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Damn...that shit's cool, yo!",
            "score": 2,
            "author": "peanutbutterandsocks"
        },
        {
            "level": 0,
            "comment": "Be careful about delta P please.",
            "score": 2,
            "author": "iamanomynous",
            "replies": [
                {
                    "level": 1,
                    "comment": "when it's gotcha, it's gotcha!",
                    "score": 2,
                    "author": "greydamask"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That scar is badass",
            "score": 2,
            "author": "CranberryVodka_"
        },
        {
            "level": 0,
            "comment": "As soon as I saw this I looked down at my appendix scar...🤔",
            "score": 2,
            "author": "Snosnake0"
        },
        {
            "level": 0,
            "comment": "That is utterly awesome!",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "r/subnautica ",
            "score": 2,
            "author": "supercobra78"
        },
        {
            "level": 0,
            "comment": "My dad was a diver. He is gonna love this. Great choice friend. ",
            "score": 2,
            "author": "EthiopianKing1620"
        },
        {
            "level": 0,
            "comment": "this is so sick, fuck",
            "score": 2,
            "author": "dnieto2003"
        },
        {
            "level": 0,
            "comment": "Ever read The Underwater Welder by Jeff Lemire?  Its a terrific graphic novel with artwork similar to that of your new tattoo (looks dope btw).",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That book is awesome and so is this tattoo. Lemire is fucking excellent at building character and sparsely compelling worlds/narratives.",
                    "score": 2,
                    "author": "OKzombie",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I d rather believe that it is a beautiful scar. Awesome creative tattoo. ☺",
            "score": 2,
            "author": "steamingsilver"
        },
        {
            "level": 0,
            "comment": "Cicacare will totally flatten and take away redness of that scar. The original and medical-grade scar reduction patch.",
            "score": 2,
            "author": "MyScarDissapeared"
        },
        {
            "level": 0,
            "comment": "This is so cool!\n",
            "score": 2,
            "author": "wil"
        },
        {
            "level": 0,
            "comment": "Oh man, this makes me think how cool it would be to have it be a Big Daddy from Bioshock. Not saying yours isn’t cool OP. It totally is! ",
            "score": 4,
            "author": "Knightwolf75"
        },
        {
            "level": 0,
            "comment": "Dude you might have jumped the gun on this one. I have a scar on my shoulder too and it was ugly for a few years but now it’s hardly noticeable :p",
            "score": 2,
            "author": "HIs4HotSauce"
        },
        {
            "level": 0,
            "comment": "That's great fella. Didn't even notice the scar. #nailedit ",
            "score": 4,
            "author": "trcr3600"
        },
        {
            "level": 0,
            "comment": "Do hairy people keep their tattoos shaved?",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't.\n\nSo, inferring from a data set of 1: No.",
                    "score": 7,
                    "author": "leglesslegolegolas"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;have ugly scar \n\n&gt;decide to get tattoo 5 times it’s size to make scar look cool \n\n Oh, Reddit. You never cease to amaze me.....",
            "score": 5,
            "author": "whycantIfast"
        },
        {
            "level": 0,
            "comment": "Uhh why is that tan line so weird? ",
            "score": 1,
            "author": "MasterCheeef",
            "replies": [
                {
                    "level": 1,
                    "comment": "Prolly cuz he's been wearing a brace during recovery and PT, they really help suck your shoulder in and let you confidently build muscle back up post-op. The neoprene sleeve contours like that, plus he looks more freshly burnt than tan, could've happened over a sunny weekend",
                    "score": 3,
                    "author": "sunshine_lax_bro"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Normally do not like tatts but this one seems to ahve a purpose and looks nice.",
            "score": 2,
            "author": "aussiequestions"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Beauty is in the eye of the beholder. ",
                    "score": 3,
                    "author": "cupcakegiraffe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great idea! :)",
            "score": 1,
            "author": "Pentosin"
        },
        {
            "level": 0,
            "comment": "Great work! ",
            "score": 1,
            "author": "Deubelbeiss"
        },
        {
            "level": 0,
            "comment": "Badass ",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Amazing",
            "score": 1,
            "author": "thatgaycurt"
        },
        {
            "level": 0,
            "comment": "That’s fucking awesome",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "That's a great idea!",
            "score": 1,
            "author": "shreddah808"
        },
        {
            "level": 0,
            "comment": "Wicked awesome dude! The thought never even crossed my mind that someone would incorporate a scar like this. Really cool.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Wow! That's pretty awesome! Great way to incorporate your non-ugly shoulder scar! ",
            "score": 1,
            "author": "fyretech"
        },
        {
            "level": 0,
            "comment": "That's awesome!",
            "score": 1,
            "author": "GingerBeast81"
        },
        {
            "level": 0,
            "comment": "That is so fuckin baller ",
            "score": 1,
            "author": "imighthaveachode"
        },
        {
            "level": 0,
            "comment": "Nice!! ",
            "score": 1,
            "author": "rebeccalul"
        },
        {
            "level": 0,
            "comment": "I never thought I’d see a commercial diving tat. Came out great, dude. ",
            "score": 1,
            "author": "animalph4rm"
        },
        {
            "level": 0,
            "comment": "Yeah, this is pretty cool",
            "score": 1,
            "author": "DudeCrabb"
        },
        {
            "level": 0,
            "comment": "This is a great idea",
            "score": 1,
            "author": "blizzardwizard88"
        },
        {
            "level": 0,
            "comment": "That tattoo is bad ass but so is your scar! This looks amazing. ",
            "score": 1,
            "author": "Vampchic1975"
        },
        {
            "level": 0,
            "comment": "This is my fav so far! ",
            "score": 1,
            "author": "EnergyUnicorn"
        },
        {
            "level": 0,
            "comment": "I have scars of random slashes on my legs I want tattoo ideas for but idk what would go good with/over them",
            "score": 1,
            "author": "grinder1999xxxx"
        },
        {
            "level": 0,
            "comment": "This is awesome, man! Great idea ",
            "score": 1,
            "author": "zachwithahhhh"
        },
        {
            "level": 0,
            "comment": "Very cool!",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I love this! The tattoo is fantastic and plays off that scar so well! Wish I had a cool scar for my tattoos...",
            "score": 1,
            "author": "Koyotesan"
        },
        {
            "level": 0,
            "comment": "This is awesome, I wanna figure out something I can do with the scar I have from back surgeries, challenge is doing so without also ending up with a tramp stamp haha",
            "score": 1,
            "author": "Nuklhed89"
        },
        {
            "level": 0,
            "comment": "Your shoulder scar isn't ugly, it's beautiful, and so are you.",
            "score": 1,
            "author": "Mellowde"
        },
        {
            "level": 0,
            "comment": "That looks very good",
            "score": 1,
            "author": "friendlessboob"
        },
        {
            "level": 0,
            "comment": "Dude I love this. I have a fascination with divers and astronauts. I also have a little over four feet of surgical scars. I hope you don’t mind if I gank the concept a bit. I wouldn’t do the same thing. ",
            "score": 1,
            "author": "bicyclejawa"
        },
        {
            "level": 0,
            "comment": "That's genius yo",
            "score": 1,
            "author": "smokedopenotcoke"
        },
        {
            "level": 0,
            "comment": "this things sick dude, props to the artist",
            "score": 1,
            "author": "congratulations-tom"
        },
        {
            "level": 0,
            "comment": "You should post in /r/scuba",
            "score": 1,
            "author": "CaptLukeHarkness"
        },
        {
            "level": 0,
            "comment": "Nicely done",
            "score": 1,
            "author": "GlitterKatt"
        },
        {
            "level": 0,
            "comment": "Sick idea and artwork!",
            "score": 1,
            "author": "dumbbunny714"
        },
        {
            "level": 0,
            "comment": "Badass!",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "what an awesome idea!! that would be a sick chest piece.",
            "score": 1,
            "author": "flyingtoasterfluff"
        },
        {
            "level": 0,
            "comment": "Very cool",
            "score": 1,
            "author": "adventurousreading"
        }
    ]
}