{
    "id": "cu63q1",
    "score": 42098,
    "title": "This truck taking a really tight corner with a long trailer",
    "author": "VoschNickson",
    "date": 1566519350.0,
    "url": "https://www.reddit.com/r/BetterEveryLoop/comments/cu63q1",
    "media_urls": [
        "https://v.redd.it/hsvycy6qc3i31"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "That was really satisfying god damn",
            "score": 2659,
            "author": "YouHeardBoutPluto",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hell yeah it was. \n\nThat dude has got confidence. And rightfully so.",
                    "score": 801,
                    "author": "IT_dood",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's nice to see a trucker who actually knows how to drive his rig.",
                            "score": 410,
                            "author": "PilotAlan",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "At one of my earlier jobs we needed to ship a piece of an airplane and the only way to do it was with a big rig.  We were on a pretty small GA airport that wasn't really equipped to get this giant trailer to our hangar, but there was a way.  I asked the truck driver if he could back up the trailer through a perilous course of chain link fence and gravel and I'll never forget his response.  He said, \"I can do magical things with this bad boy\", and then he proceeded to back that trailer right up to our hangar no problem.\n\nFucking balls on that guy",
                                    "score": 431,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I want to see a version of Baby Driver with this guy and his truck instead.",
                                            "score": 148,
                                            "author": "Only_Mortal",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Baby Truck Driver",
                                                    "score": 69,
                                                    "author": "Justokmemes",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Baby Trucker",
                                                            "score": 44,
                                                            "author": "AppleBerryPoo",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Do doo do do doo",
                                                                    "score": 3,
                                                                    "author": "Elliminist"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I wanna see a sequel with a litteral 2 year old driving a semi.",
                                                            "score": 12,
                                                            "author": "rreighe2",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "So does Kevin Spacey",
                                                                    "score": 4,
                                                                    "author": "paulieT860",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Oof",
                                                                            "score": 2,
                                                                            "author": "rreighe2"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Tonka Truck Driver",
                                                            "score": 7,
                                                            "author": "Ds-Sisman"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That story would end better if he took out half the fences. Something like \"He then proceeded to knock down 3 posts and rip 30 feet of fence off its posts. The fuckin balls on that guy.\"",
                                            "score": 64,
                                            "author": "Legionof1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 9,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "As someone who got their cdl a few weeks ago my response would be.....we are about to find out. The experienced guys in my fleet are insane. They squeeze our trucks into some extremely tight spots",
                                            "score": 7,
                                            "author": "mwdiver9",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I worked with bands as a tour manager, tour bus level. We would often pull a trailer for the gear. One driver I worked with was like a Beethoven of driving, he could back up with a trailer in the most effortless way, it seemed like he never even looked in his mirrors to do it. I asked him how the fuck he did that, his reply was priceless: \"All you have to do is keep the trailer behind you.\" Duh, silly me.",
                                            "score": 5,
                                            "author": "wormee"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It takes quite a bit of confidence, and a whole bunch of spatial recognition.",
                                            "score": 3,
                                            "author": "junkyard_robot",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I used to say \"buddy I'll put this fucker on the roof if that's where you want it\"",
                                            "score": 3,
                                            "author": "maybejakkinit"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "One trailer is easy, try two: https://www.youtube.com/watch?v=ynypBJvlGRU",
                                            "score": 2,
                                            "author": "nscale"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "My dad drove truck for something like 40 years, and it was always a family joke that he could drive with a 53 footer better than a sedan.\n\nIt really does seem to be a lost art.\n\nEdit: I removed the damn apostrophe, but I'm leaving the truck singular!",
                                    "score": 41,
                                    "author": "CaLLmeRaaandy",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "53’ means foot, you don’t need the footer clarification",
                                            "score": 15,
                                            "author": "Chris_RS",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah I don't know why I did that. Also I didn't downvote you.",
                                                    "score": 12,
                                                    "author": "CaLLmeRaaandy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Now tell us why you used singular truck in the first setence.\n\nweird.",
                                                            "score": 6,
                                                            "author": "bumblebritches57",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I'm a small town mo-ron.",
                                                                    "score": 11,
                                                                    "author": "CaLLmeRaaandy",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "But that’s how it’s acceptably referred to “driving truck”, not “driving trucks”, or “driving a truck”.",
                                                                            "score": 13,
                                                                            "author": "RuthlessIndecision",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Can confirm.\n\nSource: I drive truck.",
                                                                                    "score": 5,
                                                                                    "author": "[deleted]"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I got a lift from a tow truck (those big ass ones) driver once when my car pooped out on me. I asked him how it felt at the end of the day when he would get to drive his car and he said it felt weird. He said after driving the truck for 12 hours a day, almost everyday, he could maneuver it better/easier than his little sedan.",
                                            "score": 2,
                                            "author": "el_chupanebriated",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "When I drove, I spent all day in an automatic transmission semi truck with a full length trailer, then got out and drove home in my manual transmission fiat. I got so much shit for not being able to back my fiat into a parking spot straight.",
                                                    "score": 2,
                                                    "author": "pillowcats"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I worked at a Walmart in Canada as the reciever and the amount of new drivers they had was insane. People not able to back up, hitting trailers in the other loading bays, not chocking up, plus so many things I cant even list.\n\nThe worst was a dude took out a concrete post after 30 mins of trying to back into the loading dock and destroyed the door of the truck so we couldn't unload it. He dragged it into the parking lot and had to call a tow for a 56' trailer",
                                    "score": 7,
                                    "author": "untapped-bEnergy"
                                },
                                {
                                    "level": 3,
                                    "comment": "MOST of us know how to handle our rigs. Meanwhile MOST of y'all little guys don't seem to understand the dynamics of trucks, their capabilities, and how they work. \n\nDrive cam footage from the USA that I've seen shows many accidents being caused by impatient and incourteous four wheelers. \n\nLiterally yesterday I was approaching a left hand exit. I was a mile from the ramp in the second to the left lane. I engaged my turn signal. Waited and began to move over, half a mile to go. Half way I to the lane a Dodge Grand caravan whipped out from behind me and attempted to pass forcing me to miss the exit or crash. \n\nThis driver in this gif was extremely lucky that everyone decided to drive  correctly and actually stopped before the stop lines.",
                                    "score": 2,
                                    "author": "Notrollinonshabbos"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah, don't really see that around Minnesota....or *car* drivers who know how to drive. I just saw a woman drive ACROSS three lanes and turn in front of me (in an additional lane) AS I was crossing the crosswalk. Fucking idiots out here, I swear",
                                    "score": 2,
                                    "author": "LinkoftheCentury"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Confidence is right. What he's doing isn't difficult, but doing it that *fast* sure as hell is.",
                            "score": 6,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He might have completely worked it out because he's already done it 61 times.",
                                    "score": 9,
                                    "author": "redrootfloater",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You missed the chance to write “tightfully so”",
                            "score": 2,
                            "author": "ChiefRocka85",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 83,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah? Well I know someone in boating school.",
                            "score": 7,
                            "author": "chickenstalker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Could they do tricks?",
                                    "score": 4,
                                    "author": "RunSilentRunDrapes"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My cdl instructor was badass. I was first up and he had me parallel park a truck and trailer while blindfolded. And it actually worked.\n\nDude knew if someone actually listened to his instructions they didn't even have to see to be able to parallel park. The balls on that old guy.",
                            "score": 2,
                            "author": "kylethemurphy",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; [Won't you be my hero baby...](https://www.youtube.com/watch?v=1qwmvBJV5Pg)",
                    "score": 25,
                    "author": "CartoonJustice"
                },
                {
                    "level": 1,
                    "comment": "I was overpowered by my anger for that first car way past the GIANT WHITE LINE that tells you where to stop. People that do this are the bane of my existence and I'm not even a truck driver. I've only pulled trailers behind 3/4 ton trucks.  I can't imagine having the will power to not get out and beat those people with a baseball bat haha. Kudos to you driver.",
                    "score": 2,
                    "author": "traimera"
                },
                {
                    "level": 1,
                    "comment": "This is in Bridgeport CT. So much of that city is tight turns like that, not too mention that part of I95 ranks worse than LA for traffic congestion, I'm sure drivers must get proficient quickly driving through there. Also my sister works for Pace Motorlines and it's my hometown.",
                    "score": 2,
                    "author": "Mkap3334"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Dudes a straight G.",
            "score": 712,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 131,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "he found the G spot",
                            "score": 79,
                            "author": "edwardsamson",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I still can't :(",
                                    "score": 51,
                                    "author": "Blu_Penguins",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "r/Suicidebywords",
                                            "score": 18,
                                            "author": "medium-rare-chicken",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "and turned it",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "he he he he he.",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't want to brag but I've done this in Euro Truck Simulator 2.",
            "score": 374,
            "author": "ikindoflikereading",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve played ATS for over 100 hours and every time I take a huge corner I run up against the wall or median barrier",
                    "score": 84,
                    "author": "VoschNickson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you've got space use it :) like this guy did\n\nSource: took an AZ course and they'd say this often.",
                            "score": 15,
                            "author": "blackwidowk758",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; AZ course\n\nOntario?",
                                    "score": 10,
                                    "author": "zadtheinhaler",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yup!",
                                            "score": 2,
                                            "author": "blackwidowk758"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Having played that briefly - I was very frustrated doing deliveries where I had to reverse into some tight spots and stop the truck exactly at some place...it took a really loooooooooooong time in the game for me to get my head around the fact that I can't drive like normal car and expect the trailer to behave the same way I would expect it to",
                    "score": 9,
                    "author": "ktkps"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Look at that car past the white line, I’m suprised the truck made the turn \n\nPsa: that’s what the white lines are for, ever see a while line that doesn’t make sense? That’s because they need to make it so a truck driver can make a turn there",
            "score": 611,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 225,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I grew up in a heavy Ag town and had a buddy who made it a game to stop past the lines. There are only like 5 lights in the whole town. The one out by the Co-op (grain elevators) had a tight intersection as is since it was an afterthought. Our senior year my friend was at that light in the intersection, most likely bragging about it like he always did (“oh no one is gonna hit me they’ll be at fault”), a full-load semi wasn’t having his shit and took off the entire front end of his Camry. It was a miracle he wasn’t hurt but I literally said to him “now you know the score.” Insurance denied his claim because his agent was at the Co-op when it happened and saw the whole thing. Small towns are funny that way.",
                            "score": 112,
                            "author": "brettbri5694",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't even get what your friend was trying to achieve - What is the best case scenario in his head? Does he think it makes him look like a badass or something?",
                                    "score": 58,
                                    "author": "TheLuffe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah he was just trying to be macho or some dumb shit like that. Kids are dumb ya know?",
                                            "score": 33,
                                            "author": "brettbri5694",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Probably because he was driving a Camry.",
                                                    "score": 7,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "A lot better than the shit American cars but please do go on.",
                                                            "score": 3,
                                                            "author": "illinent",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "People love to fuck with truck drivers for some crazy reason.",
                                            "score": 2,
                                            "author": "theshadowfax239"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 25,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh yeah actual over-the-road truckers are very professional and would never do shit like that. The guy who hit my friend was just a farmer who actually got his truck taken away after that. He had a super expired CDL and was old AF. Again... just another case of small town madness.",
                                            "score": 22,
                                            "author": "brettbri5694",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "How much space should a person in a car give to a truck when merging in front of them? \n\nI try to avoid cutting them since I know they are so massive, but I am still ignorant of the limitations of a trucks brake system :/",
                                            "score": 2,
                                            "author": "JollyPeaches",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well, realistically, I'd say *at least* 300 - 400 feet (which would give me, at the very least, enough time to plan for an out in the case of an emergency), unless you are already matching their speed/moving faster than them, or can get over to the left lane immediately after merging.\n\nA lot of people don't understand how insanely long the total stopping distance for a truck is; at highway speeds, it would take me roughly the length of a football field just to *recognize* the need to stop, and then another 500+ feet after slamming on my brakes before coming to a complete stop, and that's the best case scenario. It is highly likely, though, that I end up going into a skid or jackknife and losing control - which could be disastrous for many people.\n\nHope this helped answer your question and gave you some perspective from a truck driver. This was a great question, pal.\n\n\nEdit: Fixed some grammar.",
                                                    "score": 6,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Also to add to this, the air brakes don't react as fast as hydraulic brakes do, there's a slight lag from pushing the pedal to the brakes activating. It's not a long delay but it is significant when coming to brake time and distance.\n\nForgot to mention, after switching back to my car, I almost slammed the brakes after working for a week and a half, that's how much I had to push down the pedal to brake \"normally\" in the truck.",
                                                            "score": 6,
                                                            "author": "blackwidowk758"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Happens a lot around here in rural areas with semis pulling farm equipment.  Coming up to a stop sign and you see one pulling a combine or wind turbine blade, always stop about 20+ ft behind the stop sign so they can turn easier.",
                            "score": 16,
                            "author": "ichabod13",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep, my experience driving trucks and trailers came from working of a farm and since then I've thought that everyone should have to spend a bit of time driving heavy equipment so they understand how different stopping and turning is versus driving a car.",
                                    "score": 6,
                                    "author": "Rafi89"
                                },
                                {
                                    "level": 3,
                                    "comment": "Thank you!! So many people crowd that line and in rural areas especially it can be a gamble how far the truck can get onto the shoulder to turn without potentially sliding right off the road.",
                                    "score": 2,
                                    "author": "pillowcats"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Always make room for the Bringers of Things.",
                            "score": 13,
                            "author": "breathing_normally"
                        },
                        {
                            "level": 2,
                            "comment": "I live in Carlisle, which is apparently the trucking capital of PA, and usually back up if I see a truck trying to turn. They usually wave and I feel good about myself.",
                            "score": 4,
                            "author": "shewy92",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "🤦🏿‍♂️ I hated Carlisle when I was there for a week getting my truck fixed back in 2016. Not many black people there and the people at the bar I went to made that clear every day I went there.",
                                    "score": 2,
                                    "author": "BlackPopeye_03"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I do the same for buses in the city",
                            "score": 3,
                            "author": "TheFirsh"
                        },
                        {
                            "level": 2,
                            "comment": "MFW people go out of their way to overtake you on a blind corner, with a crest just to get \"IN FRONT OF THAT SLOW TRUCK\", then they drive slower than you.",
                            "score": 2,
                            "author": "Cpt_Soban"
                        },
                        {
                            "level": 2,
                            "comment": "I live near a large industrial park, so I encounter a lot of trucks while commuting on my bike. I always back up and wait for them to turn. I also make sure to stay in your mirrors with a direct line of sight to the driver when at a stop light. I can't imagine how stressful it would be for a truck driver to know that a bicyclist was behind them but not actually see them.",
                            "score": 2,
                            "author": "Occams_l2azor"
                        },
                        {
                            "level": 2,
                            "comment": "I often see cars have to back up. Usually they have to because the truck has already committed to the turn and if they don't back up, they will have to sit until someone backs up or let their car get destroyed.  This is especially common at a pretty busy intersection close to my job.  The white lines are back pretty far and most drivers stop where they should, but I often see trucks not be able to make the turn in their given space.  I have seen quite a few cars need to back up for the truck to make it, often multiple cars at a time, that takes time.",
                            "score": 2,
                            "author": "therealpandamarie"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I Always made a point of putting my trailer inches from their bumper when they are way into the intersection. Always hopeful that it scares them into learning a little.",
                    "score": 8,
                    "author": "Logana320",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This. I do the extra mile to turn as wide as possible to get as close as possible so they hopefully see the error in their ways.",
                            "score": 3,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "yep, i hate guys like that. I always laugh when they pull up too far in a turn lane and don't hit the sensor. The light goes off and they're still sitting there with a red.",
                    "score": 6,
                    "author": "h0ser"
                },
                {
                    "level": 1,
                    "comment": "They aren't just past the line, they're taking up the entire crosswalk and bleeding over into the intersection!",
                    "score": 6,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "hope they were shitting themselves",
                    "score": 2,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Yeah he only had to do this because of that asshole",
                    "score": 2,
                    "author": "humidifierman"
                },
                {
                    "level": 1,
                    "comment": "I might be an asshole but even if I can make the turn and I see them sticking out I make them move, I just sit my rig in front of their bumper and make them crap their pants while I look at them like this 😒\nFreaking Yonkers",
                    "score": 6,
                    "author": "loupr738",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's pretty fun grabbing about 12 gears with the Jake's making more noise then going forward and seeing someone just blinding go backwards. They didn't have to move, swing by 10 feet in front of them",
                            "score": 3,
                            "author": "tablett379",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Maybe 3 or 4, I ain’t going to fast in ny",
                                    "score": 4,
                                    "author": "loupr738",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Split everything and start in low? That way you shift to high range as it straightens out and 1-2 more full gears is the speed limit for sure.",
                                            "score": 4,
                                            "author": "tablett379"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Especially impressive since he didn't have the clearance he should have with that guy in the crosswalk!",
            "score": 160,
            "author": "leeloo1612",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's a day-cab. Shorter wheel base, better turning radius, and the steers are way closer to the kingpin than a sleeper. All that adds up to the roads being a lot more forgiving where space is concerned.",
                    "score": 6,
                    "author": "BeenThruIt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s really dark but it looks like he’s dealing with a single rear axle as well.",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "*Thumbs Up*",
            "score": 36,
            "author": "lkash_",
            "replies": [
                {
                    "level": 1,
                    "comment": "dude's like, \"nice!\"",
                    "score": 6,
                    "author": "MidniteSandwich",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nice.",
                            "score": 3,
                            "author": "iHonestlyDoNotCare"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He definitely flipped him off.",
                    "score": 3,
                    "author": "Blue_Phoenix912",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hey nice turn fuck you!",
                            "score": 3,
                            "author": "BarryBostwick"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, that's what I saw and I was really wondering why.",
                            "score": 3,
                            "author": "Shloop_Shloop_Splat"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This must be Boston...",
            "score": 114,
            "author": "deannickers",
            "replies": [
                {
                    "level": 1,
                    "comment": "Can people from other states immediately identify their state like this? I swear even with no license plates, landmarks, etc. every time it’s like yup that’s MA.",
                    "score": 94,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Blue street signs, housing architecture, the way the street is setup.",
                            "score": 56,
                            "author": "NoShftShck16",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, street signs are usually the first thing that gives for me. A classic example is The Office, there ain’t a damn way in hell the show was filmed in PA, that’s California. Southern California to be exact. To be more exact-er, Burbank, CA",
                                    "score": 30,
                                    "author": "kthxtyler",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Removed by user",
                                            "score": 2,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Shit there could be a front page video of me in my front yard and I probably wouldn't know where it was",
                            "score": 11,
                            "author": "Valalvax",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I can do the same with Fl. Shit just looks similar. The grass, architecture, signs, etc.",
                            "score": 2,
                            "author": "Flacvest"
                        },
                        {
                            "level": 2,
                            "comment": "I can usually tell if someone is in Australia or NZ by a pic of the inside of someone's house. I get a 'vibe'",
                            "score": 2,
                            "author": "PsychoNerd91",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "99.9% sure it's Somerville immediately in front of the Artisan's Asylum, not far from that Market Basket.  The dark building on the left will be the self storage area that turned into the greentown labs expansion.\n\nEdit:  https://goo.gl/maps/5kAHMtAVqqQj5LW29 for the curious",
                    "score": 65,
                    "author": "teryret",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Jesus you’re good",
                            "score": 14,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 15,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Or it **was** Jesus and he’s good",
                                            "score": 12,
                                            "author": "santaliqueur",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Or it **was** Jesus and he lives there.",
                                                    "score": 8,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Didn’t recognize my own street lol",
                            "score": 3,
                            "author": "RobertDownseyJr"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Somerville to be specific! https://goo.gl/maps/tJZQZ2cGUKgaZzoq7\n\nUsed to live off that intersection. Recognize it in a heartbeat.",
                    "score": 13,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I worked in the moving business in high school and helped a lot of drivers that drove all over the country. I asked each one their favorite and least favorite place to drive a trailer and Boston was everyone’s least favorite without a doubt",
                    "score": 3,
                    "author": "TomJebron"
                },
                {
                    "level": 1,
                    "comment": "Lowell area I think",
                    "score": 5,
                    "author": "wecook123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "GTA 5 taught me that if you tried this tight turn your cargo box would just fucking fall off",
            "score": 37,
            "author": "mmmm_okwhynot",
            "replies": [
                {
                    "level": 1,
                    "comment": "Especially the one mission for selling your bunker  supplies where taking the slightest turn ends up in the trailer flipping.",
                    "score": 13,
                    "author": "VoschNickson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah yes. The Phantom Wedge.",
                            "score": 2,
                            "author": "Mr-Sister-Fister21"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1065,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "F you bot......\n\nFollowing in op’s footsteps here",
                    "score": 222,
                    "author": "SCPunited",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 77,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "FackUBot!",
                                    "score": 34,
                                    "author": "Gappy_Gilmore_86",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "/r/fuckbots",
                                            "score": 30,
                                            "author": "IntensityStudio",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "/r/botsrights would argue that this poor bot is just a slave obeying the human that is controling it. I tend to agree: fuck you, slave driving mods!",
                                                    "score": 26,
                                                    "author": "youmightbeinterested",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Thank you /u/youmightbeinterested for helping advocate for bots rights. We thank you :)\n***\nI'm a bot. Bug /u/famous1622 if I've done something wrong or if you just want me to get off of your subreddit",
                                                            "score": 16,
                                                            "author": "botrightsbot",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Fuck you bot.",
                                                                    "score": 5,
                                                                    "author": "Zaynom",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Let's free the bot and have it no longer here",
                                                            "score": 3,
                                                            "author": "FifenC0ugar"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Risky click",
                                                    "score": 3,
                                                    "author": "Gappy_Gilmore_86"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I take offense to that.",
                            "score": 5,
                            "author": "junkyard_robot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not you bot...the other bot.......\n\n:)",
                                    "score": 2,
                                    "author": "SCPunited"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This bot makes me wanna unsub",
                    "score": 105,
                    "author": "Ashjrethul",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "LPT: block the automod! My AITA experience has vastly improved.",
                            "score": 26,
                            "author": "Ed-Banger",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh my god. Thank you. I don't know why it annoyed me so much",
                                    "score": 2,
                                    "author": "Ashjrethul"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Why? Honestly, why in all fucks in the world do you actually care?",
                            "score": 6,
                            "author": "Luhood",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Cause I don't need some stupid explanation why this is better every loop. If it is I'll upvote the pay if not I won't and then the popularity of the post will determine it",
                                    "score": 7,
                                    "author": "FifenC0ugar"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\\*watches two loops, the second of which is even better than the first, however subsequent loops are not as good\\*\n\nThis must be /r/BetterEveryLoop.\n\nYup.",
                    "score": 31,
                    "author": "ianthenerd"
                },
                {
                    "level": 1,
                    "comment": "Fuck you bot",
                    "score": 3,
                    "author": "jkmonger"
                },
                {
                    "level": 1,
                    "comment": "Fuck this stupid ass bot!",
                    "score": 8,
                    "author": "neccoguy21"
                },
                {
                    "level": 1,
                    "comment": "Hey it's a good bot",
                    "score": 3,
                    "author": "LakshayMd"
                },
                {
                    "level": 1,
                    "comment": "Bad bot.",
                    "score": 2,
                    "author": "JoeyBobBillie"
                },
                {
                    "level": 1,
                    "comment": "Fuck you bot",
                    "score": 2,
                    "author": "finicu"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why can’t all truckers be this good",
            "score": 63,
            "author": "leviathen1998",
            "replies": [
                {
                    "level": 1,
                    "comment": "Because very few trucks are set up this way. His trailer axles are slid all the way up, effectively making it a shorter vehicle. The truck itself is shorter than an over the road truck. Finally, there is only one drive axle.\n\nThe truck I drive could not physically take the turn like this one did.\n\nEdit: it's also has no sleeper which also drastically reduces the length of the cab.",
                    "score": 126,
                    "author": "waltk918",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "On behalf of the otr truckers, thank you for demystifying this for the folks.",
                            "score": 57,
                            "author": "cicadawing"
                        },
                        {
                            "level": 2,
                            "comment": "Basically this is a city P and D truck. Great for light work and tight spaces. Pretty much what it's designed for. Long haul truck could not perform such in a single pass.",
                            "score": 24,
                            "author": "uMustEnterUsername",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Damn daycabs and their sexy turning abilities. Wouldn't dream of trying this with my sleeper",
                            "score": 9,
                            "author": "Thatguymidcrank",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Highly trained professional.",
                    "score": 11,
                    "author": "PrivatePyle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Excuse me. HOW!",
            "score": 36,
            "author": "QWERTY11309",
            "replies": [
                {
                    "level": 1,
                    "comment": "With grace...",
                    "score": 16,
                    "author": "YashistheNightfury"
                },
                {
                    "level": 1,
                    "comment": "You spend a bit of time driving in Boston and you learn.",
                    "score": 9,
                    "author": "teryret"
                },
                {
                    "level": 1,
                    "comment": "My dad was a trucker, sometimes he would let me go to work with him and trust me it looks equally crazy from inside. When he was making turns to just go into freeways I would always think \"oh shit we're not going to make it\" and then he pulls it off. \n\nThe real crazy part was having to dock. In some locations it was just impossible because of how small the yards are but God damn it he reversed parked that every time.",
                    "score": 6,
                    "author": "HaikusfromBuddha"
                },
                {
                    "level": 1,
                    "comment": "It's actually really easy.\n\nAll you have to do is drive farther out into the intersection before starting your turn.",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Like a boss. Respect.",
            "score": 10,
            "author": "AspenTD"
        },
        {
            "level": 0,
            "comment": "This guy trucks.",
            "score": 7,
            "author": "InSearchOfGreyPoupon"
        },
        {
            "level": 0,
            "comment": "There's no better feeling then getting a big ass truck and trailer through a tight spot.",
            "score": 3,
            "author": "MANEGGSMAN"
        },
        {
            "level": 0,
            "comment": "He trucks",
            "score": 4,
            "author": "bestwaluigina"
        },
        {
            "level": 0,
            "comment": "And yet that car in front didn't respect the light lane..",
            "score": 5,
            "author": "sanjibukai"
        },
        {
            "level": 0,
            "comment": "Gotta love the day cabs. That was impressive as hell.",
            "score": 4,
            "author": "mainemovah8"
        },
        {
            "level": 0,
            "comment": "I’ve done the thumbs up a couple times. I remember twice specifically I was flabbergasted watching a trucker in the city whip out if front of me only to back perfectly into his loading bay. They deserve an award or at least some highlight tapes on YouTube.",
            "score": 4,
            "author": "crook22",
            "replies": [
                {
                    "level": 1,
                    "comment": "My Dad was an OTR trucker, and one time after hitting a very difficult serpentine back off in an alley in Cincinnati in one move,   the guys working the dock came outside cheering with a cold, unopened 2-liter coke for him, I guess from the break room.  Basically said something to the effect of \"this is the only thing we really have laying around for a reward, but damn, nobody ever hits that dock on the first try.\"  Haha.  I always loved that story.\n\nEdit: thanks for the silver!",
                    "score": 7,
                    "author": "ranaldo20"
                },
                {
                    "level": 1,
                    "comment": "It’s amazing to see some of the things they can do",
                    "score": 3,
                    "author": "VoschNickson"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Trucker: Lemme just jack knife the fuck out of this... and then straighten 'er out. Nailed it.",
            "score": 4,
            "author": "Alleira"
        },
        {
            "level": 0,
            "comment": "This guy fucks.",
            "score": 7,
            "author": "dbdemoss2",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This was night and day compared to the trucker who got stuck on the railroad tracks.",
            "score": 3,
            "author": "HighFiveOhYeah"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thumbs up lol",
                    "score": 2,
                    "author": "chesterluno"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Puhleese! Ordinary 53' box behind a day cab. Piece of cake, look for one with a full sleeper and the same box, might be a little difficult then.",
            "score": 3,
            "author": "bostonbean"
        },
        {
            "level": 0,
            "comment": "And people are still unnaprecitave towards truck drivers",
            "score": 3,
            "author": "Billcosbysbodygaurd"
        },
        {
            "level": 0,
            "comment": "And this is why you don’t pull past that white line at the light/sign. Just, you know, putting that out there. Not all truckers are as elegant with their rigs.",
            "score": 3,
            "author": "Deastrumquodvicis"
        },
        {
            "level": 0,
            "comment": "The most impressive part is how quickly he does it. No stopping or double-thinking, like a guy who fully knows his truck's capabilities and dimensions. I am telling you this guy has been with this truck for some time.",
            "score": 3,
            "author": "DanKoloff",
            "replies": []
        },
        {
            "level": 0,
            "comment": "/r/OddlySatisfying",
            "score": 2,
            "author": "PolyWolf_",
            "replies": []
        },
        {
            "level": 0,
            "comment": "/r/nextfuckinglevel",
            "score": 2,
            "author": "Jesus359"
        },
        {
            "level": 0,
            "comment": "Is it possible to learn this power?",
            "score": 2,
            "author": "guccitaint",
            "replies": [
                {
                    "level": 1,
                    "comment": "Through advanced training and years of experience.... possibly",
                    "score": 2,
                    "author": "VoschNickson"
                }
            ]
        },
        {
            "level": 0,
            "comment": "r/nonononoyes",
            "score": 2,
            "author": "BarryMcCaughaner"
        },
        {
            "level": 0,
            "comment": "As someone who drives big trucks all the time in American Truck Simulator, I can say this man has skills.",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You know when you pull up to a traffic light, and the stop line seems awfully far from the actual corner?\n\n\nYeah...this.",
            "score": 2,
            "author": "candidly1"
        },
        {
            "level": 0,
            "comment": "Apparently this is a standard turn for any trucker.",
            "score": 2,
            "author": "YonmonTommy",
            "replies": [
                {
                    "level": 1,
                    "comment": "TIL it seems so. It’s still pretty cool/ impressive to the average person who couldn’t do it themselves",
                    "score": 2,
                    "author": "VoschNickson"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Awesome driving skills",
            "score": 2,
            "author": "MRBN07"
        },
        {
            "level": 0,
            "comment": "I don't think he signaled however",
            "score": 2,
            "author": "cyril0"
        },
        {
            "level": 0,
            "comment": "there is a LOT of waste space in that turn\n\nIf you think this is impressive, you recently cared about drivers Ed tests",
            "score": 2,
            "author": "simjanes2k",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That driver knows how to set the Pace",
            "score": 1,
            "author": "OurWorldAwaits"
        },
        {
            "level": 0,
            "comment": "Thats why those tandem axles on the trailers slide forward.",
            "score": 1,
            "author": "PulledOverAgain",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Like a boss.",
            "score": 1,
            "author": "mega_asteroid"
        },
        {
            "level": 0,
            "comment": "There’s skilled drivers like this. Then there’s this guy...\n\n\n[yikes](https://www.reddit.com/r/Roadcam/comments/ctqdne/usa_truck_driver_attempts_a_uturn_on_an_active/?utm_source=share&amp;utm_medium=ios_app)",
            "score": 1,
            "author": "NashiShin"
        },
        {
            "level": 0,
            "comment": "/r/IdiotsInCars   The car sitting in the crosswalk ahead",
            "score": 1,
            "author": "Eureka514"
        },
        {
            "level": 0,
            "comment": "And this is why people should always stop behind the white line on the road noton jt",
            "score": 1,
            "author": "richterman2369"
        },
        {
            "level": 0,
            "comment": "Hell of a driver.",
            "score": 1,
            "author": "j_manny2003"
        },
        {
            "level": 0,
            "comment": "This looks like Boston and you basically have to be able to do this because so many truck routes go through this bullshit.",
            "score": 1,
            "author": "NoShftShck16",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Guys I'll have you know it only took me 5 times backing out yesterday to get my pickup and trailer out of the driveway and I only ran off the side of the driveway once.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "When someone in an argument starts to mumble under their breath as you walk away",
            "score": 1,
            "author": "Capt_Obvious97"
        }
    ]
}