{
    "id": "vc8m6l",
    "score": 15429,
    "title": "God! it's addictive!",
    "author": "malthorthesoulslayer",
    "date": 1655227377.0,
    "url": "https://www.reddit.com/r/BetterEveryLoop/comments/vc8m6l",
    "media_urls": [
        "https://i.redd.it/ntqlamx6fm591.gif"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "OP's explanation:\n\n---\n&gt;Watching plates locate themselves in the right angle triggered by just a touch is so satisfying\n\n---\nIf you think this gif fits /r/BetterEveryLoop, upvote this comment. If you think it doesn’t, downvote it. If you’re not sure, leave it to others to decide.",
            "score": 1,
            "author": "2Botter2Loop"
        },
        {
            "level": 0,
            "comment": "This was likely filmed with sound. At some point sound was removed and whoever is responsible needs a spanking",
            "score": 490,
            "author": "Swaglord9001",
            "replies": [
                {
                    "level": 1,
                    "comment": "The only time I agree with the need for a physical beating.",
                    "score": 83,
                    "author": "Rambonics",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've had other times but this one requires ass-thwappening for sure",
                            "score": 10,
                            "author": "I_N_C_O_M_I_N_G"
                        },
                        {
                            "level": 2,
                            "comment": "harder, papi",
                            "score": 3,
                            "author": "darthmaui728"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It was me. I removed the sound. I guess you have to punish me now.",
                    "score": 39,
                    "author": "Hampsterhumper",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh you have been very naughty",
                            "score": 24,
                            "author": "Ilookatreddit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Go on...",
                                    "score": 12,
                                    "author": "Gan-san",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And after the spankings the oral sex!",
                                            "score": 1,
                                            "author": "HeckRock"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[https://i.imgur.com/vx6V2vd.gif](https://i.imgur.com/vx6V2vd.gif)",
                    "score": 11,
                    "author": "GiantRobotTRex",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Here I was thinking you were linking the vid with sound... smh",
                            "score": 1,
                            "author": "Its_Zachariah"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Someone needs to add Optimus Prime sounds.",
                    "score": 10,
                    "author": "CanadianPanda76"
                },
                {
                    "level": 1,
                    "comment": "I think because of subreddit rule\n\nGIF only",
                    "score": 5,
                    "author": "Aerie122"
                },
                {
                    "level": 1,
                    "comment": "It could be worse and they could’ve added some music",
                    "score": 3,
                    "author": "arealhumannotabot"
                },
                {
                    "level": 1,
                    "comment": "*sqqqqrqrqqrqq*",
                    "score": 2,
                    "author": "bottsking"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well blow me, this one really is worth watching many times.",
            "score": 177,
            "author": "The-Go-Kid",
            "replies": [
                {
                    "level": 1,
                    "comment": "When and where?",
                    "score": 61,
                    "author": "YT-ESW_ST33le",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Here and now baby",
                            "score": 6,
                            "author": "TrexrunNgun06"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Does anyone know why the plates reverse direction at the end?",
            "score": 30,
            "author": "R0m4n0m",
            "replies": [
                {
                    "level": 1,
                    "comment": "After watching it like 20x I have so many questions… Did it lose speed at the very end because some top plates were wet? A flaw in one’s ceramic?  Was there a crumb involved causing friction to make it slow down &amp; reverse course? Whatever it was, it made it into a grand finale with a final bow to it’s audience. It was like watching a flower blooming in reverse. Very satisfying &amp; better every loop.",
                    "score": 33,
                    "author": "Rambonics"
                },
                {
                    "level": 1,
                    "comment": "So obviously this all happens because gravity wants to pull the plates down into the lowest position. But then you also have the fact that the plates can only interlock to reach that lowest state in a certain rotation relative to each other. The plates *not* interlocking perfectly in other positions is what allows the plates on top to push the plates on the bottom at an angle to make them spin. The friction between the plates keeps them all sort of locked in place while they rotate (the top section of plates all stay roughly in the same relative position to each other until the end).\n\nNotice that the plates spin faster the lower they are on the stack before the weird breakdown/reverse near the end. More force is pressing down on each plate because there are more on top, and so when the spinning reaches them, they get accelerated into rotation faster.\n\nWhat happens near the end are several things: \n\nFirst, eventually the rotation speed and downward force reach the point where a lower plate overcomes friction enough to freely rotate from the plate above it and lock into place with the plate below it, causing a discontinuity which splits the process into above and below that boundary. (see note at the end)\n\nSecond, now that the plate above that boundary has nothing to push against below it while still having the same momentum, it can overcome friction enough with the plate above itself to spin more freely. This moves it into a position where the plate above can then move down to lock into position. Then that set of two linked plates has enough mass to slightly resist the pushing motion above and the next plate falls into place. This is like the crashing of a wave, with the effect quickly working its way up the stack. (there are some complementary effects going on here at the same time... this whole thing is surprisingly complicated the more I think about it)\n\nThird, below the boundary the two plates that are interlocked now act as a single unit with more momentum. They overcome friction enough to move into position to interlock with the one below, hitting it with enough of the rotational energy to send it moving to continue the process downward, and this is like another wave crashing in the other direction.\n\nFinally, you have the two stacks above and below the boundary each independently completed, and the rotation between those stacks at the boundary eventually slows down due to friction. When the motion is close to coming to a stop it's just the relative positions of the two stacks that will determine which way they have to rotate to finally lock into place. It could have potentially rotated further before that point and then the direction of final rotation would have been the same as the initial rotation. Or, if it were in *just* the right speed and alignment, it could have stopped at a point where they would stop at a stable non-interlocked angle just like the initial positions.\n\n(edit: \n\nThere are actually multiple stages where similar kinds of discontinuity are happening with the plates in this video and they have complicated interactions, but we'll keep it simple by just focusing on one. \n\nThere's also the case of the plate at the bottom acting as a final point where rotation can't occur since there won't be enough force to rotate the whole counter below it, and so any spin reaching that point would just dissipate - the bottom plate is sort of like its own special point of discontinuity as well.)",
                    "score": 18,
                    "author": "UNisopod",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was kinda being silly, but you gave us a great scientific essay. \nYou is very smart = A+! 🤩 \nIf I was studying for your test I would memorize these keywords—gravity, rotation, single unit, force, final point.",
                            "score": 4,
                            "author": "Rambonics"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A few of the plates at the bottom started spinning a bit before the chain reaction hit them probably due to the vibrations of the top half moving so much.\n\nThese bottom plates actually already were moving in the opposite direction (idk if that's some physics or just inexact balancing) and so the final moving plate being closer to the bottom was already going to move that direction, but ended up doing so slowly and dramatically because it was fighting off the momentum of the top stack\n\nOr maybe just some physics shit that I'm unaware of",
                    "score": 5,
                    "author": "cbthesurvivor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not quite. The bottom plates weren't moving before the chain reaction hit them nor in the opposite direction, they were just accelerating *faster* the further down you go and it makes it hard to tell what's going on visually before it quickly breaks down.\n\nSee my answer to OP of this chain for a long explanation. There's a lot going on here.",
                            "score": 1,
                            "author": "UNisopod"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Really needs sound",
            "score": 43,
            "author": "CapstanLlama"
        },
        {
            "level": 0,
            "comment": "Need sound.",
            "score": 10,
            "author": "whizzwr"
        },
        {
            "level": 0,
            "comment": "AUTOBOTS...STACK!",
            "score": 31,
            "author": "That_Apathetic_Man"
        },
        {
            "level": 0,
            "comment": "That first failed spin though...augh. Someone needs to make a perfect one.",
            "score": 4,
            "author": "ptolani"
        },
        {
            "level": 0,
            "comment": "/r/blackmagicfuckery",
            "score": 4,
            "author": "ChillyToTheBroMax"
        },
        {
            "level": 0,
            "comment": "Reminds me of [this Garfield comic.](https://www.gocomics.com/garfield/1987/08/09)",
            "score": 4,
            "author": "Sunny64888"
        },
        {
            "level": 0,
            "comment": "Thats really one of a few on this sub thats actually worth watching many times",
            "score": 13,
            "author": "Sir-Ravealot"
        },
        {
            "level": 0,
            "comment": "Dude",
            "score": 8,
            "author": "Roko911"
        },
        {
            "level": 0,
            "comment": "r/oddlysatisfying",
            "score": 3,
            "author": "Blikki14292"
        },
        {
            "level": 0,
            "comment": "Imo, It looks like stop motion photography, with editing.  But the bubbles in the sink don’t move. \nCool, either way.",
            "score": 3,
            "author": "8lbs6ozbabyjesus"
        },
        {
            "level": 0,
            "comment": "r/satisfyingasfuck",
            "score": 3,
            "author": "Popal24"
        },
        {
            "level": 0,
            "comment": "Bout to buy some of these plates",
            "score": 10,
            "author": "Steady_Ri0t",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have a huge stack of them (at least they look similar) and I just tried it and couldn't make it work.  Maybe I'll try again when the humidity isn't 100%.  Unless there's some other secret shown here?",
                    "score": 3,
                    "author": "tjw"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Finally, some good fucking gifs.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Corning?",
            "score": 2,
            "author": "pepeisdumb"
        },
        {
            "level": 0,
            "comment": "Reverse the video for a sweet pop up Nokatomi Plaza",
            "score": 2,
            "author": "Alive_Ice7937"
        },
        {
            "level": 0,
            "comment": "whoever cut out the last few seconds of the video and posted it on r/gifsthatendtoosoon deserves a kicking",
            "score": 2,
            "author": "zoom_eu"
        },
        {
            "level": 0,
            "comment": "fake, this is in reverse",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "The back english at the end ,is the kicker.",
            "score": 3,
            "author": "livinlizard"
        },
        {
            "level": 0,
            "comment": "how",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "FINALLY some good content on this sub",
            "score": 1,
            "author": "WiggyWamWamm"
        },
        {
            "level": 0,
            "comment": "Am I the only one bothered by the fact that the plates go from turning clockwise to counter-clockwise at the end?",
            "score": 1,
            "author": "Not-a-Throwaway-8"
        },
        {
            "level": 0,
            "comment": "It's like witnessing a ripple in space-time.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Who else is going to go try this right now!?",
            "score": 0,
            "author": "Peter_Pans_shadow",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm on my way to Cost Plus rn!",
                    "score": 2,
                    "author": "unknownemoji"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fuk ya",
            "score": 1,
            "author": "v13ragnarok7"
        },
        {
            "level": 0,
            "comment": "u/savevideo",
            "score": 1,
            "author": "Silverwolf0113"
        },
        {
            "level": 0,
            "comment": "SHENNANIGANS!!!!",
            "score": 1,
            "author": "daclampzx2"
        },
        {
            "level": 0,
            "comment": "It looks like you solved a Resident Evil puzzle.",
            "score": 1,
            "author": "graham2k"
        },
        {
            "level": 0,
            "comment": "I think I just busted",
            "score": 1,
            "author": "maskerity"
        },
        {
            "level": 0,
            "comment": "AUTOBOTS ROLLOUT!",
            "score": 1,
            "author": "philster666"
        },
        {
            "level": 0,
            "comment": "This is almost better reversed!",
            "score": 1,
            "author": "Juof"
        },
        {
            "level": 0,
            "comment": "Isn’t it potential energy? I don’t see how addiction could power this",
            "score": 1,
            "author": "LCoolJT"
        },
        {
            "level": 0,
            "comment": "🤤",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "u/savevideobot",
            "score": 1,
            "author": "G0ldenT0ilet"
        },
        {
            "level": 0,
            "comment": "u/gifreversingbot",
            "score": 1,
            "author": "Valennyn"
        },
        {
            "level": 0,
            "comment": "Oh the satisfaction for the spatially oriented mildy OCD type.",
            "score": 1,
            "author": "Kiditred"
        },
        {
            "level": 0,
            "comment": "r/blackmagicfuckery",
            "score": 1,
            "author": "bcpsgal"
        },
        {
            "level": 0,
            "comment": "my eyes are full of stars....",
            "score": 1,
            "author": "SurroundObjective895"
        },
        {
            "level": 0,
            "comment": "It's Additive\\*\\*",
            "score": -4,
            "author": "doctapeppa"
        },
        {
            "level": 0,
            "comment": "GTFO",
            "score": -2,
            "author": "ExtraDependent883"
        },
        {
            "level": 0,
            "comment": "why that",
            "score": -1,
            "author": "imbeingcyberstalked"
        }
    ]
}