{
    "id": "1046g4n",
    "score": 5,
    "title": "Will I be dropped from my lab?",
    "author": "bigfatfortnitefan",
    "date": 1672943972.0,
    "url": "https://www.reddit.com/r/FIU/comments/1046g4n",
    "media_urls": [],
    "other_urls": [],
    "postText": "I will be missing the week of MLK Jr. day (second week), and labs don’t meet until second week of the semester, but I read that if you don’t show up for the first lab meeting you will be dropped. Will I not be dropped if I email the lab TA the first week? Or will labs not meet for the second week either since we have Monday off from MLK jr. day?",
    "comments": [
        {
            "level": 0,
            "comment": "Yeah just send a message to your professor about your absence when you can and if they excuse it then it’ll be all good. \n\nIdk anything about getting dropped but I missed the first two weeks of a lab because of covid and after sending a message to my professor, it was all good.",
            "score": 3,
            "author": "filbocanfeast",
            "replies": [
                {
                    "level": 1,
                    "comment": "Alright, I’m worried bc my reason isn’t Covid and maybe that’s why they excused it? Either way gonna try and hope for the best! Thank you :)",
                    "score": 2,
                    "author": "bigfatfortnitefan"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What lab is it? The lab I TA isn't even meeting until week 3 because of the holiday.\n\nEdit: if you're not sure I'd just email the TA/faculty of record and explain the situation and ask them not to drop you. If it's an anticipated absence I'm sure you'll be fine.",
            "score": 2,
            "author": "jabels",
            "replies": [
                {
                    "level": 1,
                    "comment": "It depends on the lab and the campus. Most labs at BBC start the first week of classes. In my experience, we don't drop students for missing the first lab as it's still within the add/drop period. Definitely contact the TA and/or the lab coordinator.",
                    "score": 2,
                    "author": "MmmWater",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m taking it on MMC! Thanks for the help :)",
                            "score": 1,
                            "author": "bigfatfortnitefan"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s chem 2! Thanks for the input :)",
                    "score": 1,
                    "author": "bigfatfortnitefan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea sorry wish I had more specific information but just speak with your instructor(s) and I'm sure it will be taken care of correctly.",
                            "score": 1,
                            "author": "jabels"
                        },
                        {
                            "level": 2,
                            "comment": "Contact the lecturing professor or the lab coordinator. For MMC, there's a chance they may have not assigned TAs yet, or those TAs may not be accurately reflected in the Panthersoft system yet. The lecturing professor and lab coordinators will know for sure though!",
                            "score": 1,
                            "author": "MmmWater"
                        }
                    ]
                }
            ]
        }
    ]
}