{
    "id": "104b6k6",
    "score": 2,
    "title": "Spring 2023 Graduation Question",
    "author": "Princess_GJH",
    "date": 1672955107.0,
    "url": "https://www.reddit.com/r/FIU/comments/104b6k6",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey y'all so I am looking to apply for graduation as a double major in international relations and political science. I only have this semester to go and I would satisfy all requirements. I already applied for graduation for my international relations bachelors but when I apply for my political science one, it doesn't allow me. \n\nIts frustrating because the deadline is approaching and my advisor is supposedly \"in office\" but has left me hanging in individual appointments.\n\nAny help is appreciated!",
    "comments": [
        {
            "level": 0,
            "comment": "You cannot graduate double majors - there’s only one and that’s your primary. For two diplomas, you need a second bachelors NOT a second major. And second bachelors only require 150 credits (30 cr to do since you will have the same amount of credits earned at FIU)",
            "score": 2,
            "author": "FuriousP1ayer"
        },
        {
            "level": 0,
            "comment": "I myself applied for graduation less than a month before I graduated lol, u have time. Wen u return to campus, either call the advisor building (theyr nice, theyll help u and get u watever advisor u want) or just go there (it is the ZEB building [which is next to mango- where panda express is], second floor, i think room 210). Just walk in and ask for help, theyll either give an appointment or u can walk door to door trying to find an advisor.",
            "score": 1,
            "author": "AdministrationOk4242"
        },
        {
            "level": 0,
            "comment": "Are you going for a double bachelors? How many credits will you have at the end of the semester?",
            "score": 1,
            "author": "GeekScientist",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, most likely 240 but after this semester I will complete both of their requirements",
                    "score": 1,
                    "author": "Princess_GJH"
                }
            ]
        },
        {
            "level": 0,
            "comment": "On the topic of graduation, can you just buy stoles/cords online for an organization that you are no longer a part of but were before?",
            "score": 1,
            "author": "Glitteringmermaidd"
        }
    ]
}