{
    "id": "10axlp9",
    "score": 6,
    "title": "How respectable is FIU compared to the other Florida public universities?",
    "author": "ShockComfortable8939",
    "date": 1673624570.0,
    "url": "https://www.reddit.com/r/FIU/comments/10axlp9",
    "media_urls": [],
    "other_urls": [],
    "postText": "What’s FIUs reputation among the other public universities in Florida? Is it considered a “top university”?",
    "comments": [
        {
            "level": 0,
            "comment": "It depends on the field of study, Law school is putting up the best BAR passing rate in the state for several years now. International Business is Top 10 program in the world, tourism/hospitality ranked very high as well worldwide. Computer Science has good rankings.\n\nWe just don’t have a “national” reputation because we don’t have a good football/basketball team. FIU is still the fifth largest university in the country, once we figure out athletics we will be up there, everything else is in place. Even our campus is crazy beautiful. \n\nPaws Up!",
            "score": 35,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; We just don’t have a “national” reputation because we don’t have a good football/basketball team.\n\nPretty much this. You think University of Alabama, South Carolina and Texas Tech are known because of their top of the line academics? They have big time sports programs and because of that people elevate them to higher than they are.\n\nA lot of the big schools are on the same level as FIU (basically just fine) but they have reputations due to being on tv weekly.",
                    "score": 13,
                    "author": "dade305305"
                },
                {
                    "level": 1,
                    "comment": "Also respected very highly in the fields of marine biology, political science, and international affairs (specially Latin American studies). The FIU in DC program has made it so there’s a lot of alumni presence in public policy, government affairs, diplomacy, think tanks, etc.",
                    "score": 8,
                    "author": "Astrosimi"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It probably depends on what exactly you mean by reputation. In very general terms, I'd say FIU doesn't have much of a reputation at all- especially outside Miami, I often have to tell people where the school is, if they've heard about it at all.\n\nIn terms of specific majors and programs, however, there are a number of them that are well-known and respected in the relevant fields. It would probably be more useful for you to look into what you expect to be studying, and see what you find in terms of FIU's reputation there.",
            "score": 9,
            "author": "supapwn404"
        },
        {
            "level": 0,
            "comment": "I played a “guess which is ranked higher” with a friend, he picked all schools in P5 conferences…that doesn’t determine how good a school is…perfect example LSU…ranked 176…FIU is 151. That being said, we’re both excellent, we’re both in the highest class in academia.\n\nAthletics have a lot to do with name recognition.",
            "score": 4,
            "author": "Wearamask0912",
            "replies": [
                {
                    "level": 1,
                    "comment": "What ranking?",
                    "score": 1,
                    "author": "Consistent_Decision9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "US News &amp; World Report",
                            "score": 1,
                            "author": "Wearamask0912"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think community colleges like dade and BC are the cheapest option",
                    "score": 1,
                    "author": "limeblue31"
                }
            ]
        }
    ]
}