{
    "id": "10tq63d",
    "score": 0,
    "title": "How are exams usually proctored?",
    "author": "wetbod",
    "date": 1675541952.0,
    "url": "https://www.reddit.com/r/FIU/comments/10tq63d",
    "media_urls": [],
    "other_urls": [],
    "postText": "My online MAC1147 exam was proctored over zoom instead of Honorlock like I’ve used at every other school. It took nearly 40 minutes for us to start the test because every student coming in late had to ask the same question that the professor had just answered before they showed up 30 minutes late. We didn’t even get to start the exam til almost 10pm, is this how the math department does their exams or is my professor just trying to be cute and do things a much harder way?",
    "comments": [
        {
            "level": 0,
            "comment": "It's left up to the professor. Some use Honorlock while some prefer to proctor it themselves.",
            "score": 7,
            "author": "AlertThinker",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s beyond dumb",
                    "score": 2,
                    "author": "wetbod",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Would you prefer to take the exam in person?",
                            "score": 1,
                            "author": "AlertThinker",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I live 5 hours away so no lol but having to wait in a zoom call for 40 minutes before being able to start and having people show up late interrupting while you’re taking the exam late at night is a stupid alternative to using honorlock whenever it’s convenient for the student",
                                    "score": 4,
                                    "author": "wetbod",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes, I agree. It's not fair to the other students. You can always send an email to the department chair to let them know.",
                                            "score": 4,
                                            "author": "AlertThinker"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had a calc professor do the same. Most professors I’ve had use Honorlock but a few teachers within FIU just want to be difficult and proctor this way",
            "score": 3,
            "author": "throwawayjellyg"
        }
    ]
}