{
    "id": "110ohn5",
    "score": 2,
    "title": "How is Computer Science at FIU compared to UCF?",
    "author": "kaypp3",
    "date": 1676231411.0,
    "url": "https://www.reddit.com/r/FIU/comments/110ohn5",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm currently a UCF student in my sophomore year and I want to have a career in South Florida as a programmer. I'm thinking about possibly transferring to FIU to get more connections in the place I want to live.\n\nI'm interested in game development in particular, but I don't necessarily need a job like that.\n\nHow is the CS program at FIU? Is there any significant difference in internship opportunities between UCF and FIU for CS students? Do any companies worth working at give a shit about the difference between a B.S. in Computer Science at UCF vs FIU?",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;if you can go to any other school especially UCF I'd recommend going there.\n\nwhy is that?",
                    "score": 1,
                    "author": "kaypp3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;But if you think FIU will hinder you from achieving a job at Faang then no it wont. If you work hard, study, do personal projects, grind leetcode, seek referrals for interviews you should be perfectly fine.\n\nYeah, I figured that most of the difference between applicants for a programming position would come from things that don't directly have to do with the particular university you go to.",
                                    "score": 1,
                                    "author": "kaypp3"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The one thing that FIU CS program has going is UPE/Init. It prob the best CS student org in all of Florida. It’s had lots of FAANG interns and FTE (myself being one of them). The club has a lot of resources and connections with big tech.\n\nOutside of that, the actual CS program is whatever, nothing special.",
            "score": 3,
            "author": "ViSAndres",
            "replies": [
                {
                    "level": 1,
                    "comment": "Isn't UPE a fraternity? (I'm a freshman, I have no idea about clubs or frats) and how do you join?",
                    "score": 1,
                    "author": "NatType1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nope, it's an academic honors society. They focus on CS and IT. I highly recommend them, they have great career resources and networking oppertunities. I got my position at Microsoft because of them :)\n\nTo join, you can simply just attend one of their events, message them on social media, or apply online. You can simply just attend their events and be active in the community or join their e-board/committees (recommend).",
                            "score": 2,
                            "author": "ViSAndres"
                        }
                    ]
                }
            ]
        }
    ]
}