{
    "id": "118pcw9",
    "score": 1,
    "title": "Transferring to FIU",
    "author": "Flektit",
    "date": 1677041718.0,
    "url": "https://www.reddit.com/r/FIU/comments/118pcw9",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey, I am planing to transfer to FIU. And for me not to pass SAT/ACT they require for me to have 30 credits, but by the end of this semester I will only have 28. Do you know any ways to add credits or if I do summer classes and apply before those classes end will credits from summer term be considered as credits so that I would have 30 in total? \n\nThanks",
    "comments": [
        {
            "level": 0,
            "comment": "You have to have 30 credits with a college English &amp; math. They will take AP from HS or a straighter line college math. Transfer.fiu.edu",
            "score": 1,
            "author": "Wearamask0912",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for reply. Do you know if I have to have 60 credits or 30 for them to approve me without SAT or ACT?",
                    "score": 1,
                    "author": "Flektit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can do 30, it just requires you to have at least one college math &amp; English complete &amp; passed",
                            "score": 1,
                            "author": "Wearamask0912",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s just says it requires 60, but I’ve seen 30 somewhere I am so confused with it",
                                    "score": 1,
                                    "author": "Flektit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The website has a 30 hour option, it’s just tricky and very specific due to state rules. You can transfer with 30 &amp; no SAT as long as you have a 2.0 GPA, and a C or better in college math and college English. But it has to be college level &amp; it has to be completed",
                                            "score": 1,
                                            "author": "Wearamask0912"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you speak Spanish, you can take the Clep Spanish test and you can get up to 8 college credits.",
            "score": 1,
            "author": "Kalu30",
            "replies": [
                {
                    "level": 1,
                    "comment": "Does it work the same way if I speak Ukrainian or Russian?",
                    "score": 1,
                    "author": "Flektit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If they have a Clep exam for Ukrainian or Russian, it would be the same, but I don't think they do.\n\nBut they have French and German if you are interested.",
                            "score": 1,
                            "author": "Kalu30"
                        }
                    ]
                }
            ]
        }
    ]
}