{
    "id": "11khfqk",
    "score": 4,
    "title": "Admitted to a major I didn't apply to ?",
    "author": "sonrisasdesol",
    "date": 1678144265.0,
    "url": "https://www.reddit.com/r/FIU/comments/11khfqk",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello! so sorry if this is a stupid question.\n\n I applied for the Digital Arts BFA Animation track, submitted my portfolio, etc for the Fall Semester. Today I logged into panther mail and surprise, i got accepted! Yay! But it says my major is Exploratory Humanities ? \n\nIs this a mistake ? Or is the program I wanted full and they just accept you into other tracks ? Help ? \n\nI really do not want to do nor pay for an exploratory degree when I am 100% sure of the major i'd chosen. I even checked my common app to see if I accidentally picked the wrong major, but no. Any guidance would be appreciated !",
    "comments": [
        {
            "level": 0,
            "comment": "If I remember correctly exploratory is like a track to the major you want until you can satisfy all the pre reqs then you can declare in the major you wanted if you want a for sure answer call admissions as soon as they open if possible and ask them or do their online chat option or email an advisor for the school your major would be declared in",
            "score": 1,
            "author": "Chance_Road8037"
        },
        {
            "level": 0,
            "comment": "No, the department is probably still reviewing your file",
            "score": 1,
            "author": "Wearamask0912",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope so! I already got the email about being accepted so hopefully i can resolve this soon. thank you for answering",
                    "score": 1,
                    "author": "sonrisasdesol"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What does your admission letter say? It might be that you didn’t meet admission criteria for your first choice major or applied after the deadline for Fall 2023 (feb 15 per the website) so you were placed in Exploratory. You could submit an application update to change your major to a back- up option (if you have one). AFAIK, the BA in Arts is not limited access and falls under CARTA (same college as the BFA) so it could be a good alternative? \nYou can also contact them at https://carta.fiu.edu/arts/degree-programs-and-deadlines/undergraduate/bachelor-of-fine-arts-in-digital-art/bfa-graphic-design-track/",
            "score": 1,
            "author": "MidnightBluCitrus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for responding!\n\nStill haven’t got the letter yet, only an email that says “Congratulations, youre admitted! Wait for your letter for the next steps”, and when i log into myFIU to accept and submit a deposit my major appears as Experimental Humanities w a Fine Arts track. \nBefore this week it appeared as Digital Arts BFA w the Animation Track, so it’s not as if its been wrong the whole time \n\nI applied by the deadline, I know because the portfolio GetAcceptd that we had to submit locks up at the exact hour of the deadline (it has happened to me in other occasions, haha). I dont know what to do, I will call to ask :( Again thank you for taking time to respond",
                    "score": 1,
                    "author": "sonrisasdesol"
                }
            ]
        }
    ]
}