{
    "id": "123fqpw",
    "score": 1,
    "title": "What is FIU's bachelor's marketing degree/program like? Should I transfer there?",
    "author": "SpaceHistorical8518",
    "date": 1679903632.0,
    "url": "https://www.reddit.com/r/FIU/comments/123fqpw",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm currently finishing up my associate's degree in Business Administration at GSU's Perimeter College. I have been accepted into their business school, J. Mack Robinson College of Business for the online BBA program in marketing. However, most of the courses are outdated, the assigned CRNs I was given have horrible professors teaching classes and ruining people's passion for marketing with over-the-top impossible busy work, and high tuition costs. Before you think I'm a slacker, I love marketing, especially digital marketing (social media really the most), and work that will help me succeed in my career. Busy work and homework that has no purpose and excessive loads is where I draw the line.\n\n&amp;#x200B;\n\nFor reference: I am an Honors College student at GSU and will be as well if I continue to get my four-year degree at J. Mack. My institutional GPA is 3.66 as of right now, but I have not finished my last classes yet. My leaning is more toward digital and social media marketing, with an interest in B2B marketing. \n\n&amp;#x200B;\n\nI've researched FIU and have taken an interest in their online BBA program in marketing. I have already applied because I was excited looking at the different course offerings and lower tuition costs, and from what I've researched, better rankings than GSU (it won't really matter in the end I know). If anyone has an experience with the online BBA marketing program or online program in general, what are the courses like? Are there lectures, presentations, notes, and good professors who teach fairly well? Are the courses updated content on information relevant to this era, digitally and socially at least? Are degrees respected from FIU? Scholarship opportunities? I would really appreciate it if someone could help.\n\n&amp;#x200B;\n\nI have to make a decision soon because I am dreading the idea of hating the classes I love the most because of professors who don't care about support or their lecture content.",
    "comments": []
}