{
    "id": "12i3o8d",
    "score": 1,
    "title": "Summer Term stats",
    "author": "Ok-Wishbone1281",
    "date": 1681176352.0,
    "url": "https://www.reddit.com/r/FIU/comments/12i3o8d",
    "media_urls": [],
    "other_urls": [],
    "postText": "Could any of you tell me if you had a low act or sat score and got moved to summer im waiting on my decision. I have a 4.2 weighted GPA and 18 ACT wondering if i’ll at least get in for summer. They told me i’ll have the decision this Wednesday.",
    "comments": [
        {
            "level": 0,
            "comment": "If ur in the top 10% of ur class by rank you could be admitted for the summer early fall direct for step.",
            "score": 2,
            "author": "Constant_Mood9495",
            "replies": [
                {
                    "level": 1,
                    "comment": "I had a low sat",
                    "score": 1,
                    "author": "Constant_Mood9495",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "did you apply for fall and get moved and were you in the top 10% tho?",
                            "score": 1,
                            "author": "Ok-Wishbone1281",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I applied for fall and was moved for summer 2023 and top 10%",
                                    "score": 1,
                                    "author": "Constant_Mood9495"
                                },
                                {
                                    "level": 3,
                                    "comment": "https://admissions.fiu.edu/admission-standards/freshman-pathways/",
                                    "score": 1,
                                    "author": "Constant_Mood9495",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "you think i could get moved to summer based off my stats im really trtnna go the admissions councilor said i should certainly get into other pathways if i dont get into fall but idk im worried",
                                            "score": 1,
                                            "author": "Ok-Wishbone1281",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I think you would, what’s your major?",
                                                    "score": 1,
                                                    "author": "Constant_Mood9495",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "sadly comp sci prolly competitive",
                                                            "score": 1,
                                                            "author": "Ok-Wishbone1281",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I got in for behavioral neuroscience applied as a safety but I think ima go here. One of the few colleges I thought was nice and could see myself at.",
                                                                    "score": 1,
                                                                    "author": "Constant_Mood9495",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "What is the early step fall program, I got it into it but I’m confused on if it’s good or bad",
                                                                            "score": 1,
                                                                            "author": "Own-Regular-6603",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "What’s ur major? But I’m in the step one pretty sure cause I got the grant for it too. But its for majors that are science and math intense u start off June 19 take 3 classes and go on to finish ur major if sets u up to graduate easier and gives u a first opportunity to get on campus and become a little more familiar  instead of fall",
                                                                                    "score": 1,
                                                                                    "author": "Constant_Mood9495",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "yep just got in i’ll being !",
                                                                            "score": 1,
                                                                            "author": "Ok-Wishbone1281",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Congrats u going during summer or fall?",
                                                                                    "score": 1,
                                                                                    "author": "Constant_Mood9495",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "i’m out of state and my school is really competitive not even close to top 10",
                    "score": 1,
                    "author": "Ok-Wishbone1281"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Applying as noncompetitive major is always the wisest. They always let you change majors (unless you're trying to change to a major in the business school)",
            "score": 1,
            "author": "BattalionX"
        },
        {
            "level": 0,
            "comment": "Hey!!!! I had a 5.01 GPA with very low SAT and ACT scores. I sucked at taking those Standardized Assessments. Regardless, I still got into the University, but I had to already start in the Summer Semester, which meant I only had a 2-week vacation. Honestly, I saw it as a big advantage to get those courses needed to graduate out of the way and start my courses related to my career/ degree by my second full semester here at FIU. You got this!!!! Good luck!",
            "score": 1,
            "author": "EllyMimi_05",
            "replies": [
                {
                    "level": 1,
                    "comment": "Weighted GPA was like 5.01 around there and unweighted was like 3.9 something",
                    "score": 1,
                    "author": "EllyMimi_05"
                },
                {
                    "level": 1,
                    "comment": "update got in thank you!!!",
                    "score": 1,
                    "author": "Ok-Wishbone1281"
                }
            ]
        }
    ]
}