{
    "id": "12iug2w",
    "score": 23,
    "title": "Don’t rent at the One",
    "author": "HodorInvictus",
    "date": 1681240858.0,
    "url": "https://www.reddit.com/r/FIU/comments/12iug2w",
    "media_urls": [],
    "other_urls": [],
    "postText": "Don’t sign a lease with the One at University City if you’re able to live anywhere else. Management regularly ignores pressing issues, and if you’re lucky enough to not have a package or mail stolen or lost by staff, you won’t be able to pick it up for almost a week.",
    "comments": [
        {
            "level": 0,
            "comment": "I've read the reviews on Google Maps before out of curiosity, it's insane that an apartment complex can get away with what they do just because of the university association. \n\nA class action lawsuit really should be in the works at this point against that leasing company.",
            "score": 19,
            "author": "HeidyKat"
        },
        {
            "level": 0,
            "comment": "I lived there for a year from 2020 to 2021. I avoided the mail issues cause I had stuff shipped to my parents house who live here in Miami, and the 1 problem I had was when 2 of my guests had their cars towed exactly 5 minutes after the “curfew” was up. \n\nI still see tow trucks sitting waiting to tow people the second the clock passes the curfew time.\n\nI guess I got lucky that I didn’t have many personal issues there.",
            "score": 9,
            "author": "WorstRengarKR",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay so just parking and mail, I can live with that.",
                    "score": 1,
                    "author": "Tati_998"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My 6 year old sister Can run that building better than those literal children there",
            "score": 8,
            "author": "kloklikewassup"
        },
        {
            "level": 0,
            "comment": "Dude, does anyone have a good experience at this apartment because I only have one year of school left and this is the only place I can afford. Please tell me someone does not hate it there.",
            "score": 5,
            "author": "Tati_998",
            "replies": [
                {
                    "level": 1,
                    "comment": "I live at the one. i haven’t rlly had any issues other than people being dirty and leaving their trash in the hallways which makes the hallway stink. but other than that i don’t rlly have any complaints. \ni have also seen people who complain about their electric bill being too expensive ($60-$100) but mines always below $30 (just learn how to not use up electricity). \nwhenever i report an issue to management, they usually fix it within 2 days.",
                    "score": 3,
                    "author": "Either_Ad2139",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I had my suspicions, I mean it’s student housing and everyone there is there to be at school or just out of school. Early mid 20s it’s kinda what I was expecting. But thank you, definitely putting my worries at ease.",
                            "score": 1,
                            "author": "Tati_998"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "why didnt u try lapis?",
                    "score": 1,
                    "author": "Potential_Yam_3562",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They are sold out on everything",
                            "score": 1,
                            "author": "Tati_998",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "they have 4x4 and 5x5s left....",
                                    "score": 1,
                                    "author": "Potential_Yam_3562",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "🤣🤣🤣🤣🤣🤣",
                                            "score": 1,
                                            "author": "Tati_998"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "? why did u delete ur comment lol",
                                    "score": 1,
                                    "author": "Potential_Yam_3562",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I didn’t delete anything bru",
                                            "score": 1,
                                            "author": "Tati_998"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}