{
    "id": "12oj7cx",
    "score": 2,
    "title": "FIU's Online Degrees?",
    "author": "[deleted]",
    "date": 1681668275.0,
    "url": "https://www.reddit.com/r/FIU/comments/12oj7cx",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm deciding on going here for the online Electrical Engineering degree, has anyone been through the process of being enrolled or finished the degree? If you haven't done this degree, how has the overall online experience been?",
    "comments": [
        {
            "level": 0,
            "comment": "This silence should answer your question, bud.",
            "score": 1,
            "author": "CheeksClappinn"
        },
        {
            "level": 0,
            "comment": "I've only been in the program from about 19 credits so far and I've liked it so far. There's a mix of online and in-person students in the online courses so I don't think the classes are really different. You're class variety is a little limited by semester so if you get off track, you might have to wait to take a class and there's generally one professor teaching that course for the semester. Also, not all classes are online (ex. Power Electronics, Electronics 2) so you get a little restricted in your electives. Also, since it's online you have to be really self motivated to do it. I ended up doing this program because ASU and UND were 2x as much and I couldn't get Stony Brook to return my emails.",
            "score": 1,
            "author": "Any-Order-3065",
            "replies": [
                {
                    "level": 1,
                    "comment": "How long are the online courses for FIU? Are they 16 weeks or 8 weeks ?",
                    "score": 1,
                    "author": "Fayson_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Full semester. ASU had 8-week classes I believe.",
                            "score": 1,
                            "author": "Any-Order-3065"
                        }
                    ]
                }
            ]
        }
    ]
}