{
    "id": "1398sqj",
    "score": 10,
    "title": "Academic dimissal appeal help",
    "author": "woah-woah543",
    "date": 1683338771.0,
    "url": "https://www.reddit.com/r/FIU/comments/1398sqj",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was just academically dismissed from fiu and my gpa is very close to a 2.0 what would be my chances to appeal this academic dismissal and be reinstated in the university. Any help would be greatly appreciated.",
    "comments": [
        {
            "level": 0,
            "comment": "Man if you are in college, and having a shitty gpa you need to reconsider your options. Why are you failing college? Do you even wana be there? You go to college because you want to, you want the education, and you work hard for what you want. Do you really want to be there? Is there a learning disability? Are you taking too many classes? Maybe it's too much and a community college like someone mentioned May be best. Reset, and eventually transfer back. \n\nSit down and write what your goals are, why you are doing so bad, and what factors are contributing to your failure in college. Then have answers for each contributing factor and how you plan to address these. Have an answer as to why you should be given another chance and not have another student take your spot and the opportunity to get an education. \n\nAll these answers can then be used to address your appeal",
            "score": 17,
            "author": "DrLuv86"
        },
        {
            "level": 0,
            "comment": "Perhaps attend community college and get good grades there and then petition to come back.",
            "score": 8,
            "author": "Maleficent-Homework4"
        },
        {
            "level": 0,
            "comment": "I would say meet with your advisor if you still can and see what they can offer as a better resolution. but honestly attending a community college, depending what year you are, can definitely go a long way and you can always come back to FIU",
            "score": 5,
            "author": "SnooTomatoes6272"
        },
        {
            "level": 0,
            "comment": "You don’t got your priorities in order. Most of these classes you just have to look up stuff online and you can get a good grade. Best to consider why did you attend college in the first place before you waste any more time and money.",
            "score": 4,
            "author": "andrew17530"
        },
        {
            "level": 0,
            "comment": "I would advise to go to community college to get as much of your pre-reqs and classes towards the bachelors you want done- get good grades and save money while doing so, plus it will help you learn how to study and do well in courses- college isnt easy and i dont know your major- dont give up, just focus on your goals and doing better. Once your prerequisites are done go back to fiu and show them your grades and to appeal the dismissal. Best of luck and you got this!",
            "score": 3,
            "author": "erienight"
        },
        {
            "level": 0,
            "comment": "FIU has grade forgiveness. You can use it 3 times. The bad grades are still there but they do not count toward your gpa. I'd recommend you use these on the worst grades that also have a lot of weight like a Physics class would be like 4 credits so if you have an F on that one def use it to improve your gpa. However, you can only use the grade forgiveness on a class once you have passed said class. So if you got an F first, you cannot use the grade forgiveness until you pass it with a C or higher or D or higher if its an elective",
            "score": 1,
            "author": "redditmodsaregay005"
        }
    ]
}