{
    "id": "13dxwtr",
    "score": 0,
    "title": "Dorm Question",
    "author": "Olordihavemydoubtsss",
    "date": 1683740702.0,
    "url": "https://www.reddit.com/r/FIU/comments/13dxwtr",
    "media_urls": [],
    "other_urls": [],
    "postText": "Anyone know what happens if you get in trouble during a room check ? I already got in trouble before with the FIU Student Honor conduct or whatever because my RA reported me for not checking in guest 🙄 which was so annoying because it was a friend who lives on campus and wasn’t even staying over they just came up to my room. Anyways , throughout the school year we have room checks where they don’t even do anything. They simply walk in the room and turn their head left and right and leave. The last room check they came when no one was home, looked through all of our drawers, and even looked through my closet. They ended up finding a recycled candle container where I had literally ONE ROACH of a cbd joint. Not even a full joint it was just the filter.Now I’m waiting for my meeting and I’m super nervous because I have already got in trouble with housing for the guest situation. Also I’m super upset because they never check the rooms properly and because no one is home they went through my personal things and got me in trouble. Also the container was a recycled candle container that I kept in my own plastic drawers so should they even be allowed to open it since they legally cannot open furniture that does not belong to FIU? On top of everything according to my roomates boyfriend who was visiting came home and said they even took pictures of personal Polaroids I took which is extremely weird. To anyone who is dorming GOOD LUCK. They give the RAs a little bit of power and if they decide they don’t like you will bully you and make living on campus a nightmare. pray for me y’all 😢",
    "comments": [
        {
            "level": 0,
            "comment": "There’s definitely more you’ve done you’re not telling. Having lived on campus for two years and being the room that hosted parties 2 nights a week minimum they don’t care at all u less you’re vandalizing or doing illegal things even just drinking underage outside your room of your in your room the most they’ll do is noise complaint and tell you all to turn it down or leave depending on how many people called about it",
            "score": 19,
            "author": "TheBigNads",
            "replies": [
                {
                    "level": 1,
                    "comment": "that makes no sense lol. wym you threw parties twice a week and never got caught but I did  \"more then I've told\" and got caught ? also I call cap on the multiple parties a week as any \"party\" thrown on campus get shut down within the first 20 mins and are lame asf anyway.",
                    "score": 0,
                    "author": "Olordihavemydoubtsss"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What dorm do you live in? I have lived in Panther Hall, Tamiami, UA, and Parkview and I have never had an RA or anyone do what you explained. I also worked in UT at the desk. Who's bad side did you get on? Also they are not supposed to look through your drawers or closet or anything.",
            "score": 11,
            "author": "Awkward_Benefit665"
        },
        {
            "level": 0,
            "comment": "I’ve never had an RA open a drawer or anything like that. Also never heard of an RA reporting a guest like that. If you have a candle or any type of contraband item they will reschedule a walk through with fiu police to look through and make sure there’s nothing else. They did that to one of my friends who had a candle freshman year. Just move that type of stuff by the day they do the recheck and it should be fine",
            "score": 3,
            "author": "czemma",
            "replies": [
                {
                    "level": 1,
                    "comment": "yeah honestly I hate myself for not hiding it deeper than just my drawers but I genuinely thought they cannot go through our closet and personal drawers like that. Also the container was a recycled candle container. They even went through my roommate's closet and found her bin of liquor. I wasn't home so I don't really know what happened but according to my roommate's boyfriend who came home there were multiple people in the dorm besides the RA's and that they took pictures of my polaroids I had on my desk.",
                    "score": 2,
                    "author": "Olordihavemydoubtsss",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sorry that happened, genuinely never heard of that at all. The other poster talking about throwing parties is honestly right. RA’s have never been known for being strict for any building. Normally during a “check” they message the group chat ahead of time and practically walk through with their eyes closed. Your RA sounds like a weirdo",
                            "score": 1,
                            "author": "czemma"
                        }
                    ]
                }
            ]
        }
    ]
}