{
    "id": "13o6nv3",
    "score": 2,
    "title": "missing 6 credits to graduate, can I still participate in commencement? HELP",
    "author": "brwgd",
    "date": 1684703946.0,
    "url": "https://www.reddit.com/r/FIU/comments/13o6nv3",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have met all my degree requirements but im missing 6 credits in order to complete the 120 a bachelor degree requires. Im currently taking the max credits for this summer semester and was hoping to be able to attend commencement and just complete the 6 credits online in fall. (moving back home so I won't be able to attend commencement if I graduate after fall semester)\n\nHas anyone done this? Would I be able to walk in commencement with only 114 credits?\n\n\\-Also, I saw on myfiu that I was eligible to apply for graduation. Im not sure if that means id be able to walk.\n\n&amp;#x200B;\n\n\\*my advisor takes 2 -3 weeks to reply so asking her isn't really an option, next appointment available is after graduation app deadline so im hoping to get answers here!",
    "comments": [
        {
            "level": 0,
            "comment": "Hi! Please speak to your advisor to get the credit requirement waived and explain your situation- they will do it! They give you a form to sign and send it to the dean to approve. Do this ASAP !!",
            "score": 5,
            "author": "Surpri_se",
            "replies": [
                {
                    "level": 1,
                    "comment": "im going to try this. Anytime I've called and asked for information regarding this I get a different answer and none of them have mentioned this. Thank you!",
                    "score": 1,
                    "author": "brwgd"
                }
            ]
        },
        {
            "level": 0,
            "comment": "btw I took a CLEP exam, the credits didn't count towards my degree so that's not an option either :(",
            "score": 3,
            "author": "brwgd",
            "replies": [
                {
                    "level": 1,
                    "comment": "Which CLEP exam ? I took the Spanish CLEP and was able to get 10 credits for the score I got, try it out if you’re Spanish speaking maybe.",
                    "score": 1,
                    "author": "herewegoagaingisi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "it was put under gen elec credit tho so it depends what you need",
                            "score": 1,
                            "author": "herewegoagaingisi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I took Spanish as well and got 10 credits because I scored well. Unfortunately CLEP credits count as transfer credits &amp; I've already reached the 60 credit transfer maximum. So I took it for no reason :/",
                                    "score": 1,
                                    "author": "brwgd",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Dam I would try the advisor, maybe they can make an exception for the 6",
                                            "score": 1,
                                            "author": "herewegoagaingisi"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can request a max credit override from your dept to allow you to take the last 6 credits in the summer. Make sure to pick something that will be relatively low effort, since you'll be taking a overloaded semester.",
            "score": 3,
            "author": "dannycp22",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have a 2.5 GPA, last time I spoke to an advisor they said that the dean won't approve it with that GPA so I didn't even bother",
                    "score": 1,
                    "author": "brwgd"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Definitely come to come campus and demand to speak with your or Any advisor available. As it’s time considering. I don’t know your major so it could be one of those 50/50 cases. So finalize that this week. Your next option is immediately go to mdc or broward college and take those classes there asap.",
            "score": 2,
            "author": "Chip305",
            "replies": [
                {
                    "level": 1,
                    "comment": "its a liberal arts degree so nothing too major. going to mdc was an option but that needed to be approved by my advisor which I haven't been able to get in contact with. Deadline already passed for summer",
                    "score": 1,
                    "author": "brwgd"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Basically what all other redditors said - talk to your advisor or a different one from the department. You will need 120 credits to graduate, but you maybe able to CLEP.",
            "score": 1,
            "author": "MidnightBluCitrus",
            "replies": [
                {
                    "level": 1,
                    "comment": "CLEP credits count as transfer credits &amp; I've already reached the 60 credit transfer maximum. Ive heard of some people participating in the commencement ceremony and just returning the next semester to fulfill the last 1-2 classes. I just wasn't sure if FIU allowed this",
                    "score": 1,
                    "author": "brwgd"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had the same problem and spoke to my advisor asking if I could walk commencement because I would be moving. She told me I would have to submit a form agreeing to the terms of signing up for late graduation. The form basically said that because you applied for commencement late, tickets are not guaranteed, your name on the commencement merchandise and pamphlets is also not guaranteed, etc. After all this she declined my submission and told me that she couldn’t approve my request. That I had to have completed all my credits in order to walk commencement.  My advisor said it’s a tough situation because she needs to sign off on you being able to graduate and if you don’t have the requirements they are basically lying and could get in trouble. Idk how much of all that is true or if she was just being difficult. Hopefully you have better luck!",
            "score": 1,
            "author": "urfavecherry"
        }
    ]
}