{
    "id": "13zngvk",
    "score": 8,
    "title": "Recommendations for what to bring for moving on campus?",
    "author": "michaelbradford21",
    "date": 1685821895.0,
    "url": "https://www.reddit.com/r/FIU/comments/13zngvk",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm moving into Lakeview North, would like any recommendations on what I should bring for bedding, maybe decor, anything practical etc. I am not American and do not know much about college in general. Please any help would be appreciated :)",
    "comments": [
        {
            "level": 0,
            "comment": "I’m American and I’d still like to know lol",
            "score": 3,
            "author": "Nervous_Drag_218",
            "replies": [
                {
                    "level": 1,
                    "comment": "well perhaps we shall make ourselves good acquaintances on campus? i am from the britannia so i must warn you i may have unsightly features to the laurentian such as yourself (buck teeth and pasty white colour)",
                    "score": 2,
                    "author": "michaelbradford21",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Englishman innit",
                            "score": 1,
                            "author": "AliGaming25"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Get a laundry hamper that has wheels, get little stick on wall hangers, mini fridge, etc",
            "score": 1,
            "author": "Potential_Yam_3562",
            "replies": [
                {
                    "level": 1,
                    "comment": "i thought all units came w fridges already, is this a better idea for a personal snacking endeavor?",
                    "score": 1,
                    "author": "michaelbradford21",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Personal snacking !!",
                            "score": 1,
                            "author": "Potential_Yam_3562"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can only speak for my time in the University Apartments, bring some cookware if you intend on cooking, a 12’ frying pan and a decent sized pot that you can boil stuff in are life savers. Depends if they have a stove though. I think the mattress in UA is a twin size but bring sheets, pillows and a mattress pad for whatever size the bed is. If you get there and there isn’t a microwave and nobody else brought one, it may be worth investing in one. Same for a mini fridge if you have roommates who might take your food. \n\nThe issue is gonna be though if you have to go back to your home lugging all the heavy crap back or getting rid of it when you no longer live on campus.",
            "score": 1,
            "author": "Ubisuccle",
            "replies": [
                {
                    "level": 1,
                    "comment": "thankfully i know the bed is twin xl but i still dont know if they come w mattresses (?)\n\nand my family is moving to lakeland which is about 4ish hours away so i may have to bring a lot of stuff upstate by car.",
                    "score": 1,
                    "author": "michaelbradford21",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They come with a mattress though there may be dubious bodily fluids that are staining it which I why I recommend a mattress pad to go over it. Adds a bit more cushin and keep the nastyness off of your sheets.\n\nAnd alright then yea moving stuff shouldn’t be too much of an issue then. If you had to fly in it could be a problem leaving.",
                            "score": 1,
                            "author": "Ubisuccle"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Walmart is just down the street. Come light and buy whatever you need once you've scoped out the room.",
            "score": 1,
            "author": "dsm88",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good idea. Cheers",
                    "score": 1,
                    "author": "michaelbradford21"
                }
            ]
        }
    ]
}