{
    "id": "84om44",
    "score": 108,
    "title": "Brand new pedestrian bridge collapsed",
    "author": "Headphonesss",
    "date": 1521137569.0,
    "url": "https://www.reddit.com/r/FIU/comments/84om44",
    "media_urls": [
        "http://www.miamiherald.com/news/local/community/miami-dade/west-miami-dade/article205316174.html"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Not sure if this needs to be said, but please keep this thread civil in the wake of this tragedy.",
            "score": 1,
            "author": "g6in3d"
        },
        {
            "level": 0,
            "comment": "WTF ",
            "score": 30,
            "author": "Mr_Unbiased"
        },
        {
            "level": 0,
            "comment": "Absolutely embarrassing. Hope everyone is safe.",
            "score": 29,
            "author": "AegonTheMeh",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lowest bidder bullshit. How awful",
                    "score": 21,
                    "author": "miami_highlife",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you have any sources on this? I’m  just asking so as to not spread any misinformation to anyone in the thread.",
                            "score": 10,
                            "author": "Chiefixis",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I work as a marketer at an engineering firm. When I first started, I remember having a conversation with one of the PEs about bridges. Typically, the Florida Department of Transportation will give construction contracts to the lowest bidder. This may not apply in this case though as I doubt this is a FDOT contract considering it's on a University Campus.",
                                    "score": 11,
                                    "author": "reptar_reptar",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It was paid for by a [U.S. DOT TIGER grant that was awarded in 2013](http://www.cityofsweetwater.fl.gov/tigeruni.html). The documents related to the award aren't on FIU's website anymore, though, so the bidding process and requirements aren't clear.",
                                            "score": 11,
                                            "author": "[deleted]"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "http://www.miamiherald.com/news/local/community/miami-dade/article205426634.html\n\nNot a FDOT project, but through FIU:\n\n&gt; The Florida Department of Transportation distanced itself from the bridge construction and collapse late Thursday, saying that the company hired by FIU’s design team to provide “an independent, secondary design check” had not been pre-qualified for the job. That design check is often a technicality but is required by the state.\n\n&gt; In a fact sheet of “preliminary findings,” FDOT emphasized that the Florida International University pedestrian project was a “local agency project” under contract with FIU, and not one managed by the state.\n\nFDOT fact sheet/press release here:\n\nhttp://www.fdot.gov/info/CO/news/newsreleases/03152018-PRELIMINARY-FACT-SHEET-ON-FIU-PEDESTRIAN-BRIDGE-COLLAPSE.pdf\n\n",
                                            "score": 2,
                                            "author": "danwin"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Fatalities reported ",
                    "score": 5,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Structural engineer here.  So many things could have caused this terrible accident.  From the renderings it appears to be designed as a cable supported bridge.  But from the collapse footage I do not see the support structure (column/tower) the cables are supported from, or the support cables.  I am wondering if they were building this in sections, and set this span before the support structure was in place.  The bridge then suffered a shear failure and collapsed under its own weight.",
            "score": 17,
            "author": "milwaukeeblizzard",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm no structural engineer, but even I know that a cable-supported bridge needs cables! Can't wait to hear what actually led to this happening. ",
                    "score": 12,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Me too...I wonder how thick that concrete deck was.  Would be interested in seeing the design plans, maybe they'd supply them via a freedom of information request",
                            "score": 4,
                            "author": "milwaukeeblizzard",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Florida has very very broad open recurred laws. You could get every single thing related to this project by making a public records request",
                                    "score": 9,
                                    "author": "Expiscor"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "A recent news story mentioned there were cables attached however they had loosened.\n\nReportedly, the cables were being tightened just before the collapse. ",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The thing that collapsed only contained the pedestrian span and not all of the heaviest elements. The bridge (with its support cables) was scheduled to be fully completed in Dec. 2018/2019. \n\nhttp://www.miamiherald.com/news/local/community/miami-dade/west-miami-dade/article204506084.html\n\n&gt; Instant bridge? Not quite, but in a single morning Florida International University dropped a new elevated pedestrian span into place over the Tamiami Trail to provide students a safe route over the perilous roadway for the first time.\n\n&gt; Once it’s finished in early 2019, the new pedestrian bridge will link FIU’s Modesto A. Maidique Campus directly to the small suburban city of Sweetwater, where the university estimates 4,000 of its students live.\n\n&gt; The rapid span installation was the result of months of preparation. The bridge’s main 174-foot span was assembled by the side of the Trail while support towers were built at either end.\n\n\n",
                    "score": 5,
                    "author": "danwin"
                },
                {
                    "level": 1,
                    "comment": "How likely is it for these types of bridges to experience shear failure at the support?  From the looks of it the one side of the bridge is completely along the road and split from the beam while the other is still attached. Also is it normal procedure to not have installed tension cables while finishing the rest of bridge? ",
                    "score": 4,
                    "author": "RickardsBedAle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't know the likelihood, shear failure is a guess from the pics I saw because the failure is close to the support on one end.  I'm not a bridge specialist so I couldn't tell you about leaving the tension cables off during construction, but my gut tells me that at least contribited to why it failed.  They were using a new type on concrete as well, typical concrete takes 28 days of curing to reach full strength...it's possible they didn't let it cure enough.  I think it will be a combination of factors once the forensic investigation in complete.",
                            "score": 4,
                            "author": "milwaukeeblizzard"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There are reports there was some kind of \"stress test\" underway. Can you comment on what a \"stress test\" on a bridge might entail? I would imagine it's akin to lightly rapping your knuckles on a house wall to see if there's any hollow spaces or resonance, not dropping a huge live load on the span, right?\n",
                    "score": 3,
                    "author": "SU_Locker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To my understanding, they basically have sensors all along the bridge to report the amount of stress each section is experiencing. ",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The one time our university makes the front page of reddit and it’s because of this tragedy. My thoughts and prayers goes to the victims 🙏🏻",
            "score": 19,
            "author": "DanyaBananya"
        },
        {
            "level": 0,
            "comment": "MCM Construction and FIGG Bridge Design\n\nThese are the contractors responsible for the bridge.\n\nSource: http://www.mcm-us.com/news/mcm-awarded-fiu-pedestrian-bridge-project",
            "score": 11,
            "author": "savagediscourse",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well. They are the man crush monday group. They were off by a few days.",
                    "score": 2,
                    "author": "m305105"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 20,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Insurance pays, but whose?",
                    "score": 5,
                    "author": "finite_automata"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How about some CE students take a guess as to what happened?",
            "score": 10,
            "author": "tomatosoupsatisfies"
        },
        {
            "level": 0,
            "comment": "Live news stream here\n\nhttps://youtu.be/BMR0irwxSkc",
            "score": 9,
            "author": "JLev1992",
            "replies": [
                {
                    "level": 1,
                    "comment": "Video linked by /u/JLev1992:\n\nTitle|Channel|Published|Duration|Likes|Total Views\n:----------:|:----------:|:----------:|:----------:|:----------:|:----------:\n[FIU bridge collapse live coverage: Several killed in pedestrian bridge accident &amp;#124; ABC News](https://youtu.be/BMR0irwxSkc)|ABC News|2018-03-15|0:00:00|152+ (92%)|1,640\n\n&gt; A pedestrian bridge stretching across a street on the...\n\n---\n\n[^Info](https://np.reddit.com/r/youtubot/wiki/index) ^| [^/u/JLev1992 ^can ^delete](https://np.reddit.com/message/compose/?to=_youtubot_&amp;subject=delete\\%20comment&amp;message=dvr6xox\\%0A\\%0AReason\\%3A\\%20\\%2A\\%2Aplease+help+us+improve\\%2A\\%2A) ^| ^v2.0.0",
                    "score": 1,
                    "author": "_youtubot_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Turning on the local news, hadn't even seen anything on this yet. I got a notification from Iheartradio of all places.\n\nEdit: It claimed mass casualties reported. I really  hope they are wrong. ",
            "score": 7,
            "author": "UserNotSound",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are definitely going to be multiple dead, just based on the pictures, but remember that a casualty is not the same as a death. ",
                    "score": 6,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Louis Berger a non FDOT-certified engineering firm performed the secondary design check. This goes against the agreement between FIU and Florida. [Last paragraph ](http://www.miamiherald.com/news/local/community/miami-dade/article205426634.html) ",
            "score": 7,
            "author": "arraysbeginat1"
        },
        {
            "level": 0,
            "comment": "This whole situation is horrible. What’s also horrible is that the bridge was actually pretty necessary. 8th street has proved to be too dangerous to cross, especially after losing a student in the fall. How can they build that bridge now without the heavy feeling of knowing they spent millions of dollars only for it to come crashing down? Knowing about all the people that lost their lives due to someone’s negligence... it just feels wrong to have a bridge now. If they do, it should at least honor the victims and be a memorial. I still wouldn’t drive under it tho",
            "score": 9,
            "author": "myiaaaaa",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is very needed. Crossing 8th street, even with the right of way, is sketchy. Sounds awful, but cant let this get in the way of progress. Jail those accountable, revamp the process. They rebuilt the MDC parking garage, theyll rebuild the bridge (hopefully)",
                    "score": 3,
                    "author": "miami_highlife"
                }
            ]
        },
        {
            "level": 0,
            "comment": " Saw this happening. It was surreal. Heard a loud bang and the whole thing was down, like a stack of legos.\n\nRIP to the departed. I am shook. ",
            "score": 13,
            "author": "security_dilemma"
        },
        {
            "level": 0,
            "comment": "Guys I dont go to your school, but wasn't this bridge a new bridge, did they cut building code rules during the building of it?",
            "score": 6,
            "author": "FallsZero",
            "replies": [
                {
                    "level": 1,
                    "comment": "We won't know for sure the cause for a while. It was new and wasn't planned to be open for months/year.",
                    "score": 7,
                    "author": "NarrowLightbulb"
                },
                {
                    "level": 1,
                    "comment": "~~From what I've heard, the bridge barely had any inspections done on it because it was rushed (it was originally supposed to be done next year).~~",
                    "score": 2,
                    "author": "g6in3d",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was still supposed to be done next year. They just put the expanse in place this week, but it wasn't opened or anything.",
                            "score": 5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I stand corrected then. ",
                                    "score": 0,
                                    "author": "g6in3d"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "@wearemcm @figgbridge - twitter handles for the companies that designed and implemented the bridge. ",
            "score": 7,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Apparently they even used \"new methods\" to build this bridge. Sounds like they cut corners to get it done quick. ",
            "score": 36,
            "author": "TheOnlyNoah",
            "replies": [
                {
                    "level": 1,
                    "comment": "I thought it was a little funny how the video about the collapse is immediately followed by the construction company's \"new method\" video.",
                    "score": 16,
                    "author": "haigom"
                },
                {
                    "level": 1,
                    "comment": "Edit: removing the original link I posted to link to abc's earlier stream with press conference towards the end:\n\nhttps://youtu.be/BMR0irwxSkc\n\nIt's long, but skip through it, a lot of relevant information is provided throughout.",
                    "score": 8,
                    "author": "JLev1992",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No they just hung it Saturday. They had been building it on the south side of 8th street for a few months, then swung it out on top of these multi wheeled vehicles on Saturday.  I drive through there every fucking day.  Was planning on going to school at around the time this shit collapsed too. Thank god I decided to go grab a drink instead.",
                                    "score": 20,
                                    "author": "JLev1992",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I thought you guys are on spring break?",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "We are, but I still have midterm papers to write, so I've been spending a lot of time working in the library.\n\nI also drive through there 3 or 4 days a week to go to work.",
                                                    "score": 11,
                                                    "author": "JLev1992"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Maybe the length of it, but the construction has been going on for a while already, think months",
                                    "score": 3,
                                    "author": "Udonis-"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's exactly what I think it is, the amount of time it took them to build it sounded fishy from jump.",
                    "score": 6,
                    "author": "timmyreaper"
                },
                {
                    "level": 1,
                    "comment": "Not really. The method itself is not new. It just seems like it have been applied to bridges until this attempt.",
                    "score": 2,
                    "author": "bla8291"
                },
                {
                    "level": 1,
                    "comment": "Welcome to capitalism",
                    "score": 1,
                    "author": "RecallRethuglicans"
                }
            ]
        },
        {
            "level": 0,
            "comment": "so sad and crazy man, i can't believe this. I was there saturday when they were putting it up. I drive through that street every week too. ",
            "score": 7,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I haven't even set foot on campus yet, but god this makes me feel awful",
            "score": 6,
            "author": "Krakshotz"
        },
        {
            "level": 0,
            "comment": "This is tragic. Rest in peace to whoever may have past away from this incident.",
            "score": 4,
            "author": "savagediscourse"
        },
        {
            "level": 0,
            "comment": "How does this even happen? This isn't fucking China",
            "score": 15,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "China's bridges are better than this and they make it them in like 2 weeks.",
                    "score": 42,
                    "author": "AegonTheMeh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well they do have that one bridge that was literally made out of garbage. ",
                            "score": 6,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "The Chinese learned capitalism doesn’t work",
                            "score": 5,
                            "author": "RecallRethuglicans"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "it's funny because Chinese infrastructure is honestly better most of the time than the US.",
                    "score": 10,
                    "author": "saccharind"
                },
                {
                    "level": 1,
                    "comment": "The reason china's stuff breaks down isn't necessarily because they build things cheaply (although a lot of the times they do), they just don't maintain things like we do here. It's the attitude they have towards private property, they are accustomed to the government fixing it",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hope everyone gets rescued safely 😔😔",
            "score": 7,
            "author": "Headphonesss"
        },
        {
            "level": 0,
            "comment": "I was sad when I heard about the collapse.  I broke down when I heard it was now a recovery mission...\n\nFrom your honorary Bingo \"actor out\" when the mic didn't work on the cruise ship.  And after then an honorary employee.  I'm so sorry...\n\n[Just so you don't think I'm lying for karma](https://imgur.com/a/0voiY) [and](https://imgur.com/a/NNPO0)\n\nDave/IONTOP\n\n",
            "score": 2,
            "author": "IONTOP"
        },
        {
            "level": 0,
            "comment": "Sad. The president of the university was bragging on TV on Saturday, about a bridge, which needed to be built so many years ago, which collapsed within 5 days...",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "They couldn't wait until the Summer to get it done, they had to get it done this week, of course. Public image = $$$. Hope their hackjob was worth it",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "What about making sure the structure is stable against a hurricane? The cables, while not necessary for typical loading, help protect against vibrations like those seen from wind.",
                    "score": 2,
                    "author": "letsseeaction"
                },
                {
                    "level": 1,
                    "comment": "It wasnt done. It was just raised this weekend, and the bridge isnt scheduled to be done until early 2019.",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -13,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The bridge was built by MCM Constructions and FIGG. I don't think FIU engineering department had anything to do with it.",
                    "score": 30,
                    "author": "AegonTheMeh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[\"The 174-foot, 950-ton section of the bridge was built adjacent to Southwest Eight Street using Accelerated Bridge Construction (ABC) methods, which are being advanced at FIU's Accelerated Bridge Construction University Transportation Center (ABC-UTC).\"](https://www.reddit.com/r/FIU/comments/84om44/brand_new_pedestrian_bridge_collapsed/)",
                            "score": 5,
                            "author": "Rtrock",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"Designed as a cable-supported bridge, the pedestrian walkway is the product of a collaboration between **MCM Construction and FIGG Bridge Design, the firm responsible for the iconic Sunshine Skyway Bridge over Tampa Bay.\"**\n\nThe actual process was not carried out by FIU at all. Those are just building techniques which are researched at FIU. But whatever, not a time to assign blame. More information will come.",
                                    "score": 15,
                                    "author": "AegonTheMeh",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;\"Designed as a cable-supported bridge, the pedestrian walkway is the product of a collaboration between MCM Construction and FIGG Bridge Design, the firm responsible for the iconic Sunshine Skyway Bridge over Tampa Bay.\"\n\nLet's hope that was Sunshine Skyway #2, because the Sunshine Skyway also collapsed.",
                                            "score": 5,
                                            "author": "HELLOMrJackpots",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That wasn't because of the bridge itself though. Just about any bridge would collapse if you ram a 600 foot boat into it.",
                                                    "score": 6,
                                                    "author": "toms47"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, they built it. But guess who engineered it? The FIU engineering department. This bridge was considered their \"pride and joy.\" ",
                            "score": -10,
                            "author": "Le-Marco",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not how it works. FIU engineering doesn't decide shit. FIGG Bridge Design, like their name suggests, design it and MCM Construction build it but they have engineers and others present for safety measures. FIU didn't hand them a sketch and said \"build it\". Not sure what you are on about.",
                                    "score": 10,
                                    "author": "AegonTheMeh",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm also pretty sure that FIU engineering's involvement in the project is mostly just PR crap. What kind of engineering school wouldn't jump on the opportunity to promote themselves with a project like this?\n\nThere's a lot of actual work involved in a project like this, and I just can't see FIU professors getting excited enough about a bridge to take time out of their jobs to work on it.",
                                            "score": 6,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Pretty sure I read somewhere there’s over 70 FIU engineering school grads working at MCM.",
                                                    "score": 1,
                                                    "author": "raerae91"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lets not assign blame until we have analysis done. Now is the time to help and mourn. ",
                    "score": 12,
                    "author": "finite_automata"
                },
                {
                    "level": 1,
                    "comment": "I don’t think that is us. Sucks either way. ",
                    "score": 7,
                    "author": "TheMiamiDolfan"
                },
                {
                    "level": 1,
                    "comment": "I doubt FIU Engineering had anything to do with it. We don’t even have a structural engineer major which is the category this would fall under. ",
                    "score": 2,
                    "author": "Kolombiana"
                },
                {
                    "level": 1,
                    "comment": "No, it's going to result in people grieving about their lost loved ones...\n\nIt will result in a permanent stain on their memories... ",
                    "score": 1,
                    "author": "IONTOP"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -30,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Now is not the time to make a political statement.",
                    "score": 12,
                    "author": "g6in3d",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It never is, huh?",
                            "score": -6,
                            "author": "logic_hurts"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What the fuck?  Not everything is done at the federal level dipshit",
                    "score": 15,
                    "author": "Stang1776",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "DOT did fund part of it",
                            "score": 3,
                            "author": "Expiscor"
                        },
                        {
                            "level": 2,
                            "comment": "Literally never said or implied that dumbfuck",
                            "score": -9,
                            "author": "logic_hurts",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So you just threw a fucking defense spending comment out for no reason?",
                                    "score": 5,
                                    "author": "Stang1776",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sure did. Political statement!!   ",
                                            "score": -2,
                                            "author": "logic_hurts"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hey logic hurts. Nice name.  And I’m far from a gop supporter. But quick question for you. Do you honestly think federal tax dollars pay for a bridge in a college campus? Do you think that’s how municipal financing works? Can you please use your logic and not hurt yourself?",
                    "score": 8,
                    "author": "Thisbeerisgood"
                },
                {
                    "level": 1,
                    "comment": "Nobody likes you",
                    "score": 7,
                    "author": "AnusBeard"
                }
            ]
        }
    ]
}