{
    "id": "zq9wtv",
    "score": 6,
    "title": "FIU Law?",
    "author": "Princess_GJH",
    "date": 1671499058.0,
    "url": "https://www.reddit.com/r/FIU/comments/zq9wtv",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have a 153 LSAT and a 4.0 GPA in international relations and political science, what are my chances of getting in to FIU Law? This mostly goes to law students already at FIU",
    "comments": [
        {
            "level": 0,
            "comment": "LSAT needs to be higher. 157 or so at the minimum.",
            "score": 4,
            "author": "Sleazly"
        },
        {
            "level": 0,
            "comment": "You obviously have a nice shot, but this is the best law school in the state of Florida. It is tough to be accepted.",
            "score": 7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Under what metrics if FIU the best law school in Florida? seems to be far from the truth. Or are you buying that they have the best score in the bar exam? here is one link that I found that says FIU is by far not the top law school in Florida. https://www.usnews.com/best-graduate-schools/top-law-schools/law-rankings/florida",
                    "score": -11,
                    "author": "MulberryAggravating7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Based on BAR exam passing percentage. \n\nFIU’s law acceptance rate is the lowest and it is producing the best lawyers in the state of Florida.\n\nhttps://www.law.com/dailybusinessreview/2022/09/19/which-florida-law-schools-had-highest-bar-passage-rates-in-july/?slreturn=20221120075341",
                            "score": 4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Look, I’m happy the FIU is doing well. Im an FIU grad (all the way to phd). But one must be honest about FIU in order to grow. Yes, the bar is a very good metric and they have been doing well on that for a while. However, prestige carrie’s a huge weight as shown by the usnews ranking. Now, in terms of FIU producing the best lawyers, I’m not sure how you can quantified that? is there a metric for that ? \n\nAnd believe me, I know one that is amazing. \n\nWhen you come and claim that FIU is the best law school in the state because of the bar exam, it does raises alarms.",
                                    "score": -1,
                                    "author": "MulberryAggravating7",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Who said in the country? In the state. \n\nAre you sure you’re a Phd?",
                                            "score": 7,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "it was obviously a type but you can come to see my degree if you like. Of course, if you are worry about the quality of my phd from FIU, I would switch universities right away as you are a student. Good luck in your studies FIU student.",
                                                    "score": 1,
                                                    "author": "MulberryAggravating7"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Bar exam only tells you FIU is doing a better job training for the bar exam at best. That’s all. Before you make statements, try to think about what you will say and about understanding data. Also, if you look into statistics, you will understand that percentages are just that. In order to determined if there is a significant difference, you would have to perform a scientific study and perform some statistical  test. Even if this would be correct, which I’m assuming it is for the sake of discussion, it doesn’t change the fact that it doesn’t make you a better law school or better lawyer because the bar exam percentage is higher than other Florida universities.  I know is hard to see, but this whole argument is based on your statement is that FIU is the best law school and that is misleading. Are you an FIU law student ? If you are, I would expect a lot more from you, as I know great people that graduated from FIU law school.",
                                    "score": 1,
                                    "author": "MulberryAggravating7"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not responding to the original allegation, but look at the methodology. Seems biased as hell. They ask people if they know the school lmfao. \n\nhttps://www.usnews.com/education/best-graduate-schools/articles/law-schools-methodology",
                            "score": 4,
                            "author": "KnowledgeSafe3160",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m still wondering why wouldn’t you provide a metric. I asked under what metric is FIU the best school.",
                                    "score": -1,
                                    "author": "MulberryAggravating7",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Okay first of all I’m not the OP. Read the usernames. Second of all I said I was not responding to the original allegation as I stated in my post. 3rd I did not post the most bullshit source that just asks people to rate schools they heard about. 4th since you made me google FIU has the highest bar pass rates. \n\nhttps://www.law.com/dailybusinessreview/2022/09/19/which-florida-law-schools-had-highest-bar-passage-rates-in-july/?slreturn=20221120100450\n\nHere is the list by the state Supreme Court confirming that.\n\nhttps://drive.google.com/file/d/1aQvOZ8zhDECFVWeVMvonIYXddBcDQv6W/view",
                                            "score": 3,
                                            "author": "KnowledgeSafe3160",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I know you were not the op. \nPassing the bar exam is not a metric to measure the best lawyers or the best school. It is only a metric the FIU does a better job for the bar exam. That’s all. \nUS Rank news, as flaw as it may be, it does provide a view. \nFinally, I didn’t ask you to google for the bar exam as I never contended that was a valid metric to determined the best school. \nI asked what metric you were using to decide on your statement and the original part of the post. I know you said you were not talking about the former question (it was never an allegation), but if you reply to a thread, it is at least by me taken your taking part in the discussion nos such thread. \n\nSee the post from someone else in the earlier part of the thread. \n\nFinally, I’m not sure why are you all bother by this and saying bad words when this was never about you or the OP.  I’m not sure why you seem so offended by this. May ask why are you so triggered by it ?",
                                                    "score": 0,
                                                    "author": "MulberryAggravating7"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I can't help but agree with you. Bar passage isn't the only metric to consider.\n\nBy hardest to get into it would be UF.  \nBy prestige it would be either UF or FSU depending on the list.  \nBy cost it would be Florida A&amp;M.  \nFor \"value\" it would be UF.  \nFor black students (according to layersofcolor.com) it would be UF.\n\nI'm not sure how one quantifies \"best lawyers.\" And I can't seem to find a ranking on that.\n\n\nI think the reality is that saying FIU has \"the best\" law school is certainly misleading. \"One of the best\" would certainly be a valid descriptor.",
                            "score": 2,
                            "author": "Ayzmo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes — I was downvoted big. And I’m a FIU grad with BS MS and PhD. I agree with you.",
                                    "score": 1,
                                    "author": "MulberryAggravating7"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}