{
    "id": "9akkgy",
    "score": 5,
    "title": "Questions!!",
    "author": "clairissa26",
    "date": 1535330882.0,
    "url": "https://www.reddit.com/r/Bowdoin/comments/9akkgy",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m currently a senior in high school and Bowdoin is one of the schools I’m considering. I have a few questions about Bowdoin, as I am trying to figure out if I really want to apply. \n\nIs Bowdoin more collaborative or more competitive?\nAre professors really interested in getting to know their students?\nAre research opportunities readily available/easy to find out about?\nWhat is the overall atmosphere like? (Stressful? Overwhelming?)\nIs the workload easy to manage?\n\nI really liked my visit there and the campus is beautiful (1000x better than Bates). I got the chance to talk to one of the professors while I was there about his research, and he seemed really engaging. ",
    "comments": [
        {
            "level": 0,
            "comment": "Bowdoin is not competitive compared to a lot of schools on the same level of academics. I'd definitely consider it more collaborative, and I have gotten to know some professors fairly well which really makes research opportunities easy to find. That being said, the workload is not light. I'm doing well grades-wise but I feel pretty consistently burned out towards the end of each semester. ",
            "score": 4,
            "author": "SkiMonkey98"
        },
        {
            "level": 0,
            "comment": "Bowdoin (like most colleges) is what you make of it. \n\nIf you’re competitive, it can be competitive (by its basic nature, Bowdoin isn’t super competitive, but you can make it so). \n\nIf you want to do research and collaborate, the opportunity is there.\n\nBowdoin is very good at opening doors to allow you to try your passions. When I was there, a student ran a haute couture restaurant. He had been a sous chef in NYC, and used the time to figure out his passion. Others tried radio and comedy, and parlayed those into careers. \n\nFeel free to PM with questions. ",
            "score": 3,
            "author": "Kdj2j2"
        },
        {
            "level": 0,
            "comment": "I'm late to the party on this, and graduated 11 years ago, but here's my take. As the other folks who replied said, the experience is largely what you make of it. My freshman year floormates (Coleman basement) were academically inspiring. They made me a better student and worker. As for relationships with professors; I couldn't have asked for more. The professors I had (history and film studies primarily) make a point of building close relationships with their students. I'm talking \"ask students to house-sit when they're out of town\" close. The atmosphere can be stressful, as the expectations are extremely high, but once you settle in its motivating. In conclusion, and with more than a decade of perspective: I am grateful for my four years in Brunswick. The friends I made, both professors and fellow students, are among my most treasured relationships. If you get in, go. ",
            "score": 2,
            "author": "captainklaus"
        }
    ]
}