{
    "id": "t8syz4",
    "score": 14,
    "title": "Bowdoin No-Pet Policy",
    "author": "dontknowsry",
    "date": 1646670296.0,
    "url": "https://www.reddit.com/r/Bowdoin/comments/t8syz4",
    "media_urls": [],
    "other_urls": [],
    "postText": "Completely theoretical, if a student at Bowdoin has a crested gecko in a 12×12×18 terruium that:\n1. doesn't need bugs. Just a powder mixed with 2/3 water every two or so days.\n\n2. Isn't loud or anything. It's a tiny lizard.\n\n3.roomates are okay with said lizard\n\nWould the college crack down on the lizard-owner? Or would it be just a side glance?\n\nThanks!\n-a perspective student (that totally does not have a lizard)",
    "comments": [
        {
            "level": 0,
            "comment": "Lol. They're fairly strict about it. I had a friend who had a pet bunny, but she lived off campus that year. I wouldn't push it for the sake of your pet having a stable home. Not to mention, your roommates may be fine with it but that doesn't mean your floor mates will be. \n\nHope that helps and congratulations!",
            "score": 8,
            "author": "medalton",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah well, thanks for the info!",
                    "score": 4,
                    "author": "dontknowsry"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had a gerbil all through Bowdoin.",
            "score": 4,
            "author": "Ian_M_Noone",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cool!!\nDid you have to hide the little guy all the time or was it something that was just accepted?\n\n(Don't want to bring in a lizard if he's going to be super stressed or anything)",
                    "score": 2,
                    "author": "dontknowsry",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No one cared. Of course, people had dogs in the fraternities.",
                            "score": 2,
                            "author": "Ian_M_Noone"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have a friend who lives in a college house with a snake, so take that as you will. Congrats on getting in!",
            "score": 4,
            "author": "scwoopz"
        },
        {
            "level": 0,
            "comment": "incoming '26: if you do end up possening this (theoretical) (hypothetical) lizard lmk ive always wanted to see a crested gecko up close",
            "score": 3,
            "author": "whatintarnation0037"
        },
        {
            "level": 0,
            "comment": "IIRC the college inspects dorms a couple times a year. They give plenty of warning, but you (sorry, I mean this theoretical student) would need somewhere else to bring it when they do that. Other than that, I think you could probably get away with it but you should have a backup place to keep the lizard if you get caught, because they'll come down fairly hard and you'll have to get rid of it on short notice",
            "score": 3,
            "author": "SkiMonkey98"
        },
        {
            "level": 0,
            "comment": "The janitors saw him. He was caged.",
            "score": 1,
            "author": "Ian_M_Noone"
        },
        {
            "level": 0,
            "comment": "Hmmm, you can apply to have a support animal, I know a couple people on campus with one, usually dogs. But I don't think they would accept the lizard as one haha, \n\nI think you could be fine with it... being a first year with one would be more difficult bc you have less privacy and generally more ppl that would know just bc of the novelty... so best bet would be to wait until u get housing that is more private in your next year. \n\nTrying wouldn't hurt tho lol, but if anyone snitches to your proctor you're probs dust so make sure you have a lizard escape plan they could go home on.",
            "score": 1,
            "author": "Z2g7"
        }
    ]
}