{
    "id": "jqqxgt",
    "score": 7,
    "title": "LGBTQ+ acceptance at hillsdale?",
    "author": "Gp7759",
    "date": 1604896084.0,
    "url": "https://www.reddit.com/r/hillsdale/comments/jqqxgt",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve been really thinking about going to Hillsdale when I graduate. I toured it when my sister who was a year older than me went to tour it, and I fell in love with it. I love the centering around the constitution and liberty.  But I do have one concern. Being both pansexual and transgender, would I be accepted there? Like not in a application stance but in the way I’m treated by students and faculty? I really want to go to Hillsdale but if it’s not gonna be a safe or positive environment than I might pass.",
    "comments": [
        {
            "level": 0,
            "comment": "Honest answer, it'd be tough. You'd probably be assigned to live in the dorm of your assigned gender. You'd definitely be able to find a good group of accepting friends, but the school ranked like #8 most lgbt unfriendly a couple years ago, and honestly, I can see how that could be true.",
            "score": 8,
            "author": "throwaway_mck94"
        },
        {
            "level": 0,
            "comment": "I'm a current student who is pretty liberal as far as Hillsdale goes (meaning that I'm actually a moderate)...you'd have a tough time here for sure. There are other liberal arts schools in the Midwest that might be a better fit. Adrian, Oberlin, etc.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "There are places on campus where you may feel welcome, but you would definitely feel like a black sheep there. There are a handful of gay/lesbian/bi students on campus, and even fewer transgender students (near zero). I don't think you'd be in any \\*real\\* danger as a student there or anything, but a lot of students will simply not accept you for who you are. There are groups/cliques on campus that you can find that will accept you, but they are definitely few and far between.\n\n&amp;#x200B;\n\nAs a student there you may encounter a number of hostile/uncomfortable situations. One example, I was sitting with some friends at lunch and someone was talking about their LGBT family member. A random kid sits down at the table, and unprovoked starts going off about how gay people are evil/violent/deranged/etc. I've also heard stories of transgender students with roommates who refuse to refer to them by their preferred pronouns, etc. These sorts of interactions happen a lot on campus, and there is little that the faculty will do to defend you in such a situation. That being said, there are also accepting people at Hillsdale. They are definitely a minority on campus, but they exist.\n\n&amp;#x200B;\n\nIf you do decide to go there, I would seriously consider what you plan to study. Some academic departments are much more welcoming than others. For example, the Sociology department is much more welcoming to LGBT individuals than much of the rest of the school (I studied under 2 queer professors while a Sociology major at Hillsdale, and all of my professors in the department created a welcoming place for everyone). On the other hand, the Politics department is notorious for having some professors with very traditional views, and some of those professors have said really terrible things about LGBT people (not about specific students, but bigoted things about LGBT in general). Your choice of major will really make a difference.\n\n&amp;#x200B;\n\nIf you have any specific questions about any of this, please feel free to DM me. I'm a recent alum who dealt with a lot of the same issues you might face as a student there.",
            "score": 3,
            "author": "Hillsdale_Throwaway"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Beep. Boop. I'm a robot.\nHere's a copy of \n\n###[The Bible](https://snewd.com/ebooks/the-king-james-bible/)\n\nWas I a good bot? | [info](https://www.reddit.com/user/Reddit-Book-Bot/) | [More Books](https://old.reddit.com/user/Reddit-Book-Bot/comments/i15x1d/full_list_of_books_and_commands/)",
                    "score": 2,
                    "author": "Reddit-Book-Bot"
                }
            ]
        }
    ]
}