{
    "id": "13iunvy",
    "score": 166,
    "title": "My cozy and warm evening space (bonus: reclaimed trash furniture, too)",
    "author": "mad1301",
    "date": 1684210504.0,
    "url": "https://www.reddit.com/r/CozyPlaces/comments/13iunvy",
    "media_urls": [
        "https://i.redd.it/fn3v0z3ju50b1.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to r/CozyPlaces! \nIf you are new to this sub or visiting from r/all, please take a moment to read [our rules](https://www.reddit.com/r/CozyPlaces/wiki/index#wiki_1.2_constructive_criticism_vs._insulting) before commenting.\n\nWe do our very best to encourage a wholesome and friendly environment here. This sub is largely original content, where people are sharing their homes for our enjoyment. Rude behaviour and being a jerk will not be tolerated.\n\nThank you for understanding and have a cozy day! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CozyPlaces) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I’ve spent the last several years finding all the right pieces to complete my space and make it feel just right. \n\nI’m a huge fan of finding something old and finding a purpose for it. Three of my major furniture pieces here were dumped in the streets of NYC, and with a bit of sanding, stain or paint, they’re like new and 10X better and cozier than anything you can buy brand new. \n\nI refuse to buy new furniture after having sold nearly everything before moving to NYC and 95% of my apartment is found outside, thrifted, or purchased second-hand.",
            "score": 6,
            "author": "mad1301"
        },
        {
            "level": 0,
            "comment": "Very nice room and good use of vertical shelving for storage. Great job recycling, too.",
            "score": 2,
            "author": "notunek"
        },
        {
            "level": 0,
            "comment": "What an amazing job you have done finding and repurposing your furniture. It looks great and that couch looks so comfy",
            "score": 2,
            "author": "detroitblonde1"
        },
        {
            "level": 0,
            "comment": "My husband and I have acquired some very nice things over the years. But one of my very favorites is a Beautility Buffet from the 1950s that I found in a thrift shop 25 years ago. There is beauty everywhere. Great job!",
            "score": 2,
            "author": "VegasLife1111"
        },
        {
            "level": 0,
            "comment": "I have a side table that matches your coffee table. It was left on the street",
            "score": 2,
            "author": "Dangerous_Land_2402"
        },
        {
            "level": 0,
            "comment": "The Eye of Sauron is a nice touch!",
            "score": 2,
            "author": "ImFairlyAlarmedHere",
            "replies": [
                {
                    "level": 1,
                    "comment": "The ominous double lamp shadow? 😂",
                    "score": 1,
                    "author": "mad1301",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes! Keeps it edgy 🤣 I do love the space though!",
                            "score": 1,
                            "author": "ImFairlyAlarmedHere"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Where’d you get that couch? It’s perfect",
            "score": 1,
            "author": "SpecialEfficient4410",
            "replies": [
                {
                    "level": 1,
                    "comment": "FB Marketplace, but it’s originally from Article.",
                    "score": 1,
                    "author": "mad1301"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why did this remind me of Robert California’s Florida condo?",
            "score": 1,
            "author": "all_you_need_is_sabr"
        },
        {
            "level": 0,
            "comment": "Love it 😍",
            "score": 1,
            "author": "LinaVenus"
        },
        {
            "level": 0,
            "comment": "i love your style! 🥰",
            "score": 1,
            "author": "Vane-Sanchez"
        }
    ]
}