{
    "id": "12xzro7",
    "score": 5,
    "title": "how clean are the massell/north bathrooms?",
    "author": "aiyahl",
    "date": 1682377116.0,
    "url": "https://www.reddit.com/r/brandeis/comments/12xzro7",
    "media_urls": [],
    "other_urls": [],
    "postText": "‘27 student here! lmk ur experience and which dorm u had - is one of the quads cleaner than the other? are there any problems with bugs/insects at all? pls answer honestly so i can brace myself if needed 💀💀",
    "comments": [
        {
            "level": 0,
            "comment": "I’m in one of the north dorms and tbh the custodians do a good job of keeping them clean. I don’t really think any of the quads are better but they each have their own benefits in terms of location",
            "score": 2,
            "author": "blashcr"
        },
        {
            "level": 0,
            "comment": "i would agree, im in a north dorm too and custodians do an amazing job of keeping things clean. but yeah, prepare yourself. i’ve found condoms in the trash before",
            "score": 2,
            "author": "Euphoric-Bet3397"
        },
        {
            "level": 0,
            "comment": "I was in north and there were stinkbugs and silverfish, but the silverfish weren't that bad, and mint will get rid of most pests. Never saw rats myself but I know they exist because of an incident last year, but mint should repel them as well. (edit: I forgot a few people had wasps but they are also repelled by the magic of mint pest control)\n\nThe bathrooms were clean though! Only issue was people leaving hair in the drains but thats a problem everywhere. Honestly the dorms were fairly okay.",
            "score": 1,
            "author": "Homicidalsheeps",
            "replies": [
                {
                    "level": 1,
                    "comment": "mint?? interesting",
                    "score": 1,
                    "author": "aiyahl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you can't tell I'm very pro mint pest control.  Its not toxic to humans,  and if you google what is repelled by it, the list is long",
                            "score": 1,
                            "author": "Homicidalsheeps"
                        }
                    ]
                }
            ]
        }
    ]
}