{
    "id": "2ugosb",
    "score": 1,
    "title": "How do I get the alumni people to stop calling me?",
    "author": "brandeisthrowaway478",
    "date": 1422837780.0,
    "url": "https://www.reddit.com/r/brandeis/comments/2ugosb",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm tired of the alumni association knowing my phone number. Stop trying to make \"me supporting you anymore\" happen. It's not going to happen. I am so incredibly disappointed in what I've seen recently from this school, and I've stopped recommending it to prospective students. Don't ask me for cash. Take it out of Yehuda's retirement fund or something dammit. \n\nI saw the absolute trainwreck of analysis going on about and around Ayaan Hirsi Ali, and I am frankly embarrassed to be associated with Brandeis now. When people ask me where I got my degree, it's \"oh, you've probably never heard of it.\" \n\nBrandeis, you're not the intellectual power that you were 20 years ago. PLEASE STOP CALLING ME FOR MONEY. I'd tell you to take another, more analytical look at why you got steamrolled by a bullshit \"please tolerate religious intolerance\" argument, but I don't think you're up to the task. \n\nAll I've learned from this is that an institution that tries to live in harmony with \"tolerant\" expressions of religion will find itself doing their work for them to silence criticism and maintain religion's dominance of public discussion. \n\nedit: I don't *enjoy* having to yell at a teenage kid on the other end of the fundraising call. Just spare us all the trouble, and either figure out where you went wrong, or someone here tell me how to get the hell off of all these damned lists. I'd love to be able to be proud of this school again, but it's going to take a hell of a lot. ",
    "comments": [
        {
            "level": 0,
            "comment": "Just say you want to be taken off the list forever and never be called again. There is a way to do that, but if you yell at the kid they'll probably take you off the list for this year just because they will be annoyed at you. Some people *do* donate, and others even enjoy the phone calls they get from the school, so it's silly to expect the phone calls to stop because of your personal feelings about the school. However, you can ask to never be called again. \n\nThe people who call are actually a really nice group of kids, and I'm sure if you ask politely they will do what you ask. ",
            "score": 3,
            "author": "abcactus"
        },
        {
            "level": 0,
            "comment": "You can probably just ask to speak to a supervisor and maybe you can get an adult on the phone.",
            "score": 1,
            "author": "Mutabilitie"
        }
    ]
}