{
    "id": "k0b51n",
    "score": 17,
    "title": "Recent Surge",
    "author": "Nelson56",
    "date": 1606243948.0,
    "url": "https://www.reddit.com/r/brandeis/comments/k0b51n",
    "media_urls": [],
    "other_urls": [],
    "postText": "There are 33 students in Quarantine and 13 in isolation right now, does anyone know what happened? Was there a spreader event? I'm home now but am very curious because this happened right as we were leaving.",
    "comments": [
        {
            "level": 0,
            "comment": "If you look at other colleges in the area, almost everyone experienced a surge in the past week. Tufts' undergrad community had almost half of their cumulative cases test positive last week. Community spread off-campus is leaking onto campuses. \n\nIt's particularly telling with faculty and staff numbers climbing. Aside from a handful of people in DCL, faculty and staff live off campus. While it's possible they got it on campus, there are far more limited opportunities to spread among workers compared with students. \n\nSo many local colleges experiencing dramatic increases (double, triple, or more their average weekly positives) when, with some notable exceptions, most schools have done really well keeping covid at bay is definitely not a good sign for the general community. \n\nStay safe, everyone.",
            "score": 6,
            "author": "mazel-tov-cocktail"
        },
        {
            "level": 0,
            "comment": "no clue, but maybe the rises cases have been affecting us as well? although it hasnt been this bad in the past few weeks either",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "There’s been an outbreak in the science department among grad students and research staff accounting for (what I estimate) is around third of the cases. Generally speaking it’s inevitable that outbreaks will spread aggressively through labs since we work in highly trafficked spaces and share a lot of equipment. We’ve had sanitation, de-densifying, and distancing protocols in place, but the reality is that it is not always possible to practice perfect sanitation and distancing.\n\nEarlier this year we had really strict density restrictions that resulted in people having to postpone experiments or take overnight shifts in order to continue their work, and those restrictions had been relaxed once cases in Waltham came down since they were pretty inconvenient. Pretty much the day of the first handful of cases the department shut buildings down for a week and has re-instituted the ultra-low-density restrictions from the spring. A lot of us are voluntarily not coming in an effort to snuff out the outbreak.",
            "score": 4,
            "author": "thumbsquare",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh, geeze. That's rough all around. Even when everything is followed to the letter and as perfectly as humanly possible, it's important to remember that those precautions simply reduce risk, not eliminate it. \n\nDo you know how folks are doing?",
                    "score": 1,
                    "author": "mazel-tov-cocktail",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Every case I’ve heard of is asymptomatic thankfully.",
                            "score": 2,
                            "author": "thumbsquare"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Anyone think this will affect the chances for a spring semester if this isn't contained?",
            "score": 1,
            "author": "hughlyhuge",
            "replies": [
                {
                    "level": 1,
                    "comment": "doubt anythings changing tbh if anything it’s more convenient for the administration to just habe the spring semester fully online",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        }
    ]
}