{
    "id": "m84hzp",
    "score": 8,
    "title": "Pre med?",
    "author": "jakettheflacket",
    "date": 1616112284.0,
    "url": "https://www.reddit.com/r/brandeis/comments/m84hzp",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! I was just accepted to brandeis for biology. I was wondering how the pre med program was and how rigorous it is? Is there any grade deflation and/or is it extremly competetive like some other schools *cough cough boston uni cough cough* \n\nAll jokes aside, any input would be greatly appreciated! :)",
    "comments": [
        {
            "level": 0,
            "comment": "It’s rigorous, but not cutthroat. People tend not to be cutthroat or sabotaging, and the classes are curved in a way that you’re not punished for cooperating or being friendly.\n\nThat said, gen chem is always a bloodbath. I’d say 30-50% of self-identified pre-meds drop in the first year. I think it’s less about the classes being toxic or grade deflation and more about people wanting to do better things with their lives.\n\nI graduated a couple years ago but every pre-med I know who stuck it out to the end got into med school. I think I know four people at Harvard Med. It’s a great program and if you’re dedicated and willing to take the initiative, work hard, and ask for help, you’re going to do great.\n\nIf you choose Brandeis (which you should), feel free to pm me and I’d be happy to answer any other questions you have.",
            "score": 8,
            "author": "CommonwealthCommando",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much!",
                    "score": 2,
                    "author": "jakettheflacket"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would have to agree with u/CommonwealthCommando in regards to the classes. The intro courses in general seem to be geared towards helping your grade rather than killing it. This holds especially true for the intro biology courses, UWS courses, and intro Calc courses. Of course, your experience will probably depend on your study habits and background; however, there are plenty of resources available in the case that you are struggling. \n\nIn regards to chemistry, if you have any familiarity with AP physics and Calc, you should probably take Honors Chem. The exams are EXTREMELY fair due to how well they reflect the practice problems and lectures. If you have access to the recorded lectures, you honestly don't even need to read the textbook. \n\nI am only a freshman, so I have no idea regarding the pre-med program, but I hear great things about it!\n\nAll in all, if you are used to working hard and maintaining a consistent study schedule, your first year at Brandeis will probably run smoothly.",
            "score": 3,
            "author": "k1mmor"
        }
    ]
}