{
    "id": "nk1554",
    "score": 10,
    "title": "Can anyone give me any information about the Heller School?",
    "author": "Sage505",
    "date": 1621871610.0,
    "url": "https://www.reddit.com/r/brandeis/comments/nk1554",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone, I’m enrolled in the Heller MPP program for the fall. Initially I was excited but then basically all of the info I read about it (gradcafe) was intensely negative. I’m sure almost all graduate programs are what you make of it, but now I sort of regret reading what I saw because it’s giving me doubts about what I got myself into.\n\nIs anyone else able to give me some info about Heller? Anything is appreciated.",
    "comments": [
        {
            "level": 0,
            "comment": "I just finished the SID/MS program but took a few MPP courses. I can't speak specifically to the MPP program but my overall experience at Heller (and most of what I hear from my MPP friends) was very positive, and probably would have been even better if I had more than a semester and a half on campus before COVID lol\n\nIt is fairly international-focused, especially with jobs and networking; my focus is (U.S.) rural/native populations so I had to put in a little more effort when looking for jobs/post-grad work, but I swear they sent out like 1-2 job listings every week where someone with decision-making authority was Heller-affiliated and looking to hire a Heller grad.\n\nI ultimately decided to go to law school instead of getting a job (for various COVID-related reasons) and while I can't say going to Brandeis (as opposed to other grad schools) gave me an advantage, I got into multiple top 25 law schools with an undergrad GPA that was well below their 25th percentiles so I think it proved I was academically prepared despite my undergrad performance.\n\nI can't speak specifically to the MPP quant courses as almost all of mine were related to health economics but in my personal opinion, I took 4 modules (quarters) of a (required) Stata course and I would much rather have taken more qualitative courses instead and just done a Stata certificate program during a summer or after graduation or something. Ultimately you're attending a school of *social* policy and there's only so much you can fit in a semester so it does tend to be more DEI heavy, but I'm sure there's students at quant-heavy schools that feel like they don't have enough social policy courses.",
            "score": 2,
            "author": "trcamp",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for your comment, it‘s nice to hear that you and others enjoyed the experience. I was actually considering law school after my MPP as well. May I ask if you went to a decent undergrad school? Because I heard law school basically looks at your undergrad institution, your GPA there, and your LSAT scores and ignores any graduate program you attended.",
                    "score": 1,
                    "author": "Sage505",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I went to a small public college in my hometown so I think it probably had a neutral impact on my application. That's pretty accurate IMO; there's just not a ton of data I saw about the impact of grad school on law school apps so I think it's more of a soft strength / a way to fill in any gaps in your application. For me, I had a pretty poor academic past so I think getting a 3.9 in my first year of grad school didn't necessarily open any new doors for me, but it probably kept open doors that might have been shut over concerns about my academic ability in law school. Beyond that, I had prior AmeriCorps experience so I think that combined with grad degrees from a socially conscious school like Brandeis helped a fair amount when applying to schools with a similar focus or strong public interest program. \n\nFor law school purposes, I think grad school is a neutral to slightly positive. If you do poorly it can definitely hurt, but if you have some weak areas in your application doing well can be one way to fill those. Beyond that, I think it's good prep for law school (during my SID year, the amount/difficulty of reading assigned was probably comparable and sometimes greater than that in law school), and having both degrees can obviously make you a more competitive job candidate, especially for more niche positions. I actually had an attorney in one of my courses who I think was a 2nd-year MPP student so you wouldn't be the first person at Heller to do an MPP before/after a J.D.",
                            "score": 1,
                            "author": "trcamp",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This helped a lot, thank you again.",
                                    "score": 2,
                                    "author": "Sage505"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What negative feedback did you hear?",
            "score": 1,
            "author": "As_I_Lay_Frying",
            "replies": [
                {
                    "level": 1,
                    "comment": "Heard it wasn’t quantitative at all really and that people with MPPs from Heller were having issues getting jobs. Kinda got me nervous, because I ain’t trying to be a millionaire but I also don’t want to have issues paying bills. My intention was to basically make the most out of it and also acquire internships while in the program.",
                    "score": 2,
                    "author": "Sage505"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey I’m also an incoming student at Heller who saw those posts when looking up the program! I would say in general to take anything posted in grad cafe with a big grain of salt. In my experience the folks on there are very snobby about programs (i.e. if it's not a top 5 program it's trash in their minds). I also kinda question the validity of someone’s opinion who graduated years ago and spends time lurking on masters degree forums warning other folks about a grad program that they didn’t even attend.  But yeah, those were my thoughts when I saw those posts!",
            "score": 1,
            "author": "Recent-Jello873"
        }
    ]
}