{
    "id": "olgzfl",
    "score": 7,
    "title": "Which is the better freshman quad: North or Massell?",
    "author": "omega_waddle",
    "date": 1626442538.0,
    "url": "https://www.reddit.com/r/brandeis/comments/olgzfl",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "None of them lmao. \n\n\n\nThat being said north.",
            "score": 7,
            "author": "Poonkappa-daddy"
        },
        {
            "level": 0,
            "comment": "Massell is more social, closer to some science buildings, and right next to one of the dining halls (Sherman). North is objectively nicer, has a better location (close to Usdan and Mandel) and a little more secular.\n\nThis year I think Massell is probably the better quad. North was completely dead 24/7 last year socially speaking, while Massell seemed to be much better off with people actually interacting and meeting other people.\n\nIn a normal year North is better because it is nicer.",
            "score": 3,
            "author": "MrPapaya22"
        },
        {
            "level": 0,
            "comment": "I preferred North because all of my classes were \"up the hill\" and I was lazy. I could roll out of bed at 9:50 and still easily make a 10 a.m. class fully dressed with my face washed and teeth brushed.\n\nMassell is much closer to business classes and the SCC. Science classes are sort of in between.\n\nEach has one of the dining halls near them. I used to plant myself in Sherman with a laptop and keep a steady stream of coffee and ice cream going, but Usdan (near North) is generally considered to have better food.\n\nEither way, campus is pretty small so when I say closer, what I really mean is you shave 5 - 10 minutes off, tops. As far as social life, that's 100% dependent on who ends up living where. When I was a first year over a decade ago, North was considered the more social quad. You'll find your people regardless, and those people aren't always the people you randomly get matched up on a hall or in a building with at first.",
            "score": 2,
            "author": "mazel-tov-cocktail"
        }
    ]
}