{
    "id": "yvb25w",
    "score": 3,
    "title": "Neuro Class recs",
    "author": "deuxharts",
    "date": 1668456556.0,
    "url": "https://www.reddit.com/r/brandeis/comments/yvb25w",
    "media_urls": [],
    "other_urls": [],
    "postText": "Im a prospective neuro major, whats a good class to sort of ease into the major (not difficult to get an A typa clas)",
    "comments": [
        {
            "level": 0,
            "comment": "NPSY 11 is good (the only one being offered next semester aside from NPSY 17). Avoid any class taught by DiZio. Junior year is usually the best year to take NBIO 140 (the core course). Best elective was NBIO 146 but save that for later years in my opinion. BIOL 42 and PSYC 10a aren’t neuro-specific but still give you a good feel for the field overall.",
            "score": 2,
            "author": "EclipseEpidemic"
        },
        {
            "level": 0,
            "comment": "NPSY 11! It's so good, it made me think I was going to be a neuroscience major (trust me, I'm not.)",
            "score": 2,
            "author": "AceAttorneyMaster111",
            "replies": [
                {
                    "level": 1,
                    "comment": "wait really? I read the rate my prof and it looks really hard but really interesting",
                    "score": 1,
                    "author": "deuxharts",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I personally didn’t find it to be too hard. I wouldn’t say it’s an easy A though. There’s no required homework, and if you take good notes, you don’t really have to do any of the readings. The whole grade for the course is composed of 3 sets of 3 quizzes, and he drops the lowest quiz from each set.",
                            "score": 2,
                            "author": "AceAttorneyMaster111",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What is your major?",
                                    "score": 1,
                                    "author": "deuxharts",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Computer science and linguistics",
                                            "score": 1,
                                            "author": "AceAttorneyMaster111",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "oohhh, im a computer sciecnec and neuro major , idk yet though bc i havent declared, im taking npsy 11",
                                                    "score": 1,
                                                    "author": "deuxharts"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}