{
    "id": "12znf6e",
    "score": 12,
    "title": "Little help",
    "author": "[deleted]",
    "date": 1682525153.0,
    "url": "https://www.reddit.com/r/csuf/comments/12znf6e",
    "media_urls": [
        "https://i.redd.it/pvxwjg04nawa1.jpg"
    ],
    "other_urls": [],
    "postText": "So on my to do list on the student homepage, there are these 3 tasks that say: parent family size chart, parent tax filling statement and student tax filling statement. \n\nI also received an email to print out these forms but I don’t know where to do that. I also thought if I submitted they would disappear but they are still there. Any help would be greatly appreciated.",
    "comments": [
        {
            "level": 0,
            "comment": "I suggest u go to the financial aid office and they should give you the forms for you to complete to get those removed, i had to do the same.",
            "score": 8,
            "author": "Lil_Fabuloso"
        },
        {
            "level": 0,
            "comment": "To save you a trip to the financial aid office, I was in the same situation where the tasks stayed on my homepage. I went to the office and they said it takes two-three weeks for them to process it. It was gone after two weeks",
            "score": 4,
            "author": "ticklemyguts"
        },
        {
            "level": 0,
            "comment": "i’m having the same problem telling me they need the documents to determine my eligibility for money 🥲",
            "score": 3,
            "author": "Presentation_Frosty"
        },
        {
            "level": 0,
            "comment": "if theyre submitted then they still need to process them, it takes a few weeks at the minimum for the hold to go away",
            "score": 3,
            "author": "chanelting"
        },
        {
            "level": 0,
            "comment": "It takes a while for them to go away. Still getting emails about missing FA info so even though I submitted it lol.",
            "score": 2,
            "author": "Optimal-Egg-9539"
        },
        {
            "level": 0,
            "comment": "I submitted it a while back and it took a little less than a week for the To Do tab to update",
            "score": 1,
            "author": "coldjenny707"
        },
        {
            "level": 0,
            "comment": "Hi, I would recommend you to either go in person and ask for the forms. If you can't, try calling multiple times throughout today to financial aid  (657) 278-3125 and asking them if someone from there team can send you the forms to your csu email. Also try filling out this form at this link down below, this is you sending a query to the financial aid office help desk, they do tend to reply 2-3 days, I know it doesn't help at all since the deadline for the verification is tomorrow, but the help desk query is where I got my verification documents sent to me in a email and i just printed them out. Hope this helps. Also to submit them I would recommend you dropping them at the csuf financial aid office dropbox  located to the right of there main door or faxing the doucemnts at csuf Financial aid fax  number 657-278-1595. I faxed mines through FedEx, it was quick and easy they received my documents. Good Luck!!\n\n[https://titans.service-now.com/service\\_desk/com.glideapp.servicecatalog\\_cat\\_item\\_view.do?sysparm\\_id=69036da01bf788100cd0ebd56e4bcbc3](https://titans.service-now.com/service_desk/com.glideapp.servicecatalog_cat_item_view.do?sysparm_id=69036da01bf788100cd0ebd56e4bcbc3)",
            "score": 1,
            "author": "Ok_Environment_2166"
        },
        {
            "level": 0,
            "comment": "Wait so if I applied for fasfa and I get this should I worry?",
            "score": 1,
            "author": "SnooPaintings430",
            "replies": [
                {
                    "level": 1,
                    "comment": "You should check for yourself when you have the chance. The forms are due my tomorrow so you still have time to submit them if you’re required to. \n\nThey will be under tasks",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        }
    ]
}