{
    "id": "138wcwp",
    "score": 3,
    "title": "transfer questions",
    "author": "Appropriate-Tomato88",
    "date": 1683309607.0,
    "url": "https://www.reddit.com/r/csuf/comments/138wcwp",
    "media_urls": [],
    "other_urls": [],
    "postText": "hi! i’m a potential transfer for the spring semester and just had some overall questions about the school. i’m from socal and don’t live far from the school (probably a good 30 mins still) but looking into staying in the dorms for the experience lmao. \n\nwould you say scuf is social? (not like party school) are there many things to do around the school or in the school that helps you engage with people? \n\ni’m a introvert and sometimes have a hard time talking to people first but really love to communicate, my other option is sfsu (and probably sjsu depending on the community) but overall would like to see how transfers/upper classmen made their adjustments.",
    "comments": [
        {
            "level": 0,
            "comment": "To get any kind of social experience at csuf, as a transfer student, I would highly recommend joining Greek life or clubs. As a transfer student, I joined Greek life and made lifelong friends at Fullerton I otherwise would not have through classes and other ways. Lot of people keep to themselves and don't socialize outside of the classroom. You get what you put in, and whether you commute or life at the dorms, your experience will depend on how you put yourself out there and if you're willing to make yourself uncomfortable to meet people.",
            "score": 3,
            "author": "ceoguy321",
            "replies": [
                {
                    "level": 1,
                    "comment": "the thought of joining greek life has always interested me ngl, this is also the second time someone’s brought it up and also had life long friends, i’ll def look into it more!",
                    "score": 1,
                    "author": "Appropriate-Tomato88"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I also dormed for the first year for experience—I met a good chunk of friends! I would say now that most of my friends commute like me. Everyone on campus is pretty friendly and usually talkative so don’t be afraid to chat with people. I made a ton of friends by joining clubs/organizations and also just talking to them in my class. First day just start chatting with the person next to you HAHA.",
            "score": 1,
            "author": "nightunderharshlight",
            "replies": [
                {
                    "level": 1,
                    "comment": "LMAO i’m an introvert but for this i’ll definitely try hard",
                    "score": 1,
                    "author": "Appropriate-Tomato88"
                }
            ]
        }
    ]
}