{
    "id": "13c2rax",
    "score": 35,
    "title": "watch out if ur walking down titan walk",
    "author": "twinklelightsneon",
    "date": 1683575586.0,
    "url": "https://www.reddit.com/r/csuf/comments/13c2rax",
    "media_urls": [],
    "other_urls": [],
    "postText": "i just saw those religious people who try to recruit people",
    "comments": [
        {
            "level": 0,
            "comment": "update: they are in the TSU now. They just came up to me while I was eating 😭",
            "score": 32,
            "author": "twinklelightsneon",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's my understanding that people can't proselytize or solicit in the buildings? If that's true I'd report them to the school bc they can't be doing that",
                    "score": 23,
                    "author": "phiatortilla",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I once told them that they already talked to me \n\"Oh\" and proceeded to try and recruit me 💀",
                            "score": 15,
                            "author": "xtina9366",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "💀💀💀",
                                    "score": 3,
                                    "author": "Summer-is-coming___"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "how would i report it",
                            "score": 9,
                            "author": "twinklelightsneon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This got long but I am trying to be as thorough as possible. \n\nI am assuming this falls under Expressing Free Speech/Freedom of Expression. Here's the official Cal State Fullerton Office of the President guidelines on free speech\n\nhttp://president.fullerton.edu/directives/directive5.aspx\n\nSection B indicates that \"freedom of expression and expressive conduct\" is subject to reasonable restrictions when they \"impede or are disruptive to the regular or essential operations of the University\", such as \"teaching, study, research, administration\". This is important bc \"activities are not permitted inside any building or parking structure or lot\". Outside of the buildings and the quads are the designated public spaces those activities may occur. \n All students, staff, faculty, guests and visitors are subject to following these or risk removal from the campus. \n\nThe email listed for questions is: freespeech@fullerton.edu\n\nI would email them (from your student account) a brief summary of when, where, and what was said to you by whom. Or as much as you remember. Then ask if their actions are a violation of this or similar directive(s).\n\nIf they respond with yes, proceed with whatever complaint system they are able to give you. \n\nIf they respond with no, ask why. It is possible that sections of the TSU can be argued to be a grey area (the courtyard?), but it is quite clear in the directive that buildings are off-limits. It is also possible that there are a more specific set of rules for religious proselytizing, and if so please ask for them and for them to explain how it compares to Directive 5. \n\nIf they do not help you, escalate by forwarding the email exchange to the Office of the President of csuf, and ask them to review the incident. This may seem extreme, but it's the Office of the President's directive, they should care about it being followed. \n\n\nMay your indoor lunches be as peaceful as you'd like them.",
                                    "score": 11,
                                    "author": "phiatortilla"
                                },
                                {
                                    "level": 3,
                                    "comment": "I think just to CSUF PD",
                                    "score": 6,
                                    "author": "reuben_n"
                                },
                                {
                                    "level": 3,
                                    "comment": "this is kind of late but in case it happens to you again in future semesters, because the TSU is owned by ASI and they're an auxiliary org they have different rules than the rest of campus. So they aren't allowed to solicit you in any part of the TSU including the courtyard. If they solicit you again I recommend finding a building manager and reporting them! They're the ppl with the black polos and wire headsets who walk around the building.",
                                    "score": 1,
                                    "author": "ahowle"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}