{
    "id": "13f2uli",
    "score": 58,
    "title": "Disappointed in CSUF TAPP",
    "author": "spiteandcaffiene",
    "date": 1683845453.0,
    "url": "https://www.reddit.com/r/csuf/comments/13f2uli",
    "media_urls": [],
    "other_urls": [],
    "postText": "at 2:30 today they sent out the RSVP information for the bruncheon for TAPP students. By the time I called by husband and confirmed we could attend (about 2:50), filled out the RSVP, all of the \"slots\" were gone. \n\n1. why would you not put this event has a limited amount of event space?\n2. why would you not take into consideration the volume of TAPP eligible students on this campus? \n\nI am so unbelievably disappointed. I was excited to attend and now they want to \"raffle off\" a stool and pin for those who the RSVP closed on. \n\nGreat way to end the semester.",
    "comments": [
        {
            "level": 0,
            "comment": "Got a text to sign up at 2:58 pm. Got a text at 3:42 saying it’s full….. probably upsetting a lot of people. \n\nMaybe you should just show up anyways.",
            "score": 24,
            "author": "plantyoulater"
        },
        {
            "level": 0,
            "comment": "The person who downvoted this, I bet you work for TAPP",
            "score": 56,
            "author": "spiteandcaffiene"
        },
        {
            "level": 0,
            "comment": "Hello Titans! My name is Cameron Cook. I am the Director of the TAPP Center.  First, I want to say thank you for all the feedback regarding our end of the year event selling out so quickly. You all are exactly right. That was my mistake. I underestimated the response for this event.  I apologize for that. We are a brand new program and this is the first end-of-the-year celebration that we have hosted, and we were honestly surprised that there was so much interest. We have sent out a lot of invites over the last year to the same student group and did not receive anything close to this level of response. Our events average about 150-200 people, so we based our plan on that. \n\nI am sorry lot of our transfer students were let down and disappointed. That is on me. I accept full responsibility for that. No excuses. We have a small staff and they work their tails off every day to support our transfer, adult, parenting, and pregnant students, so we do hope that you do not let this one mistake define the TAPP Center. One thing I can guarantee you is that this will not happen again in the future. We will learn and grow from your responses and feedback. We will be much more prepared for next year's event. We now know that we need to plan BIG!  We realize that does not help this year's graduates, so we encourage you to stop by Gordon Hall 205 to meet the team in person and we can see if there is anything we can do to assist you. We are here for you, despite this oversight. Please let me know if you have any questions, comments, or concerns. Thank you for your time patience and consideration.",
            "score": 13,
            "author": "CSUFTAPPCENTER",
            "replies": [
                {
                    "level": 1,
                    "comment": "I appreciate your response. Graduation is a big deal to many of us, especially for an event that allows us to celebrate with our families on a non-school day. Hopefully, next year all that want to join can. I suggest getting something to offer for all TAPP students to wear on their grad day, not just a raffle or attendance at the event. Sometimes minute details mean a lot.",
                    "score": 9,
                    "author": "spiteandcaffiene"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is terrible, you would think programs like TAPP would get more funding/attention. I don’t think I’ve had one good encounter with any department at this school, they are essentially useless. If I could go back and go to fully online csu or any other option I would, this has gotta be one of the worst cal states",
            "score": 11,
            "author": "Ok-Base9059",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly. What's the point of the department if they cannot support the students they represent? Slap in the face. Transfer students and parents are always going to be bottom of the totem no matter what they say.",
                    "score": 9,
                    "author": "spiteandcaffiene",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hmm great point, makes sense bc I’m a transfer student. God damn politics",
                            "score": 3,
                            "author": "Ok-Base9059"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Exactly how I feel. Every single experience I’ve had with any department has been extremely negative",
                    "score": 3,
                    "author": "zeddleman0"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Same it's like they trolled us",
            "score": 10,
            "author": "Klutzy_Swim_8490",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's like that commerical \"oop you gotta be quicker than that\" but without telling us we had to be fast",
                    "score": 9,
                    "author": "spiteandcaffiene"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tapp is stupid",
            "score": 9,
            "author": "rively90",
            "replies": [
                {
                    "level": 1,
                    "comment": "agreed, hope this is a rude awakening for them.",
                    "score": 8,
                    "author": "spiteandcaffiene"
                },
                {
                    "level": 1,
                    "comment": "What an ignorant and mean thing to say. Those are real people working hard to help others. What have you done to help someone lately?",
                    "score": 0,
                    "author": "antiracistcoffeeguy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm trying to help people in the future by writing blunt feedback to TAAP :)",
                            "score": 2,
                            "author": "rively90",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Haha, fair enough",
                                    "score": 2,
                                    "author": "RaspberryAcceptable8"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "What have I done? Lots. I work in a hospital for christs sake.",
                            "score": 1,
                            "author": "spiteandcaffiene",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Then you should know how it feels when people talk down to you and accuse you of not caring, right? The fact that \"spite\" is the first part of your screen name tells me this isn't your first online rant. \nHaving said that, I wish you nothing but the best. I hope you're able to find the support you need in school. Good luck with your studies",
                                    "score": 0,
                                    "author": "RaspberryAcceptable8",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm graduating. Why would i need luck with my studies? Im done, if you couldn't tell by the post.\n\nI have never posted anything besides a rant about my wedding, cause if you've ever planned one, you'd know they fucking suck to plan. \n\n&amp;#x200B;\n\nThe \"spite\" in my same pertains to me going to school and overachieving out of spite because I was told I couldn't do it.\n\nThanks tho, know it all.",
                                            "score": 1,
                                            "author": "spiteandcaffiene"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My friend got the invite and she’s not even graduating this semester so I think they sent it out to some people on accident",
            "score": 7,
            "author": "killerunicorns027_",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I got the invite through text and I'm not graduating this semester either",
                    "score": 7,
                    "author": "phantasma20",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Insane. I wonder how many people not graduating are actually attending lmao",
                            "score": 7,
                            "author": "Jannanjuice"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I got it and I'm not graduating until next year.",
                    "score": 3,
                    "author": "peepjynx"
                },
                {
                    "level": 1,
                    "comment": "oooooooo!!! really????",
                    "score": 2,
                    "author": "spiteandcaffiene",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah 🙁",
                            "score": 1,
                            "author": "killerunicorns027_"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Me too! I ignored it because I thought it was spam at first. I just started last semester",
                    "score": 2,
                    "author": "mrosales91"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I saw it too and immediately deleted the email. Didn’t even notice the stool and pin give away until they mentioned “raffle” in the apology / slots filled email. Good riddance imo, OP. Congrats on graduating!!!",
            "score": 6,
            "author": "bthedebasedgod",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you thank you!!! I just wanted the stool, but the thought of a little bruncheon I could take m family to was nice too.",
                    "score": 6,
                    "author": "spiteandcaffiene",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think it would have been much cooler if they just sent all graduating TAPP students the stool and pin. Luncheon is nice but they had to have had numbers on how many students were graduating.",
                            "score": 10,
                            "author": "bthedebasedgod",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That part. I'm a TAPP student regardless of the luncheon or not. They hype up transfer students all the time but at the end of the day once again were proven we matter less I stg.",
                                    "score": 8,
                                    "author": "spiteandcaffiene",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Lol I feel you. They definitely budgeted less for us on the luncheon I’ll tell you that 😂",
                                            "score": 2,
                                            "author": "bthedebasedgod",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Watch it be hot dogs and a little bag of chips lol",
                                                    "score": 3,
                                                    "author": "ThatOneCambodianGirl"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I didn’t even see the email about it till 2 hours later. By then it was long gone. I hardly do any of the taps stuff but with graduation finally around the corner I thought it’d be nice to have a more intimate graduation for my wife and son but nope already gone.",
            "score": 5,
            "author": "davidv_guitar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same. This was the one event I could participate in because it’s a Sunday and even more so because it’s graduation specific, I was literally in the google forms filling it out and then when I submitted, it said all spots reserved.",
                    "score": 2,
                    "author": "spiteandcaffiene"
                }
            ]
        },
        {
            "level": 0,
            "comment": "im confused i filled it out and thought that i was good LOL how do i know if i made the cut",
            "score": 3,
            "author": "apolloxxi35",
            "replies": [
                {
                    "level": 1,
                    "comment": "im asuming you get and email comfirmation",
                    "score": 1,
                    "author": "spiteandcaffiene"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are there any benefits of joining TAPP? I have a little one and I’m curious!",
            "score": 4,
            "author": "illegalkoala27",
            "replies": [
                {
                    "level": 1,
                    "comment": "So, to date, I have experienced 0 benefits from TAPP besides a plethora of emails and texts, and no other benefits",
                    "score": 6,
                    "author": "spiteandcaffiene"
                },
                {
                    "level": 1,
                    "comment": "Truly, I never participated in any of their events because they were always at inconvenient times, this is the first even I actively tried to participate in and it closed within 40 minutes of being announced.",
                    "score": 4,
                    "author": "spiteandcaffiene"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I saw that too. Damn",
            "score": 3,
            "author": "jge162"
        },
        {
            "level": 0,
            "comment": "So disappointing",
            "score": 3,
            "author": "zeddleman0",
            "replies": [
                {
                    "level": 1,
                    "comment": "agree. i sent them an email saying do better.",
                    "score": 3,
                    "author": "spiteandcaffiene"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i clicked on the link within the first 5 minutes of it being sent and it was already full. so lame",
            "score": 3,
            "author": "edn99"
        },
        {
            "level": 0,
            "comment": "Hey this whole thing sucks but in an effort to prevent you from telling someone in person you wanted the free “stool” 💩i am here to save you from that and let you know it’s a free “stole” they were giving out😭",
            "score": 5,
            "author": "moo00oo0099",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;at 2:30 today they sent out the RSVP information for the bruncheon for TAPP students. By the time I called by husband and confirmed we could attend (about 2:50), filled out the RSVP, all of the \"slots\" were gone.why would you not put this event has a limited amount of event space?why would you not take into consideration the volume of TAPP eligible students on this campus?I am so unbelievably disappointed. I was excited to attend and now they want to \"raffle off\" a stool and pin for those who the RSVP closed on.Great way to end the semester.  \n&gt;  \n&gt;37 commentssharesave\n\nHAHA youre so right! My bad!",
                    "score": 4,
                    "author": "spiteandcaffiene"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Such a shame. I wonder how many people are allowed to attend.",
            "score": 2,
            "author": "Separate_Cobbler1665"
        },
        {
            "level": 0,
            "comment": "I have had nothing but great experiences at the TAPP center. Like anything, you only get out of it what you put into it. I have a feeling that a lot of the people complaining here have never bothered to step foot in the actual center. \n\nHad you gone to the TAPP center, you would have found a small group of people trying their best to make our experiences great. I have gone in for free coffee and snacks numerous times. They have provided me with free class materials, like scantrons and blue books and they have referred me to some great resources on campus. \n\nI have attended several of their events and always felt welcome. Some events were kid-friendly, and some were just for students, but I enjoyed them all. As an adult returning transfer student, I can't recommend them enough. \n\nDon't let the complaints of people who ignored the center all year shape your opinion. If everyone upset about not getting into the event showed up for other events throughout the year, they probably would have known to expect more people. Apathy has a price. In this case, the price is missing out on an event that nobody expected you to (finally) care about.",
            "score": 1,
            "author": "antiracistcoffeeguy",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am so happy that -you- were able to participate in all of the events the TAPP center held, because for me I found that they always had events during times I couldn't attend because it was during class times or on days I work my full-time job I couldn't participate in coffee and donuts. I'm allowed to have my opinion, period.\n\nI am so happy that -you- were able to participate in all of the events the TAPP center held because for me I found that they always had events during times I couldn't attend because it was during class times or on days I work my full-time job I couldn't participate in coffee and donuts. I'm allowed to have my opinion, period.",
                    "score": 1,
                    "author": "spiteandcaffiene",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Of course you are entitled to your opinion, as am I. My point is that, even if you couldn't attend the events, the center was open 5 days a week and the people there are always willing to help and provide us with free snacks and supplies as well as advice. I also work a full-time job, and a part-time job while going to school. There is no way they or any other group can offer events that everyone can fit into their schedule. It's a big school.",
                            "score": 1,
                            "author": "antiracistcoffeeguy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just because I didn't ever have the opportunity to go the goddam tapp center doesn't mean I cant be disappointed in the ONE event I could attend to and the one event I was excited for because graduating and wanted to participate in a TAPP event since I'm a goddam transfer student with a family. ADIOS my boy I'm tired of hearing from you, FR",
                                    "score": 1,
                                    "author": "spiteandcaffiene",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Congrats on graduating, Karen. ❤️",
                                            "score": 1,
                                            "author": "RaspberryAcceptable8",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "God forbid I have a negative experience and share it right? get over it. My god. the tapp center will survive. People will still go there. It is not at its demise because I shared something on reddit. Christ.",
                                                    "score": 1,
                                                    "author": "spiteandcaffiene",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Fair enough. In sincerity, congratulations on your degree. That's an amazing accomplishment.",
                                                            "score": 1,
                                                            "author": "antiracistcoffeeguy"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Everyone is entitled to their own opinion but it’s the fact instead of actually contacting the center and trying to talk to someone and try to understand  what was the reasoning behind this, you chose to complain and shed a negative light on a program that is actually trying really hard to help students who are sometimes never even seen or appreciated in other schools. This negativity only scares other people who are interested in getting to know what the TAPP Center is and who can actually benefit from the center.",
            "score": 1,
            "author": "Flaky-Ad2540",
            "replies": [
                {
                    "level": 1,
                    "comment": "I called and emailed. More than once. And did not receive a response. But please, go on with the assuming my dude.  but you know where I DID receive a response? Here. On Reddit. Funny. \n\nSo, I didn't just come on here to bitch and complain. I came on here because I didn't receive a gd response from them. Thanks tho",
                    "score": 1,
                    "author": "spiteandcaffiene"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would like to comment and say that I am a non-traditional student who is a parent that is working part-time and going to school full-time. I appreciate the TAPP graduation celebration event, but I feel that the school offers so many other graduation celebrations to attend to because I was also apart of other programs or organizations throughout my years here. Finding community in school is important, but only relying on the TAPP center is not the answer especially if students were not regularly attending their events. I did walk-in and check the social media a few times throughout the semester to see what was offered and if I could attend. The text message reminders help, but I was already busy with the other organizations and my classes I was committed to. Not to mention my life as a non-traditional student who is a parent, working part-time, and living on my own.",
            "score": 1,
            "author": "Bitter_Chip_Scholar"
        },
        {
            "level": 0,
            "comment": "I’m disappointed in shubi",
            "score": 0,
            "author": "Necessary-Pool-5857"
        }
    ]
}