{
    "id": "13tavpk",
    "score": 29,
    "title": "Disaster Recovery Testing",
    "author": "fulltablespoon",
    "date": 1685202709.0,
    "url": "https://www.reddit.com/r/csuf/comments/13tavpk",
    "media_urls": [],
    "other_urls": [],
    "postText": "Tell me why they thought it was a good idea to do disaster testing on the sites when grades were due last night….I’m just trying to see what I got 😫",
    "comments": [
        {
            "level": 0,
            "comment": "The system probably won't even be updated until Tuesday anyway.",
            "score": 15,
            "author": "Upstairs_Cobbler_897"
        },
        {
            "level": 0,
            "comment": "Is the portal loading in for you? CAUSE IM TRYNA SEE MY GRADES TOO!!!",
            "score": 8,
            "author": "Slimesplice"
        },
        {
            "level": 0,
            "comment": "that's called stupidity.",
            "score": 6,
            "author": "rively90"
        },
        {
            "level": 0,
            "comment": "Irresponsible for professors to wait until Friday to upload grades",
            "score": -7,
            "author": "based_Cc_Nerd",
            "replies": [
                {
                    "level": 1,
                    "comment": "Irresponsible? I’d be saying that if they don’t meet the deadline. \n\nMaybe consider the amount they have to grade and input. Plus they other commitments outside of the teaching setting.",
                    "score": 17,
                    "author": "jpmoogle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; Plus they other commitments outside of the teaching setting.\n\nThen where is this grace when it comes to deadlines for students?\n\nYeah. I don't play the \"do as I say, not as I do\" game. We're all adults.\n\nThese professors have a job. That job comes with 1 fucking deadline a semester. If they can't hold to it... especially when they repeatedly turn in grades after the due date, they need to be reprimanded and/or fired.",
                            "score": 7,
                            "author": "peepjynx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Professors did what they needed to do to become professors (adhere to deadlines while in college).\n\nIf you can’t do that as a student then that’s your problem, not theirs. You’re an individual who has a few assignments to get done on time.\n\nThey are an individual who has to grade HUNDREDS of assignments and teach hundreds of students.",
                                    "score": -7,
                                    "author": "HAND_HOOK_CAR_DOOR",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "LOL I hope that was a general \"you\" because I turn in my assignments on time. I meet deadlines, unlike some of those professors.\n\nAlso, be mindful. Not everyone going to college is some fresh-out-of-HS teenager. Some people are adults... and adults are held to the same standards at their places of employment. Miss deadlines? Reprimanded. Do it more than a few times? Most likely fired.\n\nProfessors don't have any \"sPeShUler\" circumstances to teach at a college. My SIL is a professor and she's often insulted FOR me at the way some of my professors handle themselves.\n\nWhen it comes to grading, primary school teachers have it way WAY worse.",
                                            "score": 6,
                                            "author": "peepjynx",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes, it’s a general you.\n\nYes, some going to college are adults with lives. They still need to complete their assignments on time to achieve the grades that they want. They need to figure out how to balance work and school.\n\nThis is not comparable to the hundreds of assignments and students a professor needs to deal with. If you think professors struggle now, imagine if students were allowed to turn things in late. This issue would be even more common. \n\nYes, professors should be on time. I don’t disagree. What I disagree with was the “where is this grace when it comes to deadlines for students.”\n\nThe situations are nowhere near balanced.",
                                                    "score": -2,
                                                    "author": "HAND_HOOK_CAR_DOOR"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "lol to be fair, most professors don’t upload grades until the end of the semester, like they don’t grade anything during the actual semester, so the procrastination is on them for once",
                            "score": 2,
                            "author": "Project_Legion"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can see my spring grades now, have you checked already?",
            "score": 1,
            "author": "ksr1e"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 0,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "What does wanting to see my grades have to do with networking 😅 let me live like damn",
                    "score": 6,
                    "author": "fulltablespoon"
                }
            ]
        }
    ]
}