{
    "id": "13v7u1p",
    "score": 4,
    "title": "Fullerton or Cal Poly Pomona for business analytics?",
    "author": "ih8uheaux",
    "date": 1685397426.0,
    "url": "https://www.reddit.com/r/csuf/comments/13v7u1p",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I’m already a graduate student in the Accounting program here at Fullerton but I want to switch to a business analytics program. I know Fullerton has an MS Info Systems with a business analytics track but I’ve been looking at CPP’s MS Business Analytics program too. \n\nI’ve always heard that Fullerton is the best choice for business, and for Accounting &amp; Finance ppl there’s no doubt. But what about for IS / Analytics? \n\nI’ve been told CPP is a good choice for tech oriented stuff like analytics but idk how their resources, clubs, job fairs, etc compare to Fullerton. Would it be worth it to stay at Fullerton for the resources? \n\nThoughts?",
    "comments": [
        {
            "level": 0,
            "comment": "Not sure for CPP but definitely a nope to pursue MSBS in Fullerton. Sounds like you just pay the money for one piece of paper and learning everything on your own. 😭",
            "score": 3,
            "author": "lockingdown",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh nahh 😭 has that been ur experience here? 💀",
                    "score": 1,
                    "author": "ih8uheaux",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "for undergrad yeah lol I only know one prof here that’s super knowledgeable. almost come back to get a master for a better job but didn’t cuz I realized connections are the way to go \n😂",
                            "score": 1,
                            "author": "lockingdown"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "+1 No.   Just get certs, apply to jobs and save 50k and 4 years",
                    "score": 0,
                    "author": "ZombieTestie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Neither. Don't go here for business analytics.  ISDS profs can't teach.\n\nGo to UCI/UCB instead",
            "score": 7,
            "author": "rively90",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was a marketing concentration but man I had some isds classes and the professors were so poor",
                    "score": 4,
                    "author": "macbackk"
                },
                {
                    "level": 1,
                    "comment": "I’d love to go to UCI but their MSBA is mad expensive 😭\nIs ISDS here really that trash? 👀",
                    "score": 1,
                    "author": "ih8uheaux",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yes. I regret attending it",
                            "score": 2,
                            "author": "rively90",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Are you undergrad or masters?",
                                    "score": 1,
                                    "author": "Own_Low8849"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes",
                            "score": 1,
                            "author": "Head_Radio_4089"
                        }
                    ]
                }
            ]
        }
    ]
}