{
    "id": "ex45x0",
    "score": 262,
    "title": ":)",
    "author": "nicoleillarmo",
    "date": 1580552227.0,
    "url": "https://www.reddit.com/r/csuf/comments/ex45x0",
    "media_urls": [
        "https://i.redd.it/nfpa5zopfae41.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I've been going to school since 2013. Dropped out for two years, and just transferred in this semester. It's okay.",
            "score": 28,
            "author": "das_vargas",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same thing happened to me. Started in 2012 and finally got my degree last year! It may seem like a long journey but you’re that much closer to finishing than you would have been if you never went back or even started in the first place.",
                    "score": 6,
                    "author": "xtrachickfilasauce"
                },
                {
                    "level": 1,
                    "comment": "All that matters is that you still have the motivation to complete your schooling. People go at their own pace, I’m proud of you!",
                    "score": 3,
                    "author": "nicoleillarmo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Much needed. Maybe mods should pin this one to the top for a good reminder. Sometimes those ads around school about fifteen units for four years to graduate are so annoying lol",
            "score": 26,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lowkey like the reason I posted this was because I came to the realization that I will not graduate in four years as the university recommends &amp; really puts out there. I need to work to pay for my bills, so 12 units is fine, but it will set me back. But as long as I get my degree ya know?",
                    "score": 5,
                    "author": "nicoleillarmo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly!! Im a sixth year (seventh maybe but I took a year off??) And it's so discouraging hearing people push the fifteen unit thing cause sometimes we're so busy that it's impossible or the pre-reqs or admin issues get in the way. Like life sucks sometimes stop trying to pressure kids as long as they're getting a quality education.",
                            "score": 3,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sometimes I forget that it’s okay, so thank you for the reminder ❤️",
            "score": 20,
            "author": "sans_serif_size12"
        },
        {
            "level": 0,
            "comment": "Once I graduate this May it will have been 5  and 1/2 years for me. I wish I had stopped comparing myself with everyone else and just have enjoyed my time as a college student. I feel like all the rushing I did to try and catch up just pushed me back further.",
            "score": 5,
            "author": "u_go_glenncoco",
            "replies": [
                {
                    "level": 1,
                    "comment": "That is literally me right now. I always compare myself to others (unhealthy, I know). All of my friends are going to graduate around the same time while I’m set to graduate a year after. It’s a little humiliating but I’ve come to realize that it’s not even a bad thing. Quality over quantity if you get what I mean!",
                    "score": 3,
                    "author": "nicoleillarmo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What stresses me out is FAFSA. I need the money, desperately. I've gotten this far pretty well, and if I need to I'll pull some loans by my 5th year. At least I won't be much in dept as someone who's been running on loans since freshman year",
            "score": 11,
            "author": "CVerse_",
            "replies": [
                {
                    "level": 1,
                    "comment": "I paid CC out of pocket but I’ve had to take out unsubsidized loans since transferring. Shit hurts man. It’s tough when your parents income is too high for aid but you still pay everything yourself.",
                    "score": 6,
                    "author": "4InchesOfury"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s taking me five! I wish more people would have told me that it’s completely normal to not finish in four years. I panicked thinking I was behind, when really I was just going at a pace good for me.",
            "score": 10,
            "author": "martianmars"
        },
        {
            "level": 0,
            "comment": "Im on the sixth and final year at CSUF. It sucks not graduating in 4 or even 5, but I figured I will be ok as long as I work hard. We've got a whole life ahead of us, no need to feel bad if you don't graduate on time. Although, CSUF really should help students try to grad in 4 though, especially the cs department.",
            "score": 4,
            "author": "mesorangerxx"
        },
        {
            "level": 0,
            "comment": "Thank you!",
            "score": 7,
            "author": "Red-Droid-Blue-Droid"
        },
        {
            "level": 0,
            "comment": "Thank you for the reminder! I always forget that it’s about the goal and not how long it takes to accomplish it :)",
            "score": 3,
            "author": "KariWins"
        }
    ]
}