{
    "id": "10e5gxw",
    "score": 15,
    "title": "Would you recommend someone to go to Cal Poly Humboldt? Desperate for advice!",
    "author": "shula2301",
    "date": 1673938264.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/10e5gxw",
    "media_urls": [],
    "other_urls": [
        "https://niche.com)"
    ],
    "postText": "I applied to Cal Poly Humboldt and have been seriously considering going here. I absolutely love animals, forests, and everything environmental, so i feel like i'm pretty much their expected audience. I'm planning to major in marine biology/zoology and hopefully get a job in wildlife rehabilitation. \n\nHowever, I'm really desperate to know more about this school. How is the living situation, professors, classes, internship/job opportunities, and environment? literally any advice/experiences would be SO so deeply appreciated \n\ni've been reading on ratemyprofessor and [niche.com](https://niche.com) about how the school is so chill to the point where it doesnt prepare you for grad school/real life and that makes me super nervous",
    "comments": [
        {
            "level": 0,
            "comment": "Don't listen to that. School gives you what you put into it. Humboldt is a wonderful school.",
            "score": 19,
            "author": "tmart42",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right? As if professors make you into something. They provide the opportunity (or should).\n\nI had a great time and I am doing well because of my education",
                    "score": 4,
                    "author": "Stinkiest-stink"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think it really depends on your major. I’m in wildlife and i have felt absolutely overwhelmed by the workload and expectations in some of my classes. I’m also a full grown adult (in my 30s) and breezed through “hard” classes in community college so i’ve been consistently surprised by my experience here (but i’m still glad i chose it).",
            "score": 14,
            "author": "chiropteranessa",
            "replies": [
                {
                    "level": 1,
                    "comment": "oh wow! this is a new perspective for me. i’m applying as a freshman for my bachelors, so i’m curious if the classes would be as rigorous as yours. \n\nif you dont mind me asking, whats wildlife learning like? Ive never had the opportunity to learn about different majors of my interest (as zoology/marine bio isnt a super popular major in comparison to something like business) and am still confused on what I want to major in specifically. I just know that i’d love to study marine creatures or animals in general, and a general explanation would be super insightful and helpful for me :)",
                    "score": 3,
                    "author": "shula2301"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It is a really chill lifestyle here but don’t underestimate the possibilities for your education. So far this school has enough resources to prepare me for grad/work. I transferred here being 24 yrs old so I already had an idea of what I need to be like to start preparing for grad school. I could imagine students just trying to get the degree and not lose their fafsa lol",
            "score": 7,
            "author": "JoeMother96",
            "replies": [
                {
                    "level": 1,
                    "comment": "is it hard to make friends? i hear the stereotype is that lots of people just smoke weed but im not really deep into that stuff so i’m worried on how id do in the environment socially. thank you for your response by the way!",
                    "score": 3,
                    "author": "shula2301",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There’s plenty of people who don’t give a fuck if you smoke weed and that’s coming from a stoner lol. People will smoke but it won’t stop you from making friends at all. There’s plenty of people that don’t smoke or like to often. \n\nJoin clubs for friends. A lot of the Rec sports and clubs is the way in to parties and fun activities",
                            "score": 4,
                            "author": "JoeMother96"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "it’s true that a lot of the teachers g a little easy on you, but it’s really up to the student if you do the bare minimum or really get into it. You’ll have resources and opportunity if you want it, and you’ll skate by if you want it too. Also I’d say if there’s any classes hsu doesn’t skimp on its the bio/science classes. humboldt is a great place for those and my botany class kicked my ass",
            "score": 7,
            "author": "ocax8me",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you so much!!",
                    "score": 2,
                    "author": "shula2301"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hello! I am in my second year(approx. Junior standing) here at Cal Poly Humboldt as a enviro engineering major and thus far my experience has been amazing. The academics are challenging and hands on. I attended UC Davis out of high school and dropped out bc of many factors but quality of education was one of those. I am now 27 and thoroughly enjoying my time on campus and in the community. Let me know if you have any more questions!",
            "score": 6,
            "author": "audmrod",
            "replies": [
                {
                    "level": 1,
                    "comment": "i appreciate this so much thank you !! i’ll definitely reply again or send a dm if i have more questions",
                    "score": 2,
                    "author": "shula2301"
                },
                {
                    "level": 1,
                    "comment": "How’s the housing situation right now? I live in San Diego, so I’m familiar with a tough housing market.\n\nAlso, do you know anything about the job market? I’d be looking for a server position (have a couple years experience).\n\nI’m a prospective student and the recent publicity about the freshman housing crisis has me nervous. I love the program I got accept to and the general vibe of Humboldt. But housing and job market has me concerned because I’d definitely need to work to get by.",
                    "score": 1,
                    "author": "tobinerino"
                }
            ]
        },
        {
            "level": 0,
            "comment": "SpongeBob was invented here. Need I say more?... In all honesty its a fantastic school. The whole idea that it's chill to the point of not preparing you for grad school is not really a thing especially in your Major(s). I know a lot of very successful alumni working in wildlife, marine bio, biotech, pharma, medicine etc. who wouldn't be where they are without rigorous classes they took at HSU / CPH. \n\nThe huge advantage for your chosen course of study is that If you are looking to study natural sciences you get literally hands on training with small class sizes and field excursions to work on ongoing research projects literally 10-15 minutes from campus. This school is world class already for this academic pathway(s) and will only improve as time goes on due to the huge increase in funding. Heck, you may even want to get your Masters Degree here cause you have already been working on a project you want to continue with your classmates or professors! Another advantage- yes you will be on a first name basis with all your professors unlike many colleges! \n\nAs for student life everything in Arcata is centrally located or within a short bike / bus ride. This is also a huge advantage as you spend less time getting around like other bigger universities and more time studying / recreating etc. This is important from a time management perspective as convince matters. Overall cost of attending CPH is less than other Polytechnic U's and most other state colleges in terms of tuition. Might have changed a bit since I attended but cost of living is also generally less than a lot of places save for fuel cost. \n\nThe surrounding town Arcata is generally very accepting culturally (we pride ourselves on this) with many alumni, including myself finding it a great environment. It could be somewhat of a culture shock to you depending on where you're from. I'm from South Bay suburbia and I loved the change of pace to a more slow, as in literally no traffic, pollution, city griminess etc. There is a real sense of community here that you don't get in a lot of places, and, if you are outgoing you will probably know your neighbors and run into people you meet in the campus community fairly often downtown. People tend to have less of a \"wall\" here and are more genuine, easier to get to know and more open to conversation, ideas etc. The politics are quite liberal here, valuing individualism and freedom, social justice, environmental justice etc, also potentially part of a culture shock for many. \n\nI don't know if you've visited here but the very fact that the school is immersed in nature is also a huge advantage cause, unlike other schools who are concrete jungles, the environmental backdrop is either, redwoods or a view of the bay or something else aesthetically pleasing. This is very good for mental health compared to a college in LA smashed into a cityscape. Stressed out before a presentation or exam? You can take a walk or jog in the Community Forest right behind campus and breathe the fresh air. There are countless other opportunities to get outside that are very accessible. This is a huge reason I moved back here when I got the chance in my adult life. \n\nAnyways, could go on and on. Feel free to dm me with any specific questions! Hope you choose CPH!",
            "score": 5,
            "author": "ipostcoolstuf"
        },
        {
            "level": 0,
            "comment": "My son is a Zoology major and his girlfriend is a wildlife major. Zoology is supposed to be a little bit harder than wildlife, but my son is sailing through his classes with all A’s. He has a car, and spends every bit of his free time in nature going tide pooling, hiking, fishing and doing wildlife photography. He does complain about the food, the weather, the classes being too easy and that the campus buildings are not as pretty has some of the others that we visited. However all dorms have bad food and no place is perfect. I’m sure classes will become more challenging as an upperclassmen. \n\nAs his mom, as soon as we set foot on campus, I could see his demeanor relax and knew it was the place for him. It’s perched on a hill with views of the ocean and the redwoods. \n\nWe live in California and the drive is easy and beautiful and he comes home frequently to visit. \n\nMy son did not have a lot of friends growing up but now he has found his people and it’s been so great to watch him make friends and have his first romance. \n\nHe was accepted into UC Berkeley, so\nthis was a hard decision for him too. We visited  twice for 3 days at a time before accepting.\n\nAlso, the classes are very small and  they group people by majors in the dorms, so you get to be around people that have a similar interest. My son does not party but he’s also not offended or concerned about the the majority of people who  do like to drink and smoke weed. It’s a very chill, laid-back atmosphere and no one seems to really care about trendy clothes or frats or anything like that. \n\nIf you’re into shopping, it’s not a great place to live as there’s pretty much only a Target and a few little shops and thrift stores in town. My son is into food and there isn’t a ton of really great restaurants but he’s found some he likes and he does some cooking with his girlfriend in the dorm.\n\nThe new Cal Poly designation has brought a lot of money and resources to the school as well as prestige. \n\nOh and the campus backs right up to a forest, which offers peace and solace when dorm\nlife gets too hectic.  \n\nIf you book an Airbnb stay in Arcata NOT Eureka. The college is in Arcata which is a nice little town but nearby Eureka is full of tweakers and homeless and might be off putting to you or your parents.",
            "score": 10,
            "author": "Playful_Butterfly290"
        },
        {
            "level": 0,
            "comment": "I follow a remote BA program at Cal Poly Humboldt, and if the care and quality of education I receive are indicative of the rest of the school, you should go for it.",
            "score": 3,
            "author": "Decent_Hovercraft227",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you!",
                    "score": 3,
                    "author": "shula2301"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You should go here!! It’s an amazing school! I have loved the people that I’ve met and the person that I’ve become while attending this school and living in this area. My professors have all been incredibly helpful and supportive of me, and I have liked if not loved pretty much all of my classes here (I’m a 4th year student—this is my last semester).",
            "score": 5,
            "author": "BirdButt88"
        },
        {
            "level": 0,
            "comment": "Recent alumni, if you're a potential zoology or wildlife major, I highly recommend Humboldt. While there's a few issues with admin and such (what college doesn't tho), every teacher I've had in wildlife and zoo classes has been absolutely fantastic. It should be noted that unlike some locations, there are actually a TON of chances to get hands on experience that will make you competitive for hiring upon graduation. The vertebrate museum, Eureka zoo, and multiple animal monitoring and rehab centers in the area take student volunteers, and there's always a teacher that needs some help in the summer do never be afraid to email email email!! Zoology and Wildlife are both great, zoo classes just tend to be more about physiology, taxonomy etc, while wildlife tends to be more hands on with trapping, tracking, etc. Definitely look up each majors classes and see which is better for you, because wildlife is only offered as a major, while zoo is a major and a minor!",
            "score": 4,
            "author": "Spades_for_days",
            "replies": [
                {
                    "level": 1,
                    "comment": "you are amazing this is wonderful advice thank you so much!",
                    "score": 2,
                    "author": "shula2301",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It sounds like you have a good handle already, but if ever you have any other questions, totally feel free to reach out!",
                            "score": 2,
                            "author": "Spades_for_days",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "i appreciate this so so deeply i will in the future :)",
                                    "score": 1,
                                    "author": "shula2301"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As far as preparing you for grad school, Humboldt has always been close to the top rank for percentage of students that complete a PhD. This is primarily because so many Biology, Wildlife students go on.",
            "score": 3,
            "author": "alt-mswzebo"
        },
        {
            "level": 0,
            "comment": "Honestly, I wouldn't reccomend it but a lot of people love it. The school is great with wildlife and the sciences in general, and it's within walking distance of hiking trails. But it is very remote and it's hard to get anywhere without a car. \n\nLiving situation really depends on luck. There's homeless students sleeping in cars, and dorms with tiny, tiny, rooms. Canyon, campus apartments and the Hill are the ones to stay away from, try to get into Creekview or college creek.",
            "score": 3,
            "author": "AggravatingQueer2412",
            "replies": [
                {
                    "level": 1,
                    "comment": "could you elaborate on any more of the disadvantages of going there? i really appreciate the advice i had no idea they had housing issues as well",
                    "score": 2,
                    "author": "shula2301",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh boy. Basically, there's too many students and not enough rooms to put them in. They currently have a contract with a hotel about a mile away that they put 100 students in, but it's probably going to get worse in the next few years. They're planning to tear down the campus apartments and surrounding buildings to build a larger, hopefully more secure housing space, but it won't be ready to live in for a few years. They really should've built it before becoming a \"cal poly\" because it's only going to bring in more students that can't get rooms.",
                            "score": 1,
                            "author": "AggravatingQueer2412",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "oh wow. i really hope they improve that ASAP. a bunch of UCs and CSUs are dealing with housing issues recently and it sounds like an absolute nightmare to go through. thanks for letting me know!!",
                                    "score": 2,
                                    "author": "shula2301"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}