{
    "id": "10ly5t7",
    "score": 0,
    "title": "Dating Scene Humboldt",
    "author": "cunnyraptor",
    "date": 1674756278.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/10ly5t7",
    "media_urls": [],
    "other_urls": [],
    "postText": "Note: I'm abandoning thread but keeping this up as a warning to men to stay away from woke, man-hating feminists on campus that will find any excuse to ruin your life. To those who decided to respond to this thread, your replies have been redpilling to say the least, with most of you demonstrating EXACTLY why a post like this needs to be made in this sub. At a normal college, NO student wanting to go to school should be falsely accused of sexual misconduct by trying to socialize. These toxic assholes will use Cal Poly Humboldt's misandrist HR department to completely fuck you over, in my case over an \"anonymous tip\". Just look at these fucking replies, fellas, please, do yourselves a favor and go off-campus to date or make friends. People like this are better off left alone. \n\n---\nI graduated last semester after transferring in 2021. I've been to four universities over the course of my academic career including overseas, yet in all my time in college I have never had such an abyssmal experience trying to find romance.\n\nFor the people I see in this sub talking about how hard it is to connect, befriend, or network with others, you are not alone. I am an fit, outgoing, and relatively attractive dude who's had decent luck dating and forming relationships off-campus with non-students; however, I have never seen a group of college students who were more anti-social and straight up entitled in my entire life. \n\nFirst and foremost, after four semesters of study almost all the friends I made were from student clubs or the pool tables. Try to make friends or ask out a female classmate? 99% of the time it will end horribly. They all are in \"situationships\" or will just straight up use you for homework help/resources before throwing you away like trash. \n\nI have no clue if it's the women's studies professors or merely just what university students in general are like in the 20s, but as a straight male I have never felt so frustrated at the sheer disrespect, gossip, and transactional superficiality in all my 8 years of being in university. After the last person I asked out BSed me and blew me off this month to go see amateur fights after using me for a free meal I had to speak up.\n\nFellas, ladies even, don't bother trying to ask people out on campus or your classes. It's nothing but a recipe for drama and highschool-tier bullshit. Save yourself the stress and join off-campus organizations or clubs. Keep your nose to the grindstone and avoid these self-absorbed dyed hair feminists who think they're better than every man on the planet.\n\nSeriously. I'm not just being salty, the experiences I've had would horrify you. Don't risk your academic or professional career over a false accusation of harassment, stalking, or assault because you want to ask out the cute woke girl in your class. If you don't heed this advice it might cost you everything.\n\nBest of luck on your Spring semester y'all.",
    "comments": [
        {
            "level": 0,
            "comment": "i was wondering when the usual worst takes in this subreddit would show up this week",
            "score": 42,
            "author": "bupropions",
            "replies": [
                {
                    "level": 1,
                    "comment": "When you can't even ask for someone's number without getting accused of sexual harassment then there's a problem. I'm doing this to save people the stress of almost having their lives ruined over petty bullshit.",
                    "score": -15,
                    "author": "cunnyraptor"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe the best thing would be to take a year off of dating/attempting to date so you can do some introspection.  That might include finding out that bad things aren’t just happening TO you.  Hopefully you’ll come out stronger on the other side.",
            "score": 23,
            "author": "Unfair-Geologist-284",
            "replies": [
                {
                    "level": 1,
                    "comment": "I appreciate this compassionate answer. And hope OP considers it",
                    "score": 2,
                    "author": "elieax"
                },
                {
                    "level": 1,
                    "comment": "Nope, I've done perfectly fine outside of university. Only when dealing with entitled, egotistical students did I encounter these scenarios.",
                    "score": 1,
                    "author": "cunnyraptor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ok, so clearly you are sick of the place and done with the romantic selection.  Why not just move elsewhere?  Your anger regarding this is off putting and a total turnoff for females, just so you know.  Maybe Humboldt ladies don’t put up with that?",
                            "score": 18,
                            "author": "Unfair-Geologist-284",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's hilarious... if you're reading anger from the message, that's from the way you're filtering it.",
                                    "score": 0,
                                    "author": "RTMalthus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He’s definitely angry. How do you not see the OPs anger?",
                                            "score": 1,
                                            "author": "magicimagician",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Because nowhere in there did he say he was angry.  That is how you choose to interpret his post",
                                                    "score": 1,
                                                    "author": "RTMalthus"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I met my future wife on campus. Come to think of it, all of my core college friends met their spouses on campus.",
            "score": 22,
            "author": "bookchaser",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah same! Started dating my boyfriend in 2017 and still going strong. We were good friends and in the same major. 🥰",
                    "score": 11,
                    "author": "Sheena-ni-gans"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lmfao, just listen to yourself my man.",
            "score": 21,
            "author": "tmart42",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have, have you?",
                    "score": 1,
                    "author": "cunnyraptor"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Humboldt is not the place for you. You keep typing out replies with political stuff and calling the women here \"woke feminists' just because women don't want to be approached by you. Your own politics also seem at odds with the type of women you are likely to find here.",
            "score": 19,
            "author": "swantonist"
        },
        {
            "level": 0,
            "comment": "Skill issue",
            "score": 49,
            "author": "eatan18",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not really, I got plenty of action off campus but nearly got thrown out of university off of BS in my classes",
                    "score": -31,
                    "author": "cunnyraptor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly. It’s a skill issue that you are facing . What BS almost got you thrown out ?",
                            "score": 14,
                            "author": "eatan18",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Accusation of sexual harassment. Literally go before a board and explain why you're not a piece of shit despite there being zero evidence of wrongdoing. Had to retake the \"sexual violence &amp; prevention\" course which I'm waiting to do after I pay off my remaining balance. All I'm trying to do here is let dudes know that this can happen to any of them at any point in time.",
                                    "score": -21,
                                    "author": "cunnyraptor",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Truth... a friend of mine went through a ton of shit over a false allegation last semester. Campus listens to both sides and did a good job of resolving the problem. Everyone should be concerned that false allegations seem to have zero consequences. Creates a culture where wokeness and victimhood are rewarded.",
                                            "score": 2,
                                            "author": "RTMalthus"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Why would you be complaining about not being able to find someone at school if it’s so easy outside of it? Seems like it shouldn’t be worth your time, but you decided to whine about it on Reddit",
                            "score": 13,
                            "author": "I_JIZZ_ON_U",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Typical redditors that don't read posts or replies, I nearly got expelled off a false accusation, so I'm making this post to warn men to not waste their time or endanger their academic career.",
                                    "score": 0,
                                    "author": "cunnyraptor",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You nearly got expelled for asking for a ladies phone number? Stop lying about what really happened.",
                                            "score": 3,
                                            "author": "magicimagician"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "How about you read your own post and see if you believe it. It comes off as you being creepy and got mad you almost had to face the consequences.",
                                            "score": 9,
                                            "author": "I_JIZZ_ON_U"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You must be the same person posting on r/Humboldt meets with the ad “hmu ladies you won’t be disappointed”",
                            "score": 2,
                            "author": "magicimagician"
                        },
                        {
                            "level": 2,
                            "comment": "Did this get deleted?",
                            "score": 2,
                            "author": "meadowmbell",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nothing has been deleted by moderators in this thread. The self-post and the comment you replied to are still visible unless you've been blocked by an author.",
                                    "score": 8,
                                    "author": "bookchaser",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you, I went back to read new comments and couldn’t find the post in the main feed.",
                                            "score": 2,
                                            "author": "meadowmbell",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Your Reddit preferences could be set to hide submissions you have upvoted or downvoted. In that instance, they won't appear on the subreddit's front page on subsequent visits.",
                                                    "score": 3,
                                                    "author": "bookchaser",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh that’s interesting, I didn’t know about that until now.",
                                                            "score": 2,
                                                            "author": "meadowmbell"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "No, also you're not blocked btw",
                                    "score": 0,
                                    "author": "cunnyraptor"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly, I think your rampant sexism and misogyny might be a turn off.  Probably should have attended Liberty University instead.",
            "score": 43,
            "author": "BakedTatter",
            "replies": [
                {
                    "level": 1,
                    "comment": "Boohoo cope and seethe. Doesn't seem to be an issue for off-campus women, only woke feminists with mental health issues",
                    "score": -2,
                    "author": "cunnyraptor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm only seeing one guy seething here, my man.",
                            "score": 19,
                            "author": "BakedTatter"
                        },
                        {
                            "level": 2,
                            "comment": "so, the problem is a difference of politics? you do know this is norcal, right? where so many leftie hippies live? you didn't expect this? I mean that is like going to LA &amp; being surprised to find so many aspiring actors. lol",
                            "score": 5,
                            "author": "crazygamer780"
                        },
                        {
                            "level": 2,
                            "comment": "Off campus women who have already gone to college and are closer to your age? Maybe that it.",
                            "score": 2,
                            "author": "magicimagician"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hmmm. I (F) was asked out by a classmate (M) and he wouldn’t leave me alone (in person or on the phone) to the point I had to open a no-contact order at the school. Showed his texts and threats which were evidence enough to get approved for the order.\n\nSaying it’s women only is absolutely wrong.",
            "score": 12,
            "author": "whatasmallbird",
            "replies": [
                {
                    "level": 1,
                    "comment": "Where did he say it was only women? \n\nSorry you went through that.",
                    "score": 2,
                    "author": "RTMalthus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“keep your nose to the grindstone and Avoid these self absorbed dyed hair feminists who think they’re better than every man on the planet”",
                            "score": 3,
                            "author": "whatasmallbird",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't think he's saying only women make false allegations or that only women could be feminists. You're just assuming that and using it to make a strawman argument to attack OP.\n\nIn my experience on campus in the two instances I saw of false allegations being made, one was by a trans person with a vagina, the other was a woman. Both made false allegations against cis men.",
                                    "score": -1,
                                    "author": "RTMalthus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He’s stating “as a straight male I’ve never felt so frustrated at the sheer disrespect… etc etc”. Now tell me, who is he feeling frustrated with? Who is he pursuing as a straight male? Oh right, women. This whole rant was about women. Stop talking about straw man fallacies when he’s directly talking about women.",
                                            "score": 5,
                                            "author": "whatasmallbird",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What does your negative experience with an overbearing immature jerk of a guy have to do with someone making false sexually based allegations? \n\nHis point was to tell other men to avoid nutty feminists as one made false allegations of a sexual nature against him.",
                                                    "score": 1,
                                                    "author": "RTMalthus",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I’m not responding after this. You can claim I’m wrong,  strawman fallacy this, women that. Whatever. \nHis post was filled with rhetoric about how women don’t like him and it’s the women’s fault. I responded that it isn’t just women. Go through the other comments on this post, the community feels as I do.",
                                                            "score": 6,
                                                            "author": "whatasmallbird",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "More deflection. How others feel doesn't matter.  Your point still wasn't relevant. OP seems to have problems but everyone is quick to shit on him instead of help",
                                                                    "score": -1,
                                                                    "author": "RTMalthus",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "bruh by problems do you mean that he sexually harassed people? given the rhetoric in his post i have zero doubt in my mind his actions were sexual harassment, he is just to thick to consider any of his actions wrong. the percentage of allegations that are false are beyond slim(like 0.00001% of allegations are false), but when men cry false accusation, institutions believe them. in a he-said-she-said situation establishments like universities and police departments believe the man.",
                                                                            "score": 3,
                                                                            "author": "Subject_Pop1076",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Rhetoric is not proof of wrongdoing. There's no evidence here that op sexual harassed anyone. Stop trying to be an internet savior.",
                                                                                    "score": 1,
                                                                                    "author": "RTMalthus"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Spoken like a true incel who is obviously hiding the bad parts of this story.",
            "score": 12,
            "author": "Sunshine_Blues"
        },
        {
            "level": 0,
            "comment": "I don't know dude. I know you're coming from a place of loneliness and hurt, and I empathize, I really do. But have you ever considered this might be a skill issue? Because I, and others I know, have not been struggling to make friends and date.",
            "score": 33,
            "author": "UsefulLab1298",
            "replies": [
                {
                    "level": 1,
                    "comment": "Like I've said before, I got action off campus, and I'm not \"lonely\" or \"hurt\". I nearly had my life ruined by just trying to be friendly; not the same thing.",
                    "score": -13,
                    "author": "cunnyraptor"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So you are upset that you are being accused of sexual harassment? What do you consider “zero evidence”? It’s hard to believe you based on how you’ve presented yourself",
            "score": 30,
            "author": "eatan18",
            "replies": [
                {
                    "level": 1,
                    "comment": "I did nothing but ask them out after they gave me my number, and the case dropped because the other party refused to comment. There was zero evidence of wrongdoing because it was all hearsay; pure slander meant to be mean.",
                    "score": 3,
                    "author": "cunnyraptor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Everything YOU are saying is ALSO hearsay. It’s important to take sexual harassment allegations seriously, don’t you agree ?",
                            "score": 24,
                            "author": "eatan18",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was not expelled because there was no evidence of wrongdoing. Innocent is presumed before guilt, but of course people like you are the reason this is a problem in the first place. Do you agree that university is a bad place to date then? Seems like you do, so I don't see the issue.",
                                    "score": 4,
                                    "author": "cunnyraptor",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It isn’t about assuming you are automatically guilty, it’s about respecting someone’s complaints about sexual harassment and taking it seriously. Of course university isn’t a bad place to date, but it sure is a bad place to harass someone",
                                            "score": 9,
                                            "author": "eatan18",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The only person actually leading me towards thinking you are guilty of something is you. Your reaction and self -absorbed nature is rancid and hints at how you approach dating, stinky and poopy and icky-like",
                                                    "score": 12,
                                                    "author": "eatan18",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I get there are instances of he said-she said. Both sides should be heard. Do you think there should be consequences for those making false allegations? (with proof of course)\n\nEver wonder why there is an academic integrity policy but no general student integrity policy?",
                                                            "score": 2,
                                                            "author": "RTMalthus"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "This is a Suuuuuper hard concept to comprehend , I know, but maybe don’t approach people romantically in an academic setting !",
                            "score": 13,
                            "author": "eatan18",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "College is not merely an academic setting. Its equally a social setting as it is academic.",
                                    "score": 9,
                                    "author": "Stinkiest-stink",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Agreed. But there are situations it’s not appropriate. Like if you’re doing a group project, don’t ask out a project partner while doing the project. At the very least, it’s extremely awkward if rejected",
                                            "score": 5,
                                            "author": "whatasmallbird",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh absolutely, there's a time and place for everything. Social awareness is key.",
                                                    "score": 3,
                                                    "author": "Stinkiest-stink",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I feel like a lot of people do not have social awareness in certain things, especially post lockdown, myself included for sure LOL",
                                                            "score": 5,
                                                            "author": "whatasmallbird"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That’s a good point, and there are lots of nuances to socializing with classmates and it isn’t uncommon for these social settings to lead to more meaningful friendships and/or relationships. Nobody is oblivious to that , but it’s more important for EVERYONE to feel safe in the space they are here to LEARN in. It doesn’t matter if you think you aren’t making someone uncomfortable, the fact is when someone speaks up about concerns about unwanted approaches or harassment we HAVE to take that seriously. No one is going to get automatically kicked out of school without a process, but these reports HAVE to be taken seriously",
                                            "score": 5,
                                            "author": "eatan18",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What are unwanted approaches?",
                                                    "score": 2,
                                                    "author": "RTMalthus"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You simply asked for their number , which they gave you. And then they falsely accused you of inappropriate behavior? You really are fooling yourself if you think that you did nothing wrong and all you did was “ask for their number”",
                            "score": 1,
                            "author": "magicimagician"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You are such a selfless savior ! All of these blue hair (btw blue hair= bad feminist!!!) are targeting you because they just can’t understand how attracted they are to you! Us cis men are really the ones who need our voices to be heard for once ! Ooooooohwwww I have sex with so many girls all the time off campus but I wanna sleep with students but they won’t let meeeee ugh this world is so toxic and full of female priveledge!",
            "score": 35,
            "author": "eatan18",
            "replies": [
                {
                    "level": 1,
                    "comment": "This but unironically",
                    "score": 0,
                    "author": "cunnyraptor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Blue hair is mental illness ! Instead of trusting women, let’s categorize all feminists as “self absorbed and toxic” and whine when we are rejected ! You’re logic is so profoundly intellectual and informed my liege",
                            "score": 12,
                            "author": "eatan18"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel you on some points. I would keep the aggressive stereotyping to myself if i was gonna make a post like this. It really is hard trying to meet people. I am a social person but starting school a little later than usual I cant really hit on people younger than 21. So its just difficult overall unless youre some wook or some like hella alternative type of person. It is really hard trying to meet people alike me. I just stick to helping everyone out and just platonically being a great person overall. It is just hard to find someone that sparks that feeling within me like I have had with previous relationships outside of this area. \n\nMaybe this place just wasnt for us. It is my last semester here and I am a little sad I had not met any motivating person. It just feels like all these people were really affected by covid and their socialization skills are in the shitter unless youre in their clique or friend group. It really is like High school environment here. Maybe I just need to let go and just hook up with just anyone, but for me I cant do that i feel fucked up inside and I just feel like im wasting all my time. I am a good looking genuinely good guy and i know when people type that shit about themselves its a red flag but I know I am genuine.",
            "score": 7,
            "author": "askope11",
            "replies": [
                {
                    "level": 1,
                    "comment": "You actually sound like a decent person from your post.  I had a hard time finding anyone at Humboldt that I was interested in, so I gave up and searched closer to my home.  Wound up in a long distance relationship for a year til I graduated and moved back to the area I was from.  Sometimes it just makes sense to do something like that.  Not enough fish in the Humboldt sea.",
                    "score": 2,
                    "author": "scienceismybff"
                },
                {
                    "level": 1,
                    "comment": "I am only being as harsh as I am because people need to hear it. Woke feminists are doing all they can to make the dating culture at this university as toxic as possible for men, and thinking you'll find a \"normal\" girl on campus is basically impossible. Going off campus to meet people/date was the best decision I've ever made. Dealing with girls from my classes or student orgs killed my self-esteem and self-worth. Dudes who are in denial of this (typical on plebbit, just look at these comments) still need to be warned about what may be in store for them if they shoot their shot. Wishing you the best fam, you'll have luck eventually if you keep your head up.",
                    "score": -1,
                    "author": "cunnyraptor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You know what’s funny?  You accuse women of being entitled, except the only one I’m really seeing as entitled here is actually you.  Yes, you.  You feel entitled to these women and to relationships and sex.  Sit and think about that for a minute.  You sound really angry.  Maybe you should run in the forest behind campus to get it out.",
                            "score": 15,
                            "author": "Unfair-Geologist-284",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm entitled after I almost get my life ruined after being found innocent after the fact? Fucking Christ you plebbitors are absolute smoothbrains",
                                    "score": 0,
                                    "author": "cunnyraptor",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’d love to hear how it all went down.  Did you simply approach a woman and ask for her number?  Doubtful.  It’s fun to play the victim, isn’t it?  Why don’t you go to the places where you were romantically successful before and quit Humboldt?  Seriously.",
                                            "score": 12,
                                            "author": "Unfair-Geologist-284",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Wouldn't a false allegation make him the victim?",
                                                    "score": 2,
                                                    "author": "RTMalthus"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It’s like those dashcam videos where they only show the part where they were hit and claim the other driver at fault. But fail to show part where they blindly drove out in front of the oncoming car against a red light.",
                                                    "score": 2,
                                                    "author": "magicimagician"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "By any chance do you pay Andrew Tate a monthly fee? Post reeks of incel",
            "score": 7,
            "author": "urkillinmebuster"
        },
        {
            "level": 0,
            "comment": "Personally I never chase the girl, always let them come to you. Interact with girls who are interested in you and you should not have a problem .",
            "score": 7,
            "author": "Choice-Let-2882"
        },
        {
            "level": 0,
            "comment": "how do you even step foot near the coast of California with a mindset like this im so confused",
            "score": 7,
            "author": "dcseal"
        },
        {
            "level": 0,
            "comment": "I get what you're saying, although it's also not entirely true. A lot of people are anti-social so straight-up asking for someone's number, even when they seem friendly, can become an issue. At the same time, I know a lot of couples that met each other for the first time on campus while they were students, and most are happily married now with kids or in long-term relationships with kids. My advice to you is to chill out and let things move slowly. If it's meant to be it'll be. Definitely don't let this sentiment be the thing that holds you back from finding your person because people who live here but were never students can be just standoffish &amp; weird.",
            "score": 6,
            "author": "CultureBrat388"
        },
        {
            "level": 0,
            "comment": "I graduated in 2016 and met my future wife there and now we have a kid lol. We both were in the same department and had classes together. Before that, I was dating for years, meeting people at parties and what not. It’s a good school for dating IMO. I know a lot of others who met their future partners there as well.",
            "score": 14,
            "author": "javihumboldt",
            "replies": [
                {
                    "level": 1,
                    "comment": "That was literally 7 years ago bro it's a totally different campus now tbh.",
                    "score": -6,
                    "author": "cunnyraptor"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What other colleges did you go to for comparison/reference?? It might just be a different demographic or culture of the area. I'm drawn to this type of gloomy weather as an introvert. Maybe you expected something like SDSU, the big party school where all the jocks and stacys go lmao",
            "score": 4,
            "author": "pupe_fontanero",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe, but mostly it seems to be a difference in ideology and general mental health.",
                    "score": 1,
                    "author": "cunnyraptor"
                }
            ]
        },
        {
            "level": 0,
            "comment": "But fr, though, how is the dating scene here? Incoming student.",
            "score": 4,
            "author": "fukarundandfindout",
            "replies": [
                {
                    "level": 1,
                    "comment": "I found the dating scene to be very humdrum.  I found a lot of friends, however, in the dorms and in classes.  I think at a bigger university, it's harder to actually make friends in classes.",
                    "score": 5,
                    "author": "scienceismybff"
                },
                {
                    "level": 1,
                    "comment": "Honestly bro, you're not gonna have a good time. I highly recommend joining clubs off campus.",
                    "score": 4,
                    "author": "cunnyraptor"
                },
                {
                    "level": 1,
                    "comment": "it actually sucks unless youre straight up 18-19. There really is nobody here on dating apps and in my field of study, there are barely any women that are available or even attractive. Same with the dudes a lot of guys are just copys and dirty musty mfers. I am not into guys but this whole area is only made for a niche group.",
                    "score": 2,
                    "author": "askope11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He does say he’s been going to school for 8 years. That would mean he’s 8!years older than most. No wonder he has problems.",
                            "score": 2,
                            "author": "magicimagician"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Play frisbee and chill",
            "score": 4,
            "author": "SFKnight510"
        },
        {
            "level": 0,
            "comment": "Not quite the dating scene, but I was just reminded of how I got kicked off the Lumberjack because the Editor wanted to give my spot to one of her friends. that's \"equality\" at play folks.",
            "score": 4,
            "author": "Someoneoldbutnew"
        },
        {
            "level": 0,
            "comment": "smells like incel",
            "score": 16,
            "author": "Educational-Might633"
        },
        {
            "level": 0,
            "comment": "Wait you got accused of sexual harassment and you’re upset at women about this? HOW ABOUT YOU STOP APPROACHING WOMEN FFS!!!",
            "score": 20,
            "author": "meadowmbell",
            "replies": [
                {
                    "level": 1,
                    "comment": "Asking a girl's number deserves being thrown out of school? You're part of the problem.",
                    "score": -1,
                    "author": "cunnyraptor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Women, like myself, merely want to EXIST in this world doing whatever men do, like get an education, without having to be hit on.",
                            "score": 7,
                            "author": "meadowmbell",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Okay, so then you agree that uni is a bad place to date then? Thanks for backing me up  ;)",
                                    "score": 3,
                                    "author": "cunnyraptor",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hamburger has ham in its name so it must be made out of pig. Kinda feels like your type of reasoning skills",
                                            "score": 6,
                                            "author": "eatan18"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "So you just asked for her number let’s say one time and then she accused you of sexual harassment? I don’t think so. Explain what really happened",
                            "score": 1,
                            "author": "magicimagician"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nice guy energy",
            "score": 8,
            "author": "djeazyali",
            "replies": [
                {
                    "level": 1,
                    "comment": "Niceguy? LMFAO go back to 2017",
                    "score": 1,
                    "author": "cunnyraptor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What does 2017 have to do with your post? Is that the year you were falsely accused?",
                            "score": 1,
                            "author": "magicimagician"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you haven't be falsely accused before, then you won't understand what he's saying. I don't agree with everything he said but definitely there are women and men that are shit bags and would use you. Life is tough and hey as a man you gotta be careful now adays because it's easy for a woman to try and fuck your reputation and life up. If someone says he's a abuser nobody will believe him if he Denies it. And in that case you're better off growing as a person and wait for a woman to approach you. Even then it might not go well. I think we all walk a path and some of us walk alone. Don't trip over women it's not worth your peace of mind. People always talk shit and it's easy to talk but it's difficult for a young man to navigate in a false image of himself. Also you gotta realize that mental health is serious and we all suffer from it at different degrees. Personally I don't ask for numbers anymore I just suggest them take my number and let them decide because man woman are everywhere and be confident don't doubt yourself worth. Fuck everyone that throws hate around. If you're a good person at heart life will favor you but just make sure you make good decisions. One last thing, try dating older women;)",
            "score": 2,
            "author": "soil4life"
        },
        {
            "level": 0,
            "comment": "I guess if you read into his name “cunnyraptor” it makes sense he hate women.",
            "score": 1,
            "author": "magicimagician"
        },
        {
            "level": 0,
            "comment": "Tl;dr but as soon as you say \"man-hating feminists\" I can tell you're the problem.",
            "score": 1,
            "author": "elieax"
        },
        {
            "level": 0,
            "comment": "you'd think the gender ratio would make men a rare commodity, but no. i felt your pain long ago, the Humboldt Honies aren't very sweet. manipulative, entitled and petty, sure. just remember once your cohort turns 25, the tables turn, and it's hard for ladies to find good men. i blame the women's studies who refuse to acknowledge or turn their critical gaze towards female privilege.",
            "score": -18,
            "author": "Someoneoldbutnew",
            "replies": [
                {
                    "level": 1,
                    "comment": "100%, but I honestly don't care about that as much as how willing the administration is willing to take their side over everything. The fact I almost got expelled because of a false accusation woke me up. If people find this post \"cringe\" or whatever then they can cope and seethe. Dudes are out here getting their lives ruined because of childish nonsense; even in this thread you can see it. People turn a blind eye to this until they personally get burned, but now they're warned.",
                    "score": 5,
                    "author": "cunnyraptor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i think you are the only one who is coping and seething right now, dude. you are very weird",
                            "score": 7,
                            "author": "DeltaRedwood"
                        },
                        {
                            "level": 2,
                            "comment": "That speaks towards our culture, unfortunately. Can you imagine the backlash if the administration didn't defer to the woke ideological mob? Go read 'Coddling of the American Mind' for more about this cancer in our education system.",
                            "score": -2,
                            "author": "Someoneoldbutnew",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you hate wokeness, why did you go to Cal Poly Humboldt? You don't see liberals going to Biola or Pepperdine.",
                                    "score": 10,
                                    "author": "BakedTatter",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "wokeness wasn't a thing when i went there. i don't hate it, what a waste of energy, it's sad to turn diversity of thought and discussion into a monoculture. i started before the university bloated their administrative costs. between the time i started and the time i graduated (did two degrees and took a break to work), a semester was about 4x the cost. perhaps at the time, i may have even had a more liberal-skewing view of the world, but that ignorance is now tempered by time spent in reality. i have learned ideologies serve the group and the powerful, but not the spirit of the individual. woke women refuse to take responsibility for their power, and seek to deny men their power in turn. when women compete in the workforce, they are much more accomplished manipulators then men. it's brutal to watch the oppressed become the oppressors.",
                                            "score": -1,
                                            "author": "Someoneoldbutnew",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "r/fragilemaleredditor \nr/fragilewhiteredditor",
                                                    "score": 6,
                                                    "author": "BakedTatter",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "even if you keep at it, your ideology won't save you, it can't, you have to save yourself.",
                                                            "score": 3,
                                                            "author": "Someoneoldbutnew",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You don't get old as you age, you get old when you don't engage. Got to change with the times.  What's acceptable or not is always expanding or contracting, we are just in a moment of contraction.",
                                                                    "score": 4,
                                                                    "author": "BakedTatter",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "as if we had any choice in the matter, adapt or die",
                                                                            "score": 2,
                                                                            "author": "Someoneoldbutnew"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Lol you said female priveledge",
                    "score": 8,
                    "author": "eatan18"
                }
            ]
        }
    ]
}