{
    "id": "10u87e7",
    "score": 2,
    "title": "Accept Admissions Offer Help",
    "author": "Onion_is",
    "date": 1675587569.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/10u87e7",
    "media_urls": [],
    "other_urls": [
        "https://its.humboldt.edu/accounts-passwords/activating-your-hsu-account](https://its.humboldt.edu/accounts-passwords/activating-your-hsu-account)),",
        "http://welcome.humboldt.edu/new](http://welcome.humboldt.edu/new)"
    ],
    "postText": "Can someone please help me with this? I am having trouble creating a MyHumboldt account to accept my admissions offer. I tried following the instructions from this link to activate my account ([https://its.humboldt.edu/accounts-passwords/activating-your-hsu-account](https://its.humboldt.edu/accounts-passwords/activating-your-hsu-account)), but when I do it says I need to enter my MyHumboldt account username (which I don't have BECAUSE I AM TRYING TO MAKE THE ACCOUNT SDSIDSHDSIDHS).\n\nCan someone please help me? I bet the solution is probably really simple, and I am just stupid. It's stuff like this that makes me doubt I am even worthy of college.\n\n&amp;#x200B;\n\nThis was the link the Activating my Humboldt Account webpage told me to go [http://welcome.humboldt.edu/new](http://welcome.humboldt.edu/new)\n\n&amp;#x200B;\n\nI just do not understand. What is my Humboldt username?",
    "comments": [
        {
            "level": 0,
            "comment": "Scroll to the bottom of the [Activating Your Account](https://its.humboldt.edu/accounts-passwords/activating-your-hsu-account) page to see the Help Desk phone line number. Call between noon and 4 p.m. today (Sunday), Pacific Time. A telephone call really is the fastest way to resolve this. Or call 8 a.m. to 8 p.m. on a weekday.",
            "score": 2,
            "author": "bookchaser"
        },
        {
            "level": 0,
            "comment": "Hi check if you got an email with the subject \"Application and login information from Cal Poly Humboldt.\" I got sent this on December 5th and it gave me a username and authorization code. Hope this helps!",
            "score": 1,
            "author": "Significantducks",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s wild! I didn’t get that email!!",
                    "score": 1,
                    "author": "Onion_is"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Look at the housing issues and reconsider enrollment",
            "score": 1,
            "author": "Otherwise_Archer_484"
        }
    ]
}