{
    "id": "11sysba",
    "score": 9,
    "title": "Machine Shop/Maker Lab at Humboldt?",
    "author": "KAL0SZ",
    "date": 1678983907.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/11sysba",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, I am thinking about attending cal poly humboldt for mechanical engineering. I couldn't really find any information online on any machine shops or maker spaces at Humboldt, does anyone know if there are any spaces or clubs like this on campus?\n\nAlso, what are the engineering programs like at Humboldt?",
    "comments": [
        {
            "level": 0,
            "comment": "This fall is the first time they are offering mechanical engineering. So there is not much information about it in general",
            "score": 12,
            "author": "Ok-Bee1366"
        },
        {
            "level": 0,
            "comment": "We have a \"Maker space\" in the campus library. [Link to page.](https://libguides.humboldt.edu/makerspace)\n\nThey have a few tools you can rent and a space to work in but its not a full blown makers space. To my knowledge, there is not a freely available shop space with a Mill/CNC.\n\nOutside of campus, [Humboldt Makers](https://humboldtmakers.com) exists but is struggling to get off the ground.",
            "score": 4,
            "author": "Squid_At_Work"
        },
        {
            "level": 0,
            "comment": "There is a metal casting shop. https://www.humboldt.edu/programs/facilities",
            "score": 2,
            "author": "Riptide360"
        },
        {
            "level": 0,
            "comment": "Hello!\r  \nI am part of the team working on the new makerspace for the mechanical engineering program that is coming soon.\r  \nI have good news for you, there is a capable makerspace coming to Cal Poly Humboldt Fall 2023. Within this makerspace one will find wood and metal CNC machines, laser cutters, 3D printers, and an array of other exciting tools. \n\n\r  \nThe Makerspace will be offering machine capabilities in the following areas:\r  \nwoodworking, metalworking, fiber work, thermoplastics and sustainable materials.\n\n\r  \nThe space will be open to students to use for projects, as well as serve as a hands on classroom.\n\n\r  \nWe look forward to being able to provide these facilities, as well as meeting all of the wonderful students coming into the program here.",
            "score": 2,
            "author": "Nick_Weiser"
        },
        {
            "level": 0,
            "comment": "There is a maker space in the library, I've never used it but maybe the library page would have more info?",
            "score": 1,
            "author": "Phrodo_1",
            "replies": [
                {
                    "level": 1,
                    "comment": "3d printers, maybe a laser cutter/engraver, but definitely no metal shop equipment.",
                    "score": 5,
                    "author": "snipe4fun"
                }
            ]
        },
        {
            "level": 0,
            "comment": "College of the Redwoods is a better bet. They have welding, and machining programs.",
            "score": 1,
            "author": "shinhoto"
        },
        {
            "level": 0,
            "comment": "In the same theme, are there any community labs/lab spaces open to students? \nJust a shot in the dark given safety concerns",
            "score": 1,
            "author": "stevenbo"
        }
    ]
}