{
    "id": "f9cvop",
    "score": 5,
    "title": "Bio Majors?",
    "author": "Bellebutwithscience",
    "date": 1582648408.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/f9cvop",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! I'm considering transferring to HSU in the fall, but I would really like to get in contact with some biology majors first to ask them how they feel about the school. Some outreach people from Humboldt came to a nearby city, and their presentation was really great. I was feeling pretty sold, but I can't trust all that propaganda! I really want to know how people feel about the labs, available funding, internship opportunities, PIs, etc. Does anyone here have strong opinions about the biology department, one way or the other?",
    "comments": [
        {
            "level": 0,
            "comment": "Hi there, I graduated from Humboldt with a cell molec degree about two years ago. I loved it, I got to do a lot of hands on research and am now currently working at UC Davis in a research lab. A lot of my cohort have also gone into research post grad as well as med/vet school, biotech and other medical fields.\n\nAlso I got my current job through an internship program at hsu",
            "score": 5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! This is really helpful to know 🥳",
                    "score": 2,
                    "author": "Bellebutwithscience"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey there! I'm a campus ambassador/tour guide of HSU and a peer adviser at the Academic and Career Advising Center on campus. I'm also a senior graduating with a Cellular/Molecular Biology degree this May! I'm so happy you asked this question. Considering the size of our student population and 23:1 student teacher ratio, getting into directed study (research opportunities alongside your professors) is pretty non-competitive and getting research experience in a lab as a freshman, sophomore, and undergraduate in general is very much a realistic goal here since we do have an intimate sized campus and a large biology department. Most if not all of our life science professors are doing research projects alongside their students and I personally have been part of a directed study project for about a year now with my cell bio professor. When you also declare your major under the College of Natural Resources and Sciences, you are put into an email subscription thread called HSU Biological Sciences, and this is where the Biology department sends out emails including internship opportunities, research opportunities, grants, scholarships, and basically anything Biology/ life science related that students in the field would find interesting. I would highly recommend checking out HSU's Biological Science Faculty page ([http://www2.humboldt.edu/biosci/facstaff.html](http://www2.humboldt.edu/biosci/facstaff.html)) and read every professor's current research projects and what they teach so you have an idea of what directed study opportunities you could have when you transfer. Also, as a transfer student you have a transfer counselor who can help you if you have questions about academics and the whole process of transferring. You would just have to contact the office of the registrar at 707-826- 4101 then ask to speak to a transfer counselor for your major. Having been here for 4 years under the Biology department, the one component of this school I enjoyed the most is that amount of hands on learning experiences I was able to have in my undergraduate and graduate classes for my major classes — especially with labs since labs are also small and you tend to work individually or in groups — plus the intimacy of the class sizes here. Definitely come get a tour of the campus if you can because it is really beautiful up here and ask to get a Science/Biology focused tour! I work for this tour guiding department and they are trying out some new tour routes for college-specific people who only want to know about that certain college. You can schedule a tour if you call 707-826- 4402. Feel free to contact me if you have more specific questions, I love talking about my major and the campus :)",
            "score": 5,
            "author": "lolitalosity",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for such a thorough and helpful response!!!",
                    "score": 1,
                    "author": "Bellebutwithscience"
                }
            ]
        }
    ]
}