{
    "id": "hc1ueh",
    "score": 4,
    "title": "Where can I buy a used bike?",
    "author": "Sublinguel",
    "date": 1592577549.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/hc1ueh",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi All, \n\nI just moved here and I am looking for a bike, nothing fancy.  I'm seeing like 10 bikes on craigslist -- all for way more than I can spend.  Is there something that I'm missing?  Another site or place to look?\n\n&amp;#x200B;\n\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "Another approach is to reply to each of the Craigslist bike ads with something along the lines of \"I am an HSU student looking for a bike.  I can only afford to spend XX dollars, which I know is well below your asking price, but if you are in a hurry to let it go, I would be very grateful to buy it for XX.\"\n\nAs someone who has sold (and given away) many things on Craigslist, I can tell you that sometimes the seller knows their price is high, especially if the item doesn't immediately sell.  Sometimes they just want to get rid of the item, but didn't price it well.  Another thing is that sellers often appreciate a polite response, and you may find their soft spot and get them to agree to a lower price even though they hadn't planned on it.\n\nGive it a shot.  Your only cost is 10 minutes of your time.  Good luck!",
            "score": 12,
            "author": "sandforce"
        },
        {
            "level": 0,
            "comment": "Sometimes you have to surf craigslist for a minute. There are also a few bike stores which usually have a few used but tuned bikes, hence the price tags. There is also the bike kitchen in eureka and the bike library in arcata who sell used and usually beat bikes they put together. Good luck!",
            "score": 3,
            "author": "pm_me_domme_pics",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was looking for the bike library and couldn't find the location, where is it.? Thanks",
                    "score": 1,
                    "author": "Sublinguel"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wouldn't recommend the pawn shop in arcata. I got a bike there that turned out to have a mechanical issue that resulted in my face meeting gravel two miles into the arcata community forest. Also, get a good lock.",
            "score": 3,
            "author": "PucWalker",
            "replies": [
                {
                    "level": 1,
                    "comment": "When did we get a pawn shop? I’d like to check it out.",
                    "score": 1,
                    "author": "meadowmbell",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Dealz on 1219 11th Street.",
                                    "score": 1,
                                    "author": "PucWalker",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Dealz has been gone for a minute.",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This is another \"I'm getting old\" marker in life for me",
                                                    "score": 1,
                                                    "author": "PucWalker"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Try moon cycles in arcata. Or theres the arcata bike library that rents them for $20 for 6 months",
            "score": 2,
            "author": "Toucheamoreon",
            "replies": [
                {
                    "level": 1,
                    "comment": "That sounds awesome but I couldn't find the location, where is it exactly?",
                    "score": 1,
                    "author": "Sublinguel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The library is on the bike path where L street stops. The cross street would be 12th. \nI havent seen anyone there recently though so I would reach out to them first\nhttp://www.arcata.com/greenbikes/",
                            "score": 1,
                            "author": "Toucheamoreon"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "how much are you trying to spend? i have a vintage miyata 310 i’m willing to let go of",
            "score": 1,
            "author": "RunUpTheSoundWaves",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey thanks! Looking for 50-150 range and not for a strict road bike , would be nice to take it on dirt roads etc.",
                    "score": 1,
                    "author": "Sublinguel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "oh tough, there’s a place in santa rosa that’s non profit and sells 2nd hand bikes. otherwise my friend found a specialized at the pawn shop near the pacific outfitters in eureka.",
                            "score": 1,
                            "author": "RunUpTheSoundWaves"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There's the bike library in arcata. Those dudes might have something they could put together for you.",
            "score": 1,
            "author": "fauxfyre7",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've about it but cant find it or find any contact info.  you got any idea how i can get in touch?",
                    "score": 1,
                    "author": "Sublinguel"
                }
            ]
        }
    ]
}