{
    "id": "i2wu4b",
    "score": 6,
    "title": "Off-Campus Housing",
    "author": "DangerousSundae7289",
    "date": 1596460565.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/i2wu4b",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ve been searching for a few months for a decent place that allows dogs and most if not all of the property management groups I’ve spoken with all say no. Anyone know of places that allow dogs not too far from campus? I have a pit bull which makes things harder due to “restrictions” but she’s my service animal I have to have her with me. It’s getting down to the wire I really gotta move from SoCal soon so if I don’t find something I’ll just have to keep her on the low.",
    "comments": [
        {
            "level": 0,
            "comment": "try checking craigslist. there's still some good local landlords who sell on there and allow pets. be sure if you find a deal that looks too good to be true it probably is. always reverse image search the images of the place to make sure it's not a scam. like others said, dont even mention your dog to property management if its a service dog it's none of their business.",
            "score": 13,
            "author": "alexandermurphee"
        },
        {
            "level": 0,
            "comment": "If it sincerely is a type of service animal I wouldn't mention it while applying to these places. A rental agency can't refuse your service dog if they approve your application and can't deny your application based solely on you having a service dog... Unless of course it isn't actually or legally a service dog.",
            "score": 7,
            "author": "pm_me_domme_pics",
            "replies": [
                {
                    "level": 1,
                    "comment": "Been my service dog for 2 years now. All legal. When I mentioned her and also that I had all my paperwork they just said their whole property is animal free. Of course illegal but I don’t have time to fight justice rn I just need a place that won’t kick me out",
                    "score": 1,
                    "author": "DangerousSundae7289",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As the previous poster said, if it's a legitimate service dog (not some certificate off the internet, they are on to those), then don't mention it.  The reasons we stress \"if it's legitimate\" isn't to be mean, it's because if it's not, and you don't have all your ducks in a row (letter from your doc, etc.), this will backfire drastically on you.\n\nIf it's legitimate though, wait until after you are approved and just before lease signing and request the reasonable accommodation.",
                            "score": 6,
                            "author": "GoEducateYourself"
                        },
                        {
                            "level": 2,
                            "comment": "Do you mind if I ask what type of service dog you have?",
                            "score": 2,
                            "author": "420cortana420",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "She’s a seizure response dog. Only way I’ve been able to live on my own is bc of her so she’s not an option really. Just didn’t know if I was gonna stick out at a no pets place with her or if it doesn’t matter. I’ve known lots of places who say no animals that don’t care in reality I’d just rather not be the only one.",
                                    "score": 3,
                                    "author": "DangerousSundae7289",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’d recommend doing what the previous person above said. Don’t mention her until you’ve been approved. IIRC it’s against the law to remove someone from housing due to a legitimate service animal.",
                                            "score": 7,
                                            "author": "420cortana420"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "We got paper work for our dog to get into rentals. You can just tell them it's a service animal. If they try to deny you tell them they can't, nor can they charge you a pet fee.\n\n[You can read more about it here](https://www.disabilityrightsca.org/publications/fact-sheet-rights-to-assistance-animals-in-housing#:~:text=Under%20California%20and%20federal%20law,accommodation%20for%20a%20tenant's%20disability.&amp;text=There%20is%20no%20requirement%20that,a%20reasonable%20accommodation%20in%20housing.)",
            "score": 5,
            "author": "Hawful"
        },
        {
            "level": 0,
            "comment": "Most places won’t even allow a cat, it’s really hard with a dog, even though it’s a service animal.",
            "score": 1,
            "author": "meadowmbell"
        },
        {
            "level": 0,
            "comment": "This is a registered service dog? That’s much different than an ESA. Everyone up here claims they have an ESA to get animals into their apartments so that’s why it’s a bit difficult. Lots of liars. This isn’t a dog friendly rental market. Kramer property management has a couple place they allow dogs I believe but the apartments are expensive and they are VERY small",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}