{
    "id": "i817xo",
    "score": 10,
    "title": "Swag bag issues.",
    "author": "Worrmm",
    "date": 1597183480.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/i817xo",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey guys! So I am a transfer student and I finished all the experiences including the additional resources! I was trying to get the swag bag but when I click the link to go claim the bag it sends me to the blue page we were all getting when the initial orientation link was broken. Has anyone come by this problem as well and may have emailed or called? If so what information do you get? I called but no one answers and the voice mail is full, I just sent a email as well and am waiting for a response.",
    "comments": [
        {
            "level": 0,
            "comment": "😡\nI transferred last year and didn’t get any swag bag, and neither did any of my other fellow transfers. I know it’s not your point but I want free stuff too lol",
            "score": 11,
            "author": "marijuanaspiderman",
            "replies": [
                {
                    "level": 1,
                    "comment": "If you go to Housing and say you didn’t get a bag, they’ll give you one. I did that the first year I transferred because I missed the day they handed them out.",
                    "score": 1,
                    "author": "Sweetguy88"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hey, u/Worrmm, \n\nWe just called the Orientation folks and they said there was an issue with the site and if you got the points, you get the swag. Call 826-3504 and leave a voicemail (that gets translated into an email and sent straight to the right person) with your info. Their VM filled up overnight, but it's cleared now and unless they're on with someone else, they're picking up. \n\nSorry about the confusion, and thanks u/[Sweetguy88](https://www.reddit.com/user/Sweetguy88/) for the heads up. We can't solve a ton of problems via reddit but we try our best.   \n\n\nBe safe, wear the mask, keep some distance. :)",
            "score": 4,
            "author": "HSU_Official",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much! Got it taken care of it!!",
                    "score": 1,
                    "author": "Worrmm"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m transferring this year and I didn’t even know about a swag bag 😢",
            "score": 4,
            "author": "therealhopefalters",
            "replies": [
                {
                    "level": 1,
                    "comment": "Have you don’t the orientation online? You should have gotten an email",
                    "score": 1,
                    "author": "Worrmm",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I did it back in like May. No email. That’s kind of disappointing.",
                            "score": 1,
                            "author": "therealhopefalters",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wait check your humboldt email! I think the transfer orientation just opened up and is running from August 9th - 20th! I think you’re referring to the canvas modules we did back in May.",
                                    "score": 1,
                                    "author": "Worrmm",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I didn’t see it in my e-mail. Bummer. Only orientation email I got was from the Social Work Program.",
                                            "score": 1,
                                            "author": "therealhopefalters",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "u/HSU_Official",
                                                    "score": 1,
                                                    "author": "Worrmm"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can't even find the link for the swag bag, is it on the page somewhere, or in one of the emails?",
            "score": 2,
            "author": "chiropteranessa",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hmm click on additional resources and then it’ll take you to a page that will have a section that reads “Optional Orientation Points” and click on “click here to learn more” it’ll take you to the page where you fill out the form.",
                    "score": 1,
                    "author": "Worrmm",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ok, I found it but I'm getting that blue \"uh-oh\" page now. I'll call or email them.",
                            "score": 2,
                            "author": "chiropteranessa",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Again? It was happening for me like 2 days ago but I sent them an email and they said they fixed it. Send them an email tonight and they’ll reply by the afternoon tomorrow! They’re very good at responses! I would suggest you include your HSU ID # in the email just in case it’s an individual thing!",
                                    "score": 1,
                                    "author": "Worrmm"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tagging u/HSU_Official",
            "score": 1,
            "author": "Sweetguy88",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for this!",
                    "score": 1,
                    "author": "Worrmm",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For sure! You can also try messaging them on Instagram. They’re pretty quick with replies.",
                            "score": 2,
                            "author": "Sweetguy88"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "im transfering and didnt know swag bag was a thing so i thought this post was going in a different direction",
            "score": 1,
            "author": "jmcsasdf",
            "replies": [
                {
                    "level": 1,
                    "comment": "Loool where did you think this was going",
                    "score": 1,
                    "author": "Worrmm"
                }
            ]
        }
    ]
}