{
    "id": "i9coit",
    "score": 6,
    "title": "Non-traditional Students",
    "author": "chiropteranessa",
    "date": 1597368259.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/i9coit",
    "media_urls": [],
    "other_urls": [],
    "postText": "Heyyy! I am transferring to HSU this semester (Wildlife Management and Conservation) and, as a 34 year old undergrad, am wondering how many other non-traditional students are on this subreddit. \n\nAre there any clubs or organizations that help us find each other?  If not, say hello here!  I am moving up from San Francisco sometime in the next few months and it would be nice to find a community.",
    "comments": [
        {
            "level": 0,
            "comment": "Hey there! I'm also in my 30s and moved up here last year. I don't know about clubs (I'm not a club kind of person), but I haven't had too many issues in finding returning students to spend time around. Welcome to Humboldt!",
            "score": 5,
            "author": "agnomengnome",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks, and that's good to hear!",
                    "score": 1,
                    "author": "chiropteranessa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm 26 - Just moved up from LA like 5 days ago. My major is the same as yours! Feel free to DM me when you get here and we can be pals!",
            "score": 5,
            "author": "victimbycoffee",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'll probably try to move up around the holidays (either Thanksgiving or after the semester ends), but if you want to connect before then my insta is @ \\_vanessaelise\\_",
                    "score": 1,
                    "author": "chiropteranessa"
                },
                {
                    "level": 1,
                    "comment": "I just moved here too &amp; same major! I need friends",
                    "score": 1,
                    "author": "jawssxii"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m 32 and just starting my second run at HSU. I honestly like being an older student. Have a different mindset towards education and am a more disciplined learner. My first run at college was a disaster. I don’t know if there are clubs or anything, but maybe we should start one when everything gets back to normal.",
            "score": 4,
            "author": "therealhopefalters",
            "replies": [
                {
                    "level": 1,
                    "comment": "You should definitely start a club!",
                    "score": 1,
                    "author": "Sweetguy88"
                },
                {
                    "level": 1,
                    "comment": "I don't know the first thing about starting a club, but I'd join!",
                    "score": 1,
                    "author": "chiropteranessa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m a wildlife major too. This is a great place to study wildlife. Your gonna have a lot of fun",
            "score": 2,
            "author": "hatbatcatsat",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope so! Looking forward to being able to take in-person, field-based classes  hopefully sooner rather than later.",
                    "score": 1,
                    "author": "chiropteranessa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Non-trad student here. I find campus to feel incredibly isolating. No one in my age group to talk to, and not really into pursuing girls who aren't old enough to go to the bar. It's a meh experience, and the GE components have proven to be, by and large, utterly worthless.",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's unfortunate to hear. For the most part, I'm done with my GE except for a diversity component (trying to do NAS 200 this semester but I'm still on the waitlist) and communications (I am definitely the oldest person in there, lol). What's your major?",
                    "score": 2,
                    "author": "chiropteranessa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm majoring in Business Admin, with an Econ concentration. I like my program, but don't connect very well with my 'peers.' That said, I'm 40 so it makes sense.",
                            "score": 1,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Waz up all my name is Greg and I am 35 and botany student at HSU. I am looking for any one that might be  interested  in being roommates off campus. Also hit me if an of want to be friends. I know a few people here but most of my buds aren’t coming back till the Plague is over.",
            "score": 1,
            "author": "gclapper58",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are you already in Arcata? I will probably be moving up there around the holidays and depending on what I can find, may be looking for a roommate at that point.",
                    "score": 1,
                    "author": "chiropteranessa"
                }
            ]
        }
    ]
}