{
    "id": "ib7bcj",
    "score": 3,
    "title": "Online Orientation very inaccessible!",
    "author": "[deleted]",
    "date": 1597637996.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/ib7bcj",
    "media_urls": [],
    "other_urls": [],
    "postText": "Anyone else hate how horribly designed the lumberjack link online orientation is? search box overlaps with links on one page, there's a text title overlaid on a photo of text on another page. Only some of the videos have captions, others have wildly inaccurate auto generated captions. The videos are all very different volumes, I have to adjust volume between every single video. If you click play on a video with another video playing, it doesn't pause or mute one of them, it plays both at once. From the checklist, you can't right-click an experience and open it in a new tab then return to the checklist. You have to follow several links to navigate back to the checklist. Furthermore, info is presented in two columns with randomly staggered rows (which personally I don't mind, but screen-reader users would). I'm really disappointed in the quality of the website. You'd think such a liberal school would care about accessibility. Considering the cost of tuition, I expect professional and functional site design! I've had positive experiences with online learning before, but this is a huge letdown. I'm hoping the class content is much better. Online learning is the new norm, it's not time for sloppy websites. Step it up, Humboldt!",
    "comments": [
        {
            "level": 0,
            "comment": "Should be an interesting semester. Hopefully we don’t see any psps in the near future .",
            "score": 3,
            "author": "morningcoffeez",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lightning storm took my power for 6 hours yesterday 😭 I've been lucky with the psps so far though, mine only shut off for a couple minutes at a time",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "@hsu_official should be able to help",
            "score": 3,
            "author": "meadowmbell",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; u/hsu_official\n\nFTFY",
                    "score": 1,
                    "author": "Sweetguy88"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just finished it.  It definitely was not the smoothest online website I have used. Still trying to figure out how to try and get the swag bag. lol",
            "score": 3,
            "author": "therealhopefalters",
            "replies": [
                {
                    "level": 1,
                    "comment": "There was a previous post here about the swag.",
                    "score": 2,
                    "author": "meadowmbell",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I emailed orientation and they gave me the link for the form. Got it all done! Wonder what’s going to be in it.",
                            "score": 3,
                            "author": "therealhopefalters",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I hope it’s good since the process was hard!",
                                    "score": 1,
                                    "author": "meadowmbell"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a former web designer, I appreciate the detailed list for issues you encountered. I couldn't locate the site in question; I presume it might only be accessible to registered attendees.\n\nI wonder if any of the issues are related to the web browser you are using. The \"*search box overlaps with links on one page*\" sounds like a browser-specific issue, or even a device-specific issue (for example, the page not being optimized for mobile browsers), because the display issue presumably didn't present itself when the designer was creating the page.\n\nUsing the site in another browser, especially one updated to the latest version, might make a difference. I'm not excusing backward compatibility or browser compatibility problems in general, but just looking for a short-term solution.\n\nWhat browser and version are you using, and what type of device?",
            "score": 3,
            "author": "bookchaser",
            "replies": [
                {
                    "level": 1,
                    "comment": "Windows 10 on a laptop, first I tried Firefox but finished it up on chrome. Using chrome resolved one overlapping button. Both browsers up to date. Yes, it's only accessable to registered new students who are logged in.",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I haven’t been able to access it. Couldn’t fine the right link...so I guess this kind of explains it.",
            "score": 2,
            "author": "therealhopefalters",
            "replies": [
                {
                    "level": 1,
                    "comment": "I recommend emailing orientation@humboldt.edu to get the correct link. That’s what I had to do.",
                    "score": 3,
                    "author": "motherwildlife"
                },
                {
                    "level": 1,
                    "comment": "I got emailed the wrong link but then I got a follow up email with the right link and a reminder email also with the right link",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I ended up emailing them. No access, but they fixed it so I’m going to check when I get back home.",
            "score": 2,
            "author": "therealhopefalters"
        },
        {
            "level": 0,
            "comment": "Clearly a new student. Good luck to you. HSU is a mess even when there’s no pandemic",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}