{
    "id": "ic81zw",
    "score": 1,
    "title": "Anyone know how to join clubs while quarantined? No luck on doing so on clubs website.",
    "author": "[deleted]",
    "date": 1597779547.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/ic81zw",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "There is a website with all of the online clubs that is being set up right now I believe it will be up in 3 weeks\n\nThis is what I've heard may be a bit inaccurate but it's the best I've got",
            "score": 4,
            "author": "Nix_that",
            "replies": [
                {
                    "level": 1,
                    "comment": "I appreciate it - I found the \"lumberjack link\" on the clubs.humboldt site. It makes sense that I don't understand how to join because as you say, it's still be set up. I am apparently jumping the gun.\n\n&amp;#x200B;\n\nThank you for your input. :)",
                    "score": 2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "im not sure if clubs have been activated yet.  they have to go through a training process first. after they do that you'll see more advertising and ways to connect.",
            "score": 3,
            "author": "alexandermurphee",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have now discovered this thanks to you and the other reply. It appears I need to do little more than be patient. I just thought I was missing something - apparently not!\n\n&amp;#x200B;\n\nThank you. :)",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There’s a Virtual Quad coming soon where all the clubs will have a short video or presentation and you can decide to join them or not. Like u/nix_that said, there’s a website in the works for the clubs. They used to be on OrgSync, but they’re switching over to their own site this year. \n\nA lot of the clubs are on Instagram. If there’s any specific club you’re interesting in, check to see if they have an account.",
            "score": 1,
            "author": "Sweetguy88"
        },
        {
            "level": 0,
            "comment": "Hello, \n\nSo I aske4d around and they said you can email [clubs@humboldt.edu](mailto:clubs@humboldt.edu) to find more information about joining!",
            "score": 1,
            "author": "Mcs563"
        }
    ]
}