{
    "id": "jzsfj1",
    "score": 26,
    "title": "HSU becoming a Polytechnic school?",
    "author": "goathill",
    "date": 1606171492.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/jzsfj1",
    "media_urls": [],
    "other_urls": [],
    "postText": "According to the email from president Jackson, HSU may become the 3rd polytch universoty in CA. what might this mean for HSU moving forward? What sort of economic and social implications would this entail? Which programs would stay, which programs will be cut?",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 15,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This would be a very welcome addition!",
                    "score": 3,
                    "author": "goathill"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It seems like a bit of a reach to me? Like are there enough labs to even support that idea?",
            "score": 11,
            "author": "meadowmbell",
            "replies": [
                {
                    "level": 1,
                    "comment": "We’d need some lab equipment made in this century to say the least lol",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Letter text:\n\nFriends and Colleagues,\nI am writing to share with you an incredible, transformative opportunity that the California State University has presented to Humboldt State University.\nIn a letter we received at the end of last week from Chancellor Timothy White, HSU is asked to undertake a self-study toward becoming designated the third polytechnic university in the CSU. Full letter (pdf)\nAs Chancellor White indicates, this designation would build upon HSU’s strengths, help us meet important needs for the North Coast and California, and make our campus increasingly attractive to students from California and beyond. Building on the collective vision emerging from our academic and strategic planning, we can reimagine the polytechnic university for the 21st century - marked by a focus on sustainability, hands-on and career-focused programs, and a broad liberal arts education. Beyond traditional polytech programs, we can infuse traditional ecological knowledge, renewable technologies, equitable and ethical practices, and more. There are many possibilities, and I believe this is a time to raise our sights.\nThis request from CSU follows limited conversations with faculty and other individuals on campus, with leaders at other polytechnic campuses, and with leadership at the CSU. We are now being asked to more fully develop this concept and create an academic and business plan.\nThis is our moment. First, let’s allow ourselves to imagine, dream, and consider Humboldt as a polytechnic. What are the possibilities for this region and future students? What are the possibilities for new grants and research?\nWe are aware that this announcement is coming during Fall Break and wanted to make sure that our campus community was informed of this communication from the Chancellor’s Office as soon as possible. Provost Capps will be following up when students and faculty return from Fall Break next week with more detailed information on next steps and opportunities to get involved.\nThis request from CSU comes at an opportune time, as we are currently engaged in numerous campus-wide planning processes, each of which includes broad stakeholder participation. I have asked Dr. Jenn Capps, Provost and Vice President for Academic Affairs, and Dr. Lisa Bond-Maupin, currently serving as Interim Deputy Chief of Staff and Special Assistant to the President, to lead the requested self-study, with goal of completing it by the end of the Spring 2021 semester. Please give us some time to set up an informational webpage on this matter. Please look for more information in the coming weeks.\nSincerely,\n\nTom Jackson, Jr.\nPresident",
            "score": 8,
            "author": "goathill",
            "replies": [
                {
                    "level": 1,
                    "comment": "[Here](https://mailings.humboldt.edu/president/2020_11_23b/TPW-JacksonMemo11-20-20HUM%20Polytechnic.pdf) is the pdf referenced in the above letter.",
                    "score": 4,
                    "author": "Sweetguy88"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is this going to raise our tuition?",
            "score": 5,
            "author": "hiugvvxfhvfh",
            "replies": [
                {
                    "level": 1,
                    "comment": "My thought was that it would a) raise tuition, b)increase admission, c) gut the arts/\"non-science\" majors, all in an effort to reduxe the debt HSU is likely to incur on themselves and the CSU system.\n\nIt seems like several full time jobs will be devoted to this inquiry, money which numerous programs could use for lab equipment, field trips, more tenured professors etc...\n\nAlso seems like a good political move for Mr. Jackson: \"in addition to my resume I helped transition a faltering University into a  polytech.\" Before he picks up and moves to yet another university in 2-4 years. (He is a career ladder climber, take a peek at his resume if you want to see for yourself)",
                    "score": 20,
                    "author": "goathill",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yes cahss is being gutted for sure",
                            "score": 5,
                            "author": "alexandermurphee"
                        },
                        {
                            "level": 2,
                            "comment": "I’m worried about the liberal arts majors being cut. Plus I heard that HSU is getting rid of some chinese classes, which I’m bummed about. Glad I got my chinese minor taken care of already.",
                            "score": 3,
                            "author": "Sweetguy88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "they are cutting cahss courses like no tomorrow ask any cahss prof lol",
                                    "score": 1,
                                    "author": "alexandermurphee"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My speculation is that, in the short term, no. A transition to a polytech isn't going to happen overnight, and it definitely isn't going to begin next Fall. If they're smart (which is giving a lot of credit where it may not be due), I doubt any student currently enrolled or admitted will still be at HSU when/if it does become a polytech.",
                    "score": 10,
                    "author": "Bretters17",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think you are right on the timing thing, it will be years until a transition like this happens. I do think it plays to the strengths of HSU (wildlife, botany, NR, environ engineering, forestry, Native American studies) but I do worry that the wonderful art department might be gutted in favor of more hard science/math. I predict that the music/theatre/crgs programs will be drastically reduced as a result (likely from declining enrollment/interest)\n\nI forsee a large investment in facilities, which hopefully brings some employment to the region, and maybe some economic opportunities with new businesses setting up shop in the region to take advantage of graduates, our climate etc...\n\nIts an interesting proposition and makes me wonder if folks in the early years felt the same about the womens teaching college -&gt; junuor college -&gt; college -&gt; university transition. Maybe this is the next step before PhD's are offered?",
                            "score": 1,
                            "author": "goathill",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Humboldt definitely has a unique history, and I definitely agree that this may feel like it has at every step of Humboldt transitioning between its various stages. \n\nI'm interested to see what CSU and this self-evaluation have in store for the university. While the arts definitely attract some students, I think a polytechnic may capitalize on Humboldt's reputation among the engineering, natural resources, and sciences. Should be an interesting next six months or so to see what develops!",
                                    "score": 2,
                                    "author": "Bretters17"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "One of the things that I took away from President Jackson's letter was that this is going to be a long process and that there will be plenty of opportunities for input from different departments. So if you're worried about a program being cut, let them know! I know that NAS is seeing this as a fantastic opportunity to expand their classes and increase crossover into other majors. If it ends up happening, HSU would likely get a lot of money from CSU, so it's not yet clear if programs would need to be cut at all. I think it's exciting!",
            "score": 3,
            "author": "oldsourandsweet"
        },
        {
            "level": 0,
            "comment": "This is crucial!\n\nIt could bring about the deep institutional \n\nso desperately needed at HSU and all centered \n\nabout it's strength. The College of Natural Resources\n\nand the Native American Studies programs are truly unique and \n\ndeserve this recognition. These are the only programs I've ever seen \n\nin my academic career  that actually prepare people to engage directly \n\nand effectively with environmental justice. Please, we need all the support\n\nwe can get. I hope you all realize that HSU is collapsing internally from years of\n\nmismanagement and spreading itself far too thin masquerading as some\n\nbloated corporate university. It is a polytecnic school of natural science with\n\na world-renowned botany program and one of the only Native American studies\n\ndepartment in the country. \n\n&amp;#x200B;\n\nAlso, Cal Poly definitely has an art department. Neither document mentions cutting any departments.",
            "score": 7,
            "author": "secretlycatman",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hear you. Why would the CSU system want this.  What are their motivations? There are always reasons for this kind of thing, and money is usually a factor.  Enrollment has plummeted, students are unhappy and the staff are too (probably). \n\nHSU has been one of the best hands-on natural resource science schools out west for some, so why didnt we switch to a polytech school earlier when we had the money, a \"thriving\" economy, and a larger student body?",
                    "score": 2,
                    "author": "goathill"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm afraid of what will happen to the arts and humanities! I'm an art major and I transferred to HSU because I thought it was a really unique program. I know that SLO and Pamona both have art programs but I don't know if that means anything... Will the art programs here be watered down to more basic classes? Will the arts and humanities programs be seen as lesser (and get less funding) when these changes take place? Will the word \"polytechnic\" discourage potential art/music/humanities majors from even applying here?",
            "score": 2,
            "author": "miasakura",
            "replies": [
                {
                    "level": 1,
                    "comment": "they are already seen as lesser and get less funding. right now they're preparing to make all cahss depts drop a bunch more courses",
                    "score": 2,
                    "author": "alexandermurphee"
                },
                {
                    "level": 1,
                    "comment": "Hi, I realize this thread is from a while back. Can you tell me if the Cal-Poly designation has ended up impacting the art program there? Do you feel like the studio art program is a good one?",
                    "score": 1,
                    "author": "paperlanterns99"
                }
            ]
        }
    ]
}