{
    "id": "me822u",
    "score": 6,
    "title": "WLDF 311 Online - Worth it or Wait?",
    "author": "chiropteranessa",
    "date": 1616825368.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/me822u",
    "media_urls": [],
    "other_urls": [],
    "postText": "I started at HSU in Fall 20, and was really looking forward to some in-person classes this upcoming Fall (since the main reason I chose HSU's Wildlife program was the hands-on, field-based learning opportunities) but it looks like everything is online again. \n\nSo my question is, if anyone has taken WLDF 311 online, how was it? Is this the type of class I would be better off waiting to take in person, or should I just get it out of the way since it's a prereq for other classes? I wouldn't mind peeking at the syllabus if you've got one to share. \n\nThanks!",
    "comments": [
        {
            "level": 0,
            "comment": "I took it a year ago so the second half was online and I would say if you are able to wait, do it. Wildlife classes are awful online because we don’t get to have any of the hands-on experience we are paying for. You will miss out on A LOT if you take it online. I have missed out on countless field trips and experience with actual animals. I’m so tired of sitting around at my house lol",
            "score": 4,
            "author": "huniibunnii"
        },
        {
            "level": 0,
            "comment": "I would definitely wait if you can. There's talk of offering students this Fall a smaller 2 unit course only going over hands on techniques but I'm not sure if that's come to fruition yet. Definitely if you CAN wait until its offered in person I would. Since classes are online I would focus on more computer based skills classes like statistics, geospatial analysis, or classes without labs.",
            "score": 2,
            "author": "chuparosa",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unfortunately, most of what I have left are lab/field classes. \n\nI talked to the department head and he said a lot of 300 and 400 level wildlife classes will have optional in-person labs, and 311 is supposedly one of them.",
                    "score": 1,
                    "author": "chiropteranessa"
                }
            ]
        }
    ]
}