{
    "id": "mxz16i",
    "score": 2,
    "title": "What hospitals/urgent care centers accept medi-cal near the school?",
    "author": "autismsqueaks",
    "date": 1619318317.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/mxz16i",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have medi-cal since I have disabilities and it's the cheapest option for me, as I don't have to pay for my many medications. What places near hsu accept medi-cal? I currently go to Kaiser but I don't think there is a kaiser near the school.",
    "comments": [
        {
            "level": 0,
            "comment": "Open Door health center on 10th street in Arcata is fantastic for anything that can’t be accomplished at the school clinic. I adore the staff at our campus clinic and there are a wide range of services.\n\nEdit (insurance question answer): Open door takes our (I have medi-cal) insurance. 😊",
            "score": 7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much!",
                    "score": 3,
                    "author": "autismsqueaks"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The student Heath center on campus has lots of free or reduced services for you. Closest to campus is North Country Clinic, which takes partnership, the nearest Kaiser is hours away.",
            "score": 3,
            "author": "meadowmbell",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! I need a pulmonologist though so I'm looking for a hospital that will accept my insurance. I'm sure the health center can at least lead me in the right direction",
                    "score": 1,
                    "author": "autismsqueaks",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We’re extremely limited here with medical care, specialists are even more limited if they even exist. Not sure where you’re moving from but you may want to keep your doctor at home and schedule appts on Fridays if you can get home.",
                            "score": 5,
                            "author": "meadowmbell",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Right. I'm in san pedro. I only see my current pulmonologist every three months so it won't be a problem to travel down here every once in a while. I'll just need some sort of hospital in case of emergencies but I guess I'll just have to have an emergency fund.",
                                    "score": 2,
                                    "author": "autismsqueaks",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There’s Mad River just 3 miles or less from the campus but St Joe’s in Eureka is probably a better (more advanced?) ER/facility.",
                                            "score": 2,
                                            "author": "meadowmbell",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thanks!! I actually looked up mad river and they do have cardiopulmonary services",
                                                    "score": 2,
                                                    "author": "autismsqueaks",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "There’s also something called Redwood Urgent Care in Eureka. They don’t take medi-cal but appts are $99 cash pay, but it’s maybe not a place you’d go for pulmonary issues (I’m not totally clear what that might mean but it’s not a place to go with life threatening issues. More like you have strep throat and can’t get in to your doctor same day etc.)",
                                                            "score": 2,
                                                            "author": "meadowmbell",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Awesome thanks for the info!",
                                                                    "score": 2,
                                                                    "author": "autismsqueaks"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "They may have the services, may be hard to get in. I’d keep the doc you have where you’re from and travel. There are hospitals here, but they’re nothing at all like anything the city. Be prepared to be shocked. If anything serious happens you’ll often have to be flown out of here to another region with more services",
                                                            "score": 2,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Thank you!! I am keeping my doctor down here as we only meet every three months",
                                                                    "score": 2,
                                                                    "author": "autismsqueaks",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Oh good! As an autistic up here it’s been hell to get care here but I don’t have medi-cal, I have Medicare so less options to get into local doctors. They prioritize medi-cal patients prior to SSDI disabled people. I finally got an appointment to see a doctor in about 4 months",
                                                                            "score": 2,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Oh wow I have autism too and I've had so much trouble finding an autism therapist.",
                                                                                    "score": 1,
                                                                                    "author": "autismsqueaks",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "* [Mad River Community Hospital](https://madriverhospital.com/) in Arcata with [pulmonary rehab](https://madriverhospital.com/pulmonary-rehabilitation).\n\n* [St. Joseph Hospital](https://www.providence.org/locations/norcal/st-joseph-hospital-eureka) in Eureka with [a pulmonologist](https://www.providence.org/locations/norcal/st-joseph-hospital-eureka/pulmonology).\n\n* [Redwood Urgent Care](https://redwoodurgentcare.com/) in Eureka for less important issues that do not require a follow-up appointment.\n\nGeneral check-ups:\n\n* [HSU Student Health Center](https://wellbeing.humboldt.edu/clone-medical-pharmacy)\n\n* [North Country Clinic](https://opendoorhealth.com/locations/northcountry-clinic/) in Arcata",
            "score": 3,
            "author": "bookchaser",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!!!!",
                    "score": 1,
                    "author": "autismsqueaks"
                }
            ]
        }
    ]
}