{
    "id": "op5y7e",
    "score": 3,
    "title": "What should I do",
    "author": "GHERN18",
    "date": 1626925364.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/op5y7e",
    "media_urls": [],
    "other_urls": [],
    "postText": "Currently I'm enrolled in GE courses and considering to apply to colleges as a transfer student.\n\nBut it's my first year at Humboldt State and I also feel like enrolling more on my major classes and seeing the feel at HSU.\n\nI was wondering to any HSU student, alumni, etc on what should I do.",
    "comments": [
        {
            "level": 0,
            "comment": "What’s your reason for considering to transfer to another school?",
            "score": 3,
            "author": "Sweetguy88",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nothing against HSU but considering prestigious schools that's why I have that consideration.",
                    "score": 1,
                    "author": "GHERN18",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You could attend HSU for a semester or two to see how you like it, and if it’s not a good fit, you could transfer out. \n\nI recommend taking major classes over GE so you can get a feel of the program. If your major has a club, you can try joining to see how your peers like the program too. \n\nIf you’re a science major, I would say HSU is prestigious enough, especially with their upcoming move to a polytech. \n\nHowever, if you don’t think you’ll be happy at HSU at all, then I would attend the school you think is the best for you.",
                            "score": 5,
                            "author": "Sweetguy88"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I loved my time at Humboldt State.  If you’re the kind of person that likes it, I would definitely check out the mathematics program. Some of the best professors I ever had in my life work there",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Taking a major class or two in the first year to get a feel for the department is never a bad idea, but I wouldn't be too stressed. I didn't take any major classes at first, changed my major after the first year, and everything worked out great\n\nEdit: unless you're in engineering or some other crazy impacted major with tons of extra requirements",
            "score": 1,
            "author": "TheNerevarine73"
        }
    ]
}