{
    "id": "p5iyno",
    "score": 3,
    "title": "Candles/ Sharing Things in Dorms",
    "author": "JangBoxingteddy",
    "date": 1629129502.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/p5iyno",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello all! I've just moved in, and I thought it would be nice to have a candle in my room, but I was wondering what the policy was for candles?\n\nI also was wondering if anyone has experienced sharing things in dorms? Like a dish rack, or hand soap, dish soap, tea kettles and all that :) \nHow does that work?\n\nAgain thank you all for your time and help!",
    "comments": [
        {
            "level": 0,
            "comment": "Candles and other open flames are prohibited in the dorms. You can find more info on page 29 of the [ResLife handbook](https://housing.humboldt.edu/sites/default/files/handbook.pdf)(PDF warning).\n\nIn my time, some rooms would use one of those plug-in scents, or use something like an oil diffuser, but candles were still pretty much off limits.\n\nI lived in apartment-style housing, so the dish rack and kettle were 'owned' by someone but used by everyone, just at the end of the year the owner got to bring them to the next place. We also took turns on buying things like dish and hand soap, and other consumables. Might be a good conversation to have with those that you're living with!",
            "score": 5,
            "author": "Bretters17",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah I see! I figured that would be the case but wanted to be sure!\n\nI will probably get an oil diffuser!\n\nAnd awesome! Ill probably hold a small meeting for that for sure :) Thanks a ton man!",
                    "score": 2,
                    "author": "boxingteddy222"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Some things iD say are okay to share as long as all parties agree but do not at any point share groceries or responsibilities because it’ll bite you in the ass some people grew up sheltered and do not know how to properly take care of responsibility. When I lived there there was a point where it became an issue and they became all drama about their responsibility",
            "score": 3,
            "author": "Winter_sage_01",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh, I see I see, I'll probably hold a small meeting about all that and see what Im working with lol. Thanks so much for the advice and insight! :)",
                    "score": 2,
                    "author": "boxingteddy222"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Candles are not allowed and make sure if someone does bring them that it is kept in their room and not a communal area. \n\nI was in a 4 person set up in College Creek (4 single rooms) and someone put a candle in the bathroom. We all got charged the prohibited items fee and couldn't check out at the end of the year till we all paid. I had to convince the owner to tell Housing that it was solely her candle and not anyone else's so that only she paid and the rest of us were in the clear.\n\nI personally used a Glade plugin when I felt like common areas started to smell a little stale.",
            "score": 3,
            "author": "KassandraFrye"
        }
    ]
}