{
    "id": "phdysn",
    "score": 5,
    "title": "Housing",
    "author": "PlantTea644",
    "date": 1630703470.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/phdysn",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I’m trying to move up soon and I don’t know what to do about housing, I don’t want to live in the dorms just because I have a cat and roommates last year was not fun for anyone. Does anyone have any advice on where to look or what to do?",
    "comments": [
        {
            "level": 0,
            "comment": "Make an appointment with the [Off Campus Housing Coordinator](https://housing.humboldt.edu/resident-resources/off-campus).",
            "score": 9,
            "author": "bookchaser"
        },
        {
            "level": 0,
            "comment": "I’d do as the other poster suggest and contact the off campus housing liaison. I’m not sure what’s around. My friend is moving up and she had to get on a waiting list for an apartment and is in a hotel until the middle of the month until she can move in. She was looking for 6 months to find something. There’s very little housing here atm. Humboldt Craigslist has only 10 rentals that accept cats, most of them completely unaffordable. The cheapest on there is 1600/mo and it’s about 35-40 minutes south of the school. The housing crisis here is worse than its ever been. People remote working moved here over the last 2 years and in addition we’ve taken in a lot of people displaced by the wildfires around us. Good luck",
            "score": 1,
            "author": "urkillinmebuster"
        },
        {
            "level": 0,
            "comment": "it’s on campus but creek view apartment has a lot of cat owners",
            "score": 1,
            "author": "DeerSpecialist"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "warm wishes to you as well. having pets definetely makes it more difficult",
                    "score": 1,
                    "author": "PlantTea644"
                }
            ]
        },
        {
            "level": 0,
            "comment": "While apartment hunting myself I realized that a lot of property management places around here really don't want to house students! I did have luck with strombeck properties bc they do first come first serve unlike so many other places which will take like 30+ applications and pick the one with the highest income (which usually isnt the students) also craigslist could work bc usually it's one person renting something out and not a company but be careful as always bc ya know, stranger danger.",
            "score": 1,
            "author": "Federal_Flan9222"
        }
    ]
}