{
    "id": "qp7rm1",
    "score": 4,
    "title": "food question",
    "author": "plantmommyy",
    "date": 1636353042.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/qp7rm1",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone! Hope this post reaches everyone well. For anyone who knows, what are the kitchen situations like for the dorms- specifically freshman (Cypress, Canyon, Hill) housing? Is it difficult to access the kitchen when its one per unit (like in Canyon) versus one per suite (like in Cypress)? For either one, are they more for snacking or do students have sufficient access to make a lot of their meals if they're trying not to depend on the meal plan too heavily? \n\nAlso how is The J food? Recently went to the campus and peaked in one time at dinner and didn't see a lot of options for me as I lean towards a vegan diet and a completely vegetarian diet. \n\nThanks everyone, I reallyyy appreciate it:) btw wow- the campus and surrounding areas are soo beautiful!!",
    "comments": [
        {
            "level": 0,
            "comment": "There are a lot of vegetarian options at the J but don't expect them to be insanely good.",
            "score": 6,
            "author": "hairyhomosapien",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fully agree as someone who works at the J, there’s a lot of vegetarian options and vegan stuff too (Beyond Burgers at the grill and salads are almost always available, if you don’t like what’s at the lines) but it’s still cafeteria food. It’s not going to blow your socks off. It’s better then last semester, and if you plan to actually use the buffet option and live in one of the dorms near the cafeteria (don’t bother if you live in college creek, you’ll never walk over there) getting one of the smaller meal plans might be worth it.",
                    "score": 9,
                    "author": "NiktoriaNo"
                },
                {
                    "level": 1,
                    "comment": "They are not insanely good they are just bad lol",
                    "score": 2,
                    "author": "tossawayy87"
                },
                {
                    "level": 1,
                    "comment": "yeah that seems to be the idea but good thing there are options, thanks everyone!",
                    "score": 2,
                    "author": "plantmommyy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The kitchen in [Cypress](https://housing.humboldt.edu/options/cypress) is easily accessible because it's on your floor within your housing unit, only being used by 7 to 12 students. Cypress is closer to apartment living. In my one year there, the kitchen didn't get much use because Cypress (and the Canyon) are really close to the cafeteria and everyone has to have a meal plan, so...\n\nDon't live in the [Canyon](https://housing.humboldt.edu/options/canyon) if you want to regularly cook food. You'll be going up and down stairs to use the single stove/oven shared by about 50 students. In my three years there, I think I saw the kitchen used one time. That is to say, it's just not practical to use the kitchen on a daily basis, so nobody bothered.\n\nIt's a shame if there aren't a lot of vegetarian options.  Back when the campus eateries were managed by a campus nonprofit, this was not the case.",
            "score": 5,
            "author": "bookchaser",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks for the response :)",
                    "score": 2,
                    "author": "plantmommyy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When I was a freshman I lived in Canyon in the Cedar Building. It was 3 floors, about 20 people/floor and on the bottom floor there was one kitchen. Surprisingly, most people didn't really cook all that much, so I got to use the kitchen a lot. Each dorm room had a mini fridge --I lived in a suite with 3 other people and we had 1 mini fridge and 1 microwave. There was also a big fridge downstairs in the kitchen.\n\nBack when I went, I ate J everyday. It is pretty good, but since a lot of it is a processed in a similar way, you can get that J feeling after a while. Sometimes, it can make you a bit... blocked... (if you eat a lotta pasta dishes n stuff which they had a lot of). I am not a vegetarian, but I tried to be a pescatarian for a while. There are a good amount of options but most of them from the hot bar can be a little pasta-y after a while.",
            "score": 3,
            "author": "Beanstainboxershorts",
            "replies": [
                {
                    "level": 1,
                    "comment": "makes sense, thanks for the insight 👍🏼",
                    "score": 3,
                    "author": "plantmommyy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah feel free to ask me whatever bout it, I will tell u what I remember, it was a while ago haha.",
                            "score": 3,
                            "author": "Beanstainboxershorts"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "People didn’t use the fridge or freezer when I lived in the canyon because well, it was mostly a bunch of 18 year olds who would eat your food or do gross stuff to it. Plus, (when I was there years ago) there’s no kitchen stuff provided so you’d have to trust your pans and such to be kept in that common room or figure out how to store it in your tiny bedroom.\nEdit- we all had mini fridges we shared with our roommates to store a few things like leftovers or snacks.",
            "score": 2,
            "author": "meadowmbell"
        },
        {
            "level": 0,
            "comment": "With a meal plan, you’ll get meal exchanges that can be used at the other food places on campus that have more vegan options.",
            "score": 2,
            "author": "Sweetguy88"
        }
    ]
}