{
    "id": "rupw56",
    "score": 7,
    "title": "New dining plans",
    "author": "gamjacat",
    "date": 1641175127.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/rupw56",
    "media_urls": [],
    "other_urls": [],
    "postText": "I haven’t been on campus since before covid and I’m having a hard time seeing which plan would be best for me. Does anyone have experience with a certain plan while living off campus? I would appreciate hearing which one worked best for you , thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "It depends on your needs and your schedule. I feel like I got a bigger bang for the buck at the J and at the J grill\n\nThe depot options are pricey and IMO meh.\n\nTake advantage of Ozzies to double up on meals. Ex: get lunch at the J/J grill then order an Ozzie with food for dinner to go.",
            "score": 2,
            "author": "RTMalthus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fair warning, as someone who works at the J, we are not supposed to give people Ozzis *and* let them eat in. Most don’t care, but management may step in if they notice and some employees may as well.",
                    "score": 7,
                    "author": "NiktoriaNo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks for the heads up.  I usually get the Ozzy after eating and usually do that when my schedule prevents me from dining during normal hours.",
                            "score": 2,
                            "author": "RTMalthus"
                        },
                        {
                            "level": 2,
                            "comment": "Is this rule the same for those with the all access meal plans?",
                            "score": 2,
                            "author": "Sweetguy88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It applies to everyone, but you can swipe again if they ask. Most people won’t say anything, but management and some student employees might.",
                                    "score": 1,
                                    "author": "NiktoriaNo"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I reached out to the powers that be at HSU and while they said doubling up is discouraged and the person should swipe for the additional meal,  they don't want people going hungry and have not been enforcing people double dipping. \n\nNot enforcing seems to be a new thing due to Covid. \n\nI'm happy to know I can simply swipe again and take something to go.",
                            "score": 1,
                            "author": "RTMalthus"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In my time, The J was the only inexpensive dining venue. The Depot was a pseudo-restaurant... sort of Subway, sort of a coffee shop, sort of a hospital cafeteria.\n\nIf a person is not eating at The J, I'd do the math and see if a meal plan offers anything other than convenience in having a parent paying in advance for their student's food.",
                    "score": 1,
                    "author": "bookchaser"
                }
            ]
        }
    ]
}