{
    "id": "sajr1h",
    "score": 4,
    "title": "What would you say the biggest quality of change has been over the past 100 years at HSU?",
    "author": "dinonutts",
    "date": 1642907711.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/sajr1h",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "The biggest change was President McCrone's tenure of 27 years.\n\nUnder President Siemens in the late 1960s and early 1970s, enrollment was booming, hitting 5,000 students for the first time.  By 1973, enrollment was 7,000. The state expected Humboldt to reach 10,000 students by 1980 and 12,000 by 1990.\n\nMany buildings went up during this time -- child development lab, Forbes Complex, the marine lab, the 'new' University Center, art and music expansions, natural resources, expansion of Founder's Hall, and I think even building Cypress Hall.\n\nBut then, President Siemens retired in 1973 and McCrone came on board in 1974. The new president decided to shift HSU's heavy focus on the sciences to restructure HSU into a small liberal arts college. Enrollment began a significant decline.\n\nAs the years went on, degree programs didn't keep pace with the times, in terms of producing employable graduates. HSU expanded its art program, but axed its nursing program during a state and national nursing shortage. HSU also axed its industrial technology department which produced the highest percentage of graduates who went on to secure jobs within their degree field, and were the most lucrative alumni in terms of donations back to the university. The thought process for how to shape the university didn't seem especially coherent. \n\nMcCrone's tenure came to an inhospitable close amid a University Advancement financial scandal involving its director embezzling money and later pleading guilty to 9 felonies. Hurrah!\n\nHSU becoming a polytechnic certainly has the potential to be the biggest quality change for HSU while moving into the new century.",
            "score": 38,
            "author": "bookchaser",
            "replies": [
                {
                    "level": 1,
                    "comment": "I started at HSU on 2008, right before they shut down the nursing program. We were coming out of the GFC, and there was a lot of talk about money being tight at the university, and how expensive the nursing program was.\n\nThen a few years later they started to axe and merge a bunch of other programs and we realized that university leadership was just a shitshow.",
                    "score": 5,
                    "author": "Eode11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The nursing program was enlarged, I think they doubled enrollment, just a few years before it was closed. There were some who thought that when the dean was asked to cut X dollars from his budget he saw that nursing was that amount, so he made that one cut. In some past lean years, departments were asked to collectively tighten their budgets so that no program was cut.\n\nI digress though. Nursing may have been cut by the next president after McCrone. But industrial technology was closed on his watch. The reason suspected there was that many of its professors were nearing retirement. Never mind that replacing retiring long-time tenured faculty would save the university money.",
                            "score": 4,
                            "author": "bookchaser"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Woah",
                    "score": 4,
                    "author": "daniil_oxyuk"
                },
                {
                    "level": 1,
                    "comment": "And we renamed Science D after this guy... None of my professors call the building by it's official name since they think it's ridiculous to honor him. Wonder if it was some major donor who is friends with McCrone that initiated the name change.",
                    "score": 3,
                    "author": "KappaWolfe"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The sell Yerba mate now",
            "score": 15,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "For anyone interested, [here’s](https://specialcollections.humboldt.edu/humboldt-state-chronology) a timeline of HSU’s history",
            "score": 5,
            "author": "Sweetguy88",
            "replies": [
                {
                    "level": 1,
                    "comment": "Had no idea HSU started as a teaching college!",
                    "score": 2,
                    "author": "Riptide360"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh I think that’s too long of a time frame to pick one big change. Besides the name changing 3 (?) times, Ha.",
            "score": 4,
            "author": "meadowmbell"
        },
        {
            "level": 0,
            "comment": "I’m sure a lot has changed over the past 100 years… quite a bit changes every decade.",
            "score": 4,
            "author": "marymoon77"
        },
        {
            "level": 0,
            "comment": "Not knowing how to retain their students of color or focusing on the problems the school has by becoming a polytech school for more money.",
            "score": 1,
            "author": "indaze2day",
            "replies": [
                {
                    "level": 1,
                    "comment": "Valid points.",
                    "score": 1,
                    "author": "marymoon77"
                }
            ]
        }
    ]
}