{
    "id": "smwmtr",
    "score": 1,
    "title": "Housing and Dorm Culture",
    "author": "RatFuckingBastard",
    "date": 1644257282.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/smwmtr",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm going to be living on campus starting the fall 2022 semester and I'm interested in learning more about the finer points of each Dorm (the things only learned through experience that the campus website won't tell you.\n\nFrom my research I found that every dorm (I'm a freshman so I'm referring to cypress, canyon, and hill) has the same general complaints; broken thermostat, too many stairs, loud neighbors.\n\nBut in terms of day to day living they don't seem very different because they have similar rooms and common areas. \n\nThe website isn't very helpful because it basically just describes room size and the bathrooms so if you could please help with any additional information regarding what day to day quality of life is like it would be greatly appreciated! 🙏",
    "comments": [
        {
            "level": 0,
            "comment": "LOL, people who move to Humboldt and complain about stairs or fog.",
            "score": 15,
            "author": "Bodie_The_Dog"
        },
        {
            "level": 0,
            "comment": "I lived in both the Canyon and Hill my Freshman Year. I hated living in Canyon. I had a horrible roommate and the room was less than ideal to say the least. I got the short end of the stick when it came to which side of the room I got. I got the fridge on my side which gave me way less room, my bed was raised to put my dresser underneath, meanwhile my roommate had a normal setup. The showers suck and it is all communal bathrooms so if more than three people want to shower at a time, tough luck. \n\nThe Hill I liked much more. Still communal bathrooms but there are more showers and toilets. The rooms are slightly bigger and while they look worse, the heaters work better from my experience. If you are scared of stairs, the Hill is a good choice because it is closer to campus than Canyon. It is basically closer to everything and was much better experience overall. \n\nI haven't lived in Cypress but I almost would reccomend it the most from what I have heard. It is basically you sharing common area with like 5 other people rather than sharing with 20-30. \n\nLet me know if you have any questions.",
            "score": 3,
            "author": "Cado111"
        },
        {
            "level": 0,
            "comment": "Cypress is a little closer to apartment living, but right next to the cafeteria. How often you are walking stairs depends on if you are near the bottom or the top of Cypress. The ground floor is at the same level as the Jolly Giant Commons (JGC) recreation room. The top floor is at the same level as the rest of the campus.\n\nThe Hill has a *lot* of students per floor, really long floors, and is situated on the same level as the rest of the campus. You have to walk down stairs to reach the cafeteria and mail room.\n\nThe Canyon is a middle ground between the other two residence hall groups in terms of students per hall. It has elevated walkways that go to the second floor of the JGC mail room. You then walk up a flight to the cafeteria, or several more flights to reach the main campus level.\n\nI lived in the Canyon and Cypress. The stairs are not bothersome unless you have some sort of known ankle injury or something.",
            "score": 1,
            "author": "bookchaser"
        },
        {
            "level": 0,
            "comment": "Hi! I’m in a canyon single and I really do enjoy canyon better than the hill. But I do think it depends on what you are looking for. In canyon I feel much more to myself, there’s only about 15 people on my floor which makes our bathrooms feel much better. In the hill you have about 30-40 on a floor, and also it is just so bland in there. Canyon is further from the heart of campus but it’s not so bad. If you’re looking to make lots of friends and always running into people you know I would suggest the hill, but canyon is great for me being a bit more introverted. The rooms in the hill are much larger but it’s not so bad in canyon.",
            "score": 1,
            "author": "Negative_Trip9600"
        },
        {
            "level": 0,
            "comment": "I'd bet good money the thermostats aren't broken, but instead are centrally managed. \n\nThermostats in many office workplaces are only cosmetic to give workers a sense of control. Imagine how working conditions would be if the person two cubicles over kept making the room too hot, or too cold.\n\nThat was my experience in the 1990s when the thermostats functioned in Humboldt's residence halls... near constant fighting between students who wanted to be warm and students who wanted to be cold. \n\nThe cold-loving students would remove the thermostat casing, disable the thermostat by placing a piece of cardboard between the metal elements so the heater never turned on, and put the casing back on. \n\nSmarter warmth-loving students would remove the cardboard and then super glue the casing on so the thermostat couldn't be fucked with again.",
            "score": 1,
            "author": "bookchaser"
        }
    ]
}