{
    "id": "tx6p64",
    "score": 2,
    "title": "Looking for a drummer in the Arcata-ish area.",
    "author": "LeftFieldEkko",
    "date": 1649196964.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/tx6p64",
    "media_urls": [],
    "other_urls": [
        "https://www.youtube.com/watch?v=w3e7Los2QM0&amp;ab_channel=TheMoths-Topic)"
    ],
    "postText": "I'm a student at Cal Poly Humboldt living in Arcata, and I'm looking for musicians to jam with and potentially start a band with. I have been making music for 8 years, I can play guitar, rhythm, lead, or fingerstyle (my specialty is rhythm), I can play foundational bass guitar, I can play the piano/keys, and I can sing.\n\nI am also a songwriter, I am fluent with DAWs (predominantly FL Studio) I can record, mix and master, and I have music released, here is an example, [a song of mine](https://www.youtube.com/watch?v=w3e7Los2QM0&amp;ab_channel=TheMoths-Topic) You can check me out as The Moths on all platforms, and prodleftfield on youtube.\n\nI have experience being in a band and jamming, my biggest influences are Radiohead, The Beatles, The Velvet Underground, Duster, etc. I am familiar with playing most styles of music mostly art rock, folk, punk, slowcore, classic rock, indie, funk and some jazz as well. I have a solid foundational knowledge of music theory and can communicate and understand musical concepts well.\n\nIf you're in the area and are looking to jam or start something bigger, message me.",
    "comments": [
        {
            "level": 0,
            "comment": "I’m a drummer and want to jam. But I don’t have my kit up here with me :(",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "damn that's the struggle. if you ever find a kit or some place to jam that has one hit me up",
                    "score": 1,
                    "author": "LeftFieldEkko"
                }
            ]
        }
    ]
}