{
    "id": "txo0c2",
    "score": 8,
    "title": "Submitted app on 2/21 and still nothing",
    "author": "[deleted]",
    "date": 1649256878.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/txo0c2",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm a transfer applicant. Is it normal for it to take this long?? I called them like 3 times and they just told me to wait. my gpa is a 3.74 if that means anything",
    "comments": [
        {
            "level": 0,
            "comment": "Transfer students always take longer because the school has to figure out if they can transfer units over to their school system and all that. Just be patient but you’ll get in easy with that gpa.",
            "score": 6,
            "author": "Known_Baseball9868"
        },
        {
            "level": 0,
            "comment": "I got my response like within a week, so I would definitely check.",
            "score": 6,
            "author": "PeachyHats",
            "replies": [
                {
                    "level": 1,
                    "comment": "transfer or freshman?",
                    "score": 2,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I did as well, and i applied a transfer applicant",
                    "score": 2,
                    "author": "_eleven"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Call them back and ask what their deadline is for notification. They need one because applicants typically apply to multiple schools and need to know.\n\nWhen my teen applied this year, Oregon schools notified in January and UC schools notified in March. It wasn't a transfer situation, but Humboldt took like 3 days.",
            "score": 3,
            "author": "bookchaser",
            "replies": [
                {
                    "level": 1,
                    "comment": "i asked their deadline and they just said it was rolling and didn’t help whatsoever haha",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's surprising. Humboldt wants to rapidly increase its enrollment. It's attitude about notification will have to change. Humboldt surely loses students to this attitude.",
                            "score": 2,
                            "author": "bookchaser"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do you mean February 2021 or do you mean February 21st 2022? \n\nIf it’s the first option, that’s really strange and unusual. If it’s the second option, you need to wait until the end of the month minimum, and stop calling them. They accept literally everyone with a pulse so relax if you applied a month ago. Have some patience.",
            "score": 1,
            "author": "arson_is_awesome",
            "replies": [
                {
                    "level": 1,
                    "comment": "2022, and lmao i know i need to relax but i called them again today (i know i shouldn’t have) and they told me that it’s abnormal it took that long and they’re going to contact my evaluator, so hopefully my paranoia paid off…?",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; i called them again today (i know i shouldn’t have)\n\nDefinitely keep on top of them, call every day if you need to.\n\nI was in a very similar situation where my application as a transfer seemed to be taking longer than usual (it was late April or early May and was still pending). So I called and was eventually told \"your application never got placed in the folder it should have been\" and that they effectively lost my application.\n\nA few weeks later I was rejected for some bs reason, something along the lines of \"Your transcript indicates you need more preparation for your choice of major\" I don't recall the specific wording. So I applied again the next year with the exact same transcript, and was accepted. Which left me thinking they rejected me as it was too late to process or something. This still frustrates me as I trusted they were processing it correctly and it delayed my school plans by a whole year.\n\ntldr: **do not trust the administration/staff in a situation like this**, you need to keep on top of them or it could go horribly wrong",
                            "score": 4,
                            "author": "idklolxd0",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "omfg that’s terrifying",
                                    "score": 2,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "Generally good advice dealing with any college administration!",
                                    "score": 2,
                                    "author": "AmbitionQuick6641"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Lol okay well good luck with everything. I doubt you’ll need it, because like I said, they accept everyone with a pulse. It’s only been a few weeks tho, which is why they haven’t gotten back to you yet. But I also get the anxiety of not knowing where you’re gonna go.",
                            "score": 3,
                            "author": "arson_is_awesome",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "yeah it’s rlly scary bc im an oos applicant trying to go back to CA and UC admissions are coming out in the next few days (those are impossible to get into) and if humboldt (with a much higher rate than any UC) denies me i’m totally screwed lmao",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s very understandable. Of course that’s stressful. Take a second to just breathe in and out friendo. You’ll be fine. Good luck with all of your admissions, I hope you get into the schools you really want to go to. 3.74 is a fantastic gpa.",
                                            "score": 3,
                                            "author": "arson_is_awesome",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "thank you so much :)) i really appreciate it, and i hope that’s the case &lt;3",
                                                    "score": 2,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}