{
    "id": "u43umu",
    "score": 3,
    "title": "Themed Housing?",
    "author": "lethargiclilo",
    "date": 1650013271.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/u43umu",
    "media_urls": [],
    "other_urls": [],
    "postText": "Does anyone know how the themed housing works at Humboldt? I know certain ones are major-based, and that others are more interest-based (gamers and anime lovers for Indoor Adventure, for example). I applied for and got into both Indoor Adventure and Outdoor Adventure and Recreation. However, I’m worried about how strenuous some of the activities are (like… my ankles suck and I’m constantly spraining them and I don’t want to take someone out if the OAR decides that the community is going rock climbing and I can’t opt-out). Does anyone have any knowledge on Indoor Adventure or Outdoor Adventure and Recreation?\n\nAlso, side question, but does Madrone (in Canyon) have a specific theme housing? I’ve been checking my portal but there aren’t any housing themes associated with it.",
    "comments": [
        {
            "level": 0,
            "comment": "You’re an adult, no one is going to force you to do anything you don’t want to do.",
            "score": 7,
            "author": "arson_is_awesome",
            "replies": [
                {
                    "level": 1,
                    "comment": "... unless that's what you're into.",
                    "score": 0,
                    "author": "SoCalLongboard"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's completely up to you as far as what community you want to live in. You definitely don't have to participate in any activities you don't want to. There is an extra fee to live in Outdoor Adventure ($100) that goes toward the trips though, so that's something to consider. The Theme Housing, just helps bring residents together with similar interests, but in any of the communities it's up the resident how much they want to be involved. Madrone currently does not have any theme communities. Please email [housing@humboldt.edu](mailto:housing@humboldt.edu) if you have further questions.",
            "score": 3,
            "author": "HumboldtHousing"
        },
        {
            "level": 0,
            "comment": "&gt; OAR decides that the community is going rock climbing and I can’t opt-out\n\nThere are no mandated activities.",
            "score": 2,
            "author": "bookchaser"
        }
    ]
}