{
    "id": "u4e1xo",
    "score": 4,
    "title": "Trans and rejected from Rainbow Housing Community - where do I live?",
    "author": "Sea_Bobcat_5913",
    "date": 1650046115.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/u4e1xo",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am Trans and was rejected from the Rainbow Housing Community.  I'm being told to choose between Canyon and Hill, but neither have gender neutral bathrooms.  I don't want to live somewhere I don't feel safe.  Should I live off campus?  Are there any resources for finding trans affirming people to live with?  Nice that Humboldt has a gender diversity dashboard and a trans taskforce - not so nice that they wont provide trans freshmen a safe place to live - I got my housing application in within minutes of it opening.  I'm starting to think I made a mistake choosing Humboldt.  They were rated high on the Campus Pride Index, but LGBTQ friendly doesn't apparently translate to Trans friendly.",
    "comments": [
        {
            "level": 0,
            "comment": "I'm sorry to hear that you didn't get into Rainbow. It is very full this year, and there is a waitlist. Don't give up hope though, we do continue to get cancellations, so there's a chance you may be able to be assigned to live there later if you were just waitlisted. If you were actually denied, it maybe be because of your responses to the questionnaire. If that's the case, you could redo your responses and send them to [housing@humboldt.edu](mailto:housing@humboldt.edu) so they can be reviewed. Once you have a room assignment if it's not in Rainbow, submit the Room Change Request Form, to make sure that your request to live in Rainbow is still active. You can find the form in your [myHousing portal](https://myhousing.humboldt.edu) under Forms. Not all LGBTQ students living on-campus, including Trans students live in the Rainbow community. It's still possible for you to live elsewhere on-campus and have a good experience and a safe environment. You can use the Roommate Finder in the [myHousing portal](https://myhousing.humboldt.edu), review profiles and see if you connect with anyone by messaging them. If you have further questions, please email [housing@humboldt.edu](mailto:housing@humboldt.edu)",
            "score": 16,
            "author": "HumboldtHousing"
        },
        {
            "level": 0,
            "comment": "&gt;not so nice that they wont provide trans freshmen a safe place to live\n\nThe housing set aside form LGBTQ+ students being full indicates the opposite is true, that Humboldt does provide trans first year students with safe places to live. It's just that there are more such students than Humboldt anticipated needing the housing.\n\nIf you don't feel safe in regular housing, and the Rainbow Housing is definitely full, then you will need to find an off-campus rental. That said, if you live on campus and are treated poorly by students in the residence halls, file a complaint each and every time. Something will be done.\n\nIn my era, a couple decades before society came around to accepting LGBTQ+ folks, the university would relocate LGBTQ+ students who were uncomfortable with their assigned rooms. Today, I would expect disciplinary action to be taken against the offending students, and if that's not the case, I'd go straight to the [Ombuds Office](https://president.humboldt.edu/ombuds) and file a complaint there.  An 'ombudsman' is a neutral third party that addresses disputes. \n\nI used the office once and my complaint was resolved in my favor. I had made flyers criticizing the university, had them approved for posting, and posted them. Two weeks later I had a new round of critical flyers and this time I was refused approval out-of-hand. The Ombudsman spoke to unspecified administrators and then I was allowed my free speech. \n\nMy complaint led to a change in flyer policy (limiting the number of flyers that can be posted around campus), but I was still allowed to post my flyers under the new number limit.",
            "score": 12,
            "author": "bookchaser"
        },
        {
            "level": 0,
            "comment": "The Hill has a gender neutral bathroom on the first floor, but it has no shower unfortunately.",
            "score": 5,
            "author": "dontcallmekramer",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks, at least I'd be able to pee!  Not sure my roommate will enjoy me not taking showers tho",
                    "score": 1,
                    "author": "Sea_Bobcat_5913",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So I checked on the website description for the Hill and it turns out it does have a shower stall. Was only in there once a few years ago, so didn’t remember too well. Still not an ideal situation, but hope that helps.",
                            "score": 5,
                            "author": "dontcallmekramer",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thanks, that is very helpful.  Interesting that the gender neutral bathroom is not on either of the gender inclusive floors, but I guess I'm lucky I wouldn't have to leave the building to go to the bathroom :-)",
                                    "score": 2,
                                    "author": "Sea_Bobcat_5913"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hmm was it full? I wonder if you called  the housing coordinator if that would change things.",
            "score": 2,
            "author": "meadowmbell",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is full but I thought freshmen had priority for housing?  I called the coordinator.  They are trying to find something but don't seem hopeful.",
                    "score": 3,
                    "author": "Sea_Bobcat_5913",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’d make contact also with Counseling and Psych services, I had a dorm situation many years ago (threat of violence from a roommate) when I was a student and housing told me they had zero beds available to put me in, I met with a family friend who was in the Counseling and Psych services area and all of a sudden there was a single room available for me to move in to ASAP. \n\nhttps://counseling.humboldt.edu/resources-demand",
                            "score": 1,
                            "author": "meadowmbell"
                        },
                        {
                            "level": 2,
                            "comment": "Some residence halls are set aside separately for first year and returning students.",
                            "score": 1,
                            "author": "bookchaser"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The housing coordinator is actually for Off-campus housing.",
                    "score": 1,
                    "author": "humboldtStatehoney",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Might not be the right title, I guess it would be director of housing or whomever makes decisions around there.",
                            "score": 1,
                            "author": "meadowmbell"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fear of being subjected to bigotry or being treated like they were treated in high school. And even if not, it's a decent bet many non-trans students don't know a trans student well and it can be uncomfortable being the person who has to educate everyone else.\n\nPeople in marginalized groups can get tired (I'm being polite here) of having to educate the rest of the world. It's not their job.  OP may just want to live and learn and have fun in college without dealing with people who are have had little exposure to trans individuals (at best, being subject to microaggressions), or worse, facing unabashed bigotry.",
                    "score": 4,
                    "author": "bookchaser",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Umm, at this point I should explain that you've encountered many trans people in your life and not been aware of it.\n\nFor all types of people, there is a monumental difference from being in a cafeteria a few tables away from someone, or being in a classroom a few rows away from someone... and being with that someone in your living space every day for 10 months. You will get to know that person much better than some random stranger who happens to occupy a public space with you for a short time. It's really important that a fellow student in your living space not be an asshole.",
                                    "score": 7,
                                    "author": "bookchaser"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hill has gender neutral restrooms but gendered showers",
            "score": 1,
            "author": "caradepescado"
        }
    ]
}