{
    "id": "u8bp4r",
    "score": 3,
    "title": "housing",
    "author": "Such_Account_8537",
    "date": 1650503878.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/u8bp4r",
    "media_urls": [],
    "other_urls": [],
    "postText": "How likely is it to get housing? I’m an incoming freshman and I applied a few days ago. I’m joining the klamath connection if that holds any relevancy",
    "comments": [
        {
            "level": 0,
            "comment": "Application opened in February buddy. People been already selecting rooms for the past two weeks. You’ll be automatically placed on their waitlist",
            "score": 3,
            "author": "Ok-Bee1366",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just adding on to this, contact housing about this situation. Give them a call tomorrow.",
                    "score": 5,
                    "author": "arson_is_awesome",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "thanks, i would have applied much sooner had I known i would be going here- genuinely thought there was no chance I would end up going to hsu",
                            "score": 2,
                            "author": "Such_Account_8537"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The housing department is super nice and supportive and can explain everything. Yesterday my son chose his room and there were lots of beds still available at the end of the day. \n\nYou will LOVE Humboldt. It’s so beautiful and living there is like living at camp, right near the redwoods with a view of the ocean. Congratulations!",
            "score": 1,
            "author": "Playful_Butterfly290"
        },
        {
            "level": 0,
            "comment": "You may be waitlisted at first. But we do anticipate most Freshmen will be assigned by summer as we receive cancellations. You will receive a notification at the end May about room assignment or waitlist number.",
            "score": 1,
            "author": "HumboldtHousing"
        }
    ]
}