{
    "id": "ujt060",
    "score": 5,
    "title": "Does anyone know how long realistically a late stay request would be approved for?",
    "author": "daniil_oxyuk",
    "date": 1651859145.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/ujt060",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m a junior so not graduating this semester, but my room that I’m moving into at a friend’s house isn’t going to be available for another week after finals week. This means that I would have to stay at his couch for a bit.\nI want to follow a late stay request: I know they usually only approve it for 24 hours and for seniors, but could they potentially approve for a junior? Does anyone have experience filing a late stay request?\nThanks y’all",
    "comments": [
        {
            "level": 0,
            "comment": "I filed one when I was graduating. \n\nGot approved for the day of graduation. Attend the ceremony in the morning, went to a celebration lunch, and then came back to get my boxes out by 5.  \n\nI don't think they'll give you a few days unfortunately but a week on the couch isn't so bad. It's worth a shot to ask but back when I was a student they were pretty firm on getting people out.",
            "score": 7,
            "author": "KassandraFrye",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I asked for 24 hours like they give to seniors. If they don’t approve it I can volunteer at green grad through a campus organization I work for and then they’d likely be more willing to approve",
                    "score": 3,
                    "author": "daniil_oxyuk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, anything you can do to give your request extra strength is worth going for.",
                            "score": 2,
                            "author": "KassandraFrye"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Go for the couch stay",
            "score": 1,
            "author": "humboldtStatehoney"
        },
        {
            "level": 0,
            "comment": "Call the housing office on Monday. Or walk there and ask someone in person. Even if someone told you an answer here, you would still need to get an official answer.",
            "score": 1,
            "author": "bookchaser"
        }
    ]
}