{
    "id": "vmb905",
    "score": 7,
    "title": "Dorm housing",
    "author": "KeyOk9208",
    "date": 1656380508.0,
    "url": "https://www.reddit.com/r/humboldtstate/comments/vmb905",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I was going to live off campus with a roommate but that became totally unreliable so I called the housing department and asked if I could still apply, they said I could but will be waitlisted. I’m a incoming freshman in eop and also foster youth. Is there a chance I will get into a dorm? Or should I start looking for another solution. If not I have no idea what to do. I live 14 hours away in San Diego.",
    "comments": [
        {
            "level": 0,
            "comment": "Start looking for off-campus housing. It is very late to be joining the wait list.\n\nThe [off-campus housing coordinator](https://housing.humboldt.edu/resident-resources/off-campus) is having a streamed 'open house' on July 22 and 29th.  I would make an appointment and speak to her sooner though.",
            "score": 6,
            "author": "bookchaser"
        },
        {
            "level": 0,
            "comment": "eop will not change your housing situation, as someone who applied for housing as soon as it opened and still got put in a triple in the halls that were the last ones left, i hope you find something outside of campus",
            "score": 6,
            "author": "No-Independent-4472"
        },
        {
            "level": 0,
            "comment": "I’m currently a junior transfer, also looking for off-campus housing. Maybe as two random redditors we could look for something",
            "score": 3,
            "author": "Ase112"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you !",
                    "score": 1,
                    "author": "KeyOk9208"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So make note of what # waitlist you are now and start looking for roommates. After July 15th, come in contact with housing to see how far up on the waitlist you are (there’s no live system to check, just call or email housing). July 15th is the deadline for people who already have campus housing to cancel it with no penalties, so a bunch of people will drop.",
            "score": 2,
            "author": "daniil_oxyuk"
        },
        {
            "level": 0,
            "comment": "What number are you on the waiting list ?",
            "score": 1,
            "author": "meadowmbell",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just applied today so I have no information yet I’m going to call tomorrow 😬",
                    "score": 3,
                    "author": "KeyOk9208",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i’ve seen people placed 200 on the waitlist and got it. but don’t bank on it, i’d say it’s much better to live off campus anyway. living in the dorms wasn’t that great.",
                            "score": 6,
                            "author": "RunUpTheSoundWaves"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah eop and foster stuff doesn’t effect housing, although since you are a freshman I’d say you have a decent chance of getting a room so long as you are under 50 on the waitlist, but looking around for a backup place is a very good idea since you were added to the list so late",
            "score": 1,
            "author": "hypocritcialidiot"
        }
    ]
}