{
    "id": "12jj64o",
    "score": 2,
    "title": "Waitlisted for a senior project course (CECS 471A)",
    "author": "Bropharah",
    "date": 1681299130.0,
    "url": "https://www.reddit.com/r/CSULB/comments/12jj64o",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello!\n\nI’m a 3rd year computer science student and my situation is that I was not able to enroll to my senior project course due to a missing pre requisite class because I wasn’t able to enroll due to a lack of spaces (my registration appointment was late). \n\nI plan to take the exact same class  through the open university program during the summer which will fulfill me the credit for the prerequisite class. The problem arises is that I’m only able to start enrolling for any of the senior project sections after I get a passing grade from the prerequisite class, and won’t allow me to start enrolling around the summer, which will most likely be fully occupied for all sections of the spots. \n\nI was wondering if the professor CAN make accommodations to enroll me if I was wait-listed for the class since I literally need the class to GRADUATE. If I can’t take it during Fall,  I can’t take the part 2 of the senior project class during Spring (only available at Spring) which would basically hold my graduation date by a year, and force me tuition fee costs for 2 semesters for taking 1 class out of the one semester.\n\nI’ve been stressed about the situation and my counselor has been incredibly hopeless and just flat out said there’s no exceptions to be enrolled if I was waitlisted if that status stays that way. I would have thought the course would have more sections because we literally need this to GRADUATE. I hope you guys can help me out.",
    "comments": [
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm taking ENGR 350 (class prerequisite) during the summer not 491A. But the problem is I will only be allowed to enroll to 491A after I get a passing grade for ENGR 350 which I will complete during the summer. The problem is that even if I complete it, I will most likely be waitlisted for CECS 491A because I'm applying so late.  There's only one section remaining for the senior project class which is why I'm asking the question in the first place\n\n And yes I plan to talk to the undergrad advisor!",
                    "score": 1,
                    "author": "Bropharah"
                }
            ]
        },
        {
            "level": 0,
            "comment": "hello!\n\nunfortunately I am in a similar situation as you.\n\nI would love to chat and ask you questions",
            "score": 1,
            "author": "Astrofyy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Check dm",
                    "score": 1,
                    "author": "Bropharah"
                }
            ]
        }
    ]
}