{
    "id": "12kcl88",
    "score": 2,
    "title": "Does anyone still not hear transfer decisions?",
    "author": "Potential_Jacket680",
    "date": 1681361957.0,
    "url": "https://www.reddit.com/r/CSULB/comments/12kcl88",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, it’s almost mid April and I haven’t heard anything from school yet. Not thing, I event don’t know if I was in wait list or not. I sent email to Design Department and they haven’t responded. Should I keep waiting for them?",
    "comments": [
        {
            "level": 0,
            "comment": "If you're able to log into the CSULB student center, you should be able to view their decision there. I was able to see my admission acceptance/rejection decision before I got their email.",
            "score": 2,
            "author": "KuyaBro02",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi, how to log into CSULB student center? I haven’t had an account yet",
                    "score": 1,
                    "author": "Potential_Jacket680",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I meant applicant self service, sorry, not CSULB student center (For accepted students only). Go to [https://www.csulb.edu/admissions/applicant-self-service](https://www.csulb.edu/admissions/applicant-self-service) to check your admission status. You'll need your CSULB Campus ID so you should've gotten an email from CSULB long ago with your Campus ID attached to it.",
                            "score": 1,
                            "author": "KuyaBro02",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah, I check every day, but nothing new 🥲",
                                    "score": 2,
                                    "author": "Potential_Jacket680",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Weird, all applicants should’ve gotten the email, you can’t move on in the admissions process without the Campus ID. Maybe check your trash or Spam folders. Hopefully you didn’t misspell your email or it got lost somewhere",
                                            "score": 1,
                                            "author": "KuyaBro02"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Mine too. I think we should call the admission next week",
                                            "score": 1,
                                            "author": "No_Doughnut_8003",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I sent email to both admission dept and my major dept, no answer yet. Are you also in design dept?",
                                                    "score": 1,
                                                    "author": "Potential_Jacket680",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "No im in math dept",
                                                            "score": 1,
                                                            "author": "No_Doughnut_8003"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "But it's almost 2 months for me since the time i sent them the transcript",
                                                            "score": 1,
                                                            "author": "No_Doughnut_8003",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Ah, I see, so stuck. Have you ever email math department? I sent email to design department but they didn’t reply.",
                                                                    "score": 1,
                                                                    "author": "Potential_Jacket680",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Me too. They didnt reply my email so im gonna call them directly. Tbh, i called them before and they seem not willing to answer. They said it is ready to review so just be patient. How the heck we can be patient when it is almost mid april?",
                                                                            "score": 2,
                                                                            "author": "No_Doughnut_8003",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Oh my, seem like no hope. I think I’ll put LB down and jump to my second choose school. So sad 😭",
                                                                                    "score": 1,
                                                                                    "author": "Potential_Jacket680",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}