{
    "id": "12l6x4s",
    "score": 43,
    "title": "I think the autosend went out a month early? Trying to score some brownie points after the graduation press?",
    "author": "3_14159td",
    "date": 1681422577.0,
    "url": "https://www.reddit.com/r/CSULB/comments/12l6x4s",
    "media_urls": [
        "https://i.redd.it/jdg9yfjv2qta1.png"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "2 months before a holiday schedule change that affects almost nobody over the main break?\n\nNothing against Juneteenth, but this is batant pandering.",
            "score": 66,
            "author": "3_14159td"
        },
        {
            "level": 0,
            "comment": "I’m glad I’m not the only one who was a bit iffy about the email",
            "score": 20,
            "author": "Jaylusional"
        },
        {
            "level": 0,
            "comment": "I’m having trouble understanding your post. What do you mean by “a month early”? Is it a rule that something like this should be announced a month beforehand and not sooner? Also, there are summer classes and employees working on campus in June, so I’m confused why you think this “affects almost nobody.”\n\nI get being critical of the university president, but scrutinizing every single piece of communication she sends is bizarre.",
            "score": 17,
            "author": "Durendal_et_Joyeuse",
            "replies": [
                {
                    "level": 1,
                    "comment": "You are correct, there are *some* people that affects. Compared to the campus population during the spring semester, who this was emailed to, that is \"almost nobody\". \n\nThe academic calendar changes almost yearly in terms of which holidays are and aren't observed, and those have not been accompanied by a similar email.\n\nIn terms of timeline, there's ~a month in the semester, and sending the same email then would still be a month out from the date in question. It's not topical; there is arguably a rule.",
                    "score": 9,
                    "author": "3_14159td",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There’s a lot to unpack here. This holiday is being singled out because it celebrates a population that has historically been marginalized. The university administration is highlighting it in order to affirm their support for that group. Just because it doesn’t meet your standard for how many people it should apply to doesn’t negate it’s significance. This is literally what an “affirmative action” is; it is *affirming* support for a group that was not historically supported. It is *not negating* support for other groups. Sending this email *only* to people who would be affected by the campus closure in June is logistically complicated and also just pointless.\n\nAlso, just because an action is self-serving doesn’t mean it isn’t still valuable. Literally anything any human does can be interpreted as self-serving. And of course as an administrator, she knows this gesture helps her public image. But it can be two things at the same time: self-serving *and* valuable to the people it benefits. Just because it benefits the president’s public image doesn’t mean it doesn’t also benefit the Black students who are being affirmed.",
                            "score": -1,
                            "author": "Durendal_et_Joyeuse",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What really got me is \"why now?\" All of those benefits except diverting from the current, messy graduation press would still be realized later in the semester.",
                                    "score": 4,
                                    "author": "3_14159td",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It was probably sent out now because while the state made it a holiday, the CSUs were not included due to the collective bargaining agreements to make it a paid holiday. Same with city councils who have recently worked on it to make it a paid holiday for their staff. San Diego just announced making it a paid holiday for their staff a couple weeks ago. They probably just announced it so those who are involved with summer school are aware of it (students, faculty, staff) and to make adjustments now rather than hold on to the information until May.",
                                            "score": 2,
                                            "author": "Smackcracklenpop"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I don’t know exactly why now (as in why the email was sent this specific day; the holiday in general is a government holiday now). This seems to be a CSU-system-wide effort. There is certainly a reason that does not have to do with the graduation ceremony. Let me just try to convince you of one thing: the administrators could not care less about the students’ reactions to the graduation ceremony. It is important to you personally, but don’t let that misguide you to think that it’s a huge deal in general. I first enrolled at CSULB 13 years ago, left 5 years ago, and have been involved deeply in university affairs around the country since then. The administrators know you all will graduate, the next group will come next year, and over time people will stop caring. This kind of “controversy” does not even leave the tiniest scratch on them. It’s insanely annoying. I know. But this isn’t the basis for some nefarious public image campaign. They don’t care that much.",
                                            "score": -2,
                                            "author": "Durendal_et_Joyeuse",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I also thought admin was unbothered, but after showing up on ABC7, they sent out an email a few weeks ago detailing their reasoning behind the no-walk decision in an attempt to justify that position. Clearly *someone* is getting flack otherwise that email would not have been sent. There has been an increasing number of \"huh, that's odd\" emails across my time as a student. They're either pretending to care more, or someone's neck is getting breathed down.",
                                                    "score": 2,
                                                    "author": "3_14159td",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I assure you this isn’t one of those emails.",
                                                            "score": 1,
                                                            "author": "Durendal_et_Joyeuse"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "OP didnt know abt the state policy",
                    "score": 2,
                    "author": "Mission_Wall_1074"
                }
            ]
        }
    ]
}