{
    "id": "12q1g8p",
    "score": 2,
    "title": "Housing for an incoming freshman",
    "author": "definitelysixeight",
    "date": 1681774043.0,
    "url": "https://www.reddit.com/r/CSULB/comments/12q1g8p",
    "media_urls": [],
    "other_urls": [],
    "postText": "I live almost 2 hours away when there’s traffic what are the chances of me getting housing?\n\nIdk if it’s ok to ask the same question twice. I’ll delete this if not…",
    "comments": [
        {
            "level": 0,
            "comment": "You’re farther away than a fair amount of students, so that’s good.  But no one here will know the answer.  Applications are still being accepted.  So not even the school could tell you.  You will know on May 8.",
            "score": 2,
            "author": "Teddy118"
        },
        {
            "level": 0,
            "comment": "How many miles away are you? Some places can be a 15 minute drive without traffic but 2 hours using public transportation during rush hour. No one can tell you what your chances are. It mostly depends on how soon you applied on the application",
            "score": 1,
            "author": "RoombaRUs",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m like 50 miles away. I applied on April 10th. Maybe I should’ve phrased it as how good my chances are, I’m not looking for an exact answer. I’m just anxious 😅",
                    "score": 1,
                    "author": "definitelysixeight",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was about 50 miles away as a freshman and got accepted but I applied the same day. You’re higher ranked due to your distance but your late application may impact it. I would say that you’ll either get in or be decently high on the waitlist. Good luck!",
                            "score": 2,
                            "author": "RoombaRUs"
                        }
                    ]
                }
            ]
        }
    ]
}