{
    "id": "12rjc2c",
    "score": 8,
    "title": "Stacking Classes",
    "author": "bathtubcleaner",
    "date": 1681885367.0,
    "url": "https://www.reddit.com/r/CSULB/comments/12rjc2c",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm taking two science classes, BIOL 207 &amp; 208 and the best professors (based on RMP) both had classes on T, TH. Here's my schedule as of the moment:\n\n**Tuesday:**\n\n8:00 - 9:15 AM\n\n9:30 - 10:45 AM\n\n11:00 AM  - 12:15 PM\n\n12:30 - 1:45 PM\n\n2:00 - 4:45 PM\n\n**Wednesday:**\n\n1:00 - 3:45 PM\n\n**Thursday:**\n\n8:00 - 9:15 AM\n\n9:30 - 10:45 AM\n\n11:00 AM  - 12:15 PM\n\n12:30 - 1:45 PM\n\n&amp;#x200B;\n\nThe only good thing about this is I have a 4-day weekend, but I've gotten used to only having 2-3 classes a day, and even on my long days I would at least have an hour 1/2 break. Would I be killing myself next semester? haha😅😃",
    "comments": [
        {
            "level": 0,
            "comment": "Leave yourself a lunch break on Tuesday at the very least. Even if you eat at 7am, you’ll be starving and unable to focus by 5pm. I wouldn’t recommend more than 3-4 classes back to back at the very most.",
            "score": 9,
            "author": "RoombaRUs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I was thinking that too, but there’s really no other options for me, either I take a different professor but I hear they’re harder😵‍💫. Also, I think it’s too late to drop and enroll? My enrollment date was on Monday not sure if there’s any spots available still",
                    "score": 1,
                    "author": "bathtubcleaner",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; only good thing about this is I have a 4-day weekend, but I've gotten used to only having 2-3 classes a day, and eve\n\nYou can change classes without any penalty up until the first 2 weeks of the semester. So you have all of summer to change classes.",
                            "score": 2,
                            "author": "KoalaJKM",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "ohh I see, okay that’s good to know! Thank you!",
                                    "score": 1,
                                    "author": "bathtubcleaner"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "SIs prob won’t be too bad. It’ll be the 3 hour lab that will kill you on top of everything else.",
            "score": 2,
            "author": "RoombaRUs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah😭 but thank you so much for your input! I definitely appreciate it. I’ll just have to figure this out then during the summer 😅",
                    "score": 1,
                    "author": "bathtubcleaner",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes three hour labs are hell to go through. Make sure you have snacks n water especially it’s hotter during fall semester.",
                            "score": 1,
                            "author": "Fun_Nefariousness_54",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "omg i completely forgot about it being hot during fall😵 i’d definitely have to do that. thank you for reminding me!",
                                    "score": 2,
                                    "author": "bathtubcleaner"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That Tuesday looks brutal though. I get cranky when I don’t have something to eat by 11 🥲",
            "score": 2,
            "author": "emeraldgreenmoss",
            "replies": [
                {
                    "level": 1,
                    "comment": "it does 😭 hopefully i can just eat in lectures",
                    "score": 1,
                    "author": "bathtubcleaner"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You can check if there’s still spots available. You should be able to openly drop and enroll until June or July. See if you can shift any of your tuesday classes to wednesday?",
            "score": 1,
            "author": "RoombaRUs",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I just checked it out, and sadly no :( unless I take a different professor. So I can take 2/5 classes on Monday and Wednesday.  However, the times available are really late or way too early and I would have large gaps between classes. 😭\n\nWould having 5 classes, 2 are lectures, 2 are S/I's, and 1 3-hour lab in one day really be bad haha?",
                    "score": 1,
                    "author": "bathtubcleaner"
                }
            ]
        }
    ]
}