{
    "id": "12shmip",
    "score": 6,
    "title": "Trouble with enrolling in classes",
    "author": "ramen_jit",
    "date": 1681954756.0,
    "url": "https://www.reddit.com/r/CSULB/comments/12shmip",
    "media_urls": [],
    "other_urls": [],
    "postText": "So this is what got me messed up.\n\nAfter I did my mandatory freshman advising for my computer science major and when I was able to enroll in my courses, I was put on an enrollment hold even though I fulfilled all the requirements to be able to enroll.\n\nBecause of this, I was unable to enroll into my courses and I had to email my advisor for help.\n\nAfter a few days later, my advisor responded by saying that they were able to lift my hold, indicating that I was not supposed to be put on this hold and that it was their fault on their end.\n\nBecause of this, I am now unable to enroll in the classes that I previously wanted to enroll in because they got filled up after those few days and now I am pissed because this is not even my fault.\n\nSo I’m trying to take MATH 123, PHYS 151, and some CECS courses, and I was told that in order to take my math and physics courses, I have to get in contact with the physics and math department to see if they can have me enroll in a course even though it’s filled.\n\nAre there any tips or suggestions on how I can get this done?\n\nI am so frustrated and lost.\n\nThank you.",
    "comments": [
        {
            "level": 0,
            "comment": "When was your enrollment date supposed to be? Did you try enrolling on that day? If you’re an incoming freshman, have you completed SOAR?",
            "score": 2,
            "author": "RoombaRUs",
            "replies": [
                {
                    "level": 1,
                    "comment": "My enrollment date was on 4/13. They got back to me on 4/17 saying they were able to lift it. I tried enrolling on 4/13 but it said that my enrollment hold prevented me. \n\nI am not an incoming freshman, I am trying to enroll in my courses for my second year.",
                    "score": 2,
                    "author": "ramen_jit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m sorry :( I had the same thing happen to me last semester and just ended up with a shitty schedule. Try seeing if there are any other sections still open for the classes you wanted- even if the times aren’t ideal. You can always switch it later",
                            "score": 2,
                            "author": "RoombaRUs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s all good!\n\nJust really frustrated this happened to me. Thank you for the advice.",
                                    "score": 1,
                                    "author": "ramen_jit"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Send an email to relevant professors, asking them if they can add you to their classes, or what the process would look like.\n\n&amp;#x200B;\n\nyou can also sit in on their classes the first few days of class and get manually added to those courses at professor's discretion. \n\n&amp;#x200B;\n\ngood luck",
            "score": 1,
            "author": "rightsharky"
        },
        {
            "level": 0,
            "comment": "Oh boy. Good luck. I’ve had my own streak of emailing advisors and I know the kind of bs that happens as I’m in CE. Hunker down because it doesn’t get much better in my experience so far.\n\nIn any case, showing up in person to the relevant office of people would most likely get your problems resolved.",
            "score": 1,
            "author": "ThisKid713"
        }
    ]
}