{
    "id": "12x28dr",
    "score": 7,
    "title": "How hard is it to transfer to CSULB with a 2.55 GPA and AS-T in Business?",
    "author": "Delfieee",
    "date": 1682308583.0,
    "url": "https://www.reddit.com/r/CSULB/comments/12x28dr",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey y'all!. I would like to transfer Spring 2024 to CSULB, but my GPA is pretty low. I know I can bump it up maybe to a 2.75 GPA in the summer, but that's as far as it could probably take me.\n\nI have enough classes to graduate at my CC with an Associates Degree, which is a guarantee into the CSU system, but not a specific campus. What was y'alls experiences with that guaranteed transfer? Did you get accepted into the school you originally wanted?\n\nMy other choices are CSULA, CSU East Bay, Cal Poly Pomona, and CSUF!",
    "comments": [
        {
            "level": 0,
            "comment": "CSULB is a lot more competitive now, I applied for business as well with 3.7 GPA and put on the wait list. You should keep all your options open.",
            "score": 21,
            "author": "Live_Guarantee_3024",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s crazy! Did you have an adt? And did you ever end up getting off the waitlist?",
                    "score": 1,
                    "author": "Fit-Number2084",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah AD-T in Business Admin. Nah I accepted my offer to CPP and removed myself off the waitlist for someone who wanted to go there more than me.",
                            "score": 1,
                            "author": "Live_Guarantee_3024"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got accepted for CS (super impacted) with a 3.1 and 11 w’s lol. Anything is possible",
            "score": 12,
            "author": "breadhater42",
            "replies": [
                {
                    "level": 1,
                    "comment": "11 DAMN? (no offense)",
                    "score": 12,
                    "author": "ph4ntomthread",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep! That what happens when you’ve been in a cc since 2015 and addicted to heroin lol",
                            "score": 14,
                            "author": "breadhater42"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Your GPA isn't great for highly impacted school and major. Give it a shot if you can.\n\nInitially went to CSULA and I'll just say CSULB is leagues better in terms of amenities. CSU east Bay cost of living I'm sure is f'ing outrageous relative to all the other csu's on your list.\n\nCal poly Pomona is a beautiful school, I'd say even more so than CSULB.my ex went there and I enjoyed being on campus. Parking is atrocious, but I'm sure that goes for all the schools. \n\nYou should visit these campuses and see what vibe you get. You're going to end up spending 2+ yrs at one of these locations, so visiting is a good investment",
            "score": 6,
            "author": "DiscombobulatedCup83"
        },
        {
            "level": 0,
            "comment": "If you aren’t transferring from LBCC or didn’t a high school in the 562 then it’s practically impossible.  Check out CSUDH.",
            "score": 5,
            "author": "GioJamesLB"
        },
        {
            "level": 0,
            "comment": "I was looking at Chico and Cal Poly Humboldt until I got the surprise acceptance from CSULB. Yeah",
            "score": 2,
            "author": "BeachTransferGirl"
        },
        {
            "level": 0,
            "comment": "Best start getting for community and get a better gpa",
            "score": 1,
            "author": "RudySPG"
        },
        {
            "level": 0,
            "comment": "im transferring to csulb with an as-t in business and my transfer gpa was super lowww (2.37) idk how it happened but it did",
            "score": 1,
            "author": "marksncity",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m tryna get like you my boy!!! CSULB is my goal, and this is definitely a pick me up from my self doubt",
                    "score": 2,
                    "author": "Delfieee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "having an ad-t will really help you get in! there still might be a chance you don’t get in but i think its a great safety net to have vs applying as a upper div transfer",
                            "score": 1,
                            "author": "marksncity"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "i will say my gpa from my current cc was a 2.66 but combined w all the other schools i went to it dropped my gpa a bit but the good thing abt the ad-t program is that it adds 0.1 to your calculated gp",
                    "score": 1,
                    "author": "marksncity"
                },
                {
                    "level": 1,
                    "comment": "Out of curiosity, are you from the LB area? Or was CSULB the only school you applied to transfer to? A 2.37 GPA is below the minimum requirement, so curious how that worked for you.",
                    "score": 1,
                    "author": "mickifree12",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "not from lb area and i applied to csulb, cpp and csula. i honestly did not think i was gonna get in but im not gonna question it",
                            "score": 1,
                            "author": "marksncity",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; i will say my gpa from my current cc was a 2.66 but combined w all the other schools i went to it dropped my gpa a bit \n\nI noticed you said you went to other schools. Were those schools also CCs??",
                                    "score": 1,
                                    "author": "mickifree12",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "1 cc and another csu campus. i got academically disqualified from my previous csu campus",
                                            "score": 1,
                                            "author": "marksncity",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Aahh, I had a friend that basically had similar situation. Went to CSU Chico, then got DQd and went to a CC before transferring to SF state",
                                                    "score": 1,
                                                    "author": "mickifree12"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "also i believe for transfers the minimum gpa is 2.0 but its 2.50 for business prereqs and my gpa for those classes was 2.66",
                            "score": 1,
                            "author": "marksncity"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is your high school one of the local schools for CSULB? Chances are higher if it is so.",
            "score": 1,
            "author": "AriaVerity"
        },
        {
            "level": 0,
            "comment": "I got in with a 3.3 Business adt going into MIS with like 3 Fs and a couple Ws, like other people say anything is possible",
            "score": 1,
            "author": "WolfzH",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hi! Are you local?",
                    "score": 1,
                    "author": "Fit-Number2084",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "naw bay area",
                            "score": 1,
                            "author": "WolfzH",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "thanks!",
                                    "score": 1,
                                    "author": "Fit-Number2084"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "considering what my grades looked like when i was accepted , id say give it a shot",
            "score": 1,
            "author": "pinkluverrr"
        },
        {
            "level": 0,
            "comment": "Only issue is that there is always a metric crapload of people going for business. \n\nBut also, who cares and just apply to them all. Get the csu application waiver and apply to all choices you want. Your chances are kinda w/e, but not applying makes your chance a guaranteed zero.",
            "score": 1,
            "author": "GreenSeaJelly"
        },
        {
            "level": 0,
            "comment": "I had around a 2.7 and I transferred for journalism. Mind you I also lived further away than most attendees of CSULB so I wasn’t as prioritized. I’d say youve got a good shot.",
            "score": 0,
            "author": "JBnews427",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not sure about journalism, but the Business department is pretty competitive. I'd be really surprised if OP gets considered with a 2.55",
                    "score": 10,
                    "author": "mickifree12"
                }
            ]
        }
    ]
}