{
    "id": "132avqm",
    "score": 1,
    "title": "Max Amaya for BIOL 207?",
    "author": "bathtubcleaner",
    "date": 1682718649.0,
    "url": "https://www.reddit.com/r/CSULB/comments/132avqm",
    "media_urls": [],
    "other_urls": [],
    "postText": "Has anyone taken Max Amaya for BIOL 207? He doesnt have a rating on RMP",
    "comments": [
        {
            "level": 0,
            "comment": "He’s really nice and a good TA. I didn’t pass but that was my own fault lol he knew what he was teaching",
            "score": 2,
            "author": "tiny_penguin22",
            "replies": [
                {
                    "level": 1,
                    "comment": "how was his teaching /grading style? i hear from others he has bad ratings since he grades strict",
                    "score": 1,
                    "author": "bathtubcleaner",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe it’s changed since I took him in 2019, but there were a lot of people who consistently got good grades from him. I don’t remember him being a super hard grader tbh. He’s also very open if you go to him and ask him what he’s looking for in terms of grading",
                            "score": 1,
                            "author": "tiny_penguin22",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "ohh I see. Thank you! this was very insightful",
                                    "score": 1,
                                    "author": "bathtubcleaner"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "from what im aware of, this is actually his first year/sem teaching lec + lab. i heard his exams were pretry rough, and that hes a better lab teacher. if you could try gunnjng for rourke/pacefirst, then amaya, then perlman as a LAST resort",
            "score": 1,
            "author": "l1nn__",
            "replies": [
                {
                    "level": 1,
                    "comment": "hmm i see. i was also getting told that as well 🥲. I was just considering amaya because his lectures/labs fit in my schedule better, but Thank you !",
                    "score": 1,
                    "author": "bathtubcleaner",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "hmm if possible try looking for rourke or pace bc 207 is super dense, and if i had a bad prof for 207 this sem i would be crying myself to sleep",
                            "score": 1,
                            "author": "l1nn__",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "😭 I’m currently signed up for Rourke even though his available lab times are horrible 😵‍💫 (dropped amaya). Also, did you take 207 with 208 by any chance?",
                                    "score": 1,
                                    "author": "bathtubcleaner",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "i did not, but im actually taking rourke rn, hes really sweet!",
                                            "score": 1,
                                            "author": "l1nn__"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "if possible take si for rourke, and i also have a couple quizlets i can dm you for your sem :)",
                                            "score": 1,
                                            "author": "l1nn__",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "i would greatly appreciate that! and sadly all the S/I for rourke is full :(",
                                                    "score": 1,
                                                    "author": "bathtubcleaner",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "try looking at the numbers at the beginning of the sem and waitlist, some spots open up",
                                                            "score": 1,
                                                            "author": "l1nn__",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "ooh okay i’ll definitely do that. it’s just the class says it’s closed? so i can’t even waitlist even if i wanted to. (unless i can? and i just dont know how?)",
                                                                    "score": 1,
                                                                    "author": "bathtubcleaner",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "oh thats strange. maybe email the si leadwrs",
                                                                            "score": 1,
                                                                            "author": "l1nn__",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "oh i see, and because the s/i leaders haven’t been officially announced i would have to wait to do this right?",
                                                                                    "score": 1,
                                                                                    "author": "bathtubcleaner"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "He is extremely chill. You should take him. However, his exam and quiz will be a little tough, but if you do study the lecture and do your work, you definitely can do it with no problem.",
            "score": 1,
            "author": "Hashakama",
            "replies": [
                {
                    "level": 1,
                    "comment": "how is his exams/quizzes structured? is it a lot of frqs with mcqs? i also heard he gives out quizzes every week and his homework is very tedious and long to do",
                    "score": 1,
                    "author": "bathtubcleaner",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "  \nYes, We will have a quiz every week but they are easy and if you pay attention in class and stuff, you can do it without have to study much. Every week we gonna have one lab, and the lab gonna due next week lab day. The day you submit it, we gonna have that weekly little tiny daily quiz (3 questions include 1 free response, 1 fill in the blank, 1 multiple choice). For his midterm and final, he always have a mini quiz for student to review first, then big one (separate days not together). His hw is just finish the lab, nothing else. I think people said his lab is tedious because the instructions is confusing and complex. However, if not clear just ask instructor Max and he always willing to help students.  \nP/s: I try to type this real fast so if confuse some part. lets me know",
                            "score": 1,
                            "author": "Hashakama",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "ohh i see, and what was the class average? was a majority receiving high marks?",
                                    "score": 1,
                                    "author": "bathtubcleaner",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "About class average, sorry bath but I don't know.",
                                            "score": 1,
                                            "author": "Hashakama",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "oh i see. just one more question i guess but do people complain a lot about him? (i know people complain about teachers and it’s normal but i guess for him is it excessive?)",
                                                    "score": 1,
                                                    "author": "bathtubcleaner",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "i got notifs on this page lol but theyre talking abt lab only not the lec which is completely diff from lecture imo (with rourke and lab) amaya is a chill lab prof (i had him as a sub) but i hear the lec w him isnt so hot",
                                                            "score": 1,
                                                            "author": "l1nn__",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Oh are you all talking about that Max gonna teach his lecture? I forgot as he told us that next semester gonna be his first time teach lecture. Tbh, he pretty chill on lab so definitely same for lecture",
                                                                    "score": 1,
                                                                    "author": "Hashakama",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "yea i jsut heard ppl dont like the frqs bc rourke and pace do mcq only so its a better test imo",
                                                                            "score": 1,
                                                                            "author": "l1nn__"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Adding onto this post late but:\n\nI had lecture with Amaya and imo he's pretty chill. I never went to any of his OHs, but I heard they were pretty helpful. I did take the S/I for his class though which was a lifesaver bc I can't study on my own. There were weekly quizzes/writing prompts (wasn't every single week, but it was pretty regular) that were done in person at first and then he switched to online versions so it was super easy. The discord was helpful with these. He's been offering extra credit too which are just making a short video explaining a concept (no need to show your face). I'm not a huge fan of his lecture style bc it feels a bit unnecessarily dramatic? Like he pauses a lot for emphasis and stuff, but it's just a mild annoyance and doesn't actually affect the lecture that bad. He's a good guy, and he'll answer questions without making you feel stupid.\n\nDidn't take him for lab, not too sure if his lecture exams are considered hard, but it's mostly MCQ (about 45 or so questions) with 3 FRQ at the end. He gives you about 7 FRQs to practice before the exam, and will pick 3 to use for the exam, so if you do those in advance and study them, you're set. 2/3 of the FRQs on the exam are mandatory, the 3rd one is 10 pts extra credit on the exam (optional, but I always do them anyway).\n\nHope you get into all the classes you wanted :\\]",
            "score": 1,
            "author": "bluecheez404"
        }
    ]
}