{
    "id": "135xf47",
    "score": 132,
    "title": "Some life lessons to learn from the \"Let 2023 Walk\" situation",
    "author": "MaybeSomeHomo",
    "date": 1683055024.0,
    "url": "https://www.reddit.com/r/CSULB/comments/135xf47",
    "media_urls": [],
    "other_urls": [],
    "postText": "I made some unpopular comments on this subject a few months ago and I am sure this will be no different, but I think it's important to learn from failures.\n\n1. The internet is not real life. Getting 15K+ people to digitally sign an online petition doesn't mean anything. That translated into a *maybe* 20 person picnic protest.\n\n2. You have to have a message. This is how the majority of the discourse surrounding the dilemma went:\n\nStudents: We want to walk!\n\nAdministration: No.\n\nStudents: Oh yeah? But we WANT TO WALK!\n\nAdministration: No.\n\nRepeat. The End.\n\n3. You have to have bargaining power. Because the message was so, put politely, juvenile, administration never even had to consider the request. There was no research conducted to find out more about the contract with the stadium, no data on alumni donations or how this might impact it, or no information regarding if this could potentially impact applicant decisions. \n\n4. Being loud and having a strong argument are not the same things.\n\n5. Meaningful change takes a ton of information, a ton of hard work, and a ton of people. This \"campaign\" had none of that and the results are self-evident.\n\nI wish we could have walked, I really do. My family isn't even coming to the ceremony now because of how impersonal it is. I hope future attempts are better thought out.",
    "comments": [
        {
            "level": 0,
            "comment": "The Daily 49er YouTube channel actually put together a pretty good overview of the situation. It's well done with good editing and production. \n\nhttps://youtu.be/KCfzvjFYdXY\n\nAnd you can't expect anyone to know about the contract with Anaheim stadium because it was a private agreement. No amount of investigation will uncover private documents",
            "score": 37,
            "author": "Doucejj",
            "replies": [
                {
                    "level": 1,
                    "comment": "CSU paid for it with state money. There are documents and if you submit a PRA, you can get them.... in about 3 years.",
                    "score": 6,
                    "author": "Medical_Beyond_7349"
                },
                {
                    "level": 1,
                    "comment": "If this person is so bothered about it, why doesn’t he go ahead and do some research for the cause. Why whine about it saying “you” could have done this and “you” could’ve done that?",
                    "score": 14,
                    "author": "SkyLonely3848",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Projection at its finest.",
                            "score": 16,
                            "author": "Trevsdatrevs"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My department is having its own ceremony. Just cause they feel it’s unfair.",
            "score": 20,
            "author": "nuggiejac",
            "replies": [
                {
                    "level": 1,
                    "comment": "Which department?",
                    "score": 5,
                    "author": "SprAlx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Health science",
                            "score": 4,
                            "author": "nuggiejac",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Where can we find info on this? I haven’t heard anything and I’m a health science student",
                                    "score": 1,
                                    "author": "initial-g713",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I just read the info it’s just for the graduate students. I apologize for the confusion.",
                                            "score": 2,
                                            "author": "nuggiejac"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If people want to create meaningful change, make an impact by simply not showing up. Of course this requires a majority of the people to participate but it is possible. The school doesn’t care about its students so the students should not participate in this faux ceremony. Make the administrators look stupid as they give speeches to an empty stadium.",
            "score": 71,
            "author": "noeraser",
            "replies": [
                {
                    "level": 1,
                    "comment": "I want there to be like 3 students in the commencement youtube video lol",
                    "score": 6,
                    "author": "Nice_Cod_6189"
                },
                {
                    "level": 1,
                    "comment": "&gt;Of course this requires a majority of the people to participate but it is possible.\n\nYou think getting the majority of college graduates and their families to sit out of their college graduation for a *maybe* change next year is a possible task? This is exactly what I am talking about. No strategy, no realism, no tactics, just wishful thinking.",
                    "score": 38,
                    "author": "MaybeSomeHomo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you participate in their ceremony you are not changing anything. If you participate in their ceremony you are legitimizing their shitty plan.",
                            "score": 17,
                            "author": "noeraser",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you don't participate in their ceremony there is also a very, very high probability that you also aren't changing anything. And I'm saying that as somebody who is not participating.",
                                    "score": 8,
                                    "author": "MaybeSomeHomo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That’s why it’s imperative you need the numbers. Im not saying one person is going to change anything. It’s a necessity to have a collective effort.",
                                            "score": 3,
                                            "author": "noeraser",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Okay, I agree. What is the exact number of students that need to sit out of the official graduation to make change? 100? 1,000? 10,000?",
                                                    "score": 0,
                                                    "author": "MaybeSomeHomo",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "why are you asking us? I feel like you know it all, do your research dude and tell US.",
                                                            "score": 11,
                                                            "author": "SkyLonely3848"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They don't even need to sit out for a change next year. Since it's so impersonal why spend money to go? They can just do something else with their family and celebrate in a much more personal manner than by watching administrators talk for who knows how long.",
                            "score": 10,
                            "author": "Mountain-Apple-8951",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think I am explaining myself poorly. \n\nIt's not that this is not a good idea for what could potentially impact them, it's that it takes a ton more research, planning, and implementation to go from your idea to an impact-causing action. You would have to have a lot of different data to find out how many people would have to abstain from graduation for this to be a viable plan. Then you'd have to gain enough traction to get that many people *and* their families to agree with it. The entire premise of this cause was that graduation is such a monumental moment in a person's life that they are entitled to a traditional stage walk. But then the alternative is to just skip graduation altogether? The messaging doesn't make sense. The strategy doesn't make sense.",
                                    "score": 6,
                                    "author": "MaybeSomeHomo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Bruh why do you keep saying “you’d” have to do this “you’d” have to do that. Clearly this concerns you as much as it does to other graduates, why don’t you make your own server and if people think your strategies are great, they’d follow ya. You don’t seem to do any work but whine about everything here anonymously. \nIf you want us to listen to you, first of all, be a part of the group, don’t come in as a freakin outsider suggesting us to do things you’re clearly uncomfortable to do. \nAnd talking about the alternative, we wanted to come up with alternate solution for the school to have us walk but we need to know the schools problem (which keeps changing per email) to find a damn solution. But the shitty administration and the hopeless president would not talk to us and we can’t physically make them talk to us because we don’t wanna end up in jail. If you had strategies that you knew would work, why didn’t you say anything on the discord and if you did, why didn’t people listen to you? \nI don’t think you’re the only smart person on this planet. No one supported you because you said things like an outsider asking everyone else to do the work. So shut up!",
                                            "score": 11,
                                            "author": "SkyLonely3848"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "lol all you people are asking us to do the IMPOSSIBLE. We cannot change the mind of other student's!! If people want to show up, they will. The majority of the school has definitely seen or heard about our campaign however they just don't care that they arent getting a real ceremony. We cannot make people care, that is the most important thing to learn from this.",
                    "score": 4,
                    "author": "ARLA2020"
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://www.reddit.com/r/CSULB/comments/11hglhv/anybody_else_kind_of_meh_on_the_whole_graduation/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button\n\nHere's the post if anyone is wondering. It mentions none of this",
            "score": 8,
            "author": "Doucejj"
        },
        {
            "level": 0,
            "comment": "Why didn’t you put any of these ideas to use? \nWhy don’t you plan something out since you got it all figured out? \nYou seem to be a know-it-all who likes to bash the movement but WHERE WERE YOU? \nIf you know exactly what is needed why didn’t you lead the movement? \nThat’s right because you’re all talk. You don’t see that we’re all just students trying to get our degrees and there’s only so much we can do. And you say “maybe a 20 person picnic” atleast they took action unlike you, you like to hide behind a screen and swear you could do it any better. I ask myself why you even open your mouth if you’re not doing anything about it. Why have an opinion about something you don’t seem to care about?  A lesson you could learn is to stfu if you’re not gonna help.",
            "score": 23,
            "author": "AppointmentTime6378",
            "replies": [
                {
                    "level": 1,
                    "comment": "LMFAOOO WORD UP",
                    "score": 9,
                    "author": "SkyLonely3848"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah see this post is crazy. Seems like some people love to criticize without lifting a single finger to truly help push the movement forward. \n\nSince you clearly have no idea what kind of time and effort went into this movement which could have been “better thought out,” here’s an idea: \n\nI made the time to sit down and write the petition, I made the time to design the flyers, start the gofundme, to raise money. I drove to Burbank to pick the flyers up and spent hours putting them up around the school. I made the time to speak on the phone with the Long Beach Post, the Long Beach Press-Telegram, the LA Times, Beachcomber news, I made the time to meet with NBC4, etc. I made the time to create the Instagram and run it, I made the time to send countless emails, create the entire Linktree packed with resources on how to help, I researched email contacts for university administrators and local government officials, and wrote email drafts for others to copy and paste. I took the time to write a 1 minute public comment and skipped class to speak at the CSU Board of Trustees meeting, I spent my own money on materials for the protest, I spent 5 hours at the library with other students making posters. I skipped class to attend the first protest. I took the time to buy the snacks for the 2nd protest/picnic. These are only a few of the things I’ve personally done, and don’t forget on top of this I am also a graduating senior studying molecular biology and working in a lab on campus. \n\nThis is not an attempt to take full credit for anything. But clearly you genuinely have no idea what has gone into this, probably because you haven’t contributed a single thing this entire time. Many other students have also been putting an IMMENSE amount of effort into this whole ordeal. Other students have ALSO been skipping class to work on the movement, taking the time to participate in interviews, many students were in the library for hours helping with posters, etc. Students have MADE the time to help. They’ve donated money, they’ve sent emails, they’ve reached out to professors, etc. Students have been doing the absolute best they can. \n\nTo address your comment about the movement’s lack of research/information: are you kidding? Have you even bothered to read the Daily 49ers special issue on commencement? This issue goes BEYOND our movement. Have you seen the research done by other students into the financial aspects of commencement? The video outlining this entire situation with interviews from the president of CSUF as well as Pres Conoley? Look into that. \n\nYou genuinely haven’t done anything to help this movement at all. Sure, you’re entitled to your own opinion. But if you’re the same person who came into the Discord server 2 months after the movement started to criticize us and give terrible suggestions like “you should be camping outside of Conoley’s car every night”………….Get a grip. \n\nWe did the best we could. We can’t force people to attend protests. We can’t force people to boycott the ceremony. At the end of the day, we just can’t make people care, and we truly did the best we could given the time and the resources we had. There is absolutely no way you could have done a better job than us. Too bad you were too busy sitting on your couch telling us what you think we should be doing instead of actually lending a helping hand towards the cause.",
            "score": 25,
            "author": "i-really-suck",
            "replies": [
                {
                    "level": 1,
                    "comment": "Additionally, we hit a major wall because administration refused to meet with us. We genuinely could not set up a meeting with anyone after our initial meeting with Jeff Klaus. No one from admin responded to email requests to set up meetings. I’m telling you, we did the best we could. I wish there was more we could have done, but we’re all graduating seniors with a lot on our plates besides the movement. This took a lot of time, and ultimately, I’m really proud of everyone who actually contributed. Hopefully this opened the door for class of 2024 to push harder—if they care to do so. Thanks to anyone who genuinely supported us.",
                    "score": 22,
                    "author": "i-really-suck"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lol you're just a dick. I am a part of the 2023 walk campaign and we truly tried our best-being seniors in our last semester of college. You want us to do all of these unrealistic things like go outside of jane's house with a beat box and a hot dog cart. This is all stuff you told us to do in the discord server btw. You are acting like we don't have our own lives, such as having to study and work. We truly tried everything we could without endangering our reputations at the school. Yes, it sucks that out of all those people who signed the petition, only like 15 showed up to our picnic protest, however, that is NOT OUR FAULT. At the end of the day, we cannot make people actually care about the graduation ceremony. It seems that a lot of the students in this school actually don't care about the ceremony which blows my mind. We worked really hard but we can't do the impossible which is making people actually care. There were only about 25 of us I would say that truly took this campaign really seriously and sadly, that is not enough people to make an impact. You all should blame yourselves for not caring, not the people who started this campaign and wanted to make an actual change. Our campaign was on multiple news outlets such as ABC, NBC, and telemundo. We were also on multiple newspapers, so we definitely did try.",
            "score": 20,
            "author": "ARLA2020",
            "replies": [
                {
                    "level": 1,
                    "comment": "You guys did a good job. And I feel like you guys did make a difference for future classes. Dont get too down on yourselves. There was so much media and stuff about it too. It definitely put many more eyes on the issue. And that's progress and a win in my book.\n\nOp is just being a dick",
                    "score": 13,
                    "author": "letitbell",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "thank you :). OP talks a lot of shit but he did not show up to a single protest or show an ounce of support. He has just given us worthless advice that we cannot use because he fails to realize we are college students just like himself.",
                            "score": 12,
                            "author": "ARLA2020"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The biggest voice would have been students RSVPing then just completely NOT showing up so its just the stupid admin team.",
            "score": 3,
            "author": "Main-Implement-5938"
        },
        {
            "level": 0,
            "comment": "OP you have not participated in any of the protests nor have you contributed anything to help the situation. All you’re doing is hiding behind a screen and devaluing people’s work while you haven’t done any work at all. Not only do you have shitty behaviors, but you’re also misinformed. You are seriously a shitty person.",
            "score": 5,
            "author": "Pretty_Tone8267"
        },
        {
            "level": 0,
            "comment": "where was ur post? I’d like to read it.",
            "score": 6,
            "author": "dimple-freckle",
            "replies": [
                {
                    "level": 1,
                    "comment": "It wasn't anything like this. He is inflating his own post. His original post was like \"why do people care so much???\" And then in the comments anyone that answered why they cared he was like \"Its not a big deal, get over it. You're childish\". Nothing he said in this post was brought up elsewhere. He even deleted most of his comments and stuff from that post because it was down voted alot",
                    "score": 26,
                    "author": "Doucejj",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lmao! Call it out like it is. That’s so toxic tbh. It’s problematic to respond w that attitude. People’s thoughts and feelings are valid and if others don’t have anything productive or kind or helpful to say they shouldn’t say it.",
                            "score": 12,
                            "author": "dimple-freckle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol yeah. I saw this post and thought I remembered the username. It's pretty shocking if he truly believes what he's saying in this post.  Because his other post wasn't at all what he was saying here. I wanna say someone in the other post commented something like \"I Care because I worked 2 jobs and went to school full time, so earning a degree is a big deal and I want to be recognized\"\n\nAnd his response was something like \"you are being recognized in the ceremony. Not walking isn't a big deal. I'm a veteran and work and go to school and I don't think it's a big deal\"\n\nThen he got down voted to hell. Because yeah, just because YOU don't care, doesn't mean others don't care. This whole post is rewriting history because he never posted about any of this stuff. All he did was shame people for giving a fuck because he doesn't give a fuck",
                                    "score": 7,
                                    "author": "Doucejj",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Fuck bro shaming others and devaluing their success and paths is not baller. Everyone’s got their trials and tribulations. Graduating is an immensely huge feat and for some it’s an absolute mt Everest. The community and world needs more positivity and supporting each other.",
                                            "score": 12,
                                            "author": "dimple-freckle"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It's rare to come across a comment so incorrect that I get to simultaneously point out how stupid the user is and strengthen my original point. So thank you. I'm going to combine both of your incorrect comments into this response.\n\n&gt;I wanna say someone in the other post commented something like \"I Care because I worked 2 jobs and went to school full time, so earning a degree is a big deal and I want to be recognized\" And his response was something like \"you are being recognized in the ceremony. Not walking isn't a big deal. I'm a veteran and work and go to school and I don't think it's a big deal\"\n\nNo, actually, the other person said, and this is a direct quote, not your kind of sort of fuzzy memory from a thread two months ago that happens to align with the picture you are trying to paint, \"I feel like people who share this idea like you are people who didn't really try in college and don't care about college in general. For people who actually worked their asses off in college, they want to be acknowledged for their accomplishment of going through 4 years of constant studying and hard work.\"\n\nMe bringing up that I am a vet and worked full time while going to school full time so that I could actually transfer to a university was a response to the false claim that \"if you don't care, you don't try hard.\"\n\n&gt;His original post was like \"why do people care so much???\"\n\nNo, my original post was \"Anybody else kind of meh on the whole graduation ceremony drama?\" because you literally were not allowed to say anything to that extent in person. \n\n&gt;And then in the comments anyone that answered why they cared he was like \"Its not a big deal, get over it. You're childish\". Nothing he said in this post was brought up elsewhere. He even deleted most of his comments and stuff from that post because it was down voted alot\n\nNo, I wrote that the absolute *hysterics* that people were going through including statements like \"why did I even get a degree, it barely feels worth it\" or \"the administration hates us\" were juvenile overreactions to not getting the exact graduation ceremony you wanted. I still stand by that. It also ties into my point regarding the childish messaging where real adults aren't going to take you seriously when you stomp your feet, pout, and make ridiculous claims like your college education not being worth it because a president you hate didn't call your name. \n\n&gt;This whole post is rewriting history because he never posted about any of this stuff. All he did was shame people for giving a fuck because he doesn't give a fuck\n\nWhat another perfect example of what I put in the OP. *You don't know what you don't know*. Let's pretend for a second that your petty \"summaries\" of what I said in that particular post are accurate. The funny thing about Reddit and real life is that people exist outside of when you interact with them Mr. Main Character. So maybe, just maybe, it's possible that you don't have a 100% comprehensive knowledge of my Reddit user history on this and other accounts.\n\nAnd, just so I can keep all of my responses to you in one spot \n\n&gt;No amount of investigation will uncover private documents\n\nOne, yes it can, it's literally been the basis of whistleblowing and undercover journalism in every industry since the history of forever, and two, you don't necessarily need that exact document to collect usable data for this particular argument. \n\n&gt;He even deleted most of his comments and stuff from that post because it was down voted alot\n\nNo, I delete the majority of my comments regularly on all accounts because you never know what information can be combined and used against you. Exhibit A: you talking out of your ass multiple times in this thread. Give it a try.",
                            "score": -3,
                            "author": "MaybeSomeHomo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Youre not coming off any better after admiting all that. \n\n\nAnd, Okay. So where did you say ANY of this stuff in your post in the original post? You didn't. So stop the \"I told you so\" BS. \n\nAnd what kind of journalism are you expecting of students? Undercover private investigator journalism to break into the record office at school to show the public the Anaheim agreement? C'mon now. And it's not like you actually read any of the media on the commencement stuff. The leaders of the movement even said multiple times that they weren't expecting things to change for them,  so they were hoping it may cause enough of a stirr to change for later years. I don't think many people were expecting things to change this year",
                                    "score": 11,
                                    "author": "Doucejj",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; The leaders of the movement even said multiple times that they weren't expecting things to change for them\n\nYou think that leaders of the movement titled \"Let '23 Walk\" weren't doing so in the hopes of changing it so that...2023 could walk? \n\nI refuse to interact any further with somebody this dumb. Have a day.",
                                            "score": -2,
                                            "author": "MaybeSomeHomo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Protesting \"let 24 walk\" doesn't really have the immediate impact as let 23 walk doesn't it? It's like how racial movements are titled things like \"walk to end racism\", do they think they will completely eradicate racism by doing s walk? No, but they're making progress. Maybe go back and actually read the media about the movement. They literally said they're trying to change it for future classes. Maybe actually research the shit your talk down about before posting",
                                                    "score": 9,
                                                    "author": "Doucejj"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I was the one that left that comment on your last post. You also need to realize that you are older than the typical age of a student here and I am not trying to be rude when saying that at all. However, with older age, that means you have gone through more milestones than a typical 22 year old graduating college. Your comment is ignorant because you are not realizing that the majority of students have not gone through multiple milestones that you have. For most of us, graduating college is probably the biggest milestone we are currently going to achieve in our lives so far.",
                                    "score": 8,
                                    "author": "ARLA2020"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "https://www.reddit.com/r/CSULB/comments/11hglhv/anybody_else_kind_of_meh_on_the_whole_graduation/?utm_source=share&amp;utm_medium=android_app&amp;utm_name=androidcss&amp;utm_term=1&amp;utm_content=share_button\n\nHere's what's left of the original",
                    "score": 3,
                    "author": "Doucejj"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a meaningless post this is.",
            "score": 16,
            "author": "reaction-jackson",
            "replies": [
                {
                    "level": 1,
                    "comment": "How so?",
                    "score": 1,
                    "author": "MaybeSomeHomo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "how so? can’t you see that it’s ALL words and NO work? how can someone be so delusional",
                            "score": 13,
                            "author": "SkyLonely3848"
                        },
                        {
                            "level": 2,
                            "comment": "You might as well be handing out bibles in front of school and preaching your religion to people.",
                            "score": 9,
                            "author": "reaction-jackson"
                        },
                        {
                            "level": 2,
                            "comment": "because they are critiquing something in a harsh manner when they AGREE with the situation, has ideas, but isn’t helping???",
                            "score": 2,
                            "author": "Actual-Manner3491"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh yeah, literally no point",
                    "score": 3,
                    "author": "letitbell"
                }
            ]
        },
        {
            "level": 0,
            "comment": "was quiet literally a waste of time lol",
            "score": 2,
            "author": "playboixx"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "His points are valid but he never said anything like this. His original post was like \"why do people care about walking???\" And then when anyone said that they care he commented and said something like \"Its not a big deal, stop caring so much\"\n\nHe never brought up any of these points. This post is alot of retroactive change to his original post.",
                    "score": 14,
                    "author": "Doucejj"
                },
                {
                    "level": 1,
                    "comment": "I did. I was downvoted and called an asshole multiple times.",
                    "score": 15,
                    "author": "MaybeSomeHomo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I just want to be clear, this isn't supposed to be an \"I told you so\" post. Once the sting of not walking fades (which, I promise you all, it will), this is a very valuable learning experience. \n\nYou don't know what you don't know and early 20-somethings thinking they know it all is NOT new or unique to the people who had the best of intentions with this protest. Now we know not to place as much value in online discourse. Now we know that we need to have tangible data. \n\nThat's learning. That's growth. That's what college is about.",
                                    "score": 15,
                                    "author": "MaybeSomeHomo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 3,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "well you two can suck eachother off with all the praises y’all have going on here. Y’all both useless. \nTo OP, you’re an ass who doesn’t want to do any work but whine. You yourself don’t have the “strategy” you keep talking about. If you had a good one, everyone would’ve listened. Don’t give yourself too much credit for doing nothing LMFAO.\n\nTo the other dude sucking this guy off: First of all, you’re late to the party, second of all, you don’t get to have an opinion about how the movement ran because you were not in it. And you clearly didn’t care enough “sooner”.\n\nWe’re all students like you all are, we tried everything on our end. The OP wants us to get in front of Conoley’s house and get a circus going on there, but that’s not how it works, that’s how you get arrested and get a bad rep. We didn’t want to do anything that would have a finger pointing us while we point all ours at the admin. That’s the last thing we wanted. Plus the OP assumes, we don’t have life out of this movement and that BS. We atleast tried and publicly came forward. Not like the OP who is still anonymous and whines about “his” action plan that he wants everyone else to follow. We’re not your servants, you can’t just sit it out and give orders from the outside. If you wanted to get involved, you would have. \n\nYou didn’t cuz you don’t have a damn dick to. So STFU and let people do whatever they want. Don’t whine about nothing now come on",
                                                    "score": 8,
                                                    "author": "SkyLonely3848",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Damn nvm I don’t even know who to believe but your point is valid too. Overall it is what it is and honestly I don’t even think we will ever win against administration bc at the end of the day they don’t care about us. Thanks for trying regardless it was just irritating to think no one wanted to listen to some good advice but now I don’t even know bc I’ve read a lot about how the OP was an ass but then they say you guys were assholes so whatever.",
                                                            "score": 1,
                                                            "author": "Apart_Investment_768",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "lol you should blame yourself, after all, students like you are the reason that we did not get to make any change because you guys did not want change to happen.",
                                                                    "score": 0,
                                                                    "author": "ARLA2020"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So what happened? Did the protest work? Did the online petition work? I guess not.",
            "score": -1,
            "author": "Mission_Wall_1074",
            "replies": [
                {
                    "level": 1,
                    "comment": "no they did not work because not enough students truly wanted to make change. Majority of students did not care. We cannot make students care about something, that is completely up to themselves.",
                    "score": 0,
                    "author": "ARLA2020"
                }
            ]
        }
    ]
}