{
    "id": "1399bks",
    "score": 20,
    "title": "What are some of the nice things the school offers?",
    "author": "doggopaws",
    "date": 1683340139.0,
    "url": "https://www.reddit.com/r/CSULB/comments/1399bks",
    "media_urls": [],
    "other_urls": [],
    "postText": "I wasnt able to get a tour for this school so I was just curious as to what you guys think are the nicest things the school offers. Like at CSUF they have therapy dog days and personal trainers for their student gym. Anything worth noting?",
    "comments": [
        {
            "level": 0,
            "comment": "The student recreation center seems like a cool place to work out, play sports, swim, and study.",
            "score": 28,
            "author": "Sweet_Primary_1576"
        },
        {
            "level": 0,
            "comment": "gym and Japanese garden is all I need ☺️",
            "score": 25,
            "author": "Astrofyy"
        },
        {
            "level": 0,
            "comment": "There’s a fountain with occasional ducks. It makes my day when I see them sometimes and that’s pretty cool",
            "score": 16,
            "author": "some_rock",
            "replies": [
                {
                    "level": 1,
                    "comment": "Awww I love duckies :)",
                    "score": 2,
                    "author": "doggopaws"
                },
                {
                    "level": 1,
                    "comment": "I got a cool video of a line of 15 ducks at the Japanese garden back in like 2019. So adorable.",
                    "score": 1,
                    "author": "TheDerpingWalrus"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Location is awesome. You can do a lot of random fun things.",
            "score": 35,
            "author": "tuanduay"
        },
        {
            "level": 0,
            "comment": "It has alot of boba shops near by , uh that’s about it 🥲\n\nOh wait forgot about the gym, it’s cute and big &amp; it has a little cafe that you can go to when your done with you work out , and a sitting place to study , a yoga room &amp; a swimming pool. I’m pretty sure students can also schedule free massages there",
            "score": 9,
            "author": "Brilliant_Size_9759",
            "replies": [
                {
                    "level": 1,
                    "comment": "THERES FREE MASAGES???? I'm all in. I gotta take that advantage while I can",
                    "score": 6,
                    "author": "doggopaws",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I believe only the massage chairs are free, but they're still super nice.",
                            "score": 1,
                            "author": "coolbluebird21"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There's the Japanese garden which I highly recommend if you want a nice peaceful place to sit. I don't remember where it is but the gaming place - there's bowling, pool, and other games. Also go onto the school's calendar for events schedule because there are a lot of other things to experience. There's therapy puppies around the time of finals. There's also movie showings.",
            "score": 23,
            "author": "marvelousrose",
            "replies": [
                {
                    "level": 1,
                    "comment": "Therapy puppies wish I knew about this. Where on campus can I play with these puppers?",
                    "score": 2,
                    "author": "Hayjad610"
                },
                {
                    "level": 1,
                    "comment": "Dude, how do you not know that it’s the university student union?",
                    "score": 4,
                    "author": "Remote-Stretch8346",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dude, because I didn't.",
                            "score": 10,
                            "author": "marvelousrose",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Now you do lol",
                                    "score": 5,
                                    "author": "Sweet_Primary_1576",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Recently graduated so I'll likely forget it again 😂",
                                            "score": 6,
                                            "author": "marvelousrose"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The gym is insane and better than any gym poor ppl can afford, the ASU has a food pantry with free food, there is a bowling alley that costs very little, there is a game room with game systems and tvs you can chill at, pool tables etc. I didnt discover the ASU till senior year and damn its so cool so mad i didnt find till now. the library has 3d printers and a starbucks. its honestly pretty legit for the college experience imo.",
            "score": 5,
            "author": "actualgangmember",
            "replies": [
                {
                    "level": 1,
                    "comment": "The gym, is there cost ?",
                    "score": 1,
                    "author": "Grntelle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "no its free, it has an indoor track swimming pool rock climbing wall basketball courts it's awesome",
                            "score": 2,
                            "author": "actualgangmember",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Incoming this fall so I wanted to be safe before going lol thanks !!!",
                                    "score": 1,
                                    "author": "Grntelle"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "gym cost is included in your tuition (fall and spring) summer and winter you’ll need to pay",
                            "score": 2,
                            "author": "GodlyPear"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wooaaah all of that sounds amazing, thank you so much",
                    "score": 1,
                    "author": "doggopaws"
                },
                {
                    "level": 1,
                    "comment": "for the food pantry, is it free for all students?",
                    "score": 1,
                    "author": "Cautious_Bank9661",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yes",
                            "score": 1,
                            "author": "GodlyPear"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Robeks, the Poke Bowl restaurant",
            "score": 4,
            "author": "EVencer",
            "replies": [
                {
                    "level": 1,
                    "comment": "There's no more poke place only subway, pollo Loco, Carl's jr, robeks, coffe bean, saboro and the nugget",
                    "score": 2,
                    "author": "Friendly_Act_3081"
                },
                {
                    "level": 1,
                    "comment": "OMG the Poke Bowl restaurant (Hibachi I believe) is delicious. I highly recommend!!! Also the pub (I hope it's still open - not sure since I haven't been since COVID started).",
                    "score": 1,
                    "author": "marvelousrose"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you are planning to dorm in the parkside area we have a shuttle that takes you from there all the way to the library. The shuttle system overall goes around the perimeter of the campus. You get the most out of it if you dorm in Parkside but you can also catch it throughout the campus overall. Disclaimer: I graduated last spring but I think it's still a thing!",
            "score": 5,
            "author": "fluffySheepcloud",
            "replies": [
                {
                    "level": 1,
                    "comment": "even if u commute, the shuttle saves lives. used to walk from the pyramid parking structure to the library every day until i realized that the shuttles are a thing.",
                    "score": 7,
                    "author": "Legitimate_Ad_4600",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "how does the shuttle work? do we have to pay and/or need to have our ID?",
                            "score": 2,
                            "author": "Adventurous-Dog-8694",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Naw it’s free and they really only check ID during the beginning of the semester",
                                    "score": 1,
                                    "author": "PlantsandTats",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "thank you! this is going to help a lot now 😭 i would always just walk from north campus to south",
                                            "score": 1,
                                            "author": "Adventurous-Dog-8694",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "download the rides systems app (blue icon with the letter r) and it tells u the times of the shuttles, west loop is upper campus and east loop is lower",
                                                    "score": 4,
                                                    "author": "Legitimate_Ad_4600",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "life saver, thank you!!!!",
                                                            "score": 1,
                                                            "author": "Adventurous-Dog-8694"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Canes, chick fli a, in n out and the circle are all 5 min away",
            "score": 2,
            "author": "peterg33"
        },
        {
            "level": 0,
            "comment": "The word \"BEACH\" is in the name of the school. \n\nWho wouldn't want to go?",
            "score": 2,
            "author": "islandbeef"
        },
        {
            "level": 0,
            "comment": "They have a professional writing program which is great if you want to open your opportunities for career growth. It has internships and helps you build a portfolio.",
            "score": 2,
            "author": "capn_dragon513",
            "replies": [
                {
                    "level": 1,
                    "comment": "tell me more",
                    "score": 2,
                    "author": "grandesausageburrito",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sorry I was doing finals. But basically it teaches you all about technical writing and building a portfolio so it’s pretty hands on. There’s a few requirements before you’re accepted but here’s the link that tells you everything in detail.[CSULB professional writing certificate](https://cla.csulb.edu/departments/english/professional-writing-certificate-program/)",
                            "score": 1,
                            "author": "capn_dragon513"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "dont come to this school, they are not going to give you a proper graduation ceremony. Plz go to CSUF instead. Don't get fooled by all this shit people are telling you and trying to bribe you over. This school ain't worth it. Our president Jane Conoley is a total cunt.",
            "score": -1,
            "author": "ARLA2020"
        },
        {
            "level": 0,
            "comment": "I toured both schools and I didn’t find anything special about CSUF and I believe it’s even more expensive. CSULB has a lot to offer and it’s a nice campus. During finals week they do have therapy dogs and free food and activities at the USU. We have the Farmers Market on Tuesdays, and they have various events with free stuff and good food. We now have a kitchen where you can take cooking classes. Everything is just a bus ride away so you can go off campus to different areas nearby. The gym also has personal student trainers, group classes, indoor track, outdoor pool, and rock climbing. \n\nHot take: We currently do not have a traditional graduation ceremony but I personally do not care. If you identify with an ethnicity you can do the cultural ceremonies and those are more interesting and it’s actually held on campus.",
            "score": 0,
            "author": "False-Chart-8130"
        }
    ]
}