{
    "id": "13b7nlj",
    "score": 9,
    "title": "COLLEGE CORPS",
    "author": "kiyanesb06",
    "date": 1683504462.0,
    "url": "https://www.reddit.com/r/CSULB/comments/13b7nlj",
    "media_urls": [],
    "other_urls": [],
    "postText": "@ anyone who applied this year, have you guys heard back yet about whether or not you got accepted??",
    "comments": [
        {
            "level": 0,
            "comment": "Also has the same question. No email yet or whatsoever whether I got selected or not.",
            "score": 4,
            "author": "Specialist-Amount447"
        },
        {
            "level": 0,
            "comment": "I had two emails; one for an interview and one with an acceptance after my interview. I got the acceptance about two weeks ago on 4/28. I would contact them and ask since it’s been awhile if they haven’t contacted you already. Hope all goes well!",
            "score": 4,
            "author": "babydragonfruits",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks for the info! i did the finalist interview two weeks ago but haven’t heard since then so i’m kinda confused about my standing",
                    "score": 3,
                    "author": "kiyanesb06"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve gotten two emails, one for an interview and one for my acceptance after the interview",
            "score": 3,
            "author": "Radiant_Ad5959",
            "replies": [
                {
                    "level": 1,
                    "comment": "if you don’t mind me asking when did you get the acceptance email??",
                    "score": 3,
                    "author": "kiyanesb06"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve been receiving emails from them as well. they contacted me for an interview and then followed up with the selection!",
            "score": 1,
            "author": "ReputationOptimal797",
            "replies": [
                {
                    "level": 1,
                    "comment": "if you don’t mind me asking when did you get the selection email??",
                    "score": 2,
                    "author": "kiyanesb06"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Aww man they leaving you hanging like that?! Yeah contact them as soon as you can! Good luck with finals by the way :3",
            "score": 1,
            "author": "babydragonfruits"
        },
        {
            "level": 0,
            "comment": "Received notification that \"Students selected for these interviews have already been notified.\" No follow-up sent, so I believe that I was not set to be interviewed at all.",
            "score": 1,
            "author": "Sekka3"
        },
        {
            "level": 0,
            "comment": "You might be on the waitlist. I got the acceptance a week and a half ago maybe and already accepted. The deadline to accept was no later than may 5. You might hear back if people don’t accept. That would be my explanation. I hope you end up getting in!",
            "score": 1,
            "author": "psychopsych101"
        }
    ]
}