{
    "id": "13ca7ac",
    "score": 6,
    "title": "HillSide vs BeachSide Vs Parkside",
    "author": "c00lme1",
    "date": 1683592786.0,
    "url": "https://www.reddit.com/r/CSULB/comments/13ca7ac",
    "media_urls": [],
    "other_urls": [],
    "postText": "I am a 19 yo Sophmore (20 yo by next sem) and got confirmed for housing. I also transferred here this semester. \n\n&amp;#x200B;\n\nWhat are the updated pros and cons of each? Most of the posts on them seem to be from a while back so just curious",
    "comments": [
        {
            "level": 0,
            "comment": "Hillside\nPros: closer to campus walking wise, most students are second years to seniors, dining hall is decent, and there is a late night cafe, for the most part it’s quiet \nCons: most dorms don’t have AC unless you’re in los alamitos or los cerritos, dining hall options are kinda limited also they are closed sundays \n\nBeachside\nPros: most students are transfers there and are older, you’re closer to the traffic circle, all the rooms have AC, dining hall is open 7 days a week\nCons: off campus and you have to take a shuttle to get to campus which sucks when the semester starts, dining hall sucks (in my opinion), you’re basically trapped there during the weekends unless you have a car\n\nParkside:\nPros: dining hall is probably the best one in campus (my opinion), there’s usually something going on like events, from what i’ve seen very community based since mainly freshman live here, close to the park if you smoke then you can walk there without getting in trouble, also very close to the pyramid, two thematic houses \nCons: No AC unless you live in parkside north, thursday nights gets kinda wild at times, fire alarms tend to go off easily, usually freshman housing unless you’re in north you will see more people close to your age, walking to campus can be a lot especially at the ramp (ifykyk), dining hall closes saturday \n\n\n*you should def check out the layout of a room in all the villages too to see what you want tbh it really depends on what you make of it!",
            "score": 7,
            "author": "matthewissleepy"
        },
        {
            "level": 0,
            "comment": "Lived at Parkside this year was super fun and nice it’s very new and more like an apartment. The only con is that the second floor is very rowdy there",
            "score": 1,
            "author": "Justin_Ganz"
        },
        {
            "level": 0,
            "comment": "[https://www.csulb.edu/sites/default/files/images/2023-02/%2723-%2724%20Room%20Type%20Comparison%20Chart.png](https://www.csulb.edu/sites/default/files/images/2023-02/%2723-%2724%20Room%20Type%20Comparison%20Chart.png)\n\nhopefully this picture works out! i also got confirmed for housing and this picture shows a lot of pros and cons",
            "score": 1,
            "author": "Cautious_Bank9661"
        }
    ]
}