{
    "id": "13eew7y",
    "score": 8,
    "title": "GWAR/GPE Questions",
    "author": "slowmotionz101",
    "date": 1683786044.0,
    "url": "https://www.reddit.com/r/CSULB/comments/13eew7y",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello,\n\nSomehow I am just becoming aware of the GWAR / GPE test that's due June 2nd. I'm transferring in the fall and did not do well in writing so I'm suddenly feeling really panicked.\n\nSo please help me, GWAR and GPE test are the same thing or different?  \n\n\nI was under the impression that the GWAR writing was simply due before graduating, not due in order to keep your admission. So if you get a poor score your acceptance will get rescinded?\n\n  \nI emailed the testing department to see if they could advise me as well.",
    "comments": [
        {
            "level": 0,
            "comment": "The GPE is the placement exam for the Graduate Writing Assessment Requirement (GWAR) needed to graduate. Every student has to take an upper-division, writing intensive class to fulfill the GWAR.\n\nStudents take the GPE in their junior year or upon transferring in. Students who don’t score an 11 or above on the placement exam have to take an additional course to improve their writing skills before taking the required class.\n\nYou should register for the test ASAP in case you end up having to take the additional writing class. Plus, at some point, they will hold your registration if you haven’t taken it. GWAR can hold up graduation, so they don’t mess around.",
            "score": 5,
            "author": "LBLawNerd",
            "replies": [
                {
                    "level": 1,
                    "comment": "I signed up for the online version. I have been on a break from school since December waiting to transfer and suddenly get an email saying the deadline to sign up for gwar is in 2 days on the 12th and the test is June 2nd so my head started spinning",
                    "score": 3,
                    "author": "slowmotionz101"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes GWAR/GPE both names are the same for the assessment you will only take one assessment. The assessment doesn't affect your eligibility to attend csulb it will only show how many writing classes you will have to take in order to graduate. Don't panic it is an easy assessment basically you will have to write an essay answering a prompt and if you get the highest score you will still need to take one writing class however if you get a lower grade you will probably take 2 or 3 classes depending on your grade. I will suggest signing up asap and attend the workshops they provide for that so that you have an idea on what the assessment will be like.",
            "score": 2,
            "author": "Sad-505",
            "replies": [
                {
                    "level": 1,
                    "comment": "not the same 😒 gpe is the placement test for gwar which is a required class/classes you need to take based on how you score on the gpe",
                    "score": 3,
                    "author": "BossyMossy1315",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Got it! Sorry I was confuse and thanks for clarifying",
                            "score": 2,
                            "author": "Sad-505"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you 😅",
                    "score": 1,
                    "author": "slowmotionz101"
                }
            ]
        },
        {
            "level": 0,
            "comment": "At least you were fortunate enough to schedule the online exam. 🥲",
            "score": 1,
            "author": "sudokukami",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well they answered my email saying that if you’re a tranfer student and taking it in the summer (which you have to???) that it can’t be online but yet it let me register online. When I told them this they told me to call them. Lol",
                    "score": 1,
                    "author": "slowmotionz101",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I see. The only time slot available for me was in person. Hopefully they let you take it online!",
                            "score": 1,
                            "author": "sudokukami"
                        },
                        {
                            "level": 2,
                            "comment": "It can’t be online?? I also signed up for the online one as transfer and paid the $25",
                            "score": 1,
                            "author": "doodlelilly",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, I had to email the testing department and they switched it for me, after speaking to someone over the phone. I would call",
                                    "score": 1,
                                    "author": "slowmotionz101",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What email did you send it to?",
                                            "score": 1,
                                            "author": "doodlelilly",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Testing@csulb.edu",
                                                    "score": 1,
                                                    "author": "slowmotionz101"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}