{
    "id": "13n9n6z",
    "score": 16,
    "title": "no more fafsa after 2 years?",
    "author": "Legitimate_Ad_4600",
    "date": 1684618065.0,
    "url": "https://www.reddit.com/r/CSULB/comments/13n9n6z",
    "media_urls": [],
    "other_urls": [],
    "postText": "that’s what i’ve heard that after sophomore year we can no longer use fafsa and i just wanted to know if that’s true?? if so how tf do u pay for classes cuz i’m solely relying on fafsa rn",
    "comments": [
        {
            "level": 0,
            "comment": "If I’m not mistaken you have 4 years of fafsa. You shouldn’t lose it after your sophomore year.\n\nEdit: it’s 6 years",
            "score": 56,
            "author": "YakDirect5718",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cal Grant is 4 years and Pell Grant is 6 years I believe. It took me 5 and a half years to graduate and I still had my tuition paid for + a refund as well. So you should be good OP.",
                    "score": 26,
                    "author": "aCSULBstudent",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same, also graduating in 5 1/2 years. I just finished year 5, still had Pell Grant. Since Cal Grant is only 4 years, they also put me on like middle class scholarship this year?",
                            "score": 5,
                            "author": "FrumpyPhoenix",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Was everything still covered for in your 5th year? Did you have to pay out of pocket at all?",
                                    "score": 1,
                                    "author": "Ryujehoang",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I normally had my tuition paid for plus an extra refund before the 4 years. Once I got into my 5th year, I still had my tuition covered, but the refund I normally got was lowered.",
                                            "score": 1,
                                            "author": "aCSULBstudent"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "No, didn’t have to pay anything out of pocket. I think there was even a lil extra for books and stuff or something like that.",
                                            "score": 1,
                                            "author": "FrumpyPhoenix"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "6 years or until you **graduate with a Bachelor’s.**",
                    "score": 4,
                    "author": "-HawaiianSurfer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’ve been through this it’s 6 years max of financial aid, so you have enough money/time even if you fail a semester. However, if you started in community college those years count too.",
            "score": 10,
            "author": "discounicorn9"
        },
        {
            "level": 0,
            "comment": "Who told you that? Because that isn’t true at all. You get it until it runs out, which would be after like 8 years of full time school or so",
            "score": 18,
            "author": "Pizzasloot714"
        },
        {
            "level": 0,
            "comment": "Fafsa will last for up to 6 years, the only time it won’t last up to 6 years is if you’re pursuing a masters, you’ll qualify for loans but most likely not any grants as there’s rarely any for masters.",
            "score": 6,
            "author": "Howdo1useredd1t"
        },
        {
            "level": 0,
            "comment": "I’ve been getting FAFSA for much longer than 2 years lol whoever said this told you a flat out lie. You can get it for up to 6 years! Always remember to take at least 12 units a semester to get awarded the full amount :)",
            "score": 3,
            "author": "Standard_Employee_60"
        },
        {
            "level": 0,
            "comment": "Its 6 years total. If you defer at any point, those funds are still available to you.",
            "score": 2,
            "author": "Miserable_Speed5474"
        },
        {
            "level": 0,
            "comment": "I used the fafsa for the 6.5 years I was at CSULB. Don't worry about it.",
            "score": 2,
            "author": "Falcon5ky"
        },
        {
            "level": 0,
            "comment": "FAFSA is a form. If you are in any type of college and want to be considered for financial aid, you always fill it out, whether that's undergrad, graduate school, or professional school. It doesn't go away unless you decide not to go to school anymore, or you want to pay for it out of pocket.",
            "score": 2,
            "author": "Empty-Trifle-7027"
        },
        {
            "level": 0,
            "comment": "FAFSA is just an application for federal aid and it depends on you/your guardians’ financial situation. As others have said, the types of aid you receive will determine how long and the total amount you can receive while completing your BA/BS. My advice is to speak with a financial aid counselor in Brotman Hall to see what you specifically qualify for. You also want to make sure you’re maintaining eligibility by keeping a 20 minimum GPA each term, completing at least 66% of your coursework a year, and staying under the maximum allowed units for undergraduate FA (I think it’s like 160).",
            "score": 2,
            "author": "RedBeardRPG"
        },
        {
            "level": 0,
            "comment": "so you can only do two years of fafsa max at a community college or first two years of school and then it resets when you transfer",
            "score": 2,
            "author": "actualgangmember",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wait so if you do two years at community college then fafsa resets once you transfer to a university?",
                    "score": 1,
                    "author": "Hamnii",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "yeah, i used up my cc money cuz i took so long, but when i transferred i got pell and cal grants again cuz i was in upper division",
                            "score": 1,
                            "author": "actualgangmember"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Considering that they give you the money according to the units you’re taking, it shouldn’t be by number of years",
            "score": 1,
            "author": "slowmotionz101"
        },
        {
            "level": 0,
            "comment": "Not true. You will receive fafsa for 6 yrs",
            "score": 1,
            "author": "Mission_Wall_1074"
        },
        {
            "level": 0,
            "comment": "That is not true.",
            "score": 1,
            "author": "mariiov"
        },
        {
            "level": 0,
            "comment": "Not sure about ur situation but it’s around 4-6 years. If anything I would contact the financial aid office and ask",
            "score": 1,
            "author": "Traditional-Swim-78"
        },
        {
            "level": 0,
            "comment": "I ran out of FASFA and Long Beach was going to jump in and cover what FASFA was going to but I graduated earlier than expected",
            "score": 1,
            "author": "dralex11266"
        },
        {
            "level": 0,
            "comment": "Not true at all.",
            "score": 1,
            "author": "monsturdd"
        },
        {
            "level": 0,
            "comment": "You usually get up to 4 years with the cal and 6 with pell. Unless you are on academic probation you get a warning to get your gpa up and pass all 3 requirements. If you don’t then they take away fasfa but you can do an appeal.",
            "score": 1,
            "author": "SeaworthinessBig4156"
        },
        {
            "level": 0,
            "comment": "FAFSA is 6 yrs. What you heard is incorrect.",
            "score": 1,
            "author": "IntuitiveHealer23"
        }
    ]
}