{
    "id": "13rt2jp",
    "score": 6,
    "title": "Thermodynamics MAE330",
    "author": "Sweet_Pea_1510",
    "date": 1685048116.0,
    "url": "https://www.reddit.com/r/CSULB/comments/13rt2jp",
    "media_urls": [],
    "other_urls": [],
    "postText": "Has anyone taken Madadi E for thermo during spring 2023? Heard some stuff happened and the professor is not curving grades now due to what happened.",
    "comments": [
        {
            "level": 0,
            "comment": "Take Dillon",
            "score": 10,
            "author": "formerly_fried",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dillon does a SWEET curve haha. Definitely.",
                    "score": 8,
                    "author": "physioengineer"
                },
                {
                    "level": 1,
                    "comment": "yeah I was thinking that tbh but I was wondering why Madaddi is not gonna curve because that's crazy to me",
                    "score": 4,
                    "author": "Sweet_Pea_1510",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Madaddi sucks",
                            "score": 2,
                            "author": "MycologistInfamous84"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Dillon is a wonderful professor and a generous grader, 10/10",
                    "score": 2,
                    "author": "Longjumping-Cap-9716"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What happened?",
            "score": 6,
            "author": "Medical_Beyond_7349"
        },
        {
            "level": 0,
            "comment": "Madadi is a great professor with the curves or not anymore. I took him in Spring 2022 so he curved everyone who at least put a small amount effort into the class to a C. Apparently he doesn’t/can’t do that anymore because the MAE advisor had a talk with him about it. He also got complaints from students about some other things, but I swear he’s one of the nicest dudes ever. Those students in my opinion, were tripping.",
            "score": 6,
            "author": "_theCh0sen0ne_"
        },
        {
            "level": 0,
            "comment": "I took madadi for mae330 during spring 2023, some drama did happen where he said he wouldnt curve. The tests were honestly brutal but i averaged about 35% on the tests and passed. BUT he ended up curving about 25% so dont worry about what he said. Just try to get an average grade for the exams and squeeze some points out of attendance, hw, and quizzes and you’ll do fine.",
            "score": 2,
            "author": "ThemTreePuns",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's tripping me out bc he also says exclusively on the syllabus as well that grades will not curve. And reviews on rate my professors are saying the majority of the class failed",
                    "score": 1,
                    "author": "Sweet_Pea_1510"
                }
            ]
        },
        {
            "level": 0,
            "comment": "He lies about that quite a bit lol good prof though",
            "score": 1,
            "author": "Illustrious-Bonus547"
        }
    ]
}