{
    "id": "144ux4d",
    "score": 4,
    "title": "What major should I pursue?",
    "author": "Infamous-Gift-9313",
    "date": 1686284160.0,
    "url": "https://www.reddit.com/r/CSULB/comments/144ux4d",
    "media_urls": [],
    "other_urls": [],
    "postText": "I want to study for crime scene investigator or become a profiler but my advisor said human development will be great option... but I do my research and I see biology is a better option. What major can I take to help me be prepared for CSI or profile instead of criminal justice?",
    "comments": [
        {
            "level": 0,
            "comment": "You don’t need a bio degree to become a csi, only if you want to work in a lab ( toxicology,dna, ballistics, etc.",
            "score": 6,
            "author": "DanceForsaken3961"
        },
        {
            "level": 0,
            "comment": "Csulb and csula both have a csi certificate program too",
            "score": 2,
            "author": "DanceForsaken3961",
            "replies": [
                {
                    "level": 1,
                    "comment": "yes! i did the csulb csi program ☺️",
                    "score": 1,
                    "author": "Beneficial-Cattle499"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Microbiology or genetics or chemistry. \n\nYou want experience that will allow you to use the equipment or at lease explain and understand the techniques and tools of modern investigations. \n\nDNA testing, gas chromatography, fingerprinting scans, field tests for drugs.",
            "score": 2,
            "author": "MermaidNatureGirl"
        },
        {
            "level": 0,
            "comment": "double major in something more scientific and something else more human behavior related? like psych + bio",
            "score": 3,
            "author": "boonana-split"
        },
        {
            "level": 0,
            "comment": "I’d say major in psychology and minor in forensics studies and criminal justice",
            "score": 1,
            "author": "DanceForsaken3961",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or major in criminal justice and minor in psychology",
                    "score": 2,
                    "author": "DanceForsaken3961"
                }
            ]
        },
        {
            "level": 0,
            "comment": "But if you want to stand out major in biology and can get a masters in forensics science at cal state La",
            "score": 1,
            "author": "DanceForsaken3961"
        },
        {
            "level": 0,
            "comment": "Most science degrees would give you an edge compared to other applications. I would recommend biology or chemistry, with your next best option being criminal justice. CSULB also has a forensic science minor and a CSI certification",
            "score": 1,
            "author": "RoombaRUs"
        },
        {
            "level": 0,
            "comment": "I want to do the same thing as you and I’m majoring in Criminal Justice &amp; minoring in Forensic Science. If I could go back, I would probably go after a hard science degree. I say this because you can work in the lab (if you go out to the field and decide you dont like that) AND because if you go into this field and realize this isn’t what you want (many people realize they cant handle the gory stuff) then you have a degree in science and can fall back on a different career path. I would also say it makes you stand out because most people (like myself) just go after a CJ degree. If you have a bio/chem degree, you know more than CJ.",
            "score": 1,
            "author": "Beneficial-Cattle499",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was planning to do the same thing but ima keep this in mind",
                    "score": 1,
                    "author": "Dark253Knight"
                }
            ]
        }
    ]
}