{
    "id": "t4v11m",
    "score": 273,
    "title": "I don’t think I asked…",
    "author": "Ashdod-",
    "date": 1646207331.0,
    "url": "https://www.reddit.com/r/CSULB/comments/t4v11m",
    "media_urls": [
        "https://i.redd.it/zlnfpje2exk81.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I like how her first two sentences invalidate the entire thing. Yes, this take indeed did not add anything.",
            "score": 57,
            "author": "safespace999",
            "replies": [
                {
                    "level": 1,
                    "comment": "felt like I was reading an opinion article in a high school newspaper",
                    "score": 37,
                    "author": "Ashdod-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Tbh should have just gone the easy way out say “news trouble, news make stress, if you stress visit counseling services+ we expand services for while to help. Bye”",
                            "score": 18,
                            "author": "safespace999",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I think she needs some counseling or guidance on how to be a school president. Half the shit in our school doesn’t work, can’t even open the doors to some of our classes. Handicap buttons don’t work to open doors, I would go on and on and here she is writing an opinion piece on something she barely knows anything about. Sounds like she wants to run for public office or some shit.  smh. \n\nGarbage email… \n\nI think every one of us feels for Ukraine and we mostly stay updated ourselves we don’t need her opinion, go do the job you’re supposed to do.",
                                    "score": 13,
                                    "author": "purvee"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "“WHERE IS JA RULE?”",
            "score": 21,
            "author": "Brandimes",
            "replies": [
                {
                    "level": 1,
                    "comment": "AHHHHHHHHHHHHHHHHHHHHHHHHHH",
                    "score": 3,
                    "author": "purvee"
                },
                {
                    "level": 1,
                    "comment": "Your comment reminded me of this amazing clip, and after I looked it up I instantly laughed 😂😂\n\nhttps://youtu.be/Mo-ddYhXAZc",
                    "score": 2,
                    "author": "Molluskyy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "im ukrainian american and im so tired of all these faculty giving their takes on the war and treating it the way they do. its a fantasy for so many of them, none of them have ever been there and have no family or friends there, none of them knew anything or cared about the political situation in ukraine for the past five years, and most importantly they dont give this kind of attention to any wars happening outside of europe, especially not the ones the united states are pursuing aggressively and with even more criminal impact as russia. its just a fantasy, like a dream, something they watch like a movie. i could never say this shit in class tho bc theyd be offended or whatever but its not like THEY have family in kiev or anything. anyway maybe ill delete this vent later",
            "score": 82,
            "author": "honest-hearts",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s very much become sensationalized and treated like some sort of sick movie in a way where some people are rooting for the underdog because it’s become the “trendy” thing to do and are guaranteed to have been quiet before/are guaranteed to be quiet after this. I’ve heard people give the most ludicrous takes about this war that just confirm their complete lack of understanding of the catastrophic impact that it is going to have on hundreds of millions of people for many years to come while it’ll be completely forgotten here and painfully repeated in history due to the world’s inaction, or rather selective action when it comes to helping people. I’m Armenian and I totally get your frustration, I just wish people would take action more often because this sort of stuff happens around the world a lot more than some folks realize and there’s just a lot of double standards going on and direct involvement that has unspeakable consequences that just get swept under the rug because its convenient. Stay strong, and if you need a place to vent feel free to DM me",
                    "score": 10,
                    "author": "sloppyfishy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Crazy how no one seemed to care when it’s any other country in the world (especially the middle east). If you want to condemn war somewhere, you have to do it EVERYWHERE. They’re just following the trends now. Pathetic",
            "score": 28,
            "author": "Buraq0",
            "replies": [
                {
                    "level": 1,
                    "comment": "She's notorious for following trends. BLM is a prime example... She's replacing a lot of top leadership with black females. Head of HR, Provost, next will be some Dean, as there are no black Deans.",
                    "score": 12,
                    "author": "mrboombastical"
                },
                {
                    "level": 1,
                    "comment": "I think that is a naive point of view that hides the visceral truth.\n\nIt is not that people are condemning the act of ‘invasion’ or ‘war’ it is the fact that this conflict affects US interests in Europe. It’s more of ‘condemnation’ of the destabilizing of the current geopolitical climate. Sad truth.",
                    "score": 3,
                    "author": "safespace999",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They pretend that they care, when 80% of people who post about it don’t give a crap. “Everyone’s posting about it so i’ll just post a thread or smth”",
                            "score": 10,
                            "author": "Buraq0"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Look at the leaders of Ukraine ...",
                    "score": 0,
                    "author": "Allstars94"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Conoley: WAR... bad, Religion .. BAD, democracy... GOOD!!! However, let's keep supporting Ukraine which has literal ultra far right Nazis (Azov brigade) as their soldiers.\n\nI'm sure her handlers are proud",
            "score": -7,
            "author": "Allstars94"
        },
        {
            "level": 0,
            "comment": "january 6 orange man bad",
            "score": 0,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Fred the fish……. MY LEG",
            "score": 1,
            "author": "CaliRollerGRRRL"
        }
    ]
}