{
    "id": "1455oeo",
    "score": 1430,
    "title": "AITA for punishing my son with 300 chores",
    "author": "NecessaryFix7058",
    "date": 1686318292.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1455oeo",
    "media_urls": [],
    "other_urls": [],
    "postText": "We have a chore chart, my three children have to 4 chores a day, they aren’t hard, like make you bed or sweep you carpet. If you get too them when you get home it takes usually 20 minutes in all. Every kid has different chores depending on age, can’t have the 7 year old take the kitchen trash out. It works really well overall and they can see there four chores each day for the month.\n\nMy son has been pawing of his chores to his youngest sister 12. So she basically has been doing 8 chores a day. My daughter came to me upset not understanding why I was giving his chores to her. I wasn’t she was lied to by him and since they usually do them when I am at work I didn’t notice.\n\nSo as a punishment since he had her due his chores for about a little over a month (36 days) He has to do 300 chores on top of his chores already. Since that basically the amount she has been doing for the time that month. He was not happy but really if he just does a  ton of cleaning on the weekend it won’t be that horrible, and some chores overlap.\n\nMy husband hear about it and claims I am going overboard. That it is an upsetting amount. He tried to retract the punishment but I put my foot down. AITA is this too much\n\n——————————————————————————\nSince people asked, my daughter has the choice of take 36 days off or get extra allowance for the work she did. She hasn’t chosen yet\n\nA little confusion, he is still doing daily chores but they will overlap with the 300 chore list. So you do a task it is marked off both lists. This will make him do at least 4 chores a day. Overall it will still be a total of 300 chores. Sorry for the confusion",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n &gt; I gave my son 300 chores as a punishment since he pawned off his stuff to his sister for over a month. I may have gone to far which makes me an ass\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "score": 1,
            "author": "Judgement_Bot_AITA"
        },
        {
            "level": 0,
            "comment": "NTA - As long as your math is correct, this is perfectly fair.  Frankly, he should do the same number of chores he made his sister do and then some extra as a punishment.  You don't have to go that far, but he is getting off light if you just give him the same number that his sister had to do.",
            "score": 2602,
            "author": "Rich-398",
            "replies": [
                {
                    "level": 1,
                    "comment": "36*8=288\nThere are 12 extra, since making a nice round number and interest",
                    "score": 1444,
                    "author": "NecessaryFix7058",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "always gotta account for interest and penalties!",
                            "score": 726,
                            "author": "chuckinhoutex",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "R/assholetax ?",
                                    "score": 151,
                                    "author": "ea93",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If puppy tax means somebody has to post a pic of their puppy, not sure I want to contemplate asshole tax…",
                                            "score": 208,
                                            "author": "AlpineHaddock",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "LMAO",
                                                    "score": 24,
                                                    "author": "GratificationNOW",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Getting it in position for the picture?",
                                                            "score": 14,
                                                            "author": "0klet0",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "ahahaha I walked right into that",
                                                                    "score": 8,
                                                                    "author": "GratificationNOW"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you! I needed that laugh.",
                                                    "score": 11,
                                                    "author": "FlutteringFae"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 27,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "u/Labryuiopyu stole and mangled this comment from u/Dense-Store8986",
                                            "score": 8,
                                            "author": "thecatinthemask"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "OK - That's perfect. Well done.",
                            "score": 84,
                            "author": "Rich-398"
                        },
                        {
                            "level": 2,
                            "comment": "Wait but there is a flaw. \nIf she had to do 4 herself already, wouldn't he actually only added 4 additional. Making the amount he made her do 144? \nOr did I misunderstand that each Child had 4 chores?",
                            "score": 41,
                            "author": "Devilishtiger1221",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think the point is to put him in her shoes for a month. The sister was doing nearly 300 (in total) because of his lies, and now he gets to see what that's like by doing 300 as well?",
                                    "score": 196,
                                    "author": "v_blondie",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "He has to do the extra 144 on top of his usual 144. 144 is the normal number of chores in that time period, so she doubled it and rounded up to an even 300.",
                                    "score": 80,
                                    "author": "Trilobyte141",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But she said \"300 on top of his chores already\". \nSo actually he's doing like 444 (approximately) \nHer math is flawed.",
                                            "score": 25,
                                            "author": "Devilishtiger1221",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Let me clarify, 300 and his 4 chores a day, but those chores overlap in general with the 300. \n\nSo if today chore was take out the trash and on his list of 300 he can mark it off both not do it twice. Basically all of his daily chores will be on the 300 list. So things will be listed twice he really will only do 300, unless it is a daily chore of make your bed\n\nThis will basically force him to do four chores a day no matter what, so he doesn’t but everything off for a month",
                                                    "score": 83,
                                                    "author": "NecessaryFix7058",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That isn't even a punishment then, just paying back what he owes.\n\nI thought you were going for 300 because he committed 2 wrongs each day to get out of chores: lying to your daughter so she would do them and lying to you that he was the one doing his chores to collect his allowance. Even 4 chores per lie seemed reasonable to me...",
                                                            "score": 104,
                                                            "author": "BetterWithLatte",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "yeah, he's getting off pretty easy.",
                                                                    "score": 45,
                                                                    "author": "rak1882"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "This is only fair if he does HER chores like she did his. She didn't get to pick and choose from a list of chores that she wanted to do and when she wanted to do them. She was tricked into doing her brother's chores. So he should do her chores for the same number of days and then some extra for punishment.\n  \nThe chores are only part of it. He got to enjoy 1 month of no chores and made his sister pay for it. His sister should get the same privilege and then extra because she did nothing wrong.",
                                                            "score": 49,
                                                            "author": "BendyPopNoLockRoll"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "You've made this way too complicated.\n\nJust have him do 8 a day for the same amount of time she did, or slightly longer.",
                                                            "score": 24,
                                                            "author": "AnxietyElectronic232",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That is exactly what she did. 36 days X 8 288 (+12 for interest and to make a nice round number) So. 300 Hours.",
                                                                    "score": 4,
                                                                    "author": "LadyDerri",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "300 hours?\n\nThis is what I mean.\n\nEvery time OP explains it, it's slightly different.\n\nThe way she explained it in the OP is confusing.\n\nShe's keeping two lists and marking chores of the 'punishment' chart and the 'daily' chart.\n\nJust assign the kid 8 chores a day and be done.\n\nSame with the daughter, she's offered the daughter time off chores or money...just pick one and give it to her. No need to make things so unnecessarily complex.",
                                                                            "score": 4,
                                                                            "author": "AnxietyElectronic232"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Why not just have him do his sisters chores for 2 months.",
                                                            "score": 13,
                                                            "author": "davidcornz"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Make it simple, he does 8 chores a day for 36 days.",
                                                            "score": 7,
                                                            "author": "Glittering_Cost_1850"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Then technically he’s only getting 12 chores for punishment. The rest is just his work load that he in essence delayed.",
                            "score": 30,
                            "author": "Fox-Dragon6",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But his sister is getting the same month off that he did.\n\nAnd he's doing her chores on top of his.\n\nIt's fair, just OP has found the most convoluted way to describe it.",
                                    "score": 12,
                                    "author": "AnxietyElectronic232",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m not disagreeing on the fairness. I agree with what op said. My reply was more towards the husband saying it’s to much",
                                            "score": 6,
                                            "author": "Fox-Dragon6",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If OP explained it like she did in the OP, then I get it.\n\nShe didn't just say it was 36\\*8, she has weird overlaps and seems to think her son can finish the majority of them in a weekend.\n\nSo it's 36 days worth of chores...or a weekend worth of chores?\n\nIt's confusing, convoluted and I 100% think that the husband thought she wanted him to do 300 chores in a weekend.",
                                                    "score": 8,
                                                    "author": "AnxietyElectronic232",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Humm I can see that. I was confused at her logic until she explained. If the husband thought it needed to all be done in a week I can see who he would be upset.",
                                                            "score": 3,
                                                            "author": "Fox-Dragon6"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I would ask your husband why your son doing this amount of work is so egregious when it’s the same amount your daughter has been doing this whole time.",
                            "score": 31,
                            "author": "saltpancake"
                        },
                        {
                            "level": 2,
                            "comment": "The problem is that you over complicated this very light punishment. Your son and husband hear 300 and think it’s a lot. It’s barely more than your daughter did and he should do that and then some. Instead, she did twice her chores for a month, he should do wltwive his chores for 2 months.\n\nETA- NTA but instead of jumping to the conclusion your husband is misogynistic I’m gonna say you didn’t explain it well and made something too complicated.",
                            "score": 13,
                            "author": "Own-Let2789"
                        },
                        {
                            "level": 2,
                            "comment": "You made this punishment super complicated. He should be doing 8 chores a day. If daughter wants month off he does hers. If she wants to be paid he does 4 other chores.",
                            "score": 12,
                            "author": "Glittering_Cost_1850"
                        },
                        {
                            "level": 2,
                            "comment": "Ah yes, the being a jerk to your sister tax",
                            "score": 4,
                            "author": "ISwearImaWriter963"
                        },
                        {
                            "level": 2,
                            "comment": "So as the original 4 per day count, he is literally doing what his sister has been doing, and the *actual* punishment is 12 chores\n\nNTA\n\nI think it is very mild, very kind, and perfectly fitting to his crime.",
                            "score": 4,
                            "author": "alyom"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As punishment for lying make them clean the shower drains. Doesn't take long, is easy, but a more awful experience than it should be.",
                    "score": 21,
                    "author": "Hijix",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This would be the most awful chore at my house! My daughter and I both have long hair! It’s completely disgusting 🤢",
                            "score": 2,
                            "author": "Mykidsaremylife1969"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Agreed. As punishment I would have had him do both kids chores for a month to see if he likes being taken advantage of.",
                    "score": 5,
                    "author": "Books-and-a-puppy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh, so your husband is fine with your preteen daughter learning that she can’t trust men? That boys will manipulate her, get what they want &amp; never face any consequence, because other men will be there to shield them from justice? \n\nYour husband is just totally okay with teaching your son that the problem wasn’t that he did it, the problem was that he got caught? That maybe next time a little sibling pressure/blackmail/ bribing can keep his mark from going to the property authorities?\n\nEdit- absolutely NTA, if it was reversed I’m sure he would want the same and a handwritten color pencil apology.",
            "score": 1044,
            "author": "Wonderful-Biscotti86",
            "replies": [
                {
                    "level": 1,
                    "comment": "TBF this is a very accurate life lesson. \n\nOp is absolutely NTA for wanting the next generation to be better.",
                    "score": 186,
                    "author": "LivingLikeACat33"
                },
                {
                    "level": 1,
                    "comment": "Yeah, OP really needs to ask herself some hard questions about wth is up with her husband that this is his attitude. It's little wonder where son learned his attitude from",
                    "score": 67,
                    "author": "zombiedinocorn"
                },
                {
                    "level": 1,
                    "comment": "OP, read this comment to your husband. It’s an incredibly good point and he needs to know that his job as your daughter’s ally is to protect her from men taking advantage of her, even if those men are her own family members.",
                    "score": 59,
                    "author": "readthethings13579"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"Making him do her chores isn't a punishment, it's literally just restitution for what he did to her. If you think this is going overboard, then you should be livid that he did something so horrible to her. So let's think together of what we should do to give him a suitable punishment *in addition* to the restitution he needs to do.\"\n\nNTA. Your husband is counting the chores in a very weird way...it's particularly odd that he would count your son's extra chores like that but apparently is counting your daughter's extra chores in the normal way. You probably should look into whether he shows favoritism to your son in other ways, because if so, you have a bigger problem on your hands.",
            "score": 497,
            "author": "DinaFelice",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, his whole thing is “it’s too many for the boy to do! But the girl did it for over a month, she’s fine.” It’s absolute BS.",
                    "score": 123,
                    "author": "167119114",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably because OP \n\n1) Explained the system very badly\n\n2) Seems to think he can do most of the 300 in a weekend.\n\nHusband probably said 300 chores in a weekend is too much.",
                            "score": 11,
                            "author": "AnxietyElectronic232",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "She didn’t say over a weekend anywhere? She clarified in the comments that it was expected over the course of a month, just like the daughter had to do.",
                                    "score": 28,
                                    "author": "167119114",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes, making restitution is usually considered a punishment due to the extra time/work involved.",
                    "score": -1,
                    "author": "AnxietyElectronic232",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When someone is charged with theft for example they have to pay restitution to the person it was stolen from AND THEN pay a fine or serve time.",
                            "score": 4,
                            "author": "RU4r",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA\n\nThis sounds like excellent parenting. You want to abuse your sister? Well now you get to know what it feels like to be abused for a month. Make sure near the end of it you have a conversation with him about what he learned about this, why he chose to pawn off his chores on his sister, and why he thought that was ok. \n\nIt's not enough to just assign punishment, you need to actively discuss the reasonings behind it. He may have something worse going on in that mind of his, like some sort of internet-spawned sexism that only women do chores or something, that you won't know unless you talk it out.",
            "score": 175,
            "author": "Encartrus",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Nta\nYour daughter was suckered into doing 300 chores for him through deceit and lies. Far more concerning to me is that your husband tried to \"overrule\" this punishment in the male child's favor. Smacks of patriarchy to me.",
            "score": 130,
            "author": "casserole422"
        },
        {
            "level": 0,
            "comment": "NTA, 300 sounds like a lot until I did the math and that's basically what she did anyways. Some parents would ground him for the next 36 days on top of the chores, so he is lucky!\n\nHe is learning a valuable lesson in play stupid games, win stupid prizes. This is fair parenting!",
            "score": 80,
            "author": "nackle09",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe I'm missing something but I don't see how it came up to 300.8 times 30 is 240.",
                    "score": 6,
                    "author": "East_Platypus2490",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "36 days 8*36=288, 12 chore interest and make it a round number",
                            "score": 41,
                            "author": "NecessaryFix7058",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just to further ask, if I understand correctly:-\n\nYour son will be doing their normal 4 chores/day\n\nHe will also be doing an additional 144 chores on top in respect of the chores he dumped off on his sister (to bring things to balance);\n\nAnd then a further 144 (+12) as the punishment itself.\n\nNTA, purely asking in the interest of clarity.",
                                    "score": 12,
                                    "author": "shadowofthegrave",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The daily chores will over lap with the 300 list. So if he does a daily chore it will be marked off of both, it will make him do 4 chores a day no matter what, like he is suppose to do. \n\nIt will still be 300 chores at the end",
                                            "score": 29,
                                            "author": "NecessaryFix7058",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's not even a punishment. He's just resuming doing what he's supposed to do. Shouldn't he be doing 8 chores a day for 36 days?",
                                                    "score": 44,
                                                    "author": "OpinionatedNonsense"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Honestly your 300 number is really dumb and confusing. Don’t count his existing chores, count the extra. So he’s getting 156 extra chores. (Which is just paying back his sister plus 3 days extra.)",
                                                    "score": 16,
                                                    "author": "snowboard7621"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Don’t forget 8 times 6 is 48, 240+48=288. He rounded 288 to 300.  The difference between the two is less than two days worth of chores at the rate the 12 year old was getting scammed into doing",
                            "score": 5,
                            "author": "roastpigandartichoke"
                        },
                        {
                            "level": 2,
                            "comment": "Never mind I missed that it was for 36 days.",
                            "score": 2,
                            "author": "East_Platypus2490"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If he does exactly as much as he made her do for exactly as long, I can't see how your husband has any ground to stand on.\n\nOtherwise, your son still comes out ahead from having lied and manipulated his little sister.\n\nNTA.",
            "score": 58,
            "author": "bigcup321"
        },
        {
            "level": 0,
            "comment": "NTA, if anything, it's a light set of consequences for someone who lacks integrity and takes advantage of someone more vulnerable than himself. \n\nSince your daughter was doing double duty for 36 days, have you given her a break? I hope at least half of her chores for the next month are redistributed to her brother.",
            "score": 48,
            "author": "Camie-Gee",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m giving her the option of having a 36 day break or get extra allowance. We have a rule of you do an extra chore you get .5 So she either gets an month off or 145 dollars. I’m counting all the chores she did not just her brothers\n\nShe is thinking over it, I think she will pick the cash since she wanted a new board game but I’ll find out tonight",
                    "score": 84,
                    "author": "NecessaryFix7058",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I like the way you parent. :-)",
                            "score": 35,
                            "author": "Camie-Gee"
                        },
                        {
                            "level": 2,
                            "comment": "What about him, though? How does this teach him more than not to get caught? I really think you're going too easy on him. Integrity is not some trivial matter.",
                            "score": 3,
                            "author": "Hefty-Ad-3684"
                        },
                        {
                            "level": 2,
                            "comment": "Shouldn't you just count her brothers?  \nAfter all your rule is if you do extra..her chores are chores she would have done anyway.",
                            "score": 1,
                            "author": "AnxietyElectronic232"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "nta  but I would have made your son do his and his sister's chores for the next 36 days (or maybe even the whole summer holidays)\n\nthat way your daughter kind of gets compensated for doing his work by having more free time",
            "score": 47,
            "author": "Amerdale13",
            "replies": [
                {
                    "level": 1,
                    "comment": "Per OP she is getting compensated with either a 36-day break or a pretty significant extra allowance- her choice.  Either way son still has to do the chores for manipulating his younger sister.",
                    "score": 23,
                    "author": "RuthlessBenedict"
                },
                {
                    "level": 1,
                    "comment": "This is the most fair way to deal with this.\n\nEdit: NTA.",
                    "score": 9,
                    "author": "thezomber"
                },
                {
                    "level": 1,
                    "comment": "Sister may not want brother cleaning her room (assuming that is one of her chores).\n\nI agree any common area chore of the sister should fall to the brother.",
                    "score": 7,
                    "author": "Intelligent_Yam_3609"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA  300 sounds like a lot, but the way you explained it, 20 minutes for 4, puts it in a different light. You son did wrong and deserves the punishment.",
            "score": 40,
            "author": "ConfidenceIll8753",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, that’s the average. This week is dust bunny week so lots of dusting so it really didn’t take them long this week. I try not to put time consuming tasks together",
                    "score": 29,
                    "author": "NecessaryFix7058"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Seems fair. \n\nThe daughter did 300 extra chores, shouldn't she get a break?\n\nAlso, tell your son these are his \"300 labors\" and make it sound cool. \n\nNTA.",
            "score": 42,
            "author": "SatisfactoryLoaf",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why make it sound cool, it's a punishment, it's not supposed to be cool.",
                    "score": 22,
                    "author": "lyindog"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I didn’t even read this, because of the third line down, *people sweep their fucking carpets???*",
            "score": 26,
            "author": "iamsleepy42",
            "replies": [
                {
                    "level": 1,
                    "comment": "Let me clarify, we have outdoor rugs and carpet stuff. They are made from plastic or other hard materials so you sweep them and not vacuum",
                    "score": 34,
                    "author": "NecessaryFix7058",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I get it… many years ago I had 4 parrots and a finch aviary, and running the vacuum late at night when I was off work (off at 11) wasn’t an option at the apartment.  I love my carpet sweeper!",
                            "score": 8,
                            "author": "jesrp1284"
                        },
                        {
                            "level": 2,
                            "comment": "thanks for clarifying, im from the UK and i haven’t heard of that before. By the way NTA.",
                            "score": 3,
                            "author": "iamsleepy42",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I live in the UK and my husband sweeps our carpet. Weirds me out but what can you do. We always just used the vacuum growing up",
                                    "score": 2,
                                    "author": "Tinuviel52",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’ve always used the vacuum. I remember in school we had a kind of box on a stick which would sweep stuff into the box? In OP’s scenario i’m imaging just a…broom on the carpet, which *still* doesn’t make all that much sense to me 😂",
                                            "score": 1,
                                            "author": "iamsleepy42"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I will say sweeping carpets is a lot harder than it sounds. At least OPs should be easier if it's unable to be vacuumed",
                    "score": 3,
                    "author": "No-Appearance1145"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA \n\nHe could have done the chores spread out over 36 days like he was supposed to\n\nBut he didn´t, he lied and tricked his sister instead\n\nSo now he has to do all the chores at one time.  Makes sense to me",
            "score": 23,
            "author": "Crafty_Dog_4674",
            "replies": [
                {
                    "level": 1,
                    "comment": "He doesn’t have to do them all at once, he gets his sisters chores for 36 days plus some extra, just like he did to her. It’s a very fair punishment for being so manipulative.",
                    "score": 7,
                    "author": "167119114"
                },
                {
                    "level": 1,
                    "comment": "He doesn’t have to do them all at once, he gets his sisters chores for 36 days plus some extra, just like he did to her. It’s a very fair punishment for being so manipulative.",
                    "score": 2,
                    "author": "167119114",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was agreeing with her, it wasn´t sarcastic. I think it is fair too :)",
                            "score": 2,
                            "author": "Crafty_Dog_4674"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA. You're making him do more chores to make up for what he did to your daughter. I don't get why your husband doesn't see that.",
            "score": 16,
            "author": "Strayato"
        },
        {
            "level": 0,
            "comment": "NTA - I'm not totally following how much time he has to do these 300 chores. It seems fair that he could be doing the same double chores as his sister did in the same amount of time. If that is an option and you are simply giving him the option of doing them all in one weekend, that's fine. If he has to do them nonstop all weekend long, that might be excessive. I'm not sure what kind of chores you could even have where he could do them non-stop 300 in a row, so it's a bit unclear.",
            "score": 12,
            "author": "frasc442751",
            "replies": [
                {
                    "level": 1,
                    "comment": "Needs to be done by the end of the month, also since summer is here he got plenty of time. He could probably get it done in a weekend if he really tried. Pretty easy to group together, got the vacuum out do all the vacuum chores,",
                    "score": 21,
                    "author": "NecessaryFix7058",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then it sounds fair to me - he seemed to think it was fair to do to his sister.",
                            "score": 16,
                            "author": "frasc442751",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep. I would bring that up every time he or husband try to cry about how unfair it is",
                                    "score": 6,
                                    "author": "zombiedinocorn"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Cramming that much into 3 weeks seems a but much.  Not even 4.  Even if he is taking over some of the sisters chores.  Seems like youd have to have busy work just to make it up in that time period",
                            "score": 2,
                            "author": "RandomGuy_81",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cheaters shouldn’t profit from their actions and you are 100% correct. NTA. Why does your husband think it’s okay for your daughter to be victimized by this AH. Let him learn .",
            "score": 13,
            "author": "Ornery-Ticket834",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why did it take 36 days for the daughter to ask a parent why she was being given double chores?  \n\n\nDoes that sound weird to anyone else?",
                    "score": 4,
                    "author": "AnxietyElectronic232"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA that sounds totally fair, and will teach him the lesson to not lie and pawn his work off onto his sister.",
            "score": 13,
            "author": "Jerseygirl2468"
        },
        {
            "level": 0,
            "comment": "\nNTA. He should make 288 chores, I guess the last 12 could be so he learns he can't do this kind of stuff to his sister. Why does your husband has an issue with it? Is he unable to calculate? Angry for 12 more chores ? Or he expects men to have less chores to do ? What is your division of chores as adults ? Is it equal or are you doing more? Do you carry all the mental load ? Because I really can't understand why he think it's too much",
            "score": 11,
            "author": "Comprehensive_Fly350",
            "replies": [
                {
                    "level": 1,
                    "comment": "Its interest",
                    "score": 8,
                    "author": "CYBERPOLICEBACKTRACE"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA.  As I understand it, you are wanting him to experience the exact same thing he inflicted on his sister.  That's okay by my logic and hopefully will discourage his doing this again.  Of course the worst part is that he lied to her to get her to do this.  Your husband, hopefully, did not let your son know that he thinks the consequences are too severe as he needs to support you on this.",
            "score": 10,
            "author": "Realistic_Head4279"
        },
        {
            "level": 0,
            "comment": "The only problem I have is that there is absolutely no mention of son apologising to the daughter for lying and manipulating her.\n\nSteps in her shoes aren't much of a punishment. What about the consequences of lying?\n\nHusband reaction is awful. Where is the sympathy for his daughter? His daughter was taken advantage of. Feels like his favourite is the son, or does taking advantage of family does not count?",
            "score": 10,
            "author": "AmIarealbunny"
        },
        {
            "level": 0,
            "comment": "NTA \n\nHe is paying back their sister for the chores she did for him.",
            "score": 9,
            "author": "RsHoneyBadger"
        },
        {
            "level": 0,
            "comment": "NTA. Does your husband know about what your son did to his sister? Or does he think it's not a big deal cuz his son's a kid and \"boys will be boys?\" But when the same happens to his son, it's \"going too far?\"\n\nHe's really failing both his kids rn by teaching his son that house chores are \"women's work\" and that if you mistreat them it's okay, but also teaching his daughter that she should just accept mistreatment from the men in her life and that he will not protect her if she is mistreated. \n\nHe needs a reality check and some therapy. Don't teach the same lesson to your children by reinforcing his behavior",
            "score": 7,
            "author": "zombiedinocorn",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah and I have a feeling that the son has gotten away with other things thanks to dad and maybe the partner doesn’t know.",
                    "score": 3,
                    "author": "spnip",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Good point. OP should have a solo talk with her daughter",
                            "score": 5,
                            "author": "zombiedinocorn"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm not sure. It's a punishment, it would not be mine. I would have let him done the daughters chores for a month or so, that's it. Or I would have let the daughter pick a couple of course for him to do, so she gets to be in control. \n\nThe thing that I don't really like here, is that you and your husband didn't discuss this in advance. I think you as a couple should have decided the right punishment, not you by yourself",
            "score": 6,
            "author": "HairyCallahan",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree. The parents should have discussed this &amp; decided together how to handle it. \n\nThere seem to be communication problems in this family. It’s odd to me that the daughter continued to do all those extra chores for so long before speaking up, &amp; the parents had no idea - never knew or noticed - that she was doing all that double duty. And I haven’t seen anything about the son being told to apologize to his sister. That absolutely should have happened. \n\nHaving kids do chores and learn responsibility is great, so kudos for that.",
                    "score": 2,
                    "author": "NYDancer4444"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA.  Fair is fair.  This is how lessons are learned.  Time to pay back the loan.",
            "score": 6,
            "author": "OutrageousLuck4231"
        },
        {
            "level": 0,
            "comment": "NTA. very fair punishment., Unlike many parents who post here who go to the nuclear option and cancel special birthday parties or vacations. Your punishment is fair and measured, perhaps even a little light as it reimburses your daughter for the chores he tricked her into doing, but does not really take into account the pain of being lied to by her brother. If it was me, he would have to do double the amount of chores he tricked her into doing.",
            "score": 6,
            "author": "TheOneGecko"
        },
        {
            "level": 0,
            "comment": "NTA \n\nYou need to teach him that life sucks when people shirk their duties off on others! Smh \n\nTell your husband his favoritism is showing.",
            "score": 5,
            "author": "Dense-Store8986"
        },
        {
            "level": 0,
            "comment": "What you did was name a really big number, which makes your son feel overwhelmed at the number and also focuses on that rather than the fact that what he did was wrong. If you had worded it \"You will be doing your sister's chores for 2 months\" and then had a conversation about why lying is wrong, tricking a sibling is wrong, etc. \n\nThat said, aside from the wording issue, NTA. It sounds like a reasonable punishment.",
            "score": 5,
            "author": "Constellation-88",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "He would be doing the same amount plus 12 extra in one month. That’s totally doable, given that the daughter was able to do it by herself.",
                    "score": 2,
                    "author": "167119114"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA. Good for you putting your foot down against your husband. Not making things equal will only teach your son that he can get a girl to take care of house labour and it will teach your daughter that if she doesn’t do it, it won’t get done because the men aren’t held to the same standards as she is.",
            "score": 3,
            "author": "Starlot"
        },
        {
            "level": 0,
            "comment": "NTA. When I was in college I had a group project with this dude. He never showed up never did a darn thing for the project. At the end of the semester I took proof of this to the professor. Proof of me trying all semester to get him to do his share or at least meet up with him. \n\nHe got a 0 for our biggest project for the course because he didn't do any work. And as far as I know had to retake the entire class. \n\nYour kid will make the same mistake if he doesn't learn to take care of his own responsibilities. He also lied about you, which is absolutely unacceptable.",
            "score": 3,
            "author": "dasbarr"
        },
        {
            "level": 0,
            "comment": "Your son is a liar and he manipulated your daughter..  might want to explain to your husband, these aren't good qualities in a person.  NTA",
            "score": 3,
            "author": "tnebteg456"
        },
        {
            "level": 0,
            "comment": "If I were you I would sit down with your husband, sooner rather than later, and discuss why he is more upset about your son being punished for something he did than the fact that he lied to your daughter to get out of his responsibilities. Favoritism and misogyny are not good looks.",
            "score": 3,
            "author": "StagnationKills"
        },
        {
            "level": 0,
            "comment": "NTA, but I’m confused as to how your son was able to lie to your daughter and she was doing extra chores without you or your spouse noticing? I know you said you were at work but who is at home with them when they do chores?",
            "score": 3,
            "author": "threefrogsonalog",
            "replies": [
                {
                    "level": 1,
                    "comment": "And why it took over a month for the daughter to tell either of her parents about it?",
                    "score": 3,
                    "author": "AnxietyElectronic232"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; We have a chore chart, my three children have to 4 chores a day\n\nMaybe try actual parenting instead of \"chore charts\"",
            "score": 3,
            "author": "JustAContactAgent"
        },
        {
            "level": 0,
            "comment": "I will probably get downvoted for this, but here it goes:\n\nYTA.\n\nKids are not your slaves. Yes, we need to teach them how-to and the whys of household maintenance, but this isnt the wild wild west where we need every able farmhand to work the land. Obviously, your kids consider it punishing enough that 1) your son would find a way to pawn it off and 2) your daughter would be hurt by the \\[increased\\] workload. This is further evidenced by the fact that even your husband agrees the Puritan Chore Checklist has gone too far.\n\nHow about just letting them be kids? Life is shitty enough as a adult, you dont need to take away their childhood too.\n\nThat 20 minutes could be better spent doing something enriching for their lives long term, rather than sweeping because your too cheap to get a roomba.\n\n**And for the downvoters- from RULE 2, \"DON'T DOWNVOTE COMMENTS YOU DISAGREE WITH. Downvotes should be reserved for off-topic discussions or spam\"**",
            "score": 1,
            "author": "Survive1014",
            "replies": [
                {
                    "level": 1,
                    "comment": "the fact that it’s almost 300 chores the kid didn’t do in only 36 days seems ridiculously excessive.\ni don’t get why majority are okay with this?\nlike yeah he needs to be “punished” in some way for lying and making his sister do them instead, obviously - but christ, why are the kids doing so many chores in the first place?\nit just seems really over the top.",
                    "score": 1,
                    "author": "virgomoongloss"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is a weird, strict way to run a household. YTA",
            "score": 3,
            "author": "shaunibauni"
        },
        {
            "level": 0,
            "comment": "NTA.  You are diving the chores fairly, and the only way in which you would be TA is if you back down with making your son complete the chores.",
            "score": 2,
            "author": "jesrp1284"
        },
        {
            "level": 0,
            "comment": "NTA. I think this is absolutely fair play. On top of getting out of doing chores, the way he went about it was scummy. He should make up for both not doing chores and for manipulating a younger kid. That makes it worse than just being plain lazy and not doing them in my book.",
            "score": 2,
            "author": "RuthlessBenedict"
        },
        {
            "level": 0,
            "comment": "NTA. It's fair restitution. Honestly, he's lucky he didn't get \"punitive damages\" on top of it. I'm sure 300 sounds like an insurmountable amount to a child, but actually, he might learn a good lesson about how you can accomplish big things if you keep at them a bit at a time.",
            "score": 2,
            "author": "pavilionaire2022"
        },
        {
            "level": 0,
            "comment": "NTA. This seems like a fitting punishment for what your son did. If anything, it’s a pretty light punishment considering it’s basically just what he did to his sister without much added to atone for him lying and making her do his work. What does your husband think he should be doing?",
            "score": 2,
            "author": "GenericAnnonymous"
        },
        {
            "level": 0,
            "comment": "Nta. That sounds like a very clever way of making the punishment fit the crime.",
            "score": 2,
            "author": "StagnationKills",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep. NTA.",
                    "score": 1,
                    "author": "yobaby123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nta if he pushed his chores onto her for a month, then he gets her chores for a month.  If he complains about it beong to much ask him 'why is it to much for you, but you don't think it was to much for her?'",
            "score": 2,
            "author": "No-Locksmith-8590"
        },
        {
            "level": 0,
            "comment": "NTA. The punishment fits the crime.",
            "score": 2,
            "author": "MarketingArtistic925",
            "replies": [
                {
                    "level": 1,
                    "comment": "And even if it didn’t he learns the value of hard work.",
                    "score": 1,
                    "author": "yobaby123"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mathematically, this feels fair.  NTA  Good lesson for the kiddo to learn - cutting corners now can create problems later.",
            "score": 2,
            "author": "CatDog4565"
        },
        {
            "level": 0,
            "comment": "He should do his chores and hers for the same amount of time he had her do his, PLUS 50%.",
            "score": 2,
            "author": "WVPrepper"
        },
        {
            "level": 0,
            "comment": "NTA you need to teach your kid to pull his own weight.  Your husband is an asshole if he tried to counteract the punishment in front of the kid. \n\nIn a perfect world the punishment should have been hashed out between the parents before it was handed down; raising kids isn’t perfect and  once the punishment is handed down the other parent has to back up their partner.",
            "score": 2,
            "author": "todaysmark"
        },
        {
            "level": 0,
            "comment": "NTA omg someone give this woman mom of the year. I WISH my mom had done this to keep things fair and balanced. It's not going overboard he's literally doing what he's tricked his sister into doing for the past month. Kudos! Seriously if he gets away with this it teaches not just him but all the other kids which lines they can cross and get away with.",
            "score": 2,
            "author": "Girmillion"
        },
        {
            "level": 0,
            "comment": "The chores are roughly five minutes each, so 300 would add between 45 minutes and an hour a day to his chores. This seems fair tbh. This should be a good lesson for him.",
            "score": 2,
            "author": "CreedTheDawg"
        },
        {
            "level": 0,
            "comment": "I don't understand: why not have him do his sister's chores for a month plus a bit extra? That would teach him about restitution",
            "score": 2,
            "author": "WithEyesWideOpen",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA\n\n I was hesitant because that seems excessive on the face of it, but it's mathematically correct (technically it should be closer to 400 but 300 is a sufficienly high number). One child should not get off light at the others' expense. If you dont make his punishment fair (i.e. reflective of how much he took advantage of the daughter) then BOTH children will learn a harmful lesson.\n\nYour son will learn that the consequences dont outweigh bad behavior.\n\nYour daughter will learn that she can be mistreated and the person who did it will get off easy.\n\nRemember: Punishments are SUPPOSED TO BE UPSETTING. If they arent, they arent punishments.",
            "score": 2,
            "author": "timehoodie6969"
        },
        {
            "level": 0,
            "comment": "Sooo.... Do you do anything? Psh",
            "score": 2,
            "author": "Traditional_Force959"
        },
        {
            "level": 0,
            "comment": "NTA and honestly an invaluable lesson for him to learn not to treat the girls/women in his life like that",
            "score": 2,
            "author": "Amandicorn_lyns"
        },
        {
            "level": 0,
            "comment": "I don’t see why it should be her extra allowance OR days off. She did his chores for a month and he got the days off and extra allowance that he shouldn’t have recieved. He shouldn’t get allowance for the month and he should be doing double chores that would be fair",
            "score": 2,
            "author": "blockyhelp"
        },
        {
            "level": 0,
            "comment": "Yes you are. Ridiculous",
            "score": 2,
            "author": "Early_Swan_5077"
        },
        {
            "level": 0,
            "comment": "Yta. Your math is wrong. He gave her 4 chores for a little over a month. You are counting the chores THAT SHE WAS SUPPOSED TO DO AS HER OWN. That's double dipping. \n36x4=144.  You said you were deducting his 4 a day from that amount. If that true, your math is wrong",
            "score": 2,
            "author": "misskelly08"
        },
        {
            "level": 0,
            "comment": "NTA, but I would have done it slightly different: I would have made him do the daily 4 chores of his sister extra on top of his own for a month (the month that he had his siater do his chores). That way you would link his punishment directly to what he did wrong AND sister would be 're-imbursed' for what she did double.",
            "score": 2,
            "author": "ValeNova"
        },
        {
            "level": 0,
            "comment": "NTA. Kids a brat and privileged. He sounds like he's close to being a teen or is a teen, where chores stop being chores and he needs to just start cleaning up because that what human beings do because we have to. Chore lists are great for children who are learning to share responsibility and need to understand that they should clean up after themselves. He is old enough where he should be cleaning and helping because it's the right thing to do.",
            "score": 2,
            "author": "PMmeProgressPics"
        },
        {
            "level": 0,
            "comment": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nWe have a chore chart, my three children have to 4 chores a day, they aren’t hard, like make you bed or sweep you carpet. If you get too them when you get home it takes usually 20 minutes in all. Every kid has different chores depending on age, can’t have the 7 year old take the kitchen trash out. It works really well overall and they can see there four chores each day for the month.\n\nMy son has been pawing of his chores to his youngest sister 12. So she basically has been doing 8 chores a day. My daughter came to me upset not understanding why I was giving his chores to her. I wasn’t she was lied to by him and since they usually do them when I am at work I didn’t notice.\n\nSo as a punishment since he had her due his chores for about a little over a month (36 days) He has to do 300 chores on top of his chores already. Since that basically the amount she has been doing for the time that month. He was not happy but really if he just does a  ton of cleaning on the weekend it won’t be that horrible, and some chores overlap.\n\nMy husband hear about it and claims I am going overboard. That it is an upsetting amount. He tried to retract the punishment but I put my foot down. AITA is this too kich\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "NTA\n\nRaise your kids how you want them. Is 300 excessive? Maybe. I’m sure there is a compromise in there somewhere.",
            "score": 1,
            "author": "Thediciplematt"
        },
        {
            "level": 0,
            "comment": "You messed up mom!!!! You made a reasonable punishment (4 weeks restitution) sound like slavery (300 chores). NTA Maybe reframe it, but stick to your guns!",
            "score": 1,
            "author": "Cabbage_Patch_Itch"
        },
        {
            "level": 0,
            "comment": "NTA BUT\n\nI can understand someone being upset at you unilaterally dealing the punishment though.\n\nAlso, this current set up seems more appropriate for younger kids. You should adapt it for the teenagers because otherwise you're infantilising them and setting them up to fail as soon as they leave home. Especially within their personal spaces. At least two of your kids are at the age where they can start to self manage and be more integrative with household chores without you having to outline it and break it down by daily expectations.",
            "score": 2,
            "author": "Yunan94"
        },
        {
            "level": 0,
            "comment": "NTA what you’re doing is mostly just evening things out I’d also make him come up with a way to make amends with her.",
            "score": 1,
            "author": "RohMP"
        },
        {
            "level": 0,
            "comment": "NTA",
            "score": 1,
            "author": "Longjumping_Froggo19"
        },
        {
            "level": 0,
            "comment": "If she gets extra allowance, it should come from him. Even if he hast to do more chores to earn it. You paying \nher off isn’t teaching him anything at all.\n You’re the adult, you can also get a quarter of the way, 1/3 of the way, half of the way, 3/4 of the way, through those chores and if his attitude is good say well I think you’ve done enough to get the point. And if his attitude is less than contrite or civil tell him that you Can always add to the chart if he’d like you to.",
            "score": 1,
            "author": "Silver-Raspberry-723",
            "replies": [
                {
                    "level": 1,
                    "comment": "Don't punish him twice.\n\nIF she takes the money, and it comes from him, he shouldn't get extra chores.\n\nLikewise, if he gets extra chores, he shouldn't be paying her extra.",
                    "score": 1,
                    "author": "AnxietyElectronic232",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I see your point thanks that would be double dipping because she would’ve been compensated and he would’ve been punished twice.",
                            "score": 2,
                            "author": "Silver-Raspberry-723"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How does one sweep the carpet?",
            "score": 1,
            "author": "External_Low9207",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably a flat carpet with one of the those [hand carpet sweepers](https://www.google.com/search?q=carpet+sweeper&amp;rlz=1C1EJFC_enUS976US977&amp;oq=carpet+sweep&amp;gs_lcrp=EgZjaHJvbWUqCggAEAAYsQMYgAQyCggAEAAYsQMYgAQyBggBEEUYOTIHCAIQABiABDIHCAMQABiABDIHCAQQABiABDIHCAUQABiABDIHCAYQABiABDIHCAcQABiABDIHCAgQABiABDIHCAkQABiABNIBCDIxOTFqMGo3qAIAsAIA&amp;sourceid=chrome&amp;ie=UTF-8).",
                    "score": 1,
                    "author": "Survive1014"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA your son fucked around and now it’s time for him to find out. Ask your husband why he’s ok with his daughter doing his sons work and his son faces zero consequences?",
            "score": 1,
            "author": "TheBearyPotter"
        },
        {
            "level": 0,
            "comment": "Nta",
            "score": 1,
            "author": "Inevitable_Act5504"
        },
        {
            "level": 0,
            "comment": "Nta, a great way to teach your son a lesson. He deserves to have consequences and taught about entitlement",
            "score": 1,
            "author": "Long-Relationship214"
        },
        {
            "level": 0,
            "comment": "NTA your son was a jerk to his sister",
            "score": 1,
            "author": "ZealousidealRice8461"
        },
        {
            "level": 0,
            "comment": "The chores are roughly five minutes each, so 300 would add between 45 minutes and an hour a day to his chores. This seems fair tbh. This should be a good lesson for him.",
            "score": 1,
            "author": "CreedTheDawg"
        },
        {
            "level": 0,
            "comment": "NTA \n\nThat sounds reasonable. It's just household chores. It's not like you sentenced him to 30 years hard labor.",
            "score": 1,
            "author": "LtColShinySides"
        },
        {
            "level": 0,
            "comment": "NTA. It's time he learned that actions have consequences.",
            "score": 1,
            "author": "LaCaffeinata"
        },
        {
            "level": 0,
            "comment": "NTA\n\nI mean, this is a lesson for him. If you try to be lazy and pawn off your tasks by lying to people, it will come back to bite you in the ass. I think it's a pretty fitting punishment, especially since he has time to finish it.",
            "score": 1,
            "author": "pinklemonaid396"
        },
        {
            "level": 0,
            "comment": "NTA\n\nThat is a very creative and not at all unfair punishment! this will definitely show him that doing just the couple chores assigned is not nearly as bad as all of them... as well as teach him to not use his siter like that or lie!",
            "score": 1,
            "author": "SuchYogurtcloset6818"
        },
        {
            "level": 0,
            "comment": "Nta.  The scammer should have payback..",
            "score": 1,
            "author": "Jean19812"
        },
        {
            "level": 0,
            "comment": "nta.. he   pushed his work off onto sister.  so now her work gets added to his.  \n\n\nif your husband THINKS  it is okay for his son to take advantage of his little sister, i would be sitting down and having a long talk to him.",
            "score": 1,
            "author": "Gypsy-Nyx"
        },
        {
            "level": 0,
            "comment": "We got way worse when we were kids man, for doing way less. I think you know you aren't the asshole here.",
            "score": 1,
            "author": "Massive_Dentist2633"
        },
        {
            "level": 0,
            "comment": "Make him do his and her chores for 36 days",
            "score": 1,
            "author": "FullTimeToastedBread"
        },
        {
            "level": 0,
            "comment": "NTA. A perfectly fair punishment. I wouldn't pay him allowance for them...",
            "score": 1,
            "author": "Kinch_g"
        },
        {
            "level": 0,
            "comment": "NTA. A perfectly fair punishment. I wouldn't pay him allowance for them...",
            "score": 1,
            "author": "Kinch_g"
        },
        {
            "level": 0,
            "comment": "NTA. I think this is fair.",
            "score": 1,
            "author": "mountebank_eyes"
        },
        {
            "level": 0,
            "comment": "NTA. That's about the most appropriate punishment you could possibly have given your son.",
            "score": 1,
            "author": "GenghisQuan2571"
        },
        {
            "level": 0,
            "comment": " NTA. How is you husband saying you went overboard when the kid made his sister to that amount of chores??? I’m getting the feeling he did this because dad has tried to protects him before from punishments.",
            "score": 1,
            "author": "spnip"
        },
        {
            "level": 0,
            "comment": "NTA. I wasn't really following the math, but 8 chores a day multiplied by 30 days in a month equals 240 chores. So it makes sense to me.",
            "score": 1,
            "author": "Proof-Elevator-7590"
        },
        {
            "level": 0,
            "comment": "NTA. \n\nContinue being fair to your children. If one takes advantage, they need to see that there are consequences. Your son may not appreciate it, but your daughter will.",
            "score": 1,
            "author": "Busy_Marsupial_1811"
        },
        {
            "level": 0,
            "comment": "NTA. This is a fair punishment that fits the crime. Be careful tho that this doesn't make him double-down on not doing housework because he's gonna be real salty about the whole thing, and also keep an eye out he doesn't take it out on his sister.",
            "score": 1,
            "author": "TheRealBeelzebabs"
        },
        {
            "level": 0,
            "comment": "NTA.  4 of his chores for 36 days is 144. (the other 4 chores each day were your daughter's own, so they shouldn't count in this). 300 is about double the number of chores he made her do.  For consistently lying to her for more than a month?  I think that's reasonable.   It doesn't sound like the chores you give them are anything other than normal household tasks.  He won't die, even if he thinks he will.",
            "score": 1,
            "author": "Owned_By_3_Kittehs"
        },
        {
            "level": 0,
            "comment": "Nta and good mama making that smart little dude face consequences",
            "score": 1,
            "author": "Kipzibrush"
        },
        {
            "level": 0,
            "comment": "NTA \n\nHowever it’s going to feel extremely unfair to a child to hear that they have 300 chores. What you should have done instead is tell your child they have to do their chores and their siblings chores for the month. \n\nWhat kind of a reaction did you think you were going to get?",
            "score": 1,
            "author": "TheFinePrint85"
        },
        {
            "level": 0,
            "comment": "NTA.\n\nSounds reasonable to me.",
            "score": 1,
            "author": "RandomLurker04"
        }
    ]
}