{
    "id": "1459a31",
    "score": 71,
    "title": "AITA for not allowing plus-ones at my rehearsal dinner?",
    "author": "[deleted]",
    "date": 1686326852.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1459a31",
    "media_urls": [],
    "other_urls": [],
    "postText": "\nNot to be just another wedding post, but I am getting married in a few months and am planning the rehearsal dinner. I was pretty weak when it came to guest list and it ballooned from around 100 people to over 200 (including plus ones). \n\nA little back story, I recently took a huge pay cut and while my fiancé does well, we still wanted to keep our budget. So we are having the wedding in my fiancés hometown which will be cheaper than where we live now and it’s about 2 hours away. That being said, I was going to be firm about the rehearsal dinner being for immediate family and participants in the wedding only.  \n\nWhen I told one of my bridesmaids the details she got VERY upset she couldn’t bring her fiancé and how I was being rude for not including him. When I explained that we wanted things to be more intimate so no one was getting a plus one to the dinner she reasoned that since they took off work to come early they should both be allowed to come. I never asked them to take off work since I’m not even taking off the day before (new job, no time off). She also said that it was rude of me to just expect him to sit in the hotel for a few hours in a city he’s not familiar with. \n\nShe is also getting married soon and always complains about how her fiancés family is pressuring her to have an expensive wedding and always comparing their wedding to others’. And I feel that is what she is doing to me here. \n\nI feel that she is my friend, not him. And while I know he’s an extension of her, I’ll get plenty of time to spend with both of them at the actual wedding. \n\nAITA for wanting to keep this one part of the wedding on the smaller side and not include plus-ones for the bridal party at the rehearsal dinner?",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n &gt; I wasn’t going to allow plus-ones for the bridal party at my rehearsal dinner and I’m being told that may be rude since people are driving 2 hours to come to the wedding.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "score": 1,
            "author": "Judgement_Bot_AITA"
        },
        {
            "level": 0,
            "comment": "Unfortunately I’m going to have to say YTA here.\n\nPersonally, I think it’s weird and rude to invite someone to the rehearsal dinner without their date who is invited to the wedding, but I googled the etiquette of that and it seems to be debatable. But it’s not really debatable that long term partners and spouses aren’t ‘plus ones’ in the usual sense. If someone is invited to the rehearsal dinner, their fiancé definitely should be too. And the reasons she brought up are why— this person has traveled to your wedding weekend and should be invited to all the events their partner is invited to.",
            "score": 205,
            "author": "Outrageously_Penguin",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree with this 100%. I've been in both situations, the \"plus one\" of someone in the wedding party, and the member OF the wedding party, who has a \"plus one\" Every time, BOTH of us were included in the rehearsal dinner.",
                    "score": 47,
                    "author": "siamesecat1935",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Opposite for me. I’ve never seen plus ones at rehearsal dinners. Wedding party and immediate family only",
                            "score": 24,
                            "author": "itsathrowawayduhhhhh",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I find this basically impossible to believe. You’ve never seen a wedding party member attend a rehearsal dinner with their fiancé, long term partner or spouse? Have you not been to many?",
                                    "score": 23,
                                    "author": "Outrageously_Penguin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nope, I really haven’t. I have been to a few….maybe it’s just in my little world that this is how it goes. Shrug",
                                            "score": 0,
                                            "author": "itsathrowawayduhhhhh",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Curious where you’re from?",
                                                    "score": 5,
                                                    "author": "Outrageously_Penguin",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Midwest USA",
                                                            "score": -3,
                                                            "author": "itsathrowawayduhhhhh"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Same here, every one I’ve been to is immediate family and wedding party, as we typically went to the dinner directly after rehearsal.",
                                    "score": 13,
                                    "author": "Derwin0"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Same, where I’m from everyone would be very confused and possibly offended if SOs weren’t invited to the rehearsal dinner.",
                            "score": 11,
                            "author": "BucketsGotMarried"
                        },
                        {
                            "level": 2,
                            "comment": "That’s interesting. I’ve only been -in- a wedding once and I was like 6 years old lol (ring bearer) and I’ve been the SO if someone in a wedding twice. Once I was not invited to the dinner, another time I was but everyone had to pay their own tab. Never thought that was weird, but I am also admittedly practical to a fault",
                            "score": -4,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In my experience, the rehearsal dinner is for everyone who has traveled in from out of town, not just the family and wedding party, and all partners are included.",
                    "score": 7,
                    "author": "GothicGingerbread"
                },
                {
                    "level": 1,
                    "comment": "We were in a similar situation recently. One of my three young children was in the wedding party of a not immediate family member. The wedding was nearly ten hours away from our home.  My spouse, the one child, and I were invited to the rehearsal dinner, but the other children weren’t. We aren’t the type to let complete strangers watch our children, they aren’t old enough to stay alone at a hotel, and the only people coming to the wedding that my children would truly know wouldn’t land until after the dinner. \n\nSo we passed on the rehearsal dinner. Child practiced, but we had dinner as a family. \n\nI understood that it was their wedding and a big expense for the couple but missing work, expensive hotels (major event taking place that weekend made hotels scarce and expensive but wedding venue cheaper), travel expenses, wedding party clothing demands, etc were nearly enough to make me throw in the towel just on principle. I sucked it up for the extended family members involved, but we wouldn’t do it again, and it’s given me a bad taste in my mouth regarding them, and they didn’t seem impressed with us skipping the dinner either. \n\nI’m not sure how close you are to this friend, but you should consider if the money is worth the impact it sounds like it may have on the friendship.\n\n(Not that it really matters, but, for our rehearsal dinner, all extended family traveling in attended - including the bride I mentioned above - which is very much the norm for every wedding I’ve been involved in.)",
                    "score": 3,
                    "author": "Sad_Appearance4733",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree with you that is strange to leave some of your children out and not all. I would also interpret that as rude. And her fiancé is an adult, who can be in a hotel by himself for a few hours. We are pretty close, which is why I was surprised that she was so surprised I was taking this route. \n\nFor clarity we do have some (young) children in our wedding and of course their parents are invited to the dinner, since they will be attending and (at least) somewhat active at the rehearsal. And this is also a friend that routinely will always come around for the fun but never wants to be involved in the effort or finances for any given event\n\nWhat mostly stood out to me was that her reaction wasn’t regarding no plus ones, but that -she- couldn’t bring her fiancé. She was fine with it until it affected her.",
                            "score": -10,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "YTA, the two events are tied together.  So you can't plus one to the wedding and not the rehearsal dinner.  Also, the traditional rule is that everyone that travels gets an invite, not just the wedding party.  This is a bad place to save money.  I traveled to a wedding of neighbors that I grew up with.  There were 6 of us, my parents and 3 brothers (and me).  They only invited my parents to the rehearsal, I didn't mind a bit, but it was a thing for years.",
            "score": 64,
            "author": "cinnamngrl",
            "replies": [
                {
                    "level": 1,
                    "comment": "So just curious if 100 people are driving anywhere from 1-2 hours to attend I’m supposed to host them all? I just don’t really know anything about the whole wedding etiquette and I literally just want to be married lol but my fiancé wasn’t into eloping",
                    "score": -36,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That isn't what I said.  Clearly the bridesmaid date is spending the night before in town and was invited to the wedding.  It looks weird to exclude the wedding parties plus ones.",
                            "score": 39,
                            "author": "cinnamngrl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ok I just wanted to clarify, since I’ve also read on the internet that it’s “expected” that the couple hosts -all- out of towners at the rehearsal. I was looking at it more of like I wanted to spend this time with my bridal party and family, and plus ones aren’t part of that. And yeah sure money also plays a role but it’s not the deciding factor necessarily.",
                                    "score": -30,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You don’t need to host all out of towners. I have officiated more weddings than I can count and typically it is the bridal party and their partners, along with immediate family. However I have never been to one or the partners of the bridal party we’re not invited.",
                                            "score": 17,
                                            "author": "Revnorthwest"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It's not weird to have only the wedding party attend the rehearsal dinner. It's fine either way it just depends on what you(the one who is getting married) and your fiance(who is also getting married) want and how much you guys can afford to spend. The rest of the wedding party(EVERYONE ELSE WHO IS NOT GETTING MARRIED) should plan accordingly. The bridesmaid isn't paying for the wedding and it's not her special day so it's not her decision.",
                                            "score": -4,
                                            "author": "Zestyclose-Dig-2870"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Driving 2 hours is not out of town.",
                                            "score": -6,
                                            "author": "cinnamngrl",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "2 hours is absolutely out of town. That can put a lot of people in a whole different state",
                                                    "score": 11,
                                                    "author": "MagicHDx"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I guess I felt it since it wasn’t in the immediate vicinity of where we live it could be considered out of town",
                                                    "score": -7,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Dude I have never ever seen plus ones at rehearsal dinners!",
                                                            "score": -9,
                                                            "author": "itsathrowawayduhhhhh",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I have a couple times but maybe 50/50. it's wild that people think they should have more say about a wedding THAN THE TWO GETTING MARRIED. Absolutely boggles my mind.",
                                                                    "score": -1,
                                                                    "author": "Zestyclose-Dig-2870"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "YTA. \n\n&gt; She also said that it was rude of me to just expect him to sit in the hotel for a few hours in a city he’s not familiar with.\n\nShe is correct. Add +1s and go somewhere cheaper to reduce the cost.",
            "score": 56,
            "author": "mubi_merc"
        },
        {
            "level": 0,
            "comment": "YTA. It’s proper etiquette to invite the plus one of the wedding party to the rehearsal dinner. Your wedding party is spending money on dresses, suits, travel, hotel, hair, makeup, a gift, etc.",
            "score": 32,
            "author": "Me-323",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's also proper etiquette to not yell at your best friend about a decision she made about HER wedding. When the bridesmaid gets married she can make whatever rules she wants",
                    "score": -4,
                    "author": "Zestyclose-Dig-2870",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I must’ve missed the yelling part in the post…?",
                            "score": 12,
                            "author": "Me-323"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I understand the financial burden anything relating to a wedding can cause. We really wanted to make things as easy as possible for people. My fiancé and I went DIY for most things and everyone is doing their own hair and make-up. We chose bridesmaids dresses all under $100. And we even changed the bachelorette party so guests didn’t have to pay for anything they didn’t want to. \n\nI really do appreciate her and her fiancé (and everyone really) even traveling for this wedding which is why I was surprised she booked her hotel for days I wasn’t even going to be around because of work conflicts. And no one else in the party batted an eye at no plus ones. So that’s why I’m confused and conflicted",
                    "score": -10,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How many bridesmaids and groomsmen are you having, that all of them bringing their partners to your rehearsal dinner would be a financial burden???\n\nYTA, it's so inconsiderate when your bridesmaid is spending money on travel, accommodation, dress, shoes, bachelorette, shower and wedding gifts and god knows what else to make your day special, to not even invite her partner to the rehearsal dinner.",
                            "score": 6,
                            "author": "cat-lover76"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Recognizing that rehearsal dinner rules can vary, YTA.  Where I come from wedding party members include plus 1.",
            "score": 33,
            "author": "Walktothebrook"
        },
        {
            "level": 0,
            "comment": "YTA It's just tacky not to have the plus ones of the bridal party/groomsmen at the rehearsal dinner, especially when they traveled to be there.",
            "score": 25,
            "author": "eliida24"
        },
        {
            "level": 0,
            "comment": "YTA, I know that traditions are going by the wayside nowadays, but traditionally the rehearsal dinner includes plus ones, if they are invited to the wedding.  \n\nHere is a source for you.  Obviously, it is your decision, but still tacky.\n\nhttps://emilypost.com/advice/the-rehearsal-dinner#:\\~:text=The%20guest%20list%20at%20a,are%20not%20in%20the%20wedding",
            "score": 19,
            "author": "Stormy19611111",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’ve never had nor seen plus ones at rehearsal dinners",
                    "score": 0,
                    "author": "itsathrowawayduhhhhh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've done events for a livin for a while and never NOT seen plus ones for the wedding party at the rehearsal dinners...",
                            "score": 27,
                            "author": "J_JustJ0711",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is apparently a truly divided topic lol",
                                    "score": 2,
                                    "author": "itsathrowawayduhhhhh"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "As I said, traditions are going by the wayside!\n\nI have been to rehearsal dinners where neither my husband nor I were in the wedding party, but family of the bride or groom.",
                            "score": 2,
                            "author": "Stormy19611111"
                        },
                        {
                            "level": 2,
                            "comment": "same here",
                            "score": -1,
                            "author": "Derwin0"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's definitely in poor taste and tacky on a cringeworthy level. Wedding party plus ones are typically included for a reason. Snubbing them and making it harder on people that are traveling or planning is hella selfish. It's a dinner. It's the least ya can do for the people going out of their way for you\n\nYTA",
            "score": 19,
            "author": "J_JustJ0711",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cuz snubbing the people spending the most on you is hella disrespectful and goes against one of the main purposes of the dinner. \n\nWhat does that have to do with this conflict? Or are ya just pulling out random shit to try to make her look bad lmao...",
                            "score": 8,
                            "author": "J_JustJ0711",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No I guess I’m just confused how it’s a snub. I feel like that’d be not inviting her fiancé to the wedding at all. \nAnd I supposed just establishing that this has been an issue before. \nWe’re buying her and 20 other people dinner who are -in- the wedding, and then paying for everyone else’s food and alcohol the next day. Just not sure how that is snubbing, or tacky, or “cringey”.",
                                    "score": -2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's basic etiquette. Because it's for the people that will be actively participating in the wedding, the ones spending the most time n money on it. When they have a LTP that's by their side during the wedding prep n that's also traveling and spending their fair share of time n money...it's just polite to include them too.",
                                            "score": 3,
                                            "author": "J_JustJ0711"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "YTA. It is rude to your bridal party and their SO's. Good wedding etiquette is to include their plus ones in the rehearsal dinner. Not everyone needs to be traditional, but this just comes off as a cheap fuck you to them. They put enough into your wedding already to get that kind of treatment in return.",
            "score": 18,
            "author": "nailedbyjosalynvee",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just curious what put enough into it means to you? We asked everyone to come as they are if they so please. \nWe’ve spent thousands on DJ, photographer, food, etc. And my bridesmaid spent maybe $300 in total that includes dress, hotel, and gas for driving. Doing own makeup and my sister offered to do her hair. \n\nI don’t know. Just the whole expectation of going broke to impress people, to be polite or whatever, doesn’t make any sense since I never expected them to do anything they didn’t wanna do. I think I mentioned in another post somewhere it’s been our sisters who have done the most work, so to me it felt like a moochy fuck you from this bridesmaid.",
                    "score": -5,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Any rehearsal dinners I’ve been to have just been wedding party and family. So her request confuses me anyway. Usually the parents of the groom pay so why would they have to pay for all the extras?! NTA\n\nEdit: am I just an insanely weird person or something? Because sitting in a hotel by myself for a few hours sounds AWESOME and if I was her fiancé I’d be like byyyyyye have fun",
            "score": 15,
            "author": "itsathrowawayduhhhhh",
            "replies": [
                {
                    "level": 1,
                    "comment": "Especially if it's a Marriott and you want to use your Netflix!",
                    "score": 3,
                    "author": "Just-Another-Poster-"
                },
                {
                    "level": 1,
                    "comment": "Even if one of our parents offered I’d feel a bit guilty adding to the list simply because I’m not paying for it. We wanted to spend time with our party sorta like a “calm before the storm” that comes with having a 250+ wedding",
                    "score": 0,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What is the point of a rehearsal dinner? If you can't afford to do it properly, just focus on the main events. Excluding +1s is just not done\n\nEDIT: my opinion has changed - see below.",
            "score": 15,
            "author": "Sea-Horse1517",
            "replies": [
                {
                    "level": 1,
                    "comment": "To me the point is to thank the party and parents’ time for rehearsing. So if you’re not at the rehearsal, made sense to me that you wouldn’t be at dinner.",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It is to thank them for being in the wedding, including all the time and money they’ve spent.  And thank the SO for the time their bridal party is away from them.  Every rehearsal I’ve been to has included SO.",
                            "score": 7,
                            "author": "Kimkmk24"
                        },
                        {
                            "level": 2,
                            "comment": "Hi OP, not a Xtian and thought a rehearsal dinner is a prelude to the reception, didn't realise there's a rehearsal before the dinner! &lt;groan&gt;\n\nI agree with your logic. If +1s are not attending a rehearsal before the dinner, you can get away with not inviting them for this.",
                            "score": -8,
                            "author": "Sea-Horse1517",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nope, it’s standard for plus ones to attend rehearsal dinners. In some cases, the rehearsal dinner invites are opened to ALL out of town guests and their plus ones, although etiquette says it can be limited to just the rehearsal attendees and their guests and that’s fine.",
                                    "score": 5,
                                    "author": "throwaway456999678"
                                },
                                {
                                    "level": 3,
                                    "comment": "Appreciate the insight. Again, this is all so foreign to me and [obviously] a subject with a lot of opinions.",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "YTA. I’ve been to a TON of weddings and been a bridesmaid in eight, and the norm is to allow plus ones. You’re not going to be sitting next to her chatting all night, so it’s basic etiquette to ensure your friend has a guest to talk to. A rehearsal dinner is thrown as a generous thank you to your guests for putting so much time and effort into your special day, and instead you’re trying to cut corners. I get that costs are a REAL issue, but you cut flower or dress expenses over expense that affect your guests.",
            "score": 15,
            "author": "throwaway456999678",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes we cut costs where we could (not the bar of course since I believe cash bars are a travesty). I viewed it as exactly what’s in the name…rehearsal. If you’re not rehearsing I figured you’re not in the dinner. \nOutside of getting a hotel, this bridesmaid hasn’t done anything for the wedding at all, so my biggest thanks go to the core group that has sacrificed a lot and me and my fiancé will thank everyone that helped accordingly. \n\nI understand your point about having someone to talk since I can have a hard time socializing. My side of the party is a pretty tight so if anybody will not have someone to talk to it’d be her guest.",
                    "score": -3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "OP, it’s clear from your comment you still don’t get it. It’s a celebration of your guests, and it’s polite to extend a plus one. You also can’t judge someone else’s expenses or cost—it’s not a tit-for-tat, and anyway, every wedding I’ve been to has cost me more than just a hotel room (gas, logistics, taking up a full weekend during a very busy summer, meals there/back), and these costs also apply to plus 1s. Don’t be that person!",
                            "score": 8,
                            "author": "throwaway456999678",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s clear from -your- comment you’re confusing guests with the party. I view it as the  people that are taking extra time out to rehearse get the dinner. If it was really that inconvenient for them she didn’t haven’t to accept being in the wedding or the fiancés invitation to the wedding. I know it’s the summer, that’s why I’m not offended if people don’t wanna come at all. But of course, there’s people that do want to celebrate with us so yes we will entertain them at the reception. The way our families feel is that the wedding is about the couple, and yes you want to treat guests well with food and such, but ultimately it is about the couple. \n\nAnd I also really don’t want to be that person that’s gonna strain themselves financially for the sake of one or two days out of my entire life.",
                                    "score": -5,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No, I’m not. I’ve been to a TON of weddings and been in just as many, and what you’re doing would be considered rude. If you can’t afford it, have a smaller wedding party. You asked, which is why I’m providing honest feedback. If you don’t want to know, why post? I don’t think I can post links, but any quick google search confirms (look at brides.com, for example).",
                                            "score": 9,
                                            "author": "throwaway456999678"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah YTA if you’re willing to pay for drinks for 200 but not dinner for your loved ones’ loved ones.",
                            "score": 2,
                            "author": "badabingbadaboom3"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are you providing transportation for everyone to the town where thee rehearsal is ?  Is it the night before the wedding or a few nights before ?\n\nIf people in the wedding party are getting hotel rooms to stay for wedding weekend, I think it's rude to not have their dates at each event.\n\nThis is your bridesmaid's fiance, not her +1 date for the event.",
            "score": 11,
            "author": "JazzyKnowsBest13",
            "replies": [
                {
                    "level": 1,
                    "comment": "No transportation. My fiancé is from quite a large family that is spread all over so they were mostly just going to drive in the day of and may or may not being staying the night and leaving the next morning. The rehearsal is the night before since I couldn’t get off work for the day (which was an entirely different issue according to this bridesmaid). \nThe thing is she knows I’m strapped for cash and always claims to have my back regarding wedding decisions but then got so upset about this. Almost felt like I was getting bullied into it. And of course when I Google it, everything is so split. Like it’s only for party and family, to “invite everyone traveling” so I’m like lost on the subject",
                    "score": -6,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So you're strapped for cash and you expect your bridal attendants to all drive (without their partners) 2 hours to the rehearsal, 2 hours home that night, then repeat the process the next day ?  Or they can get a hotel and stay but have no dinner for their partner ?  Are you driving back and forth ?",
                            "score": 20,
                            "author": "JazzyKnowsBest13",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m staying with my MIL, who also offered to put a lot of people up but they wanted to get a hotel so I said ok. I originally suggested having the rehearsal the Saturday morning and then the ceremony after we got ready so people wouldn’t have to do so much driving or stay an extra night but I was very quickly vetoed by pretty much everyone.",
                                    "score": -1,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Is everyone in fiance's large family in the wedding ?",
                            "score": 5,
                            "author": "JazzyKnowsBest13",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No only a cousin and her sister, whom she is very close with. Doesn’t really talk at all to most of them. But had to invite them out of “etiquette”",
                                    "score": 0,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But you didn't invite the bridesmaid's fiance even though etiquette requires that?",
                                            "score": 5,
                                            "author": "JazzyKnowsBest13",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I mentioned I felt I was too weak regarding my MIL and adding more people (most of which was without our approval) and I felt going forward I needed to retake control of the budget and the planning. This is something I also talked with this friend at great lengths about and the whole time she supported me trimming where I could. \n\nShe even thought it was ridiculous that my MIL wanted to invite her BF to the dinner because “he’s not in the wedding” and suggested I kinda bring the hammer down on my MIL. He ended up having to work way but at that point in time I thought ok crisis averted",
                                                    "score": 0,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "YTA\n\n&amp;#x200B;\n\nExpect some bridesmaids to drop out of the wedding over that tacky and cheap behavior.",
            "score": 15,
            "author": "Capable_Fig3903",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol considering everyone else is aware and on board with it, sure. Petty thing to drop out over, especially since she knows how little money I make and has had my back until something didn’t go her way",
                    "score": 0,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So your friend has been incredibly supportive and had your back the whole time but you couldn’t even do this courtesy for them? I have a wedding coming up for my best friend. If we were in this situation you’d be dropped. You already admitted in the comments you don’t know anything about wedding etiquette so why are you making this your hill to die on when you aren’t confidently in the right?",
                            "score": 10,
                            "author": "ButterscotchOk4438",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not so much a hill to die on as trying to understand my friend’a perspective and I guess gathering knowledge. I was pretty confident since we had All our families’ support about the dinner. Her reaction made me reconsider since it was the first and only reaction of that type. \n\nAnd she’s been supportive in the sense of backing me up when I’ve had to talk to my MIL about who we should or shouldn’t invite, what to spend money on vs what to explore options on. And until now, that has been the biggest hiccup me and my fiancé have encountered. \n \nAnd tbh but dropping someone over a rehearsal dinner I think is a bit much, if she wants to throw away over 15 years of friendship over 3 hours her BF has to chill in a hotel tells me she’s changed quite a bit. And at her wedding if she tells me I can’t bring my wife because they’re doing party only I respect that decision. I understand it’s her wedding and she does what she wants. I’m not paying for it so who am I to tell her what to do ya know?",
                                    "score": -1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"since it was the first and only reaction of that type.\"\n\n&amp;#x200B;\n\nSo the others are to polite to call you out.\n\n&amp;#x200B;\n\n\" if she wants to throw away over 15 years of friendship over 3 hours her BF has to chill in a hotel tells me she’s changed quite a bit. \" .. Se it the other way: YOU are willing to throw out 15 years of friendship over inviting her bf, too. After all the support hse has given you, and after all she has spent on being there for you.",
                                            "score": 10,
                                            "author": "Capable_Fig3903",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No all our other friends and family members just were all in agreement that something more intimate would be very nice. Sorry that’s so crazy for you to believe.\n\nAnd didn’t realize wanting to spend a few hours with just our party (who are also our closest friends) was so rude.",
                                                    "score": -4,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "\"And didn’t realize wanting to spend a few hours with just our party (who are also our closest friends) was so rude.\"\n\n&amp;#x200B;\n\nExactly. You obviously were clueless. That's why she told you.\n\n&amp;#x200B;\n\nAnd: Why do you come here to ask if you are not willin gto even consider the answers?",
                                                            "score": 9,
                                                            "author": "Capable_Fig3903"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "YTA.\n\nMainly because you’re having people travel to be there. If the wedding was where you all lived and they plus ones could just chill at home it’d be one thing…but leaving their partners out when they travelled to be there and are at the wedding the next day is rude.",
            "score": 9,
            "author": "GraveDancer40",
            "replies": [
                {
                    "level": 1,
                    "comment": "I spoke at length with this friend about the travel component and she insisted she’d do anything for me and support me 100% no questions asked. We even offered them a place to stay and get ready with me and my sister (my maid of honor). And she declined. \n\nSo yeah I was a bit surprised when she reacted the way she did because she always had my back when I disagreed with everyone else wanted us to do. And everyone else in our families were on board with no dates to the dinner. \n\nI knew going into the whole wedding thing that people get intense about it. I am also learning that things truly are not black and white, and I do not do well with grey area lol.",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "YTA - The rehersal dinner is part of the wedding and the people supporting it should be there.  Excluding the plus one leaves them with nothing to do, often in a strange town.",
            "score": 7,
            "author": "GMGERRYMANDER"
        },
        {
            "level": 0,
            "comment": "If someone is in the wedding party, they can't just choose to not go to the rehearsal dinner. When you don't give someone a plus one to a wedding, their partner can stay home, or both can not go. Your friend and her bf are coming to the wedding, out of town, and she has to be there for the rehearsal. So she's right that he would have to be stuck alone in an unfamiliar city. Basic etiquette and consideration say you need to invite him to the rehearsal dinner as well. YTA",
            "score": 4,
            "author": "Internal_Progress404"
        },
        {
            "level": 0,
            "comment": "YTA.  They're in a strange town solely to support you on your wedding day.  How much money did it cost this couple to be a part of your wedding? \n\nExpecting the partners of the wedding party to have dinner alone is just poor manners.",
            "score": 4,
            "author": "onehundredpetunias"
        },
        {
            "level": 0,
            "comment": "The expectation where I live is that wedding parties and their immediate family as well as all out-of-town guests are invited to the rehearsal dinner. I don’t know if I’d call you AH, but you are bring rude.",
            "score": 2,
            "author": "Recent_Data_305"
        },
        {
            "level": 0,
            "comment": "YTA. I'm going to a wedding at the end of the month that my partner is in but I am not. We rarely get to travel and we're spending a portion of our travel budget to stay there for two nights only. If they expected my partner to eat dinner without me one of those nights I would be real upset.",
            "score": 2,
            "author": "etchedchampion"
        },
        {
            "level": 0,
            "comment": "YTA- what are all the plus 1 supposed to do while you’re rehearsing?",
            "score": 2,
            "author": "Comprehensive-War743"
        },
        {
            "level": 0,
            "comment": "Definitely NTA, you didn't ask them to take time off, presumably the fiance is an adult and is capable of going out by themselves or reading a book/ watching a film in the hotel. \n\nHonestly don't know what everyone else on here is smoking...",
            "score": 2,
            "author": "TopProud7519"
        },
        {
            "level": 0,
            "comment": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nNot to be just another wedding post, but I am getting married in a few months and am planning the rehearsal dinner. I was pretty weak when it came to guest list and it ballooned from around 100 people to over 200 (including plus ones). \n\nA little back story, I recently took a huge pay cut and while my fiancé does well, we still wanted to keep our budget. So we are having the wedding in my fiancés hometown which will be cheaper than where we live now and it’s about 2 hours away. That being said, I was going to be firm about the rehearsal dinner being for immediate family and participants in the wedding only.  \n\nWhen I told one of my bridesmaids the details she got VERY upset she couldn’t bring her fiancé and how I was being rude for not including him. When I explained that we wanted things to be more intimate so no one was getting a plus one to the dinner she reasoned that since they took off work to come early they should both be allowed to come. I never asked them to take off work since I’m not even taking off the day before (new job, no time off). She also said that it was rude of me to just expect him to sit in the hotel for a few hours in a city he’s not familiar with. \n\nShe is also getting married soon and always complains about how her fiancés family is pressuring her to have an expensive wedding and always comparing their wedding to others’. And I feel that is what she is doing to me here. \n\nI feel that she is my friend, not him. And while I know he’s an extension of her, I’ll get plenty of time to spend with both of them at the actual wedding. \n\nAITA for wanting to keep this one part of the wedding on the smaller side and not include plus-ones for the bridal party at the rehearsal dinner?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "INFO would you mind if you were the plus one? If you traveled with your husband for a wedding weekend and he had a dinner the night before you weren't invited to? I don't know etiquette, and it's your wedding so you can do whatever you want but I can't imagine leaving my husband at a hotel, I probably wouldn't go. It feels really tacky to me.",
            "score": 1,
            "author": "OddSpeed5862"
        },
        {
            "level": 0,
            "comment": "INFO: Are +1s allowed at the rehearsal itself?",
            "score": 1,
            "author": "SmilingWhimsy"
        },
        {
            "level": 0,
            "comment": "YTA the rehearsal dinner is for family, wedding guests and guests who have travelled from out of town. Now I can understand with costs today that one might or include everyone who flags come from out of town, but your wedding party members have paid a bunch of money to come help with your day and the very least you can do is to feed their partner dinner.",
            "score": 1,
            "author": "Cat_Lilac_Dog22"
        },
        {
            "level": 0,
            "comment": "As long as you're ok with not taking your husband cus the fiance wants a big wedding, but she doesn't. You are not the AH.",
            "score": 0,
            "author": "Traditional_Force959"
        },
        {
            "level": 0,
            "comment": "YTA",
            "score": 0,
            "author": "Proud_Ad_8830"
        },
        {
            "level": 0,
            "comment": "NTA.\n\nIt's a REHEARSAL dinner ffs.",
            "score": 0,
            "author": "FarHoliday0"
        },
        {
            "level": 0,
            "comment": "NTA. You have every right to have your rehearsal dinner be just the wedding party and family. \n\nIt’s your affair. And if you want it to be intimate then that’s what you want. People need to understand that they aren’t always going to get their way. Especially at someone else’s event that they aren’t paying a stitch of money for. \n\nHe’s a big boy he can figure it out. He’s not going to spontaneously combust just because he’s alone in a hotel room in a foreign city lol. Is he 5. I don’t think so. At least I hope not. \n\nAnd if she can’t trust her fiancé to be left to his own devices then she shouldn’t be marrying him. That would means he’s a literal infant!!!!!",
            "score": 0,
            "author": "queenafrodite"
        },
        {
            "level": 0,
            "comment": "NTA because there is no consensus on this. Some see the rehearsal dinner as an extension of the wedding, some don't. I've been to 6 or 7 weddings as either part of the wedding party or the date of someone in the party. About half of those did not invite plus ones to the dinner, so I personally think that it's normal either way.\n\nHowever, I was curious about this, so I looked it up.\nA Google search of \"who gets invited to rehearsal dinner\" produced these top four hits in order (for me).\n\nThese two say that it's nice--but not a requirement--to invite and ones:\n\nhttps://www.brides.com/story/who-to-invite-rehearsal-dinner-etiquette\n\nhttps://www.marthastewart.com/7969802/rehearsal-dinner-guest-list-etiquette\n\nThis one says that traditionally, significant others are invited, but doesn't state that this is still universally the case:\n\nhttps://www.greenvelope.com/blog/who-goes-to-the-rehearsal-dinner\n\nThe fourth one on the list says that spouses or significant others should be invited.\n\nhttps://www.theknot.com/content/who-should-be-invited-to-rehearsal-dinner\n\nIt's hard for me to say you're the AH when there's not even a clearcut policy on this. It's not a classy move though. I get why your friend's upset because for many, the expectation is that they'll get a plus one to the rehearsal dinner.\n\nI'm not sure about the people emphasizing that it's her fiance as if that makes a difference. If you're going to invite plus ones to the rehearsal dinner, it should be irrespective of relationship status. Partner, fiance, spouse, whatever. The point of a plus one is to accompany the guest so they at least know someone, so it doesn't matter who they are to the invitee.",
            "score": -2,
            "author": "toothpicksplinterz"
        },
        {
            "level": 0,
            "comment": "The rehearsal dinner is for the family and their guests. Meaning you have to include the plus ones of the bridal party as they have to be there. It’s a social event but don’t have a sit down dinner if it’s too costly. Buffet maybe?\n\nNta",
            "score": -1,
            "author": "LongNectarine3"
        },
        {
            "level": 0,
            "comment": "I think I've been to both kinds so I'll go NAH; different styles at play.",
            "score": -2,
            "author": "ServelanDarrow"
        },
        {
            "level": 0,
            "comment": "NTA Never heard of plus one’s for a rehearsal dinner.  Every one I’ve been to has always been immediate family and the wedding party.",
            "score": -4,
            "author": "Derwin0"
        },
        {
            "level": 0,
            "comment": "NTA and it really could go either way and honestly, should depend on the budget and who's paying should have some part of the decision as plus ones adds to the cost.  \n\nObviously by the mixed responses here, it could go either way.  In that case, it should be what you want and can afford.  \n\nTraditionally, I've seen it mostly be the wedding party and immediate family, usually right after the rehearsal and everyone goes to the dinner.  I've known others that made it a huge deal with plus ones and extended family too.  I've also been to one that was a bbq/swim party where all kinds of people were invited and the bridal party had custom t shirts and other gear.",
            "score": -4,
            "author": "KarmaWillGetYa"
        },
        {
            "level": 0,
            "comment": "NTA. Rehearsal dinners are traditionally meant as a practice run to go through details of the wedding, so you only need bridal/grooms party and immediate family. And in my family weddings are all about celebrating the couple and uniting the 2 families. A lot of my family live 3-7 hours away from me, At my wedding, a friend/cousin who lives 5-6 hours away, depending on traffic, was only invited to the reception, as we could only have 30 people for the ceremony (parents, grandparent, siblings, bridal/grooms party) he still traveled the night before to stay at the hotel so that he could be nice and fresh for the reception and he said it would give him time to explore. I don't understand why the +1 can't just explore the city or chill in the room reading a book or something.",
            "score": -6,
            "author": "MaliceIW",
            "replies": [
                {
                    "level": 1,
                    "comment": "That kinda what I thinking? Also either way he’s gonna be sitting there bored whether it’s in hotel room or at the rehearsal since he’s not involved and we’re going straight to dinner from there. I guess I just thought I’d rather be in the hotel watching TV than watch a wedding rehearsal I’m not apart of",
                    "score": -1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I love weddings soo much, and I've been to loads, all different, all different cultures but a rehearsal dinner isn't like a wedding or stag/hen do, it's basically a nice meal with some wedding prep. I don't know why someone would want to go, I'd feel more left out sat there watching people pretty much ignoring me, than I would sat relaxing in a hotel room. I'd be reading a book maybe having a glass of wine and a bubble bath, that sounds much more enjoyable. When did they find out that the rehearsal was no +1, we're they told in the invite, or did you just tell them when they arrived?",
                            "score": -5,
                            "author": "MaliceIW",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes I really just want to get married and maybe have some fun. I wanted to elope since I know how heated wedding stuff can get but my fiance (who now wants to elope lol) insisted we’d be “different” 😂 \n\nThe wedding is still two months out. I really didn’t want anybody going out the way for me so I was pretty shocked when she said she was planning on traveling early and taking off work etc. I didn’t do any of that so no way would I expect anybody else to.",
                                    "score": 0,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah then your friend is being a drama queen, if she feels the time off work is wasted, suggest they either rescind the holiday application so they can use the days another time, or suggest they do something as a couple to have fun. That's what I'd do, and talk to her, ask if maybe there is something else going on, you've said this reaction was out of character, so maybe she's projecting her own wedding fears onto you, like if people have commented on her wedding planning, and that's reflected in how she sees your wedding. Might be worth having a heart to heart.",
                                            "score": -5,
                                            "author": "MaliceIW",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you for your post. This whole thing is so stressful and I just feel like I can’t make anybody happy. \nAnd tbh it’s not totally out of character lol. She routinely just wants to show up to the party and not do any of the planning or financials. Or when something is in anyway inconvenient for her she bails. But I’ve come to accept that (most of the time). \n\nBut now that you say it I do wonder if pressure \nsurrounding her own wedding is contributing. 🤔",
                                                    "score": 0,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah I had a few friends get engaged after me but a while before my wedding, and 1 made a few snide remarks leading up to mine like \"oh we won't be doing it like that, we want something classy, but it suits you guys\" or \"I wouldn't wear that, it's too gaudy for me, but you know me I like simple classic things\" and eventually I called her up in it and to be fair she did apoligize, she said, she was jealous of how supportive and easy-going mine and my partners family were, when her and her fiancé's family were kicking up a fuss telling her how it should be, how they wanted it, refusing to come if they couldn't sit where they wanted, with who they wanted, or if they didn't have the food they wanted, so she was unintentionally taking it out on me. But after our talk, we were fine and she stood up to their families a bit, she conceded on some things but was happy in the end.",
                                                            "score": 0,
                                                            "author": "MaliceIW"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA that’s ridiculous.  The rehearsal dinner is for close people and family in the wedding.  Randoms can come to the reception. He is a grown man he can find something to do for a few hours.  Go to a brewery, watch a movie, read a book.  It’s not difficult.",
            "score": -10,
            "author": "Prof_Hyde_White",
            "replies": [
                {
                    "level": 1,
                    "comment": "Fiances are not \"randoms\" or \"plus ones\". Fiances and fiancees should be invited to any social occasion, just like you'd invite someone's spouse.\n\nFiances also get specific named invitations. You're not inviting the bridesmaid and whatever random escort she happens to pick up. You're specifically inviting the man to whom she is engaged.",
                    "score": 8,
                    "author": "_mmiggs_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA. Two hours drive is not a long one, no reason to use that ascan excuse. And rehearsal dinner is for the wedding party, those who are actively part of planning it and making it a success. Not everyone even do have a rehearsal dinner, and some who does don't have a fancy dinner but cheaper buffee type of thing whilst still going through the schedule and thanking everyone for participating. Whether you invite plus ones or not is up to you. This is about your wedding. You and your partner make the rules.",
            "score": -7,
            "author": "Sentient_Dream"
        },
        {
            "level": 0,
            "comment": "All of the rehearsal dinners I’ve ever been to/seen were: parents of bride/groom and the wedding party. That was it. It was sort of a “thank you” meal after the rehearsal. (But that is my culture) I as a +1 was not invited to my SIL’s rehearsal even though my husband was part of the wedding party. My sister would not have included my husband or kids in her rehearsal dinner if I’d been able to make the event. \n\nNTA based on my own cultural experiences. \n\nNow, I will say, you won’t have much time to spend with them AT the wedding. You will be making the rounds. Greeting guests and thanking them for coming. Stand here, smile. Take photos. Etc. If you want to include +1’s as a more relaxed evening, feel free! If you really just want space and a breather with your wedding party, do that. :)",
            "score": -7,
            "author": "punnymama"
        },
        {
            "level": 0,
            "comment": "NTA.  I was in my friend's wedding a few years ago and there was no plus ones for the rehearsal dinner.  The bride made sure to let everyone know.  It was quite embarrassing for those who brought the plus one (and their kids) because the hosts (parents of the groom) of the dinner asked who would be paying for their meals.  They hosts refused to pay.  It's not their wedding, not their budget, and not their choice.  If she can't live without him for a couple of hours, she has bigger problems.",
            "score": -8,
            "author": "aholereader"
        },
        {
            "level": 0,
            "comment": "NTA\n\nRehearsal dinners are typically for the wedding party and immediate family anyway (in my opinion). It is your choice on whether you allow additional guests at the dinner (or the wedding guest list in general) and your bridesmaid is not entitled to a plus one automatically. She should not have assumed (though her frustration is understandable since they sound like they are traveling from out of town.)",
            "score": -10,
            "author": "youpewted",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ok yeah I guess in past relationships when my partner was in a wedding I wasn’t included or I had to pay my own bill so that was my reference. She booked her hotel before my fiancé and I had any details ironed out     \nI was just kinda taken aback by her comments about “him having to just wait at the hotel” because in my mind either way he’s just gonna be waiting around. Either at the hotel at the the rehearsal he’s not in",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is dumb for you.\n\nLike a grown person can't just relax alone for a few hours in a hotel.\n\n\nOther people are invited to the wedding also. Might as well invite them to your rehearsal dinner also, the whole 200 guests.\n\nNTA.",
            "score": -7,
            "author": "proof-plum",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would LOVE to have a few hours by myself in a hotel! Bye honey, have fun! *turns on Netflix and grabs my snacky snacks*",
                    "score": 3,
                    "author": "itsathrowawayduhhhhh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "SAME!",
                            "score": -2,
                            "author": "Ok-Context1168"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA.\n\nIts your decision. Stand your ground. Why let anyone else make you feel bad for what you want.\n\nThe rehearsal dinner is to rehearse how the wedding ceremony will take along with feeding the people in the wedding party. Why do you have to conform to the norm of society? If this is what you want stand your ground. Its your wedding, your choice.",
            "score": -8,
            "author": "brhetz08",
            "replies": [
                {
                    "level": 1,
                    "comment": "The rehearsal dinner is a thank you to the bridal party.",
                    "score": 13,
                    "author": "freshOJ"
                },
                {
                    "level": 1,
                    "comment": "Thanks. We’ve also been getting some flack about “traditional” things from my future MIL. But also we’re gay so not super “traditional” from the jump lol",
                    "score": -5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean…you didn’t have to have a rehearsal dinner at all if you didn’t want to be traditional. But rudely excluding your wedding party’s partners is not the way.",
                            "score": 11,
                            "author": "Outrageously_Penguin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA - it is rare the rehearsal dinners are plus ones if its some form of sit-down thing.  \n\nI have seen some that were more of a meal for wedding party and families that included spouses etc. But those were usually backyard dinners, mid-priced buffet style etc.",
            "score": -11,
            "author": "Innerouterself2"
        }
    ]
}