{
    "id": "145fxnm",
    "score": 144,
    "title": "AITA for saying that I will no longer contribute finally to our household",
    "author": "Top_Mammoth2884",
    "date": 1686342670.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/145fxnm",
    "media_urls": [],
    "other_urls": [],
    "postText": "I 30F am married to my husband 35F for 7 years. For some background, we are immigrants living in a European country for the last 6 years. We have a 1.5M year old. After we moved to the said country, I had visa restrictions and couldn't work for 2 years. Out of 7 years of marriage, those are the 2 years I was financially dependant on my husband. But, we knew it before moving and still did it as it was beneficial to his career. \nSince the beginning, he never did much around the house. I do the cooking, cleaning, scheduling any appointment etc.\n\nHe always had special hobbies that requires special equipment and I always tried to be supportive. I spend most of my income towards household expenses. All the direct debits are on his account, so I send money to him every month after payday.\n\nNow, I had a difficult pregnancy and a planned c-section due to some complications. I did all the chores until one week before my delivery. That is when my mom came and stayed until the baby turned 2 months old.\n\nMy husband did nothing during my mom's stay. Not even hold the baby until I ask. Even after she left, I never got any help even after asking. \nAfter the end of my maternity, I switched to a new company. I still do all the work I used to do plus the baby care. \n\nWe have two dogs, he feed them. I do the rest.\nI got sick 3 months ago. He took care of the baby for a week. Cooked for 5 weeks while I was recovering. During this time, I planned to go to my hometown to my parents place to recover fully. So, I told him that I can't give him any money for this month as I want to purchase plane tickets.\nTo say it did not go well is an understatement. He called me names and said the family can't survive. When I pointed out how it's not true, he said he need money for his hobbies. He pointed out that I have savings, but it was actually to repay some debt we had. He is aware of this and still wanted that money. When I did not agree, he threatened saying he will leave his job. I did not budge so he went ahead and cut my health insurance. When I confronted saying I always contribute, he reminded me that he took care of me when I was jobless and also said if he let this one time go, I might make it a habit. \n\nAll this while i was sick. I felt very bad. Transferred him some money, booked my ticket and came to my parents place. Our son is with me. I did not talk to him for two months and he occasionally messaged me asking how our son is doing.\n\nHe now calls me and asks for money. Says, I am not pulling my weight. I need to give him half of the monthly expenses and I can do anything I want with rest of the money. When I ask about dividing chores, he says he is doing what he can. \nI feel like a SAHM, with an outside job and don't want to contribute anything financially until he starts doing more around the house and be an active parent in our son's life.\nAITA?",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n &gt; I think I might be the AH because I suddenly stopped contributing financially without any prior notice and all of the direct debits like mortgage and utility bills are on my husband's account\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "score": 1,
            "author": "Judgement_Bot_AITA"
        },
        {
            "level": 0,
            "comment": "NTA. If you aren’t there, why are you contributing to HIS household expenses?",
            "score": 333,
            "author": "ambersloves",
            "replies": [
                {
                    "level": 1,
                    "comment": "This. It sounds like she is doing well without him. NTA for sure",
                    "score": 68,
                    "author": "H4ppy_C"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA. What he is doing is **financial abuse.** Are your family very traditional? Is there family you can take the baby and stay with?\n\nThis guy will not change. No matter what you do. If you stay in this marriage, you will keep being someone with **2 jobs** that you are doing by yourself. So — is that what you want? **Because you have 2 choices — keep things the same and suffer through that, or start talking to people you trust about how to leave.**",
            "score": 229,
            "author": "TemperatureSea7562",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, it's a traditional family. I don't have any family in the country I currently reside. I don't have any savings. Property we purchased during these years is on his parents name. I need some backup money  to move to my home country and I need to stay until then.",
                    "score": 63,
                    "author": "Top_Mammoth2884",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is there family in another country who would appreciate how bad his behavior is, how he is bringing nothing to your partnership other than what he uses as a tool to control you, and that he is a neglectful parent? That he misuses your money? \n\n**Could you go to stay with them for a “visit” and then have their support if you don’t want to come back?** (If you do this, you would need to get some advice on how to make sure your kid stays with you, and how to divorce your husband safely — you should ask in **/r/legaladvice** and tell them what countries are involved so that they can maybe recommend ways to go about this.)",
                            "score": 41,
                            "author": "TemperatureSea7562",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My own family agrees what he is doing is wrong. I have their full support. But, I need to check what rights I have and how to proceed. Thank you, I will post in that sub.",
                                    "score": 45,
                                    "author": "Top_Mammoth2884",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m so glad that you have their support! Please, above all, be cautious about your safety during all of this. Maybe if any of your family have legal people they can talk to, that would help as well? If you’re not sure, you could ask if they know anyone personally who has helpful knowledge.\n\nAlso: I’m sure others have said this, but — if there are any ways you can gather evidence of his bad behaviors, that will help so much! Any emails, texts, or documents that show these things should be hidden. Maybe you could send copies of things by email to your family.",
                                            "score": 15,
                                            "author": "TemperatureSea7562",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "How can I gather evidence for the emotional hurt he causes? I recorded few of our arguments but most of the time he talks well. If any of you hear his side of the story, I will be blamed.",
                                                    "score": 11,
                                                    "author": "Top_Mammoth2884",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I’m hoping /r/legaladvice people can help more, but:\n\n1) Whatever recordings you have, those (and financial records) are top priority to send to supportive relatives.\n2) When he’s not home, see if you can think of sneaky reasons to ask him questions where the answers show his bad behaviors. Then you have his reply on your phone and can add that to the things you save as evidence.",
                                                            "score": 8,
                                                            "author": "TemperatureSea7562"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Once you made up your mind and want to leave, look into divorce laws in both your home country and the one in the EU. My guess was a that you would get better child support/ chances in the EU one… You can start the divorce process in either, just make sure you know what to expect. Good luck! &lt;3",
                                                            "score": 5,
                                                            "author": "Altruistic-Paper-847"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Also, find out about the rules around child abduction, i.e. if you could be accused of that if you remove your child from the country without the father's permission.",
                                    "score": 2,
                                    "author": "Smooth_Committee_298"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA - Honestly I hope you take this time away to reflect on your relationship. You don’t have anything positive to say about your husband and he seems to be financially abusing you. I know that as readers we only have a small slice of your life, but please take the time to think about what you’re getting out of the relationship and if it’s worth to continue to invest so much money, time and emotional energy in. It doesn’t appear that he’s being a good father either, so staying for your child does not make sense. He’s not a good role model.",
            "score": 42,
            "author": "FluffyBunny271",
            "replies": [
                {
                    "level": 1,
                    "comment": "Single parents especially females have a hard time in my country. Society thinks it's better to have any kind of father than not having one. I am really struggling to decide what's best for my son.",
                    "score": 21,
                    "author": "Top_Mammoth2884",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There’s no easy decision. Would moving closer to your family to have help around be an option? I hope you find a solution that brings you happiness.",
                            "score": 12,
                            "author": "FluffyBunny271",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "To move closer to my family, I need to move back to my home country and I have zero savings to take that step. Thank you.",
                                    "score": 12,
                                    "author": "Top_Mammoth2884",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Money is power. Financial independence equals personal freedom. When you’re able to save, don’t let anyone take that from you. Be as kind to yourself as you would be to another woman and guard your safety and freedom as you would any other person’s.",
                                            "score": 15,
                                            "author": "reenaltransplant",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Agreed. I was young and naive. I did it out of love. I wanted to show him that by giving him what he wants, he would see that. Took me long enough to realise that will not be the case.",
                                                    "score": 7,
                                                    "author": "Top_Mammoth2884"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Stop sending him money and start saving. It really sounds like he adds absolutely nothing positive to your life, just financial and emotional abuse.",
                                            "score": 8,
                                            "author": "bexcellent101"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "All you need is money for flights and a willing family to help you out and not much more. \n\nIf it's worth leaving then it's not worth waiting.",
                                            "score": 3,
                                            "author": "tallyhoo123"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Doesn’t mean you have to take on that belief. It is not better to have any man than no man at all. That is antiquated and down right ignorant. \n\nWhat’s best for your son is to have a good male role model who he can mirror when it comes to how to deal w people you love. He’s not getting that from his sperm donor. \n\nYour husband is a horrible husband and father and you and your baby are much better without him. \n\nBelieve us you will definitely find love again. Good men don’t tend to care about you already having a baby.",
                            "score": 5,
                            "author": "queenafrodite",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I never saw that happen in my country. But I am okay living as a single parent. I don't my son to learn all this. I was just hoping my husband would see reason.",
                                    "score": 3,
                                    "author": "Top_Mammoth2884",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You need to look into all of your options, potentially staying in the country you already work in. It's just an option (depending on your legal status): keep your job, find your own place, separate. Figure out what works best for you and your son, where you want to be. Consult with lawyers either way.",
                                            "score": 1,
                                            "author": "silent_atheist"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Keep in mind if you stay with your husband that your son will be watching and seeing how your husband treats you.  \n\nDo you want your child to learn to be like your husband as an adult??",
                            "score": 3,
                            "author": "SmartFX2001"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA and stop feeding money to him. You need to save to support yourself and your son's needs, and your husband has proven he is unwilling to do that. He is unlikely to change given the information you've shared.\n\nJust one remote possibility if culturally relevant: can you talk to his parents? Would they be sympathetic to your side and help you \"manage\" trying to change your husband's attitude?",
            "score": 17,
            "author": "ParsimoniousSalad",
            "replies": [
                {
                    "level": 1,
                    "comment": "I tried doing that last year when our son was 6 months old. Not really helpful. My husband and his family completely stopped interacting with my family since then.",
                    "score": 6,
                    "author": "Top_Mammoth2884",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then sorry to say it sounds like you are on your own. With your family's backing, it sounds like you need to leave your husband. At the very least, stop financially supporting him and his \"hobbies.\"\n\nSupporting your son and yourself is your ONLY priority here.\n\nEDIT to add: I still can't get over the fact that he TOOK YOU OFF HEALTH INSURANCE while you were sick.",
                            "score": 13,
                            "author": "ParsimoniousSalad",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We have free healthcare and private insurance is something nice to have. I asked him to cancel the one he is paying for when I joined my new company as they were providing some basic insurance. But after comparing the plans, the one he is paying for had a lot more benefits, so he decided it's better to have. So, I am not without any insurance/healthcare at this point. And he did take me to the appointments when I was sick.",
                                    "score": 7,
                                    "author": "Top_Mammoth2884",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Good (I was wondering what country that was!).",
                                            "score": 2,
                                            "author": "ParsimoniousSalad"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA \n\nHe sounds completely useless as a husband and father.",
            "score": 14,
            "author": "fwork_"
        },
        {
            "level": 0,
            "comment": "NTA\n\nI hate when people say it... but divorce may be the answear. From what I am reading you do not have one child but two...\n\nEdit: Sending strenght your way! Hope you are doing well!",
            "score": 15,
            "author": "Funny-Worth5418",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you",
                    "score": 5,
                    "author": "Top_Mammoth2884"
                },
                {
                    "level": 1,
                    "comment": "Yes, and one child still in country with the husband. This is tricky.\n\nGood luck and keep safe!",
                    "score": 1,
                    "author": "UsualCounterculture"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA. Do you want your husband to be your son’s role model?",
            "score": 9,
            "author": "kipkapow",
            "replies": [
                {
                    "level": 1,
                    "comment": "Definitely not!",
                    "score": 4,
                    "author": "Top_Mammoth2884"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA\n\nYou both have jobs, but beyond that your husband wants his expensive hobbies while expecting you to be the cook, cleaner and childcare provider. That's not a partnership!\n\nHe also can't keep holding it over you that he financially 'looked after you' for two years - that was a mutual decision, and in return you looked after him by running the household - that was a partnership, but he didn't value what you did.\n\nAnd to cut your health insurance? Wow...\n\nThis is abusive behaviour from your husband, OP! I wouldn't be rushing back to him if I were you.",
            "score": 7,
            "author": "geordiehippo",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, I am starting to see that and I don't want to go back as well. But I want to make the right decision for my son and confused as to what that would be.",
                    "score": 2,
                    "author": "Top_Mammoth2884"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA.  Do folks in your country go to marriage counseling?  If so, give it a try (as opposed to just arguing all the time without any resolution).  If he will not go, then you have to make a decision about what is best for you and your son.",
            "score": 5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "No, counseling is like a taboo. Mental health is generally not discussed much.",
                    "score": 6,
                    "author": "Top_Mammoth2884",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hmph. That’s never good. Do you believe in therapy ????",
                            "score": 1,
                            "author": "queenafrodite",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I do and I think I need some. I was thinking I am the problem in my marriage until recently because I always to something that makes him mad. If I just stop doing that one thing, everything used to be good. But over the course of time, the list became too long. I started seeing how bad it is only after my son is born.",
                                    "score": 3,
                                    "author": "Top_Mammoth2884"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA.  Does not sound like your husband is very considerate of you or your son at all.  Why do you stay with him?  What you are trying to demand of him will likely never happen as he apparently doesn't care enough to help you or be involved with your son.  If there is any way to escape this situation, you should probably consider it.  Things are likely never going to change with your husband no matter what you do.",
            "score": 5,
            "author": "Realistic_Head4279",
            "replies": [
                {
                    "level": 1,
                    "comment": "He says he will be more involved in our son's life when he becomes a bit big and share/teach his hobbies",
                    "score": 1,
                    "author": "Top_Mammoth2884",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "With the way your husband behaves, do you want him “teaching” your son things when he gets older?",
                            "score": 8,
                            "author": "TemperatureSea7562"
                        },
                        {
                            "level": 2,
                            "comment": "He won’t.",
                            "score": 3,
                            "author": "queenafrodite"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA.  \n\n\nI suggest making an exit plan now before things get worse.",
            "score": 4,
            "author": "nicolepleasestop"
        },
        {
            "level": 0,
            "comment": "NTA. But you will be to yourself and your son if you stay with this man. Save up as much $ as you can and GTFO.",
            "score": 3,
            "author": "ClockTraining116"
        },
        {
            "level": 0,
            "comment": "NTA. You’re basically a single mom. Apart from the baby conception how are you functioning as a couple? It seems like you do everything? You seem to be doing well by yourself and he’s just a burden.",
            "score": 3,
            "author": "Dangerous-Emu-7924",
            "replies": [
                {
                    "level": 1,
                    "comment": "He stays happy as long as all his need are met. If I oppose anything I am trying to control him. If I call out his behavior, it's my mistake because I triggered him by saying/doing something wrong.",
                    "score": 2,
                    "author": "Top_Mammoth2884"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can you get a work visa in the country you are in? I assume you are on a dependent visa. Will your employer support you if you apply for a work visa? What are your educational qualifications? Can you get a full-time job in the country of your residence with your qualifications? \n\nIf you can both get a job and a working visa, your best bet would be to go for these and leave your husband. \n\nMeanwhile NTA. Don't give a dime to your husband, not even when you start living together. Let him know that he gets access to your wages when he starts pulling his weight by doing chores at home. You should also stop cooking for him, doing his laundry etc. Just give him a taste of what life would be like without you. I bet he won't have time or money for his expensive hobbies when he has to cook and clean for himself as well as bear the full financial burden.",
            "score": 3,
            "author": "ProfileElectronic",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am not on dependent visa. I have my own work permit. I am a graduate and I work in IT. I make good money. I am working from my home country right now. That is what I am planning to do. He says, since I am staying in the same house, I need to pay half the bills and do whatever I want with the rest. I want him to do half the chores and he doesn't want to do that.",
                    "score": 5,
                    "author": "Top_Mammoth2884",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you are in IT then you can easily find shared accommodation on your own. He'll in fact have to pay you for child support including the cost of daycare, should you choose to put your kid in daycare while you work. Based on the income disparity he might also be on the hook for alimony. So don't give in to his threats. You have the chances of a better life on your own without the deadbeat pulling you down. \n\nHe can do zilch to make you live with him or take the child from you if you are in the country of your work. Europe, Canada, Australia and the US have better laws than Asian countries (I suspect you are from one, from your description of the circumstances).",
                            "score": 6,
                            "author": "ProfileElectronic"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Leave him. You deserve so so so much better nta",
            "score": 2,
            "author": "Goose20011",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you",
                    "score": 2,
                    "author": "Top_Mammoth2884"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA and please talk to a women’s organisation in the country you moved to about getting legal aid, since your visa isn’t dependent on his and you mentioned single parenthood is stigmatised in your home country. You are at minimum probably entitled to child support payments from him and maybe a stake in the property if you can prove you sent him the money and were legally married at the time, depending on the European country’s specific laws. There may also be child benefits/ tax cuts you’re entitled to from the state, but again a women’s organisation is best placed to advise.",
            "score": 2,
            "author": "MmeMerteuil"
        },
        {
            "level": 0,
            "comment": "The cutting Healthcare part scared the heck out of me. It's one thing to demand money it's another to put you and your child's health at risk if you were in an emergency situation and couldn't get the proper Healthcare or pay for it after out of pocket. This is beyond an unsafe situation, no matter how bad a relationship is going you don't go after someone's health. I strongly worry for you and your child and I think it would be best to get health insurance from your job if possible and to stay with your parents more. Don't give him anymore money it's just fueling his desire to control your life and make you feel threatened if you don't give in. It will only get worse, please for you and your child's safety start thinking of an exit plan.",
            "score": 2,
            "author": "ChibiHanami"
        },
        {
            "level": 0,
            "comment": "NTA. You’d be better off alone. Find a room to rent for you and your child. At least you wouldn’t be his slave. Not sure which country you are currently in but if possible sue for child support.",
            "score": 2,
            "author": "lalaha6868"
        },
        {
            "level": 0,
            "comment": "Will you please divorce him?! NTA And it's not your job to finance his hobbies either.",
            "score": 2,
            "author": "295Phoenix"
        },
        {
            "level": 0,
            "comment": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI 30F am married to my husband 35F for 7 years. For some background, we are immigrants living in a European country for the last 6 years. We have a 1.5M year old. After we moved to the said country, I had visa restrictions and couldn't work for 2 years. Out of 7 years of marriage, those are the 2 years I was financially dependant on my husband. But, we knew it before moving and still did it as it was beneficial to his career. \nSince the beginning, he never did much around the house. I do the cooking, cleaning, scheduling any appointment etc.\n\nHe always had special hobbies that requires special equipment and I always tried to be supportive. I spend most of my income towards household expenses. All the direct debits are on his account, so I send money to him every month after payday.\n\nNow, I had a difficult pregnancy and a planned c-section due to some complications. I did all the chores until one week before my delivery. That is when my mom came and stayed until the baby turned 2 months old.\n\nMy husband did nothing during my mom's stay. Not even hold the baby until I ask. Even after she left, I never got any help even after asking. \nAfter the end of my maternity, I switched to a new company. I still do all the work I used to do plus the baby care. \n\nWe have two dogs, he feed them. I do the rest.\nI got sick 3 months ago. He took care of the baby for a week. Cooked for 5 weeks while I was recovering. During this time, I planned to go to my hometown to my parents place to recover fully. So, I told him that I can't give him any money for this month as I want to purchase plane tickets.\nTo say it did not go well is an understatement. He called me names and said the family can't survive. When I pointed out how it's not true, he said he need money for his hobbies. He pointed out that I have savings, but it was actually to repay some debt we had. He is aware of this and still wanted that money. When I did not agree, he threatened saying he will leave his job. I did not budge so he went ahead and cut my health insurance. When I confronted saying I always contribute, he reminded me that he took care of me when I was jobless and also said if he let this one time go, I might make it a habit. \n\nAll this while i was sick. I felt very bad. Transferred him some money, booked my ticket and came to my parents place. Our son is with me. I did not talk to him for two months and he occasionally messaged me asking how our son is doing.\n\nHe now calls me and asks for money. Says, I am not pulling my weight. I need to give him half of the monthly expenses and I can do anything I want with rest of the money. When I ask about dividing chores, he says he is doing what he can. \nI feel like a SAHM, with an outside job and don't want to contribute anything financially until he starts doing more around the house and be an active parent in our son's life.\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "NTA. It seems you don't actually need him and he isn't bringing any value to your life. You have a job and are already doing all the parenting and house work. If you're living in Europe you can probably get services and support as a single parent. Look around where you live, see if you can find some organizations that help women leave abusive husbands (and yes, what your husband is doing is abuse). They can help you apply for benefits, housing etc. Get a lawyer, file for divorce and try to get full custody (with your husband's lack of interest in your child, that should be possible). You don't have to stay in this relationship and you don't have to go back to your country if you think you'll be ostracized there.",
            "score": 1,
            "author": "Helpful_Hour1984"
        },
        {
            "level": 0,
            "comment": "Can you leave this little man? I would suggest leaving ASAP if you can. You are a single mother with a live-in leach. NTA",
            "score": 1,
            "author": "No_War_4429"
        },
        {
            "level": 0,
            "comment": "What a selfish horrible husband. Run away, OP. His only priority is himself.",
            "score": 1,
            "author": "pgabrielfreak"
        },
        {
            "level": 0,
            "comment": "Serve him papers and pay him nothing. He’s a leech, and a second adult-sized child you looked after. NTA.",
            "score": 1,
            "author": "Diligent-Syllabub898"
        },
        {
            "level": 0,
            "comment": "HE CUT OFF YOUR HEALTH INSURANCE?! To spite you? You are NTA. He doesn't behave like a father. He's shown you his true self. Stay with your parents and file for divorce. He can go to hell",
            "score": 1,
            "author": "VivreRireAimer18"
        },
        {
            "level": 0,
            "comment": "NTA\n\nYou’re a single mother with two babies. Time to send the older one off on his own. He needs to grow up",
            "score": 1,
            "author": "Aer0uAntG3alach"
        },
        {
            "level": 0,
            "comment": "NTA and he sounds abusive",
            "score": 1,
            "author": "Logical-Cost4571"
        },
        {
            "level": 0,
            "comment": "NTA\n\nPlease reach out to women's organisations both in the country where your life is now and in your home country. \n\nOrganisations that support women in domestic abuse contexts have lawyers and people who can help you with the immigration law side of things and help you plan to get out.\n\nYour country of residence may also have organisations that help women from your specific national and ethnic background. Again, they will understand your situation and may be able to help you.\n\nBest wishes",
            "score": 1,
            "author": "lejosdecasa"
        },
        {
            "level": 0,
            "comment": "Cut him off and don’t go back. \n\nProblem solved. Nta",
            "score": 1,
            "author": "LongNectarine3"
        },
        {
            "level": 0,
            "comment": "NTA Divorce this dude. Sounds as if he thinks the world revolves around him. Dude doesn't care about you or the kid, he cares about the money you bring, so he can do his shit.",
            "score": 1,
            "author": "AnnihilationThunder"
        },
        {
            "level": 0,
            "comment": "NTA. Why do women need a man? Women can cook, clean, take care of the kids, work, budget, also take care of the home and then some. Your husband is hopeless, you need to take care of yourself and the baby that’s a priority. Just leave him, what asset is he in your life.",
            "score": 1,
            "author": "Teani2003"
        },
        {
            "level": 0,
            "comment": "Call me crazy but he's your husband he is supposed to be supporting you. Period. This is why I like Sharia law.  Husband's duty is to support wife.  You are not happy with him because what he is doing is un manly.  Sorry not Sorry.  Splitting bills with your husband is insane.  It's OK for you to work and keep your money.  Or contribute to the household If you want.  Canceling your health Insurance is a big red flag.  Let him get a 2nd job and figure out something.  You are a mother.  And yes I am a Sahm and no I will not pay bills unless there was hardship then I would help and I have.  But not like this.",
            "score": 1,
            "author": "Educational_Order_61"
        }
    ]
}