{
    "id": "145mkm0",
    "score": 31,
    "title": "AITA for jumping on my wife’s messed up back",
    "author": "Ellesmackers",
    "date": 1686359571.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/145mkm0",
    "media_urls": [],
    "other_urls": [],
    "postText": "Long time lurker, first time poster. So earlier tonight I (36F) went with my wife (32F) over to my in-laws house to hang out. We frequently do this, we all let our puppies hang out and make food and have some drinks. Well I’m an apocalypse…not enthusiast necessarily…but I think it’s gonna happen. And we were all taking quizzes about how long we’d last in the zombie apocalypse. Anyhoo one of the questions was “could you carry a family member on your back”. Here is where things went wrong. My wife wanted me to heft myself onto her back while her sister carried their mom on her back. But I’ve gained some weight, and I know my wife always talks about her back pain, so I didn’t want to jump on her back so I wouldn’t hurt her. Also I didn’t want to embarrass myself as, like I said, I have gained some weight recently. She insists. I hoist myself onto her back, and she takes off. Her sister is running alongside with their mom on her back. I knew it was going to happen before it did. I saw us start to go down, my wife lost her footing, we were crashing, I landed in part grass..part sharp metal fence. Scraped my hand and got an an abrasion on my leg, but I’m okay. My wife is totally fine, but now upset with me that I didn’t ask her about how her back was and if she was okay. In my mind, I didn’t want to get on her back to begin with. I verbalized this multiple times. She is the one who insisted, the one who crashed, and I was the one who landed half in grass and half on a broken fence…her family was all asking me if I was okay. AITA for not asking about her back?",
    "comments": [
        {
            "level": 0,
            "comment": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n &gt; I think I might be the asshole because even tho the race wasn’t my idea, and I was the only one who was injured, I didn’t ask about my wife’s feelings.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "score": 1,
            "author": "Judgement_Bot_AITA"
        },
        {
            "level": 0,
            "comment": "NTA. She can’t be made if she insisted! That said, you didn’t really want to, so have a convo with her about her pushing you to do things you’ve said no to doing. That’s not cool of her.",
            "score": 36,
            "author": "throwaway456999678"
        },
        {
            "level": 0,
            "comment": "NTA\n\nShe’s an adult. She could have reasonably looked at you and made an assessment as to whether or not she should try to carry you or not. \n\nThe *only* one who can make an accurate judgement of what she feels comfortable trying to carry is *her*, you can’t be in her mind and body trying to guess that on her behalf. She needs to be the one to assess her own fitness.",
            "score": 14,
            "author": "Ryanookami"
        },
        {
            "level": 0,
            "comment": "Def NTA. Sure you could have checked on her but you were probably too busy trying to check on yourself. Those injuries could have been serious. Are you up to date on your tetanus shot? Sounds like you could have been gravely injured and had to ensure your own survival first and foremost. You seemed to have made it clear that you didn’t think it was a good idea and that should have been respected. You tried your best to prevent this whole scenario from occurring as you knew the outcome would be poor and didn’t want to cause or exacerbate any of your wife’s back problems. Hopefully when the zombie apocalypse happens you figure out a better solution to get around. Overall, NTA but it wouldn’t hurt to check on her 🤷🏻‍♀️",
            "score": 9,
            "author": "jerri___blank",
            "replies": [
                {
                    "level": 1,
                    "comment": "Should I get a tetanus shot?? I don’t think it’s be gotten one in awhile and it is an open bleeding scratch? I cleaned it with rubbing alcohol, anybody know if that’s enough?",
                    "score": 1,
                    "author": "Ellesmackers",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "According to [Cleveland Clinic](https://my.clevelandclinic.org/health/drugs/24283-tetanus-shot), \"Providers also give tetanus shots to people after they cut or puncture their skin, especially if the cut is deep. Although many people think you get tetanus from stepping on a rusty nail, any wound that opens the skin can cause tetanus. Your provider may recommend a tetanus booster shot if you have a cut and you either:\n-Don’t know your immunization history (it’s safe to get an additional shot early if needed).\n-Got your last tetanus dose more than 10 years before the wound.\n-Have had fewer than three doses of the tetanus shot.\"",
                            "score": 5,
                            "author": "-im-tryin-"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA\n\n&amp;#x200B;\n\nSHE hurt YOU by dropping you. Did SHE ask YOU if you were ok?",
            "score": 4,
            "author": "Capable_Fig3903",
            "replies": [
                {
                    "level": 1,
                    "comment": "No she did not, but the rest of her family did. Also I’ve noticed it’s now an open scratch and bleeding",
                    "score": 2,
                    "author": "Ellesmackers"
                }
            ]
        },
        {
            "level": 0,
            "comment": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nLong time lurker, first time poster. So earlier tonight I (36F) went with my wife (32F) over to my in-laws house to hang out. We frequently do this, we all let our puppies hang out and make food and have some drinks. Well I’m an apocalypse…not enthusiast necessarily…but I think it’s gonna happen. And we were all taking quizzes about how long we’d last in the zombie apocalypse. Anyhoo one of the questions was “could you carry a family member on your back”. Here is where things went wrong. My wife wanted me to heft myself onto her back while her sister carried their mom on her back. But I’ve gained some weight, and I know my wife always talks about her back pain, so I didn’t want to jump on her back so I wouldn’t hurt her. Also I didn’t want to embarrass myself as, like I said, I have gained some weight recently. She insists. I hoist myself onto her back, and she takes off. Her sister is running alongside with their mom on her back. I knew it was going to happen before it did. I saw us start to go down, my wife lost her footing, we were crashing, I landed in part grass..part sharp metal fence. Scraped my hand and got an an abrasion on my leg, but I’m okay. My wife is totally fine, but now upset with me that I didn’t ask her about how her back was and if she was okay. In my mind, I didn’t want to get on her back to begin with. I verbalized this multiple times. She is the one who insisted, the one who crashed, and I was the one who landed half in grass and half on a broken fence…her family was all asking me if I was okay. AITA for not asking about her back?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "NTA\n\nShe cannot be mad at you for something SHE insisted upon.",
            "score": 1,
            "author": "Creepy_Addict"
        },
        {
            "level": 0,
            "comment": "ESH this was a terrible idea. She shouldn't have insisted, you shouldn't have given in.",
            "score": 1,
            "author": "Rivka333"
        },
        {
            "level": 0,
            "comment": "ESH. Bad decisions all around, and it seems like a little too much alcohol may have been involved.",
            "score": 1,
            "author": "BogBabe"
        },
        {
            "level": 0,
            "comment": "NTA. Also, ya'll sound fun to hang out with.",
            "score": 1,
            "author": "BataleonRider"
        },
        {
            "level": 0,
            "comment": "NTA.... sheesh drama queen.",
            "score": 0,
            "author": "BeginningAccording96"
        },
        {
            "level": 0,
            "comment": "Sorry, light YTA. (esh if she didn't check on you) Doesn't matter who's idea it was, there was a fall with the possibility of injury.  Assuming you care about each other,  you both should have checked  on each other?",
            "score": -1,
            "author": "mynewusername10",
            "replies": [
                {
                    "level": 1,
                    "comment": "I do understand that but she popped right up and told everyone she was fine immediately",
                    "score": 1,
                    "author": "Ellesmackers"
                }
            ]
        }
    ]
}