{
    "id": "145qdrb",
    "score": 13,
    "title": "AITA for speaking up for my adopted nieces and nephews to my sister to be included in grandfather’s funeral?",
    "author": "Kirsirine",
    "date": 1686371200.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/145qdrb",
    "media_urls": [],
    "other_urls": [],
    "postText": "My father just passed and it’s obviously rough on the whole family. We are a large, blended, close-knit family of adopted siblings/nieces/nephews/children. \n\nMy adopted nieces and nephews (a 5 sibling group adopted by my sister) don’t feel my sister always treats them all the same as her biological children. As their aunt, they ask me to often speak for them. It’s never gone well when I do. So I haven’t done so in awhile.\n\nDuring funeral planning, my sister, mother &amp; brother chose 6 pall bearers (my father’s siblings, my brother, my sisters 2 bio kids and my sisters bf). None of the adopted sibling group were asked to participate. Collectively, they asked why a bf (whom they don’t approve of because he has a felony record-whole other story) over them would be chosen. I told them I I didn’t have a say and told them to ask their mom. \n\nThe group didn’t want to cause heartache so they asked me to find out why but keep it confidential. I casually asked my sister (unfortunately if front of my mom) if we as a family should include one of the adopted sibling group to be a pall bearer over my sister’s bf.\n\nMy sister blew up. “Where is this coming from? Which of my kids said to bring this up?” I replied with, the sibling group often feels left out so I’m just thinking we should include one over your bf because you’ve only been dating 9 months and aren’t married. \n\nMy mother chimed in and said she chose the people and can explain to the group why. I said it’s not a big deal, just trying to include everyone.\n\nBecause she just lost her husband of 51 years, she began sobbing and ran outside, saying she doesn’t want anyone to feel left out but arrangements are finalized. I felt awful that I made my mother cry, tried to help, but my mother wanted to be alone.\n\nMy sister became hostile, demanded me to tell her which of her kids brought this up, and told me off for making my mom cry.\n\nI responded that I’m just trying to include the adopted children, I don’t care who the pall bearers are and just wanted to give her children a voice and participation in the arrangements. I decided to leave but turned and said, “I’m honestly not trying to cause drama but am specifically trying to help you with your kids.” And shit hit the fan.\n\nThe whole family is now irate at me for bringing unnecessary pain to my mother when all I was pointing out is that ALL the grandchildren should be equally included.\n\nI was going to do my father’s eulogy, but wonder if I should back out and just let my brother do it because he is scheduled to speak anyway.\n\nMy brother called and is taking my sister’s side, when there isn’t even sides to take, saying I’m causing unnecessary drama and sticking my nose is my sister’s family. \n\nThe sibling group thanked me for sticking up for them and said this is why they choose not to tell their mom how they feel and confide in me. I’m happy I helped them but am wondering if I AM an asshole for opening my mouth at all and causing unnecessary pain for my mother.\n\nAITA?!? I sure feel like it!",
    "comments": [
        {
            "level": 0,
            "comment": "##[AITA for blocking your go-to time killer from June 12-14?](https://redd.it/145o4jz)\n\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n &gt; I caused my grieving mother more pain by trying to stick up for my adopted nieces and nephews who were not asked to participate in my father’s funeral\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "score": 1,
            "author": "Judgement_Bot_AITA"
        },
        {
            "level": 0,
            "comment": "NTA. It is obviously a very sensitive time for your mother, as well as the rest of you having just lost your father. But it sounds like you just asked a question, that seems to be a reasonable one. One of the adopted children probably should have been included. It was likely ok for you to ask. Upsetting your newly widowed mother is obviously not good and to be avoided if possible, but in balance asking about the inclusion of your nieces and nephews was reasonable.",
            "score": 22,
            "author": "lakehop"
        },
        {
            "level": 0,
            "comment": "NTA.  Didn't seem like a loaded inquiry to me but guess it was to your sister.  Is she at odds with her adopted children?  Sorry your mom got upset but honestly sounds like your sister's overreaction caused your mom to be upset more than your actual question.  Sorry for the loss of your father and sorry also for the family discord caused by your reasonable question.  I don't see where you particularly did anything wrong.",
            "score": 20,
            "author": "Realistic_Head4279",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, they are “adults” now (aged 17-23) and finally feel they can express (with me) how they’ve been treated. 3 are at complete odds with my sister (she blames them, they blame her) and 2 just don’t get into drama, even though they voice trauma my sister has caused them. My father did not raise us this way. We didn’t say step or foster or adopted, only family. I truly believe he would want one of the adopted involved in some way.",
                    "score": 10,
                    "author": "Kirsirine",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You sound very reasonable and caring of your family.  I suspect your father would appreciate what you tried to suggest.  I too have a blended, mixed-up, wonderful family that I am very thankful for.  We often laugh about how most of us are very close and connected in the family way in spite of some of us not sharing one drop of blood.  All are equally embraced.",
                            "score": 5,
                            "author": "Realistic_Head4279"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA, but probably shouldn’t have done so in front of your mom. \n\nAs an adopted child, I wish I had an aunt like you.",
            "score": 9,
            "author": "Sokodal",
            "replies": [
                {
                    "level": 1,
                    "comment": "Regretting I didn’t stop the conversation when my mom walked in. 😞😞 I’m glad they can confide in me. I love them all so dearly but I don’t know if I’m ever really helping them or making things worse. It shouldn’t be an issue but they are treated differently and my dad hated it. Normally, I’d tell my dad and he could keep the peace, but he’s gone now. I’m heartbroken for how this played out. I think I am the asshole for sure now. 😢",
                    "score": 7,
                    "author": "Kirsirine",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "NTA! You’re all grieving and it’s especially hard on your mom. I think avoiding anything extra to her plate may have been the better way, but it didn’t sound intentional. Realistically, you should be able to have easy going conversations like the one you proposed. Your sister didn’t help. \n\nIt sounds like you have a lot more sympathy for your nieces and nephews than your sister does, which is highly unfortunate. I don’t know how old they were when they became a part of the family, but it’s their grandfather that passed too. You did a kind thing looking out for them and in all likelihood, you’re a light for them.",
                            "score": 2,
                            "author": "Sokodal"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Info: why weren’t you involved in the planning for the funeral? You are “allowed” to ‘stick your nose in’ the funeral planning for your father, you know. (And that’s what you did here) NTA \n\nI too would be rather insulted by being overlooked as a member of the official funeral party by both my mother, my grandmother and siblings, and being replaced by a “boyfriend-of-nine-months”, and the only explanation is that nobody of the people planning sees the adoptive siblings as family. (And considering the comment about inviting former step-children of your sister, the boyfriend probably won’t last long either)\n\nYour sister blowing up and demanding you narc on a specific sibling is probably a well established pattern of abuse in your sister’s family dynamics, and I’m guessing the adoptive siblings has been playing scapegoats all their childhood. That’s why they don’t talk to their mother about their feelings in this situation, because they have been thought their feelings are worth less than everyone else’s. Good on you for trying to stand up for them.",
            "score": 5,
            "author": "Purple-Garden77",
            "replies": [
                {
                    "level": 1,
                    "comment": "I didn’t want too many cooks in the kitchen for my mom.",
                    "score": 1,
                    "author": "Kirsirine"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA\n\nThere is nothing wrong with asking a simple, perfectly valid question, your sister is the one creating drama with her reaction. The only reason I can think of without knowing the people is height, pall bearers have to be of similar height and also strong enough to carry the weight.",
            "score": 3,
            "author": "HP1029"
        },
        {
            "level": 0,
            "comment": "Esh, why did you have to ask your sister in front of your mom? You knew it wasn't going to go well. \n\nYou should have just asked your brother. He may have gave you an answer. Or your mom on her own, I'm sure her kids fighting is what actually made her cry. And she would have been able to answer any just fine if on her own. She was just reacting to your sister's reaction sounds like.",
            "score": 2,
            "author": "Pale_Economist_973",
            "replies": [
                {
                    "level": 1,
                    "comment": "My mom walked in and sat down mid-statement. I was too far in but should’ve just stopped in hindsight.",
                    "score": 3,
                    "author": "Kirsirine",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yta, but only cause you know you didn't have to finish the question. You just said you could have stopped.\n\nIt's a great thing that you did for your nieces and nephews, but you low key knew how your sister was going to react rather your mom was in the room or not. And your mother would have heard her regardless. \n\nYou should have just asked your mom one on one like \"Hey, why didn't we make (oldest adopted grandson) a pallbearer or a honorary pallbearer?\" \n\nOk one more question, but this is just me being completely nosy and you don't have to answer but... you said your sister never treated her adopted children the same as her bio children...how did/does your parents and brother feel about it. Like I'm sure y'all had personal conversations about how she treats her kids, does everyone but you treat the kids like your sister treats them?",
                            "score": 2,
                            "author": "Pale_Economist_973",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My brother does not live close so he doesn’t see what my sister does. My dad hated it and my mom treats everyone the same, even inviting former step-children of my sister’s to family events.  I normally would confide in my dad and he would keep the peace, so I felt lost without his guidance. Not a defense, but my mom was on the phone when she sat down so I didn’t think she was paying attention. But I wasn’t paying attention. The adopted kids are heartbroken and I’m an asshole again because I made it worse for them with their mom. They’re telling me thanks but also telling me my sister is blowing up their phones when I was only trying to ask a question. I do feel like my dad would be proud of me…NOT for causing my mom pain, but sticking up for his grandchildren.",
                                    "score": 5,
                                    "author": "Kirsirine",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ok in that case NTA, and they got your dad messed up cause they know he wouldn't go for it. \n\nI'm glad they have a aunt like you",
                                            "score": 2,
                                            "author": "Pale_Economist_973"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't know, the thing with funerals are its high stakes. I think you pulled the wrong move here and should have just left it alone. It kind of feels like you're making the funeral about these kids when it isn't supposed to be. It wasn't the time or place to have this kind of conversation and your backhanded remark to your sister about her kids was rude.\n\nESH, but your Mother, who shouldn't have to be putting up with any of this bullshit.",
            "score": 1,
            "author": "New-II-Reddit",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am the asshole. I should’ve put in that my dad would’ve wanted them included, as he hated what was going on. That’s the only reason I brought it up. But you’re right. He’s gone, this is for the family only (especially my mom) so I should’ve zipped it.\n\nMy comment to my sister was not intended to be rude or snarky, I was trying to tell her I was just truly trying to help her. I should’ve known, though. Hindsight teaches lessons and I’ve learned my lesson for the future for sure-my sister will never see/admit why she’s the problem. \n\nI hope my dad is not looking down from Heaven disappointed with me. I fear this stupid tragedy will affect my relationship with my mom. It’s killing me. I feel I should just step back for awhile because, while we’ll-intentioned, not one second of what I did helped anyone. I’m disgusted with myself. I miss my Dad and his advice. 😢😢",
                    "score": 3,
                    "author": "Kirsirine",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Even now you're sitting here blaming your sister. You didn't intend to be rude to your sister? After having an argument over this damn nonsense and then saying that shit before leaving the room? You knew exactly what you did.\n\nYou're almost making me feel like you really are the asshole in this situation.",
                            "score": -2,
                            "author": "New-II-Reddit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm not reading that.",
                                            "score": 2,
                                            "author": "New-II-Reddit"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA, but please don’t forego reading your dad’s eulogy because of this. Tell your mom that you’re sorry tor accidentally causing her any pain, it wasn’t your intention, and that you didn’t know she chose the pallbearers. You just know that your dad was closer with the grandchildren than the boyfriend and wanted to make sure it’s what he/she (your mom) wanted and not your sister. Acknowledge that you’re all grieving and that this is hard and suggest you all take a deep breath and try to get through this together.",
            "score": 2,
            "author": "Nelsie020",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great advice, thank you!",
                    "score": 2,
                    "author": "Kirsirine"
                }
            ]
        },
        {
            "level": 0,
            "comment": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy father just passed and it’s obviously rough on the whole family. We are a large, blended, close-knit family of adopted siblings/nieces/nephews/children. \n\nMy adopted nieces and nephews (a 5 sibling group adopted by my sister) don’t feel my sister always treats them all the same as her biological children. As their aunt, they ask me to often speak for them. It’s never gone well when I do. So I haven’t done so in awhile.\n\nDuring funeral planning, my sister, mother &amp; brother chose 6 pall bearers (my father’s siblings, my brother, my sisters 2 bio kids and my sisters bf). None of the adopted sibling group were asked to participate. Collectively, they asked why a bf (whom they don’t approve of because he has a felony record-whole other story) over them would be chosen. I told them I I didn’t have a say and told them to ask their mom. \n\nThe group didn’t want to cause heartache so they asked me to find out why but keep it confidential. I casually asked my sister (unfortunately if front of my mom) if we as a family should include one of the adopted sibling group to be a pall bearer over my sister’s bf.\n\nMy sister blew up. “Where is this coming from? Which of my kids said to bring this up?” I replied with, the sibling group often feels left out so I’m just thinking we should include one over your bf because you’ve only been dating 9 months and aren’t married. \n\nMy mother chimed in and said she chose the people and can explain to the group why. I said it’s not a big deal, just trying to include everyone.\n\nBecause she just lost her husband of 51 years, she began sobbing and ran outside, saying she doesn’t want anyone to feel left out but arrangements are finalized. I felt awful that I made my mother cry, tried to help, but my mother wanted to be alone.\n\nMy sister became hostile, demanded me to tell her which of her kids brought this up, and told me off for making my mom cry.\n\nI responded that I’m just trying to include the adopted children, I don’t care who the pall bearers are and just wanted to give her children a voice and participation in the arrangements. I decided to leave but turned and said, “I’m honestly not trying to cause drama but am specifically trying to help you with your kids.” And shit hit the fan.\n\nThe whole family is now irate at me for bringing unnecessary pain to my mother when all I was pointing out is that ALL the grandchildren should be equally included.\n\nI was going to do my father’s eulogy, but wonder if I should back out and just let my brother do it because he is scheduled to speak anyway.\n\nMy brother called and is taking my sister’s side, when there isn’t even sides to take, saying I’m causing unnecessary drama and sticking my nose is my sister’s family. \n\nThe sibling group thanked me for sticking up for them and said this is why they choose not to tell their mom how they feel and confide in me. I’m happy I helped them but am wondering if I AM an asshole for opening my mouth at all and causing unnecessary pain for my mother.\n\nAITA?!? I sure feel like it!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        }
    ]
}