{
    "id": "1466m6r",
    "score": 7,
    "title": "AITA for bringing home a kitten?",
    "author": "iiredgm",
    "date": 1686419727.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1466m6r",
    "media_urls": [],
    "other_urls": [],
    "postText": "So, I'm a freshman at university and I live alone pretty far away from my hometown (think other side of the country). Today, while going home, I found the tiniest kitten on the sidewalk with no mom cat or other kittens around and no one knew where it came from. It was shaking from all the loud noises and I felt really bad just leaving it there, especially running the risk of it being ran over. \n\nSo, I grabbed it and brought it to the vet to get checked out. It needed milk, and some medicine for its eyes. All in all, the vet took 40€ from me, and it was an impulse decision to pay it because what else was I going to do? Dump the kitten in the vet clinic and run off? \n\nI took the kitten home and put it in a box as I searched for someone to take care of it. I would keep it but it requires constant attention and expenses, which I can't give because it's exam season, I'm a broke uni student and I'm expecting my adopted dog to come within the next weeks. It simply wasn't an option. \n\nSo, in my blind panic on what to do, I called my mom, who lives halfway across the country. The second I told her I found a kitten, a flip switched and she went off, yelling at me about being so irresponsible. Then, I mentioned bringing it home and the vet bill and that's what did it. \n\nShe cursed me out for being so stupid and wasteful, because in the past I've developed skin irritations due to touching a stray kitten and it took me months to recover. Admittedly, I should have thought of that before handling the kitten with naked arms and legs and letting it roam inside my house for a bit. She yelled at me for being idiotic enough to bring so many germs in my home and wasting money. \n\nThe call ended with me in tears because she told me she'll be pulling me from uni next year and that she regrets ever trusting me. She told me to get rid of the kitty immediately or she'd force me to go home the same day. I lied to her that I did, which I still feel guilty about. It's been a day, and I'm still feeling fucking awful. \n\nSo, AITA for trying to help the kitten?",
    "comments": [
        {
            "level": 0,
            "comment": "##[AITA for blocking your go-to time killer from June 12-14?](https://redd.it/145o4jz)\n\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n &gt; I may be the asshole because I made many impulsive decisions and spent money, time and risked my health without thinking about it\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "score": 1,
            "author": "Judgement_Bot_AITA"
        },
        {
            "level": 0,
            "comment": "Wow your mom is controlling and abusive. NTA.",
            "score": 9,
            "author": "wartwyndhaven"
        },
        {
            "level": 0,
            "comment": "NTA \n\nHow can your mom pull you from uni though. You should be legally an adult if you attend uni, so she cannot pull you from anywhere against your will.\n\nIf it's a money issue, I would check out government programs for uni students. Some EU countries like Germany have student loan programs to help with living expenses etc.\n\nYou did a good thing and helped an animal in need. Don't let her destroy the good in you by making you feel bad for a good deed. Stand up for yourself.",
            "score": 8,
            "author": "katyesha",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, but I'm really tired of standing up for myself against someone who doesn't listen.\n\nIt is a money issue and unfortunately my government doesn't take me into account because of my parents' income. They are the only ones who can fund my rent and living expenses\n\nThanks anyway for the advice &lt;3",
                    "score": 1,
                    "author": "iiredgm"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA. Stop telling your mom your business. She sounds awful. Thank you for saving the kitty.",
            "score": 6,
            "author": "Sunshinehappyfeet"
        },
        {
            "level": 0,
            "comment": "NTA- maybe find out more about what caused the rash. I am allergic myself and lived with them for a while.",
            "score": 4,
            "author": "nickles72",
            "replies": [
                {
                    "level": 1,
                    "comment": "I saw two dermatologists and both agreed it was a virus from a stray kitten. It took many months to heal and there's still a visible scar, so that's why I feel so guilty",
                    "score": 2,
                    "author": "iiredgm"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA- Your mom is an insensitive jerk. I wouldn't feel guilty about lying, and one day, when you're done with universities, I would let her know how horrible and heartless and controlling her behavior is. As a mom, I would be exasperated, but I would never insult my kid or threaten them like this. If your skin is a true issue, you should rehome the kitty, tho. To avoid more bills hun. Also, when you have the time, you should see a dermatologist if that skin rash comes back.",
            "score": 3,
            "author": "Ok_Introduction_7274",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, this is a very sweet comment! It made me feel a little better :)\n\nThe kitten was given to an animal shelter to be hopefully adopted soon so he's all safe and sound now. No sign of rash yet, but if one comes up, I know what to use this time thanks to the last time this happened.\n\nIt's nice to hear other moms wouldn't think this is normal, it makes me feel a little bit less guilty about making her mad",
                    "score": 2,
                    "author": "iiredgm",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Aw, you're welcome, sweetie. And no, this behavior is definitely not normal of mothers. I'm glad the kitty will be in safe hands though, you did a kind thing helping that kitten out. You should never be ashamed of having a good heart.",
                            "score": 1,
                            "author": "Ok_Introduction_7274"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo, I'm a freshman at university and I live alone pretty far away from my hometown (think other side of the country). Today, while going home, I found the tiniest kitten on the sidewalk with no mom cat or other kittens around and no one knew where it came from. It was shaking from all the loud noises and I felt really bad just leaving it there, especially running the risk of it being ran over. \n\nSo, I grabbed it and brought it to the vet to get checked out. It needed milk, and some medicine for its eyes. All in all, the vet took 40€ from me, and it was an impulse decision to pay it because what else was I going to do? Dump the kitten in the vet clinic and run off? \n\nI took the kitten home and put it in a box as I searched for someone to take care of it. I would keep it but it requires constant attention and expenses, which I can't give because it's exam season, I'm a broke uni student and I'm expecting my adopted dog to come within the next weeks. It simply wasn't an option. \n\nSo, in my blind panic on what to do, I called my mom, who lives halfway across the country. The second I told her I found a kitten, a flip switched and she went off, yelling at me about being so irresponsible. Then, I mentioned bringing it home and the vet bill and that's what did it. \n\nShe cursed me out for being so stupid and wasteful, because in the past I've developed skin irritations due to touching a stray kitten and it took me months to recover. Admittedly, I should have thought of that before handling the kitten with naked arms and legs and letting it roam inside my house for a bit. She yelled at me for being idiotic enough to bring so many germs in my home and wasting money. \n\nThe call ended with me in tears because she told me she'll be pulling me from uni next year and that she regrets ever trusting me. She told me to get rid of the kitty immediately or she'd force me to go home the same day. I lied to her that I did, which I still feel guilty about. It's been a day, and I'm still feeling fucking awful. \n\nSo, AITA for trying to help the kitten?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "NTA.  Your mum is a deranged control freak.\n\nHOWEVER: You should learn from this.  DO NOT call your mum to ask for help.  EVER.  Delete her number from your phone if you think you might call her in a panic again.  I’m serious.",
            "score": 1,
            "author": "kilinrax"
        },
        {
            "level": 0,
            "comment": "NTA\n\n&amp;#x200B;\n\nSTOP telling your mom ANYTHING, she sounds controlling and abusive.",
            "score": 1,
            "author": "Capable_Fig3903"
        }
    ]
}