{
    "id": "14671bd",
    "score": 0,
    "title": "AITA for arguing that Jimin from BTS did not sing the famous \"Seňorita\" against my mom?",
    "author": "Ih4tef34r",
    "date": 1686420775.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/14671bd",
    "media_urls": [],
    "other_urls": [],
    "postText": "\nSo this morning my mom (50 F) showed me a fan-made video of the famous song \"Seňorita\" but with footage of Jimin from BTS edited onto it to make it look like it was an official music video ( \nthe video had 6 million or so views). She made it sound like Jimin was singing the song (\"Would you expect to hear that voice from this man?\" she told me). \n\nI (18 F) pointed out that this was a fan made video, but she insisted that Jimin was actually singing. Then she showed me another video of him singing one of his actual parts. I told her this didn't prove anything. Then she showed me another video that was titled something like \"How would Korean singers sing Seňorita\" or something similar. It was a bunch of pictures of famous Korean singers, and whenever a certain part would come up the picture would change accordingly to make it seem like the person in that picture was singing. Another fan made video.\n\nI also pointed this out, and she got pretty upset although she was not angry. I made her pretty sad. She was excited to share this thing she liked with me and I feel like I've ruined it for her. Maybe I could have played along and acted as if what she believed was true? I don't know, since that feels like lying. Should I have played along instead of insisting on the truth? Am I the asshole for making her sad because I insisted on the truth? Maybe I should've let her have it, y'know.",
    "comments": [
        {
            "level": 0,
            "comment": "##[AITA for blocking your go-to time killer from June 12-14?](https://redd.it/145o4jz)\n\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n &gt; I believe I might be the asshole because I made my mom sad in a situation that didn't matter. I could have pretended like what she believed was true so that she would not be sad.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "score": 1,
            "author": "Judgement_Bot_AITA"
        },
        {
            "level": 0,
            "comment": "NAH, but sometimes you gotta let your mom just be excited and wrong. It wasn't about the video, it's about her bid for connection with her child over something she thinks you'd like. She probably could care less about the video, in the grand scheme of things. My mom does the same thing, and I learned to sometimes just let it go, because connecting with her and thus making her happy was more important than being right about an inconsequential internet video.",
            "score": 4,
            "author": "manwathiel_undomiel2"
        },
        {
            "level": 0,
            "comment": "NTA, because if she shared it with you then she might have shared it with other people and have learned it wasn't true anyway.\n\nI saw a really good LPT on a reel from a psychiatrist (I know, I know) about teaching kids the difference between being pedantic and truthful. It's usually about the timing. In the moment someone is looking for connection or conversation it can be helpful to affirm them with general statements like \"I appreciate you sharing that with me\" or \"I love that song\". Then, after a period of time you can revisit the thing and present it as new info. \"Hey, you remember that video you showed me yesterday? I went to their official page and was bummed that he wasn't the real singer. Isn't it crazy what they can do with technology these days?\" \n\nBasically, affirm her impulse to connect with you, and when things have cooled down a little gently correct the information itself. It's tricky, but if you learn how to do this people will view you as smart but you won't be seen as being one those \"Well, actually...\" people who tend to shut down conversations.",
            "score": 2,
            "author": "oopsometer"
        },
        {
            "level": 0,
            "comment": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nSo this morning my mom (50 F) showed me a fan-made video of the famous song \"Seňorita\" but with footage of Jimin from BTS edited onto it to make it look like it was an official music video ( \nthe video had 6 million or so views). She made it sound like Jimin was singing the song (\"Would you expect to hear that voice from this man?\" she told me). \n\nI (18 F) pointed out that this was a fan made video, but she insisted that Jimin was actually singing. Then she showed me another video of him singing one of his actual parts. I told her this didn't prove anything. Then she showed me another video that was titled something like \"How would Korean singers sing Seňorita\" or something similar. It was a bunch of pictures of famous Korean singers, and whenever a certain part would come up the picture would change accordingly to make it seem like the person in that picture was singing. Another fan made video.\n\nI also pointed this out, and she got pretty upset although she was not angry. I made her pretty sad. She was excited to share this thing she liked with me and I feel like I've ruined it for her. Maybe I could have played along and acted as if what she believed was true? I don't know, since that feels like lying. Should I have played along instead of insisting on the truth? Am I the asshole for making her sad because I insisted on the truth? Maybe I should've let her have it, y'know.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        }
    ]
}