{
    "id": "146av3u",
    "score": 19,
    "title": "AITA for making a bet on whether my sister would come to our brother’s wedding or not?",
    "author": "NeedleworkerDue337",
    "date": 1686430580.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/146av3u",
    "media_urls": [],
    "other_urls": [],
    "postText": "*Throw away*\n\nMy sister (22F) and our family doesn’t have the greatest relationship. She moved out when she was around eighteen and has kept her distance for the most part. She will occasionally reach out on special occasions, but she doesn’t attend any holidays or birthday parties. Our brother (24M) invited our sister to his wedding out of, what I’m guess is curtesy, because they don’t have a close relationship. \n\nMy brother and I (26M) made a bet on whether our sister would come or not. My bet was that she wouldn’t come, and if I was right he would pay me $50. My brother made the bet that my sister would come, so if she showed up I would have to pay him $50. Our other family (My wife, his (now) wife, our parents, and some of our cousins) knew about the bet, and they also made their own predictions. \n\nMy sister ended up showing up to the wedding. At the reception my wife and I approached my sister, and we were catching up since it had been a while since we last spoke. Everything was fine, and we were joking around. One of our cousins joined us, and he pointed out that I now owe my brother $50 because our sister showed up. My sister was confused, so I explained the bet to her. I jokingly said that I’m glad she’s here, but losing $50 sucks. My sister didn’t find this funny, and avoided me the rest of the night. \n\nMy brother was mad at me for telling our sister about the bet, but most people agreed that she was being sensitive to the whole thing. I didn’t mean any harm to my sister, but I can see how she could take it the wrong way. AITA?",
    "comments": [
        {
            "level": 0,
            "comment": "##[AITA for blocking your go-to time killer from June 12-14?](https://redd.it/145o4jz)\n\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n &gt; 1. I made a bet that my sister wouldn’t come to our brother’s wedding. \n\n2. The bet my brother and I made could have hurt my sister’s feelings.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "score": 1,
            "author": "Judgement_Bot_AITA"
        },
        {
            "level": 0,
            "comment": "When someone stops almost talking with their family is usually for a reason. So I'm biassed probably but.  \n\n\nYTA.   \n\n\nSimply shut up, you didn't have to say that, it is very unnecessary. If I were your sister, I would feel very uncomfortable, like you didn't even want me there.",
            "score": 88,
            "author": "QuinnFWonderland"
        },
        {
            "level": 0,
            "comment": "I bet that the reason your sister doesn't spend much time with your family is because she's often the butt of everyone's jokes.  She probably doesn't always want to gamble on whether she's going to leave a family event upset or not.  YTA",
            "score": 62,
            "author": "ThornLeathergash"
        },
        {
            "level": 0,
            "comment": "YTA. She may very well have her reasons for limiting contact, (perhaps) unbeknownst to you. She does seem to reach out and attend special occassions every now and then, so she does make some effort in regards to important things. \n\nNow let's imagine that she *has* justified reasons for limiting her contact. That means every occassion she decides to attend must be really important, because, despite her reservations and second thoughts, she decides to come; only to find out that her family put money on whether or not she would put her (presumably valid!) issues aside and show up. That is humiliating! \n\nAfter discovering something like that, i could definitely see reasons for her distance.",
            "score": 35,
            "author": "The-Former-Lurker"
        },
        {
            "level": 0,
            "comment": "&gt; I didn’t mean any harm to my sister\n\nINFO\n\nWhat did you mean to do? Tell her that everyone in the family knows about your snide little bet except her and she would laugh?",
            "score": 22,
            "author": "The_Ghost_Reborn",
            "replies": [
                {
                    "level": 1,
                    "comment": "I didn’t think that making predictions on my sister coming to the wedding was something harmful or something that would hurt her feelings in general. My sister isn’t usually sensitive to any kind of joke that is sent her way, and 99% of the time we laugh about this kind of stuff. It’s how our family has always been. \n\nI figured she would have a good laugh, maybe she would roll her eyes at me, or even joke about me losing $50. That’s how she was when we were growing up, so that’s what I expected.",
                    "score": -38,
                    "author": "NeedleworkerDue337",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; I figured she would have a good laugh, maybe she would roll her eyes at me, or even joke about me losing $50.\n\n\"Me and all of the family were talking about you behind your back and making bets on whether you'd show up. I thought you wouldn't. Aren't we funny?\".\n\nSomething like that?",
                            "score": 27,
                            "author": "The_Ghost_Reborn"
                        },
                        {
                            "level": 2,
                            "comment": "INFO why is your sister estranged from your family?",
                            "score": 13,
                            "author": "Huge_Researcher7679",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We just don’t see eye to eye on certain things, and I guess she wasn’t okay with that.",
                                    "score": -31,
                                    "author": "NeedleworkerDue337",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What “certain things”? Is she gay and you’re all homophobic?",
                                            "score": 14,
                                            "author": "Huge_Researcher7679"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "What \"things\"? Like, there's a lot of \"things\" to disagree about and while many would be considered silly reasons to not talk, many more would cause fundamental incompatibility with each other, especially if one party or the other couldn't leave it alone.",
                                            "score": 15,
                                            "author": "calliatom",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’m not going to go into detail about why my sister distanced herself from our family because it doesn’t change anything about this particular situation. If I speak about it, this post will turn into me being attacked for my beliefs/opinions. I don’t think that will help anyone.",
                                                    "score": -39,
                                                    "author": "NeedleworkerDue337",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "So I'm just going to go ahead and assume that it's one of the non-trivial reasons then. YTA. Things are already tense because of your fundamental incompatibility with each other, but she tried to put it aside because on a fundamental level she still *wants* to love and support you all, only to find out that you unanimously decided to make her the butt of a \"funny joke\" that now rings as yet another instance of you all ganging up on her.\n\nETA: Don't worry though OP, I'm sure you'll win next time you make that bet! After all, your sister doesn't sound like the type to keep trying to throw water on a burning bridge once she finds out that everyone else has been throwing gasoline and matches.",
                                                            "score": 40,
                                                            "author": "calliatom"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Oof that'll do it.",
                                                            "score": 10,
                                                            "author": "ttnl35"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shaking my head.  Betting on the behavior of an estranged and distant sister, and then letting everyone in on the bet (i.e., joke).  YTA (along with the rest of your family, excluding your sister).",
            "score": 18,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "YTA. There's a reason she's keeping her distance and making her the butt of the joke won't help matters. Imagine going to a big gathering, where there will be tension because of the distance and then finding out that people were making jokes about you. \n\nYou and your entire family were being increcibly insensitive towards her.",
            "score": 19,
            "author": "Throwaway-2587"
        },
        {
            "level": 0,
            "comment": "YTA.",
            "score": 15,
            "author": "Icy_Department_1423"
        },
        {
            "level": 0,
            "comment": "ESH except your sister. Guess the reason she keeps to herself is fairly obvious if this is how y’all act.",
            "score": 14,
            "author": "Deucalion666"
        },
        {
            "level": 0,
            "comment": "YTA\n\nSetting aside that you refused to say what the difference in \"opinions/beliefs\" are that caused your sister to distance herself...\n\nYou aren't supposed to discourage behaviour you want to see more of.\n\nDo you think this whole bet thing will make your sister want to see more of you guys? Or less?",
            "score": 11,
            "author": "ttnl35"
        },
        {
            "level": 0,
            "comment": "YTA. Very ignorant on your part.",
            "score": 10,
            "author": "AffectionateOwl5824"
        },
        {
            "level": 0,
            "comment": "YTA. What was the point?",
            "score": 9,
            "author": "Twigz8771"
        },
        {
            "level": 0,
            "comment": "Lol no wonder she doesn't come around\n YTA",
            "score": 9,
            "author": "nackle09"
        },
        {
            "level": 0,
            "comment": "YTA. That was rude of you for doing this on your sister.",
            "score": 8,
            "author": "Choice_Evidence1983"
        },
        {
            "level": 0,
            "comment": "Creating pointless drama at a family event.  Yeah, YTA. No wonder your sister wants nothing to do with you.",
            "score": 8,
            "author": "IzzzatSo"
        },
        {
            "level": 0,
            "comment": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n*Throw away*\n\nMy sister (22F) and our family doesn’t have the greatest relationship. She moved out when she was around eighteen and has kept her distance for the most part. She will occasionally reach out on special occasions, but she doesn’t attend any holidays or birthday parties. Our brother (24M) invited our sister to his wedding out of, what I’m guess is curtesy, because they don’t have a close relationship. \n\nMy brother and I (26M) made a bet on whether our sister would come or not. My bet was that she wouldn’t come, and if I was right he would pay me $50. My brother made the bet that my sister would come, so if she showed up I would have to pay him $50. Our other family (My wife, his (now) wife, our parents, and some of our cousins) knew about the bet, and they also made their own predictions. \n\nMy sister ended up showing up to the wedding. At the reception my wife and I approached my sister, and we were catching up since it had been a while since we last spoke. Everything was fine, and we were joking around. One of our cousins joined us, and he pointed out that I now owe my brother $50 because our sister showed up. My sister was confused, so I explained the bet to her. I jokingly said that I’m glad she’s here, but losing $50 sucks. My sister didn’t find this funny, and avoided me the rest of the night. \n\nMy brother was mad at me for telling our sister about the bet, but most people agreed that she was being sensitive to the whole thing. I didn’t mean any harm to my sister, but I can see how she could take it the wrong way. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
            "score": 0,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "NTA\n\nIf your sister rarely contacts your family then I personally think its a fair bet and your sister is being over dramatic when hearing about it.\n\nThe only way you and your brother would be the AH is there are reasons - that you know about - as to why your sister is LC with your family.",
            "score": -8,
            "author": "Sajem"
        }
    ]
}