{
    "id": "146a90u",
    "score": 0,
    "title": "AITA for saying my sister should go to college in state instead of out of state because she has no real goals?",
    "author": "FarTransportation486",
    "date": 1686428995.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/146a90u",
    "media_urls": [],
    "other_urls": [],
    "postText": "First time poster on this sub long time lurker. I'm on mobile so please forgive the mistake reddit lords. \n\nI 24F and my sister 17F have had our differences growing up. I have always been more studious and though I'm not a genius by any means I still tried hard in highschool and got into a good college. I was the first person in my immediate family to go to college as my family doesn't really talk to our extended side even though most of my cousins have gone college for good degrees. (Think medical and engineering). Before I went to college I told my parents of what my plan was and what future career I was planning on doing ahead of time. I researched the money the school would give me as well of help I needed financially. They agreed and said they will help me financially and I graduate with a stem degree in 4 years. I know some might say that might be the norm, but those stem courses were hard and I would struggle to understand a lot of concepts so I'm proud I finished. My sister is the opposite of me. She is VERY rebellious and hard headed. Throughout highschool she disregard my advice on what classes to take, people to hang out with and even testing advice. She would lie and steal often to the point where when my father passed away she would steal money from my parents joint bank account to buy dumb things like make up or food. My father died before he could figure it out it was her but my mom was broken down completely. Fast forward to today I've graduated college worked in my relevant field and I'm hoping to apply to my preferred graduate program soon. My mother who I've helped emotionally since my grandmothers death and my father's death still agreed to help me financially purse this program until I get in. My sister has now graduated highschool and has only go into one school in our state and 2 out of state. My sister has no goals she hasn't even looked at the college department/classes she will need to take for her degree as she is going undeclared. I told my mom to let her go to community college and commute from home but my sister is adamant that it \"will just be like highschool\" and doesn't want to do that. The school she got accepted to out of state is definitely a party school and I don't want my mom to waste money on my sister since my sister doesn't have an academic plan or drivers license( she failed her permit test 6 times). My family and now my mom said since my parents paid for my education and are still helping me then my sister should go out of state. Aita?",
    "comments": [
        {
            "level": 0,
            "comment": "##[AITA for blocking your go-to time killer from June 12-14?](https://redd.it/145o4jz)\n\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n &gt; 1) My parents paid for my education and higher education despite our money issues and I didn't need to work during college. I said my sister should work and should go to a school closer because she isn't goal oriented or even focused on her academic future. \n2) I may have called her dumber or stupid but I didn't say it explicitly to our extended family\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "score": 1,
            "author": "Judgement_Bot_AITA"
        },
        {
            "level": 0,
            "comment": "YTA. \n\nYou tried to force your sister to be like you throughout most of her teenage life and she doesn’t have the emotional skills to say “hey, I don’t like that,” so she turned to rebelling to communicate that **she is not you!** \n\nYour sister is her own person. If she wants to make mistakes, let her! She’s 17! But if she’s looking at out of state schools, she likely wants to get away from home, and you trying to block that… that’s really even worse than trying to control her.",
            "score": 39,
            "author": "SoleIbis"
        },
        {
            "level": 0,
            "comment": "YTA you can't dicate plans for people or finances. You have to let people make mistakes to learn from them.",
            "score": 32,
            "author": "MotherBike"
        },
        {
            "level": 0,
            "comment": "Honest question: do you want your sister to go to community college so that your Mom has more funds to give you for grad school? If I was your sister (who is 17, recently lost her father, and has a judgmental brother and a mother taking parenting advice from this brother, yet still got into three colleges despite some rebellion), I would question your intentions.",
            "score": 30,
            "author": "IndependentEarth123",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nope also I'm a woman. Ive paid for parts of the tutoring service including other tutor subscriptions I thought would help her during highschool. I was working trying to get relevant experience in the industry I'm trying to break into and though it's not a lot of money my mom said I could live at home rent free so I saved. I've paid for food, clothes and routinely drove her places when I lived at home. She likes to go online shopping a lot and I've even paid for stuff she wanted to get even though she has used my card without my permission multiple times. If I get into my grad program I would be on my own my mom stated that and honestly I would be fine for the most part even if I will be in debt. I've even thought of apply to programs in the state my sister wants to go to college just so I can keep an eye on her. I can't pay for her entire college education but I still want to offer guidance. I'm in a post bacc right now and even got a nice scholarship which I gladly used a part of to contribute for a down payment for a new car for her. During her highschool days it was my mom begging me to give her advice on what kind of classes my sister needs to take and she consistently failed, cheated and would often argue with teachers about her lack of attendance. I still love my sister and just want her to go in state to save money so when she does figure what she wants she won't have this huge debt on her.",
                    "score": -21,
                    "author": "FarTransportation486",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe your sister would like some space from you and your ‘guidance.’",
                            "score": 20,
                            "author": "Amiedeslivres"
                        },
                        {
                            "level": 2,
                            "comment": "Oh really ? \n\n&gt; Ive paid for parts of the tutoring service including other tutor subscriptions I thought would help her during highschool\n\nAnother comment from you.\n\n&gt;No the tutoring service was for me originally when I was in high school. When I graduated and went to college my parents liked the service and enrolled my sister. I thought the tutoring service didn't really fit my sisters needs but my dad a that time said if it worked on me then it will help her.",
                            "score": 14,
                            "author": "anelis29",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The tutoring service and subscription are not the same thing. The tutoring service for her specifically started while I was in college and when my dad was alive. It continued when I was out of college and working while living at home. When my dad passed my mom was still paying for it. The service was a physical person would come and help her with homework and if she had questions she would ask them while the subscription was like chegg which she asked me to get her and I agreed it would be helpful. My mother was the one who was adamant that both  were a good idea despite the cost and would often pay for the majority of the services and sometimes reimbursed me for paying the monthly subscription. We all agreed that my sister needed tutoring including my sister. She was never forth coming about her grades and when my mom forced my sister to show her grades and saw she was flunking majority of her classes even with the tutoring service my mom was paying thousands for my sister said she also needed chegg which I offered to help with paying since I was working and staying at home. When my dad passed bills start to pile and my mom was obviously stressed so I offered to at least help with the tutoring service cost as well until my sister graduated. I found this tutoring service in my senior year and only had it for one semester. My parents liked the tutor so the enrolled for sister when she was at least a sophomore and had continuously paid for it. I told my parents that I didn't think the service would fit my sisters needs but they said they didn't care and said if it worked for me in that short of a time then it will help my sister.  My sister only asked for the tutor subscription ( chegg) in her senior year.",
                                    "score": -9,
                                    "author": "FarTransportation486",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Bla bla bla. \n\nYou are saying the same thing. You benefited from your parents money and you don't want you sister to have the same opportunities, because, let's face it, you are hoping that your mom will pay for grad school.\n\nYour mom doesn't agree with you, your dad did not, your sister clearly doesn't, and yet you keep on going.\n\n&gt; I told my parents that I didn't think the service would fit my sisters needs but they said they didn't care and said if it worked for me in that short of a time then it will help my sister. \n\n&gt;I found this tutoring service in my senior year and only had it for one semester.\n\nWhy didn't you ask your sister if you having this tutoring service was a good idea, since your opinions on her life are important, maybe hers about your should be too ?",
                                            "score": 15,
                                            "author": "anelis29",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My mom isn't going to help out with my grad school payment nor do I want her to. My mother said she will be help with sister's school fees regardless but wanted my opinion first which I gave. My sister literally didn't care and was in middle school at the time. Im not after my mom's money at all. I appreciate what my parents did and I have used those advantages to get to where I am I just don't want my sister to be in mass debt. Highschool mistakes/ rebellion happens I get it but college mistakes follow you even when you're done. Staying in state makes sense financially and I even convinced my mom that transfer could also work too.",
                                                    "score": -4,
                                                    "author": "FarTransportation486",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Is your mom going to maybe help you with pararaphs ?\n\nYou used those advantages to be an unemployed 24 year old.\n\n&gt;Staying in state makes sense financially and I even convinced my mom that transfer could also work too.\n\nStop meddling in your sister's life !",
                                                            "score": 6,
                                                            "author": "anelis29",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I posted this because while most of my friends agree with me I wanted an outside opinion. I didn't wanted to be in an echo chamber and I wanted to see if I was missing something.",
                                                                    "score": -1,
                                                                    "author": "FarTransportation486",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You are missing the whole point. \n\nIt is not for you to judge you sister's choice of college.\n\nYou got your free ride to college, now you are worried about finances, because your mom will pay for her schooling too ?\n\nYou have no debt because the life insurance paid it off.\n\nWhat does your sister get ? \n\nA judgemental sister.\n\nAgain, if you're so great at advising people on their lives, why are 24, unemplyed, living for free with you mom ?",
                                                                            "score": 9,
                                                                            "author": "anelis29",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I never meant any harm and my opinion was asked again by my mom. I knew regardless my mom would pay the majority of my sister's college bills which was the plan from the start. I'm happy with that and I'm not trying to come off as jealous at all. I know I've had differences with my sister before but this has nothing to do with that. It's not like this is the first time my parents or my sister asked for my advice. As for my plans again the career I want to go into will have me in school for a long time which I've accepted as well as my mother has accepted. I was the one who had to explain the process to my mom anyway just so I can be transparent. I don't think I'm bad for living at home rent free while pursuing high education if the option is available to me. I know I've had privileges I'm not denying that but I also know that my sister is naive about the whole undergrad finances process and my mom is the one who is asking me to explain things to her or give her some perspective. Both of my parents made it clear that the value higher education will help both of us. My sister just hasn't been forthcoming with her grades in highschool so my mom was worried if she will continue that pattern in college which I think so but who knows maybe she will change. Regardless, it is my mom's money not mine and I certainly won't be getting any of it nor do I want it.",
                                                                                    "score": -1,
                                                                                    "author": "FarTransportation486",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "YTA I don't think it's your choice. I doubt most people at 17 have their lives figured out or know what they want to major in. And it's not your choice; it's between your mom and your sister. Let her make her own decisions.",
            "score": 14,
            "author": "Spotzie27"
        },
        {
            "level": 0,
            "comment": "YTA. \n\nIt’s not up to you what school your sister goes to or whether or not your mum gives her money. \n\n&gt;I told my mom to let her go to community college and commute from home \n\nMaybe your sister hasn’t got any goals because you keep dictating what she’s “allowed” to do",
            "score": 14,
            "author": "New-Pea-3721"
        },
        {
            "level": 0,
            "comment": "INFO: Does your sister’s decision directly impact you? Are you sharing the expense of it or will your life/comfort be diminished by her choice?\n\nEdited to add judgement: YTA. Mind your business and quit trying to boss your sister around.",
            "score": 13,
            "author": "consectariana",
            "replies": [
                {
                    "level": 1,
                    "comment": "It wouldn't be directly. I still care about my sister and I want her to succeed. I'm not forcing her to do anything nor did I do that during her highschool years. My mom wanted to get my advice so I told her that since my sister had no real academic plans with her history of stealing/lie to my mom consistently can we really trust her to be studious in school. Both me and my sister had tutors during highschool and it was me who beg to get said tutoring service because I knew I needed it and my parents like that I got to college with it so they enrolled her as well. All I'm saying is that I'm looking out for her and I don't want her saddled with debt and no real way to pay it off since her only answer to what she wants to do in the future is \" not be like you and keep going to school but making real money\". My dad life insurance helped pay off my remaining debt as well as my mother's and other expenses.",
                    "score": -10,
                    "author": "FarTransportation486",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Your parents paid for education (and you think your sister is undeserving ? ) your mom still pays for you and you used your dad's life insurence to get out of debt.\n\nDo you have a job ?",
                            "score": 11,
                            "author": "anelis29",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I did have a job but I went back to school took out more loans and got a scholarship to help pay. I've used said money to help pay for a tutoring service as well as tutoring subscriptions that she used when she was in highschool. Mom said I didn't need to pay rent when I was working so I saved a lot and would often pay for small things my sister wanted like food or clothes. My sister would online shop a lot and would even take my card without my permission but I still paid for things if she asked me. I don't want to seem like I'm controlling I just want to offer my sister guidance as she would save a lot more money and even get some refund back if she stayed in state. Then she could save as she won't worry about rent if she lived at home and she could work if she wanted to not that I would judge her if she didn't.  Also the college I went to was instate.",
                                    "score": -2,
                                    "author": "FarTransportation486",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You did not answer the part about your dad's life insurance, how much did you sister get ?\n\nYou told her that she has no goals, that's not advice.\n\nYou are 24 and still figuring thing out, why shouldn't she get the same opportunity ?",
                                            "score": 12,
                                            "author": "anelis29",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My father had no formal will as he died very suddenly it was I that found him and my sister called the emergency services. Mom handled all finances I'm that regard I couldn't touch at all and my mom was the main bread winner in the home anyway. She decided where the money went and she got herself a new car paid full as well as paying off other expenses. She didn't tell me the full details just that my little undergrad debt is paid for. My sister was 16 at that time. My mom has routinely complained to her to talk to me about college when she was a junior and my mom begged me to talk to her about my sister's career goals. All my sister has told my mom and me that she wanted to go into computer science specifically IT. Then she changed her mind again to English then back to IT. I said that she doesn't need to go to a 4 year for IT and since my sister is adamant that she \" doesn't really care what she does as long as she gets money\" which I said ok then go to community stay close to home and save.  My mom for some reason hates the idea of community college saying it's not a \"real degree\" I told my mom my sister can transfer and that if she changes her mind on her degree at least she won't have any real debt to pay for. My mom said I was discouraging my sister and my sister isn't aiming high enough. I understand my sister is still figuring out but I know things change a lot with my sister and with college those changes stack up I just don't want her to struggle too much. I could care less what kind of degree she gets but I would like to see her pursue college as it will help in the future. I don't see how that's controlling. I've definitely made some bumps on the road but I know I'm different than her and I planned ahead for those bumps and made some adjustments to my course but my goal is still the same.",
                                                    "score": 1,
                                                    "author": "FarTransportation486",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Again, your school was paid by your parents.\n\nWhy do you get to decide that she does not deserve the same opportunities as you ? Because she is 17 and still hasn't decided the rest of her life ?\n\n&gt;I've definitely made some bumps on the road but I know I'm different than her and I planned ahead for those bumps and made some adjustments to my course but my goal is still the same.\n\nWhy do you think you are so much smarter and special than your sister ? \n\nIs your actually worry that by helping your sister, your mom wouldn't spend as much on your education ?",
                                                            "score": 8,
                                                            "author": "anelis29",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "No. I could worded the first phrase better so I admit I was wrong on that. My mom often bugs me with questions regarding sisters education and what would be the best course she could take. My mom has told me once I get into the graduate program I'm applying for I'm on my own financially and informed her I'm well aware I will be in debt. After college I was working in my relevant field to gain more experience and I didn't have enough money to move into my own place. My mom stated I didn't need to pay rent and I my sister would often times come ask me to pay for clothes food and other things she wanted. Teenager things. I didn't mind at all. When my mom said my sister wanted a tutoring service I paid for it to help her with her homework. My mom would ask me constantly if my sister had a chance of going to the college I went to because throughout my sister highschool years she would flunk class or just not show up. This was during the pandemic when all her classes were online. I literally had to take her final for her for one of her classes after my sister stated she was going to fail again. My mom panicked and begged me to help with that by just taking it for her. \n\nMy sister was interested in going into community college and she wanted a job but it was my mom who wanted her to focus on her highschool classes because she was literally flunking them. I tried to convince my mom that community or trade school is not bad at all and my sister doesn't need to go the exact route as me but my mom took that as an offense and stated I'm trying to discourage my sister from applying to a 4 year. I gave my advice when I was asked and my opinion. I've explained my reasoning to my sister multiple times and even tried to get in contact with an old advisor. My sister still just wants to go out of state and even if hae has to go into debt and will figure it out as she goes. The 4 year instate school that my sister got into isn't that great and she has expressed she is embarrassed to go there but I told her she could always transfer. Plus she would save a lot more money and even get some back. The school I went to was also instate as well as my post bacc program.",
                                                                    "score": 0,
                                                                    "author": "FarTransportation486",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I am not trying to be mean, but you seem very condecending. You had your college paid by your parents and your debt by your dad's life insurance. \n\nYou said in another comment that the tutoring service was your idea and for the both of you.\n\nYou are 24, why do you thing your opinion on your sister's choices is that important, how would you have felt when you were 17 and someone else tried to make decisions for you ?\n\n&gt; I tried to convince my mom that community or trade school is not bad at all and my sister doesn't need to go the exact route as me but my mom took that as an offense and stated I'm trying to discourage my sister from applying to a 4 year.\n\nWhy do you think your opinion matters more than your mom's and your sister's wishes ?",
                                                                            "score": 7,
                                                                            "author": "anelis29",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "No the tutoring service was for me originally when I was in high school. When I graduated and went to college my parents liked the service and enrolled my sister. I thought the tutoring service didn't really fit my sisters needs but my dad a that time said if it worked on me then it will help her. When my dad passed my mom still continued to pay for that particular service and I paid for the subscription service since my sister came to me and asked for it. I'm not saying my opinion matters more I have my opinion when my mom asked. Both of my parents didn't go to college in the USA and were unfamiliar with how undergrad worked until I went and explained it to them especially the cost. My mom went back to school after my dad passed and I also helped her apply for a better job since she isn't as tech savvy her words not mine.",
                                                                                    "score": 0,
                                                                                    "author": "FarTransportation486",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You need to step back. It's very possible your sister is rebelling against you.",
                                            "score": 2,
                                            "author": "Bethsmom05"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "YTA, why do you care? Also, you know you aren’t better than someone, right? Even if you lived life organized or by the rules or whatever. Doesn’t make you better or more\ndeserving of opportunities. Sounds like you might be jealous your sister has lived life by her own rules. Having a license or not or stealing or not has nothing to do with her going to school and your MOMS decision to help her with HER OWN MONEY.",
            "score": 11,
            "author": "NewZookeepergame9808"
        },
        {
            "level": 0,
            "comment": "YTA, it’s none of your business! Just because your sister is different from you it doesn’t mean she won’t succeed, she still has plenty of time.",
            "score": 9,
            "author": "RedditVic98"
        },
        {
            "level": 0,
            "comment": "YTA. while youre advice is logical and does make sense, it is not your money or your life so you don't have a say in it. also most 17 year olds don't know what they want to do with their life at that age anyway. let her live.",
            "score": 6,
            "author": "Alone-Rush-9049"
        },
        {
            "level": 0,
            "comment": "YTA \n\nShe’s only 17. She’s got time. It’s your moms decision anyways.",
            "score": 5,
            "author": "candb82314"
        },
        {
            "level": 0,
            "comment": "YTA. Your sister is NOT YOU! Let her make her own decisions and this is between your mom and her. You have no business to butt in and making decisions that might not benefit your sister in the long run. You have no rights to control her every step.",
            "score": 4,
            "author": "Choice_Evidence1983"
        },
        {
            "level": 0,
            "comment": "YTA\n\nYou come off as the overbearing TV mom who thinks her way is the only right way. Stop trying to control your sister's life. If you're actually worried about her, just let her make her own decisions and support her through her successes or failures.",
            "score": 3,
            "author": "buttercupgrump"
        },
        {
            "level": 0,
            "comment": "YTA. Don’t control other people’s decisions. It’s not your choice to make. Just let her choose for herself.",
            "score": 4,
            "author": "Silver_Guidance163"
        },
        {
            "level": 0,
            "comment": "Your advice is logical, but it’s not your money so it’s not your choice",
            "score": 1,
            "author": "throwkoalaaway"
        },
        {
            "level": 0,
            "comment": "YTA she's 17, its fine to not have things figured out. and frankly you seem upset she's not following in your footsteps, why would she take your advice? why wouldn't she take classes that interest her, pursue her hobbies and be friends with who she wants? you come across as judgemental and somewhat controlling, this isn't even your business - its between your sister and your mom. focus on yourself and let your sister be her own person.",
            "score": 3,
            "author": "hippoknife"
        },
        {
            "level": 0,
            "comment": "YTA. Her life, her choice.",
            "score": 2,
            "author": "yobaby123"
        },
        {
            "level": 0,
            "comment": "YTA. This is between your mother and your sister. None of this is your business. You need to stay out of it.",
            "score": 2,
            "author": "Bethsmom05"
        },
        {
            "level": 0,
            "comment": "YTA. You may have the best intentions in the world toward your sister. You may be the smartest, the hardest working and the most honest of your mother’s children. Your sister may be not very intelligent, not goal oriented, and she’s made some bad mistakes but it’s time for her to be allowed to make some decisions about her own life. You’ve given your mom your advice but it is time for the Golden Child to *back off.* Your mother has paid for many years of your education and now you want your sister to stay at home, get a job and attend community college. Your stance leaves a sour taste in my mouth.",
            "score": 1,
            "author": "lonnielee3"
        },
        {
            "level": 0,
            "comment": "YTA",
            "score": 2,
            "author": "SnooRadishes8848"
        },
        {
            "level": 0,
            "comment": "YTA. Have you considered that she may have plans that she just doesn’t want to discuss with you because of your nonstop judgment? Or just because it’s none of your business? Or because she’s afraid of committing to something and then failing?\n\nOr maybe she just legitimately doesn’t know what she wants to do with the rest of her life. I didn’t. I went to college undeclared and tested out several different majors and minors. And I still graduated on time with all of my requirements met.\n\nThe stealing is legitimately a problem, but besides that she’s not doing anything wrong, just different from you. And I’m sorry that your mom is alone in this, but she needs to parent her. That’s not your job.",
            "score": 2,
            "author": "SneakySneakySquirrel"
        },
        {
            "level": 0,
            "comment": "YTA",
            "score": 2,
            "author": "Capable_Fig3903"
        },
        {
            "level": 0,
            "comment": "I think its best to just step back. I understand that youre concerned but sonetimes you habe to let someone sink or swim. If your sister truly has no goals and no drive to work for her grades, she'll drop out or be kicked out within a year. Your mom might lose 2 semesters worth of tuition but shell at lradt get an idea of what shes working with and can make plans based on that.",
            "score": 2,
            "author": "Flat_Contribution707"
        },
        {
            "level": 0,
            "comment": "YTA",
            "score": 2,
            "author": "SusanMShwartz"
        },
        {
            "level": 0,
            "comment": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFirst time poster on this sub long time lurker. I'm on mobile so please forgive the mistake reddit lords. \n\nI 24F and my sister 17F have had our differences growing up. I have always been more studious and though I'm not a genius by any means I still tried hard in highschool and got into a good college. I was the first person in my immediate family to go to college as my family doesn't really talk to our extended side even though most of my cousins have gone college for good degrees. (Think medical and engineering). Before I went to college I told my parents of what my plan was and what future career I was planning on doing ahead of time. I researched the money the school would give me as well of help I needed financially. They agreed and said they will help me financially and I graduate with a stem degree in 4 years. I know some might say that might be the norm, but those stem courses were hard and I would struggle to understand a lot of concepts so I'm proud I finished. My sister is the opposite of me. She is VERY rebellious and hard headed. Throughout highschool she disregard my advice on what classes to take, people to hang out with and even testing advice. She would lie and steal often to the point where when my father passed away she would steal money from my parents joint bank account to buy dumb things like make up or food. My father died before he could figure it out it was her but my mom was broken down completely. Fast forward to today I've graduated college worked in my relevant field and I'm hoping to apply to my preferred graduate program soon. My mother who I've helped emotionally since my grandmothers death and my father's death still agreed to help me financially purse this program until I get in. My sister has now graduated highschool and has only go into one school in our state and 2 out of state. My sister has no goals she hasn't even looked at the college department/classes she will need to take for her degree as she is going undeclared. I told my mom to let her go to community college and commute from home but my sister is adamant that it \"will just be like highschool\" and doesn't want to do that. The school she got accepted to out of state is definitely a party school and I don't want my mom to waste money on my sister since my sister doesn't have an academic plan or drivers license( she failed her permit test 6 times). My family and now my mom said since my parents paid for my education and are still helping me then my sister should go out of state. Aita?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Possibly unpopular but NTA. I would say though that you may be saying it in a way that makes you the AH.\n\nDon't push your sister or mom too much just cause you think you know the best for her. Often, we don't know what another person's real plans are, no matter how much we think we are close to them. And it seems like you have little to no faith in your sister... which is fair, but it might be affecting how you are communicating your advice.\n\nI see that you care about your mom, your sister and your family's finances. But pushing both of them to decide based on what you think is right, instead of just communicating to them your concerns, is not the right way to go about it.",
            "score": -6,
            "author": "munchkinnnnnnn"
        }
    ]
}