{
    "id": "146flrz",
    "score": 19,
    "title": "AITA for telling off my girlfriend because she consistently gets furious at me over small things?",
    "author": "xtrablunt",
    "date": 1686442946.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/146flrz",
    "media_urls": [],
    "other_urls": [],
    "postText": "\nDoes my (26M) OCD gf (25F) have anger issues or is it me that’s being an asshole?\n\n\nMy gf (25F) and I (26M) have been dating for a bout two years and we recently moved in together.\n\nAt first everything was good, she would get angry at me sometimes for valid stuff that I completely agree was my fault. I lived with my mom beforehand and our house was always cluttered and she knew I disliked it and it stressed me out. We both considered ourself OCD and thought it would be a good idea to move in together.\n\nFast forward to living with her for almost 5 months and she will literally explode on me for the smallest things I do that are not perfect. To list a few examples; \n\n- putting a new onion from groceries in the fridge rather than the cabinet\n- not folding the hand towel perfectly on the rack after washing my hands\n- not folding the sofa blanket before going to bed\n-  leaving my keys on the front entrance table instead of putting it in the bowl\n\nI realize that each one of these things individually is something I could easily fix and I have been trying but I don’t even have any room for error. If I wash my hands 10 times during the day, if the hand towel is not replaced perfectly only once I will literally get screamed at. She says stuff like, “you don’t do anything for the house” or  “I always have to clean up after your mess” and she usually tells me that I was raised in a barn.\n\nOne of the most notable consistent events are on the weekends when it’s time to deep clean the place, which is a weekly event. It usually starts off well and then if she doesn’t like the way I am doing something, income the insults about me. I am not normally an angry person but as a human being there is only so much heat I can take before I get angry back. Usually this ends in a fight and me exploding back and her completely over stimulated with emotion and anger that she tells me to leave because she doesn’t want to look at me, and she will clean the rest of the place. It’s like clock work every weekend.\n\nIt usually ends with her calling me an asshole for not just agreeing with her and saying sorry. But I am just trying to defend myself, I admit I do get worked up when she yells at me and raise my voice. If she would just listen to me all I say is that I am trying to help and be involved in the maintenance.\n\nThe part that gets me angry is that she tells me she does 90% of the work around the house and all she wants is help and she will be happy. I am completely on board with helping and being involved and I offer to help all the time though..\n\nI have an appointment booked with a therapist this week because I literally don’t know what to do and it’s been getting a lot worse lately and I don’t know if I could live with her anymore. Need to vent.\n\nTLDR: this could be AITA but I need advice. Gf is overboard OCD freak and gets overly angry at me for what I consider the smallest things on a consistent basis. I get angry back saying that I am helping best I can.",
    "comments": [
        {
            "level": 0,
            "comment": "##[AITA for blocking your go-to time killer from June 12-14?](https://redd.it/145o4jz)\n\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n &gt; Am I the asshole for making small mistakes and telling off my gf for getting mad at me?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "score": 1,
            "author": "Judgement_Bot_AITA"
        },
        {
            "level": 0,
            "comment": "NTA. You girlfriend is borderline abusive. That is not OCD",
            "score": 34,
            "author": "ItIsNotAManual1984",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not just borderline, she screams and throws things at OP, that IS abusive",
                    "score": 15,
                    "author": "LuthwenJ"
                },
                {
                    "level": 1,
                    "comment": "My thoughts exactly",
                    "score": 1,
                    "author": "Twigz8771"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA. OP, your girlfriend sounds like she does indeed have OCD and serious anger issues. She needs professional help. When you both calm down, you need to sit your girlfriend down and have a serious talk with her and tell her that her behavior is unacceptable and borders on toxicity. If she refuses to get help and doesn't want to change her ways, it's time to either kick her out or pack up your stuff and leave. You don't needs this nonsense in your life, and this relationship will definitely not last. Good luck.",
            "score": 23,
            "author": "Popular_Document1399"
        },
        {
            "level": 0,
            "comment": "NTA. She needs therapy. Badly. You should seriously consider if this is what you want to come home to everyday.",
            "score": 13,
            "author": "Ironmike11B"
        },
        {
            "level": 0,
            "comment": "NTA. Relationships are give and take and that’s the piece that’s missing here. You won’t both do everything the same way. It doesn’t sound like you’re being a slob. And it also doesn’t sound like she’s said “hey honey, could you please do this one thing my way? It really bothers me when….”\n\nI’m glad you’re going to get counseling. I think it’s time to have a heart to heart with girlfriend and see if she can have a productive conversation about how you both want to run your household. If not, you may have to get separate places or even break up.",
            "score": 7,
            "author": "Downtown_Brat_6536",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah this is what I try and tell her. I almost never get angry at her first because I understand that if she makes a mistake it’s not the end of the world. \n\nWhenever I try and bring it up in a calm way it always end up in an argument because I am not simply complying with her demands. She sees this as me not wanting to make her happy…\n\nIt’s not that I don’t want to make her happy but I am just a realistic person. And if I try and communicate to her that there is no way I will be as perfect as she wants me to be then its because she doesn’t think I want to put in the effort for her",
                    "score": 7,
                    "author": "xtrablunt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You cannot make her happy. You can only leave and save yourself. Please do so and use the therapy to sort out all the ways this has messed you up. I'm so sorry you're in this abusive situation. She needs help, but you are not in a position to help her because she lives with you so you are part of her problem (which does not mean you are doing anything wrong). NTA",
                            "score": 6,
                            "author": "Office_Desk906"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA. She sounds like she needs therapy",
            "score": 4,
            "author": "Twigz8771"
        },
        {
            "level": 0,
            "comment": "NTA\n\nThat's a lot to deal with. Even when housemates violate previously agreed upon standards of housecleaning and chore distribution, this sort of explosion is unwarranted. \n\nThe fact that she does it every week sounds like you are the designated, i.e. safe, outlet for her to dump the pressure that's been building up in the rest of her life all week.\n\nWhen she's calm, sit down and divide the household chores. If you're waiting to be asked, that's not the same level of participation and may feel like a burden to the person who is initiating most of the cleanup. Also agree on standards. If you're not willing to guarantee meeting her OCD criteria in every area, put that out there during the chore discussion. \n\nYou can work with your own therapist about how far you want to accommodate her OCD quirks and how to draw the line when she becomes abusive towards you. You can't make her go to therapy. What she decides to do when you start to set clear, calm, consistent boundaries will help you make your own choices about the relationship.",
            "score": 3,
            "author": "FiberKitty"
        },
        {
            "level": 0,
            "comment": "She is a control freak with no regards for your feelings. Small things done wrong shouldn’t become a vehicle for abusing you. If you don’t want to live this way forever, get out. And believe me, it will escalate with time, you already see that.",
            "score": 3,
            "author": "Some-Geologist-5120"
        },
        {
            "level": 0,
            "comment": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nDoes my (26M) OCD gf (25F) have anger issues or is it me that’s being an asshole?\n\n\nMy gf (25F) and I (26M) have been dating for a bout two years and we recently moved in together.\n\nAt first everything was good, she would get angry at me sometimes for valid stuff that I completely agree was my fault. I lived with my mom beforehand and our house was always cluttered and she knew I disliked it and it stressed me out. We both considered ourself OCD and thought it would be a good idea to move in together.\n\nFast forward to living with her for almost 5 months and she will literally explode on me for the smallest things I do that are not perfect. To list a few examples; \n\n- putting a new onion from groceries in the fridge rather than the cabinet\n- not folding the hand towel perfectly on the rack after washing my hands\n- not folding the sofa blanket before going to bed\n-  leaving my keys on the front entrance table instead of putting it in the bowl\n\nI realize that each one of these things individually is something I could easily fix and I have been trying but I don’t even have any room for error. If I wash my hands 10 times during the day, if the hand towel is not replaced perfectly only once I will literally get screamed at. She says stuff like, “you don’t do anything for the house” or  “I always have to clean up after your mess” and she usually tells me that I was raised in a barn.\n\nOne of the most notable consistent events are on the weekends when it’s time to deep clean the place, which is a weekly event. It usually starts off well and then if she doesn’t like the way I am doing something, income the insults about me. I am not normally an angry person but as a human being there is only so much heat I can take before I get angry back. Usually this ends in a fight and me exploding back and her completely over stimulated with emotion and anger that she tells me to leave because she doesn’t want to look at me, and she will clean the rest of the place. It’s like clock work every weekend.\n\nIt usually ends with her calling me an asshole for not just agreeing with her and saying sorry. But I am just trying to defend myself, I admit I do get worked up when she yells at me and raise my voice. If she would just listen to me all I say is that I am trying to help and be involved in the maintenance.\n\nThe part that gets me angry is that she tells me she does 90% of the work around the house and all she wants is help and she will be happy. I am completely on board with helping and being involved and I offer to help all the time though..\n\nI have an appointment booked with a therapist this week because I literally don’t know what to do and it’s been getting a lot worse lately and I don’t know if I could live with her anymore. Need to vent.\n\nTLDR: this could be AITA but I need advice. Gf is overboard OCD freak and gets overly angry at me for what I consider the smallest things on a consistent basis. I get angry back saying that I am helping best I can.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Dump her",
            "score": 0,
            "author": "Dimerella"
        },
        {
            "level": 0,
            "comment": "YTA, if you continue to subject yourself to that. \nThat is not OCD. \nShe has some massive control issues that need to get worked out fast if there is any hope of you guys making it. She needs to learn emotional control and communication skills like yesterday. \n\nI’m so petty, I would just start doing random stuff. Like stick a post-it on a random wall. Hide all the hand towels. But then again if you want this to work I wouldn’t Recommend that route. She may actually hurt you.",
            "score": 1,
            "author": "Sad_Individual6381",
            "replies": [
                {
                    "level": 1,
                    "comment": "She threw the onion at me when I put it in the fridge",
                    "score": 5,
                    "author": "xtrablunt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Get out now.",
                            "score": 4,
                            "author": "Upper-Masterpiece491",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Easier said than done we own a condo together.",
                                    "score": 1,
                                    "author": "xtrablunt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The sooner you start the process the better, unfortunately. I dated a girl like this, its hard to seperate from. Once you see from the outside how she treats you you will 100% see that its abuse. Im sorry brother I have been there before",
                                            "score": 1,
                                            "author": "Aightbet420"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah that's abuse. Even if she has OCD that's no excuse to scream at you or throw things. I'd nope out of that relationship real quick, these things can escalate pretty quickly",
                            "score": 2,
                            "author": "LuthwenJ"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA.\n\nGlad you're considering therapy because this is above the paygrade of us casual commentators. Does the therapy involve her too?",
            "score": 1,
            "author": "Jadow",
            "replies": [
                {
                    "level": 1,
                    "comment": "I told her I was booking counseling this week via phone call. I don’t know if it’s meant for two people but she will be home",
                    "score": 2,
                    "author": "xtrablunt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA she is being abusive. If she doesn’t get help and start treating you better right away I would toss her ass out.",
            "score": 1,
            "author": "EnoughOrMore13"
        },
        {
            "level": 0,
            "comment": "NTA. Your gf is absolutely being abusive. Please be kind to yourself and get out of this situation. You deserve far better.",
            "score": 1,
            "author": "foggy___dewhurst"
        }
    ]
}