{
    "id": "146oef9",
    "score": 8,
    "title": "AITA for being snarky to my sister after throwing up?",
    "author": "mal06fruit",
    "date": 1686471825.0,
    "url": null,
    "media_url": null,
    "comments": [
        {
            "level": 0,
            "comment": "##[AITA for blocking your go-to time killer from June 12-14?](https://redd.it/145o4jz)\n\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n &gt; I might be the asshole because I was being a snarky teenager, the action is doing after I got sick\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "score": 1,
            "author": "Judgement_Bot_AITA"
        },
        {
            "level": 0,
            "comment": "NTA. You were not being \"manipulative\" you were being sarcastic. If she feels guilty as a result, that's her own conscience emotionally \"manipulating\" her.\n\nNext time maybe aim... kidding, sort of. You are allowed to expect your family to care about your well-being.",
            "score": 20,
            "author": "ParsimoniousSalad"
        },
        {
            "level": 0,
            "comment": "You were likely sickly your entire life and your family has become desensitized towards it.\n\nThe same as you not thinking you're going to die everytime you get sick, neither will they think it.\n\nDid you get yourself checked out properly to see if you can permanently improve your health?",
            "score": 6,
            "author": "Jiiyeon",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t think I can, I recently had a situation half a year ago where I passed out and gained a severe concussion that took me out of school for 3 months and my health has gotten worse and more frequent since then. I frequently go to the doctors but there’s nothing inherently wrong with me except for asthma",
                    "score": 0,
                    "author": "mal06fruit",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I dont think it's possible to be this sickly and not have anything inherently wrong.\n\nGet maybe some more doctors involved and different opinions.",
                            "score": 3,
                            "author": "Jiiyeon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Every-time I ask to get a serious check up (x-rays and outside opinions), my family says it is not needed since they are all in the medical field so I’ve never really pushed on that front",
                                    "score": 0,
                                    "author": "mal06fruit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What kind of bloodwork have you had done?\n\nWhat are your usual symptoms?\n\nHow was losing consciousness related to all this?",
                                            "score": 0,
                                            "author": "CampfireTalks",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Is this r/medicaladvice or r/aita?",
                                                    "score": 1,
                                                    "author": "CausticAutist",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "True. Lets stay in the spirit of the sub: CausticAutist, you are an AH.\n\nYou unironically advocating to not try and help a teen, thats kinda funny.",
                                                            "score": 0,
                                                            "author": "Jiiyeon",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The teen is probably much better not taking medical advice from randos on reddit. Especially this sub. There are tons of more appropriate places where she would get better help, but sure let's pretend I just don't want her to be helped because it let's you feel superior to someone.",
                                                                    "score": -2,
                                                                    "author": "CausticAutist"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "When I went to the er for losing consciousness I got my blood tested for many things and nothing came back abnormal, not iron deficient\nSome symptoms bc of losing consciousness are I get migraines and still have a high sensitivity to light, noise, and smell. My general symptoms are very often asthma attacks and weak immune system.None of the doctors ever found out why I lost consciousness but for a month after I had severe concussion symptoms and they are slightly present to this day",
                                                    "score": 0,
                                                    "author": "mal06fruit",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I have asthma, and your symptoms seem to be more than just that. I hope you get the answers you’re looking for!",
                                                            "score": 2,
                                                            "author": "Marple1102"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "NTA, it appears your family is desensitised to your illness. If you live in a country with free healthcare there's nothing stopping you from going to a doctor and investigating what is causing your random vomiting.  \nWhat you say here is particularly concerning. Just because they're in the medical field doesn't mean they're necessarily even qualified to make a judgement about what is wrong. You shouldn't have to live  with something like this, especially just because your family says 'oh no there's nothing wrong with you, trust'.\nGo to the doctor, investigate the fuck out of whatever is going on and hopefully get better",
                                            "score": -1,
                                            "author": "Syreptious"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "YTA for using snark to try to elicit a sympathetic response from your family members. That IS being manipulative. \n\nI think you'd be much more likely to get the type of response that you hope for if you try to have a serious conversation some time about your feelings. It's awful to feel like no one is concerned about you. I suspect your snarky comebacks are annoying them and making them feel less sympathetic. \n\nPlease wash your hands after throwing up.",
            "score": 3,
            "author": "JazzyKnowsBest13"
        },
        {
            "level": 0,
            "comment": "NTA. There is a difference between being manipulative and being sarcastic. You were being sarcastic in response to your sister's rude remark. \n\nAlso, I know you want your sister and mother to care about your condition, but the sad truth is that might never happen. You can't make people care, even your family.",
            "score": 3,
            "author": "Quiet-Experience-113"
        },
        {
            "level": 0,
            "comment": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (f18) am prune to getting sick often and none of my family members really bat an eye when I do. It’s nothing severe but I just have a weaker immune system and randomly get sick at least once a month. Most of the time I make jokes about getting sick often to my sister (f21) and my mom, however it’s usually because I want them to actually care about my well-being rather than disregarding it as something everyone goes through. The problem was that I was talking to my sister about something random and I started to have another coughing fit, it suddenly turned to me rushing to the bathroom and puking my guts out. This is something that never happens and I was slightly worried if I had gotten sick again. When I came out of the bathroom the only thing my sister asked was ‘did you wash your hands because I didn’t hear it’. I was already in a bad mood and that just annoyed me so I replied with, “thanks for asking if I was okay,” in a ‘snarky’ tone. My sister then stops and starts talking about what I said was very manipulative. She’s said this before multiple times that I was manipulative when all I did was make snarky comments or ask for help implied through the things I’ve said. She’s made me feel like a horrible person for wanting someone to actually care about my health rather than sweep it under the rug as normal. Am I just blowing this small story up and it’s a pointless post, or am I unintentionally being an asshole for being a snarky teenager?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "&gt;Most of the time I make jokes about getting sick often to my sister (f21) and my mom, however it’s usually because I want them to actually care about my well-being rather than disregarding it as something everyone goes through.\n\nSomeone should come up with a word for this behavior. Intentionally making light of a situation in order to invoke a desired reaction from those around you. Womanipulating? Not quite there ... but I'm getting close.",
            "score": -1,
            "author": "CausticAutist",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not sure why the sexist remark is necessary, but it's not necessarily about the other people. It can be coping mechanism for trauma. OP clearly feels as though their health is disregard by their family, and possibly may not feel comfortable with having a serious conversation. \nhttps://psychcentral.com/lib/humor-as-weapon-shield-and-psychological-salve#does-it-work\nThe negative - self defeating type is probably what OP is doing. A cry for help and acknowledgment.",
                    "score": 1,
                    "author": "Syreptious"
                }
            ]
        }
    ]
}