{
    "id": "146t5o1",
    "score": 2,
    "title": "AITA I did a big favour for my friend but had to bail on one part due to an anxiety attack",
    "author": "isthisanxamountofbud",
    "date": 1686487832.0,
    "url": null,
    "media_url": null,
    "comments": [
        {
            "level": 0,
            "comment": "##[AITA for blocking your go-to time killer from June 12-14?](https://redd.it/145o4jz)\n\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n &gt; (1) I went out of my way to help my friend and his friend with their event and business, despite being out of my depth on one aspect (which they knew). I had to bail on the final part which was helping Friend A by taking photos despite being completely new and having to buy a camera (and he knew this).\n\n(2) I can see why Friend A would say I’m an asshole, but after everything I had done for him and his friend, and everything he knows about my personality, I would have expected better. So I’m very confused if I made a massive blunder and I should apologise again or not?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "score": 1,
            "author": "Judgement_Bot_AITA"
        },
        {
            "level": 0,
            "comment": "NTA. It's not your fault that the camera stopped working. If the event was too overwhelming you have a right to go home. Those girls who berated you over a picture are terrible. Your friends should be more grateful that you were willing to help and even bought a camera for them.",
            "score": 2,
            "author": "vidadeleeda",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for replying! And It means a lot to hear that, I’m honestly not sure if I’ve ever heard someone say they were grateful for me. \n\n“Friend” A hasn’t responded to my message asking “what do you mean?”. So I guess he’s nursing the hangover or doesn’t want to talk. It really sucks because he was my last friend left in this city, so I guess I’ll be moving on soon.",
                    "score": 1,
                    "author": "isthisanxamountofbud",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do they really treat you as friends (check in with you, talk to you, or do anything for you) outside of all this business stuff? If not, definitely move on to some new people!",
                            "score": 1,
                            "author": "vidadeleeda",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Honestly, you made me think about this a lot. Other than smoking weed together, we don’t have much in common at all. When I talk about my interests, or even how my business works, his eyes glaze over or he walks into the kitchen and fills up his water bottle and says “Yeah I’m still listening, go on”, while I talk to myself in the room.  I always thought that was him being high, but I’m starting to realise he may just be a bad friend?\n\nWe don’t even know each other’s birthdays haha\n\nI’m really reconsidering this, thank you! I’m glad I posted this, I was really worried I was the bad guy!",
                                    "score": 1,
                                    "author": "isthisanxamountofbud"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA. Friend A is going to have a rude awakening when their business fails bc they don’t have a network of people who can actually help them bc they’re too busy partying instead of working in this environment. Building an app for someone for free is beyond generous, so doing even more with photography afterwards speaks volumes of your character.",
            "score": 2,
            "author": "Southern-Salary2573",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for replying! I was honestly surprised he was drinking and partying because he said he doesn’t like to drink (one or the reasons we became friends).  I spent quite a bit of time on that app as well, even had to work on it during my real job hours! \n\nIt was honestly the worst way the night could have gone, and some how both guys (A&amp;B) think I’ve let them down. People don’t realise how much I do behind the scenes to get it ready for people to use and book tickets on. \n\nI think I’ll repackage the app and sell it for myself after all of this haha",
                    "score": 2,
                    "author": "isthisanxamountofbud",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea this sounds toxic. Literally everyone should understand, even if they don’t know how to do it, that building an app is not easy. Even though you have the knowledge and skill set to do it, it doesn’t mean that it’s easy or that time just magically didn’t get spent on it. I would totally repackage and sell - you should be compensated for your efforts. I would also be very cautious of these friends bc they sound like users. Keep an eye open - it may be time to reevaluate this friendship. But good luck in selling it! I hope this flips into something fruitful for you and maybe launches your career to another level :)",
                            "score": 1,
                            "author": "Southern-Salary2573",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly! It takes a lot of q&amp;a just to make sure it works properly, especially when dealing with transactions! \n\nAfter this morning’s message calling me an asshole, I see now that he’s just using me for my abilities and my ideas. I’ve given him so many ideas for his videos over the years, some of them have been his best performing videos too! \n\nI’m honestly considering starting my own business and sell this app now, like you say, it would flip this into something fruitful and positive! :) I feel better about the situation, although sad that a friendship is over!\n\nThank you for replying! I hope you have a better day than mine!",
                                    "score": 2,
                                    "author": "isthisanxamountofbud"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy friend (A) and I wanted to start our own businesses. Friend A introduced me to Friend B, who runs events at a nightclub. I offered to make an app for Friend B for free to support him and expand our network. Additionally, I volunteered to help Friend A with photography, even though it was outside my comfort zone. I purchased a used DSLR camera for this purpose.\n\nThe app was a success, generating significant engagement on local social media, and Friend B was pleased. On the big night, I arrived punctually at Friend A's house, well-dressed and equipped with the new camera. However, Friend A was unprepared and couldn't find his SD card, which I eventually located for him. We took a taxi (which I paid for) to the nightclub and faced some difficulty at the door because Friend A didn't know the name of the event. Fortunately, I knew the name since I had created the app.\n\nInside the venue, there were only a few people. I began setting up my camera while Friend A socialized and enjoyed a beer. Unfortunately, my camera started malfunctioning, with settings being permanently turned off and pictures not saving every time. Feeling very anxious and out of my element, I asked Friend A, who claimed to be an expert, for assistance, he couldn't fix the camera.\n\nAt that moment, a group of beautiful women approached me, requesting their photo be taken. Wanting to demonstrate my helpfulness, I agreed. However, the camera kept turning off each time I pressed the shutter button. The women became frustrated, and despite my explanations, they berated me, causing me to feel worse about myself.\n\nI found a quiet spot to regroup and attempt to fix or reset the camera, but nothing worked. Overwhelmed by anxiety, my fight-or-flight response kicked in, and I desperately wanted to leave. I decided to call it quits early, explaining to Friend A that the situation was too much for me and I didn't want to ruin their reputation.\n\nFriend A immediately doubted my reasons and accused me of bailing on him. He even blocked the exit, preventing me from leaving. Eventually, I convinced him. The following morning, Friend B called to thank me for the successful app and expressed disappointment about the photography mishap, but understood my situation.\n\nFriend B later revealed that Friend A had gotten drunk and partied until 4 am. I had missed a call from Friend A at that time, they probably wanted to say negative stuff. Later, Friend A, still drunk, texted me, calling me an asshole.\n\nI am now confused. I had done numerous favors for Friend A, including creating a successful app for Friend B, purchasing a new camera, and attempting to fix it on the event night. I left early, sparing their reputation from the amateur photography blunder and ensuring only a few people witnessed my struggle. \n\nDespite this, Friend A labeled me the asshole in the whole situation.\n\nAm I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "YTA\n\n&amp;#x200B;\n\nYOu promised, and failed to deliver.\n\n&amp;#x200B;\n\nMake fewer promisses , and focus on making sure you deliver instead.",
            "score": 0,
            "author": "Capable_Fig3903"
        }
    ]
}