{
    "id": "146utzc",
    "score": 3,
    "title": "AITA for asking my best friend to buy me boxers?",
    "author": "jftangpuz",
    "date": 1686492422.0,
    "url": null,
    "media_url": null,
    "comments": [
        {
            "level": 0,
            "comment": "##[AITA for blocking your go-to time killer from June 12-14?](https://redd.it/145o4jz)\n\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n &gt; Was it offensive for me to ask my best friend not to purchase the underwear when he was already in the store, even if he was already so insistent to buying them? I feel like it might have made him feel that I didn’t value his efforts or was just being a nuisance.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "score": 1,
            "author": "Judgement_Bot_AITA"
        },
        {
            "level": 0,
            "comment": "NAH\n\n\nVery concerned this guy works at a hospital in any capacity. He has mental health issues. The response that he is \"just full of hate\" is so beyond normal for a situation like this.\nI can't call him TA because there seems to be something seriously wrong.",
            "score": 13,
            "author": "Top-Necessary5003",
            "replies": [
                {
                    "level": 1,
                    "comment": "It is beyond normal, which is why I’m wondering if there’s something wrong I did that I’m not seeing. He also said he was pissed to the core. He never forgave my apology and has since then been giving me cold treatment. He’s never treated me this way before.",
                    "score": 3,
                    "author": "jftangpuz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well we sure don't know if something else happened.  \n\nThis behavior is so not fitting the situation (and what even is 7 11 disposable underwear?) I would stop trying to figure out who is the asshole and just keep an eye on your friend.",
                            "score": 6,
                            "author": "superfastmomma",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "7/11 is a convenience store. Disposable underwear is underwear that gets thrown away after use (like disposable face mask material). 7/11 disposable underwear is disposable underwear purchased from 7/11.",
                                    "score": 3,
                                    "author": "ChronicNightmare95"
                                },
                                {
                                    "level": 3,
                                    "comment": "I appreciate your responses! \n\nI’ve seen him get pissed off at others for other simple reasons in the past, and he really took it to the heart, even secluding himself at home as his mechanism. Never thought he’d do this for this kind of issue. I don’t know if I should approach him one more time with an apology now that it’s been more than a week since then.",
                                    "score": 2,
                                    "author": "jftangpuz"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have no idea what’s going on here lol",
            "score": 8,
            "author": "Either-Violinist-382"
        },
        {
            "level": 0,
            "comment": " NTA. You asked you friend a simple request since he would be in the local to fulfill that request. When his plans changed, you appropriately voided your request as to not cause more work for your friend. His persistence has nothing to do with you.\n\nNow... that being said. If this a was via text, and depending the wording, I can see your friend taking the \"don't worry about it, I'll do laundry\" response as you bitching. If i was via phone call, maybe the tone of your voice made him think you were mad.",
            "score": 4,
            "author": "leukem",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the response. I really appreciate it.\n\nHe did call me initially when the mall closed but I already told him way ahead that it wasn’t an issue at all and that I could manage, to which he simply agreed to. I figured he might’ve thought I was bitching about it too, but I tried to reassure him during the call that it was really okay and it wasn’t a big deal.",
                    "score": 1,
                    "author": "jftangpuz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Nothing about your friend's behavior makes sense.",
            "score": 3,
            "author": "It_Wasnt_Me79"
        },
        {
            "level": 0,
            "comment": "NTA, this was your best friend?? His behavior is strange and over the top. BTW, what are disposable underwear??  Like you throw them out after one use?",
            "score": 2,
            "author": "SickofItAll_4200"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nah, he called 10 minutes after my third and last missed call. It was over just around 1-2 minutes.",
                    "score": 1,
                    "author": "jftangpuz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks, re-read and got it, lol. NTA.",
                            "score": 1,
                            "author": "9okm"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA. Not sure there's much more you can do. You apologized even though you weren't sure you did anything wrong.",
            "score": 1,
            "author": "9okm"
        },
        {
            "level": 0,
            "comment": "NTA, some of the verbiage your friend is using should be cause for concern.",
            "score": 1,
            "author": "WhyCommentQueasy"
        },
        {
            "level": 0,
            "comment": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nIt’s a small issue that could’ve easily been prevented, but he’s blowing it way out of proportion. It matters cause he’s my best friend (26M). He happened to be in the mall to watch the cinema with some fellow classmates while I (25M) decided to wait at the hospital (we’re medical students) to take care of some patients. They were to come to the hospital afterwards.\n\nI realized I didn’t have enough underwear brought in my apartment after coming back from vacation, so I messaged him to purchase me some at the mall if he happens to still be there. He told me that he would, but eventually he had dinner for too long to reach the store, which had already closed. He called to apologize and tell me he could buy some disposable underwear at 7-11, but I told him not to and that I could manage doing extra laundry at the apartment. It really wasn’t a big deal. And I didn’t want him to go out of his way just for that. \n\nSome classmates who were with him eventually came back without him, and I asked where he was. And he was apparently out nearby still trying to find me underwear from 7-11. I messaged him again not to do it and gave 3 missed calls. He eventually called 10 minutes later saying he was almost at the counter in 7-11, close to purchasing the disposables. \n\nI don’t know why he was so insistent on purchasing them (even saying that he’d buy them regardless if I’d wear them or not). After back and forth of his insistence and my telling him not to do it, he gave in but was really annoyed. Since then he’s been ignoring me. It’s been almost 2 weeks. \n\nI apologized immediately after it happened but he only told me he was full of hate. He said I made him feel full of sh*t and was hurt. He didn’t tell me why exactly, but I apologized regardless. He never put my next apology message on read and has ignored me ever since. \n\nI know it sounds so petty, but this guy’s my best friend. And I have no idea if I was being an as*hole for this.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
            "score": 0,
            "author": "AutoModerator"
        }
    ]
}