{
    "id": "146uqjs",
    "score": 6,
    "title": "AITA for calling my mother toxic",
    "author": "TheRealBri_",
    "date": 1686492173.0,
    "url": null,
    "media_url": null,
    "comments": [
        {
            "level": 0,
            "comment": "##[AITA for blocking your go-to time killer from June 12-14?](https://redd.it/145o4jz)\n\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n &gt; Because she was being toxic, it shouldn’t have happened in the first place\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "score": 1,
            "author": "Judgement_Bot_AITA"
        },
        {
            "level": 0,
            "comment": "NTA \nHonestly the situation does sound pretty toxic, it sounds like she wants you to parent her but isn’t doing the same for you",
            "score": 7,
            "author": "Qwerty919991"
        },
        {
            "level": 0,
            "comment": "NTA. What in the emotional incest did I just read?\n\nI highly suggest Googling the term, but the TL;DR is a parent expecting a child to fulfil the emotional needs a partner would.\n\nLike this is falling into that category. You're her child, you didn't ask to be born. \n\nAlso, the guilt tripping and historical backlash... wut.",
            "score": 3,
            "author": "faeriekitteh"
        },
        {
            "level": 0,
            "comment": "NTA. Situation sounds toxic and sounds like your mom doesn’t understand she is the parent, not you.",
            "score": 2,
            "author": "fonziesgrl"
        },
        {
            "level": 0,
            "comment": "NTA, Don't waste any more of your time arguing with her. If she tries to pick another use the gray rock method.\n\nStart planning for your independence.",
            "score": 2,
            "author": "WhyCommentQueasy"
        },
        {
            "level": 0,
            "comment": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (19F) and my mother (38F) got into an argument yesterday and it came out that she was toxic. We didn’t always have the best relationship but she was there. Yesterday she brought up a time when she was hurt and she thought I wasn’t there for her like how she wanted me to be. For context she thought she was at first having a panic attack then thought she was having a heart attack, I went to her and asked her if she was okay and she wasn’t talking, my stepdad came over and told me to move and then I went in my room, they left and I was watching my siblings till they got back but I guess she was mad that I didn’t do more when I personally don’t understand how much I was supposed to do in that situation. Then she said that she wanted me to care more and how she ALWAYS cared when something happened to me, I reminded her of the last few times something was actually wrong with me and she didn’t care. For context (the first time) I was sick in my room and I was having trouble breathing and was trying to express to her that I couldn’t breathe and she said for me to get an Uber to the hospital or tell one of my friends about it just to find out that I had covid and it could have turned into a bad situation. \nAnd the second time I just had a double ear infection still fending for myself.. at least I asked if she was okay. Plus when she had covid I kept her company and talked to her just so she would have someone to be there. But all she said in return was how I was mixing up situations in my head and how wrong I was and how she’s a good mom or whatever and I could not be in her house.  She was just trying to make me feel bad for something that wasn’t even true (I checked my messages and i did have covid) \nAnyways Aita for calling my mom toxic for this?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "NTA - this is why teens shouldn’t have kids.",
            "score": 1,
            "author": "Spiritual_Lion7227"
        }
    ]
}