{
    "id": "1473xcx",
    "score": 82,
    "title": "AITA for not walking to the other side of the street with my dog?",
    "author": "TypicalGoosie",
    "date": 1686514214.0,
    "url": null,
    "media_url": null,
    "comments": [
        {
            "level": 0,
            "comment": "##[AITA for blocking your go-to time killer from June 12-14?](https://redd.it/145o4jz)\n\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n &gt; I did not cross the street with my dog. So I may be the asshole because I had the bigger dog and the smaller dog may have been frightened.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "score": 1,
            "author": "Judgement_Bot_AITA"
        },
        {
            "level": 0,
            "comment": "NTA. Yes, if someone’s dog is known to bite, they should have been the ones to cross the street. They know their dog bites, so it’s not your job to be a mind reader.",
            "score": 157,
            "author": "Background_Ruin_3631"
        },
        {
            "level": 0,
            "comment": "NTA - my dog does not like other dogs and can be tempermental.\n\n If I see a dog coming, I cross the street with mine because I know mine might cause a problem. \n\nThey knew their dog can cause a problem and did nothing to prevent it. \n\nEven cheekier that they blamed you for it, especially when you'd already pulled your dog in and got him to sit.",
            "score": 84,
            "author": "carangutan-2117",
            "replies": [
                {
                    "level": 1,
                    "comment": "My dog isn’t a fan of other animals so if we go to the vet I muzzle him. If I am walking him I cross the street if I see another dog coming. It’s called being responsible",
                    "score": 18,
                    "author": "gramsknows"
                }
            ]
        },
        {
            "level": 0,
            "comment": "they’re definitely the assholes. if you warn someone else that your dog bites and you know that your dog bites, why would you ever let that dog get that close to another dog and then BLAME the owner for your own dogs actions?",
            "score": 27,
            "author": "ExactPercentage2261"
        },
        {
            "level": 0,
            "comment": "NTA. I'd absolutely cross the street first if I knew that my dog was prone to biting.",
            "score": 18,
            "author": "peakpointhelmet"
        },
        {
            "level": 0,
            "comment": "NTA.  You should have called authorities and reported their biting dog.",
            "score": 10,
            "author": "dawnofdaytime"
        },
        {
            "level": 0,
            "comment": "NTA and they should have a muzzle on that dog. What if you were with a child instead of your dog?",
            "score": 14,
            "author": "kbstude"
        },
        {
            "level": 0,
            "comment": "NTA: I would definitely know to cross the street if my dog was known to bite. It’s common sense, then they get mad at you for letting their dog come up to Baxter and bit him in the nose who faults is that’s. Theirs fault",
            "score": 10,
            "author": "Ok-Cauliflower-9059"
        },
        {
            "level": 0,
            "comment": "NTA at all, they are. If I know my dog is prone to bite, it is up to me to cross the street for the other dog’s/person’s safety. The audacity they had to tell you that you should’ve crossed the street, when their dog was the one who bit yours is mind blowing. Shitty ass owners, and shitty people.",
            "score": 5,
            "author": "1877hunt"
        },
        {
            "level": 0,
            "comment": "NTA.\n\nWhat you should have said is \"Control your dog,\" as it approached my dog.\n\nIf it continued to approach I would have stepped in front of it and not let it pass me. I would have yelled at it if it tried.\n\nAnd if someone got mad at me in that situation I would have yelled at them. \n\nIt is absolutely 100% on them, as the owner of a dog that bites, to control it. And should this happen again you should feel free to push their dog away with your foot if it doesn't get the hint. Step in between your dog and their dog and yell at it. \n\n\"Your dog bites. Put a fucking leash on it!\" is completely appropriate in those situations.",
            "score": 7,
            "author": "HotspurJr"
        },
        {
            "level": 0,
            "comment": "NTA\n\n&amp;#x200B;\n\nYou should have called the police there and then. THEIR dog attacked yours.",
            "score": 5,
            "author": "Capable_Fig3903"
        },
        {
            "level": 0,
            "comment": "NTA if you have a dog that bites it is your responsibility to manage them - muzzle training is a great first step and making sure they can't approach other dogs. They did none of these things. It isn't your job to know they have an aggressive dog, it is their job to deal with it including being the ones to cross the street if necessary.\n\nIn the future if you have an aggressive dog approaching try to move away even though that should be their job not yours. You can also carry treats and drop them to distract the approaching dog. People might get pissed but if they let the dog close enough to eat treats you have dropped at your feet then that is on them.",
            "score": 3,
            "author": "ElaMeadows"
        },
        {
            "level": 0,
            "comment": "NTA honestly if you know your dog\nBites and still insist on having him around others they should have a muzzle on the dog. I don’t care how big it is you don’t take any aggressive animals out with out safety precautions",
            "score": 3,
            "author": "gramsknows"
        },
        {
            "level": 0,
            "comment": "NTA. If you've got a dog that has issues, it's on you to avoid other dogs.",
            "score": 2,
            "author": "AliceInWeirdoland"
        },
        {
            "level": 0,
            "comment": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI have a 7 month old golden retriever named Baxter who is very friendly, so I don’t mind letting him meet other dogs when we go for walks. Today when I was walking him there was a couple walking their smaller dog heading towards me. With smaller dogs I will get Baxter to sit down so he doesn’t immediately try and sniff the other dog. When the couple reached us they said their dog is known to bite. So I held Baxter in place so they could walk past us. Instead they let their dog come up Baxter and immediately bit him on the nose. Thankfully he isn’t hurt just a small scratch. But the couple got mad at me saying I should have crossed the street. Honestly if you know your dog bites, shouldn’t you be the one crossing the street? Let me know what I should have done so this doesn’t happen in the future.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "NTA\n\nYes, they should have crossed or at least kept it away from Baxter.",
            "score": 1,
            "author": "Tyberious_"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "What a poorly thought out reply. OP expected the couple to not be maniacs and to at least try to control their dog.\n\nOP took reasonable steps the situation. They are blameless here.",
                    "score": 4,
                    "author": "BetterKev",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I stand by my comments. Most injuries are preventable, but preventing them all requires ridiculous behavior. It'd be ridiculous to suppose someone who knows their dog bites wouldn't try to control their dog. A dog bite can get a dog destroyed.",
                                    "score": 2,
                                    "author": "BetterKev"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}