{
    "id": "1475jgl",
    "score": 8617,
    "title": "AITA for \"stealing\" my sister's in-laws?",
    "author": "Pleasant-Ad-807",
    "date": 1686517970.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/1475jgl",
    "media_urls": [],
    "other_urls": [],
    "postText": "\r  \nI always thought my sister (27F) and I (25M) had a decently close relationship until a few years ago when it came out that she thought of me as a \"golden child.\" She held resentment towards me for things I just looked at as the typical more lax treatment of the younger child in a family. I honestly thought the whole thing was pretty silly, especially since we were both years out of being under our parents' roof at this point, so we went a while without talking. We saw each other at family events but didn't really speak. \r  \n\r  \nI was invited to her engagement party as a form of an olive branch extension. It was there I met her future husband's younger brother, and we immediately got along. The two of us got to know each other and spent about a year as friends before making things official around a month before my sister's wedding.\r  \n\r  \nI love his family so much. His parents are warm and inviting in a way that feels so genuine, even before I was introduced as a significant other. (Not to knock my parents, but with them being lawyers and working politically adjacent careers, it can be easy to become jaded when you watch them schmooze to people's faces even when that doesn't reflect their true feelings.) I was the first person he ever brought home to meet them and they made me feel like part of the family immediately. Their youngest brother has been equally as welcoming and regularly schools me in Overwatch 2 by staying alive far longer than I ever could. \r  \n\r  \nWhen I told my sister this, thinking it was something we could bond over, she was angry again. Apparently she didn't receive the same treatment. This resulted in a big argument which led to her saying something to the effect of \"I guess this is what happens when two golden children get together.\" I pushed back against this, and it further devolved with her pointing out that out of all the people in the world, she couldn't believe I had chosen her husband's brother. She said I had stolen opportunities from her growing up and now I was \"stealing\" her in-laws.\r  \n\r  \nI considered telling my partner's parents about this at one point to let them know the animosity my sister apparently holds towards them, but I decided against it. I don't really know where I stand in this conflict and at this point I'd just like some outside perspective.\r  \n\r  \nAITA?",
    "comments": [
        {
            "level": 0,
            "comment": "##[AITA for blocking your go-to time killer from June 12-14?](https://redd.it/145o4jz)\n\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n &gt; 1. I began dating my sister's husband's brother and had a good experience with her in-laws, and told her about it. 2. She assumed I had told her about this out of spite.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "score": 1,
            "author": "Judgement_Bot_AITA"
        },
        {
            "level": 0,
            "comment": "&gt;I considered telling my partner's parents about this at one point to let them know the animosity my sister apparently holds towards them, but I decided against it.\n\nYour first instinct was to tell on her?\n\nYTA\n\nGod, even making your relationship with her brother in law official a month before her wedding when you'd been friends/keeping in quiet for so long seems almost deliberate to pull focus on you.",
            "score": 23384,
            "author": "CheerilyTerrified",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seriously.  She's literally trying to upstage her sister and also tattle on her.  Convenient that she comes out with the relationship right before her sister's wedding, but that's glazed over like it's innocuous.  That's huge.\n\nNot getting enough attention OP?  Stealing your sister's limelight not getting enough so you're going to tattle?  \n\nYTA OP YTA very hard.",
                    "score": 7193,
                    "author": "Liss78",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "OP is 25M",
                            "score": 3959,
                            "author": "rncikwb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "M or F doesn't really matter in this case but is the OP in the letter real? They sound so unpleasantly plastic, and then wanting to rat her out?? Super ugly brother if real.",
                                    "score": 1918,
                                    "author": "phemailleprohblemm"
                                },
                                {
                                    "level": 3,
                                    "comment": "This has to be fake",
                                    "score": 162,
                                    "author": "QCr8onQ",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah gay men definitely don’t exist this can’t be real",
                                            "score": 2111,
                                            "author": "childlikeempress16",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "🤣",
                                                    "score": 258,
                                                    "author": "grapeproblems"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, how can he be gay and likable?!  /s",
                                                    "score": 212,
                                                    "author": "william-t-power",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "He's not that likable. Further, it's not about him being gay, it's about the unbelievability that two families would each have one straight child, one gay child, and the straight children would fall in love, and the gay children would fall in love. Other than in a soap opera, when does that happen?!?!",
                                                            "score": 857,
                                                            "author": "inFinEgan"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Was coming to mention this",
                                    "score": 45,
                                    "author": "rose_forever99"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I’m 100% in agreement with the YTA for wanting to tattle.  \n\nBut why would deciding to make his relationship official a month before the sister’s wedding be suspicious to you?  Do you see malicious intent in every unrelated decision?  I cannot imagine that sister’s upcoming wedding had **any** part in that decision.  That’s not upstaging at all. It’s life.",
                            "score": 1069,
                            "author": "Revo63",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think it’s very possible that the wedding *did* factor into it, in the sense that there was concern that it might come out at the wedding and be seen as trying to steal the bride’s thunder - so they instead ensured it was disclosed prior to the wedding. But of course, that wouldn’t be as malicious as people want it to be.",
                                    "score": 1305,
                                    "author": "somethingkooky",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This was my first thought on it. I suppose they could have waited till after too but then things could be awkward for them at the wedding. With the extra pressure of not wanting to upstage but probably having couple habits already that could easilly come out unintentionally during the wedding. Especially if drinking is involved. I think people assume the worst way too easily.",
                                            "score": 426,
                                            "author": "KataLight",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They get caught making out in a closet at the reception.\n\n&amp;#x200B;\n\n\"OH MY GOD!  MY YOUNGER BROTHER JUST WANTED TO STEAL THE SPOTLIGHT FROM MY WEDDING!\"",
                                                    "score": 262,
                                                    "author": "BoozeIsFoods"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I think for some, a pre wedding release is the only way. What is upsetting in the sisters honor is the relationship was extensive and established. A month before the wedding is wedding season- why not be loving and share your life with your family 3 months into the relationship when you understand it’s depth vs ever letting it get close to wedding season.",
                                            "score": 105,
                                            "author": "Minute_Flan_3871"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 14,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It was a month before his sister’s wedding.  She doesn’t “get” the whole month before her wedding.\n\nAs for the rest of it, how was OP supposed to know that their in-laws were less welcoming to his sister?\n\nI don’t doubt that OP has a skewed view of their own family dynamic, and I find him really annoyingly dismissive of the possibility of being a golden child - but I very much doubt he got with her brother in law as some kind of attention grab. \n\nNTA",
                            "score": 916,
                            "author": "PageStunning6265"
                        },
                        {
                            "level": 2,
                            "comment": "He, op is a man",
                            "score": 375,
                            "author": "MrKisi",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Plot twist: it's not a she",
                            "score": 135,
                            "author": "Ok-Situation-4275"
                        },
                        {
                            "level": 2,
                            "comment": "r/SapphoAndHerFriend",
                            "score": 85,
                            "author": "OzLandAlexander"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah I'm going to guess the OP left out a lot of the story. This gives a way what sort of person they are.",
                    "score": 889,
                    "author": "macrowe777",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah they completely leave out any details of why the sister is upset and actual examples…they just write it off as “young sibling lax treatment.” Ummmmm ok so that sounds like the sister may have some good points tbh and they’re just trying to sweep it under the rug. Siblings should get differential and special treatment (barring disabilities ofc and even then the other children should never feel neglected) and to shrug this off as “young sibling” stuff seems really dismissive and purposefully unforthcoming. YTA",
                            "score": 830,
                            "author": "cMeeber",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And let’s be real here - younger sibling treatment and he’s only 2 years younger?? Yeah that’s a no. The term implies the parents are older/more tired so they don’t parent the youngest as strictly. This is generally applied to families that have multiple years between first and last children. My partner was 13 when his youngest brother was born. He definitely experienced the difference. \n\nOP is the golden child but refuses to see it/acknowledge it.\n\nYTA, OP. I feel so sorry for your sister!",
                                    "score": 514,
                                    "author": "blackcrowblue",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I am only 4 years younger than my sister and I fully realize my mom was more lax on me than my sister. People tend to be overprotective of their eldest and once the other(s) come along, parents typically have a better grasp on what is too harsh. It’s unfair to the eldest, but I don’t think it’s that uncommon.",
                                            "score": 434,
                                            "author": "SubstantialRow9206"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I get that in theory but, in my personal experience, I think it’s very possible to experience somewhat different upbringings with a shorter age difference. My sister and I only have a 3.5 year difference but she always had more flexible rules on what she could watch, on her bedtime, on her study schedule. Yes, it might be more rare but it does happen. And I resented my sister for longer than I should’ve because of it.\n\nNot that it changes anything else from this particular story, OP’s still the AH.",
                                            "score": 162,
                                            "author": "basicgirly",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "it seems the sister is mad at OP for something their parents did\n\nESH",
                                    "score": 135,
                                    "author": "redditgetfked",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Was mad.\n\nNow she is mad at something OP did.",
                                            "score": 130,
                                            "author": "abeleo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "yeah he told them he is dating their son. the horror I know",
                                                    "score": 127,
                                                    "author": "redditgetfked"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yep. He is the golden child.  And is working hard at upstaging his sister. \n\nOP YTA. And I bet you thought most people would say you’re not the Asshole.",
                    "score": 448,
                    "author": "giveme25atleast"
                },
                {
                    "level": 1,
                    "comment": "\"But I decided against it\"\n\n&amp;#x200B;\n\nPeople have intrusive thoughts all the time that they don't act on.  It doesn't make them an asshole.  If I see an embankment leading to a cliff on the side of the road and think about driving off of it to see how far the car would go, it doesn't mean I'm suicidal...  Having an internal dialogue and choosing the 'good vs evil' is literally what makes him NTA.",
                    "score": 402,
                    "author": "BoozeIsFoods",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "He did decide against it in the end. If he told the in laws he’d def be an ah but I don’t see any wrongdoing here. It kind of sounds like sis is digging her own grave. I don’t know the dynamic but I think it’s certainly possible that the sister might be more concerned about comparing her relationships with individuals to others’ relationships to those individuals rather than focusing on actually building the relationships.\n\nI agree that even thinking of telling on her to the parents is a dick move but he didn’t decide to do that and he hasn’t done anything else wrong.",
                    "score": 339,
                    "author": "Solid-Effective-457",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He decided against it, but why is he mentioning it here then? In hopes that people will say he should go ahead and tattle?",
                            "score": 302,
                            "author": "atlanticisms"
                        },
                        {
                            "level": 2,
                            "comment": "I agree. I'm not sure why everyone is calling him the AH when it sounds like the sister has some major insecurities. But we don't know the whole story. How could anyone judge either way with this one.",
                            "score": 122,
                            "author": "Waste_Relationship46"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Classic golden child",
                    "score": 143,
                    "author": "DeterminedErmine"
                },
                {
                    "level": 1,
                    "comment": "This AH sounds insufferable, spollt and used to being centre of attention.",
                    "score": 126,
                    "author": "Dashcamkitty"
                },
                {
                    "level": 1,
                    "comment": "I don’t think that makes him the asshole. It’s obvious that the sister has resentment to her parents for the way  (or perceived way) she was treated by her parents.\n\nOP can’t fix that. That’s between OP’s sister and his parents. It suck that it has affected his relationship with his sister.\n\nIt is wrong however for him to raise this issue with the parents. Probably the best approach is to encourage the sister to speak with the parents or get some family therapy.",
                    "score": 103,
                    "author": "Saithly"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;I honestly thought the whole thing was pretty silly, especially since we were both years out of being under our parents' roof at this point, so we went a while without talking. \n\nMost golden children don't realize they are golden children. You admitted your parents were more lax with you. \n\nAlso it's really immature that you're going to go behind her back and tell on her. Sounds to me like you are the golden child and you don't want to admit the favortism cause you like it.",
            "score": 10609,
            "author": "Normal_Matter2058",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was gobsmacked when I read the bit about telling the parents bc not only is it immature, it's also a complete asshole move and dangerous for the sister's mental health for OP to go exposing her trauma to the people who inflicted it without her permission. It is not hard to see why the sister distanced herself from OP for so long. Poor girl can't escape the AH, he's infiltrated her new family just as much as he did their FOO. If I were the sister, I think I'd consider going LC or NC with her in- laws and OP. At the very least, I would be having a long talk with my husband about how to go forward from here.",
                    "score": 2758,
                    "author": "Dewhickey76",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s even worse than that. OP was going to tell the in-laws “to let them know of the animosity my sister apparently holds towards them”. At no point in the story (a story transparently written in a one sided manner to make OP’s sister look bad) did the sister say she had any feelings of animosity towards her in-laws. Her frustration was with OP.\n\nOP is actively considering driving a wedge of lies between his sister and the family she married into.\n\nYTA OP.",
                            "score": 2153,
                            "author": "plaignard",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Sorry, but FOO? What is that? Help an old person out? 😅",
                            "score": 253,
                            "author": "ItsMeTittsMGee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"Family of origin\" -- in this case, OP and his sister's parents.",
                                    "score": 271,
                                    "author": "menstrual-couplet",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "OMG, I thought I was the only one who used this acronym!",
                                            "score": 40,
                                            "author": "serenity450",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "THE BEST THE BEST THE BEST THE BEST",
                                    "score": 79,
                                    "author": "Aggravating-War199",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "has someone taken your faith? it’s real, the pain you feel 🎶",
                                            "score": 37,
                                            "author": "boatwithane"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I was thinking “Fighters” so I guess I’m old too 😂",
                                    "score": 65,
                                    "author": "Both_Perspective1498"
                                },
                                {
                                    "level": 3,
                                    "comment": "I’m guessing it’s Family of Origin",
                                    "score": 13,
                                    "author": "minameens"
                                },
                                {
                                    "level": 3,
                                    "comment": "My guess is Family Of Origin.",
                                    "score": 4,
                                    "author": "raksha25"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Exactly this! My younger sibling was also the golden child to my glass child.  Always had to have everything I did and got it.  Cannot IMAGINE the hurt it would bring up if they managed to finagle a way into my new (in-law) family.  \n\nThat poor woman.  Nothing special just for herself even now that she’s going to be a married adult 😫",
                            "score": 240,
                            "author": "ContributionMean1326",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Glass child? I haven't heard this term before?",
                                    "score": 44,
                                    "author": "FaithlessnessApart49",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The child they don’t see or look right through.",
                                            "score": 143,
                                            "author": "Aer0uAntG3alach"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You can't infiltrate a family you belong to due to birth or adoption, that's an insane statement.",
                            "score": 20,
                            "author": "TrashhPrincess"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Honestly ESH, sister sounds shitty to OP. OP the. Turns around and is shitty to sister by threatening to tattle like a child. \n\nParents are to blame for golden children, not the child themself. Sounds like sister doesn’t want to confront the actual issue (parents sound wealthy, likely the reason parents aren’t being blamed, to keep in the money) so she takes it out on OP.\n\nNow it sounds like OP does like the fact that the in-laws like her more, and it is shady to announce a month before and also to have the first instinct to tattle, which would create issues, not solve any. \n\nSounds like a mess of a family that are just unkind to each other.",
                    "score": 19,
                    "author": "anneofred"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not TA for falling in love and having a good relationship with his family. TA if you tell your in-laws about your sister’s feelings. \n\nDo you have a history of telling on your sister to make her look bad?",
            "score": 7788,
            "author": "callmesillysally",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Do you have a history of telling on your sister to make her look bad?\n\nMethinks yes.",
                    "score": 3736,
                    "author": "Normal_Matter2058",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "YTA for thinking using “methinks” is acceptable /s&amp;j",
                            "score": 752,
                            "author": "FunkyMan19",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hahahahaha",
                                    "score": 63,
                                    "author": "benjibhole"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yep. Definitely as that was his first response. Poor baby.",
                    "score": 251,
                    "author": "giveme25atleast"
                },
                {
                    "level": 1,
                    "comment": "Yes YTA if you do this",
                    "score": 65,
                    "author": "actualchristmastree"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I mean, look at it from her perspective. If she views you as the golden child and her childhood was in your shadow, she finally finds another family to bond with without having to compete with you. Once she felt comfortable she tried to repair your relationship. Then you show up, get on with everyone better than her, hook up with the brother, wait till a month before the wedding to announce it and then call her up to brag - “hey look sis! I know our relationship hasn’t been great but look your husbands family love me more too, look at how much more they favour me!” So understandably she’s pissed, vents her frustration as this clearly isn’t the first time she’s felt this way and your first instinct is to dismiss her feelings and go tell the in-laws, destroying any form of relationship they do have? Id be angry too. I’m gonna say yeh yta. \n\nDon’t date your sister’s fiancé family, this kind of mess is always bound to happen. I get you can’t help who you fall for but she extended the olive branch to repair your relationship with her, not for you to hook up with her fiancé brother. She probably regrets ever reaching back out to you.",
            "score": 4409,
            "author": "TheSuperAlly",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is the best explanation I’ve seen. He’s clearly not considering any of this from the sister’s perspective.",
                    "score": 1024,
                    "author": "kellyoohh"
                },
                {
                    "level": 1,
                    "comment": "This is what I immediately thought. She gets a new family to start fresh with and finally gets away from him, just for him to loop himself back in. In her mind, every time the family tries to gather with her in-laws she’ll have to see him and relive her childhood of feeling second best. It was enough of an issue for her to distance herself from him and I’m betting her and her fiancé bonded over both feeling the same way growing up. OP is entitled as hell and brushes off her feelings way too easily. YTA massively.",
                    "score": 605,
                    "author": "thoog93"
                },
                {
                    "level": 1,
                    "comment": "That was my first thought. Why would anyone choose to hit on your sister's in-laws? Something about that just feels gross to me. Even if they just started out as super close friends, doesn't that sound extremely sus? My sister's fiance and in-laws are her relationship, and personally I don't have nor want an actual relationship with them outside anything obligatory. He gets YTA from me for sure",
                    "score": 273,
                    "author": "HeatBombastic"
                }
            ]
        },
        {
            "level": 0,
            "comment": "YTA. You are very dismissive of your sisters feelings and experiences. Telling your partners parents about this would be a super low thing to do.",
            "score": 4107,
            "author": "DragonflyOk9277"
        },
        {
            "level": 0,
            "comment": "YTA\n\nBy your own description you were the golden child and since your first response is to tattle like a 5 year old, I am guessing that this has been a lifelong pattern. You tattle on your older sister, she gets in trouble and get to gleefully carry on.",
            "score": 3725,
            "author": "ResoluteMuse"
        },
        {
            "level": 0,
            "comment": "YTA. Why would you tell on your sister to her in laws? That is super weird.",
            "score": 1858,
            "author": "rncikwb",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1857,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes! I’ve seen siblings with a 10-15 year gap and by the end the parents are clearly tired and burnt out and much more lax. With two that are only two years apart, you may ease up and learn a little more how to pick your battles, but they’re largely in the same phase most of the time and there shouldn’t be a substantial difference in parenting.",
                    "score": 499,
                    "author": "Lost-Time-3909",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There can be other factors. I’m five years older than my youngest sister, and three years older than the middle one. Between when my middle sister was old enough to start forming recallable memories and when my youngest sister did, our parents financial situation changed a LOT. This meant little sis always got more than either of us older ones, especially since their financial situation kept improving, so little sis always had more than we did at the same age.\n\nIn addition, I have AuDHD, a diagnosis that didn’t even exist then (you could have one or the other, not both) and was forever getting into trouble because I didn’t understand how I was supposed to behave. Middle sis is a drama queen (always was, always will be, and these days I adore her for it) and had a lot of LDs. Baby sis was and is a sweetheart, and was the easiest kid. So my parents were a lot easier on her due to her personality, her being an overall easier kid, and my parents being more experienced.\n\nBaby sis is the only Gen Z of us, so she was also reaching milestones in a very different world than we did. Both middle sis and I have pre-9/11 memories. She doesn’t. How we were raised reflected that change. \n\nSo it’s very possible for parenting styles to change drastically, even within a short span. Or just based on the personality of the child in question.",
                            "score": 197,
                            "author": "Kingsdaughter613",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There's also the good old sexism that can be reason here.",
                                    "score": 153,
                                    "author": "TheWitchOfTariche"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My sister and I are only 14 months apart but she definitely got it easier. Younger sibling privilege is a thing in a lot of families.",
                            "score": 115,
                            "author": "firefury605",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep. I love my sibling, but I would spend actual literal years convincing my parents I was old enough for some privileges (removal of internet parental controls, getting a cellphone, allowed to stay up later, etc) only for them to give it to my years younger little sibling not even a month later. We joke that I was the test kid. My little sibling was always fully aware that I was paving the way though. Unlike OP.",
                                    "score": 97,
                                    "author": "Skye_Reading",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;My little sibling was always fully aware that I was paving the way though. Unlike OP.\n\nMine wasn't. I don't fault her for it at all because no one told her and there wasn't really a way for her to know outside of that.",
                                            "score": 28,
                                            "author": "firefury605",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "See I was smart and notated what age my brother got certain permissions. It didn't always work because being the girl, they were more strict with my freedoms but later bed times and things like that, I could always refer to to get my rules laxxed.",
                                                    "score": 12,
                                                    "author": "ScorpionGem11",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Info.  Did you just call and brag to your sister about your relationship with the in laws or did you call and openly listen to how her relationship has been?  \n\nThink of it like this. \nIf I start a conversation with someone about my latest round the world trip stopping at several Disney parks without stopping to see first if they have ever even traveled out of their home state then I am the AH.  \n\nIf I start a conversation going on and on about how absolutely awesome my husband is and that he got me a great gift for mother's day without pausing to see if the person I am talking to just had their husband cheat on and leave them, I am the AH.  \n\nIf my friends talk to me going on and on about how their kids are getting into great colleges and mine isn't graduating, they aren't trying to be an AH, but they are still hurting me.  It isn't that I don't want them to share their joy.  It is just that joy needs to be tempered with understanding and kindness, to understand where the person you are talking to is at before you share in a way that comes off as gloating.  \n\nThe fact that your gut reaction is to rat her out for feeling less than you yet again, and the fact that you are dismissive of her feelings overall, makes YTA.  No matter how unintentional.",
            "score": 1115,
            "author": "angiehome2023",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Think of it like this. If I start a conversation with someone about my latest round the world trip stopping at several Disney parks without stopping to see first if they have ever even traveled out of their home state then I am the AH.\n\nyuuup\n\n\none time I was getting a bone marrow biopsy and the doctor strikes up a conversation by saying, \"So, what's your favorite country you've been to?\"\n\n\nI said, \"I haven't been out of the country.\"\n\n\nHe said, \"Oh no, it can be any - doesn't have to be this year!\"\n\n\nI said, \"No, I have never been out of the country. It's expensive.\"\n\n\nThen he just said, \"oh\"\n\n\nand is quiet the rest of the bone marrow biopsy (20 minutes).",
                    "score": 492,
                    "author": "bros402",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have been that AH.  It kind of comes down to giving enough of a damn about the person you are talking to that you check in with where they are.",
                            "score": 156,
                            "author": "angiehome2023",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "tbh if you at least continue the conversation or seem a little apologetic, that's the way to do it.\n\n\n\nand you didn't have a needle in their hip\n\n\n...right?",
                                    "score": 108,
                                    "author": "bros402",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "But seriously, if OP had reacted to his sister with kindness and recovered the conversation I think it could have been fine.  If they had kept talking and apologized for not paying attention to her, for gloating.  Saying they didn't mean to gloat they were just happy.  Ask her about her first meeting with the family.  Ask her about the relationship.  How does Xmas work.  Show any kind of interest in sister any kind of caring.",
                                            "score": 96,
                                            "author": "angiehome2023",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Exactly - OP did not try to handle this well at all.\n\n\nlike, i'm autistic and I know how to handle this better than OP (even if I would be a bit stilted in the conversation)",
                                                    "score": 52,
                                                    "author": "bros402",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It is because op presupposes their sister is being silly.",
                                                            "score": 64,
                                                            "author": "angiehome2023",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "This.",
                                                                    "score": 20,
                                                                    "author": "sunshinefireflies"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "No it is usually some random person I am chatting with because I like to chat and I don't bring  needles to run errands. I have run into a few with shopping carts.",
                                            "score": 12,
                                            "author": "angiehome2023"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;I just looked at as the typical more lax treatment of the younger child in a family\n\nErm... Lax treatment of the golden child\n\n&gt;spent about a year as friends before making things official around a month before my sister's wedding.\n\nCouldn't have waited another month till after the wedding, no? Had to make sure you got the fresh attention?\n\n&gt;I considered telling my partner's parents about this ...but I decided against it.\n\nYour instinct is to continue to be the golden child, but at least you stopped yourself there\n\nStill, YTA, although I don't think it's fully intentional, just a product of your situation growing up",
            "score": 960,
            "author": "podgehog"
        },
        {
            "level": 0,
            "comment": "YTA, everything about what you've written screams I need attention. You fell in love great! You announce it a month before her wedding. Totally unnecessary. You may or may not be a golden child but you are the proverbial baby of the family and seem like someone who can't function unless they are the center of attention. I can't wait to see what you do next. Announce your engagement at her baby shower maybe? The purchase of a new home at their child's first birthday.",
            "score": 851,
            "author": "Winter_Raisin_591",
            "replies": [
                {
                    "level": 1,
                    "comment": "At what point does life need to stop before a wedding happens? I genuinely don't understand why they can't announce a relationship bei g official a whole month before the nuptials are scheduled. Obviously day of, day before, even the week of, sure. But a fucking month?",
                    "score": 172,
                    "author": "TrashhPrincess",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would agree that in a normal situation, this really isn't really an issue. However, we are on AITA. \n\nIt sounds like that this is not an isolated incident and that this is not the first time he's done something like this to his sister. Him announcing something a month before his sister's wedding probably is just the latest event in a long series of events where he's tried to outshine his sister or shift attention away from her. There's probably a longer narrative of this type of behaviour from him.",
                            "score": 261,
                            "author": "UDoucheGoldenChild",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes. And not just “announcing something.” Announcing he’s in a romantic relationship with his sister’s fiancé’s BROTHER.  Who if he had any concept of boundaries he wouldn’t be dating. He’s creepily competitive w/ his sister. It’s so important to him that her in laws like him best, he has to make damn sure she knows it?  What an asshole!",
                                    "score": 222,
                                    "author": "EmilyAnne1170"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Man, the month before my wedding was the most stressed I've been in my entire life to date. If my younger brother who had ALWAYS needed the spotlight to be on him announced that, ta-da, he was dating my fiance's younger brother *who has never brought a partner home before* I would probably be a bit bitter, tbh.",
                            "score": 179,
                            "author": "nkbee",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I think when it’s such an unusual situation as dating within the same family, unusual enough to have deliberately kept it quiet, you wait until after if possible. The fact he announced it so close to the wedding means he absolutely 100% could have waited.",
                            "score": 82,
                            "author": "Math-Soft"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "YTA.  \"When I told my sister this, thinking it was something we could bond over...\"  Um...why did you think this was going to be any sort of a bonding experience?  What exactly are you trying to accomplish here?",
            "score": 581,
            "author": "shammy_dammy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea I thought that was a strange train of thought especially since he is aware of her feelings towards him and her parents. Instead he just provoke her more.",
                    "score": 184,
                    "author": "Mangareader90"
                }
            ]
        },
        {
            "level": 0,
            "comment": "YTA. Subconsciously you are trying to upstage your sister, you just don’t see it.",
            "score": 490,
            "author": "Due-Compote-4723"
        },
        {
            "level": 0,
            "comment": "YTA it’s very telling that you’re first instinct is to tattle on your sister.",
            "score": 405,
            "author": "Haunting-Aardvark709"
        },
        {
            "level": 0,
            "comment": "YTA. I can tell from your post that you are at least part of the problem here. Why would you ever even think to interfere with her relationship with her in laws? You sound like a goody two shoes who likes to snitch to make themselves look better. I feel bad for your sister because she can't apparently have anything for herself. She's not going to get a chance for these people to accept her because you're already there acting like the \"perfect son in law\"\nEdited misgendered op",
            "score": 369,
            "author": "keesouth",
            "replies": [
                {
                    "level": 1,
                    "comment": "OP is a male. I do agree with you with the sucking up thing he seem to be use to just having everyone love him and he even admits that he is good at it too by describing what his parents does.",
                    "score": 82,
                    "author": "Mangareader90"
                }
            ]
        },
        {
            "level": 0,
            "comment": "YTA\n\nThis post didnt go the way you planned huh?",
            "score": 320,
            "author": "Orangebiscuit234",
            "replies": [
                {
                    "level": 1,
                    "comment": "He sounds like an insufferable narcissist, so no, it probably did not!",
                    "score": 181,
                    "author": "Natural_Anywhere_726"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I considered telling my partner's parents about this at one point to let them know the animosity my sister apparently holds towards them, but I decided against it.\n\n&amp;#x200B;\n\nWOW.\n\nYTA YTA YTA",
            "score": 266,
            "author": "Negative_Opinion_422"
        },
        {
            "level": 0,
            "comment": "You need to see it from her perspective. \n\nTo her it will look exactly as she described it. You swanning in, muscling in on her life and getting an easier ride. On top of a lifetime of feeling second best in your parents’ eyes, she will feel that she has worked hard to carve out a life for herself, but now this is just history repeating itself with her being second best to you with the in-laws. \n\nI know you can’t help falling for the brother, but dude, it’s a bit soap opera (and kinda incest-in-law) and not really a good look for you.\n\nBut NTA unless you even hint at this to the in-laws. Then you’d be a major AH.",
            "score": 235,
            "author": "Daveii_captain",
            "replies": []
        },
        {
            "level": 0,
            "comment": "YWBTA for telling your in-laws. What would that achieve other than making your sister's life harder? \n\nESH in general. It isn't your fault that your in-laws like you, but you are so dismissive of your sister's experience that it's hard to judge.",
            "score": 198,
            "author": "strandedinaber"
        },
        {
            "level": 0,
            "comment": "Oldest daughters often experience parentification and it negatively effects us for years if not the rest of our lives. The fact you shrugged it off without seeming to care at all about her feelings was enough for me to know where this was going.  \n\nYTA. Not for dating him. Just for the way you don't give a shit about your sister. You even said in a comment that you're only focused on you. It's selfish. To have healthy relationships with others, you can't only be focused on you.",
            "score": 192,
            "author": "Exact_Roll_4048",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Just for the way you don't give a shit about your sister. You even said in a comment that you're only focused on you. It's selfish.\n\nWhat's the saying? Unbothered and in my own lane? OP is definitely unbothered, but he's swerving all over the highway to cut his sister off.",
                    "score": 97,
                    "author": "DooglyOoklin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "YTA, from the information here, you are the golden child. You even admitted that your parents were more lax with you. Your sister was finally able to leave her family and be part of a family she thought would accept her but now you are making her feel like an outcast. It’s nothing wrong with falling in love but really did you have to announce it a month before her wedding? \n\nAnd it looks like you brag that you can kiss up to ppl to make them like you. You did the best you can for your partner family to love you when your sister was probably still trying to find a way to be part of her fiancé family. It’s hard for a golden child to see that they are the golden child. I can truly understand your sister feelings.",
            "score": 179,
            "author": "Mangareader90",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Info\n\nHave you stopped for a second to consider the sexism that played into the differences between you  and your sister’s upbringing? How controlled her life was in comparison to yours? \n\nWhen she does bring it up, your instinct isn’t to feel compassion for her, but to blow her off.\n\nHave you considered that when a woman is joining the family, her MIL deals with jealousy over not being the most important woman in their son’s life anymore? That her opinion influences the whole family? That dynamic has existed for generations?\n\nThat their warmness to you could be over-exaggerated? In an effort to prove how liberal, open-minded and progressive they are they are totally, completely rubber-stamp 100% A-Ok behind you and you dont hear about concerns and issues?\n\nHave you really spent any time st all considering the bigger picture?",
            "score": 172,
            "author": "Peskypoints",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is 100% my take too.",
                    "score": 35,
                    "author": "skelery"
                }
            ]
        },
        {
            "level": 0,
            "comment": "YTA- How old are you? You're going to tattle on your sister to parents? Do you know you're proving that you are the golden child and acting incredibly entitled.",
            "score": 119,
            "author": "nickis84"
        },
        {
            "level": 0,
            "comment": "Wow. I am definitely in the minority here, but I would say NTA. OP is not responsible for the parents treatment of his sister, any more than he is the in law’s behavior. “Making things official”…. That sounds like they decided to date exclusively, not get engaged. Why would he put that off, because his sister is getting married in a month?  Stealing experiences as a kid? Thats on the parents. Stealing experiences as an adult?  They are making their own relationships. Sister needs to stop worrying about what she is missing, get some therapy, and build her own relationships. OP says he was welcomed by the in laws, but doesnt say that he even knew sister wasnt. Maybe the sister is an entitled, unreasonable person… sister needs some therapy.",
            "score": 106,
            "author": "jubalee49",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you! This whole thread is full of assumptions, it's nice to see some reason on here.",
                    "score": 49,
                    "author": "Smart-Expression-987"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yta why would you tell your in laws unless you do want to be seen as the best one? Let your sister have feelings. You don’t have to break up with your bf but the fact you immediately want to tell on her when she hasn’t done anything is concerning. Just the way you talk about her being upset about your childhood shows the type of person you are. Your giving off golden child vibes",
            "score": 105,
            "author": "l3ex_G"
        },
        {
            "level": 0,
            "comment": "YTA...out of all the people in the world you had to choose this one? You didn't know better???",
            "score": 108,
            "author": "NastyNattyBoi",
            "replies": [
                {
                    "level": 1,
                    "comment": "They didn't care.",
                    "score": 50,
                    "author": "DooglyOoklin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "How your parents and future in-laws act is not your fault. \n\nBut you’ve dismissed her feelings as “silly” which is totally on you. \n\nYou could try being her ally and see how that goes?",
            "score": 97,
            "author": "Lonelyokie"
        },
        {
            "level": 0,
            "comment": "NTA. You didn't steal her in-laws. I know I'm going to get flack for this, but realistically if the two of you meet the same people, and everyone you meet prefers you, maybe she should do some self reflection about why. Most parents are more lax with second and additional children. This doesn't make them the golden child.",
            "score": 89,
            "author": "Koalachan",
            "replies": [
                {
                    "level": 1,
                    "comment": "Some people are extremely charming in public but shitty in private.\n\nOr, it could simply be a matter of one person being an extroverted social butterfly and the other one being introverted. (I’m guessing you are extroverted as introverts really know this already, by like 2nd grade, LOL.) \n\nThe sister doesn’t have “issues” just because her brother can literally charm the pants off people.",
                    "score": 58,
                    "author": "-9-0-3-5-7-6-8-"
                },
                {
                    "level": 1,
                    "comment": "Exactly, if everybody doesn't like you, maybe look at that common denominator. It's not OP's fault the in-laws like him.",
                    "score": 39,
                    "author": "Smart-Expression-987"
                }
            ]
        },
        {
            "level": 0,
            "comment": "YTA even from what little you wrote it does seem like you were the golfen child. How about you look at it from her view instead of telling on her. Most golden child don't realize that's what they were.",
            "score": 86,
            "author": "Gullible-Zone-209"
        },
        {
            "level": 0,
            "comment": "INFO: I honestly can’t vote on this, it’s really hard to know without hard examples why the sister thinks OP is the golden child. Did she give any examples and can you think of any specific instances of this “lax treatment”. Do you have any idea why your sister thinks your bf is the golden child? Or why the in laws were more welcoming to you? \n\nI’m not going to jump with everyone and say “oh you must have been the golden child” because I genuinely don’t have enough info and relationships are multi-dimensional. I grew up with a badly behaved child, so it was my job to acquise in a lot of areas because I was the better behaved child. But I will acknowledge that because I was better behaved I got preferential treatment in other areas.",
            "score": 82,
            "author": "I-hear-the-coast"
        },
        {
            "level": 0,
            "comment": "&gt; …*she thought of me as a \"golden child.\" She held resentment towards me for things I just looked at as the typical more lax treatment of the younger child in a family. I honestly thought the whole thing was pretty silly, especially since we were both years out of being under our parents' roof at this point... *\r \nThen after your argument with her you wrote:\n\n&gt;*I considered telling my partner's parents about this at one point to let them know the animosity my sister apparently holds towards them…*\r  \nSo which is it? Are you the adult that finds the sibling animosity silly or are you the tattle-tell younger sibling that wants your older sibling to look bad in front of the new parents? If you genuinely love your partner and his family, your sister is going to be a part of this dynamic now as both your blood kin and in-law. Obviously she feels distressed and hurt and you’re dismissing her feelings. Her feelings are obviously raw and real. Right now it’s on you to reach back out to her and for once LISTEN to her. Don’t interrupt her. Let her say what she needs to say. Even if you both end up disagreeing at the end, at least agree that you both equally love the family and the best move is to keep the peace.",
            "score": 74,
            "author": "ExpensivelyMundane"
        },
        {
            "level": 0,
            "comment": "YTA for even considering telling the in laws about the conversation.  If that what you did as children?  Tell on her when you thought she was bad.  No wonder you two have issues.",
            "score": 68,
            "author": "Green_Seat8152"
        },
        {
            "level": 0,
            "comment": "Your initial instinct was to sabotage your sister’s relationship with her actual in-laws? You sound like a truly awful spoiled brat. No wonder she feels the way she does.",
            "score": 55,
            "author": "MissKatieMaam77"
        },
        {
            "level": 0,
            "comment": "YTA and you see the irony in implying that you’re both adults (not under your parents roof) but your first instinct is to ”tattle” on your sibling (like a child still living under your parents roof)? I’m sorry but I’m questioning just what your behavior towards your future in laws has been? Maybe like your parents you’ve been schmoozing more than you even realize. Maybe take a step back and really reflect on your behavior and motivations, for your own good. Maybe take what your sister says seriously. I hope you’re able to do that, and I hope I’m wrong, but I sure am feeling sorry for your sister.",
            "score": 51,
            "author": "ReallyTracyQ"
        },
        {
            "level": 0,
            "comment": "YTA and sound insufferable.  Sure seem to have pulled the wool over peoples eyes",
            "score": 50,
            "author": "lkathleensc"
        },
        {
            "level": 0,
            "comment": "Just like the baby of the family to want to go whining to mom and dad. YTA for not having any self-awareness.",
            "score": 47,
            "author": "DientesDelPerro"
        },
        {
            "level": 0,
            "comment": "Honestly wish we could get the sister's side of the story.",
            "score": 41,
            "author": "MRSYBoy"
        },
        {
            "level": 0,
            "comment": "Nta. You cannot \"steal\" people. If your sister really did get  a different reception from the inlaws than you did then she should be looking to her in personality why. She can't blame that on your so called golden child status unless there's some  membership card you flashed to ensure you were treated in the manner deserved by your superior place in the hierarchy. The inlaws probably welcomed you the same but ultimately warmed up to you because your character was warmervand more genuine. Quite frankly sis seems to be a bitter and sour holding animosity against you, your partner the inlaws possibly the starbucks worker who wrote her name wrong on her morning pumpkin spice latte etc. There's no need to tattle on her that would make you the A. And they probably already know/sense her attitude.",
            "score": 40,
            "author": "Tizzery"
        },
        {
            "level": 0,
            "comment": "Since you asked for outside perspective, it sounds like your sister is insecure or has a chip on her shoulder. I don’t think she’s inherently bad for that, it is something she should work on, but I don’t think either one of you are in the wrong for everything listed here.\n\nOur childhoods have a lot to do with the people we become. It’s foundational. It sounds like your sister spent much of her life feeling like she’s in last place. Not even her own family treated her like she was special. What may have been a random Tuesday for you during your childhood may be a core memory for her. It’s not cool to dismiss her feelings as silly.\n\nShe has the same parents as you, who you called fake and schmoozy, so you can understand her excitement at having a second chance at connecting with a family. And then you, the person who always took first place when it came to familial love, shows up and wins them over.\n\nYour sister hasn’t responded in the most emotionally intelligent way. In-laws can like more than one person, and sometimes relationships take a while to develop. She’s also a month away from her wedding. She’s stressed and not handling things well. That doesn’t give her free reign to be a jerk, but it’s something to be mindful of.\n\nYou can’t help that you and her fiancé’s brother connected so it’s not cool that she said that. But it seems like she’s just speaking from frustration.\n\nYour sister doesn’t hold animosity towards the in-laws. Seems like she just wants to be liked. I’m glad you decided against telling the in-laws because what would that really accomplish? \n\nTLDR: Your sis sounds insecure. Try approaching with compassion. NTA unless you tattle.",
            "score": 45,
            "author": "Best_Plantain5024"
        },
        {
            "level": 0,
            "comment": "I can't believe you were thinking about telling them how your sister feels. Have you been doing that kind of thing her entire life? \n\nYou can't help who you fall in love with, but I'd encourage you to examine some of what your sister is talking about.",
            "score": 40,
            "author": "whereisbeezy"
        },
        {
            "level": 0,
            "comment": "Y’all are condemning OP for telling the in-laws—and he ***DIDN’T DO IT!***",
            "score": 38,
            "author": "serenity450",
            "replies": [
                {
                    "level": 1,
                    "comment": "Because even thinking about it is indicative of malicious intent",
                    "score": 46,
                    "author": "LetThisBeALessonToMe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I guess I can see that. Not gonna lie; it’s significant that he even considered it. But I tend to be a glass-half-full person.",
                            "score": 6,
                            "author": "serenity450"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA.  \nOne. You wanted to say it but didn't and thats the mature thing to do.  \nTwo. You're both adults. If your man's parents likes you better, it's probably because you're a nicer person to be with. If they don't like your sister, thats probably more on her.  \nEnjoy life, you can't please everyone and you need to look after your own future, and hell, it sounds like you're making your man's parents happy and thats what matters.  \nWhat does your sister want? Everyone to be miserable?",
            "score": 38,
            "author": "dirtyoldfart76"
        },
        {
            "level": 0,
            "comment": "YTA. It sounds like a toxic environment altogether",
            "score": 36,
            "author": "Ok-Cardiologist-6119"
        },
        {
            "level": 0,
            "comment": "NTA, golden child or not you haven't done anything wrong. You said you were contemplating telling your parents about the situation just so they are aware of the animosity, which makes sense to me. When me and my sibling had our fallout, we both let our parents know just so they knew that me and my sibling were no longer talking to each other. Now if you do this in a more tattling manner like comments are pointing out (i.e. running to mom and dad and going \"sib is doing this thing jsyk) that is probably a dick move as you both are adults. But just giving your parents a heads up you and your sister aren't on speaking terms seems reasonable to me. As for everything else, your sister seems rude for claiming you're stealing her in-laws. If the in-laws didn't respond to her the same way they did you, that's in no way anything to do with you. Some people just click better than others. And you were just trying to have something to click with your sister on which is a nice thing to try and do and something I can relate to. I can't really tell if you're the golden child and frankly whether you are or aren't really doesn't affect this situation. Idk, that's my two cents at least\n\nEdit: I reread and saw that it says tell partner's parents not OP's parents. That would be a major dick move I'd like to say. If OP did decide to tell them I'd say YTA, but since that hasn't happened I'm still going with NTA. So NTA with a side of WBTA. Just wanted to clarify cause I totally misread the last detail majorly.",
            "score": 33,
            "author": "bitchdontmakemekillu"
        },
        {
            "level": 0,
            "comment": "YTA and you don’t even see it because it’s always been about you. You don’t even realize it which shows how self-serving you are. It’s all about you and no one else",
            "score": 33,
            "author": "Nericmitch"
        },
        {
            "level": 0,
            "comment": "Dude, you are over 20 and you are both adults.  I really despise people who involve their parents in their fights with siblings or even spouses.  You are not children anymore and mom and dad cannot solve your problems for you.  What are they going to do?  Put her in a \"time out?\"  Punish her?   You are the \"golden child.\"  If I were you, I would stop trying to outshine your sister.  Let her shine for once in her life!",
            "score": 32,
            "author": "Icy_Eye1059"
        },
        {
            "level": 0,
            "comment": " Jesus H Christ, it's no wonder your sister holds resentment towards you.\n\nI bet you were the King of self-entitled assholes growing up..... and guess what....\n\nYOU HAVEN'T CHANGED A FUCKING BIT!\n\nShe should kick you to the curb, and cut contact with you.  I sure as hell would, because Lordy, did you EVER cross boundaries here!\n\nVERDICT: YTA YTA YTA!!!",
            "score": 28,
            "author": "AtTheEastPole"
        },
        {
            "level": 0,
            "comment": "You want to tell on her to her in laws? That's your first reaction? YTA",
            "score": 31,
            "author": "thesuunisrising"
        },
        {
            "level": 0,
            "comment": "YTA instead of tattling or relishing in this praise so much you should recognize that you are being given different treatment. Oftentimes the golden child doesn’t realize they are even being spoiled and they can ignore the struggles of their neglected siblings. Not only are you preferred by your family but by the in-laws as well, you should use your love for your sister and these parents affinity towards you to bring your sister more into the fold. You should have your sisters back and help these people like her as opposed to tattling and making her feel lost and unwelcome.",
            "score": 24,
            "author": "littlegirl14"
        },
        {
            "level": 0,
            "comment": "YTA",
            "score": 22,
            "author": "jewelthiefs248"
        },
        {
            "level": 0,
            "comment": "YTA. WOW.\n\nHe's feels threatened. His sister can expose how he treated her growing up can destroy this fake image he's portrayed to the in laws.",
            "score": 21,
            "author": "Regular-Blueberry876"
        },
        {
            "level": 0,
            "comment": "YTA\n\nAnd it's *quite* obvious that your focus is on yourself.  It's that way with most golden children.  You're atrocious.",
            "score": 21,
            "author": "MissyJ11"
        },
        {
            "level": 0,
            "comment": "NAH\n\nBut, I think you might be a bit insensitive.\n\nIt doesn't matter if your sister's perspective of you as the GC is right.  It matters that it was her experience.  You need to honour that she felt that.  Being lax on the younger child may be typical but that doesn't mean that it is fair.\n\nThe fact you dismissed it as 'silly'?\n\nI'm glad you didn't talk to your inlaws about this because 1) It's not your business to do so and 2) You are making an assumption that your sister has animostity towards them.\n\nIt is more likely to do with her own vulnerabilities and insecurities.  I would not have wanted to share my inlaws with my siblings even thought I am VERY close with them.  So, this is not so strange of your sister.\n\nThis situation is different from what she saw as her future and she may need time to adjust to it.  You are the interloper in this situation (though it is a happy turn of events) so you can show some graciousness.",
            "score": 17,
            "author": "AdaptableAilurophile"
        },
        {
            "level": 0,
            "comment": "Mmmm to me is difficult because or you are charming and you sister envy you or you are very insensitive to your sister, why did you need to tell your sister that you really got along with you in-laws? That is what making me think that you are manipulating the narrative, look just try not the make more drama, just stop talking to your sister, she is very wary of you, and she doesn't see you as sister but competition.\n\nAnd if this relationship is serious then try to divide your relationship with your sister and your in-laws, but i think you a little YTA, because in the end of the day, you should have a great distance from your sister, because in the end of the day she doesn't want you in her space. Respect that.",
            "score": 19,
            "author": "Upbeat-Ad-3316"
        },
        {
            "level": 0,
            "comment": "INFO. I think it’s telling that you’re not telling us how EXACTLY your experience growing up was different from your sister’s, even after she pointed it out to you. Which leads me to believe that she’s probably right and you WERE treated very differently. Especially since older daughters often have to deal with much higher expectations than younger kids. \n\nI’m certainly leaning towards YTA here, because you seem very dismissive of her feelings and experiences. That said, there’s certainly some info missing.",
            "score": 20,
            "author": "golden-starss"
        },
        {
            "level": 0,
            "comment": "Yta",
            "score": 17,
            "author": "BeneficialHurry8644"
        },
        {
            "level": 0,
            "comment": "the way you talk about your sister and her lived experiences with such a “she’s so silly” undertone tells us all we need to know about you lol. YTA.",
            "score": 14,
            "author": "akira_fudou"
        },
        {
            "level": 0,
            "comment": "You thought that your sister who sees you as a golden child and didn’t talk to you for years would be happy about you dating her future brother in law? Really? That combined with your instinct to tell on her make you, at best, incredibly emotionally unintelligent and at worst, a crappy brother.\n\nYou’re not an AH for anything having to do with your relationship with your boyfriend. I’m going with ESH because your sister sounds really immature, but you’re worse than she is.",
            "score": 14,
            "author": "Less-Bed-6243"
        },
        {
            "level": 0,
            "comment": "info: why was sister not welcomed into family?",
            "score": 12,
            "author": "Professional_Sun7851"
        },
        {
            "level": 0,
            "comment": "I think your question needs to be “would I be the asshole” if you told the in-laws. Yes, you would be. \n\nHowever if you’re asking if your TA because they appear to like you better ?  No,  some people are more likable than others. Your sister is jealous of how much simpler and easier it is for the in-laws to like you.",
            "score": 13,
            "author": "leesylooloo"
        },
        {
            "level": 0,
            "comment": "YTA.",
            "score": 12,
            "author": "No_Lifeguard7215"
        },
        {
            "level": 0,
            "comment": "YTA. You shouldn’t fuel animosities, especially within a family.\n\nAlso, there are many good reason why people from the same family shouldn’t marry to the same external family twice (at least in our “modern” society). What happens if you (or your sister) break up with your partners? What happens if that break up is because of something serious (such as infidelity, abuse, etc)? What happens if there is drama between the two of you (which you clearly are causing)? Or if there is drama between the brothers, or with their parents? \n\nYou’re really making a time bomb with that relationship. So at least, if you keep going with it, you should try to minimize the opportunities for it to explode.",
            "score": 11,
            "author": "Rainks_rod"
        },
        {
            "level": 0,
            "comment": "NTA.  Just coming out with a relationship isn't that big of a deal. No one cared that a sister decided to have her wedding 20 days before her sister. They just decided to let people know they were in a relationship. Did anyone ever stop to think OP just makes friends easier and is fun to be around. There was no tattling, just the thought. Not knowing how to handle the situation. I'm still going with NTA, it's an opinion, so keep the nasty comments to yourself please.",
            "score": 10,
            "author": "Less_Ordinary_8516"
        },
        {
            "level": 0,
            "comment": "Sounds like the \"I'm innocent and so sweet I'm snow white I would never do that deliberately!\" Kid growing up that was so well put together but the second anyone turned their back, it was hunting season.",
            "score": 10,
            "author": "Logical-Victory-2678"
        },
        {
            "level": 0,
            "comment": "YTA\n\nThe way you talk about your sister is so dismissive; you haven't even considered that her experiences might be valid. You're a terrible brother.",
            "score": 8,
            "author": "UDoucheGoldenChild"
        },
        {
            "level": 0,
            "comment": "ESH. You sound like you don't particularly have empathy for how your sister feels. Regardless of how *you* experienced your growing up, *she* clearly feels things were very different, and you admit your parents were more lax with you which, while it might not be because you are the \"golden child\" still would clearly give that impression. Also you would be T A absolutely if you tell her in-laws about this.\n\nAs for your sister, it sounds like she might be over reacting to your dating her husband's brother. If she was received differently by the family she probably has reason to be upset, but if you are truly innocent of instigating any of this then she shouldn't be blaming you and accusing you of stealing opportunities from her when the ones to blame for that are your parents. You don't seem to have done any of this out of malice, just cluelessness, and her immediately jumping to anger at you over this is what makes her also suck. \n\nStill, it sounds like your relationship is quickly becoming worse due to her anger and your lack of empathy. Might be best for you both for her to limit contact, and for you to encourage her in-laws to accept her as family.",
            "score": 10,
            "author": "WanderingAl08"
        },
        {
            "level": 0,
            "comment": "I wouldn't tell the family a thing about it. Be polite with your sister but nothing more.",
            "score": 7,
            "author": "ManxJack1999"
        },
        {
            "level": 0,
            "comment": "I have a feeling that the OP has always competed with the sister, tried to infiltrate into her friendship circles, tried to outshine and upstage his sister in everything, and got away with it. While OP’s sister can’t control whom he feels attracted to, it is rather telling that OP’s first instinct was to dismiss his sister’s hurt from\nNot being as readily accepted by her in laws and also for the OP to tattle on her to his parents right before her wedding, causing more headache and grief to his sister. \n\nSo sister already has experienced an entire lifetime of feeling second best with her birth family and now she has to watch OP infiltrate her life yet again and feel second best with her in laws too. And this happened because sister made the kind gesture to patch things up with OP.",
            "score": 9,
            "author": "National-Return-5363"
        },
        {
            "level": 0,
            "comment": "Lets be clear. You are NOT TA for dating your future BIL or for getting along with your boyfriends family.\n\nYTA for announcing your relationship right before the wedding and for thinking about telling on her. She doesn't hold animosity towards them, she's just frustrated and doesn't feel welcomed. \n\nIt also sounds like you were bragging about your in laws. You sound like the type that if you get pregnant at the same time will hear the name she plans on using and use it yourself.",
            "score": 10,
            "author": "Auroraburst"
        },
        {
            "level": 0,
            "comment": "YTA",
            "score": 6,
            "author": "marcelyns"
        },
        {
            "level": 0,
            "comment": "YTA. Time to apologize to your sister",
            "score": 8,
            "author": "Glitter_apple"
        },
        {
            "level": 0,
            "comment": "NTA. He thought about telling his boyfriend’s parents that there was tension between him and his sister, but he didn’t. We all think of things we shouldn’t do. As long as we don’t do them, we are not assholes. \n\nAs for telling the family a month before the wedding, after two years of friendship, and a romantic relationship,  that gave the family a chance to get used to the idea before the wedding. Otherwise, his sister would be accusing him of upstaging her at the wedding when he danced with her brother-in-law. What do you want him to do?",
            "score": 6,
            "author": "Fast_Information_810"
        },
        {
            "level": 0,
            "comment": "It’s pretty obvious that golden children never realize they’re golden children. A few things you said… writing off your sister’s feelings, the timing of your announcement, the fact that you were thinking about *tattling* on her to your in-laws??\n\nYou are absolutely an asshole. YTA",
            "score": 6,
            "author": "emorrigan"
        },
        {
            "level": 0,
            "comment": "Your sister's belief that you are the golden child comes from somewhere. I doubt she's delusional. I think it would help if you both went to therapy separately. You may be able to better understand the dynamic of your homelife when growing up.\n\nIt's good you haven't taken action about telling your boyfriend's parents how your sister feels. I think you believe it would help your sister's relationship with her inlaws. But it could cause them to feel guilty and uncomfortable around her.\n\nIs this the sort of thing that happened when you were growing up? Did you often try to improve uncomfortable situations inbolving your sister by telling other people how your sister felt rather than allow her to share her feelings herself?",
            "score": 7,
            "author": "SnapesGrayUnderpants"
        },
        {
            "level": 0,
            "comment": "NTA for thinking your sister would be happy for you Y W B T A if you “told on her” to the in laws. You aren’t responsible for how people treat you or if they like you “more/sooner”  Your sister never told you how she viewed things growing up so you didn’t have a chance to address the issue. I understand you thought you could bond over sharing your future together married into the same family, raising kids together, holidays,  etc.  You should have a sit down with your sister to try and understand why she feels this way and empathize with her. As a younger sister I get the same attitude from my sisters “joking but serious”, but as a parent of 3 I know that #2 #,3 kids are easier because we’re not as stressed and obsessive about how to parent. (My personal experience). I have apologized to my oldest about how much harder I was on her so maybe your sister should also have a heart to heart with your folks as well. Anyway, keep this within your immediate family (Sister/Parents) to resolve, don’t include your SO or his family.   Good luck",
            "score": 7,
            "author": "IndependentCapable92"
        },
        {
            "level": 0,
            "comment": "YTA. Sorry. Go find someone whose family isn't already linked to yours. It's a tad creepy.",
            "score": 6,
            "author": "Lepke2011"
        },
        {
            "level": 0,
            "comment": "The fact that your first instinct was to damage your sister’s relationship with her in-laws even further is very telling. YTA.",
            "score": 7,
            "author": "Dolly_Wobbles"
        },
        {
            "level": 0,
            "comment": "Keep you mouth shut and enjoy their company",
            "score": 7,
            "author": "No_Bake_4147"
        },
        {
            "level": 0,
            "comment": "Classic narcissist behavior. \nYTA",
            "score": 5,
            "author": "Zookeeper-007"
        },
        {
            "level": 0,
            "comment": "YTA. You’re clearly spoiled and continue to act that way (snitching on your grown sister to *her* in laws?????). You need to do a lot of self reflection and work.",
            "score": 5,
            "author": "GimmeQueso"
        },
        {
            "level": 0,
            "comment": "I wasn’t sure when you mentioned announcing your relationship a month before the wedding, but the fact you considered telling the in-laws…. YTA.\n\nYou have a lot of self-reflection to do.",
            "score": 7,
            "author": "Mmm_Lychees"
        },
        {
            "level": 0,
            "comment": "YTA",
            "score": 5,
            "author": "icecream77008"
        },
        {
            "level": 0,
            "comment": "YTA. I have a feeling you’ve been competing with your sister because most of your commentary is measuring your successes and social conquests. It wouldn’t surprise me at all if the attraction to the younger brother is that he’s your sister’s in-law. \nYou willfully entered a relationship - friends first - into her new in-law family while you’d had a low or no contact relationship with her. You knew what you were doing and you’re a bit gleeful about it.\n\nEdit to change tenses in the first sentence",
            "score": 8,
            "author": "Much2learn_2day"
        },
        {
            "level": 0,
            "comment": "OK, so there's layers here. \n\nNTA for falling in love and having a good relationship with your in-laws. I don't even think you're the AH for making it official a month before your sister's wedding. Life happens. \n\nYTA if you tattle to your partners parents. Period. Her relationship with them is between them and her. You do not have any say or control over that situation. \n\nLastly, yeah man, you were the golden child. It might have caused some trauma to your sister, so be a little easier on her feelings. Talk things out with her. Actually get to know who your sister is, and her husband for that matter. If you want to be in their lives you can't be this dismissive of her feelings. Do I think it's a little much for a grown woman to say you're \"stealing her in-laws?\" Yeah, a bit. But if this all happened right before her wedding like, yuh she's stressed and emotional. \n\nJust talk it out with her. Get an understanding of how she got to this point, and maybe she can understand how you're the way you are.\n\nYa know, rational adult things.",
            "score": 4,
            "author": "gabrielsleftwing"
        },
        {
            "level": 0,
            "comment": "YTA the way you talk just confirms everything your sister said as true",
            "score": 1,
            "author": "Mydogismyson"
        },
        {
            "level": 0,
            "comment": "YTA for that last paragraph telling on your sister for Joe she feels about her in-laws??? Strange",
            "score": 3,
            "author": "Commonnbdy"
        },
        {
            "level": 0,
            "comment": "Honestly op. I would ignore outside prospectives. Even the YTAs. This sounds like classic sibling rivarly and without being there. Without any of us walking in either shoes, yours or sisters. We cannot give a true fair rating. Life happens. You cannot pause your life to your sisters. And siblings always restaint being upstage and feel it is even when it is just you being there at all. True you could have done so with ill intend or you can be speaking the turth. Only you can anwser that. Not strangers. This is a problem you need someone else close to you to get a fair judgement. We don't know you or your sister or your history. Go ask your parents or an aunt. A cousin. Someone who knows the players. Not us strangers",
            "score": 6,
            "author": "GloveFluid8306",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you really think a golden child is going to get an objective perspective from his own parents? 😂",
                    "score": 17,
                    "author": "-9-0-3-5-7-6-8-"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So this requires a long, hard look at perspective. Your relationship with her future BIL is what it is, happens often, and is typically socially acceptable, so that is fine. BUT, I have to agree with most commenters that  saying anything to the in-laws is a HUGE AH move. Don't do it. You will seriously only widen the wedge and make family events unbearable for everyone. \n\nIt seems your BF was also the \"Golden Child\" in his family, so you two are going to have a hard time with any reconciliation with your sister and BIL unless they let go of that mentality and you and your BF don't act the part you have been type cast in to play.\n\nLet your sister stay mad or upset; you won't be able to change that. Keep your relationship out of hers and vice versa. In-laws don't need to know anything, and if you do, I am taking back my NTA and you would really be TMA. Even if your sister bad mouths you to them, be the bigger person and don't retaliate.",
            "score": 4,
            "author": "DeliciousCut972"
        },
        {
            "level": 0,
            "comment": "NTA. I wonder whether or not OP is more likable and that’s why they were welcomed by the in-laws. With emotionally distant parents that were political, etc. finding a warm, inclusive family sounds lovely. \n\nOP’s sister needs a boat load of therapy to unpack the anger she feels about how her *parents* chose to parent their children differently. That’s not OP’s fault. Though mid-late 20s is the right time for both of them to start working through this nonsense if they plan to have a healthy sibling relationship as adults. Yikes. \n\nOP - I don’t think anything you did here is wrong. I also don’t think anything here other than the absolute opposite (not having a relationship with your sister’s almost BIL) would have made her happy.",
            "score": 5,
            "author": "Night_Owl_26"
        },
        {
            "level": 0,
            "comment": "YTA. Your sister may have unreasonable insecurities or maybe it is based on things you are just outright dismissing. Regardless, the fact that the thought of “telling on her” even entered your mind is just gross. I read your comment explaining your thoughts and that was gross too.   \n\nYou do not seem to care about your sister’s feelings at all, or even consider she is entitled to them.",
            "score": 6,
            "author": "Winter_Insurance_216"
        },
        {
            "level": 0,
            "comment": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\r  \nI always thought my sister (27F) and I (25M) had a decently close relationship until a few years ago when it came out that she thought of me as a \"golden child.\" She held resentment towards me for things I just looked at as the typical more lax treatment of the younger child in a family. I honestly thought the whole thing was pretty silly, especially since we were both years out of being under our parents' roof at this point, so we went a while without talking. We saw each other at family events but didn't really speak. \r  \n\r  \nI was invited to her engagement party as a form of an olive branch extension. It was there I met her future husband's younger brother, and we immediately got along. The two of us got to know each other and spent about a year as friends before making things official around a month before my sister's wedding.\r  \n\r  \nI love his family so much. His parents are warm and inviting in a way that feels so genuine, even before I was introduced as a significant other. (Not to knock my parents, but with them being lawyers and working politically adjacent careers, it can be easy to become jaded when you watch them schmooze to people's faces even when that doesn't reflect their true feelings.) I was the first person he ever brought home to meet them and they made me feel like part of the family immediately. Their youngest brother has been equally as welcoming and regularly schools me in Overwatch 2 by staying alive far longer than I ever could. \r  \n\r  \nWhen I told my sister this, thinking it was something we could bond over, she was angry again. Apparently she didn't receive the same treatment. This resulted in a big argument which led to her saying something to the effect of \"I guess this is what happens when two golden children get together.\" I pushed back against this, and it further devolved with her pointing out that out of all the people in the world, she couldn't believe I had chosen her husband's brother. She said I had stolen opportunities from her growing up and now I was \"stealing\" her in-laws.\r  \n\r  \nI considered telling my partner's parents about this at one point to let them know the animosity my sister apparently holds towards them, but I decided against it. I don't really know where I stand in this conflict and at this point I'd just like some outside perspective.\r  \n\r  \nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
            "score": 3,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Dude, you have no clue how much shit I could tell you about how you *are* the golden child. I don't know you, but I do know the way to talk about yourself and how you act. You are the golden child. \n\nYTA.",
            "score": 3,
            "author": "Jokers_Testikles"
        },
        {
            "level": 0,
            "comment": "Wasn't this storyline a late 90's romcom? Not saying it's a  lie but I remember something like this... or I'm crazy?",
            "score": 3,
            "author": "thecaketopper"
        },
        {
            "level": 0,
            "comment": "YTA. I don’t understand why people do this. Find your own people. You choose to date family members of people connected to you. I can absolutely guarantee your family treated you better. The fact you’re so dismissive about it says everything.",
            "score": 6,
            "author": "Training_Coyote2489"
        },
        {
            "level": 0,
            "comment": "YTA OP, there’s no doubt about it. There’s no way you can’t see it either",
            "score": 1,
            "author": "Smurfgirl-1"
        },
        {
            "level": 0,
            "comment": "YTA you just assumed it was because you were younger? Nah I think you were gleefully tapping your fingers together like Dr. Claw as you stroked your ego instead of a cat. Then you were going to run your mouth to the in-laws, but you knew the you couldn’t risk the chance it would blow up in your face and potentially fracture your relationship with your SO and his family. This makes you a double YTA.",
            "score": 4,
            "author": "TheBewitchingWitch"
        },
        {
            "level": 0,
            "comment": "YTA. Others have made excellent observations of your character which is highly questionable. My question to you is... why do you hate and despise your sister SO much that you try to hurt her at every opportunity you can? WHY? Is it to get her out of your life permanently so that you can hog the limelight forever? If so, you need to do some very serious introspection and definitely some therapy as to why you are so intentionally cruel to your only sibling. What has she ever done to you to deserve such horrid treatment from you? Grow the eff up and learn how to be a compassionate, caring adult to your only sibling and sister. Maybe you are far too self-absorbed and narcissistic to make drastic changes to your personality that are very much needed. Don't be surprised if she cuts you out of her life permanently.",
            "score": 3,
            "author": "Weekly_Watercress505"
        },
        {
            "level": 0,
            "comment": "Your sister needs some heavy duty therapy. I grew up as a least favorite child of my mother. I got therapy. I don’t blame my siblings anymore, because I’m a grown-up.",
            "score": 1,
            "author": "Dodemay"
        },
        {
            "level": 0,
            "comment": "Did anyone consider that the sister is maybe a more unpleasureable person as her inlaws apparently like him better, too?",
            "score": 4,
            "author": "PeterMT"
        },
        {
            "level": 0,
            "comment": "Yes. YTA.",
            "score": 4,
            "author": "Low2High92"
        },
        {
            "level": 0,
            "comment": "YTA for being so dismissive of your sister’s feelings about your parents’ treatment of y’al; that treatment isn’t necessarily partially your fault (unless you were telling on her and whatnot) but you could at least acknowledge if more since it certainly doesn’t sound made up to everyone else. And triple YTA for almost telling your in-laws… You could have broken so many relationships not just of your sister’s but if her husband’s and it would be about impossible to recover from that. That part was honestly one of the most reckless and downright despicable things I’ve read on here in a while.",
            "score": 4,
            "author": "PunkSpaceAutist"
        },
        {
            "level": 0,
            "comment": "calling someone the golden child doesn't mean you think negatively of them. it just means that person is the favorite of the family - how is that negative?\n\nseems like you knew you were the golden child and used it to your advantage while your sister suffered. YTA",
            "score": 2,
            "author": "whitecloudesq"
        },
        {
            "level": 0,
            "comment": "YTA and you know it",
            "score": 1,
            "author": "justnomilvent"
        },
        {
            "level": 0,
            "comment": "YTA -  and you are the worst kind of golden child. Most have some sort of self-awareness, but your main character complex is completely out of control.",
            "score": 3,
            "author": "MrsJingles0729"
        },
        {
            "level": 0,
            "comment": "NTA. You're allowed to fall in love with who you want and she's acting entitled thinking you stole her in-laws. She was not in competitions for the first years. If she's not as liked ,it might be because she's not as likeable or just a question of hobbies and interests. Youngest brother likes to play video games with you. That's a good way to bond. If she doesn't like video games, that's one less opportunity for her.",
            "score": 1,
            "author": "Addaran"
        }
    ]
}