{
    "id": "ouje2w",
    "score": 50446,
    "title": "AITA for refusing to pay for my sister's husband's surgery with my inheritance/college money?",
    "author": "Home-Time-6077",
    "date": 1627647034.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/ouje2w",
    "media_urls": [],
    "other_urls": [],
    "postText": "\n\n\nContext: My sister (F27) and I (18F) lost our dad a year ago. He was my only parent, mom was never in mine or my sister's life. Dad left money (inheritance) for me and sister and she used her inhertance to get new cars and renovate her house\nI live with my aunt right now cause my brother inlaw didn't let me stay with my sister. I'm planning on using my inhertance money to pay for college tuition (I've always wanted to be doctor but haven't decided which branch yet).\n\n\nMy sister &amp; I haven't been close, it started after she got married to her chronically ill husband who was allowed to make backhanded comments about dad and mock his llness and make a scene at his funeral.\nonly because he's ill and shouldn't be held accountable for his behavior.\nI've distanced myself But my sister kept visiting alot lately venting about my brother inlaws condition. He's been in &amp; out the hospital for heart problems and in need for a surgery. She brought up my inheritance money several times but I end up cutting the conversation. She then straight up asked if I could help pay for her husband's surgery and she'd pay back in less than a year. I felt uneasy cause if I give her money from my inhertance which is a large amount then there's no gurantee she'll pay back before It's time to apply for college. I'm taking a year gap but I know my sister can't pay back that much and I felt I was risking my future.\n\n\nI refused to help and she had a melt down at my aunt's house calling me heartless, cruel with no empathy. She said that her husband's health should be a priority and I needed to help because education is nothing compared to someone's health and asked if I'd be happy to see her as a widow and my nephew with no father.\nMy aunt suggested others pay but most of them cut my sister and her husband off. I argued that her husband's poor health isn't my fault after she kept blaming and guiltriping me. She kept crying and although my aunt decided to stay out of it she said that I should be prepared for permenant damage in my relationship with my sister if I don't help her now. \n\nShe's been sending texts and pictures of her family telling me this is what I was saying no to, a happy healthy family with a healthy husband and father. I cried and felt like I was being selfish not good aunt and sister. I asked my friend and he said let them sell the cars and all the luxurious stuff they bought to afford the surgery and warned me if I give them money I'll never get it back and may not be able to go to medical school.",
    "comments": [
        {
            "level": 0,
            "comment": "Alright folks, we're well passed 6,000 comments here.  It's 5:30 on a Friday and I'm ready for the weekend to start.  Everything that can be said has been, so we're going to call a full lid here.\n\nThanks everyone for participating!  Please continue reporting those that aren't:\n\n#[Be(ing) Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/).\n\nPlease review our [FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq) if you're unsure what that means.",
            "score": 1,
            "author": "techiesgoboom"
        },
        {
            "level": 0,
            "comment": "&gt;he said let them sell the cars and all the luxurious stuff they bought to afford the surgery and warned me if I give them money I'll never get it back and may not be able to go to medical school.\n\nYou're friend is correct.  You'll never get the money back because sis isn't willing to give up her luxurious lifestyle.  She chose how to spend her inheritance, didn't save for a rainy day and isn't entitled to yours because of her poor financial planning.  NTA.",
            "score": 51325,
            "author": "cashycallow",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm not sure whether they still have anything of value because I remember my aunt talking about my sister selling her car in may.",
                    "score": 11917,
                    "author": "Home-Time-6077",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cars depreciate in value quickly. It still isn't your problem that she decided to spend all of her inheritance unwisely. They're trying to live outside of their means as a family which means if you give any money, be prepared to not get it back. Don't be surprised if you keep getting asked for more until you're left with nothing. Your can have this relationship with your sister or you can pay for medical school. You can't have both, but your sister and her husband seem toxic so distancing from them should be your first step.\n\nEdit because forgot to add: NTA",
                            "score": 11356,
                            "author": "ClarinetKitten",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; Your can have this relationship with your sister or you can pay for medical school. You can't have both, but your sister and her husband seem toxic so distancing from them should be your first step.\n\nI agree. I think sis torpedoed the idea of family when she left her 17 y/o sister scrambling for a home. OP wasn't family then.",
                                    "score": 10200,
                                    "author": "Dimityblue",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And allowed BIL to make a scene at the funeral and mocking OP'S father's illness",
                                            "score": 5487,
                                            "author": "jess1804",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "yeah, being ill himself doesn't mean he's allowed to do this. it means he knows damn well how horrible it is and does it anyway",
                                                    "score": 2426,
                                                    "author": "thecrepeofdeath",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You could call it karma. Should have thought about his actions and what they might cause in the future when he needs family to help him stay alive.",
                                                            "score": 1284,
                                                            "author": "bankkopf",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Bingo! Plus he wouldn’t let her, his own sister-in-law, stay at their house so she had to live with the aunt… \n\n*Hey! You can’t live here! But pay for me to live!* \n\nNTA in the slightest, OP. I say it worked in your favor not staying with them. Scrap them both. You especially don’t need their toxicity around when med school does come into play for you.",
                                                                    "score": 1297,
                                                                    "author": "sloww_buurnnn",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Her sister needs to leave that asshole!",
                                                                            "score": 52,
                                                                            "author": "edwardsmarcom",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "The sister is also an asshole.",
                                                                                    "score": 152,
                                                                                    "author": "Super_Yuyin",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Right? Like being chronically ill should have meant they knew to save ahead for possible surgeries or other things related to his health. It's not OPs fault they didn't prioritize his health when they had the chance and wanted cars instead. It's definitely not on OP to prioritize him over their own future now. \n\nDefinitely NTA",
                                                            "score": 862,
                                                            "author": "ging_kitty",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "NTA. They will bleed you dry, and when nothing is left, they’ll continue being pricks.\n\nMy husband and I drive 16 y/o cars. Both paid off. Do we want new ones? Of course.\n\nBut being able to pay for housing, food, daycare, utilities, a few things here and there for our kids, and rainy day savings is a fuck of a lot more important than leather seats and navigation.",
                                                                    "score": 803,
                                                                    "author": "PhoenicianKiss",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I dislike leather seats. Too cold in the winter burning hot in the summer.",
                                                                            "score": 91,
                                                                            "author": "Spazzly0ne"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Also if he was ill at the funeral they already knew they would need money for his failing health and spent all of their inheritance knowing full well her husband was not in a position to be free with the money. Hell no NTA.",
                                                            "score": 669,
                                                            "author": "Reallynoreallyno",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Moreover, the father knew and didn’t leave a disproportionate amount to the older sister. So his intent was to give both girls equal amounts, not have one funnel money to the other to take care of the AH BIL.",
                                                                    "score": 259,
                                                                    "author": "DeBlasioDeBlowMe"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "This! Their deliberate poor choices are not your fault.",
                                                                    "score": 53,
                                                                    "author": "TurboTrollin"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I am chronically ill with heart stuff, and never once has it occurred to me to be an asshole at someone’s funeral. They are truly not connected.",
                                                            "score": 400,
                                                            "author": "Careful-Corgi",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm chronically ill and my husband is, too. We would never ever ever mock anyone else's illness. I don't understand behavior like this.",
                                                            "score": 236,
                                                            "author": "Infamously_Fickle"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "And he didn't allow OP to live with them too!",
                                                    "score": 409,
                                                    "author": "jenhenfofen",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yep!",
                                                            "score": 77,
                                                            "author": "Dimityblue"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Exactly! If my son-in-law was mocking my death, I wouldn’t want him to get a penny of the money I put aside to help my child when I’m gone, regardless of why he needed it. OP is most definitely NTA",
                                                    "score": 194,
                                                    "author": "poophappns"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The BIL sounds positively *lovely.* /s",
                                                    "score": 180,
                                                    "author": "Dimityblue"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Not to mention of using a dead man's inheritance on the surgery of someone who mocked him.",
                                                    "score": 112,
                                                    "author": "Gureiseion"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I agree totally - you don’t owe them anything OP- your sister and husband have not been there for you even though you are younger - if you didn’t have your aunt, would your sister and husband have left you homeless? If other people are not willing to help them - have cut them off - clearly it is their M.O. to burn people who have helped them in the past. Where is her husbands family in this? Where is his parents? I think it’s sketchy that if his life really is in jeopardy that his own parents/family want nothing to do with him. His life is not your responsibility - just like he did not take on the responsibility of you after you became an orphan. Please don’t give them anything, your sister is trying to manipulate you by publicly shaming you on social media - they both sound like narcissists. Although you are 18 and considered an adult, your brain is not fully developed till you are 25 so you are vulnerable and shame on them for manipulating you. You are better off without them in your life. Keep your aunt as family since she is the one who took you in, you don’t need someone who doesn’t care about your well-being.",
                                            "score": 807,
                                            "author": "kissiemoose",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "All of this. But adding in: if she is able to pay you back within one year, she could get a loan easily. The fact that she isn't getting a loan and is doing the hard guilt trip to you instead is a red flag. You'll never see that money again is my bet.\nNTA.",
                                                    "score": 912,
                                                    "author": "Fillbe",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This is what I was scanning the comments for. If she can afford to pay you back in one year, she should be able to afford to pay for the surgery now.",
                                                            "score": 380,
                                                            "author": "kimid123",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Not to mention that if you need medical care, they treat you then bill you. If you call the billing department, they’ll set up payment plans (if this is in the US).",
                                                                    "score": 175,
                                                                    "author": "Matzie138",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Thank you for the additional info. I didn't know that (Canadian) but yea, that makes total sense. Asking for the money up front does seem silly, now that you bring that to my attention.",
                                                                            "score": 34,
                                                                            "author": "kimid123"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Such a good point! OP, prioritize you, they won't. You need to trust that you will be there person to always have your back. \n\nOP they were there when your world crumbled and you were left without your key family or a home. You are not responsible here. Give them a time out and reavaluate if she brings anything positive to your life during that time. I out up with a terrible family situation into my mid thirties because I didn't know you could walk away from blood relatives that constantly berated you. You have your future ahead of you. Choose you and don't respond to guilt, fear, or manipulative obligation from people who abandoned you.",
                                                            "score": 113,
                                                            "author": "HappyBi-cycle"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; I think it’s sketchy that if his life really is in jeopardy that his own parents/family want nothing to do with him.\n\nYeah. Own parents, own family, in-laws... The list goes on.",
                                                    "score": 352,
                                                    "author": "Dimityblue",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They are clearly taking advantage of OP because she young and they think they can manipulate her.",
                                                            "score": 159,
                                                            "author": "MudLOA",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah. Those messages about her saying no to \"a happy healthy family with a healthy husband and father\" show that. Grrr!",
                                                                    "score": 106,
                                                                    "author": "Dimityblue",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Same. I love how your only family when people need something from you and you’re a master nuisance when you’re actually asking for help of them. If she didn’t care to keep a roof over your head she’s not gonna care about your education which is pretty much the rest of your life. \n\nBy the way there is financial assistance for medical bills anyhow so it’s not like he won’t get the surgical procedure if he can’t foot the bill upfront he’ll just be stuck paying the bill in the aftermath with her.\n\nNever jeopardize yourself OP for anyone especially those who you cannot rely on to help you when you need it. NTA",
                                            "score": 289,
                                            "author": "SnooSuggestions2288",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes, this. \"Do not set yourself on fire to keep others warm\" applies to family, too.",
                                                    "score": 154,
                                                    "author": "oogmar"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Exactly! If the sister can, “pay it back in a year”…. She can just pay the hospital in the year.",
                                                    "score": 130,
                                                    "author": "X_RaeB"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "To add to this, you wont have a relationship with your sister again after the money is gone anyway.",
                                    "score": 1543,
                                    "author": "TyroneTheTitan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "NTA\n\nOnce OP is a doctor Sis will come back looking for more handouts because in her mind doctor=rich.  Leeches are never gone for good.",
                                            "score": 388,
                                            "author": "WorkInProgress1040",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; Leeches are never gone for good.\n\nThis is SO TRUE. \n\nPersonal anecdote, but my aunt on my father's side was a well-known leech and we completely cut contact after she demanded his life insurance money at his funeral. In 1999. (It was a small term life insurance policy to cover final expenses + a couple months of bills, it wasn't some huge  payout to begin with!)\n\nGuess who just sent me a friend request on Facebook and a message asking for money? 22 years no contact, I wasn't even in middle school the last time she saw me, but somehow I came up on their radar again. Leeches never, ever go away completely (but at least it's easy enough for me to just ignore her).",
                                                    "score": 168,
                                                    "author": "zeezle",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I was looking for this comment.",
                                            "score": 199,
                                            "author": "indiajeweljax",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes!!! The relationship with her sister is/was already a lost cause. No reason for OP to end up with no money and no future, too.",
                                                    "score": 253,
                                                    "author": "22UD555",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Exactly. \n\nBased on his/her comments, I’m concerned that OP will cave and give the money anyway. \n\nSad. But AITA can’t save them all.",
                                                            "score": 94,
                                                            "author": "indiajeweljax",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "If she does cave and gives away her inheritance/future, the end result would be the same. Her sister would cut het off immediately because that’s what people do who owe money and don’t plan on paying it back.",
                                                                    "score": 93,
                                                                    "author": "username_um_crickets"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This is so true. Money and family don’t mix well. Don’t loan money you can’t afford to not get back. \n\nEven if you got formal loan papers drawn up. House as collateral maybe but I bet that won’t fly with sis either.",
                                            "score": 129,
                                            "author": "emeretta",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Not disagreeing with you by any means, just adding in. Used cars are going for a premium right now, not depreciated for possibly the first time in history.",
                                    "score": 315,
                                    "author": "VegasVine",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My wife and I were leasing a 2018 Honda civic. The lease ended this summer. We opted to buy it. We ended coming out ahead since we bought it from the dealer for ~$11k and could sell it privately for around $18k. We actually purchased it brand new for 18k. The used car market is absolutely insane right now.",
                                            "score": 180,
                                            "author": "just-the-tip__",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; Cars depreciate in value quickly. \n\nThis is normally true, but not this year. Due to the chip shortage restricting new car supply, the used car market is so insane that many cars are worth more than they were a year ago. If there were any time to sell/downgrade, this would be it.",
                                    "score": 238,
                                    "author": "Rarvyn",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "NTA, and DO NOT give her the money. You won’t get it back, and honestly, the way they’re treating you when they need something from you just shows they neither like or respect you (which also means they won’t be paying you back). Your sister could:\n\n1: get a job. 2: downsize the house and their lifestyle. 3: speak to the hospital about a payment plan. 4: Get the surgery now because it’s an emergency and figure out how they will pay for it later, like most people. She doesn’t want to, she’d rather just steal your future. Go to school and don’t feel guilty.",
                            "score": 2515,
                            "author": "DutyValuable",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;Get the surgery now because it’s an emergency and figure out how they will pay for it later, like most people.\n\nTHIS.  I had an amputation six weeks ago.  It was a choice between losing part of my foot then and there or probably losing the whole thing in a few weeks.  There was no screwing around deciding how I was going to pay for it.  I knew it would be expensive (surgery plus several days in the hospital, followed by in-home nursing), and even after insurance I know I won't have it paid off this year.  So I figured out what I can give them every month until it's paid off.  What I *didn't* do was try to guilt all my relatives into paying for it because I'd pissed away all my money on frivolities.",
                                    "score": 1405,
                                    "author": "SunshineRobotech",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's tough. Sorry you went through this.",
                                            "score": 319,
                                            "author": "BrownBirdDiaries",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you.  It isn't as awful as it sounds.  I'm actually surprised at how well it's healing and how little lasting effect it seems to be having.  As soon as the last spot heals, I'll be back at work.  \n\nI got the doctor pretty good on Monday though.  After we wrapped most of it up, I said “OK, we’re playing it by ear, so it’s constantly two weeks out.  I get it.  These things take time.  You keep saying two weeks.  So when is it going to grow back?  Because I’m seeing zero sign of it even trying to!”  He froze, stared at me, and mumbled something about how he doesn’t think that’s very likely.  Then he realized I was screwing with him and said “uh, six weeks!  Yeah, six weeks!”  Meanwhile, the resident he had with him was looking at me like I had lost all grasp of reality.   \nGood times.",
                                                    "score": 763,
                                                    "author": "SunshineRobotech",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Lol! I admire how you're handling things. Sending you good vibes 😊",
                                                            "score": 183,
                                                            "author": "MichelleEvangelista",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "My outlook is that you have to have a sense of humor about it or you might as well just hang it up.  Yeah, I had part of my foot cut off, it hurt like a mothergrabber, and it's going to take some time to pay off.  But it was only part of my foot rather than the whole thing so I won't need a prosthetic, I had good painkillers in the hospital when I needed them, and I'm not utterly destroyed financially by it.  Things could be a lot worse.",
                                                                    "score": 290,
                                                                    "author": "SunshineRobotech",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 77,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "America? The system people live under there is the real A-hole in these situations.  Hope you feel better soon.  OP’s sister needs to do the same thing.",
                                            "score": 154,
                                            "author": "Mary_Tagetes",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Seriously, why kind of incredibly selfish sister do you have to be to demand, guilt and berate your sister into forking over her way to pay for medical school/college? Most sisters would do everything they could after the loss of parents to ensure they can go to school. They *definitely* wouldn't be trying to take it away!\n\nIf she gives no money away, it will cause the loss of the relationship? Pfffft. Don't threaten me with a good time lol. Especially after the husband *mocked thier dying father*. Why should anyone give up ANYTHING to help a man that did that to thier parent?!",
                                    "score": 331,
                                    "author": "CandyShopBandit",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;it will cause the loss of the relationship? Pfffft. Don't threaten me with a good time lol.\n\nI don't think the aunt intended that as a threat.  I read that as \"You need to make your own decision, but here's a consequence you might not have thought of/realized and you should definitely consider it in making your decision.\"",
                                            "score": 93,
                                            "author": "Kylynara",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Absolutely good advice to help alleviate some of the guilt OP's sister has placed on OP. \n\nOP - your sister is telling you that her husband's health should be a priority for you without living by that sentiment in her own life. It is not like if you don't give the money, you are sentencing the husband to death. Your sister and BIL will just have to sacrifice their lifestyle and be more responsible with their financial choices. \n\nThey see you as a free-pass that they can take advantage of to get what they need without having to sacrifice. DO NOT let anyone make you feel responsible or guilty - you aren't their only solution, just the most convenient one for them!",
                                    "score": 157,
                                    "author": "GlobalDragonfly1305",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "So in less then a few months she burnt through all the money she got from a car? \nSo would just a large chunk of your inheritance be enough? Or is it going to end up been your entire inheritance when they wasted all of theirs? \n\nOP, this might cause some serious damage to your relationship but don't let go of your money. Your sister will get over it and you can help more then 1 person as a doctor but spending that money now means you never get that chance.",
                            "score": 592,
                            "author": "quiet0n3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I predict their relationship is trashed even if she did give the money. If she gave the money, she's not going to get it back -&gt; OP would know that the future she wanted is gone because of her sister -&gt; Resentment builds -&gt; Bad relationship anyway.\n\nAlso, the husband is chronically ill. That's not much to go on, sure, but I'm doubting this is going to be the last surgery he'll ever need. So either they're going to ask for more money, or say that they can't pay back the money they already owe because of a new surgery. The only way OP should give them money is if she can afford to give it to them as a gift (not necessarily gift it to them, but if she can afford it), and until she can afford that, she should under no circumstances give them money.",
                                    "score": 390,
                                    "author": "MrsMel_of_Vina",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "OP's sister was fine not housing her 17yo sister who had just lost her only parens because her husband didn't want her to live with them, there is absolutely no way he is entitled to OP's money, even if he can pay it back",
                                            "score": 362,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Not to mention that this is her future in jeopardy, and her entire chance at a career, and making a living for herself. He's essentially asking her to sacrifice her own life, for his, all after they'd abandoned her as an orphan, and disrespected her family at her father's funeral. He didn't even ask, she did. Why couldn't he even address her himself? More than likely it's because he's so awful, and he knows it. There is about zero chance that they'd pay it back, as the sister's obviously not even begun to work for it. She spent her own money, and likely has had her eyes on her sister's money for a long time. I'd be willing to bet it's the only reason she's kept in touch, at all. I would question if there's even a surgery.",
                                                    "score": 91,
                                                    "author": "kneeltothesun",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Exactly! And OP said that the BIL is chronically ill, so this isn’t some new medical condition. Sounds like sister knew her husband had a heart condition when she got her inheritance, but she decided to spend her money on cars and home renovations. Now she wants to use someone else’s money towards her husband’s health. The sister told OP that “her husband’s health should be a priority,” WHY?!?!?! Why should it be a priority for OP when it wasn’t a priority for the sister? It’s because the sister is a hypocrite. She’s manipulating and guilting op because she wants her money, and I’m certain that she has absolutely no intention of paying it back. \n\nObviously op is NTA. OP, Don’t give her the money!",
                                            "score": 130,
                                            "author": "teamdna04",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I agree. The relationship is already trashed. There will never be enough OP can give that will satisfy the sister. She should say 'no,' and let the fallout be what it may.",
                                            "score": 108,
                                            "author": "PlasticBlitzen",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yes this! Never ever give money that you're not ok with never getting back",
                                            "score": 40,
                                            "author": "AQueenie"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yes, either sister will hate OP for not giving the money or OP will hate her for squandering her inheritance and then taking your future. Either way, the relationship is never going to be the same.",
                                            "score": 38,
                                            "author": "kgiov"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Your sister's husband was unwell before either of you got the inheritance.  He was unwell while your father still lived.\n\nThey both knew this, and they chose - as adults - to spend their share of the inheritance on cars and house renovations.  Now they want your share.\n\nYou owe them nothing.  The fact that other relatives have already cut them off is a Glaring Red Sign that they are not people you should trust with money.\n\nThey chose to spend their share, they aren't entitled to a penny of yours.  Go pursue your studies.  Live your life as best you can.  Let them sort their own finances out.",
                            "score": 345,
                            "author": "UristMcD",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It’s a sellers market right now, she could sell her renovated house for £££ and downsize to have the funds. She could remortgage. \n\nSo many options that don’t require stealing your sister’s future.",
                            "score": 346,
                            "author": "throwawayj38sld",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Also OP is living with aunt because sister’s husband refused to let her live with them AFTER she just lost her dad. Now they have the audacity to ask for her inheritance.",
                                    "score": 432,
                                    "author": "Pretentious-fools",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, I’m quite shocked the aunt hasn’t laid all this out and told big sister to do one - an adult is essentially trying to extort a child here. If the aunt is legally responsible for OP, then she isn’t acting with her best interests at heart. \n\nSo, what adult is?",
                                            "score": 170,
                                            "author": "throwawayj38sld",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "THIS. So OP's sister wouldn't help OP out right after Dad died and give her a place to stay, but now OP is heartless for not coughing up her inheritance to help the man who mocked her dying father? NO. YOU ARE NOT THE ASSHOLE. They are assholes. And hypocrites. The absolute fucking nerve. No. Don't do it!",
                                            "score": 101,
                                            "author": "Hoosier_Mama75"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Since they used her inheritance money on house improvements, I am assuming they still own that house, right?  They can take out a loan using the equity they have in the house as collateral to pay the medical bills.  Since the loan is backed by something physical, the interest rate on it shouldn't be outrageous like if they used a credit card or something similar.  If your sister is so confident that she will be able to pay you back within a year, she should have no problem getting a 5-year loan and paying that off instead.  \n\nIn summary, your friend is absolutely right, if you give her that money, you will never see it again.  And your aunt is also right that there will be permanent damage to the relationship.  However, I would posit a theory that your sister is the one doing the actual damage to the relationship and that the damage is honestly already done.  You already feel like you are a bad person because of your sister's massive guilt tripping.  We only have the small glimpse that you have given us but do you think your sister will actually change if you do give her the money?  She may be thankful for a bit, but how long is it until she needs something else (more time to repay the money, forgiveness of the debt altogether, or more money for another procedure, any of which would hamstring your future career goals and entire life trajectory) and it is back to the drama and guilt tripping again when you try to say no again?  \n\nI can understand your sister's situation and see why she is desperate, but this is definitely a situation where if you give an inch she will take a mile.\n\nAlso,may not be relevant, but what would your dad say if he were alive?  Would he want you to use his money to help someone who mocked him and showed no remorse for it, or would he want you to use that money to go to med school and make an entire living out of helping people?  My bet would be on the latter option that gives you the best chance of personal happiness.",
                            "score": 228,
                            "author": "Frejian",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "This might sound mean but they put themselves into this situation. She had a sick husband but chose to spend money on stuff they didn't need. They should have put that money aside. It's not your fault she decided cars and a remodel were more important than her husband. Probably figured she'd get the nice stuff then cry to family to pay for her husband's medical bills. Don't give in.",
                            "score": 221,
                            "author": "jenza325",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sis is the heartless and cruel one who lacks empathy for pissing away money that she could have used to help her partner. They have many options now, and it's their responsibility, not yours.",
                                    "score": 86,
                                    "author": "brainisonfire"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The money is yours, period. You're putting it towards a future that you probably wouldn't be able to have otherwise, which is great. I hope you decide what you want to do in life and are happy with it. \nShe has no right to ask you to give her money. It sucks her husband is sick, sure, but that is not your problem. And even worse, she's trying to guilt you into giving the money to her which is just not right to do to someone. NTA because you're 100% allowed to say no to her entitlement.",
                            "score": 150,
                            "author": "my_name_isnt_cool"
                        },
                        {
                            "level": 2,
                            "comment": "At the end of the day it is NOT your problem to \"save\" your sister. She knew her husband was sick when she got the inheritance, but spent it on stupid, unnecessary crap. Now, when the money is gone and she needs it for health bills it's *shocked pikachu face* when you won't just give her the money. If you give her anything it will be gone. Go live your dream and let your sister wallow in the misery she created for herself.",
                            "score": 114,
                            "author": "carrieberry",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "That isn’t your problem. Cars lose value the second they’re off the lot.",
                            "score": 93,
                            "author": "aurumphallus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Agreed. When I drove my first car purchase off the lot I said \"did you feel that?\" to the family in the car. General confusion until I said \"the car value just depreciated.\" \n\nSounds like the husband has been ill for a significant amount of time and they have acted poorly to many family members who no longer want to help them. You don't buy new cars or renovate a house (unless it is unlivable) when you know that a huge medical expense is imminent. They are playing OP for the money. NTA for keeping the inheritance for school when sister got the same thing and spent it unwisely. Don't give any money and tell the aunt to stay out of it unless she wants to help pay too. The aunt's comment was ridiculous too.",
                                    "score": 81,
                                    "author": "Primary-Eggplant-612",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Do not sacrifice your future because your sister and brother in law didn't plan theirs better.",
                            "score": 85,
                            "author": "AbeMoFoLincoln",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "They blew through their money on stupid stuff when they had bills to pay and now they want yours. DO NOT GIVE IT TO THEM! NTA",
                            "score": 62,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "If they don't, then they can talk to insurance and the hospital about an indigent fund to help.\n\nDon't give your inheritance.  You'll never see it again.\n\nTo add, she may cut you off, but I guarantee she'll be on your doorstep if he dies, wanting your help.  They are both users and their lack of planning is not your emergency.",
                            "score": 46,
                            "author": "No1h3r3"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Absolutely. She knew her husband was in poor health-the wise thing to have done was put money aside instead of buying luxuries that depreciate. She can't know how much you have, right? If you feel like it donate a small sum you can manage to lose and tell her that you \"lost\" a lot of it in bad investments to get her off your back and keep the relationship with her. But, honestly, she's not entitled to anything you have. The manipulation is awful and you deserve to have your dreams. Do you really need them in your life, OP?",
                    "score": 280,
                    "author": "ClawedRavenesque",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Your friend is totally right. They keep their luxuries and want to run you dry on your money. Don't let them do that! You will never be paid back. Block them on all numbers, don't let them guilt trip you. They have other ways the can walk to get money. Like you friend suggested, let them sell all things that  are a luxury.\n\nThe health of your BIL is not something that is your responsibility.",
                    "score": 151,
                    "author": "UnhappyCryptographer",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "NTA. Why should his surgery trump OP's education? It shouldn't. Sister spent her inheritance money unwisely and now is stuck. She can start a go fund me so that all of the people calling OP an ahole can show how concerned they are by donating.",
                    "score": 129,
                    "author": "Mera1506",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "NTA.   Your friend is absolutely correct.  Now is also the perfect time. Used cars have never been so valuable as they are in today's environment and if they own a house the value has greatly increased in the last couple years.  They can sell it or borrow against it.",
                    "score": 73,
                    "author": "Prudent_Camera_7614"
                },
                {
                    "level": 1,
                    "comment": "Your sister chose to spend her money instead of saving it DESPITE having a chronically ill husband. This was irresponsible on her part.  You need to look after yourself first. She made the bed she is now laying in. Please do not let her guilt you into putting your future at risk.\n\n&amp;#x200B;\n\nEdit: I think I replied in the wrong place. Sorry :(",
                    "score": 55,
                    "author": "Yaarghl"
                },
                {
                    "level": 1,
                    "comment": "I agree tell her to her face she is a luxury loving loser.  Tell her to  get a bank loan, rates are low, but don't cosign.   Hang tight.    Get a restraining order of you have to.  You don't need to be guilt tripped",
                    "score": 35,
                    "author": "SWBudd",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA- your sister chose to spend money she got less than a year ago on expensive things instead of planning for the future like you did. Easy come, easy go as they say. Do NOT give them a penny of your money. They have options they don’t want to take and that’s not on you. You’re not getting that money back if you lend it. You’ll become a fine doctor some day, I’m rooting for you !",
            "score": 12610,
            "author": "CuriousTsukihime",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;**They have options they don’t want to take and that’s not on you**\n\nspot on",
                    "score": 5402,
                    "author": "cashycallow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you!",
                            "score": 390,
                            "author": "CuriousTsukihime",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That was my thought too.  Like if they made improvements to a house, they most likely own that house.  They could take out a loan using the equity the have in the home as collateral so they aren't paying a ridiculous interest rate.  If the sister is so confident she can pay it back in a year, a 5-year loan with a lower interest rate shouldn't be much of a problem.",
                                    "score": 917,
                                    "author": "Frejian",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, if they can pay back OP then they can pay back a bank.... They aren't planning on paying back OP. OP is not the asshole and shouldn't give them a penny.",
                                            "score": 701,
                                            "author": "Asron87",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; if they can pay back OP then they can pay back a bank\n\nBoom.\n\nIf they had a good relationship and had intentions of paying OP back, I would understand since family won't charge you interest, but alas, they do not. Reap what you sow.",
                                                    "score": 179,
                                                    "author": "UhPhrasing",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That's why they want OPs money. Because, unlike a bank, they can screw her over, and never have to concern themselves with paying the money back. \"Because faaaaaaaamily....\" OP isn't going to come and take their stuff from them when they lapse on the payments. Which they will, because they clearly have no sense of financial responsibility or planning.\n\nNTA op. Don't give them a single cent that you expect back. Because you wont get it. They are avoiding the multitude of options they do have available to them, because they know those options leave them more accountable than you would. They're scamming you.",
                                            "score": 148,
                                            "author": "MissLadyLlamaDrama"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "where is HIS family?",
                            "score": 79,
                            "author": "El-Kabongg",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Probably estranged because he's a jerk and has always been a jerk",
                                    "score": 35,
                                    "author": "m2cwf"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "AND she did all that *knowing* her husband was chronically ill and would inevitably need medical care of some kind, which gets expensive quick. It should have been a no-brainer for the sister to stash her inheritance aside in anticipation of needing it for medical bills. Instead, she spent it selfishly, likely assuming she could bully OP into coughing up her share when sis finally needed it.",
                    "score": 1413,
                    "author": "puffinprincess",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly!! Or put it I’m a high yield, aggressive savings that would pay dividends faster. They chose to invest in other areas that weren’t necessary. They’re so out of line and out of their depth is ridiculous- OP is getting a bad rap for their bad habits",
                            "score": 266,
                            "author": "CuriousTsukihime"
                        },
                        {
                            "level": 2,
                            "comment": "I get the feeling, she did it that way on purpose.  So she can get both halves of the inheritance while OP is stuck with nothing.  And even after that, they'll spend a lifetime mooching off of him if they're successful stealing his money this time.",
                            "score": 222,
                            "author": "threadsoffate2021",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "OP is a girl",
                                    "score": 66,
                                    "author": "hoffdog",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I was about to say, her husband is chronically ill but the sister decided to carelessly spend the money anyway. With that amount of financial stupidity, there's no way OP would ever get their money back.\n\nAlso, to my understanding, sister's husband's illness is only physical. What gives him the right to berate OP's father?",
                            "score": 156,
                            "author": "suppahfreak",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA - Your sister is manipulating you. She received the same money you did. If her husband is chronically ill than they should have saved that money for his care instead of spending it on luxury items. She probably always planned to spend her money and yours. \n\nWill refusing to give her the money damage your relationship with her? Probably. But do you really want to give up your future to preserve the relationship you have with her now? Because it sounds like a terrible one. And don't think that giving her this money with improve the relationship at all.",
            "score": 8207,
            "author": "Forward_Squirrel8879",
            "replies": [
                {
                    "level": 1,
                    "comment": "NTA\n\nTell her to set up a go fund me. \n\nThis guy shat all over your father and insulted him during the funeral, and she pissed her inheritance on BS. You dont owe him or your sister, the return in investment of getting an education compared to saving her husband is a lot higher.",
                    "score": 2385,
                    "author": "Robo-boogie",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If I’m correct, the B in law also didn’t allow OP to live with them? So OP had to move in with their aunt.\n\nSo B in law doesn’t have to give a shit about family until it suits him?",
                            "score": 1306,
                            "author": "Patient_End_8432",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep! Dude has been shitty to OP, so I ain't mad at her.",
                                    "score": 347,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Right? Why would anyone want to invest in the life of an asshole. We've already got an abundance, no loss there.",
                            "score": 115,
                            "author": "quippers",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Also the part where OP mentions \"My aunt suggested others pay but most of them cut my sister and her husband off.\"\n\nYou know that thing people say about people who claim \"Oh all my ex's were crazy!\" that they are probably the crazy one?  Yea...got a hunch that sister and her husband might just be a common denominator of shittiness.\n\nNTA - save your money and your energy for relationships that give you as much as you give them.",
                    "score": 792,
                    "author": "IACITE_HOC",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah it’s pretty obvious even to internet strangers they’re toxic and materialistic so imagine how they appear to people they know. \n\nWhat’s the saying? If you smell shit everywhere you go check your shoes",
                            "score": 136,
                            "author": "CaptainAdam5399",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If the situation is reversed, I bet the sister will say “I have a family and I can’t help you”. Totally NTA and I hope OP doesn’t give in",
                    "score": 238,
                    "author": "koalamachete",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh we know if the situation was reversed sister wouldn’t do anything. She already showed that when she left OP on her own and didn’t help her out. She’s shown that she’ll put BIL and money ahead of OP so that won’t change",
                            "score": 30,
                            "author": "CaptainAdam5399"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;Will refusing to give her the money damage your relationship with her?\n\nthat ship has sailed -- sister already killed the relationship by holding it hostage for her sister's money.",
                    "score": 144,
                    "author": "Festernd",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA!!!!\n\n\n&gt;make backhanded comments about dad and mock his llness and make a scene at his funeral.\n\nHe had no respect for your father. Making scenes is not something that you do, even at your enemies funeral.\n\n&gt;she used her inheritance to get new cars and renovate her house\n\nShe had her money. She blew it.\n\n&gt;education is nothing compared to someone's health and asked if I'd be happy to see her as a widow and my nephew with no father\n\nIt's YOUR education, not hers. Your BIL is a complete stranger to you, you have no blood relation (I assume) and therefore no obligation. She's being selfish and entitled. If she had done none of the above and you refused then you'd be TA. But after all this, she absolutely does not deserve a cent, please don't sacrifice your education.\n\n&gt;she'd pay back in less than a year.\n\nIf this is true, she should have no problem getting a loan from a bank.\nAfter all this if you do end up giving her money, make her sell all her cars and collect collateral if possible.",
            "score": 4394,
            "author": "Speedypanda4",
            "replies": [
                {
                    "level": 1,
                    "comment": "And don’t forget this one\n\n&gt; I live with my aunt right now cause **my brother inlaw didn't let me stay** with my sister\n\nOP = NTA",
                    "score": 4164,
                    "author": "Responsible_Judge007",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh yes, I didn't notice that one. I just hate how OPs sister is victimizing herself.",
                            "score": 934,
                            "author": "Speedypanda4",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Their father died a year ago. OP is 18 and taking a gap year before she goes to college. By that math, she would have probably still been in high school when the father died and the BIL wouldn’t let her live with them??  How heartless is that?\n\nOP-NTA.",
                                    "score": 868,
                                    "author": "catalinx",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And then her sister is trying to guilt OP about how she'll be widowed and her kids will grow up without a father, while OP IS AN ORPHAN AND SISTER'S HUSBAND WOULDNT LET HER LIVE WITH THEM LMAOOOO what a horrible hypocrite",
                                            "score": 589,
                                            "author": "eggnap",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "“It doesn’t matter when it happened to you because now it’s happening to MEEEEEEEEE” OPs sister probably",
                                                    "score": 213,
                                                    "author": "CaptainAdam5399"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Exactly. He made his bed and now he gets to reap what he's sown.\n\nI know I mixed metaphors but fuck it",
                            "score": 184,
                            "author": "Syrinx221",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "This is it for me. And her sister only started being more friendly towards OP because she wanted to ask OP for money. Sister and BIL didn't care about OP before then. \n\nI also don't like how BIL thinks he can act like an AH because he is ill. Being ill does not give you a pass to act however you want and disrespect others.\n\nOP should not sacrifice her future for anyone because relationships can always fall apart but an education can help her to achieve her goals. \n\nNTA, OP. Do not give them a penny. Your sister is trying to make you feel bad to manipulate you into doing what she wants but this is not your problem and you do not owe these people your time or money. Next time she makes you try to feel guilty ask her why she didn't save her money when she knew her husband was chronically ill.",
                            "score": 117,
                            "author": "Throwaway_fml_T_T",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "even if the sister hadn't done all these things, she would still not be entitled to OP's money and OP wouldn't be TA for not giving her money then either.",
                    "score": 658,
                    "author": "katestatt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "THANK YOU",
                            "score": 86,
                            "author": "moose8617"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "She still wouldn’t be the AH if none of the above happened and she didn’t fork over her money. She isn’t required to subsidize her sister or anyone else’s life.",
                    "score": 90,
                    "author": "moose8617"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No one has mentioned that your BIL would not let you stay with them when your dad died, but he's perfectly happy letting you take care of his family while you stay at the Aunt's house? Please don't give these people any money! The man has been sick for some time, they should not have wasted the money your dad gifted them despite BIL being trash to dad! Just because they're family does not mean you have to have a relationship with your sister. Go be a doctor, save many more lives than this one. You've got this! Good luck!!!",
            "score": 3843,
            "author": "Paindonthurt74",
            "replies": [
                {
                    "level": 1,
                    "comment": "SIL: But OP! How could you wish to see nephew made an Orphan!?  \n\n\nOP is an orphan and sister was fine with BIL refusing her a HOME...so I feel like OP should keep that in mind.",
                    "score": 2231,
                    "author": "MixWitch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can get the surgery and declare medical bankruptcy and keep the house if it'd jointly owned.\n\nJust have the sick dude declare bankruptcy.",
                            "score": 483,
                            "author": "pringlescan5",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If not having the surgery is life-threatening, they will allow him the surgery and then bill him... and then he can setup a very reasonable payment plan if he doesn't have any money. \n\nSource: getting 10s of thousands in bills while uninsured. Hospitals are more reasonable about such things than people tend to believe.",
                                    "score": 288,
                                    "author": "mistled_LP",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah I had to stay in hospital while I’m grad school (had shitty insurance but it was something). They let me set up a ridiculously low payment plan after I explained to them my meager stipend",
                                            "score": 62,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Biggest favor he ever did her, though. Could you imagine if they let her stay? The rent they'd be charging? The guilt trips over how much they did for her? Fuck",
                    "score": 250,
                    "author": "DumpsterPhoenix93",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“ How dare you not be our slave we took you in” \n\nI can see them saying things along those lines",
                            "score": 35,
                            "author": "CaptainAdam5399"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Exactly!  He wouldn't even allow her to live with them.  She owes him nothing.",
                    "score": 106,
                    "author": "mezobromelia1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;My aunt suggested others pay but most of them cut my sister and her husband off\n\nI wonder why that is...\n\nOf course you aren't the ahole.\n\nFirst your sister and her husband should sell ther luxurious items and if that is not enough can ask for help.",
            "score": 1759,
            "author": "Dimirosch",
            "replies": [
                {
                    "level": 1,
                    "comment": "Most of the family aren't on good terms with my brother in-law and my sister because of his attitude towards them. Since my sister kept taking his side she ended up being cut off by others as well.",
                    "score": 1628,
                    "author": "Home-Time-6077",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So he basically dug the hole and she jumped happily into it\n\nIt sound like they only want to take advantage of you, since you are young and naiv (at least in their minds)\n\nIf you even considder to give them a penny, make a contract. I don't know the laws where you live but as it seems you need something in writing like \"If Sis fails to pay X ammount of money back by the date of xx.xx.xxxx the ownership of the house goes to you\" (ask a lawyer on what you can and cannot make legally binding). If they really need the money and want to pay it back in time, it shouldn't be a problem. If not, they just admitted that they want to scam you.",
                            "score": 762,
                            "author": "Dimirosch",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Be careful with this. Even a binding contract can’t make money appear. The obligation to pay cannot be fulfilled without the other side having money. If they default, then what? You sue to collect on the contract + interest/damages? That is yet more money the other side doesn’t have.",
                                    "score": 399,
                                    "author": "mrsrowanwhitethorn",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's why I mention the valuable things like ownership of the house going to OP\n\nOf course money won't come out of thin air but selling the house before OP can collect would be quite a hastle and where I am from you could even put in writing, that the sis isn't allowed to sell without OPs consent.",
                                            "score": 80,
                                            "author": "Dimirosch",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Naw then she would have to evict them and worry about them trashing the house out of spite. \n\nJust don't get involved with assholes in any way.",
                                                    "score": 133,
                                                    "author": "Disagreeable_upvote",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Incoming: \n\n\"AITAH for evicting my sister her sick husband and their child from the house that I own because I have no place to live and they refuse to pay rent?\"",
                                                            "score": 43,
                                                            "author": "LemmeLaroo",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "no. no contract, give nothing. if she negotiates anything, they will take it to mean they have leverage to use when they come for whatever is left later.",
                                    "score": 87,
                                    "author": "Festernd"
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 62,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Please, please don't give your tuition money to anyone.",
                            "score": 403,
                            "author": "noface1289",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 140,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;Most of the family aren't on good terms with my brother in-law and my sister because of his attitude towards them\n\nAnd that is why you need to stay away as well.\nYou sister is a hypocrite. She is willing to spend her inheritance like water, let her husband treat her family like shit, lets her husband create a scene at your own  father's funeral and doesn't stand up for you, but expects you to bend over backwards to help her and her family with the inheritance you deserve. She is willing to downplay your education for her own benefit!\n\nLet her sell all the cars she bought and use that money to treat her husband.\nThey are not your responsibility. \n\nDo not give away your inheritance for the so-called BIL, who would even let you take shelter under his roof after your father passed away.\n\nEDIT: NTA, of course",
                            "score": 222,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "I think you need to follow suit and cut her off. I mean,  how do you know that she isn't just keeping contact because of your inheritance? She could be seeing YOU as her rainy day account. Don't give her single penny, she not gonna give it back. NTA",
                            "score": 97,
                            "author": "sweet101trash"
                        },
                        {
                            "level": 2,
                            "comment": "You should do the same and cut them out.",
                            "score": 41,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA. \"Education is nothing compares to someone's health\" &gt; she just admitted that she has no intention to pay you back.",
            "score": 1290,
            "author": "faynfayn",
            "replies": [
                {
                    "level": 1,
                    "comment": "THIS!!!!",
                    "score": 229,
                    "author": "DigDugDogDun",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Also if OP is planning to go to med school, will that not lead to being directly responsible for someone's health? She'd help so many more people than just one......\n\nOP just needs to sadly realise that her sister is trying to take advantage of her and sadly will need to cut them out of her live for now or at least reduce contact to the bare minimum.",
                    "score": 167,
                    "author": "Taniwhalg",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA. He wouldn't even let you stay in the house with them, but expects you to put your whole future on hold for his surgery? Dang.",
            "score": 1006,
            "author": "agarrabrant",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah that stood out to me too. Like, that's fucked up.....although part of me wonders if the sister just didn't want to and used her husband as a convenient excuse. \n\nNTA, obviously. OP is smart to use it for college expenses. Sucks about sis's husband but they shouldn't be asking her to sacrifice her potential future like this.",
                    "score": 231,
                    "author": "RomanaNoble",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA - your sister’s husband had poor health before you and your sister received your inheritances. Knowing this, they have made poor choices - everything from being generally unlikeable and rude to your father during his life  to not supporting you by letting you live with them after your father passed away to spending their inheritance money on renos and cars (with the reasonable expectation that they would eventually experience a health crisis). \n\nI would also point out that they have conveyed that they will not be there for you in your time of need (living situation). \n\nAll this to say that ou need to look after yourself first… guilt-free. \n\nYour aunt is right, this will permanently damage your relationship with your sister. My suspicion though is that your sister will always be reaching out to you for money, even more once you become a doctor, so establishing boundaries now will serve you well.\n\nEdit to add: it is really shitty of your sister to put this big, huge burden on your shoulders. You are only 18 years old and have recently lost your father and now need to make important decisions about your own future. This makes me more angry the more I think about it. How dare she put you in this position.",
            "score": 852,
            "author": "LeeAllen3",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't know much about my Brother in-laws health because my sister doesn't share any information with me specifically but keeps venting about the situation.",
                    "score": 592,
                    "author": "Home-Time-6077",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;I don't know much about my Brother in-laws health because my sister doesn't share any information with m\n\nThis, in itself, seems suspicious to me, OP.  She wants you to pay for a surgery for a condition you know nothing about?",
                            "score": 822,
                            "author": "brandy8marie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep. I'd wager the BIL spent a large chunk sister's inheritance up his nose or into his arm.",
                                    "score": 301,
                                    "author": "gottabekittensme",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is legitimately high on the list for why relatively young people have heart conditions",
                                            "score": 175,
                                            "author": "has-it-a-name",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yep, killed my good friend at 31. Cocaine King for a few years and then cleaned himself up and was dead 2 years later. Cardiomegaly",
                                                    "score": 75,
                                                    "author": "Vandilbg",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Ooh this makes sense, the BIL's chronic illness is a drug addiction!",
                                            "score": 70,
                                            "author": "thisisdumb08"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Their behavior does come across as junkies desperate for their next fix.\n\nMy father said decades ago his cousin got married and the in laws gave the couple the money for a new house. This is a few hundred grand back in the 70s or so. Well, the idiots decided they could spend half of the money on cocaine and half on the house. Then after they snorted it all it dwindled to half of the remaining money, then half of the new lower amount, etc. Long story short, guess who never bought a house?",
                                            "score": 50,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Are you sure he’s really that bad off? Like if my husband was in poor health and Daddy left me some money, that would be allocated towards his treatment. She didn’t do that for her husband? Why? And most importantly, why must you do for him what his own wife didn’t do?",
                            "score": 410,
                            "author": "aurumphallus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This was what stood out to me (I mean a lot did). I’ve always been either accident-prone or my chronic health issues can flare up. I made sure to have the best insurance I could afford at all times, even when a poor grad student. Do I wish I could spend that money on travelling? Sure. But that’s just not the card I was dealt.",
                                    "score": 130,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "How dare you criticize her without knowing the full extent of the situation. It’s pretty obvious that they needed the BMW to drive him to his appointments, and the marble floors are just way easier to push a wheelchair on than carpet.\n\n=)",
                                    "score": 44,
                                    "author": "Midnite135",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "But it wasn’t sudden, right? You say he’s chronically ill, so whatever it is, he’s had the condition for a while, even if now it’s worse. And yet your sister, living in a situation where emergencies should be expected (either medical or financial, since chronic illness threatens employability), spent her inheritance on luxuries, new cars and a house reno. Your friend is right.\n\nWhy should her husband’s emergency be so important to you when it wasn’t to her?\n\nThe “I’ll pay you back within the year” claim is clearly BS. She doesn’t have just a short-term cashflow problem, and there are other ways of securing loans for such circumstances, from official lenders. Maybe she’s thinking the surgery will magically make her husband so much better that he’ll easily and quickly earn the money back, but if so she’s dreaming. Such quick and miraculous fixes are extremely rare. And your BIL didn’t care that you were an orphaned minor in need of a place to live, so he’s not going to care about paying you back.\n\nSo you won’t get your money back before college, if ever. Which means you’re going to fall out with your sister anyway, eventually, one way or another. That’s not your fault; she’s the one who tied your relationship with her to your money. So do you want the version where you can pay for your college plans or the one where you can’t?",
                            "score": 189,
                            "author": "calling_water",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "If he really needs the surgery and it's life or death, they're not going to turn him away and let him die due to inability to pay. Your not giving them money is not keeping him from getting surgery, they just don't want to be financially inconvenienced by their poor planning. They have many options other than stealing your future.",
                            "score": 186,
                            "author": "scagatha",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I have doubt that if her husband is really sick or they really spent all inheritance. This could be a ploy to get your inheritance money. \n\nTell her to do a \"go fund me\" for her husband or get loan from bank.",
                            "score": 110,
                            "author": "Livingeachdayatedge",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Definitely suspicious.  Even if he really is chronically ill, he may have insurance or government funding paying for whatever treatment he's on, IF he's ill.  \n\nMoney does strange things to people.  Sister is insanely greedy and I wouldn't doubt she's lying just to steal every penny possible.",
                            "score": 69,
                            "author": "threadsoffate2021",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "She’s trying to guilt you into giving money to preserve a thing that never existed… a happy healthy family with a healthy husband and father. He wasn’t healthy to begin with and that was somehow never a financial priority for them but when it’s your money, all of a sudden it’s your fault she can’t have it.",
                            "score": 43,
                            "author": "Liuciferin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA. You can’t be held responsible for everything around you just because you have money. This is what health insurance is for. \n\nYour sister could have saved some of her inheritance and this would have been less of a problem.",
            "score": 385,
            "author": "Excuse_Purple",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA DO NOT GIVE THESE PEOPLE MONEY!!!!",
            "score": 257,
            "author": "rockabillyrosie",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA.   Listen to your friend.",
            "score": 252,
            "author": "Adept_Neck_3178",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA\n\n1 - your BIL was ill when your sister had her share of the inheritance. She chose not to use it for medical bills then or save it. Buying cars and home renovations could have waited.\n\n2 -  BIL treated your dad poorly. Honestly that alone would have made me go no contact with him and your sister.\n\n3 - you won’t ever see that money again and you’ll loose your chance to go to college and be debt free.\n\n4 - it’s your money and your sister isn’t entitled to it anyways. If this was someone you were really close with who had no other options that would be a little different. But you aren’t close with her, and she had the money a year ago and chose not to put it towards her husbands health. If it’s not important to her why should it be important to you?\n\nDon’t feel bad. The rest of your family has cut her off for a reason. And damaging this relationship doesn’t seem like a major loss tbch",
            "score": 218,
            "author": "ghostofastorm",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA Your friend is right. She can sell those cars or her house to get the money. She's wrong to try to guilt trip you into paying for her husband's surgery. She knew her husband was in ill health and still decided to spend her inheritance on house renovations and junk? And you're supposed to threw away your future for a guy who won't even let you stay at their house? Don't do it. But your aunt is right. This is going to ruin whatever existing relationship you have with your sister. But I wouldn't want a relationship with someone who's so manipulative.",
            "score": 188,
            "author": "Majestic-Meringue-40",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA. I agree with your friend.",
            "score": 153,
            "author": "Kris82868",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA - never lend money (especially large sums)  to friends or family. You’ll likely never get it back. It’s not worth the headache. If someone is needs money and you’re okay just gift it.",
            "score": 154,
            "author": "hogwhistle07",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA. You know you'd never see that money again, and you know you'd never be so much as thanked for it either. Plus, when you're a doctor, you might end up saving far more people who are much more deserving.",
            "score": 127,
            "author": "M4String",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;you know you'd never be so much as thanked for it either\n\nYep.  The sister sees this as an obligation, not OP going above and beyond for someone who treated her and her dad like garbage.",
                    "score": 39,
                    "author": "SunshineRobotech"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA. You would NEVER get the money back. She doesn’t care about you or your future, only your inheritance. Just because you didn’t blow it like she did. Failure to plan on their part does not make an emergency on your part. And using your nephew to try to guilt you into giving her money is manipulative AF. You might be better off not having her in your life anyway tbh.",
            "score": 105,
            "author": "Inside-Baseball9909",
            "replies": []
        },
        {
            "level": 0,
            "comment": "American healthcare ripping families apart again.\n\nYou people need to revolt.",
            "score": 105,
            "author": "Denbi53",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA. If your sister would be able to pay you back within a year, then surely she’d be able to pay off the medical bills in a year the same way? Usually there’s the option of a payment plan to pay off large bills in increments - I used a payment plan to pay off an ER bill from last year. Your dad left you and your sister inheritances (I’m assuming you both got the same amount). I can understand your sister being upset and wanting her husband to be healthy, but that’s not a burden you put on your little sister. Also, if her husband hadn’t been so rude to you in the past, I imagine you might be more inclined to help, at least a little bit.",
            "score": 91,
            "author": "xxLostAngelxx",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Holy moly, NTA. If it means that much to them why not spend their  inheritance money on that instead of cars? It sucks that you guys don't have universal healthcare (I assume USA?), but that's not your fault, she shouldn't expect you to sacrifice your own future. The real AH here is the US healthcare system.",
            "score": 82,
            "author": "acheesement",
            "replies": [
                {
                    "level": 1,
                    "comment": "I mean, yeah, but also the sister did have money and she spent it all on luxury cars (I’m behind her renovating her home, though, that sounds nice). The system is obviously terrible, but the sister is just as selfish, telling OP that her school doesn’t matter. She can sell her cars. She can take out a loan, since she can apparently pay the entire sum of the money back within a year.\n\nPlus she seems to be a generally nasty person, if EVERYONE has cut her off. Plus why would OP want to help this man who made fun of her dying dad? Fuck him, honestly.\n\nI say NTA, and though the US healthcare system sucks and is very unfair, in this case the real a-hole is the sister.",
                    "score": 42,
                    "author": "PaladinHeir",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "BLOCK HER NUMBER.",
            "score": 82,
            "author": "throwawayj38sld",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA don’t give her the money. You both had money. She spent hers on things other than her family’s health. Now she’d like to spend yours too.",
            "score": 67,
            "author": "Chorleycake"
        },
        {
            "level": 0,
            "comment": "NTA!! Life is a series of choices. Your sister made choices what to do with her money. Their poor planning is not your emergency to bail them out. Plus, most hospitals set up payment plans for people that need assistance. Let her pay the hospital back for his surgery. Don’t let her paint you out to be the villain in her life’s drama. She can take a good look in the mirror. You won’t get your money back. Don’t let your sister set you back in life. You’ll make a terrific doctor.",
            "score": 66,
            "author": "theprovinciallady",
            "replies": []
        },
        {
            "level": 0,
            "comment": "&gt;I asked my friend and he said let them sell the cars and all the luxurious stuff they bought to afford the surgery and warned me if I give them money I'll never get it back and may not be able to go to medical school.\n\nDo this ^\n\nNTA\n\nNot your fault they don't have insurance.",
            "score": 68,
            "author": "d1scworld",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA\n\nNo. There is no reason that you should give your sister the money.\n\nSince she asked for a loan, there is the option of giving her one, BUT only if you have a legal loan document drafted that stipulates interest, a payback plan, and collateral (i.e. what will be come yours if she defaults.)\n\nPersonally, I wouldn't even bother with this option, but she will show her true colors when she responds to this proposal.",
            "score": 62,
            "author": "GreekAmericanDom",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA. They have the ability to pay, they’re choosing not to. You shouldn’t be worried about her cutting you off, she should be worried about you cutting her off.",
            "score": 53,
            "author": "Ribbon-"
        },
        {
            "level": 0,
            "comment": "Your friend is right on target! Your sister says you’re putting education over family. Well she’s putting luxurious items over your education AND her family! Let her figure it out and live your dreams. \n\nYour aunt is right that you should be be prepared to do damage to your relationship. But you should probably consider if this is even a relationship worth saving if its existence contingent upon you abandoning your dreams. Good luck!",
            "score": 52,
            "author": "juswundern"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 51,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Everyone around me is obviously being absolutely and utterly insane, am *I* the asshole?\" smh",
                    "score": 34,
                    "author": "Kwerti"
                },
                {
                    "level": 1,
                    "comment": "Hey Reddit, I need internet points… I mean help. My cousin stomps on puppies and I told him to stop. Am I the ass hold?",
                    "score": 28,
                    "author": "HeathenHen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "YTA for making a thread where you're obviously not the asshole.",
            "score": 45,
            "author": "poodlebutt76",
            "replies": []
        },
        {
            "level": 0,
            "comment": "&gt; She's been sending texts and pictures of her family telling me this is what I was saying no to, a happy healthy family with a healthy husband and father. I cried and felt like I was being selfish not good aunt and sister. \n\nI think it’s time to accept your relationship with your sister is done, the only way you keep in your life is conditional on you funding it and jeopardising your own future. You’re being guilted into giving up your future for a relationship, a family and choices you never made, and at 18, she knows what she is doing laying that on you, you’re barely out of childhood. It’s so manipulative and awful what she is doing. You’ll never see that money and not only that, you’ve got no security net without it, no parents to fall back on and support \n\n\n&gt;I asked my friend and he said let them sell the cars and all the luxurious stuff they bought to afford the surgery and warned me if I give them money I'll never get it back and may not be able to go to medical school.\n\nLook at your real friend over here!!! Someone whose relationship with you isn’t conditional on you giving up your security for her own comfort.",
            "score": 45,
            "author": "raya__85"
        },
        {
            "level": 0,
            "comment": "Don’t give her any money, you’re entitled to that money and you want to further your education, they sound like awful people, NTA",
            "score": 42,
            "author": "phantomsunicorn"
        },
        {
            "level": 0,
            "comment": "NTA. If they can repay you in a year. Let them take a loan.",
            "score": 44,
            "author": "pookguy1"
        },
        {
            "level": 0,
            "comment": "NTA - she decided to use her money for cars, while she knew her husband was sick. That’s on her. It’s not your responsibility",
            "score": 36,
            "author": "12_51-sats",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA it's your money and your future. Listen to your friend. She can sell her cars (luxuries that are not necessary) so her husband gets his surgery AND you can get your education",
            "score": 37,
            "author": "no-thing89"
        },
        {
            "level": 0,
            "comment": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n ---\n\n I might be the AH for not helping my sister with her situation and not considering the fact that if anything happens to my brother in-law then my nephew and my sister will suffer sand it's too much to handle.\n\n---\n\n Help keep the sub engaging!\n\n#Don’t downvote assholes!\n\n Do upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
            "score": 34,
            "author": "Judgement_Bot_AITA"
        },
        {
            "level": 0,
            "comment": "NTA. Isn't your responsibility. Use your cash for college if that'd what you had planned.",
            "score": 35,
            "author": "OhForty7"
        },
        {
            "level": 0,
            "comment": "NTA. Your sister is incredibly selfish for asking that of you.",
            "score": 35,
            "author": "ArtFreek"
        },
        {
            "level": 0,
            "comment": "NTA\n\nEspecially after what she did after you said no. She should just take a loan, shouldn't be a problem if she's able to pay it back within a year.",
            "score": 33,
            "author": "Feroc",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA. Everyone who has posted is right. This is your money. She had some and blew it. That right there tells you everything you need to know.   She would always have an excuse for not paying should you loan her it anyway. You're BIL mocked your father and his illness? Sounds like Karma to me. You have NO obligation to pay for yoir BIL's surgery. Tell your sister to sell one of her cars.",
            "score": 32,
            "author": "Unable-Ad-601"
        }
    ]
}