{
    "id": "xbn2n0",
    "score": 50611,
    "title": "AITA for dropping our dinner on the ground and walking out when my boyfriend asked me \"What's for dinner tonight, b*tch?\"",
    "author": "deliahdyno",
    "date": 1662914144.0,
    "url": "https://www.reddit.com/r/AmItheAsshole/comments/xbn2n0",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was over my boyfriend's apartment this weekend and I was cooking dinner because he was studying for exams. I made pasta and a chunky sauce with meatballs and veggies. I told him dinner was ready and he goes \"what's for dinner tonight, B*TCH\" ... With like a lot of emphasis on the last word. \n\nI was fed up, I'd had a pretty rough day with work and I have some awfully bad associations with that word being used by other people in my life who were pretty abusive. So I was so irritated that I dropped the pot of pasta sauce I'd been carrying right on the ground and was like \"Well nothing's for dinner tonight now. And I better not hear you using that word again, it's for the girls\"\n\nHe was freaking out about how sauce had landed on his rug and he even said \"you're seriously acting like a bitch right now, I dunno what else to call it\"\n\nI just walked out and got takeout for myself and went to my friends house. She thought it was funny but my boyfriend was furious, he kept texting and calling and sending me voice memos trying to explain that saying \"what's for dinner tonight b*tch\" was a TikTok trend.... And that he was just quoting something as a joke to put on tiktok. \n\nI thought that was the shittiest excuse ever, it doesn't matter if he saw it as a joke, or stole the \"joke\", it was still disrespectful. \n\nBut it didn't change the fact he thought that shit was funny, to demean me when I was trying to do him a favor. Like hell I came over when he was studying to make a home cooked dinner and he decides it's time for jokes? So I put my phone on don't disturb for the night and split a bottle of wine with my friend and her roommate. \n\nThe next morning he was sending me angry texts demanding I clean his rug because he was too busy with exams to do it. I was shocked he left it overnight, that's disgusting. I texted him back saying.\n\n\"Yeah so that's the b*tch tax honey :) leave me alone till you're ready to handle your own cooking and cleaning because this b*tch isn't anymore. Also it's vile you left that soaking in all night\"\n\nHe called me and told me that he was okay with doing his own household work, but I did throw a full pot of sauce at the ground so that's on me to clean up. \n\nI told him \"yeah no I'm not comfortable doing chores for you if you see me like your b*tch\" \n\nHe told me he didn't and it was just a \"trend\" and I got pissed off he was playing that \"TikTok trend\" BS excuse again and I told him \"Well I'm starting a trend called 'saucing' where as a little joke people throw pasta sauce around! You can't be mad because it's just a little trend, a little jokey joke, just a little prank bro!\" \n\nHe got really pissed off and hung up on me and now I'm seriously wondering if this dumb fucking tiktok joke is gonna be the end of things between us\n\nAITA for how I reacted when my boyfriend asked me \"what's for dinner tonight, b*tch\"\n\nEdit to address a comment I've gotten a lot and I don't have time to reply to every time:\n\n&gt; \"But did you tell him not to call you a bitch? Like how would he know otherwise?\"\n\nHonestly if someone has gotten to the age of 30 and not realized that women (as a whole) do not like having demeaning slurs used against them... They're beyond my help. \n\nThis isn't something that needs to be told. I shouldn't have to go through life like \"Hey man just in case you were thinking I might like demeaning slurs against my gender used on me, I don't actually :)\"\n\nAnd if you were about to comment something like that, let me just tell you in no uncertain terms... WOMEN DO NOT LIKE BEING CALLED BITCHES BY MEN. DO NOT CALL WOMEN BITCHES. IF YOU NEEDED TO BE TOLD THAT IS UNKIND, CONSIDER YOURSELF OFFICIALLY TOLD. NOW YOU HAVE NO EXCUSE TO NOT \"UNDERSTAND\"",
    "comments": [
        {
            "level": 0,
            "comment": "We have to shut this one down to the amount of uncivil comments.",
            "score": 1,
            "author": "Farvas-Cola"
        },
        {
            "level": 0,
            "comment": "NTA\n\n&gt;\"Well I'm starting a trend called 'saucing' where as a little joke people throw pasta sauce around! You can't be mad because it's just a little trend, a little jokey joke, just a little prank bro!\"\n\nAbsolutely iconic.",
            "score": 52380,
            "author": "bookynerdworm",
            "replies": [
                {
                    "level": 1,
                    "comment": "Of course it was Marinara - see all of the red flags??!! 🤣😂",
                    "score": 16292,
                    "author": "uDontInterestMe",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Everything is red, how can I see any flags?",
                            "score": 4560,
                            "author": "Lewistrick",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sounds like OP was definitely seeing red!\n\nWhen I first read this, I kind of thought OP overreacted. So I tried to think about how I would feel in her situation, and I realized I honestly have no idea. My husband and I tease each other all the time, but we also have a (clearly unspoken) line that we don’t cross, and it comes somewhere before calling each other names like this. I was completely wrong when I thought OP overreacted. She has a right to be respected by her boyfriend, and he’s clearly failing to do so.",
                                    "score": 3593,
                                    "author": "SincerelyCynical"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "MARINARA FLAGS",
                            "score": 2118,
                            "author": "smaller_ang"
                        },
                        {
                            "level": 2,
                            "comment": "I'm so glad we're still doing that.",
                            "score": 760,
                            "author": "Revving88",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "NTA\n\nAnd yes your comeback was so on point. I would have thought about it after 6 months. Truly iconic.\n\nI'm really shocked that he didn't apologize, get you flowers and beg you to take him back...!\n\nDump his ass just like the sauce..!!",
                    "score": 4275,
                    "author": "HailLuciferDaddy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was just thinking of the \"dump his ass\" videos on tik tok!",
                            "score": 923,
                            "author": "bookynerdworm"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Girl\n\n⭐️⭐️⭐️⭐️⭐️\n\n10/10\n\nWould read again.",
                    "score": 3950,
                    "author": "ThePearlEarring"
                },
                {
                    "level": 1,
                    "comment": "I fucking died at that. And the fact the bf got angrier was the cherry. I hate being laughed at in arguments, but I think I would have regardless of which party I was",
                    "score": 2342,
                    "author": "moxiered"
                },
                {
                    "level": 1,
                    "comment": "OP is my hero :)",
                    "score": 1365,
                    "author": "SqueakyBall",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Mine too! She’s awesome",
                            "score": 196,
                            "author": "Scar_andClaw5226"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "For real. Boss move. *So* NTA…op, can we be friends? Cuz I like your style.",
                    "score": 1034,
                    "author": "aLittleQueer"
                },
                {
                    "level": 1,
                    "comment": "honestly, i need to hire OP to handle all interpersonal conflict in my life. please.",
                    "score": 780,
                    "author": "negligenceperse"
                },
                {
                    "level": 1,
                    "comment": "OP may be my hero. I wish my younger self had the nerve to stand up for myself, hell, I wish me now was better with it. I definitely want to channel some OP energy the next time I date someone who wants to do what I’ve experienced in the past.\n\nWhat a bad ass, I love this for her.",
                    "score": 618,
                    "author": "mkat23"
                },
                {
                    "level": 1,
                    "comment": "SAUCING! Yes, girl, that punk got all the sauce he deserved. Let that stain be a reminder!",
                    "score": 550,
                    "author": "MsPaleoBot"
                },
                {
                    "level": 1,
                    "comment": "Love the saucy trend.",
                    "score": 309,
                    "author": "Revolutionary_Ad1846",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Came here to quote and say this. Absolutely amazing.\n\nNever change, OP\n\nNTA",
                    "score": 261,
                    "author": "Embryw"
                },
                {
                    "level": 1,
                    "comment": "I laughed so hard reading that. Then he should take it as a joke too.\n\nBtw, OP, NTA. Stand your ground hahaha",
                    "score": 220,
                    "author": "Scar-Lux94"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA.  I googled the trend.  And it is all about seeing how women react to a knowingly offensive comment.  And usually, they are offended.  These jokes aren't funny.  Well, you reacted.  He got his wish.  Effed around and found out.  He needs to grow up.",
            "score": 34217,
            "author": "Shells613",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, if that's the case I guess he got his answer, didn't he?\n\nMoreover, he can hardly hold OP responsible for the mess if the whole point of his little experiment was to discover her reaction.",
                    "score": 9263,
                    "author": "OTTB_Mama",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Quite the point lol found out she reacted how she was supposed to according to the trend and he didn’t like it. Poor baby. (Edit: typo)",
                            "score": 3223,
                            "author": "_yhcaep"
                        },
                        {
                            "level": 2,
                            "comment": "Right? I feel like “you reap what you sow” fits here. Honestly, I hope he posted it on TikTok so any other women and girls that see it can see what a bad ass OP is and so the men and boys thinking of participating know what could happen if they have the audacity to try the “prank” out on their SO.",
                            "score": 2176,
                            "author": "mkat23",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sounds like the kind of trend where a lot of people are suddenly going to not have an SO anymore.",
                                    "score": 1721,
                                    "author": "mitsuhachi",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And thank goodness! Anyone who thinks this behavior is ok should not be in a relationship any longer",
                                            "score": 869,
                                            "author": "Scar_andClaw5226"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Uh, yes.  I clearly said she is NTA.",
                            "score": 255,
                            "author": "Shells613",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh, I'm agreeing with you and reinforcing your point.  Sorry if that wasn't clear.",
                                    "score": 390,
                                    "author": "OTTB_Mama",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh for sure! Thanks! 😉",
                                            "score": 128,
                                            "author": "Shells613"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wait, then it isn't even a joke. It's just saying offensive stuff to see the response. What the heck, you aren't allowed to get upset at someone for reacting when the whole point was to see their reaction.",
                    "score": 3079,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Hurray for him. He can now post a TikTok showing him being an offensive AH who can’t resist a trend. He can then pan over his saucey carpet and get lots of likes and comments and his life will be fulfilled.",
                    "score": 2098,
                    "author": "merchantsc",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Part of me wonders if he was recording her to get in on this trend",
                            "score": 511,
                            "author": "WakkThrowaway"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, the trend is all about insulting your wife, and then laughing when she gets offended. It’s a disgusting trend and he’s disgusting for participating. DTMFA",
                    "score": 1839,
                    "author": "Agreeable-Celery811"
                },
                {
                    "level": 1,
                    "comment": "I was shocked when I read that OP’s (hopefully now ex) boyfriend is THIRTY YEARS OLD! This sounds like the behavior of a freshman fraternity reject! NTA at all",
                    "score": 1339,
                    "author": "Due_Release5709"
                },
                {
                    "level": 1,
                    "comment": "TikTok trends need to die already.",
                    "score": 1006,
                    "author": "Eerawai"
                },
                {
                    "level": 1,
                    "comment": "TikTok is truly a cancer on society",
                    "score": 960,
                    "author": "eeo11"
                },
                {
                    "level": 1,
                    "comment": "It's a shit trend and people need to let it die in a fire.\n\n\nSome women have those words thrown at them during domestic violence. It's not funny. I hate it when those word gets used. Few times I've had friends throw those words out jokingly it's triggered bad flashbacks of my ex.",
                    "score": 651,
                    "author": "PolyPolyam"
                },
                {
                    "level": 1,
                    "comment": "His followup Tik Tok should be \"This is what happens when you call your GF B\\*tch\" as it shows him cleaning up his rug, might as well wear the pot on his head for effect too.",
                    "score": 644,
                    "author": "3xlduck"
                },
                {
                    "level": 1,
                    "comment": "He sauced around and got sauced out",
                    "score": 446,
                    "author": "MsPaleoBot"
                },
                {
                    "level": 1,
                    "comment": "BuT iTs jUsT a PrAnK bRO!",
                    "score": 164,
                    "author": "BreadstickNinja"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA. That sauce on the rug? It’s marinara. GTFO of this relationship.",
            "score": 14268,
            "author": "bobledrew",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have been looking for the perfect marinara reference and it’s your comment!",
                    "score": 1780,
                    "author": "Tiggeribby"
                },
                {
                    "level": 1,
                    "comment": "A real-life marinara flag",
                    "score": 677,
                    "author": "ValkyrieSword"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA \n\n&gt; its just a little trend, a little jokey joke, just a little prank bro! \n\nMA’AM I LOVE YOU!!!",
            "score": 13416,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I aspire to be like that tbh",
                    "score": 1027,
                    "author": "Anxious_Light_1808"
                },
                {
                    "level": 1,
                    "comment": "OP is my new hero",
                    "score": 526,
                    "author": "Scar_andClaw5226",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "literally same, the line i quoted and the edit sealed it for me",
                            "score": 147,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;I'm seriously wondering if this dumb fucking tiktok joke is gonna be the end of things between us\n\nYou're still wondering? Leave him. Especially after this\n\n&gt;he even said \"you're seriously acting like a bitch right now, I dunno what else to call it\"\n\nAt that point, it wasn't even about the supposed trend so... Anyway NTA",
            "score": 11864,
            "author": "SnooRabbits5620",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep this reveals how he truly feels the word should be used",
                    "score": 2200,
                    "author": "smaller_ang"
                },
                {
                    "level": 1,
                    "comment": "Thank you exactly on that second part!!! You're the only person I've seen mention it. That was 100% not part of the trend and he was just salty he didn't get to laugh at her getting offended from his high horse, because it actually affected HIM, in that he didn't get dinner and there's marinara sauce all over his rug.",
                    "score": 1120,
                    "author": "PunkinPumkin"
                },
                {
                    "level": 1,
                    "comment": "Exactly! Suppose it was just because of the stupid trend... He would have cleaned up, and all you would have gotten would have been apologetic messages and a chance to prove it was just momentary insanity and it wouldn't be repeated, and that he would make it up to you.\n\nThe nerve. To call you a bitch period, but to do so while you are doing him a favor???",
                    "score": 460,
                    "author": "tinaciv"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA.  Break up.  \n\nIt’s funny that dropping the marinara sauce led to the marinara flags in this one.  🚩🚩🚩",
            "score": 5751,
            "author": "dcnowclt",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 5844,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Its a trend.. He's 30\n\nThese two things don't compute.",
                    "score": 3576,
                    "author": "Reasonable_racoon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Dude, when I read he was 30, my jaw dropped.",
                            "score": 2398,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, instantly he’s TAH for being 30 and trying to do a stupid Tiktok trend.",
                                    "score": 1139,
                                    "author": "a3wagner",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I read the post and wondered \"is he a very immature 19-year-old or is he abusive?\" I got to the part where he's 30 and it really sank in how bad this is.",
                                            "score": 941,
                                            "author": "Trini1113"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Right? When did \"the internet made me do it\" became a way to justify insulting people and committing crimes?  \n\nI love the OP a little bit for how she handled this. More people need to hold Tik Tok addicts accountable for the complete lack of common sense.",
                    "score": 678,
                    "author": "EmptyBanana5687"
                },
                {
                    "level": 1,
                    "comment": "Or lick a toilet.",
                    "score": 122,
                    "author": "Grouchy_Ad_1304"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA.\nAnd yes,  this should be the end of you two. He sounds like a total AH and leaving that on the floor overnight is just nasty.",
            "score": 4811,
            "author": "Imaginary_Building_4",
            "replies": [
                {
                    "level": 1,
                    "comment": "Like seriously? HE left sauce on the floor overnight in HIS apartment for her to clean up? What’s he gonna be like if they stay together? Like one day she gets home from work and the baby has sat in its own shit all day and he’s like “oh, it’s your baby, you had him, you change his diaper.” Or “oh, you left dishes in the sink after cooking, I’m not cleaning them up. I didn’t make the mess.”",
                    "score": 2273,
                    "author": "Zestyclose_Minute_69"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;TikTok trend\n\n\nHaha sexism is so funny! Hahaha /s\n\nNTA",
            "score": 4619,
            "author": "Street_Passage_1151",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right?! Harassment in general seems to be trendy on TikTok.",
                    "score": 812,
                    "author": "BaitedBreaths",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As an old person, I swear to god this is other countries trying to make us hate each other, just like the last couple of elections, right versus left, black versus white.etc. Now man versus woman. I've avoided TikTok like the plague. It feels like planned choas",
                            "score": 200,
                            "author": "Academic-Ad3489"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA.\n\nBut don't ***think*** about ending your relationship with him over it.  Actually ***do*** it.",
            "score": 3627,
            "author": "PacifistWarFreak",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA.  Your gut response—shock and rage at him taking you for granted, to the point of demeaning you—was the right one from the beginning.\n\nHim leaving the mess overnight expecting you to come back and clean it up just confirms it: he doesn’t respect you.",
            "score": 2216,
            "author": "600nm",
            "replies": [
                {
                    "level": 1,
                    "comment": "\\^\\^\\^\\^1000000000% THIS\\^\\^\\^\\^",
                    "score": 148,
                    "author": "EmpressVixen"
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA. Nice job btw and I love the saucing response. Go find someone whose maturity and sense of humor match yours. This one ain't it. It's not the sauce that's the problem. It's the whole man.",
            "score": 2180,
            "author": "maroongrad",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, he's sending some serious marinara flags.",
                    "score": 333,
                    "author": "Missy_went_missing",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And leaving them all over the floor, apparently.",
                            "score": 130,
                            "author": "scoodles8"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Aren’t jokes theoretically supposed to be clever? Your boyfriend just sounds mean. Also fuck TikTok.\n\nBig NTA",
            "score": 1934,
            "author": "LovesRefrain",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right? There's nothing at all even remotely clever or funny about degrading your significant other.",
                    "score": 474,
                    "author": "prairiemountainzen",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "He keeps insisting he called her a bitch as joke and forgetting he called her a bitch again with full intention when she got upset",
                    "score": 369,
                    "author": "Derpazor1"
                },
                {
                    "level": 1,
                    "comment": "I always wonder how many stupid idiots ruined a good relationship because of some stupid TikTok. NTA",
                    "score": 168,
                    "author": "labtech89"
                },
                {
                    "level": 1,
                    "comment": "I guess just straight up insulting someone to their face is supposed to be a joke now. No wordplay or anything, nothing funny or clever going on, no humorous context. Just blatantly insulting them. Like, how did he think things would go?",
                    "score": 99,
                    "author": "hahayeahimfinehaha"
                },
                {
                    "level": 1,
                    "comment": "If they had watched the tiktok together so she knew what he was referencing... it *still* wouldn’t be funny but it would be the slightest bit more understandable why he’d do it.",
                    "score": 72,
                    "author": "ipdipdu"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What's that expression? F\\*\\*k around and find out? Well he found out\n\nNTA",
            "score": 1914,
            "author": "Jess1ca1467",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Honestly you're my hero. \n\n&gt;\"Well I'm starting a trend called 'saucing' where as a little joke people throw pasta sauce around! You can't be mad because it's just a little trend, a little jokey joke, just a little prank bro!\" \n\nChef's kiss. I love it. I cackled hysterically.",
            "score": 1523,
            "author": "AdAppropriate3602",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I love your whole energy and vibe. Don’t go back to him. He had enough time to say a simple word, “Sorry”. He didn’t. Shows you what kind of person he is. \n\nNTA",
            "score": 1418,
            "author": "Miserable_Smoke585",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can't help but imagine him looking at the sauce and thinking \"yeah that bitch will clean it up later\" and leaving it there overnight like some weird teenager... let's hope OP's next partner won't have the mental age of a 14 year old.",
                    "score": 351,
                    "author": "CitrusyDeodorant"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jeez... he's 30???  I legit thought he was 19 at most.\n\nWhat 30 year old jumps on TikTok trends?  Holy hell.\n\nOut of curiosity, how long have you two been together?\n\nNTA, and ditch this immature man.",
            "score": 1159,
            "author": "SugaredZebra",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah that blew me away. I was thinking “oh, these must be early college students” based on his attitude.",
                    "score": 276,
                    "author": "Krazyguy75"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hear there's a new trend on Reddit of misogynist AHs going hungry.\n\nNTA.",
            "score": 1035,
            "author": "MystifiedByPeople",
            "replies": [
                {
                    "level": 1,
                    "comment": "Followed closely by the trend of naive AHs needing to learn how to rent and operate carpet cleaner. \n\nNTA.",
                    "score": 213,
                    "author": "anchovie_macncheese"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Would it be so terrible if it was the end for you guys? He's perfectly happy for you to be publicly humiliated on TikTok for a trend. A stupid, sexist trend too. You should have standards and you should stand up for yourself and the fact that he's doubled down like this shows he's immature and will continue to put his 'jokes' and stupid trends above you. NTA.",
            "score": 978,
            "author": "sashaopinion"
        },
        {
            "level": 0,
            "comment": "NTA. Dump him. That’s the proper b* tax. \n\nHe’s old enough to know that women find being called a b* demeaning and being told to ‘get in the kitchen’ demeaning. That doesn’t just go away ‘because Tiktok.’ \n\nHe doesn’t get to pull a sexist power flex, then hide behind ‘it’s a joke.’ What’s the punchline? You cooked for him and he’s a jerk in return? Hahaha? He gets off on negging you as a ‘joke?’ Hahaha?\n\nIf he was really sorry, he would have sincerely apologized. He would have cleaned up and ordered takeout as an act of contrition. He would have listened to why you’re upset and learned from it. Maybe gotten flowers too. There’s two red flags here- calling you a b*, and dying on the hill of refusing to fully acknowledge the issues involved. He clearly doesn’t get that sexism and sexist abuse are real and painful. \n\nI am all about reclaiming words. I proudly call myself a b*. But you don’t call other people slurs unless you establish they are ok with it. \n\nEnjoy your right hand, buddy. Who’s the b* now?",
            "score": 764,
            "author": "JoJo-likes-bikes",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Dump him. That’s the proper b* tax. \n\nAgreed. I feel like if he genuinely meant it as a \"joke from tiktok\" that he would have realized immediately that it was not as funny as he maybe thought, apologized, dealt with the consequences of his poor joke, and made sure to never say things like that again. Instead, he doubled down that it was a joke and that you are in the wrong? Throw the whole man away.",
                    "score": 226,
                    "author": "purr_immakitten"
                },
                {
                    "level": 1,
                    "comment": "I see b\\* as an acronym: Being In Total Control of Herself and also adopt it proudly.  I also noticed that I never get called b\\* when I've lost an argument, but only I've won or won't back down.  \n\nNTA and I like OP's shiny spine.",
                    "score": 122,
                    "author": "jemy74",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hated the trends when it was \"make me a sandwich\" and quite frankly the only difference I've seen is that the joke got more vile. The fact that he would make that joke when you were helping him? Nah, you don't need that lack of basic respect. Drop him like the pot and leave the cleaning deposit to him. \n\nThe whole point of a good joke is that everyone laughs with you, not at you. NTA.",
            "score": 586,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA at all\n\nYour BF needs to learn that demeaning women is not a joke nor a trend.\n\nDon't go and clean up for him, that's his job and hopefully will show him that words have power and he should not just throw certain words or phrases around because he saw it online.",
            "score": 554,
            "author": "ayesh00",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Mate. This dude is 30?? I thought he was 19. Dump this AH now. NTA.",
            "score": 485,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I had to scroll up to check if I'd missed the ages, I was so sure he was 22 max. 30? That's insane. I was pretty sure doing dumb tiktok shit was for teenagers and immature ppl in their earlier 20s.",
                    "score": 121,
                    "author": "onlyhere4laffs",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Um no, a tiktok trend isn't going to end your relationship. It's your boyfriend's inability to be mature. NTA.",
            "score": 427,
            "author": "Silver_Advantage_536"
        },
        {
            "level": 0,
            "comment": "&gt;He was freaking out about how sauce had landed on his rug and he even said \"you're seriously acting like a bitch right now, I dunno what else to call it\"\n\nThat kind of flies in the face of his tiktok trend excuse.",
            "score": 405,
            "author": "missmixza"
        },
        {
            "level": 0,
            "comment": "Eh, I’m going against the grain even if I get downvoted. But ESH. Yes it was absolutely ridiculous of him to say that and was not appropriate to called for. But from the sounds of it, this isn’t a regular thing and is just a once off. Instead of just dropping the food and such, you should have actually communicated and talked it over. This instead lead to an escalation on both sides and caused the entire outburst. \n\nNow was his reaction fine? Fuck no. It was horrible and immature of him. But it’s still split problems here. And you still added fuel to the fire with aggressive replies. \n\nBoth of you need to learn to communicate better and more effectively without dragging each other down. Build each other up and work together. It’s both of you vs the problem, not you vs him vs the problem.",
            "score": 407,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "ESH only because you both sound so nasty to each other. You need to break up and stop talking to him, not engage with his immature behavior. You both sounds like teenagers in this story.",
            "score": 383,
            "author": "unifilar",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right? And the people are egging this on in the comments lol… I’m having secondhand embarrassment.",
                    "score": 247,
                    "author": "inthacut12"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 370,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "👏AS👏YOU👏SHOULD👏 NTA!!! he tried to play it off as a joke cause you didn’t find it funny. maybe he should take a comedy class or something. the fact ALONE he tried blaming a TT TREND!? on top of the fact you went outta your way to make him food?👏DUMP👏HIS👏A$$👏",
            "score": 298,
            "author": "toastedtoebeans"
        },
        {
            "level": 0,
            "comment": "You guys are 30!? ESH. You both need to grow up",
            "score": 284,
            "author": "Roozer23"
        },
        {
            "level": 0,
            "comment": "I love you. Queen.",
            "score": 272,
            "author": "ShutUpMorrisseyffs",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA. He thinks it’s funny to be demeaning and disrespectful. He can make his own dinner and clean his own rug. Asshole.",
            "score": 269,
            "author": "charlieprotag",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Hmm I'm tempted to say E S H only cause the floor did not deserve that pasta sauce. You really should have just left with the pot, now we all mourn the loss of the sauce",
            "score": 259,
            "author": "cloudedconstitutions",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wouldn’t have given him the satisfaction of eating my food after that. I would have just taken the entire pot, and my handbag, straight to the car.",
                    "score": 80,
                    "author": "Organized_Khaos"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;he goes \"what's for dinner tonight, B*TCH\"\n\n&gt;TikTok trend\n\n&gt;The next morning he was sending me angry texts demanding I clean his rug\n\nINFO: why are you together with him again?",
            "score": 250,
            "author": "Deferon-VS",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA, but if I see saucing trending on Tik Tok I'm a die a little lol.",
            "score": 244,
            "author": "Grim-smile",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same haha. I said that to show him how silly the \"just a prank bro\" excuse is when it's applied to something that really shouldn't be a prank",
                    "score": 274,
                    "author": "deliahdyno",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The saddest thing about all of this is that he's 30 and still needs this explanation.",
                            "score": 89,
                            "author": "FreakyPickles"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "so NTA. and stay saucy, OP 😈",
            "score": 242,
            "author": "magnolianbeef"
        },
        {
            "level": 0,
            "comment": "NTA. Possibly an over reaction, but still, NTA. You're right about the Tiktok excuse, the appropriate response from him should have been an immediate apology. In my younger years, like you, I might have fought for that apology, but at the age I am now, I know that anyone worth being in my life would have immediately offered an apology.",
            "score": 240,
            "author": "Street-Wing",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, I noticed no apology or willingness to accept some responsibility. This one’s not a keeper, OP. NTA",
                    "score": 171,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 239,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "ESH….\n\nOne bottle of wine to split amongst three women  was not enough for such an occasion. You needed at least two bottles of wine to give your boyfriend a proper roasting.",
            "score": 233,
            "author": "2ShortStory"
        },
        {
            "level": 0,
            "comment": "NTA, dump that man like a pot of sauce.",
            "score": 228,
            "author": "TheEesie",
            "replies": []
        },
        {
            "level": 0,
            "comment": "So one night he calls you a bitch, doesn’t apologize, doubles down the next day, no apology, AND he left the sauce on the rug overnight in between? Does he really have that many redeeming qualities to make your relationship viable? Wow. NTA.",
            "score": 212,
            "author": "coastalAntisocial"
        },
        {
            "level": 0,
            "comment": "NTA. Insults aren't jokes. He knows that.",
            "score": 210,
            "author": "VogUnicornHunter",
            "replies": []
        },
        {
            "level": 0,
            "comment": "rule number of joking: make sure that people are in on the joke. even the riskier jokes need to be set up first.\n\nhonestly, you know by now that this relationship is heading to the shitter. guy switches between apologizing and demanding stuff is a red flag if I've seen one.\n\nNTA",
            "score": 197,
            "author": "oieusouobixo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "he played fuck around and he found out, NTA, but honestly dump the BF as well and find someone better who'll appreciate your efforts.",
            "score": 186,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "actually, INFO: have you checked his tiktok to see if he was filming you, \"prank\" style? like a \"watch my GF react to this\" type video?",
            "score": 187,
            "author": "_higglety",
            "replies": [
                {
                    "level": 1,
                    "comment": "I didn't look on his tiktok since I don't have the app, but he was filming on his phone",
                    "score": 326,
                    "author": "deliahdyno",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So he was also intending to humiliate you not only in private but on a social media app?\n\nOkay, I dunno if you really wanna salvage this relationship.",
                            "score": 444,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Ooop, yup, I can’t think of any reason for him to be filming something he specifically mentions as being a tiktok trend if he didn’t intend on posting it. I’d recommend finding his account and checking out what he’s posted. If any of your friends have tiktok you could ask them for help, or you could make an account yourself. If he’s turned on the option that synchs your contacts to the ap, you may be able to find his profile that way.",
                            "score": 214,
                            "author": "_higglety",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Haha I'm pretty damn sure he didn't post it because he's too proud to wanna post something that would be embarrassing for him",
                                    "score": 376,
                                    "author": "deliahdyno",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Fair but also you might wanna check and see if he’s posted any other videos of you without your knowledge. Fingers crossed no, but now I’m suspicious. 😬",
                                            "score": 243,
                                            "author": "_higglety"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Now I kind of wish you had a copy of the clip so you could post it for the express purpose of embarrassing him.  He deserves to be embarrassed, but he clearly does not deserve you OP.  NTA.",
                                            "score": 99,
                                            "author": "SunnyBunnyHopHop"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA\n\n&gt;He got really pissed off and hung up on me and now I'm seriously wondering if this dumb fucking tiktok joke is gonna be the end of things between us\n\nYou know what? If you guys break up over this, so be it. I know break ups are hard but staying in a relationship with an insensitive, immature, misogynistic person is NOT WORTH IT. I also doubt this is a complete isolated incident of him displaying any lack of consideration towards you.",
            "score": 184,
            "author": "thebadsleepwell00",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA and it sounds like you learned how immature and gross your boyfriend is. be glad it happened now an not once you had a child or got married",
            "score": 182,
            "author": "runningaway67907"
        },
        {
            "level": 0,
            "comment": "NTA. “It’s just a trend” is the same as saying something is just a joke or a prank; it’s just an attempt to be free from consequences when you’re a fucking asshole. Like when people say they’re just being honest when they’re really just being an asshole and want no consequences. I’d honestly consider breaking up based on him not backing down and standing firm and trying to excuse his behaviour. Like you said, it should be common decency to not use slurs. I honestly have trouble believing that this man is 30 and using TikTok as an excuse.",
            "score": 179,
            "author": "Kathasaurus"
        },
        {
            "level": 0,
            "comment": "NTA just break up",
            "score": 170,
            "author": "tcsweetgurl",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Nta , he's being inpastable to deal with",
            "score": 168,
            "author": "ForgottenPastas",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You had to edit because people asked if you had told him not to call you a B? That's messed up and you shouldn't have to tell people not to call you a degrading name. Now the snarky side of me would have texted his mom and then told him it was a tik tok joke...you know grown a$$ men getting reamed by their mother. NTA",
            "score": 164,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "NTA\n\nCouples can have a rapport where they say AH or b*tchy things and still love each other, but lines can still get crossed. When a line gets crossed (whether there's an established sarcastic rapport or not) an apology should be made. He didn't make one. He doubled down. He's 30. He should know better.",
            "score": 161,
            "author": "secretmarshmallow4"
        },
        {
            "level": 0,
            "comment": "NTA. It's not cute, it's not funny or charming. If a man I was with ever spoke to me like that he'd be my ex real damn quick.",
            "score": 158,
            "author": "_beautifulmonster_"
        },
        {
            "level": 0,
            "comment": "NTA. Just End it. There is nothing humorous about making demeaning jokes.\n\nPS: I'm fully on board with this \"saucing\" trend getting started!!🤣🤣🤣🍅🍅🍅",
            "score": 161,
            "author": "MortgageNo8573",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA. but I do hope 'saucing' becomes the next TikTok trend after you making this post",
            "score": 144,
            "author": "boots311",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh god I hope not. I only said that as an example of how absurd the \"it's just a joke\" excuse is when it's used about something that's... Not very nice or funny honestly",
                    "score": 233,
                    "author": "deliahdyno",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "NTA\n\nHe disrespected you \"as a joke to put on TikTok.\" He wanted to goad a reaction out of you to share online.  Well he got one.  The question is why are you with someone who would exploit you and play with your emotions for internet cool points.  You should be dumping more than sauce, imo.",
            "score": 144,
            "author": "ApprehensiveTruth330",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Obviously NTA, but when I tell you I couldn’t control my laughter “a little jokey joke, just a little prank bro!” God you’re hilarious despite being furious",
            "score": 135,
            "author": "JalapenoYogurt",
            "replies": []
        },
        {
            "level": 0,
            "comment": "He's 30 and copying TikTok trends?\n\nYeah, dump him.",
            "score": 121,
            "author": "PanamaViejo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA, and the fact you had to make that edit to explain to idiots that it’s not cool to call someone names is so infuriating.",
            "score": 118,
            "author": "beard_lover"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 115,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA, to be frank you could've simply said 'my boyfriend did a tiktok trend and I got upset' and that would be enough for most people to say nta",
            "score": 108,
            "author": "Serious_Lie1207",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Oh no no no. JUST NO. And again NO to all those asking if OP told the boyfriend to not use the B word. No woman deserves to be called that. Or any other slur for that matter. Especially if they are going you a favor.\n\nHowever OP, you are focused on the wrong question. It's not about dropping the pot or plastering the rug with sauce. It's about his attitude. Even if he was truly joking, be had no right to insult you. And when called out, he needed to apologise, profusely and genuinely. Insisting it was just a joke, doubling down and then invalidating your feelings is a total AH move. \n\nNTA.",
            "score": 112,
            "author": "Da_Knight_Rider"
        },
        {
            "level": 0,
            "comment": "Brilliant.   I love your new “trend”.  Bring it!   \n\nNTA.",
            "score": 108,
            "author": "Bruiscear"
        },
        {
            "level": 0,
            "comment": "NTA.  What a horrible experience. He just keeps doubling down. This is gross, but it's better off that you find out now rather than later. You two do not need to be together. He doesn't appreciate you.",
            "score": 98,
            "author": "Trixi19"
        },
        {
            "level": 0,
            "comment": "Yeah, I'm gonna say \"NTA\" here, you don't get to call people epithets because it's a prank or it's cool on tiktok or whatever, that's straight up bullshit.  \n\nAnd I'll say it again for the people in the back: If you're doing something shitty \"ironically\" or \"as a prank\" you are still doing something shitty.  \n\nThe main takeaway from this post: Stop Being Shitty to People.",
            "score": 103,
            "author": "JexPickles"
        },
        {
            "level": 0,
            "comment": "NTA. You sauced him good! I can't wait for the time TikTok trends die out.",
            "score": 99,
            "author": "TemptingPenguin369"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 99,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA\n\nHe f*cked around and found out! Stay saucy OP!",
            "score": 104,
            "author": "Jenderflux-ScFi"
        },
        {
            "level": 0,
            "comment": "want to comment that I LOVE your edit. It is not on us to educate grown-ass people.   \n\n\nI have a family member who likes to ask \"what's wrong with you\" every time I come home for the holidays still single. I've reacted . . . not well, and been called out for it by my sister, who insists no one else is telling her these things. If a 60-something woman needs to be told, I'm not gonna be kind about it",
            "score": 102,
            "author": "Spicy_Spinster"
        },
        {
            "level": 0,
            "comment": "“Trend” or not, calling someone a bitch for making food is so disrespectful. NTA",
            "score": 97,
            "author": "MeltedStones",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Also gonna put this out there: TikTok adjusts your recommended videos based on your watch history and click rate. I'm on TikTok and have never seen this trend.\n\nEdit to add judgment: NTA",
            "score": 98,
            "author": "GreenEyedTrombonist",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA \nAnd I hope he's now your ex.",
            "score": 93,
            "author": "Neverwhere_82"
        },
        {
            "level": 0,
            "comment": "NTA people recreating dumb tiktok trends would be a deal breaker for me.\n\nAnd he was rude. I'm sure you've explained to him in the past how much you hate that word.",
            "score": 95,
            "author": "throwawaypatien",
            "replies": []
        },
        {
            "level": 0,
            "comment": "nta and i think you mean ex boyfriend right",
            "score": 91,
            "author": "Sea-Ad9057"
        },
        {
            "level": 0,
            "comment": "NTA\nand bravo for sending up for yourself! Your boyfriend (here's hoping soon to be ex) is entitled and misogynistic. Uncreative as well, since he couldn't even think of a better excuse than \"tic toc made me do it\"",
            "score": 87,
            "author": "nottheblackhat"
        },
        {
            "level": 0,
            "comment": "NTA, and for your health and safety and well-being, I hope it's the end of your relationship. He sounds awful.",
            "score": 89,
            "author": "Radiant-Walrus-4961"
        },
        {
            "level": 0,
            "comment": "NTA. It’s not that the TikTok joke is the end of your relationship, more that this “joke” exposed a lot of issues that would have inevitably come out. This “joke” is gonna keep you from wasting even more time on a guy who has zero respect for you, your time and your effort.",
            "score": 94,
            "author": "Stellas_mom05",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA\n\nThank you! &lt;3 *the girls*",
            "score": 89,
            "author": "bb-bodyweight"
        },
        {
            "level": 0,
            "comment": "NTA\n\nand if that man had any goddamn sense (he doesn't, because he left spaghetti sauce, aka arguably the most staining thing in the universe, on a fucking carpet) he would have known that pretty much every man who had done that trend on TikTok swiftly got their asses ripped *clean off and fed back to them*.",
            "score": 85,
            "author": "Darth-Giggles"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 83,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Girl you already know you're NTA. \n\nYou came here to be celebrated and imagine me slow clapping over here for you. 👏👏👏👏\n\nHe tried you and you showed him exactly how you handle business. If he doesn't have the judgment to know that is completely out of line then take a page from Ariana and say \"Thank U, Next.\"",
            "score": 87,
            "author": "mellomee"
        },
        {
            "level": 0,
            "comment": "NTA and yeah, this SHOULD be the end of things between you. Honestly I’m clapping for you. He played a stupid game and won a stupid prize.",
            "score": 82,
            "author": "NoMoreFruit"
        },
        {
            "level": 0,
            "comment": "NTA but why do you want to stay with a man who doesn't understand why what he said was wrong and doesn't seem to be a bit sorry even after you let him know how you felt about it.",
            "score": 82,
            "author": "Cat-astro-phe"
        },
        {
            "level": 0,
            "comment": "NTA. A good man would have been grateful that you came over to cook for him and thanked you.\n\nA decent man wouldn’t call you names.\n\nA man with a little bit of common sense would have apologized immediately.\n\nA reasonable man would have admitted his mistake and cleaned up the mess.\n\nAll of this leaves me wondering, what kind of man is your boyfriend?",
            "score": 82,
            "author": "BitwiseB"
        },
        {
            "level": 0,
            "comment": "NTA your bf has Marinara sauce all over him.\n\nSeriously, lose that guy. Anyone doing dumb crap for a tiktok trend, especially if they can't read the room with someone they claim to love, and actually apologise, isn't someone you want to be with.",
            "score": 74,
            "author": "activelyresting",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA and these tiktok trends need to die already. Name calling is no excuse in the name of humor. Although I would not have dropped it on the ground but in the trash . You know since the joke is trash and all.",
            "score": 73,
            "author": "The_Jade_Rabbit88",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 73,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA. And that immature AH should be a blocked contact. Yes. Let this be the end of the relationship. \n\nThe straw that broke the camel’s back for me was over me lending snorkels to a friend — snorkels that had not been used in like 5 years. Snorkels that literally mattered so little that I asked my friend to keep them after that argument. It’s been 12 years since that day, and I still haven’t snorkeled 😂 The moral of the story is, the “stupider” the focus of the argument, the stupider you are if you stay in that relationship. Leave.\n\nETA: I’m happily married now and have lived a life full of adventure, respect, and lots of things not involving snorkels or fights with an idiot.",
            "score": 73,
            "author": "Sophomore-Spud",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That is hilarious. Asshole or not that was a power move. But I'm gonna say NTA because the boy fucked around and found out.",
            "score": 74,
            "author": "InnominatamNomad",
            "replies": []
        },
        {
            "level": 0,
            "comment": "He is 30???????????\n\nNTA and you are so.much better off without him.",
            "score": 73,
            "author": "grayhairedqueenbitch",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA. Hopefully he’s your ex now.",
            "score": 71,
            "author": "SweetiePieJ"
        },
        {
            "level": 0,
            "comment": "I’ve seen that trend on TT… stitched to women doing pretty much what you did. F**k him off for good. You can do 3000% better (3000 being the ultimate!)",
            "score": 72,
            "author": "albatross6232",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA I don’t care if this was a joke or a trend or whatever. It was rude and disrespectful. If you accept his “apology” he will feel free to continue this boorish behavior. Block him and never speak to him again. You did what I would have done at the time, leave and be with friends. He doesn’t deserve to have you as a part of his life and you deserve a boyfriend that will treat you with respect. And it is GROSS that he left that mess overnight. He expected you to come back with your tail between your legs, grovel at his feet, clean the mess and cook him more food (my impression of his attitude based on what you wrote). Toss him to the curb. You have more value than to ever be treated this way.",
            "score": 72,
            "author": "sheba71smokey32",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA. It's gaslighting to say \"it was only a joke, it was supposed to be funny\" to a person who got hurt by what they said instead of apologizing. Your boyfriend should apologize and make you feel better, but now he's trying to make you guilty of his bad behaviour.",
            "score": 71,
            "author": "IrishSoldierLassie",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Marinara flags all over the carpet!\n\nEdit: NTA",
            "score": 69,
            "author": "multikat42",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA\n\n**EX BOYFRIEND** here, fixed it for you.",
            "score": 71,
            "author": "babsibu"
        },
        {
            "level": 0,
            "comment": "NTA  block his number",
            "score": 69,
            "author": "CakeZealousideal1820"
        },
        {
            "level": 0,
            "comment": "NTA. You've broken up with him now... right?",
            "score": 65,
            "author": "WineAndDogs2020"
        },
        {
            "level": 0,
            "comment": "NTA, but you would be one to yourself if you øet this slide. Him doubling down and refusing to apologize properly is the sign you need that this is not a man who will treat you right. Throwing the food on the floor might have been unnecessary “punishment for the crime”, but his reactions after the fact is what is making me suggest breaking up with him.",
            "score": 65,
            "author": "Alalindria"
        },
        {
            "level": 0,
            "comment": "NTA\n\nMaybe he was joking but then… when you make a joke and it lands really poorly and the other person is Not At All Amused then you apologized. If he had just said at any point “I am sorry, it was this TikTok thing and if I had known you would hate it so much I never would have done it. I didn’t mean to hurt you.” That would be one thing.\n\nWe all screw up and say stupid things sometimes and our insight into what others will find funny is always flawed and sometimes disastrously so. But when you mess up the next step is to apologize and repair not double down \n\nFind a new boyfriend and leave him and his dirty rug in the dust",
            "score": 68,
            "author": "Errvalunia",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA. You are my She-ro!",
            "score": 67,
            "author": "Lea_R_ning",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA. Isn’t it funny that everything is a “joke” when people get called out for disrespectful behavior? I hope you reconsider moving forward with someone this willing to disrespect and bully.",
            "score": 64,
            "author": "nicchick912"
        },
        {
            "level": 0,
            "comment": "NTA! Thank you for standing up for yourself. I'm so tired of \"it's just a prank\" as an excuse for vile behavior.",
            "score": 68,
            "author": "live_char"
        },
        {
            "level": 0,
            "comment": "NTA. \"Saucing\" 🤣 that's a great reply. But no you handled it perfectly for being demeaned after doing something so kind for him.  You definitely deserve someone better (mature and not an idiot).",
            "score": 66,
            "author": "Blindman003"
        },
        {
            "level": 0,
            "comment": " I can't believe people are calling you a partial asshole in this whole thing because you dropped a pot of sauce, THAT WAS NOT THE POINT! Wtf is wrong with everyone else. The destroying of the rug was was in all fairness karma for being sexist and blaming it on a 'tik Tok trend', god the nerve. OP you're NTA, break up, there's no excuse",
            "score": 69,
            "author": "Imbetterthanyu1"
        },
        {
            "level": 0,
            "comment": "Are you an asshole?\n\nNo, you’re a legend.\n\nNTA",
            "score": 63,
            "author": "mouse_attack",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I despise food waste, but I'm giving it a pass pass this time, NTA.\n\nHe's your ex-bf now, right?",
            "score": 64,
            "author": "Suzume_Chikahisa"
        },
        {
            "level": 0,
            "comment": "If this isn’t a good use of the Marinara Flags, I don’t know what is. 🚩🚩🚩NTA.",
            "score": 62,
            "author": "Organized_Khaos",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA. I think it's less the TikTok trend and more his inability to judge what's appropriate/polite to say to his girlfriend and his inability to apologize/problem-solve that's breaking you two up. To be clear, I don't know how long you've been together but unless he grows up fast immediately, he's not worth your time.",
            "score": 61,
            "author": "zannet_t"
        },
        {
            "level": 0,
            "comment": "NTA, and calling it The B---h Tax was a boss move.\n\nI think there's a bit of immaturity in his end that isn't going to be overcome.",
            "score": 65,
            "author": "tarc0917"
        },
        {
            "level": 0,
            "comment": "NTA. For the people saying e.s.h and y.t.a, exactly what should a person's response be to being called a hurtful, hateful, misogynistic slur? If a loved one called me that it would be the immediate end of the relationship.",
            "score": 65,
            "author": "Kitsune_YYT",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA- even if it is some stupid TikTok trend his behavior after you expressed your disgust is just as bad. You made it abundantly clear your dislike for it and instead of apologizing and asking for grace he doubles down.",
            "score": 60,
            "author": "Wintergreen1234"
        },
        {
            "level": 0,
            "comment": "NTA. He is using a misogynistic meme to excuse being misogynistic.",
            "score": 61,
            "author": "TaliesinMerlin"
        },
        {
            "level": 0,
            "comment": " End the relationship. I wish I had ran the other way the first time my ex called me a bitch. Instead I wasted 7 years of my life hoping he would realize it wasn't ok. Don't be like me and don't engage in anymore back and forth with him about it. Just end things and don't waste any more energy on someone who will insult you \"for a tik tok joke.\"",
            "score": 64,
            "author": "ReadingSad3238",
            "replies": []
        },
        {
            "level": 0,
            "comment": "NTA. Jokes, pranks and TikTok trends never justify",
            "score": 56,
            "author": "themichaelkemp"
        },
        {
            "level": 0,
            "comment": "NTA. I love your energy. Dump this guy!",
            "score": 56,
            "author": "Shelliusrex"
        },
        {
            "level": 0,
            "comment": "NTA. I read the title and instantly knew the trend. I told my partner that if he tries it, he’ll be on tinder by the end of the night. It is SO disrespectful.",
            "score": 59,
            "author": "Glad_Board_9537"
        },
        {
            "level": 0,
            "comment": "NTA, why would him picking up a misogynist joke be a solid excuse? \n\nPlus he doubled down immediately; he only backtracked at all because you left and that meant he wouldn't get what he wanted from you.\n\nYou kinda handled it perfectly on the phone so I also think you know you're NTA here, but hopefully you also realize that relationship is over?\n\nHe doesn't respect you, he went mask off and you called him on it. There's no putting that back in the bottle no matter how well he behaved before",
            "score": 59,
            "author": "QueenYeen"
        }
    ]
}