{
    "id": "144up26",
    "score": 818,
    "title": "BTS - Take Two (2023 BTS FESTA)",
    "author": "impeccabletim",
    "date": 1686283446.0,
    "url": "https://www.reddit.com/r/kpop/comments/144up26",
    "media_urls": [
        "https://youtube.com/watch?v=lwAHfOhOONw"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "my fav first listen from bts in a long time, i really really enjoyed it. Prod suga i can trust you with my life. Bts proving they make the best fan songs, loved it ♥️",
            "score": 106,
            "author": "tanniespring",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same. I honestly fell out of love with their music over quarantine, but this reminded me a lot of what I used to love about their songs. 🥲",
                    "score": 4,
                    "author": "West_b0und"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I missed all of their voices together, got emotional especially during Yoongi's verse. \n\n&gt; It was possible because I was with you / I was happy being with you / breathe in your voice \n\n&gt; I stand up with your tears / Do I deserve your undeserved love?\n\n&gt; The intersection of souls we've made over the years / I am so grateful and happy to be with you /Let's be happy in the future",
            "score": 162,
            "author": "elisem0rg",
            "replies": [
                {
                    "level": 1,
                    "comment": "ah yoongi. [let's grow old together](https://twitter.com/partaetae/status/1581908548824416256?t=1EIjjR8Guh5FrzFEAji9nA&amp;s=19).",
                    "score": 52,
                    "author": "Sanguinity_"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's so beautiful! If this is a sneak peek of post-2025 OT7 songs, I am all for it.",
            "score": 93,
            "author": "whatsthisanotherdoor"
        },
        {
            "level": 0,
            "comment": "It's so calming and euphoric. Thank you for the instant serotonin, boys!!!🥺🫶",
            "score": 87,
            "author": "impeccabletim"
        },
        {
            "level": 0,
            "comment": "Aaaah I’ve missed their voices so much! Such a soothing, beautiful, catchy song 😭",
            "score": 78,
            "author": "cloudedfalcons",
            "replies": [
                {
                    "level": 1,
                    "comment": "This song and The Planet just make me feel happy and warm and fuzzy. They all sound great on The Planet too!",
                    "score": 25,
                    "author": "CenterOfGravitas",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It seems a lot of people don't know about the Planet! It was just an OST and not promoted by the group, but it's funny to hear people say it's \"been so long\" since their voices were together when it's just been a few weeks 😂.\n\nPlanet is surprisingly addictive for a kids OST!",
                            "score": 27,
                            "author": "KTKT11",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes it is surprisingly addictive!  I’ve really enjoyed listening to it because it’s just such a positive and uplifting song",
                                    "score": 6,
                                    "author": "CenterOfGravitas"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yup of course! It feels like so long since The Planet came out though 😭",
                            "score": 5,
                            "author": "cloudedfalcons"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "its just so incredibly nice to hear them all together after so long &lt;3 \n\nsomething abt bts songs will always give me so much comfort. this one in particular feels like road trips and things changing and that feeling of time passing - but in a sense that it’s alright, that’s all natural, and you can still smile in the time-in-between. I especially love the chorus and outro so much, they come in so nicely. everyone sounds doubly good after their solo projects. it’s like a teaser of the super powered up avengers they will be once they all return together. and me personally? I can’t wait for that. \n\nI just missed hearing them together so much I didn’t even know. thank u for the gift bangtan!! we will patiently wait for you 💜",
            "score": 111,
            "author": "flawedconstellation"
        },
        {
            "level": 0,
            "comment": "God, I miss them together so much. This is so pretty T\\_T",
            "score": 63,
            "author": "sugasight"
        },
        {
            "level": 0,
            "comment": "I really like this. I thought it would be more ballad-leaning, but its a lot more up tempo than I expected!  I am a big fan of Ch. 2!\n\nI’m also officially becoming a Suga &amp; El Capitxn producing duo stan!",
            "score": 120,
            "author": "Difficult_Deer6902",
            "replies": [
                {
                    "level": 1,
                    "comment": "Everyone calling him Yoongi's work husband on twitter lmao, but jokes aside he's an amazing producer I love his vibes and he makes great tracks.",
                    "score": 68,
                    "author": "pagesinked",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He accompany Suga tour too",
                            "score": 22,
                            "author": "Shookysquad93"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Suga &amp; El Capitxn together is guaranteed to produce bops every single time!",
                    "score": 70,
                    "author": "AFAIKidgaf",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "they really said let's be an iconic producing duo and never looked back",
                            "score": 48,
                            "author": "meulktea",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "yoonpearl4eva 🫂",
                                    "score": 43,
                                    "author": "alltherach_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\\#yoonpearlisreal",
                                            "score": 26,
                                            "author": "zeno0_0"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Since El Capitxn is on tour with Yoongi, I suspect we’ll get a live album of the Agust D tour. Am I clowning myself?",
                    "score": 10,
                    "author": "Particular-Yoghurt81",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What if we get a live album with a new song inspired by that photocard that he was given of Yoongi? You know the one….",
                            "score": 7,
                            "author": "Mozart-Luna-Echo"
                        },
                        {
                            "level": 2,
                            "comment": "Oh wow I hadn’t considered that, but it would be amazing! The live instrumental goes so hard.",
                            "score": 1,
                            "author": "weebrain"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It hits the sweet spot between being a wholesome ballad and having a really nice groove with a bit more going on, very easy to keep it on repeat. \n\nWould love to hear more songs like this from OT7, this is such a nice gift.",
                    "score": 2,
                    "author": "Shinkopeshon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Really digging these melodies. BTS ballads remain criminally underrated. \n\nAlso, Apple Music just added a BTS Chill playlist on their artist page that includes this song and all their iconic slower songs. Waiting for them to get their own “Inspired by” and “Influenced” playlist like other legendary acts on Apple Music.",
            "score": 109,
            "author": "Particular-Yoghurt81"
        },
        {
            "level": 0,
            "comment": "I feel like the vocalists really got a chance to show how talented they are here, and the lyrics are so beautiful! 💜",
            "score": 52,
            "author": "cutedino7"
        },
        {
            "level": 0,
            "comment": "And if I'm SOBBING?",
            "score": 65,
            "author": "outrotearenthusiast"
        },
        {
            "level": 0,
            "comment": "This song is just pure love. Such a beautiful song and they all sound ethereal. I love this and them so much. I just miss ot7 so much and hearing all 7 of them on a song. So good.",
            "score": 41,
            "author": "Dihanie99"
        },
        {
            "level": 0,
            "comment": "Safe to say, The World has healed.",
            "score": 58,
            "author": "realjolly09"
        },
        {
            "level": 0,
            "comment": "A good song to celebrate their 10th anniversary. 😭👏",
            "score": 13,
            "author": "dramafan1"
        },
        {
            "level": 0,
            "comment": "The Vocals are GODLY",
            "score": 36,
            "author": "RekZz11"
        },
        {
            "level": 0,
            "comment": "Such a beautiful song. The vocals are absolutely insane. Beautiful harmonies and smooth flow to rap parts. Gorgeous",
            "score": 49,
            "author": "Vivianee7"
        },
        {
            "level": 0,
            "comment": "Their voices the lyrics :’) i wanna hug them so bad.  It’s been 10 years of them taking the world together, and it’s been 6 years for me as an army. As cliche as it sounds, bangtan just has this special something. I will always be here rooting for them.  I’m tearing up now",
            "score": 49,
            "author": "currypuffff",
            "replies": [
                {
                    "level": 1,
                    "comment": "The lyrics are so good.  Army translators on Twitter are doing a hell of a job.  Every translation I read have been beautiful.  Gorgeous poetry.  I wish I could read the original. I get teary as well, especially towards the end for some reason. They are still so humble.  They still question why we love them so. Then they wish for us to be happy.  Every translation when I get that part 🥹.",
                    "score": 26,
                    "author": "Bear4years"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This was a perfect mix of sentimental and upbeat, I'm glad it wasn't a full on ballad since the upbeatness actually pulls at my heartstrings more. The lyric, the melodies, this just made me realise that I really missed them, they really were my youth.",
            "score": 48,
            "author": "ebi_tempura"
        },
        {
            "level": 0,
            "comment": "the vocals, rap, lyrics and the music it's so soothing and beautiful it kind of reminded me of Blue &amp; Grey",
            "score": 46,
            "author": "Similar-Judgment4188"
        },
        {
            "level": 0,
            "comment": "This song was an electric reminder that as much as I adore all of their solo endeavors, nothing hits like Bangtan as seven. \n\n\nI miss them so much :')",
            "score": 63,
            "author": "mars-ing",
            "replies": [
                {
                    "level": 1,
                    "comment": "They are amazing individually but somehow magically all 7 together is so much more than the sum of the parts.  It is really special.",
                    "score": 45,
                    "author": "CenterOfGravitas",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What they have is genuinely a lightning in a bottle, once-in-a-generation kind of magic. Mad respect for them for all their hard work and care they’ve taken to forge their artistic identities while remaining true to who they are as individuals and a group",
                            "score": 26,
                            "author": "miss-min"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I miss them together. Will they do any live for this festa? I know only 5 are present now but i miss them so much",
            "score": 31,
            "author": "Jklajihhwuygsootqang",
            "replies": [
                {
                    "level": 1,
                    "comment": "They’ve served long enough the military can give them back 😭",
                    "score": 48,
                    "author": "cloudedfalcons"
                },
                {
                    "level": 1,
                    "comment": "Namjoon will be at yeouido for bts festival. He will livestream a radio show there and jungkook will narrate bts firework at hangang(not sure if he will be present). Suga is touring, not sure what vmin schedule during this festa is but we only know taehyung will be having fanmeeting w siminvest.",
                    "score": 26,
                    "author": "zeno0_0"
                },
                {
                    "level": 1,
                    "comment": "there will be on bangtan tv on 13 June for live recording of take two..",
                    "score": 7,
                    "author": "Shookysquad93"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Suga is a very talented producer. The song is incredible",
            "score": 44,
            "author": "nagidrac"
        },
        {
            "level": 0,
            "comment": "A BTS song produced by Suga and El Capitxn? That’s perfection 🤩\n\nThey all sound so good 🥲🥲🥲\nI missed jin’s voice so much\n\nHappy anniversary BTS! \nLet’s have more happy years together🥳",
            "score": 44,
            "author": "misteryflower"
        },
        {
            "level": 0,
            "comment": "&gt;\"Will you stay?\"\n\nYou don't even have to ask. I'm here for life honestly 😭\n\nMan, this song and hearing them all together again is just very heartwarming. I just want it to be 2025 already",
            "score": 42,
            "author": "halateezia"
        },
        {
            "level": 0,
            "comment": "another suga x el capitxn success, such a production power couple…\n\nreally beautiful for festa, honouring all of the time we’ve spent together and our beautiful youth 💜 jin was the cherry on top with his parts — he sounds so ethereal — and it’s indescribably lovely to hear them all together!\n\nhappy festa armys! 🫂\n\nedit: rm posting on instagram he wrote the lyrics… he doesn’t even need to tell us sometimes. after 10 years, his poetry speaks very clearly to us. so grateful for him 💙💜",
            "score": 65,
            "author": "ghiblix",
            "replies": [
                {
                    "level": 1,
                    "comment": "The guitar sounds so pretty with the chorus. Very pretty euphoric vibes with JK opening. It got me soooo excited also for his solo. \n\nThe way the song sounds feels very hopeful and healing. Don’t know how else to describe it.",
                    "score": 24,
                    "author": "ParsnipExtension3861"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i miss bts so much i love this song",
            "score": 54,
            "author": "blocknugget"
        },
        {
            "level": 0,
            "comment": "Thank you BTS💜 I love it💜",
            "score": 40,
            "author": "pete_999"
        },
        {
            "level": 0,
            "comment": "Great song, hope there is a MV as well",
            "score": 35,
            "author": "Takagixu",
            "replies": [
                {
                    "level": 1,
                    "comment": "They released a fanchant guide, I don’t know what that means but there’s probably going to be some sort of content that they haven’t released yet.",
                    "score": 39,
                    "author": "cloudedfalcons",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’d say there’s a prerecorded live performance coming up as part of FESTA.",
                            "score": 25,
                            "author": "Extendableskeleton"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same🥺",
                    "score": 19,
                    "author": "Poirot19"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The perfect festa song … making us feel all those feels",
            "score": 40,
            "author": "cutenele1997"
        },
        {
            "level": 0,
            "comment": "I really like it, such a nice song to listen to!",
            "score": 23,
            "author": "purpletulip12"
        },
        {
            "level": 0,
            "comment": "I love this so much it's healing and so soft and comfortable to listen to and the lyrics 😭",
            "score": 25,
            "author": "Similar-Judgment4188"
        },
        {
            "level": 0,
            "comment": "What a beautiful song. I'll always be ARMY, and I'll always have love for all of them.",
            "score": 7,
            "author": "smileissweet39"
        },
        {
            "level": 0,
            "comment": "Love it so much. A very soothing and healing song. Vocal line sounds very sweet and intimidating. Rap line has a calmness and delivers a sense of reassurance. They nailed this one.",
            "score": 32,
            "author": "Soft-Ad8796"
        },
        {
            "level": 0,
            "comment": "\"Even the desert becomes a sea and we swim forever.\nEven the lonely whale, now singing together.\nBecause we’re together, it’s not scary even if we long for forever.\nBecause my trust is in you, my one and only reason.\" \n\n\nOh this broke me 💔💔\nBangtan, my forever 🩹🫶🏻",
            "score": 33,
            "author": "CrawlingWizard",
            "replies": [
                {
                    "level": 1,
                    "comment": "PLEASE add Sea to streaming services 😭😭",
                    "score": 8,
                    "author": "Particular-Yoghurt81"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Shut up!!! This is so pretty. That last chorus goes so hard, the song kind of reminds me of Light and Heartbeat. Man, I miss them so much.",
            "score": 39,
            "author": "Massive_Foundation37"
        },
        {
            "level": 0,
            "comment": "Love it!! 💜",
            "score": 19,
            "author": "Seventeenstranger"
        },
        {
            "level": 0,
            "comment": "They really did their thing here! Both the lyrics and the production are beautiful. Aaaah I can't wait for Chapter 3",
            "score": 19,
            "author": "milanumi"
        },
        {
            "level": 0,
            "comment": "I've missed them so much 😭😭😭",
            "score": 18,
            "author": "yourwinemom"
        },
        {
            "level": 0,
            "comment": "Love Love Love.\n\nGonna soak in it for a while and feel all the feels. 💜",
            "score": 30,
            "author": "alleybetwixt"
        },
        {
            "level": 0,
            "comment": "love love this .. I miss them &lt;3",
            "score": 27,
            "author": "magicshop_fun"
        },
        {
            "level": 0,
            "comment": "I  MISS THEM ![gif](emote|free_emotes_pack|sob)",
            "score": 27,
            "author": "txnvi_ii"
        },
        {
            "level": 0,
            "comment": "They sound so good. My heart is healing. The world is healing. APOBANGPO 💜💜",
            "score": 25,
            "author": "txnvi_ii"
        },
        {
            "level": 0,
            "comment": "This is so so beautiful! The melodies. The instruments, the way it feels so bright but is also more slow tempo and that last chorus! It is one of those songs that makes me feel so young and so alive. I love this",
            "score": 26,
            "author": "Ghetto_Leda99"
        },
        {
            "level": 0,
            "comment": "beautiful voices💜",
            "score": 15,
            "author": "taehyyungy"
        },
        {
            "level": 0,
            "comment": "They never, ever disappoint us. This is beautiful through and through.",
            "score": 31,
            "author": "angies6pack"
        },
        {
            "level": 0,
            "comment": "love how vocal line really shine specially Jin voice is my fav here \n\nSuga rap made my heart clench",
            "score": 15,
            "author": "Shookysquad93"
        },
        {
            "level": 0,
            "comment": "It’s so freaking prettttttyyyyyah \nMan I cannot wait for the translations! \nI saw someone say that this sounds like a song that would fit perfectly on the love yourself albums and I agree!!",
            "score": 24,
            "author": "JazzyG17"
        },
        {
            "level": 0,
            "comment": "I MISS THEM 😭😭😭",
            "score": 22,
            "author": "vampkise99"
        },
        {
            "level": 0,
            "comment": "I really love this, Now I heard their 7 voice.. love it while driving.. BTS ballad song is so magnificent 💜",
            "score": 22,
            "author": "Flaky-Cable-2995"
        },
        {
            "level": 0,
            "comment": "If suga’s on production I know I’m going to love it!",
            "score": 20,
            "author": "jiminescence"
        },
        {
            "level": 0,
            "comment": "Prod Suga. I can see it. Also why am I getting emotional",
            "score": 23,
            "author": "Confident_Yam_6386"
        },
        {
            "level": 0,
            "comment": "I love this. Their voices are in superb form. Well done!",
            "score": 5,
            "author": "CatastrophicCalming"
        },
        {
            "level": 0,
            "comment": "woooow really really like this so much. vocal and rap amazing as always and this more lively ballad really suits them. \n\nbut oh wow the production on this is so lovely. probably some of the best production on one of their group songs in recent years and definitely the best their vocals have sounded. like this has such little vocal processing (not saying it doesn’t but for a hybe song) i’m afraid the higher ups at hybe just didn’t notice. they sound so warm and lovely and the instrumental has some really great textures and space. yoongi and elcapitxn did a great job!",
            "score": 4,
            "author": "paleobrisse"
        },
        {
            "level": 0,
            "comment": "SCREAMING CRYING",
            "score": 19,
            "author": "ProudCalligrapher"
        },
        {
            "level": 0,
            "comment": "oh my gosh this is magical i loved it from first listen 😭  it's SOOO good I missed how hearing new music from them makes me feel. I missed OT7 so much &lt;/3",
            "score": 13,
            "author": "icarusadore"
        },
        {
            "level": 0,
            "comment": "I really missed their voices together 😭",
            "score": 12,
            "author": "SensitiveBluejay3292"
        },
        {
            "level": 0,
            "comment": "I properly cried when I listend to it the first times. Like tears rolling down my checks.     \nI miss them so much together and the lyrics?! Made to break my heart. I love everything about it.",
            "score": 13,
            "author": "Tatamashii"
        },
        {
            "level": 0,
            "comment": "This is such a BTS song. Enjoyed it very much",
            "score": 13,
            "author": "OceanDandelion"
        },
        {
            "level": 0,
            "comment": "Mannnn can't wait for 2025. Absolute summer Banger .\nReminds me of 2017 Bts .",
            "score": 13,
            "author": "RekZz11"
        },
        {
            "level": 0,
            "comment": "Omg nothing hits like OT7 bangtan, I miss hearing them together so much 😭💜 such a beautiful song, Suga x El Capitxn duo never fails.",
            "score": 9,
            "author": "oreo_kookies"
        },
        {
            "level": 0,
            "comment": "Listened to it today. Fills my heart. Miss their music together",
            "score": 10,
            "author": "Creepy_Area_6207"
        },
        {
            "level": 0,
            "comment": "This song is so good, and those harmonies, omg, I love it TT",
            "score": 14,
            "author": "Sayo33321"
        },
        {
            "level": 0,
            "comment": "I love it so much 😭💜",
            "score": 11,
            "author": "Hellinee"
        },
        {
            "level": 0,
            "comment": "I love tae voice so much is this song wow",
            "score": 9,
            "author": "Hellinee"
        },
        {
            "level": 0,
            "comment": "the song is so nice, I really liked it",
            "score": 12,
            "author": "PossibilityCorrect18"
        },
        {
            "level": 0,
            "comment": "snot running down my face, tears in my eyes. 🥹🥲😭\n\nmiss my 7 and what a 10 years it’s been!\n\nthank you bts for this lovely gift 💜 \n\n\nvocal line ate downnnnnn",
            "score": 11,
            "author": "mapofthesof"
        },
        {
            "level": 0,
            "comment": "I love this song so much!! Man, i cried a bit hearing them on this. It's just so beautiful, and their vocals are angelic. Taehyung and Jin especially sound incredible on this. And Namjoon's lyrics are making my heart ache. \n\nI miss OT7 so much, 2026 can't come soon enough for me",
            "score": 9,
            "author": "tafattsbarn"
        },
        {
            "level": 0,
            "comment": "their vocals sound amazing 🫶",
            "score": 9,
            "author": "xap4kop"
        },
        {
            "level": 0,
            "comment": "My favourite fan song? The harmonies are just so beautiful! Bangtan forever 💜",
            "score": 9,
            "author": "tamyshok95"
        },
        {
            "level": 0,
            "comment": "I like the solo songs but I can’t express the serotonin boost I get whenever I hear all 7 of their voices together. The song feels so calming like I’m home",
            "score": 5,
            "author": "Mine-is-Mine"
        },
        {
            "level": 0,
            "comment": "OMGGGGGGG",
            "score": 4,
            "author": "BoringResearcher3635"
        },
        {
            "level": 0,
            "comment": "time to weep",
            "score": 5,
            "author": "BoringResearcher3635"
        },
        {
            "level": 0,
            "comment": "The song is so beautiful this makes me cry 🥲🥹",
            "score": 2,
            "author": "Unknownusername43"
        },
        {
            "level": 0,
            "comment": "Wow, has it truly been ten whole years? Time flies! I'll always be rooting for their success even if I've stopped enjoying their newer music. Congrats on ten years guys!",
            "score": 5,
            "author": "dameasuga"
        },
        {
            "level": 0,
            "comment": "I really like the vocal parts a lot and I missed all 7 of them song a song so much. I really like their solo work for the most part but I always feel like there's something missing when I listen to the music. Their voices work better together. However for a song that's almost 4 minutes I was hoping the rap parts would be a little longer. It's alright tho. It's an anniversay song that I didn't even think we would get so I'll take anything",
            "score": 7,
            "author": "ruxi23"
        },
        {
            "level": 0,
            "comment": "I've been fairly critical of their recent output but this is so good!",
            "score": 3,
            "author": "Cub3h"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "At this point I feel like people comment this under BTS songs without even listening to them 💀 my first thought when I heard this was “thank god they got rid of that voice editing” because it distinctly isn’t there",
                    "score": 53,
                    "author": "WorldlyConsideration",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I’m starting to think they do this on purpose. This is not edited or vocal processed any more than songs from other kpop groups",
                            "score": 32,
                            "author": "somehardfeelings"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'm usually the first person to notice when they overprocess their vocals but I genuinely don't hear it here tbh! The vocals sound sharp and clean, but not overdone imo. However if you do hear compression, I recommend listening on Apple Music, as the sound quality tends to be the least compromised and it really makes a difference.",
                                    "score": 20,
                                    "author": "mars-ing"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "maybe its just you, but it doesn't sound at all over produced and over-compressed. It's pretty stripped back but to each their own.",
                    "score": 52,
                    "author": "Dihanie99",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The sound quality on Spotify wasn’t great for some people in the first hour (others had trouble even getting it to play) so it could be that?",
                            "score": 15,
                            "author": "cloudedfalcons",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It sounds really nice on Apple Music. Jin and V’s vocals do seem to be doubled in segments though.",
                                    "score": 10,
                                    "author": "Particular-Yoghurt81"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "See when you don't let Pdogg near BTS songs. No autotune. No over processing. 100% vocals serve. 100% organic",
            "score": -26,
            "author": "CamyReem",
            "replies": [
                {
                    "level": 1,
                    "comment": "come on Pdogg is great producer \nAll 7 of them love pdogg",
                    "score": 35,
                    "author": "Shookysquad93"
                },
                {
                    "level": 1,
                    "comment": "Pdogg hate is so force lol. You can hate/love his songs for whatever reason but he literally bts main producer, even for the songs that he dont make he still responsible as their recording engineer. He still hv a touch even for this song",
                    "score": 28,
                    "author": "zeno0_0"
                },
                {
                    "level": 1,
                    "comment": "idk why they’re booing you, you’re right",
                    "score": -9,
                    "author": "nagidrac",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I guess I don’t really understand the narrative that if pdogg is involved the song will be bad? he’s produced every single BTS title track. some of his work is bad some of it is good. if ppl hate him for the auto tune they still have to praise him for what he did on fake love or pied piper or whatever",
                            "score": 14,
                            "author": "AnneW08",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s not that I think the song will be bad. P-Dogg has produced some songs that I think are really good. But it’s a matter of if he’s using the production to compliment the skills of the guys. Sometimes he does and sometimes he doesn’t",
                                    "score": 1,
                                    "author": "nagidrac"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -21,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "To be honest, I think they did their typical rap split for vocal focused songs. The rappers get around the same time single verses than they split one verse amongst all three with each saying one line. YTC was much more rap forward I think.\n\nThus I think across the 3 of them they probably got around the same time and the vocalist got around the same time. \n\nI am glad they went with a long track though! The shorter songs have been such a struggle to fit everyone in!",
                    "score": 40,
                    "author": "Difficult_Deer6902",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -14,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They did just release YTC and Run BTS last year. I don't think they feel the need to hit a certain quota for each member, same reason they decided not to have a Jhope rap verse in Spring Day, they craft the song according to what it needs, not how many lines a member \"should\" have",
                                    "score": 29,
                                    "author": "moco-7",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I just realized I said they each get a verse &amp; than split verse…in Run BTS the vocal line basically repeated the same portion. It was just the first pair than the second. Which is a better example than spring day cause I did wish he had a verse \n\nI mean people got tk take this up with producer Suga lmao",
                                            "score": 6,
                                            "author": "Difficult_Deer6902"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": -10,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's what I meant. He did the backing vocals not because Big Hit spat in his face but because the group made the stylistic choice for the sake of the song. I loop JITB repeatedly, I'm looking at it from an artistic standpoint.",
                                                    "score": 9,
                                                    "author": "moco-7"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yep I see what you mean. I also think with Take Two the way Suga produced it he put a lot of space or breaths between the way the vocalist sing their pre-chorus so extending the vocal time overall.\n\nI did like how they didn’t do the traditional sope sandwich. After jhope went I was like where is Suga lol",
                                    "score": 12,
                                    "author": "Difficult_Deer6902",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "“Sope sandwich” 😂😂😂",
                                            "score": 1,
                                            "author": "MathsIsAPain"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -56,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 51,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -22,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 26,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 39,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -24,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 32,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": -2,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 12,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": -4,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 7,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": -5,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[removed]",
                                                                                    "score": 10,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[removed]",
                                                                                    "score": 8,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 32,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": -1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 5,
                                                    "author": "[deleted]"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 15,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 24,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -14,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 18,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": -5,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 11,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": 0,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 7,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -10,
            "author": "[deleted]"
        }
    ]
}