{
    "id": "14502dj",
    "score": 47,
    "title": "NMIXX - Episode 2: Seattle local market tour @ NICE TO MIXX YOU IN US (230609) [ENG SUB]",
    "author": "CronoDroid",
    "date": 1686301450.0,
    "url": "https://www.reddit.com/r/kpop/comments/14502dj",
    "media_urls": [
        "https://www.youtube.com/watch?v=jfYhfvE_xmw"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "It's always fun watching people play tourist somewhere I used to go on my lunch breaks. :) Reactions to the gum wall never get old. And I just about died at \"why are the we the only ones with an umbrella?\" Seattleites are just *like that,* okay.\n\n(As for the market proper, I still have a photo on my phone of one of the vegetable stalls where the vendor labeled their Brussels sprouts as \"little green balls of death.\" Still makes me laugh.)",
            "score": 11,
            "author": "pagerunner-j"
        },
        {
            "level": 0,
            "comment": "Was hoping they would try some of the clam chowder and Beecher’s Mac &amp; Cheese",
            "score": 3,
            "author": "likwidfuzion"
        },
        {
            "level": 0,
            "comment": "As a Seattlite they got the experience right, lol. Gum wall? Weird. Pike Place Market, pretty nice. Saw the first ever Starbucks but don't wait and go in? Smart. Seeing Seattlites not giving an F about rain and not using umbrellas? Authentic. Gas Works Park? A classic.\n\nMissed classics: watching the fish throwing. Going for a ferry ride. Getting salt water taffy and fudge on the pier. Having a homeless person beg for money.\n\nOverall, it's really cool to see content finally of Kpop groups I enjoy in my city. So far, a bit before COVID, then during COVID and now out of it, it's been your typical NYC, LA, TX, Japan and SK in vlogs and BTS vids. Seeing them in Seattle is cool. \n\nHaewon is hilarious, both when \"on\" and just chilling and making comments. I love her saying how she feels like a husband waiting for his wife while she shops. Then the classic husband-wife exchange of Lily asking if she should get dark or milk chocolate, Haewon gives her opinion, and then Lily says no it makes more sense to get the other. Typical GF/wife move to ask a this-or-that question they have already made a decision on. Haewon, like all men, then complains about her already knowing what she wants but asking anyways. Lol.",
            "score": 2,
            "author": "M3rc_Nate"
        }
    ]
}