{
    "id": "1451g2y",
    "score": 664,
    "title": "SEVENTEEN Mingyu with BTS Jungkook - Super (Dance Challenge) (230609)",
    "author": "Takagixu",
    "date": 1686306125.0,
    "url": "https://www.reddit.com/r/kpop/comments/1451g2y",
    "media_urls": [
        "https://www.youtube.com/watch?v=SgRbzaOQfGs"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "144p kings",
            "score": 253,
            "author": "tamyshok95",
            "replies": [
                {
                    "level": 1,
                    "comment": "😂😂😂",
                    "score": 20,
                    "author": "dramafan1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This kind of quality is what I would expect from Jungkook's first collab tiktok. It looks like they just grabbed a phone, ran to this place without informing any of the staff and shot this lmao.",
            "score": 313,
            "author": "Massive_Foundation37",
            "replies": [
                {
                    "level": 1,
                    "comment": "this is probably what happened lol\n\nthey said on WEVERSE that they didnt meet to film the challenge, but rather they met to hang out and thought they might as well film the challenge since theyve met. apparently mingyu was wearing slippers so he had to take them off and dance in socks lol, it was very \"on a whim\"",
                    "score": 149,
                    "author": "Cyd_arts",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Makes me wonder, are these K-pop idols contractually obligated to learn other groups dances, or are they simply incredibly fast at learning them?! Because if it was so on a whim how did he even learn it so well 🤣 \n\n(Yeah I know it was probably planned anyway they just decided to randomly film it but still)",
                            "score": 2,
                            "author": "aokaga",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "iirc he mentioned on his live of a few weeks ago that svt jun taught him the dance in the hybe gyms (or something like that) so he already knew it from that",
                                    "score": 7,
                                    "author": "Linarnaque"
                                },
                                {
                                    "level": 3,
                                    "comment": "They tend to learn quickly. Idols spend a lot of time learning choreo so they end up picking things up almost immediately and only need to fine tune things. A 30 or so second dance takes no time to learn.",
                                    "score": 5,
                                    "author": "markhorparkour"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "According to Mingyu’s post on weverse that’s exactly what happened 😂",
                    "score": 144,
                    "author": "breannabalaam"
                }
            ]
        },
        {
            "level": 0,
            "comment": "In my mind mingyu told jk it just a bbq date but suddenly he got pull to the corner to film a tiktok video w a nokia phone they found on the street",
            "score": 211,
            "author": "zeno0_0",
            "replies": [
                {
                    "level": 1,
                    "comment": "Pretty much confirmed on weverse ahahaha",
                    "score": 78,
                    "author": "tamyshok95",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "See i know jk only go out when he need his weekly bbq dose😂/j",
                            "score": 38,
                            "author": "zeno0_0",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "😂😂😂 on his bbq meat tour across korea",
                                    "score": 19,
                                    "author": "mooomoomaamaa"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jungkook’s like the rarest Pokémon.\n\nSightings of him are always showing in the form of worldwide trends. 😂\n\nEvery time he trends I know he’s opened another random live or in this case, for a tiktok(pleasant surprise!).",
            "score": 157,
            "author": "jaefan"
        },
        {
            "level": 0,
            "comment": "After all that pushing and pulling with jk mentioning this on his weverse live and singing seventeen songs, he finally did it 😭  I can barely see Mingyu's face in that low level light though... also him acting overly polite and dancing in his socks lol",
            "score": 90,
            "author": "ebi_tempura"
        },
        {
            "level": 0,
            "comment": "My old Blackberry has a better quality 🥲 but finally we got it !!!",
            "score": 58,
            "author": "Hellinee"
        },
        {
            "level": 0,
            "comment": "Ngl it's so nice, the little interaction since they're friends and them dancing, I enjoyed that. :)",
            "score": 55,
            "author": "Anaisot7"
        },
        {
            "level": 0,
            "comment": "97 line rock",
            "score": 30,
            "author": "Shookysquad93"
        },
        {
            "level": 0,
            "comment": "Finally! I was so happy when I watched Kookie sing Super...the whole song, even the rap parts!",
            "score": 38,
            "author": "ediphide"
        },
        {
            "level": 0,
            "comment": "Lmao there's so many levels of jank here.\n\n1.  The resolution is worse than the TI-83 calculator I used in high school.\n\n2.  They're apaprently in the boiler room of some factory.\n\n3.  The worst part is that Mingyu is just in socks.",
            "score": 37,
            "author": "Saucy_Totchie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yet this is still going to go viral way after Super's promotion and everyone will watch it on repeat. I love it.",
                    "score": 8,
                    "author": "PotassiumAlum",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The jank somehow adds even more charm to a video that contains both JK and Mingyu lol.  I'm all for it.  Fitting that JK's first real dance challenge video is lime this.",
                            "score": 2,
                            "author": "Saucy_Totchie"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "finally",
            "score": 26,
            "author": "paleobrisse"
        },
        {
            "level": 0,
            "comment": "love the 2nd gen kpop video quality here",
            "score": 15,
            "author": "pokodapa"
        },
        {
            "level": 0,
            "comment": "97 linerss💜",
            "score": 15,
            "author": "currypuffff"
        },
        {
            "level": 0,
            "comment": "Perfectionn",
            "score": 10,
            "author": "millucuty"
        },
        {
            "level": 0,
            "comment": "YAZZ",
            "score": 6,
            "author": "millucuty"
        },
        {
            "level": 0,
            "comment": "🥹🥹🥹🥹🥹🥹🥹🥹",
            "score": 7,
            "author": "Bidampira"
        },
        {
            "level": 0,
            "comment": "i prayed for times like this",
            "score": 4,
            "author": "psshdjndofnsjdkan"
        },
        {
            "level": 0,
            "comment": "why does mingyu not have shoes on wtf 😭",
            "score": 5,
            "author": "DancesWithNobody",
            "replies": [
                {
                    "level": 1,
                    "comment": "Someone said above that they explained on weverse that the decision to film was spontaneous and he only had slippers on, so he decided to take them off for the video and just stay in socks.",
                    "score": 2,
                    "author": "aokaga"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lmao , Legends",
            "score": 3,
            "author": "RekZz11"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just want to clarify there were actually no pandemic restrictions at the time! Social distancing was still recommended but the govt had just lifted all previous restrictions in light of low case numbers, just to put them back after the infection spike. I’m mostly saying this because, to this day, I see a lot of intl fans confused and spreading this story with an incorrect narrative.\n\nI understand people being disappointed still, but if I were, I’d also have to be disappointed in like 50%+ of my coworkers who also went out and enjoyed the nice weather and lack of restrictions in Seoul that weekend 😞 Sometimes it can be a little hard to explain how different things were in Korea through the pandemic compared to other countries.",
                    "score": 47,
                    "author": "goingtotheriver"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jungkook I MISS YOUUUUUU",
            "score": 1,
            "author": "hottytoddy098"
        }
    ]
}