{
    "id": "145psoz",
    "score": 140,
    "title": "ENHYPEN - 4th Mini Album 'DARK BLOOD' (Two Weeks Later)",
    "author": "tastetherainbeau",
    "date": 1686369322.0,
    "url": "https://www.reddit.com/r/kpop/comments/145psoz",
    "media_urls": [
        "https://www.reddit.com/r/kpop/comments/145psoz/enhypen_4th_mini_album_dark_blood_two_weeks_later/"
    ],
    "other_urls": [
        "https://preview.redd.it/qdmm32ckvc1b1.jpg?width=1400&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=af0ebf942a5f98ed150649825c72791cecc7d375)",
        "https://www.reddit.com/r/kpop/comments/13oldb2/enhypen_dark_blood_4th_mini_album/)",
        "https://vote.easypolls.net/6483f3f3b760c7005f0ae9bc)",
        "https://open.spotify.com/album/7q65W5gVANjh1j1KXLeU0f)",
        "https://music.apple.com/us/artist/enhypen/1541011620)",
        "https://music.youtube.com/playlist?list=OLAK5uy_nxvslOnYcEuHCoS4xwTADc-4NeeNWOmkk)",
        "https://www.youtube.com/watch?v=Qk7CLQ-_YRw)",
        "https://www.youtube.com/watch?v=wXFLzODIdUI&amp;pp=ygUHYml0ZSBtZQ%3D%3D)",
        "https://www.youtube.com/watch?v=4q3Et_jVrw0)",
        "https://www.youtube.com/watch?v=DqK8kBU8_wU)",
        "https://www.youtube.com/watch?v=DEMRUqox9qM)",
        "https://www.youtube.com/watch?v=XCE6q7xwyhY)",
        "https://www.youtube.com/watch?v=vyyxI1Gtk38)"
    ],
    "postText": "What are your thoughts on ENHYPEN's latest release now that you've had time to digest it?  What are the standout tracks?  How has your opinion changed since release?  What are your thoughts on the sales numbers and chart positions?  How did the release stack up to your expectations?\n\nThis post was not made exactly two weeks later, but all figures are as of two weeks later unless otherwise specified.\n\nI choose which albums to make Two Weeks Later posts based on level of engagement in the original album discussion thread. If you see I haven't covered a particular album and would like me to make a Two Weeks Later post for it, feel free to request it\n\n---\n\n###Overview\n\n |||\n:--- | :--- | :---\n**Artist** | ENHYPEN\n**Title** | [DARK BLOOD](https://preview.redd.it/qdmm32ckvc1b1.jpg?width=1400&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=af0ebf942a5f98ed150649825c72791cecc7d375)\n**Type** | 4th Mini Album\n**Released** | Monday, May 22, 2023\n\n&amp;nbsp;\n\n[Album Discussion Thread](https://www.reddit.com/r/kpop/comments/13oldb2/enhypen_dark_blood_4th_mini_album/)\n\n##[Poll: Which track is your favorite?](https://vote.easypolls.net/6483f3f3b760c7005f0ae9bc)\n\n---\n\n###Physical Sales\n\n Album Sales | Total |\n:--- | :---\nHanteo | 1,361,003\n\nCircle Chart|1st Week Rank|1st Week Count|2nd Week Rank|2nd Week Count\n|--|--|--|--|--\n|Album Chart|#1 Regular, #2 Weverse|1,517,574|#10 Weverse, #15 Regular|41,926\n|Retail Album Chart|#1 Regular, #2 Weverse|832,468|#3 Weverse, #5 Regular|60,984\n\n---\n\n###Digital Charts\n\n(N/A indicates song charted outside the available data. For streaming sites that means outside of the top 100)\n\n####01. Fate:\n\nCircle Chart | 1st Week Rank | 2nd Week Rank\n:--- | :--- | :--- | :--- | :---\n|Download| #48 | N/A\n\nDid not chart in top 100 of daily digital charts\n\nCharts | Peak Rank (Realtime)\n:--- | :--- | :--- | :---\nBugs| #16\n\n####**02. Bite Me:**\n\nCircle Chart | 1st Week Rank | 1st Week Count | 2nd Week Rank | 2nd Week Count\n:--- | :--- | :--- | :--- | :---\n|Digital| #66 |5,845,045| #198 |2,096,129\n|Download| #4 |-| #62 |-\n|BGM| #27 |-| N/A |-\n\nCharts | Peak Rank (Daily)\n:--- | :--- | :--- | :---\nBugs| #26\n\nCharts | Peak Rank (Realtime)\n:--- | :--- | :--- | :---\nGenie| #69\nBugs| #5\n\n####03. Sacrifice (Eat Me Up):\n\nCircle Chart | 1st Week Rank | 2nd Week Rank\n:--- | :--- | :--- | :--- | :---\n|Download| #69 | N/A\n\nCharts | Peak Rank (Daily)\n:--- | :--- | :--- | :---\nBugs| #93\n\nCharts | Peak Rank (Realtime)\n:--- | :--- | :--- | :---\nBugs| #21\n\n####04. Chaconne:\n\nCircle Chart | 1st Week Rank | 2nd Week Rank\n:--- | :--- | :--- | :--- | :---\n|Download| #41 | #155\n\nCharts | Peak Rank (Daily)\n:--- | :--- | :--- | :---\nBugs| #95\n\nCharts | Peak Rank (Realtime)\n:--- | :--- | :--- | :---\nBugs| #26\n\n####05. Bills:\n\nCircle Chart | 1st Week Rank | 2nd Week Rank\n:--- | :--- | :--- | :--- | :---\n|Download| #37 | #141\n\nCharts | Peak Rank (Daily)\n:--- | :--- | :--- | :---\nBugs| #83\n\nCharts | Peak Rank (Realtime)\n:--- | :--- | :--- | :---\nBugs| #8\n\n####06. Karma:\n\nCircle Chart | 1st Week Rank | 2nd Week Rank\n:--- | :--- | :--- | :--- | :---\n|Download| #40 | #194\n\nDid not chart in top 100 of daily digital charts\n\nCharts | Peak Rank (Realtime)\n:--- | :--- | :--- | :---\nBugs| #31\n\n&amp;nbsp;\n\n---\n\n###Album Credits &amp; Streaming\n\n####Listen on [Spotify](https://open.spotify.com/album/7q65W5gVANjh1j1KXLeU0f) / [Apple Music](https://music.apple.com/us/artist/enhypen/1541011620) / [YouTube Music](https://music.youtube.com/playlist?list=OLAK5uy_nxvslOnYcEuHCoS4xwTADc-4NeeNWOmkk)\n\nTrack | Lyrics / Composed / Arranged by\n---|---|----|----\n01. [Fate](https://www.youtube.com/watch?v=Qk7CLQ-_YRw) | Wonderkid, HYBE, CA$HCOW, Shin Koong, BredBeat, Kyler Niko, \"hitman\" bang, Jacob Aaron (THE HUB), Noerio (THE HUB), THE HUB 88\n02. [**Bite Me**](https://www.youtube.com/watch?v=wXFLzODIdUI&amp;pp=ygUHYml0ZSBtZQ%3D%3D) / [Audio](https://www.youtube.com/watch?v=4q3Et_jVrw0) | Cirkut, Jason Evigan, David Stewart, Lourdiz, Supreme Boi\n03. [Sacrifice (Eat Me Up)](https://www.youtube.com/watch?v=DqK8kBU8_wU) | Wonderkid, \"hitman\" bang, Andy Love, Cho Yoon Kyung, Alexander Karlsson, Matt Thomson, Max Lynedoch Graham, Yejune Synn (SNNNY), Kim Jae Won (Jam Factory), Deeno (SNNNY), Jeon Ji Eun, Josh McClleland, Ryan Lawrie, HERO (SNNNY)\n04. [Chaconne](https://www.youtube.com/watch?v=DEMRUqox9qM) | Elsa Curran, Tony Ferrari, Theo &amp; The Climb (Matthew Robert Crawford, Aaron Theodore Berton), 1월 8일, \"hitman\" bang\n05. [Bills](https://www.youtube.com/watch?v=XCE6q7xwyhY) | Tido Nguyen, Ryan Curtis, Sophie Hintze, Kim Soo Ji (lalala studio), \"hitman\" bang RUM (MUMW), YOUNG (MUMW), Shin Koong\n06. [Karma](https://www.youtube.com/watch?v=vyyxI1Gtk38) | Andy Love, Waveshower, \"hitman\" bang, 1월 8일\n\n&amp;nbsp;\n\n---\n\n####Information Sources:\n\n**Circle figures:** circlechart.co.kr     \n**Hanteo sales:** hanteochart.com     \n**Daily and realtime peaks:** 가이섬.com         \n**Two weeks later realtime graphs:** kpopchart.kr     \n**Album credits:** album discussion thread / Melon",
    "comments": [
        {
            "level": 0,
            "comment": "This album is freaking perfect, it’s a no skip from me and I wasn’t even listening to them before… (apart from the few popular songs)",
            "score": 40,
            "author": "kakbari"
        },
        {
            "level": 0,
            "comment": "Chaconne and Sacrifice still on loop 🎧 they’re sooo good",
            "score": 34,
            "author": "celyurin"
        },
        {
            "level": 0,
            "comment": "ITS YOU AND ME IN THIS WORLD",
            "score": 30,
            "author": "Mokn04",
            "replies": [
                {
                    "level": 1,
                    "comment": "OH MY OH MY GOD",
                    "score": 10,
                    "author": "Odd_Abbreviations429"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i honestly dont know why am i like this, but everytime i listen to Chaconne (especially after Sacrifice) i will MAGICALLY AUTOMATICALLY forgot how Sacrifice sounds like 😭 like you know, its MAGIC, i dont have a memory of hearing Sacrifice bcuz of Chaconne. its been 3 weeks already.. did anyone ever experienced this? i guess cuz both of the songs have similar vibes but Chaconne is more catchy than Sacrifice thats why i will always remember Chaconne first before Sacrifice. but the thing is i put Sacrifice no 1 favourite then Chaconne cuz i like how i can forget the song sounds like so i can play it many times 🤣 i feel like i'm having a mentally disorder bcuz i can choose a song to forget unpurposedly.",
            "score": 28,
            "author": "Geodude-Guru",
            "replies": [
                {
                    "level": 1,
                    "comment": "Omg I thought I was the only one who thought this. Kept forgetting what Sacrifice sounds like even after several listens but Chaconne was stuck in my head from first listen. Really like both songs but chaconne is exquisite.",
                    "score": 13,
                    "author": "SK720"
                },
                {
                    "level": 1,
                    "comment": "You might be on to something bc I was also telling a friend this the other day when we were walking and listening to the album. After listening to Chaconne we couldn’t remember what Sacrifice sounded like at all until we finally played it. And it’s been happening to me since the album came out lmao I can think of all the songs in my head but once I listen to Chaconne I can’t remember what Sacrifice sounds like!",
                    "score": 2,
                    "author": "caretaeking",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Omg glad im not the only one but its weird. I already streaming Sacrifice hardly, with the mv, relay dance, live performance, then spotify. But once i listened to Chaconne, the hardwork became useless cuz i still forgot the sound. Or is this some conspiracy.. cuz Chaconne is actually a song about Dancing the \"Dance of Death\". Its related to d- what if its a curse song.. its making you fell deep into the song like you're in another dimension and its hard to get back to reality at the end smth like that 👀",
                            "score": 1,
                            "author": "Geodude-Guru"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Someone please free me from Chaconne l’m obsessed 😭",
            "score": 28,
            "author": "vanivaninilla"
        },
        {
            "level": 0,
            "comment": "Honestly a really good album, I came across many of the songs while doing random shuffle playlists and I found myself repeating the songs. They really surprised me I have to start listening to Enhypen more. Chaconne, Bills and Bite me so far my favorites.",
            "score": 23,
            "author": "ikz08"
        },
        {
            "level": 0,
            "comment": "absolute fucking gold of an album",
            "score": 21,
            "author": "Jargonal"
        },
        {
            "level": 0,
            "comment": "This album exceeded all my expectations. I have had this album on REPEAT since it came out. I definitely listen to it at least once a day. I’ve been an enhypen fan for almost 2 years, &amp; I consider them to be one of my favorite groups but this album cemented their place. It might be my favorite release this year besides Ay-Yo by NCT 127. Every song is amazing &amp; I have absolutely nothing negative to say when normally there’s one on any artist’s album that I’m not a big fan of. I cannot say that about Dark Blood. If you haven’t heard it PLEASE check it out!!!",
            "score": 19,
            "author": "survivorcagayan"
        },
        {
            "level": 0,
            "comment": "I think this album really allowed them to come into their own as artists, overall its an amazing piece of work. Also really cool they got to work with such big names. Personally Bills and Chaconne are my favorite tracks. They really showed off their vocal chops here and it seems like they are just getting better with time.",
            "score": 50,
            "author": "themoonchildxx"
        },
        {
            "level": 0,
            "comment": "Still love the album, on constant rotation, may have replaced dimension:dilemma as my favourite Enhypen album. \n\nLove Sacrifice and Bills as much as during the first listen (and the live performances have been amazing  so far). \n\nBiggest growers: \nBite Me &gt; The chanty part grew on me a lot though still wish the song was a bit longer. The first verse might just be my favourite part of any song ever.\nChaconne &gt; didn't like it much based on the preview but it's so addicting, especially the chorus.\n\nKarma moved down a bit, because I wished the chorus was a bit more hard-hitting and I don't like the fake audience sounds during the bridge. Still really enjoy the song though.\n\nFate is my favourite enha intro so far, both the song and the narration is very immersive.",
            "score": 16,
            "author": "SaltyPoppy"
        },
        {
            "level": 0,
            "comment": "Can’t deny hybe’s producing talent! Bills and sacrifice are my favs but bite me is a solid song as well",
            "score": 15,
            "author": "aebeol"
        },
        {
            "level": 0,
            "comment": "The sacrifice mv is everything to me, this album has somehow gotten even BETTER over time!",
            "score": 46,
            "author": "kep1ian713"
        },
        {
            "level": 0,
            "comment": "Bite Me is indeed one of my favorite songs of the year &lt;3",
            "score": 48,
            "author": "sungjongie"
        },
        {
            "level": 0,
            "comment": "With this comeback they’ve earned a spot in my top boy groups of all time. Yes it’s that good, yes they’re that talented and always have been, and in this comeback they showed consistency and growth. I hope they see a lot of success going forward.",
            "score": 42,
            "author": "Extension_Wave_5370"
        },
        {
            "level": 0,
            "comment": "1. Bills, Sacrifice, Chaconne, Fate, Karma\n2. Bite Me\n\nEvery time I listen to Bite Me I get slapped with a seriously good song and also with the reality of how short it is. I really wish Fate and Bite Me were actually full songs, especially Fate as that just ultimately kills me every time I listen to it.\n\nSacrifice MV was top tier. My favorite from them aesthetic wise thus far bar G-T.\n\nI also feel like every member's vocals reached a new high for me. Heeseung especially never fails to impress me.\n\nThis has become my favorite Enhypen album along with Dimension: Dilemma. I'm glad they went back to their vampire roots.",
            "score": 39,
            "author": "JenyRobot"
        },
        {
            "level": 0,
            "comment": "It’s just such a good album. I also will never forgive Belift and the producers for no bridge in Bite Me but I’ve grown to love the talk rap and the main chorus never ceases to hit. Sacrifice is also SO GOOD and of course the choreography elevates it. Bills and Chaconne kind of fighting for my fave song of the album but they’re just too good. Karma doesn’t measure up to Shout out imo but still pretty amazing. \n\nYou can really feel how cohesive the album is and also the influence and experience that the members have gained throughout their journey. Sosososososo proud of them and they never let me down musically.💕",
            "score": 60,
            "author": "isolilili"
        },
        {
            "level": 0,
            "comment": "the album is phenomenal",
            "score": 37,
            "author": "Werefie"
        },
        {
            "level": 0,
            "comment": "I’ve been listening to this album at least once a day with no skips! I love all the songs and enjoy the dark vibe🧛‍♀️",
            "score": 12,
            "author": "Kpoopfan"
        },
        {
            "level": 0,
            "comment": "Wasn’t really an Enhypen fan except for some title tracks but this album changed that. Have it on repeat it’s so damn good. Fate really sets the tone and I agree Karma isn’t my fav but it’s ok. Love the concept and so nice to find a no skip fab album!",
            "score": 10,
            "author": "SaltyWaterfall"
        },
        {
            "level": 0,
            "comment": "1. Sacrifice \n2. Fate\n3. Bite me\n4. Chaconne\n5. Karma\n6. Bills",
            "score": 9,
            "author": "sanali_kisara"
        },
        {
            "level": 0,
            "comment": "bills is still that girl",
            "score": 8,
            "author": "vampkise99"
        },
        {
            "level": 0,
            "comment": "Chaconne is such a good song \n\nWish it got at least a dance practice video",
            "score": 22,
            "author": "MelissaWebb"
        },
        {
            "level": 0,
            "comment": "I still can't pick a favorite song. Most times I think it's Bills, but then i listen to Chaconne or Sacrifice and change my mind all the time. But I think in the long run it will be Bills, its the perfect song to blast in the car on a road trip, just like post Malone Circles (interesting, both are about break-up lol). \n\nThe choreo made sacrifice even better, i'm still hopping for a Chaconne choreo (and I think we will get it). Also, just another day of me wanting an enhypen's intro/outro to be a full song. I agree with some that Karma isn't their best rock song, but still a good song. Pretty solid album, I liked way better than the last one.",
            "score": 5,
            "author": "bellamollen"
        },
        {
            "level": 0,
            "comment": "i love love love the comeback, it brought me back to enhypen which is very impressive as i’ve never once returned to being a fan of a group i hyperfixated on for 2 weeks. still bothered that bite me doesn’t have a bridge; i’ll probably never get over it—otherwise it’s a solid track. chaconne is probably my favorite song off the album. sacrifice is my 2nd favorite, i really didn’t like the MV tho :/",
            "score": 28,
            "author": "buddingwormwood"
        },
        {
            "level": 0,
            "comment": "\nThe album is their most cohesive so far and most songs have grown on me. However Bite Me pains me too much to listen to it more than once in a while because of how much wasted potential it has. However, Chaccone and sacrifice in particular have really grown on me. Bills is still my favorite of the album while unexpectedly, I dislike Karma more now compared to before when it was my my second favorite song of the album, I guess it is because re listening to their other rock songs like attention please and shout out, I think Karma is inferior to both so yea. \n\nOver all I actually think this might be their weakest or one of their weaker albums. I ended up liking it more than I was predicting but still I think particularly production-wise the album held back and could have been stronger. And yes fate should have been a full song. \n\nAlso me saying it is one of their weaker albums isn't really a bad thing because Enhypen have yet to release any mid or weak albums lol this album is still quite good in the grand scheme of things but I know in my heart it could have been better.",
            "score": 4,
            "author": "I_LAND_EGG"
        },
        {
            "level": 0,
            "comment": "I loved Bite Me instantly but I'm uncomfortable with such a sexy concept on a group with a minor still. I wish they had released it later instead when the whole group are adults.",
            "score": 4,
            "author": "wehwuxian"
        }
    ]
}