{
    "id": "146wc8p",
    "score": 833,
    "title": "YG Shares Update On BLACKPINK’s Jennie’s Health After She Leaves Stage During Concert",
    "author": "smileshima",
    "date": 1686496190.0,
    "url": "https://www.reddit.com/r/kpop/comments/146wc8p",
    "media_urls": [
        "https://www.soompi.com/article/1593062wpp/yg-shares-update-on-blackpinks-jennies-health-after-she-leaves-stage-during-concert"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "From the minute she came on, you could tell she was trying but I felt she wasn’t going to last. She RAN off about four songs in. ☹️ Hope she recovers soon! Poor Jisoo, now Jennie!",
            "score": 463,
            "author": "tookachonce"
        },
        {
            "level": 0,
            "comment": "Apparently she was throwing up all day and was given an IV to rehydrate before going on stage. It’s crazy she went on at all. \n\nTheir schedules have been so packed, like 50+ shows must be exhausting in itself and then to be constantly flying across the globe for solo and group schedules? They said their last tour was really hard on their mental and physical health, and this tour has been so much bigger and busier. I hope they have a good team of professionals there to help them stay strong, hydrated and healthy.",
            "score": 662,
            "author": "sunmi_siren",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have an immense fear of throwing up and for this reason, I could not be an idol lol. I know it seems like such a small 'issue' to let get in the way of your dreams but I could not enjoy being a singer or dancer if 90% of the time, it was under the condition that you're so tired and run down, and ill quite often. And as soon as your better, your schedule is just as packed and you have to go and face it all again",
                    "score": 139,
                    "author": "teukkichu",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I have never seen an idol throwing up on stage. I always wondered why, or how...",
                            "score": 54,
                            "author": "Amstrad_SSS",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, they must just power through it enough to get off stage in time. Because sometimes in behind the scenes content, idols are literally shaking and almost hyperventilating after a performance, from how hard they just worked. I feel like there's no way some of them don't heave from that let alone vomit.\n\nI know there's many videos of idols fainting on stage. Also a video of TWICE Dahyun before a concert where she is literally grey, about to be ill, and EXO Chanyeol throwing up by the stage. Props to them for powering through",
                                    "score": 89,
                                    "author": "teukkichu"
                                },
                                {
                                    "level": 3,
                                    "comment": "I guess it’s a combination of just powering through it and avoiding eating right before a show. Still, I think AOA Seolhyun and SNSD Yoona have had a close call.",
                                    "score": 28,
                                    "author": "azure_atmosphere",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I really don’t think they eat enough when their prompting in any way to puke. The industry drastically needs to change.",
                                            "score": 4,
                                            "author": "trophywaifuvalentine",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The industry won’t change. The formula for $$$ is in their favor. Like many pop stars before them, one by one they will tap out. Whatever they are giving her is not a proper remedy. She’ll be gone before she hits 30 and her management will already be on to the younger hotter version as her replacement.",
                                                    "score": 1,
                                                    "author": "OLightning"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Not kpop but there's a video of Justin Bieber vomiting on stage cause he was intoxicated or sick.\n\n\nStill feel really bad about it",
                                    "score": 11,
                                    "author": "Unlikely-Repair-3819"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "it's crazy how one small fear can hinder your life. I have a fear of vomiting too, and I can't even exercise because I'm scared I might start dry heaving from over-exertion or something. it's crippling :(",
                            "score": 1,
                            "author": "throwaway_afterusage"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Maybe that's the reason why she doesn't dance much powerful, she's been trying to hold those pain in her. Man she's really going through all of it so hard. I wish people can stop insulting Jennie as \"lazy dancer\" at this point and consider this since she's been enduring the pain very much and it took a toll of her due to her solo and group schedules. People seriously going too hard on her and still calling her lazy dancer, that's cruel really.",
                    "score": 40,
                    "author": "twisted_egghead89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I know what you're saying but it's kind of messed up that we are giving props to them for powering through. And I'm imagining a scenario where an idol **did** throw up on stage - why do I feel like this would cause a scandal based on unseemly behavior and the idol would then have to issue an apology? It's crazy how dysfunctional this industry is...",
                            "score": 89,
                            "author": "lnmzq",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well if that ever happens to Jennie just because she throwing up on stage, that will show up how fucked up the fandom culture has become and even this industry. It feels like K-Pop fans can't be able to understand her situation and just make up bullshit like \"SHE MISBEHAVE!\" and insulting her in cruel way. Fuck man i hate these people. It feels like fans have a toxic love relationship with idols a little bit too much just to enforce their ego and fantasies on them and they become nothing more than labors of their toxic dreams.",
                                    "score": -1,
                                    "author": "twisted_egghead89"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "they’ve been touring nonstop since October, the only break they had was in Feb and they used it for Coachella rehearsals. They really need to rest",
            "score": 653,
            "author": "coconuts19_",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am shocked that this tour is still going on. There’s a lot of demand but this has got to be one of the longest consecutive kpop tours I’ve seen",
                    "score": 421,
                    "author": "absurdsuburb",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep. Almost exactly the length of the BIGBANG - MADE tour. (Only off by a single day it seems)\n\nThey really go big or go home in YG.",
                            "score": 238,
                            "author": "capslock",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 95,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "BP will get to rest after this tour unlike BB. BB toured probably 200+ days a year from 2014 to 2017, especially GD, Taeyang, and Daesung.",
                                            "score": 60,
                                            "author": "Season-Euphoric"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Dang so true. 🥲",
                                            "score": 17,
                                            "author": "capslock"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Makes me think of a variety show segment where Taeyang was like his body feels like an old man due to the toll touring does to his body. 😭",
                                    "score": 38,
                                    "author": "dramafan1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He did mention that he wants everyone to wear pajamas to his concerts from now on because its the most comfy. lolollol",
                                            "score": 21,
                                            "author": "capslock",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "😂😂😂",
                                                    "score": 1,
                                                    "author": "dramafan1"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I swear i saw the announcement of an encore concert as in saying farewell to the tour *months ago*",
                            "score": 81,
                            "author": "San7129"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah, I assumed Jisoo's solo marked the end of their tour or something, but nope, I guess she just promoted it in between stops, which is...insane to me. She was preparing for her solo debut as she was doing a tour, so she was also probably preparing the performance for it on tour too, but keeping it under wraps?\n\nAnd they're still going strong on this tour. Like, they announced encore dates in the US, which I assume they're not even close to the dates yet.",
                            "score": 64,
                            "author": "Pandafy"
                        },
                        {
                            "level": 2,
                            "comment": "I think YG adding those encore shows taking place this summer definitely might be too much as well.",
                            "score": 12,
                            "author": "dramafan1"
                        },
                        {
                            "level": 2,
                            "comment": "and there's still rumors that they want to add shows in India and Brazil...I hope this is the what the girls really want. In the end, we just want them to be happy.",
                            "score": 9,
                            "author": "GreenTeaRex007"
                        },
                        {
                            "level": 2,
                            "comment": "i legit can’t believe they’re still touring after this long. feels like it’s been a year",
                            "score": 40,
                            "author": "yuri_mirae",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It will literally be ending at a duration of 10 months on August 26th. They started October 22nd. Crazy.",
                                    "score": 7,
                                    "author": "Comfortable_Visual_4",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "that’s insaneeeee",
                                            "score": 1,
                                            "author": "yuri_mirae"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "This is what western singers do though",
                                    "score": 33,
                                    "author": "Season-Euphoric",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "yea and a lot of western singers are choosing to stop touring permanently because of the burnout (See: Miley Cyrus and Justin Bieber)",
                                            "score": 34,
                                            "author": "absurdsuburb"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Most have a decent break in between legs tho. Not sure if this is the case with Bp but with the way people are describing it doesn’t sound like that’s the case. A lot of western also don’t have much choreo if any, so someone like Taylor swift for ex can probably take shorter breaks too",
                                            "score": 59,
                                            "author": "Relevant_Compote_818",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This tour is 62 dates over 316 days, for an average performance every 5.09 days.\n\nFor comparison, some recent long pop tours:\n\n* Dua Lipa - Future Nostalgia Tour – 82 dates over 293 days (3.57)\n* Harry Styles - Love on Tour – 169 dates over 687 days (4.06 - with extended residencies in one location)\n* Daddy Yankee - La Última Vuelta World Tour – 86 dates over 160 days (1.86)\n* Taylor Swift - The Eras Tour – 61 dates over 255 days (4.16)\n* Coldplay - Music of the Spheres Tour – 123 dates over 615 days (5)",
                                                    "score": 49,
                                                    "author": "yunglethe",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah but it’s not about averages, its about how much time they have in between legs. A lot of tours will have most shows show every day or every other day within the same leg, &amp; then a month or 2 between legs. As far as maintaining your physical health that’s a lot better than having a show every 4-5 days but being practically continuous.\n\nIdk the stats for those artists you mentioned but Ik there have been some other kpop groups that have also been on tour for a while, either the same one or multiple tours back to back. But they do the 1st approach so it seems to be working for them fine in terms of physical health",
                                                            "score": 35,
                                                            "author": "Relevant_Compote_818",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The average is a decent tool for off-the-cuff comparisons across different artists/tours.\n\nJust looking through the dates... (don't shoot me if I missed something)\n\nBP biggest breaks were 10 days in October, 15 days around Christmas/New Years, the month of February, most of April, and around 50 days upcoming with just one date in the middle of that break.\n\nDua Lipa's biggest breaks were 15 days in April, most of July, just two dates in August, and October.\n\nHarry Styles had a break from November 2021 to June 2022 (he released a new album in May 2022), 20 days around Christmas/New Years, and the month of April. From August to November he did 39 dates at 4 venues in the US.\n\nDaddy Yankee did not appear to take any significant break (5+ days).\n\nTaylor Swift will be taking September and October off before she does the last 6 stops of the tour. The other 55 dates did not appear to take any significant breaks (5+ days). Her tour appears to be two/three dates in the same venue back-to-back on weekends, then going to another venue the next weekend, rinse and repeat.\n\nColdplay took most of April, half of June, 15 days July/August, 15 days August/September, most of October, break from November to March, April and most of May, 15 days in June, August, and October. A lot of their later leg dates were 2-5 dates at one venue.",
                                                                    "score": 18,
                                                                    "author": "yunglethe"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "To be fair, most western artists don't also incorporate strenuous choreo. Outside of acts like Beyonce or Bruno Mars, who would be doing that?",
                                                            "score": 11,
                                                            "author": "MeijiDoom"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "They did have February off. And there's breaks here and there. They don't have to attend every fashion event either. Its how much one chooses to do.",
                                                    "score": 2,
                                                    "author": "Season-Euphoric",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "They probably do have to go to fashion shows tho. They don’t get ambassadorships for nothing",
                                                            "score": 21,
                                                            "author": "placenta_resenter",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They don't have to go to EVERY ONE. Like Jennie  could have rested instead of going to Japan Chanel show. Or she could have rested instead of flying long haul to Paris for fun when she was going to go to Cannes the following week for The Idol. \n\nThese are choices made.",
                                                                    "score": 6,
                                                                    "author": "Season-Euphoric",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The France sched was for a campaign with Chanel. We knew she was in Paris because her makeup artist hinted about it. \n\nI know some choices that they made are personal. She also came back on the day of the concert from Nice. And yeah, she chose that to spend time with someone with both of them, knowing they won't be seeing each other for the next 2 weeks.",
                                                                            "score": 10,
                                                                            "author": "GroundbreakingAd8341"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You can’t really say that without seeing the contracts, but I would be surprised if there’s a “but only when Jennie feels like it” provision in there",
                                                                            "score": 9,
                                                                            "author": "placenta_resenter"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yet people complain about how the concert length is only about 1.5-2 hours.. It seems kind of insensitive to me that some kpop fans demand 3 hour long concerts and multiple stops on every continent. They're human beings and touring takes a serious toll on mental and physical health",
                            "score": 28,
                            "author": "pastaconpesto420",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well it's not that they're insensitive, they enslave themselves in their consumptive behavior and that made them wanting more more and more like they're not even feeling enough or grateful enough to having anything or time that they get.",
                                    "score": 3,
                                    "author": "twisted_egghead89",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "it would be fine if the concert wasn't so abhorrently expensive tbh",
                                            "score": 10,
                                            "author": "fearu-kun"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don't think the touring is so much the issue because they have about a 6 day break in between locations. I think it's more so the brand events they gotta attend in between. If only YG allowed them to focus on the tour until they can all get healthy again and get the much needed rest in between.",
                    "score": 16,
                    "author": "GreenTeaRex007"
                },
                {
                    "level": 1,
                    "comment": "Is there much of the tour left?",
                    "score": 2,
                    "author": "azure_atmosphere",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A little over two months left. It ends August 26th",
                            "score": 2,
                            "author": "Comfortable_Visual_4"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 0,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "where did you get that she has a virus?. They’ve seen with bandages on the ankles multiple times, Jennie had her shoulder wrapped in May and during Chanel’s event in Tokyo last week her manager told the photographers she couldn’t wave too much for photos because she was injured, and Lisa has been complaining about neck pain since Barcelona’s spot which was in December. And ofc no need to mention the constant travel every week, adapting to different climates, latitudes, time zones etc… So yea they need a rest",
                            "score": 14,
                            "author": "coconuts19_"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "She has been busy after Coachella. Travelling from a  continent to another continent. She then arrives exactly the day, a few hours before their soundcheck would start. \n\nMexico Concert - Met Gala - Seoul - Singapore Concert - France - Macau Concert - Cannes - Thai Encore - Seoul - Japan - Seoul - Melbourne\n\nJetlag, difference in weather. The SEA leg of their tour happened during the hellish heat wave. Amd they did the tour in open spaces. This is bound to happen.",
            "score": 365,
            "author": "GroundbreakingAd8341",
            "replies": [
                {
                    "level": 1,
                    "comment": "damn looking at that i would 100% have a mental breakdown if it were me. props to her for even trying",
                    "score": 160,
                    "author": "yuri_mirae",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The flights alone would make me collapse, never mind all the social events she had to attend *and* the intense kpop performances",
                            "score": 23,
                            "author": "Some_Emergency_7325"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah she’s gone from summer in Seoul to dreary winter in Melbourne",
                    "score": 4,
                    "author": "thelunchroom"
                },
                {
                    "level": 1,
                    "comment": "and also some backlash from haters by being in The Idol.",
                    "score": 44,
                    "author": "phamdeptrai",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I honestly can’t imagine a healthy way to deal with the amount of hate she receives.",
                            "score": 25,
                            "author": "Horror_Flower_"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "hope she rests well and feels better soon!!",
            "score": 135,
            "author": "believedinme"
        },
        {
            "level": 0,
            "comment": "Touring seems brutal on both mind and body, kudos to all artists tbh. Hope she heals quickly!",
            "score": 77,
            "author": "Adventurous_Can2398"
        },
        {
            "level": 0,
            "comment": "They are overworked brutal right now, especially with traveling across the world basically several times a week. This was sadly bound to happen and I hope she'll get time to rest.",
            "score": 165,
            "author": "niclaswwe"
        },
        {
            "level": 0,
            "comment": "Get well soon Jennie!!! Take care!!!",
            "score": 75,
            "author": "pete_999"
        },
        {
            "level": 0,
            "comment": "I hope she gets better. Fans noticed a bandaid most likely covering where an IV was put in her. Im sure she wanted to continue for the fans but her health is whats most important!",
            "score": 51,
            "author": "shenandoahvales"
        },
        {
            "level": 0,
            "comment": "Get well soon Jennie! We love you! That long tour and the other endeavours in between are brutal for their health but they have been taking it like champs to meet and make  the fans happy 🥺💖 hope they can rest more in between travelling at least!!",
            "score": 69,
            "author": "SapphireHeaven"
        },
        {
            "level": 0,
            "comment": "I'm not all onboard the they are overworked and what not train but it's wild to see Kpop company after Kpop company run their talent hard until they break and then are forced to be without them for weeks if not months. Why not schedule in breaks that help keep your talent healthy and avoiding burnout so they can perform the entire time?\n\nMaybe it wouldn't have changed anything but would it have really killed YG when they were planning the tour to add breaks and not fill them with other gigs but instead make them R&amp;R only? A week break in Australia after landing before their first performance there would seem smart, especially considering how personal the location is to two members.\n\nedit: \n\nReading a comment that in detailing how busy they are mentioned 'The Idol' and it really got me thinking, how much are fans (specifically BP stans) taking away the members agency by just assuming they are slaves with no say to what YG/TBL puts in their schedule. Do you think Jennie was forced to do 'The Idol'? Was it not her decision to get into acting, take that gig, and she knew she'd be adding all that extra work during her world tour of promoting the show? Same thing with Cannes. Those are things it seems highly likely Jennie chose for herself. \n\nI just think people don't realize how hard these artists push themselves. They are A-type personalities who are workaholics with dreams of building an empire and so they fill their own schedule and are deathly afraid of taking time off, missing opportunities and losing ground in the \"rat race\" they are running. \n\nThe only thing we hear for sure which is true is that most idols do ask, even in content in front of their public, for vacations. Even young groups like LE SSERAFIM, IVE and others have said since debut they haven't had an actual vacation or a single break (and things like that) and that's depressing and asking for trouble. I am all in favor of giving the talent R&amp;R breaks. I just don't assume, especially with the top groups (BP, TWICE, BTS, etc) that they have no voice and power to prevent their schedules from getting insanely packed. If BP is about to or already has signed their next contract, they should be at their most powerful in terms of their voices carrying weight. BP prints money and so the talent should be able to negotiate quite the pro-artist terms for themselves. \"No extended world tours without R&amp;R breaks of 3 days or more every \\_\\_\\_ amount of cities\" or something like that.",
            "score": 138,
            "author": "M3rc_Nate",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly agreed, it just seems to be the kpop standard so artists agree to it despite knowing that it’s difficult. In Jin’s Suchwita episode he talked about how in 2018 BTS only got a day and a half off each month that year and that was why the considered disbanding and quitting bc it was so mentally and physically taxing, but Suga went on to explain that it was their company, BigHit, pushing them bc they told them that’s that they had to do bc of all the recognition they were receiving in 2018. Suga even said that they knew their company was right but it was still hard. \n\nSomething in the industry needs to change, being overworked to maintain a certain image and status shouldn’t be the standard. With a group like BP, I think they are well ok as they are if they took a little break in between schedules. Reading about how much they flew in between their concerts for solo schedules is insane. No wonder Jennie couldn’t take it. Of course it’s going to catch up to her body, this is sad. It feels like everyday there’s more news about how an idol needs to take a rest bc their health isn’t doing well.",
                    "score": 41,
                    "author": "theofficialguac",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree. People always say \"but how do we know the artists didn't CHOOSE to do this much work\" and, firstly I'm sorry to say but you have to look at the history of how kpop companies treat their talent and think how likely it is they are given any kind of chocie at all. But even if the company does say \"are you sure you want to perform\", if they are part of a system where working yourself to the point of illness is not only the norm but also expected as a way to show you are grateful for your success, how can they really make a choice to say they want to not go to an event or sit out a show? And it's not just coming from the companies - every time an idol does perform sick or injured, they always get praised by the fans (both Korean and international) saying \"they went on stage even though they weren't well, they care about their fanbase so much!\" In that environment, even if the company isn't actively pressuring them, there is still a ton of background pressure to go on stage. \n\nAlso almost all these artists are in their teens or early 20s. I think the companies have a responsibility at some point to tell them to take a break even if they don't want to. That's part of responsible management.",
                            "score": 29,
                            "author": "_cornflake"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Why do so many companies overwork their employees until burnout and they have to do hears without them or they quit? Capitalism gonna capitalism",
                    "score": 43,
                    "author": "lavmal",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When the employees are just replaceable pawns I get it (disagree with it but I at least understand the heartless logic) but when they are artists who you have big investments in and want them to sign a new contract with you or something, I don't really get it. \n\nMaybe the companies don't care because even YG would think \"The tickets are already sold, it's not like Jennie being out loses us anything. All the fans will still attend and just watch the 3 members. All while Jennie gets healthy behind the scenes\"... and it's true, rather than extend the tour (which costs money) by adding in R&amp;R mini vacation times, they can burnout their talent and one of them has to leave the group to get healthy and miss time but it costs them nothing. So the company is happy with the option that doesn't cost them money, I'd imagine.",
                            "score": 20,
                            "author": "M3rc_Nate",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But kpop companies have a history of seeing their artists as disposable pawns because they can just debut new groups. And for the big companies in particular this strategy has worked historically.",
                                    "score": 19,
                                    "author": "_cornflake",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "YG isn't just throwing BP away, aka the members have little to no leverage, just because they've got BabyMonster. BP just made $200m+ on one world tour. If anything the industry probably has instilled fear in the idols and made it so even the most powerful with the most leverage don't know how much leverage they really have. Just like how the SM idols didn't know they could request to see their data and the company refused, even though it's their contractual right. \n\nNo company operating in its right mind, beholden to investors/shareholders, is throwing away a TWICE or BP type earner (tens if not hundreds of millions of dollars) because they started to demand vacations, less work, a more artist friendly schedule/tour or the like. Especially if the demands are part of negotiating for a new contract. We aren't talking some mid level group who makes decent money, and it's not like BabyMonster or ITZY are/will perform so strongly that it's easy to just throw away tens to hundreds of millions of dollars (TWICE, BP). MAYBE if JYPE's NMIXX was New jeans and TWICE in contract negotiations was being super hardcore, they'd say screw it and just not re-sign them. But even then is it worth damaging your brand (TWICE are iconic and like JYP's daughters, his biggest legacy)? It's not like TWICE with hardcore artist friendly contracts would not still be bringing in a nice profit. \n\nSo I just don't really buy it. Sure, some companies have gone full insane. Some companies have made wild decisions and blown up groups where they were hot and making money. But the industry exists in a different era now. It's global which means more shareholders/investors than ever, including multi billion dollar powerhouse companies and all with eyes of going global as music labels. Like HYBE wanting to compete with the big 4 globally. Can't be acting like amateurs throwing away big investments that are printing money.",
                                            "score": 5,
                                            "author": "M3rc_Nate"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Honestly this is why - controversial opinion - I’m all for these companies creating more groups to diversify quickly. It’s not fair for a small cluster of groups to be worked to the bone to keep the company good on the stock market. For example, SKZ and TWICE seem to be releasing stuff constantly, and look at BP with their eternal tour. I don’t care if the groups I like are the most successful out of their generation or anything, but I do care that they can take a break after intense periods of work since instead of having to pump out another project too quickly, the company is fine with them chilling for a bit because another 2/3 groups in the company also have projects out. It’s a heavy burden having to be responsible for an entire company. \n\nObviously the risk is just more artists for companies to work into the ground but when I see SM and HYBE with probably two of the largest rosters in K-Pop, l I at least know their won’t be a complaint from shareholders than there has been a quiet month, putting pressure on my faves from those companies to fix it: they have sibling artists to keep things going. \n\nThat’s my hope, anyway. Idk, these artists really are just products to a lot of the higher ups and it’s sad to see sometimes.",
                    "score": 18,
                    "author": "emma3mma5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;I’m all for these companies creating more groups to diversify quickly. It’s not fair for a small cluster of groups to be worked to the bone to keep the company good on the stock market. For example, SKZ and TWICE seem to be releasing stuff constantly, and look at BP with their eternal tour. I don’t care if the groups I like are the most successful out of their generation or anything, but I do care that they can take a break after intense periods of work since instead of having to pump out another project too quickly, the company is fine with them chilling for a bit because another 2/3 groups in the company also have projects out. It’s a heavy burden having to be responsible for an entire company.\n\nBut does that actually change anything? TWICE is working a ton it seems, non stop and now with solo and sub-unit debuts, but it's not like JYPE has only got TWICE so they need them to be active like this in order to stay afloat. JYPE already debuted their junior group (ITZY), and then another new group (NMIXX). Yet those didn't take any work off of TWICE's plate. \n\nI think it's likely just as simple as \"here's their earning potential if we packed their schedules\" and the higher ups say \"good, we want maximum profit. Do it.\" and that's that. \n\nMy questions, obviously the artists want real breaks. But beyond the occasional real break, and this again goes to my \"edit\" point, how many artists would take more breaks beyond that? Those artists seem to be the types who want to maximize their own profit, growth, fame, success and to do so in their 20's (investing in their future at the expense of said 20's). If companies told their artists \"okay you get next month off, but here's what we would have scheduled, how much it would have made ($), your cut, and the potential for one of your appearances to go viral and make you more famous\", how many of those artists would say \"yeah, okay, so I'm still gonna take that month off\"? How many artists are being FORCED to shoot ads, to be brand ambassadors, to fly to Paris to watch fashion shows and so on? Stans bash the companies and say they are overworking by having them do that stuff sometimes but maybe the artists want to do those things? Even when it fills their already packed schedule? Idk.",
                            "score": 36,
                            "author": "M3rc_Nate",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I noticed they're making the concerts slightly easier on TWICE. At last night's concert, some of the more dance-intensive songs had different choreography or were performed sitting down. Don't get me wrong, it was still tons of dancing and super quick costume changes, but it felt like they were maybe giving them a slight break overall",
                                    "score": 19,
                                    "author": "abbyzou",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Those types of little things can add up in a good way. That's nice to hear.",
                                            "score": 9,
                                            "author": "M3rc_Nate"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "If you as twice run a neckbreak schedule for 7 years and then resign a contract and just keep going at the same pace. We can probably assume at that point that Twice wants to run a schedule like that.",
                                    "score": 22,
                                    "author": "flax2122",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Agreed, to an extent obviously, but agreed.",
                                            "score": 7,
                                            "author": "M3rc_Nate"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have a panic attack every time I see a headline with the word _leave_. I wish her a speedy recovery!",
            "score": 14,
            "author": "lavender-fog"
        },
        {
            "level": 0,
            "comment": "I hope Jennie gets well soon. I was at the concert and it was sad to see Jennie leave but YG shouldn’t have let her perform if she wasn’t feeling well. Jennie is amazing for trying her hardest though.",
            "score": 25,
            "author": "ohyoonheeflops"
        },
        {
            "level": 0,
            "comment": "These girls really need a break. It looks like their July isn’t TOO crazy. Hopefully they can have a breather before the US stadium encores",
            "score": 26,
            "author": "liverbirds"
        },
        {
            "level": 0,
            "comment": "Record labels want to make that money at the expense of the physical and mental health of their talent. Even then, there's appearances in tv shows, commercials, movies, etc.\n\nEven performers here in the U.S. get a break every now and then.",
            "score": 18,
            "author": "BOH_Ninja"
        },
        {
            "level": 0,
            "comment": "Watching this happen in real time it truly feels like YG said make as much money as possible before contract renegotiations. Even if all 4 members re-sign it will almost definitely be terms that are more in their favor than when they first signed their contracts- now that they have way more influence and power in the industry. They’ll get more of the profits of their future activities I can almost guarantee it- even though YG already has decent profit split for tours already. \n\nWith that being considered I wonder if YG is really weighing the pros and cons correctly with the length of this tour. Especially since they’re kinda dependent on BP for money until Baby Monsters debut- and that debut is going to be expensive as hell to finance. And especially considering Bigbang is really looking done for the time being and their shareholders did not seem pleased by that. \n\nJennie has always been a bit fragile health-wise. They’re lucky no one has suffered any sort of major injury. Imo it would be best to call it soon and let them go home and rest. But that’s just an outsider perspective on the matter. Yes I know other artists have toured longer but considering Kpop performances require more energy and Jennies health…. It’s a lot to put on them. \n\nFrom videos I’ve seen they seem to be having fun still but idk if I was YG I’d be more concerned about the health risks of such a prolonged tour. This is looking more and more like overwork before contracts are up. Just my two-cents.",
            "score": 15,
            "author": "boringestlawyer"
        },
        {
            "level": 0,
            "comment": "I hope she's alright. Honestly, I can't even imagine having Jennie/BP's schedule. Ivstraight up could not survive that, and not just physically.",
            "score": 15,
            "author": "fizzyzizi"
        },
        {
            "level": 0,
            "comment": "yg like to suck their artist dries with tour. never learn from what happen to gd",
            "score": 15,
            "author": "hazdi_azfar"
        },
        {
            "level": 0,
            "comment": "I hope she'll be fine",
            "score": 6,
            "author": "mo698_"
        },
        {
            "level": 0,
            "comment": "Its so wild seeing idols take a hiatus from health problems people are like oh no take care bby, but when its Jennie it becomes oh well they aren't really that overworked anyway  ¯\\\\\\_(ツ)\\_/¯",
            "score": 6,
            "author": "vodkaorangejuice"
        },
        {
            "level": 0,
            "comment": "Hopping that she rests well and recover soon.",
            "score": 6,
            "author": "Fullmooninnight"
        },
        {
            "level": 0,
            "comment": "My heart breaks for her, I’m not even a die hard blink like that but I worry so much for her and the other members health during their busy schedule. She’s so strong and I’m hoping for a long break after their tour for them ❤️",
            "score": 5,
            "author": "ZestycloseSetting344"
        },
        {
            "level": 0,
            "comment": "I hope she'll be fine",
            "score": 1,
            "author": "mo698_"
        },
        {
            "level": 0,
            "comment": "And we have weirdos wanting her to do backflips, and cartwheels on stage",
            "score": 1,
            "author": "Imjusthereforaminute"
        },
        {
            "level": 0,
            "comment": "If the reports of her throwing up are true, that's not really being \"overworked\" by this tour. That's usually a stomach bug. Now, if she had tendon, muscle, joint, or some other issue, that would be a sign of overworking.\n\nThey had Feb off before touring for 3 weekends in Mar, 2 weekends in Apr with the other 2 being Coachella, 3 weekends in May, and now 3 weekends in June. 6 days a month are hardly overworking on a tour.",
            "score": -33,
            "author": "Red_BW",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are flights, rehearsals, interviews, guestings, photo shoots, etc. That's not just 6 days.",
                    "score": 35,
                    "author": "nielsnable"
                },
                {
                    "level": 1,
                    "comment": "Severe pain can cause throwing up so you cannot say for sure that it’s a stomach bug and not cause of overwork.",
                    "score": 26,
                    "author": "Mozart-Luna-Echo"
                },
                {
                    "level": 1,
                    "comment": "I would agree with you that the amount of tour dates isn't crazy but it's just the girl's schedule in between all the dates. Yeah in February they had no shows but they used it for Coachella prep. The last couple months they've been flying to different continents every few days for promotions/fashion events/commercials. That amount of travel and jetlag takes a toll mentally and physically. \n\nNow whether it was the girls or YG who signed up for this schedule is another topic.",
                    "score": 21,
                    "author": "Cvspartan"
                },
                {
                    "level": 1,
                    "comment": "As someone prone to throwing up, stomach bugs are the cause of my throwing up in MAYBE 5-10% of the cases, I’ve barely ever had stomach issues. Usually it‘s pain for me - migraines, my period and motion sickness make up the majority of the reasons in my case.",
                    "score": 25,
                    "author": "Landyra"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just really hope that Jennie will quite literally get well soon from just, ummm, whatever got her sick during her unfortunately short time on stage during BLACKPINK's latest concert in Melbourne, Australia.  And with that in mind, maybe it should be best for Jennie to just outright stay home and rest up while the remainder of the group will temporarily perform as a trio during the next few concert or so until Jennie feels better again.",
            "score": -42,
            "author": "CarolinaPanthers2015"
        }
    ]
}