{
    "id": "efef0w",
    "score": 5683,
    "title": "Red Velvet's Wendy received injuries on her face and fractured the right side of her pelvis and wrist. She's currently receiving emergency treatment and they are planning to focus on her well-being and treatment",
    "author": "Rigby_k",
    "date": 1577264937.0,
    "url": "https://www.reddit.com/r/kpop/comments/efef0w",
    "media_urls": [
        "https://entertain.v.daum.net/v/20191225175502184"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "&gt; They are currently awaiting the results of a more precise inspection. Please wait for more news on Wendy's condition from SM.\n\n&gt; SM Entertainment also stated that Wendy fell off the stage while rehearsing for her individual performance (Speechless).\n\n\nUpdate: [Notice from SM (same as news article linked)](https://mobile.twitter.com/gomtaengie/status/1209770562286829573)\n\n\n@[gomtaengie](https://mobile.twitter.com/gomtaengie/status/1209761902433144833)\n\nOh my god, fracture sounds horrible. I hope Wendy recovers soon.\n\n[SBS aired the pre recorded performance of Red Velvet's Psycho](https://www.reddit.com/r/kpop/comments/effznr/comeback_stage_red_velvet_psycho_sbs_gayo_daejun/?utm_medium=android_app&amp;utm_source=share) , this was recorded with all 5 members two days ago.",
            "score": 697,
            "author": "Rigby_k",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; SM Entertainment also stated that Wendy fell off the stage while rehearsing for her individual performance (Speechless).\n\nShe wasn’t even dancing. I can’t imagine she was doing anything more than just standing there beautifully putting on a flawless vocal performance. That coupled with the [previous reports](https://twitter.com/misayeon/status/1209097913453948928?s=21) before this even happened of other artists looking visibly scared at the shaky stages as well as Wendy having plenty of experience dancing and performing on such stages - idc I’m blaming SBS.  \n\nThem also doubling down in their statements to distance themselves from any fault (probably trying their best to deflect blame) to the point they can’t even say sorry to Wendy but will apologise to the fans is disgusting.",
                    "score": 589,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I heard that it was because of a staff member who told wendy to go through a tunnel above the stage that should've had stairs leading down but the stairs weren't pulled out. it was so dark that the staff member needed a flashlight, which is probably how she fell so hard.",
                            "score": 152,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh that’s completely negligent and frightening. Praying for Wendy to recover well when I get to church today, that pelvic fracture frightens me, that can mean so many things.",
                                    "score": 80,
                                    "author": "PenguinCollector"
                                },
                                {
                                    "level": 3,
                                    "comment": "Stage productions have become extremely elaborate affairs now, especially on TV, with multiple levels, hydraulic lifts, stairs, and sliding platforms.\nI don’t think it was a matter of “if” someone was going to be hurt, it was a matter of “when”.\nI hope Wendy is ok. :(",
                                    "score": 34,
                                    "author": "Niven42"
                                },
                                {
                                    "level": 3,
                                    "comment": "yes it was and this is why SM entertainment should file a lawsuit against SBS",
                                    "score": 26,
                                    "author": "alanwakey"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "How is the infrastructure that supports maybe the second-biggest girl group, period, so shitty?",
                            "score": 16,
                            "author": "HumbleEye"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A pelvis fracture is unfortunate for a performer :( I am very susssss about the OH&amp;S that led to this and hope it's something the kpop industry takes a closer look at. **Safety HAS to be #1** \\- I know they push their budgets on ten billion other things but safety HAS to be #1. I can't say this any other way.\n\n**Bone notes:**\n\nGeneral timelines for an upper limb fracture are 6 weeks to union, 12 weeks to full consolidation (union being \"if an uncomplicated fracture, bone cells from broken ends touch\", and consolidation being fully healed and able to support full body weight).\n\nLower limb is 12 weeks to union, 24 weeks to full consolidation. Spinal column fractures usually sit somewhere in between but with the pelvis being a more weight-bearing structure, could be on the longer end. It does depend greatly on the fracture severity and location though - for example are we talking an undisplaced avulsion fracture, a stress fracture, or a displaced fracture? Open, closed, tiny chip off iliac crest vs whopping crack through ileum?\n\nEither way I'd be expecting serious load modification at best with a serious query about whether extended bedrest (or hectic bracing) is indicated. Our lady is sadly going to be out of commission for a while.\n\n**Musculoskeletal notes:**\n\nOne of the internal core muscles (also pelvic stabilisers) is the diaphragm, which effectively drives breathing. Once Wendy's bones heal she's likely to have to re-learn how to breathe as a singer again and go through a kind of \"singer's rehab\" - and that's on top of a general musculoskeletal rehab expected from bone-healing-related-deconditioning. Again, going to be out for a while :( (and with a pelvic, and a young presumably hypermobile patient, there's a chance of women's health issues as well, dammit).\n\n&amp;#x200B;\n\nSo basically we could be anticipating a 3-6 month rehab at best, with a chance of things being closer to 12+ months depending on fracture location/severity and how her rehab goes. Pelvic girdle is unfortunately a very important weight-bearing and dynamic stability area of the body, requiring skilled co-ordination of lots of muscles - and this is even more important for a professional singer or dancer.\n\nThe important things are that she's getting treatment at the moment and her company is flagging early that she's going to focus on healing - this is NOT something that can or should be rushed.\n\n&amp;#x200B;\n\nBest wishes, Wendy! I'm so sorry this happened to you, and I hope you feel supported by a great healthcare team right now.\n\n&amp;#x200B;\n\nsource: healthcare practitioner",
                    "score": 23,
                    "author": "whitetealily",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "That’s horrible. Hope she recovers soon!!",
            "score": 305,
            "author": "50shadesof_brown"
        },
        {
            "level": 0,
            "comment": "How long does it often take to recover from a fracture? Months right? Well damn I hope she gets better soon, poor girl.",
            "score": 643,
            "author": "gates0fdawn",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s her pelvis fracture that is so scary. My sister broke her hip and had surgery for it. After the surgery she needed to rest for 8 weeks so it would heal.",
                    "score": 626,
                    "author": "dogstope"
                },
                {
                    "level": 1,
                    "comment": "3-4 months. I play basketball and these injuries almost ruin your season",
                    "score": 223,
                    "author": "Rpeddie17",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 159,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Jeez That's rough. Glad you're getting back to things",
                                    "score": 58,
                                    "author": "Rpeddie17",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 19,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 8,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Depends of the fracture, how deep it is and the place, it also depends if is a open or closed fracture, a closed pelvis fracture can heal in 2/3 months but for a big fracture to restore bone strength may take up to a year, a open fracture is much more serious which i hope it isn't the case.\n\nI just hope she has a small fracture and that she'll recover quickly without complications and wish her a lot of health.",
                    "score": 321,
                    "author": "SuzyYoona"
                },
                {
                    "level": 1,
                    "comment": "From experience with a hairline fracture, you need about 3 months for the pain to go away. Sitting is a bitch for the first 2. If it is anything that minor she will make a full recuperation in a couple of months.",
                    "score": 136,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "as a minimum i would say around 6-8 weeks for the pelvic fracture. but arm much less. \n\nbut lots of factors will determine duration of recovery. Open fractures taken longer to heal (when the broken bone pierces through the skin). \n\ndid it break into lots of pieces (comminuted) fracture? (unlikely though given she won’t have fallen from a great height)\n\nAlso the sharp edges of the bone can also cause damage to local structures.  e.g. in the arm can cause local nerve damage/pelvic fractures can pierce the urethra etc. \n\n\nI’m hoping these injuries are of the mildest variety and that our wendy is happy and healthy as soon as humanly possible. sending love.",
                    "score": 84,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Also depends on if there was any movement that occurred in those joints. If any cartilage was knocked off as they fracture happened, it would require surgery to be removed or screwed back into place. This recovery could take many months with lots of physical therapy. It could prevent her from a lot of future choreo, but god forbid this scenario and she is able to recover fast.",
                            "score": 41,
                            "author": "asakimX"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not a health professional but know somebody that fractured their pelvis. It took him a couple of months to recover.",
                    "score": 25,
                    "author": "Broken_Noah"
                },
                {
                    "level": 1,
                    "comment": "Fractures pelvis is no joke.",
                    "score": 21,
                    "author": "Yojimbo4133"
                },
                {
                    "level": 1,
                    "comment": "i’m willing to wait for as long as it needs to take for her to heal so long as it isn’t serious to the point where she can’t perform as an idol anymore and quit her career 🙏🙏🙏",
                    "score": 42,
                    "author": "thefourthnine"
                },
                {
                    "level": 1,
                    "comment": "Not a doctor but I'm seeing some estimates of up to 8 weeks but I guess that varies depending on the severity plus any recovery/physical therapy needed",
                    "score": 44,
                    "author": "amazingoopah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To be honest 8 weeks is not really a \"up to\", it's more of a best case scenario. Worst case scenario for a pelvis fracture can have someone sidelined for years. Really hard to estimate since we have no idea but I would say 8 weeks is really optimistic.",
                            "score": 17,
                            "author": "You_Will_Die"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I broke my sacrum falling down some stairs and it took a good 3-4 months to be able to walk/run normally and sit without pain. Prob took about a year to fully heal and even now, if i sit for a long time my tailbone gets sore. It's one of the most painful and debilitating places to get a bone fracture imo.",
                    "score": 8,
                    "author": "ot12shipper",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It really depends on how bad the fracture is. The pelvis is such an important bone and you don't know how much you actually use it until you injure it.",
                    "score": 4,
                    "author": "14SierraMist14"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’d just been silently waiting for a legit update this whole time but I can’t even begin to describe my anger towards SBS. Their initial update almost solely focused on the status of the performances, when at that point they must’ve known how serious things with Wendy were. Only thing that’s indicated the seriousness up to now were all members dropping out of everything. \n\nIm foolishly hoping that SM’s direct and detailed update on how she’s doing means they intend to go after whoever’s responsible for the reckless handling of their artist’s safety, but I’m not expecting much. \n\nHeart really hurts for Wendy right now, just praying for a speedy and painless recovery.",
            "score": 480,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm also angry at SBS, not only for neglecting the stage issues which were reportedly noticed by other groups. But the fact that they apologized for RV not being able to attend instead of addressing their responsibility and apologizing to Wendy just baffles me and infuriates me",
                    "score": 203,
                    "author": "Arkaryum",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "SBS is not going to apologize for the stage conditions until any legal matters are settled. A formal apology is admissable in court as an admission of fault and SBS, SM, or any other company is not going to admit fault for any accident because it means they'll lose their court battle before it even begins. You can't expect people to do the right thing when doing the right thing means you get reamed out in court. \n\nThey apologized for RV not performing because they aren't going to get sued for dropping a performance but they definitely will be sued for the stage conditions.",
                            "score": 138,
                            "author": "HippieTrippie",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m heartbroken. I hope Wendy doesn’t blame herself for what happened, and I hope this injury isn’t career ending. I couldn’t help but think about how Heechuls’ leg injury has essentially put him out of commission as a performer. Will be anxiously waiting and hoping she makes a full recovery and gets all the support she needs.",
            "score": 102,
            "author": "austen1996"
        },
        {
            "level": 0,
            "comment": "SM need to sue the shit out of SBS. This is potentially career-threatening.\n\nGet well soon Wendy.",
            "score": 968,
            "author": "xhammersxthrow",
            "replies": [
                {
                    "level": 1,
                    "comment": "SM didn't even bother to sue the guy who tried to drag Taeyeon off the stage, they sure as hell aren't gonna sue another company.",
                    "score": 248,
                    "author": "Sankaritarina",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;SM didn't even bother to sue the guy who tried to drag Taeyeon off the stage, they sure as hell aren't gonna sue another company.\n\nSM is going to lose a lot of money with Wendy sidelined for the better part of a year . Then with reduced function after with respect to choreography until physical therapy clears her. If there are documented concerns or many witnesses to the instability of the stage, it'll be open and shut.\n\nTaeyeon's attacker should have been arrested &gt;:(\n\nedit: Depending on the severity, Wendy may also have her own case because this will have impacts on her health for potentially her life into old age, reproductive choices/concerns, etc.  Obviously, speculation but based on general knowledge and experience surrounding how debilitating pelvic injuries are.",
                            "score": 185,
                            "author": "LootTheHounds",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The question is will they lose even more money by breaking ties with one of the biggest media companies in Korea? We all know about blacklists and shit, I wouldn't be surprised if SM is too scared to sue.",
                                    "score": 13,
                                    "author": "Infraxion"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Honestly it’s probably way easier to sue another company, rather than just some creep. Especially in this case, where there are real damages and such.",
                            "score": 44,
                            "author": "Sl0thstradamus"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wh is sbs culpable? Why should they be sued? I can’t translate the article so I’m not sure if it listed a reason for the fall or not.",
                    "score": 59,
                    "author": "married_to_a_reddito",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Apparently a security gave her directions to walk to her stage during her solo rehearsal, and I'm assuming it was dark because they used a flashlight, but the stage wasn't even prepared so she fell down 2 meters.\nApparently this is the stage where it happened \nhttps://twitter.com/jendeukiebabo/status/1209794418011586560?s=20",
                            "score": 325,
                            "author": "tsukisun",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "So they basically told her to walk out of the tunnel on to air (where there was supposed to be stairs but didn't due to some failure).",
                                    "score": 200,
                                    "author": "shadowpaw"
                                },
                                {
                                    "level": 3,
                                    "comment": "That’s so high to fall from! Absolutely terrifying.",
                                    "score": 57,
                                    "author": "aidoll"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "From what I've read she was rehearsing her solo performance on one of those platforms that rise, and she fell 2 metres down? There should've been some safety precaution in place to prevent her from falling, especially from so high up.\n\nEDIT: Apparently TWICE and Chungha looked worried because their stages/platforms seemed really wobbly or unstable (for a lack of a better term).\n\nEDIT 2: Alongside this, the stages are apparently really slippery and I'm surprised we haven't seen more idols get injured tonight. So far I've seen videos of numerous members of NCT 127, a member of Monsta X (not sure who it was), Itzy's Yeji amongst others slipping over. Idk what the fuck SBS was doing tonight.",
                            "score": 417,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Mamamoo’s Solar aside from falling at the red carpet, also slipped a little at the beginning of their HIP performance",
                                    "score": 54,
                                    "author": "jeivee",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Apparently Jin almost fell twice during the carols and Tae also almost slipped while Dionysus was playing. The stage was an absolute mess",
                                    "score": 205,
                                    "author": "Stormdragon_Veldora",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Good Lord, everything I keep reading sounds awful. Completely unacceptable conditions for the safety of many beloved artists.",
                                            "score": 68,
                                            "author": "GenrlWashington"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The little girl that was with them slipped on the stage and fell as well. Mamamoo fell too.",
                                            "score": 72,
                                            "author": "she_sus"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Company should boycott sbs honestly, having your artist injured is such a profit loss in term of business. Wendy fall is so severe.",
                                    "score": 9,
                                    "author": "turtles_tszx"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "All I want is for her to take as long as she needs to rest and to recover without worries. I hope she doesn’t blame herself knowing her :( nothing matters more than being healthy so it’s good that SM cancelled everything now. Hopefully the girls can still spend Christmas together.",
            "score": 168,
            "author": "fwalice"
        },
        {
            "level": 0,
            "comment": "Fuck I was not expecting to see such sad news. Her injuries are quite serious so my prayers are with her to get well soon and bless us with that beautiful smile.",
            "score": 84,
            "author": "ReVeLuVoL"
        },
        {
            "level": 0,
            "comment": "Wishing her a great and speedy recovery. That sounds terrible.",
            "score": 76,
            "author": "KeepCoolStayYoung"
        },
        {
            "level": 0,
            "comment": "From her fractures, it sounds like she might have landed on her right side and face while also trying to break her fall with her wrist. We don’t have information on what kind of fractures they are, but they still probably fucking hurt, and the impact must have been pretty heavy to fracture her bones anyway. Pelvic fractures can also be very serious and can take a long time to heal depending on how bad the fracture is and where.\n\nI’m so fucking mad. SBS’s negligence caused an artist to be injured, and they haven’t even apologized. Safety precautions should have been put in place to prevent injuries like this. This should have never happened in the first place.\n\nEdit: SBS [apologized](https://twitter.com/warmblue0221/status/1209767241316651008?s=21) that Red Velvet can’t perform live and not for their negligence that caused Wendy’s injury? Are you fucking serious?\n\nEdit 2: A few people pointed out that fracture and break are interchangeable, so I’m editing to correct that",
            "score": 731,
            "author": "Wolfarick",
            "replies": [
                {
                    "level": 1,
                    "comment": "Pelvis and spine are the two places where fractures are the nastiest...I sincerely hope it is not severe.",
                    "score": 162,
                    "author": "MarikaSymphony",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, there’s a reason falls are so dangerous for the elderly, because pelvis injuries can be death sentences. It’s usually not as serious for younger people since their bodies are less fragile and can bounce back easier, but it’s still a major injury that can take weeks to months to heal. This is so heartbreaking, I hope they do everything they can to help Wendy heal and recover. And especially for her, who’s always so eager to perform, this has got to be the worst case scenario for her since it’ll mean, at the very least, that she won’t be performing for a while. Poor Wendy. :(",
                            "score": 67,
                            "author": "ankhes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Took my friend about 2 months of doing nothing and then having to move gingerly for another 3 or so months after. The pain will stay for a while",
                                    "score": 23,
                                    "author": "oh_WHAT"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Unfortunately we can't really know how severe the fractures are. I know we're all kind of brought up thinking that a fracture means a hairline fracture, and anything significantly worse is a break, but fracture is actually just the all encompassing term.\n\nSpeaking from experience, Pelvic fractures are the absolute pit, though. No way to cast it to take the weight off, so its just a steady diet of pain medication and bed rest- surgery or not.\n\nAlso can we say *fuck* SBS again? I've actually seen clips of Wendy, I believe, even being thrown about on moving stages before. They clearly aren't safe enough.",
                    "score": 200,
                    "author": "crashbandicoochy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, about the fracture/break, I’ve edited to correct that. I honestly forgot. I used to want to be in the medical field",
                            "score": 23,
                            "author": "Wolfarick"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A fracture and break are the same thing. They're just interchangeable words. This is really serious 😣😔",
                    "score": 58,
                    "author": "raunak1999",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, thank you, I’ve edited to correct that. We really have no information on what kind of fracture it is, so it could be pretty serious",
                            "score": 15,
                            "author": "Wolfarick"
                        },
                        {
                            "level": 2,
                            "comment": "huh, i always thought they were different, TIL",
                            "score": 19,
                            "author": "Veothrosh"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No matter what, they’re not gonna publicly admit fault and apologise for their negligence otherwise they’re gonna get absolutely cleaned up in court proceedings.",
                    "score": 35,
                    "author": "Void_Gears"
                },
                {
                    "level": 1,
                    "comment": "Fuck SBS. Wth",
                    "score": 67,
                    "author": "coolcoolnodoubt"
                },
                {
                    "level": 1,
                    "comment": "This is disgusting. SBS should be sued by SM for neglecting their safety protocols and inadvertently caused Wendy to fall and sustained serious injuries. Poor Wendy! I feel so sorry for her! 😢😢😢",
                    "score": 74,
                    "author": "mad_titanz"
                },
                {
                    "level": 1,
                    "comment": "so not only are their stages shit, their PR is shit too",
                    "score": 24,
                    "author": "mrmctommy"
                },
                {
                    "level": 1,
                    "comment": "If you land wrong fractures can happen pretty easily, people break shit just tripping over their feet all the time. There is a reason why they teach you to fall in martial arts. There's a trick to hitting the ground without breaking shit\n\nI'm not quite ready to lynch anyone over this, sometimes accidents happen. I'd like to see some proof of negligence first",
                    "score": 41,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've seen claims that Twice were apparently also worried about the stage in rehearsals, so there might have been warnings that SBS should have addressed but maybe they didn't or their measures didn't work. I guess we'll have to see if SBS is made to fully explain what happened",
                            "score": 56,
                            "author": "amazingoopah",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If there has been known issues with the stage being unsafe then that's a clear sign of a larger issue, but I'd like to hear that from someone who knows for sure. I'm hesitant at taking twitter speculation as fact.",
                                    "score": 27,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a reveluv I'm really walking the fine line between being very scared, because this does sound extremely serious, and not being caught up in the fear-mongering because there's nothing really I can do besides hope for the best. This sickens me to my core and I am just disheartened, I hope Red Velvet recovers from this. This has been such a great start of a new era but of course 2019 just had to unleash something for one last time and ruin this\n\n All I'm 100% certain is SBS needs to be held culpable for this.",
            "score": 813,
            "author": "bespectacIed",
            "replies": [
                {
                    "level": 1,
                    "comment": "same here. wendy is my bias and this news breaks my heart into a million pieces. my mind keeps making up worst cased scenarios like her quitting her idol career due to her being unable to perform and i’m scared it’d become a reality.",
                    "score": 220,
                    "author": "thefourthnine",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hate to fuel the fears and try to remain positive but i legit felt cold when i saw how high the platform she supposedly fell from :((",
                            "score": 67,
                            "author": "bespectacIed"
                        },
                        {
                            "level": 2,
                            "comment": "Please, I hope this is not as bad of an injury. I would be devastated by such a news, Wendy's also my bias but I love all of Red Velvet and I can't imagine them losing one member. \n\nBut more than that, I just hope that she will recover without issue even if it takes time. I can't even start to imagine what she is feeling like right now :(",
                            "score": 30,
                            "author": "Arkaryum",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't wanna sound pessimistic, but it's literally impossible to classify a fractured pelvis as a light injury. As far as fractures go, that's near the top of the list of the hardest to recover and the most painful.\n\nHonestly, the only thing worse than a fractured pelvis is a cranial or spinal fracture.",
                                    "score": 24,
                                    "author": "TechPanzer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah I know it's not a light injury and it's probably gonna take a long time to heal for sure. I just hope it won't affect her life and career because I would honestly be so upset for her :(",
                                            "score": 5,
                                            "author": "Arkaryum"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I just saw some fan accounts showing the floor of the extended stage and it seem really slippery? IDK if that is part of the reason of the injury",
                    "score": 69,
                    "author": "Heedictated",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Several idols have already mentioned the height and danger of the lift in the pre-recordings before but what all the crew said was that all the equipment were safe so they went ahead with it and well...",
                            "score": 104,
                            "author": "yujuismypuppy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Imagine what idols' minds were going through being forced to use the lifting platform after Wendy had her injury; I doubt any of them were happy about it.",
                                    "score": 32,
                                    "author": "mad_titanz"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Agreed, someone fucked up big time and absolutely needs to pay for it.\n\nHopefully SM can actually utilise their considerable legal firepower for a worthy cause this time, as opposed to screwing over former artists as they're more used to doing.",
                    "score": 65,
                    "author": "red_280"
                },
                {
                    "level": 1,
                    "comment": "I feel the same. This is heartbreaking, and infuriating. Poor Wendy :(",
                    "score": 13,
                    "author": "milk-rose"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Was actually looking forward to their very first Psycho performance but now it’s cancelled and RV won’t even perform at all. This is heartbreaking and I just wish for Wendy’s fast and steady recovery :(",
            "score": 109,
            "author": "bmdcmp"
        },
        {
            "level": 0,
            "comment": "OMG that sounds so terrible! I literally feeling like tearing up - how could one performance go so wrong?? I really wish she will still be her cheery self with the support of her group members, especially through this holiday season.",
            "score": 198,
            "author": "dreamofdreamcatcher",
            "replies": [
                {
                    "level": 1,
                    "comment": "[a fan said she fell off from the second floor tunnel](https://twitter.com/season_on_ice/status/1209783250995924992?s=19)",
                    "score": 102,
                    "author": "stokeley0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My mouth literally gaped open at visually seeing how big the drop was. Wow, truly is terrible. Based on other comments, I can see how SBS is at fault for poor safety features during a rehearsal (they need to be prepared with some kind of soft landing in case of a fall - which humans are prone to, no lie - like this).",
                            "score": 101,
                            "author": "dreamofdreamcatcher",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Huh? I’m confused by this picture, or maybe it’s the perspective?? Aren’t there stairs there and it’s not a straight fall down? Or am I seeing things wrong?",
                                    "score": 15,
                                    "author": "WolfTitan99",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It looks like they are retractable stairs, in the pic they are under the platform, but can be pulled out.",
                                            "score": 56,
                                            "author": "Muffin278"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "It was presumably dark, she was told to walk out from inside the tunnel. But there was no stairs underneath so she fell. Like wtf isn't there someone below to check if the stairs are there ??",
                                            "score": 10,
                                            "author": "Green_pine"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Un-fkin-believable. Exactly on Christmas, on their epic CB stage and it couldn't have happened to a nicer person. I hope Wendy is okay (as much as one can be on this situation) and I wish her a speedy recovery. Please give Red Velvet much love.",
            "score": 38,
            "author": "gkmaster21"
        },
        {
            "level": 0,
            "comment": "😭 Sending my prayers to her and the members. I hope SM sues them because it's a real shame. They were doing so well with Psycho. They have a tour coming up and they're going to have to redistribute the lines. #GetWellSoonWendy  ~~Of all days it had to be on Christmas~~",
            "score": 32,
            "author": "neocitywayv",
            "replies": []
        },
        {
            "level": 0,
            "comment": "TWICE were already scared about that Shaky stage the other day yet SBS did not fix it? Hope they get sued",
            "score": 130,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "And for Christmas, SBS got a nice big lawsuit.",
            "score": 156,
            "author": "raymondliang",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Jeez, that's worse than I thought.\n\nGet well soon Wan!",
            "score": 27,
            "author": "Farrug"
        },
        {
            "level": 0,
            "comment": "I feel absolutely sick. This is so disheartening. \n\nWendy has had a great year and looked so happy and healthy during all of their promotions. They all seemed super excited for Psycho as well. The song itself has been performing incredibly well, too. She has to watch the promotional period go by from a hospital bed and deal with an incredibly painful recovery process. \n\nI am so angry that this happened. Whether or not SBS is liable isn’t even my concern - I just hope that Wendy can make a full recovery and isn’t in a lot of pain. I also hope the rest of the group can take time off and be with her.",
            "score": 29,
            "author": "ParanoidAndroids"
        },
        {
            "level": 0,
            "comment": "This is horrible :( I hope Wendy will be okay and I wish her a speedy recovery! I hope she focuses on recovering and also hope that SM or anyone else doesn't force her to come back until she's fine.",
            "score": 44,
            "author": "Natahnv"
        },
        {
            "level": 0,
            "comment": "Holy shit, that's terrible! Poor Wendy",
            "score": 45,
            "author": "AllyMay1234"
        },
        {
            "level": 0,
            "comment": "Cries I hope she has a speedy recovery asap",
            "score": 21,
            "author": "daboisam"
        },
        {
            "level": 0,
            "comment": "Fuck, why do we have to wake up to this news?\n\nPoor Wendy, pelvis injury sounds so bad for someone that lives from dancing :( \n\nI hope she recovers fast and without sequels, and I also hope she gets all the support (and more) that she needs from her company, friends and family.\n\nGet well soon Wendy!",
            "score": 21,
            "author": "Xerachiel"
        },
        {
            "level": 0,
            "comment": "Get better soon Wendy :(",
            "score": 20,
            "author": "HyVana"
        },
        {
            "level": 0,
            "comment": "I hope the other groups be safe and not dance on the stage",
            "score": 39,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "SBS needs to release a formal apology at minimum and SM needs to sue them so badly for letting this happen",
            "score": 52,
            "author": "TheSupremeQueen",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Wendy is such a strong representation of achieving your dream. Canadian, and making it to the top, and I'm so proud of her being as I'm an Canadian in Seoul now. She made me make the leap to moving here and fulfilling a dream also, I am so heartbroken to hear about this accident as I was so happy to see them perform in Toronto, then last month here. I'm not a praying person...but I'll be outside with my RV Lightstick if possible and show support and say Please get better and don't ever give up. Her home coming concert was the sweetest event I ever attended. Love from a former Tdot expat.",
            "score": 17,
            "author": "g00fland",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was at the concert too and seeing her so emotional to see her family and the members happy performing back in her home was honestly something else.",
                    "score": 9,
                    "author": "Deeepened"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is not good for SBS. Looking at fancams in passing for MX, I.M and Minhyuk both slipped. A part of the stage was so slippery, Minhyuk could barely stand up straight after the performance because he almost lost his footing again. How slippery was the stage that someone can’t even stand still? Everyone else is posting about other idols almost falling and the stage being unstable, too.\n\nI don’t get how there wasn’t some sort of precaution to make sure RV was safe if the stage was lifting. I hope Wendy is able to take proper time to rest. SBS definitely needs to be held accountable.",
            "score": 38,
            "author": "soesoterica"
        },
        {
            "level": 0,
            "comment": "That's so awful. Hope she gets well soon.",
            "score": 15,
            "author": "milkysehun"
        },
        {
            "level": 0,
            "comment": "To have even a fracture, the trauma to those areas must have been severe enough to a good extent.\n\nI'm so sad and angry to hear of this news when RV only came back this week. Super worried and will be praying for her best health. SM better sue SBS for this, how could they think of having any holes/incomplete setup of stages when *real people are on the damn thing rehearsing*?? Just how reckless can they be, it was only a few hours before the ceremony started too.\n\nLast minute work and rushing, they need a wake up call to treat the staff/artists properly in a high risk environment.",
            "score": 14,
            "author": "jaefan"
        },
        {
            "level": 0,
            "comment": "get well soon wendy!!",
            "score": 13,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "A pelvic fracture for a person that dances for a living.  I’m no doctor but that can’t be good.  Hoping for a full recovery.",
            "score": 28,
            "author": "rueiraV"
        },
        {
            "level": 0,
            "comment": "Get well soon my ult.",
            "score": 47,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "My mom fractured her Pelvic bone 6 months ago.  It is an extremely painful injury during the first few weeks.  She was in hospital for about 3 weeks, came home and used a walker for couple weeks and then a cane, then she was ok.  It took at least 8-10 weeks with a lot of discomfort along the way.\n\nThis is terrible, but if anyone has the attitude, determination and support group to recover well, it's Wendy.",
            "score": 11,
            "author": "mintchocoteam"
        },
        {
            "level": 0,
            "comment": "The good news is that she's alive and these are injuries you can recover from and live a normal life. That pelvis fracture though, it might hinder her Idol career (like Heechul's car crash), but hopefully she has a full recovery.",
            "score": 24,
            "author": "Red_BW"
        },
        {
            "level": 0,
            "comment": "Being a Wendy stan myself this is really upsetting. Legit this is one of those rare times I can actually cry. Like, I don't wanna sound corny but she's the one who always grounds me down when I'm feeling upset or just in bad mood with her singing and her silliness... This really broke me.\n\nAnd seeing Wendy at her peak confidence since Summer Magic in 2018 till now, her fractured pelvis bc some brainless ass staff didn't know how to ensure safety is surely would crack that even a little. She can be terribly humble to the point it gets to borderline self-deprecating at times and it's so awfully annoying that I hope she won't beat herself bc of this. Nothing of this is her fault.\n\nBut I also can't help but worry about her future... I mean, I'm sure they'll still promote with those dances and stuff for another year or two and I'm really worrying her ability as a dancer for the long run. I hope it is a minor one. I wish her dancing ability is not getting hindered by this accident, I already narrated WenSeul as main dancers and vocalists duo and nothing would take that away from me. Not by the fuckin dumb irresponsible SBS staff.\n\nI'm also disheartened by the possibility that they might have to promote as 4 for Psycho promotional cycle that I wish they just don't promote at all, it will be the usual 2 weeks anyway. 5-1=0 and I don't want her antis taking this as an advantage to dismiss her presence in the song. I know most of them are trolls but I really can't stand such negativities. :(\n\nAnd the Japanese tour too... Gosh, this is just so hard for me and probably harder for the members too.\n\nThis is literally their best comeback to date with so many achievements and good vibes around the girls and us in the fandom and to see that the supposedly \"professional broadcasting company\" ruining it by being unprofessional is just leaving such sour taste to me.\n\nI hope for her speedy recovery with little to no damage and - lemme be wishful - for SM to take legal measures against SBS for the negligence of safety. Considering other complaints from the other artists too about how shaky and slippery the stages are. No one's safety should be compromised by such dumbassery.\n\nAnd for her family and the members to be strong. Especially the members because they have to go through this and keep it professional.\n\n\"Hey now we'll be okay, it's alright\" line in Psycho really hits different as of now.",
            "score": 24,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is literally exactly how I feel right now, but didn't know how to articulate. Thank you for saying all of this. These next few months will be hard, but I feel like if anyone can overcome something like this, it's Wendy and her RV sisters.",
                    "score": 4,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is so horrible, I’m so mad. Finally an insanely cool comeback, Psycho’s PAK, I bet everyone was anticipating music show stages, but here we are, the key member got hurt due to SBS’s negligence. I’m sad just thinking about how Wendy and other members feel. I really hope Wendy will be fine and will recover nicely, and I hope she’ll be ok mentally as well",
            "score": 11,
            "author": "mnegrustno"
        },
        {
            "level": 0,
            "comment": "Seeing where she possibly fell from made me absolutely sick. I don't know what to do with the anger I have knowing she's in pain right now for such gross negligence. And to make things worse, SBS's un-apology. Today and on, I'm going to work on just sending out good thoughts her way until we see her smiling brightly again doing what she does best. We believe in you Wendy and always got your back. Hoping for a smooth recovery for you and the rest of the girls through this time.💙💙💙",
            "score": 11,
            "author": "eigogo"
        },
        {
            "level": 0,
            "comment": "im so angry at sbs right now...this couldve been prevented but their cheap asses didn't care enough. I hope wendy doesn't blame herself and gets well soon.",
            "score": 34,
            "author": "sweasjeon"
        },
        {
            "level": 0,
            "comment": "Damn, what horrible injury for Wendy and RV, Psycho has been such a strong comeback so far and this happened. Hope Wendy makes a full recovery and there is no long term damage to her 😣😣\n\nAs always, shitty stage management is at fault here. I've always hated how artists have to perform in the rain and such. This sounds like the stage had some issues and they weren't properly addressed. SBS needs to get dragged for this.",
            "score": 36,
            "author": "amazingoopah"
        },
        {
            "level": 0,
            "comment": "These are serious injuries. What the hell SBS???",
            "score": 22,
            "author": "Marathon1981"
        },
        {
            "level": 0,
            "comment": "as a baseline i would say around 6-8 weeks for the pelvic fracture. arm much less. \n\nbut lots of factors will determine duration of recovery. Open fractures taken longer to heal (when the broken bone pierces through the skin). \n\ndid it break into lots of pieces (comminuted) fracture? (unlikely though given she won’t have fallen from a great height)\n\nAlso the sharp edges of the bone can also cause damage to local structures.  e.g. in the arm can cause local nerve damage/pelvic fractures can pierce the urethra etc. \n\n\nI’m hoping these injuries are of the mildest variety and that our wendy is happy and healthy as soon as humanly possible. sending love.",
            "score": 21,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 7,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "ohhh i actually don’t know where she fell from but i was assuming rough stage height. nah in the uk we don’t specialise as doctors until after 3 years of practice so i’m just a general medic for 2 more years but did just finish my ortho rotation.",
                            "score": 11,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 6,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope she'll recover fast. Get well soon!",
            "score": 10,
            "author": "Fireworkqoqo489"
        },
        {
            "level": 0,
            "comment": "Jesus that sounds awful, I hope she doesn't suffer any permanent damages to her health and recovers well!",
            "score": 10,
            "author": "WildTurtroll"
        },
        {
            "level": 0,
            "comment": "I just hope she gets well, I hope she's okay\nnothing else matters more than that at this point",
            "score": 9,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Get well soon Wendy :(",
            "score": 10,
            "author": "theauthoritator"
        },
        {
            "level": 0,
            "comment": "!!! How is this show still going on with such a serious injury happening just before?? Also knowing she fell from a stage after fans of multiple artists noticed the unstable stage during the pre-recording?? There is obviously a lack of safety with this show, and SBS's non-statement and non-apology about Wendy's serious injuries is unbelievable. Wendy has weeks to months of healing depending on the severity of these injuries, and i hope sm takes the appropriate action for this. Please bell well soon Wendy 💙\n\nedit: thinking about how Wendy fell during the rehearsal for the Disney song medley, a *vocal* performance, and its possible the other girls (and who knows who else) saw her fall and become seriously injured and yet now have to get back up on that stage and perform its too much",
            "score": 72,
            "author": "nomoreiloveyous",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was looking forward to that vocal goddess stage the most but now I don't want any of them near that stage. \n\nI wish artists got more support when it comes to their safety. I don't find it \"so brave\" or something to encourage when they're dancing in the rain in heels or something equally unsafe. Their livelihood is their face, voice, and dancing and she's injured 2 of the 3. \n\nMaybe people would call her diva if she said she wasn't going out on that flimsy ass stage but artists are worth a lot of money, they **should** be able to be outspoken about workplace safety.\n\nI know I know, thoughts and prayers, but I lit a Christmas candle and said a prayer for her. She's young and in good shape, she should have a swift recovery OP.",
                    "score": 31,
                    "author": "fxtd"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The more details I get about this incident, the angrier I get. The lack of professionalism and due diligence from SBS is absolutely shocking. Never again should they be allowed to host this event.",
            "score": 9,
            "author": "Marathon1981"
        },
        {
            "level": 0,
            "comment": "Wow depending on how serious the breaks are this could almost end her career. Terrible terrible news. Right after releasing such a great song too. Very unfortunate",
            "score": 17,
            "author": "JohnPaulWallGeorge"
        },
        {
            "level": 0,
            "comment": "I hope at least sbs apologizes, Solar also had a minor accident on the red carpet. They should prioritize the safety of all artists.",
            "score": 16,
            "author": "tsukisun"
        },
        {
            "level": 0,
            "comment": "Before I head to sleep, I always browse this subreddit and check out all the recent/new posts. But I always have that fear in me, that I’m going to scroll and see a headline of something bad happening to an idol. I hate that heart- dropping feeling so much. \n\nPraying that when I wake up today, that everything will be okay with her. Please be safe. 😓",
            "score": 16,
            "author": "Kammakazi"
        },
        {
            "level": 0,
            "comment": "I hope she recovers well and soon.",
            "score": 8,
            "author": "CamilaMicalski"
        },
        {
            "level": 0,
            "comment": "Get well soon Wendy ! Please give her the moral support and the respect she deserve",
            "score": 7,
            "author": "DarkRecipe"
        },
        {
            "level": 0,
            "comment": "Fractures can leave you with life long stress and pain, fucking SBS needs to be sued for their shit stages.\n\nAnd SM better let her get the full rest she needs.",
            "score": 31,
            "author": "real_highlight_reel"
        },
        {
            "level": 0,
            "comment": "This is horrible, I hope she gets well soon.",
            "score": 6,
            "author": "bhishma-pitamah"
        },
        {
            "level": 0,
            "comment": "I saw pictures of the platform from where she apparently fell from and that’s horrifying. Wishing you the best, Wendy. I hope she gets as much time as needed to rest, the music doesn’t matter.",
            "score": 7,
            "author": "BluexFlash"
        },
        {
            "level": 0,
            "comment": "Jesus fucking Christ. Poor Wendy. Fuck SBS for having unsafe work conditions. I hope she has a speedy recovery. I’ll miss her stage presence/voice during performances.\n\nActually, do we know yet if RV is going to continue promoting Psycho? I’m not sure how they could do it sans Wendy (though I suppose they could split her lines between Seulgi and Joy, maybe give the easier ones to Irene and Yeri? idk).",
            "score": 6,
            "author": "carpetheart",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope SM doesn't force them to promote if they aren't ready or if want to be there for Wendy right now, especially since her family has to travel from Canada to be with her, so her members are her family right now. I think they'll probably stop all activities for now.",
                    "score": 8,
                    "author": "amazingoopah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This. I really hope the other girls will not be forced to promote if they don’t want to. I can’t imagine how they’re feeling right now because of Wendy. If putting a pause in activities is what they want to do, I hope SM respects that. Wendy, we love you and are wishing you a pain-free and speedy recovery.",
                            "score": 5,
                            "author": "CommanderFy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just saw an update that some RV members will participate in KBS Song Festival in their special unit performances. Guess they didn't want leave their fellow artists hanging, just hope they are doing this without company pressure\n\nPlus Irene is MCing it, so she might just have to go through with it",
                                    "score": 5,
                                    "author": "amazingoopah"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope next year companies will think twice before sending idols to SBS, as they don’t seem to care about safety. SBS knew beforehand about problems with the stage and even after the accident it seems they didn’t do much to fix it as from what I‘ve read many more artists had problems i.e. with the stage being slippery.\n\nAnd their nonpology makes me think they aren’t about to change, if they aren’t forced to either in court or by pressure from the Kpop companies.",
            "score": 7,
            "author": "Upshot77"
        },
        {
            "level": 0,
            "comment": "omg this is horrible! I hope she has a speedy recovery. SBS you have a lot to explain, how can someone be injured so badly at your show?",
            "score": 28,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I'm out of the loop. Can someone tell me what's going on?",
            "score": 13,
            "author": "Ovatrili",
            "replies": [
                {
                    "level": 1,
                    "comment": "She fell off a lifted stage at rehearsals for SBS gayo. About a 2m fall. RV was meant to perform and Wendy had other performances as well.",
                    "score": 51,
                    "author": "fwalice",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Shit she had a solo performance too? I bet she is utterly devastated.",
                            "score": 9,
                            "author": "inanis"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Also concerned about her mental state,  hope she stays optimistic and not feel the pressure from her fans. You aren't a reveluv if you don't let her rest until SHE is ready and healthy.",
            "score": 13,
            "author": "DrinkingSpydie"
        },
        {
            "level": 0,
            "comment": "I hope Wendy has a speedy recovery. \n\nI think SBS needs to acknowledge the safety issue and admit fault, but I doubt they will say anything beyond a generic statement because anything more would be admitting guilt and probably making it even easier to sue them. And we sadly know companies care more about that.",
            "score": 18,
            "author": "meow0101"
        },
        {
            "level": 0,
            "comment": "i just watched the live stream and that stage looks pretty dangerous",
            "score": 6,
            "author": "green_strawberry"
        },
        {
            "level": 0,
            "comment": "This is awful.  I hope she makes a full recovery.",
            "score": 6,
            "author": "ValerieHolla"
        },
        {
            "level": 0,
            "comment": "Fuck.",
            "score": 6,
            "author": "PM_ME_YOUR_SAD_TITS"
        },
        {
            "level": 0,
            "comment": "God, this is scary. SBS should have the shit fined out of them, and Wendy deserves as quick and easy a recovery as possible. Releasing too much info about her injuries would be a violation of privacy, but I hope we as terrified fans get an update on the severity of them. There seems to be a lot of variability with pelvic fractures, so I hope Wendy sustained the least severe kind.\n\nAnd just... ***FUCK*** 2019. I need this shit year to end as soon as possible",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Devastating. Wendy is so much fun to watch on stage. I wish her the best in her recovery.",
            "score": 6,
            "author": "laelex"
        },
        {
            "level": 0,
            "comment": "I feel very bad for RV, especially Wendy. It's their first comeback stage for Psycho (iirc??) and SBS's negligence caused a supposed regular round of promotions to end up like this. There were also several clips of idols performing and almost slipping on the stage too. Did they check the stage properly before letting idols perform? Even if the idols didn't have to perform demanding choreography, the stage was still unsafe.",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "They had a stage for psycho before this but yeah, this basically ruined promotions for that song.",
                    "score": 4,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The entire day I’ve been preoccupied with this when I should be happy spending time with my family. I’ve felt my stomach drop about a hundred times today and am on the verge of tears. I really, truly wish the best for her and the rest of RV.",
            "score": 5,
            "author": "pc18"
        },
        {
            "level": 0,
            "comment": "oh my god. wendy please be okay this cant be happening... sbs needs to be held responsible, twice and chungha were scared of the shaky stage in previous rehearsals, this could have been avoided",
            "score": 14,
            "author": "Sharkei"
        },
        {
            "level": 0,
            "comment": "Truly terrible news. My heart goes out to Wendy and the rest of RV. I hope she gets well soon 💙",
            "score": 4,
            "author": "ragnhildtorstensen"
        },
        {
            "level": 0,
            "comment": "i hope she takes as much time as she needs to rest to recover from this, it sounds absolutely scary and her health should always be #1.",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "its literally the start of comeback. how unfortunate...",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "She fractured her wrist and pelvic bone this is extremely serious the process of healing take months and is also very painful it also will most likely require surgery, I am not sure of what happened but apparently wendy was told to walk down some stairs (you can easily find the pic on twitter it's really scary)  but since it was dark they didn't notice those stairs weren't in place yet wich led her to fall from 2m this must have hurted so bad i am so angry at sbs it also need to be mentioned that jimin ,yeji and some other idols  also slipped on stage , some onces also said that twice experienced some problems too due to the stage being so shaky this is all proof that sbs completely neglected the safty mesures therefore they need to be sued",
            "score": 5,
            "author": "dally_dallly"
        },
        {
            "level": 0,
            "comment": "What a horrible thing to happen to a wonderful human being. I feel so sad for her.",
            "score": 6,
            "author": "Bizcotti"
        },
        {
            "level": 0,
            "comment": "really hope that SM takes all the time needed for wendy to fully heal, even if that means RV is a member down for extended periods. i hope this isnt going to be a case of an idol pushed back into work before fully healed and sustaining an even harsher lifelong injury due to it.",
            "score": 6,
            "author": "Carazhan"
        },
        {
            "level": 0,
            "comment": "This is horrible news to get on Christmas day. I hope she gets better.",
            "score": 5,
            "author": "beevii"
        },
        {
            "level": 0,
            "comment": "Oh my God... \n\nWendy :((( get well soon, we love you. I'm scared for her, hope she recovers well.",
            "score": 5,
            "author": "Kumigi"
        },
        {
            "level": 0,
            "comment": "MAN. Wendy was looking like she was gonna own this fucking era. So devastating.",
            "score": 5,
            "author": "Kotaac"
        },
        {
            "level": 0,
            "comment": "Non-apology as expected.\n\n[https://twitter.com/OH\\_mes2/status/1209770149659717634](https://twitter.com/OH_mes2/status/1209770149659717634)",
            "score": 14,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Textbook culture-of-saving-face apology. Not at all surprised.",
                    "score": 8,
                    "author": "nighoblivion",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Didn't think I'd be teary eyed on xmas as a grown ass man, but for this to happen to such an angel has me so down. They worked so hard, and this was their time to perform a masterpiece, enjoy the holiday, and get lots of love.",
            "score": 10,
            "author": "ohjbird3"
        },
        {
            "level": 0,
            "comment": "Holy shit, this is pretty serious.....Had she fallen any other way she could've been far more injured. Could SM pursue legal action against SBS?",
            "score": 14,
            "author": "sciencebottle"
        },
        {
            "level": 0,
            "comment": "Oh my God I hope she is okay and recovers well, this breaks my heart.... Poor wendy",
            "score": 4,
            "author": "sunlightdrop"
        },
        {
            "level": 0,
            "comment": "Fuck you sbs",
            "score": 4,
            "author": "alexlo123"
        },
        {
            "level": 0,
            "comment": "Poor Wendy :( and right at the beginning of the comeback promo too! I hope she recovers quickly! 🧡",
            "score": 3,
            "author": "JenFan91"
        },
        {
            "level": 0,
            "comment": "God when I imagine the fear she must’ve felt falling in the dark...SBS has to do more than an apology for this, they need to compensate Wendy. RV cb just started and sbs fvcked it up",
            "score": 4,
            "author": "strawberrydonut4"
        },
        {
            "level": 0,
            "comment": "This kind of dragged my holidays in the dump a bit. I was looking forward to RV stages and collabs then saw this first thing when I wake up. Compounded with the fact Mina from Twice not well enough to perform and Solar from Mamamoo taking a tumble, I don't even want to watch SBS Gayo Daejeon. 2019 has really been hard for kpop.",
            "score": 5,
            "author": "HumanityIzFukked"
        },
        {
            "level": 0,
            "comment": "This is absolutely unacceptable. I hope SBS gets sued for this. The sheer callousness they showed toward these artists, and toward Wendy especially. Disgusting.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "This is so scary!! I'm so disappointed at the stage safely wtf!! and I can't imagine how distraught Wendy and the girls must be feeling right now with the comeback just having started. I hope Wendy has all the support and time to heal that she needs! Sending her all the love.",
            "score": 4,
            "author": "emjemm"
        },
        {
            "level": 0,
            "comment": "I’m hoping Wendy has a speedy and healthy recovery...this breaks my reveheart. She has no family except for the SM family in Korea. I hope her parents can fly out to see her, as I can only imagine how worried her parents are. Take your time, Chipmunk. We’ll be waiting for you. 💙💙",
            "score": 5,
            "author": "BinnamonBoastBrunch"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Does anyone know if we as fans can do anything to help the situation? I want to help in some way but just feel so powerless",
            "score": 5,
            "author": "mistro364"
        },
        {
            "level": 0,
            "comment": "Idols need to start insuring their body parts. The regulations would appear instantly.",
            "score": 4,
            "author": "pizzawonder"
        },
        {
            "level": 0,
            "comment": "you didn't deserve this. hope you remain strong through it all 💙",
            "score": 10,
            "author": "WendyIsMyBias"
        },
        {
            "level": 0,
            "comment": "I wish Wendy a speedy recovery with no issues. Hope she doesn’t blame herself cause this is all on SBS with their negligence.",
            "score": 11,
            "author": "TIRIPIRI"
        },
        {
            "level": 0,
            "comment": "How awful, I hope she recovers quickly. SM should sue SBS for their negligence but I know better than to expect it :(",
            "score": 7,
            "author": "Onpu"
        },
        {
            "level": 0,
            "comment": "That’s horrible and they better sue SBS for a lot of money. I fractured my foot last year and was out of work 10 weeks. I feel really bad for Wendy...",
            "score": 7,
            "author": "nyalims",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Hopefully after she recover she the same Wendy that we know who a great singer and dancer. I'm really pray right now hoping her injuries is not bad as it sound.",
            "score": 5,
            "author": "blackazure"
        },
        {
            "level": 0,
            "comment": "Fuck! And right after such an awesome comeback too. \n\nI really hope she recovers well, no one deserves something like this, least of all someone like Wendy.",
            "score": 11,
            "author": "tagyhag"
        },
        {
            "level": 0,
            "comment": "I feel so devastated rn. We know she landed on her right side during the fall &amp; I am absolutely hoping nothing life-threatening comes to her. It’s disheartening that we can’t do anything but just wait for another statement. \n\nBut just... please have a full recovery  Wendy. Please. We want to see you soon. We want to see you sing, and be happy.\n\nIt’s 1:38am and this will probably keep me awake 😔",
            "score": 10,
            "author": "Kammakazi"
        },
        {
            "level": 0,
            "comment": "I'm genuinely fucking angry, SM better sue the fuck out of SBS. How are they still doing the show with these dodgy fucking stages.",
            "score": 10,
            "author": "YeriEnthusiast"
        },
        {
            "level": 0,
            "comment": "Anyone have a photo or video of the shaky stage that’s being mentioned?",
            "score": 6,
            "author": "lululelouchvb",
            "replies": [
                {
                    "level": 1,
                    "comment": " [Here](https://twitter.com/IsraaMad/status/1209799930660954112)",
                    "score": 7,
                    "author": "poppywars",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm so livid right now. SBS better fucking cover all her medical expenses and recovery.  \n\nI hope she heals well and doesn't blame herself for not being able to perform. This is all on SBS's negligence.\n\nGet well soon, Wannie. We love you.",
            "score": 8,
            "author": "internet0jesus"
        },
        {
            "level": 0,
            "comment": "where the hell did she fall from, looks like an elevating platform or something from her injuries. I hope she recovers soon and it's nothing serious",
            "score": 3,
            "author": "Madphromoo"
        },
        {
            "level": 0,
            "comment": "Hope she takes her time to do a full recovery. Get well soon Wendy !",
            "score": 3,
            "author": "Inferano"
        },
        {
            "level": 0,
            "comment": "can't sm do something right and sue the show or the staff or something, since it was their fault",
            "score": 3,
            "author": "voasil"
        },
        {
            "level": 0,
            "comment": "I hope she gets the proper amount of time she needs to heal and isn't made to get back on stage early\n\nI just noticed, I see the picture of the Chungha stage with the purple steps around, if you watch the start of Chungha's flourishing stage though it actually looks much higher then in the picture",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Jesus Christ, this is horrible. I hope she's okay and gets better soon. SM better sue the life out of SBS.",
            "score": 3,
            "author": "music_haven"
        },
        {
            "level": 0,
            "comment": "SBS done fucked up",
            "score": 3,
            "author": "Vaccaria_"
        },
        {
            "level": 0,
            "comment": "Fuck SBS, so many people were put at risk today, so many people fell including a child.",
            "score": 3,
            "author": "she_sus"
        },
        {
            "level": 0,
            "comment": "Get well soon Wendy! Omg..😔",
            "score": 3,
            "author": "lubbdubbs"
        },
        {
            "level": 0,
            "comment": "That sounds horrible :&lt; I hope she gets well soon",
            "score": 3,
            "author": "HeardCoco"
        }
    ]
}