{
    "id": "ga4ikb",
    "score": 5264,
    "title": "EXO’s Chen and His Wife Give Birth To Their First Daughter",
    "author": "Iblaka",
    "date": 1588142868.0,
    "url": "https://www.reddit.com/r/kpop/comments/ga4ikb",
    "media_urls": [
        "https://www.koreaboo.com/news/exos-chen-wife-birth-first-daughter/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "'April, and a flower' takes on a new meaning, congrats!",
            "score": 1035,
            "author": "JerSucks",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love this so much. His daughter is going to have the best lullabies for sure",
                    "score": 311,
                    "author": "sherriablendy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And the loudest \"wae\"s. Just kidding, congrats to Chen!",
                            "score": 218,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "How fitting and I didn't even realize that. Thanks for pointing it out! Congrats to Chen and his wife for bringing a healthy baby girl into the world!",
                    "score": 101,
                    "author": "JacksonDWalter"
                },
                {
                    "level": 1,
                    "comment": "This is the cutest connection 💖",
                    "score": 77,
                    "author": "m_--_m"
                },
                {
                    "level": 1,
                    "comment": "What a lovely observation 😭",
                    "score": 60,
                    "author": "austen1996"
                },
                {
                    "level": 1,
                    "comment": "A crying today. Thats too perfect. Jongdae really predicted the birth of his daughter 🥺",
                    "score": 226,
                    "author": "San7129"
                },
                {
                    "level": 1,
                    "comment": "I am so moved by this. this is wonderful news while things feel so uncertain. I am so happy and thrilled for Jongdae!",
                    "score": 43,
                    "author": "worldadjacent"
                },
                {
                    "level": 1,
                    "comment": "That's so cute!",
                    "score": 29,
                    "author": "Puncomfortable"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congratulations! Wow, he's a father now!",
            "score": 260,
            "author": "AimiRosie"
        },
        {
            "level": 0,
            "comment": "Congrats!! Their baby will have so many doting uncles for sure",
            "score": 244,
            "author": "mr85098"
        },
        {
            "level": 0,
            "comment": "Wow, that was fast. Thinking about how SM denied his girlfried was 7 months pregnant already when the news broke... lol turned out she was *just* six months or so. That made me laugh. But anyways, congratulations on the baby!",
            "score": 1491,
            "author": "larimalmeida",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 238,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Right? If she was 7 months pregnant already back in January, then she should've given birth a month ago. Seems like she got pregnant around August or September.",
                            "score": 114,
                            "author": "parabocake",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Technically they didn't lie tho\n\n\\*sips tea\\*",
                    "score": 415,
                    "author": "TYongz",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "LOL I’m so like this. If someone is t specific and gets something wrong I deny it and point out when they call me a liar that technically I didn’t lie. I knew what they meant but it’s not my job to help them out.",
                            "score": 151,
                            "author": "kriyator",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Could also be a preemie.  At this point, I've had relatives born nine weeks early and still end up being viable, so who really knows anymore.",
                    "score": 46,
                    "author": "Galyndean",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I hate the word preemie it sounds too much like creamy",
                            "score": 6,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They didn't lie at all since they didn't say anything about how far along she was. They denied that the wedding had already taken place, then stated that everything about the issue is a private matter.",
                    "score": 35,
                    "author": "pitapatuwu"
                },
                {
                    "level": 1,
                    "comment": "Actually 7 months in January would still be correct. Koreans say pregnancy is 10 months (Americans say 9 months), so an April birth is still correct.",
                    "score": 18,
                    "author": "pynzrz"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wonderful news, a little princess &lt;3   \nI hope everyone's happy and healthy.",
            "score": 104,
            "author": "lipsticksandsongs"
        },
        {
            "level": 0,
            "comment": "Jongdae is a married man and a whole father now 😭 i still cant believe it. The exos are uncles aww\n\nI cant imagine how happy he must be. Congrats! This baby girl is forever #1 soondingie",
            "score": 520,
            "author": "San7129",
            "replies": [
                {
                    "level": 1,
                    "comment": "If your heart isn't bursting by this point, just imagine him calling other EXOs to let them know he's a father now. Imagine Chanyeol and Baekhyun's over the top reactions. That's all.",
                    "score": 182,
                    "author": "music_haven",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Noooooooooo. 😭😭😭 My heart.",
                            "score": 49,
                            "author": "parabocake"
                        },
                        {
                            "level": 2,
                            "comment": "Nooo this is cute",
                            "score": 25,
                            "author": "landshanties"
                        },
                        {
                            "level": 2,
                            "comment": "As if I wasn't crying already",
                            "score": 7,
                            "author": "theweirdchickonline"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congratulations to the happy couple! \n\nI really hope this sets a precedent for other idols to pursue what makes them happy outside of music as well. I hope that the general public of Korea can see this as a blessing and that EXO’s fans aren’t upset by it. It would be so great to see more idols getting into relationships and continuing on with their lives while also remaining in the industry! Support is important now more than ever!",
            "score": 334,
            "author": "taobakas",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm currently working with a doctor from SK and she said a lot of working adults in the professional sector avoids marrying (or at least having children) because they don't want it to be a distraction to their careers. I assume it's the same for idols too. \n\nShe herself had a shotgun marriage at a young age and was deeply depressed by it back then, only to find out she's the only member in her family (except her parents and 2 uncles) who's currently married with kids. Her cousins are older but all are single.",
                    "score": 153,
                    "author": "kandnm115709",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well South Korea's work culture doesn't really encourage people to have a healthy work/life balance. Countries with a very low birthrate basically all have the same problem : women are expected to put their careers on pause when they have children, and are labeled bad mothers if they don't. Korean society is both super sexist and very work oriented, so it's no wonder they have the lowest birthrate in the world...",
                            "score": 123,
                            "author": "reiichitanaka"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Definitely, among the male first and second generation idols very few are married and have kids. Obviously some are still hiding their relationships from the public or prefer to live a single life but it does feel like some have missed out on this kind of happiness because they focused on their careers.",
                    "score": 56,
                    "author": "Puncomfortable"
                },
                {
                    "level": 1,
                    "comment": "I think it's going to get worse. Well, actually Twice's next comeback might be the measuring stick to most companies whether idols can get into open relationships. \n\nOn the surface level, all's good. Twitter is trending with blessings, fans seems to not care about the shotgun marriage but the reality is if these blessings don't translate into cold figures, the capitalist mechanism behind idol industry will find some other idols to push (just like how SM is pushing NCT over EXO already). In the crazy competitive world of kpop, someone will be willing to sell the \"I am married to my fans\" dream and there are big spenders (whales) who are willing to switch their support to the idols that \"dedicates themselves to them\". \n\nHonestly I hate this, music industry should be about the music and performance, but the idol industry is such a different beast...so I guess kpop's fate is really in the hands of the fans to vote with their wallets, to show relationships doesn't affect sales.",
                    "score": 33,
                    "author": "Pandapopo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think it honestly depends on the idol whether fans find it “acceptable” that they’re in a relationship. For example, you mentioned Twice, Jihyo’s been dating Daniel publicly for like a year maybe, maybe having Momo dating as well will make a difference. Super Junior’s Sungmin was essentially kicked out of the group for getting married, but no one cares about Big Bang’s Taeyang. Kai and Baekhyun have both publicly dated people, and despite backlash at the time, Exo is still loved and still grew incredibly popular despite dating “scandals.”",
                            "score": 29,
                            "author": "Tzuyu4Eva",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think the baby factor is the bigger question mark here. Even though idol relationships are still \"scandalous,\" they're not necessarily a career-killer anymore (I doubt that Twice's comeback will be heavily affected by Momo and Jihyo's relationships). Chen's marriage would have been controversial no matter what, but the Korean comments from random bystanders seem to find an idol being a *father* more unacceptable than just being a husband. I've seen a bunch of comments that don't seem to be from angry fans or antis, or even particularly harsh toward him, they're just like – \"Shouldn't he just go solo? How can a father be in an idol group?\" as if it's just obvious that that would be unacceptable. I don't think there's really a precedent for this. I hope that it becomes more normalized to everyone by the time his enlistment ends and group promos seem to be in EXO's future.",
                                    "score": 16,
                                    "author": "saranghaja",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "lol I remember when this news first broke, [SM denied that rumor that said Chen's GF/fiancee was seven months pregnant.](https://www.soompi.com/article/1376624wpp/exos-chen-announces-marriage-fiancees-pregnancy)\n\nSM: Actually, it was six.\n\nCongrats to the new parents, it's always a bit wild seeing currently active idols become parents. I'll check back in sixteen years and see if she's become a singer too.",
            "score": 658,
            "author": "CronoDroid",
            "replies": [
                {
                    "level": 1,
                    "comment": "I recall someone in the thread on that denial very confidently saying that she was *actually* only 2 months pregnant with no proof lol",
                    "score": 166,
                    "author": "yunglethe"
                },
                {
                    "level": 1,
                    "comment": "uhh korean source says it's an early birth, so she could be 5 or 4 month's pregnant at time of announcement. Who knows and honestly we have no business speculating that yeah?\n\nThat being said I'm not too sure if the term used in the korean source might imply it's a premature birth or not. Hope there's no complications for both the mom and the baby!",
                    "score": 124,
                    "author": "alive21",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s so strange that 2 of the top 3 comments are talking about SM’s statement and trying to figure out how far along his wife was/when she got pregnant. \n\nFirst of all, there isn’t enough information out there to be accurate. Second of all, it’s nobody’s goddamn business. There are so many different things that could happen during the process that it’s dumb to even speculate.",
                            "score": 95,
                            "author": "ParanoidAndroids",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not that strange really, this sub might be free from gossipy headlines but it's not difficult to find speculations of this nature in the comments",
                                    "score": 25,
                                    "author": "alive21",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "A sad truth. It's not that different from stan twitter after all, but at least the thread is overwhelmingly positive.",
                                            "score": 14,
                                            "author": "ParanoidAndroids"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I always find these headlines ridiculous cause she's the one who gave birth, not him, LOL.\n\nAnyway, super happy for them, congrats Chen!",
            "score": 249,
            "author": "music_haven",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha I know I’m always like “you could say this is a million ways that doesn’t imply he gave birth too”. They had their baby, their baby was born...",
                    "score": 103,
                    "author": "snakesareracist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's like couples who say \"We're pregnant!\". No you're not. *She's* pregnant.",
                            "score": 75,
                            "author": "nopizzaonmypineapple"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 238,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "That last line made me laugh so hard, so have an upvote",
                    "score": 76,
                    "author": "amazonstorm",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Saaame lmao",
                            "score": 14,
                            "author": "theweirdchickonline"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Rewatching him and Xiumin on TROS is so much more meaningful now.",
                    "score": 9,
                    "author": "Tzuyu4Eva"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yay!! I hope they’re happy and safe!!",
            "score": 43,
            "author": "aiznus"
        },
        {
            "level": 0,
            "comment": "Yay!! So so happy for them and hopefully they can go through this without being bothered by the (few) crazy fans that are against him.",
            "score": 104,
            "author": "seungyul",
            "replies": [
                {
                    "level": 1,
                    "comment": "theyve been bothering him and his family ever since the news broke in january.... they're not going to stop now :(",
                    "score": 76,
                    "author": "onetrickponySona",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Honestly I feel bad for Chen of course, neither him or his family deserve to be treated like that. However I kind of feel like for the industry in general this is one of the best things that could've happened. I'm not an exo-fan but if they can just keep promoting and doing well as they are with Chen as a husband and father, I think this will set a good precedent in the industry.\n\nIt will show that it's perfectly possible for an idol to both work and have a family and hopefully serve as evidence against people who use similar claims as justification for their hateful views. (Like fans who claim Chen has harmed exo by getting married and should be banned for it.)\n\nI kind of feel like by the time Chen has finished his military service and with exo ranking amongst the more established groups with considerable longevity, most of the criticism will have blown over by the time he comes out of service. As it will fall under the category of 'old news' and the general population will have long moved on to juicier and fresher gossip and scandals.\n\nThat being said I'm not Korean, so I have no idea how big the blow-up has been in their Korean fandom, you don't know if the people that are angry are outliers or represent the majority so I could be completely off here.",
                            "score": 73,
                            "author": "Le_Fancy_Me",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;That being said I'm not Korean, so I have no idea how big the blow-up has been in their Korean fandom, \n\nThe number of people that showed up to the protest demanding his removal from EXO is I think kinda telling of how most of the fandom actually... doesn't really care. It's just a minority that tries to make as much noise as they can.",
                                    "score": 72,
                                    "author": "reiichitanaka",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "doesnt care enough to show at the protest. *  unfortunately hate hashtags are getting trended in korea in high positions on Twitter every day, and especially today &gt;:( so its still a sizable amount... much more people than the amount that showed up at the \"protest\"",
                                            "score": 40,
                                            "author": "onetrickponySona"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I think it helps that exo are pretty 'old' by kpop standards. I think a lot of their fans are similar ages to exo members. Meaning many of them will be settling down themselves or maybe have already. So they are a bit more mature about the members doing the same. I'm not an elf either but I felt like for similar reasons the Heechul dating confirmations didn't seem that controversial.\n\nThe only legit complaints I heard about was because he was dating Momo (who some argued was too young or some just didn't like). Rather than just general complaints about him dating.",
                                            "score": 35,
                                            "author": "Le_Fancy_Me",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I think that EXO having dating \"scandals\" early in their careers really helped them in having a more level headed fandom.",
                                                    "score": 27,
                                                    "author": "reiichitanaka"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "you would think the fans would be more mature, but they aren't. take a look at Sungmin's case for example when he got married, and how they threw a protest at Henry joining super junior. and how many years was it since super junior debuted at the time it happened? korean exo fans are pissed about Chen and it's not a minority at all.",
                                                    "score": 6,
                                                    "author": "flyingpokecheck32",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Sungmins example is good one to compare to, but Henry joining SJ was thirteen years ago when SJ was relatively new at 2 years into debut...and one year since Kyuhyun was added (also had a protest but the fanbase was comparatively small back then...they've never even won a first place before Kyu)",
                                                            "score": 12,
                                                            "author": "potatodoppelganger"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;korean exo fans are pissed about Chen and it's not a minority at all.\n\nI'm not too sure these antis can be considered EXO fans anymore. The rest of EXO and SM have shown their full support to Chen, something that didn't happen at all in Sungmin's case.",
                                                            "score": 18,
                                                            "author": "reiichitanaka"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I honestly don't know, like I said I'm not Korean so it's pretty hard to get a full grasp of the mood within the fanbase. You hear about some nasty comments and protests but honestly online it's usually the 'crazy' fans that are noticed, while others that don't care aren't as vocal. It's not uncommon to see 1 hateful comment and then 99 comments calling out haters, making the issue seem more controversial then it actually is. So honestly idk, it'd be kind of interesting to see a poll or something to get a grasp on the overall feelings inside the fandom. But of course that'll never happen.\n\nI don't know about either Sungmin's or Henry's cases in any detail. But honestly I feel like Sungmin's case was handled about as badly as it could've been. Rumours got out, they were denied, then kind of confirmed but not really. It also didn't appear that his fellow members or SM were quite ready to back him up either. While I kind of feel like with Chen they are kind of being a uniform front? Like with Sungmin I know there were some members apologizing for the situation to fans. While exo and SM now are seemingly far more unapologetic about it. Like with Sungmin I felt like they kinda tried to cover up and apologize and cringe away like Sungmin was at fault. While with Chen they are kind of much more firm about it? At least that's the impression that I've been getting.\n\nI honestly think that the damage was way more severe for Sungmin than it was for Chen. I also kind of feel like attitude towards idol is kind of rapidly changing both in companies and within the fandom. I think Gen 1 and 2 catered way more towards the 'boyfriend' experience and really played it up. I think Gen 3 and 4 have really toned that down (some groups more than others but I feel like just in general the attitude is different now). Previously idols would sign 10 year contracts with dating bans and be expected to wait with settling down until after contracts expire. For new groups the contracts seem more reasonable, usually 7 years or so, and dating is usually not forbidden for the entire length of the contract. Also I think if a group (mainly boygroup) makes it to the 7 year mark, I think it's more common for them to resign again. So it can't just be expected that they 'wait out' their contract. Since they may be expected to stay in their group for longer than previous generations.\n\nI don't think the stigma around dating is going away anytime soon but I do feel like even in the last decade or so it has gone down significantly. Which is why I felt like, although of course it's unpleasant for Chen, his marriage will actually be a good thing for Kpop in general. I really hope he keeps promoting for a long time with exo and that both SM and his members will continue to show of those shiny spines and remain on Chen's side in this.",
                                                            "score": 8,
                                                            "author": "Le_Fancy_Me",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I'm not really paying attention to the \"drama\" around this anymore so take my opinion with a grain of salt, but the vibe that I've gotten is that there is a large portion of k-fans who are kind of just...ignoring it? Like they're not actively protesting for his removal or participating in sending him hate, but they're just not mentioning Chen anymore when talking about EXO, as if he doesn't exist. I've seen other translated posts about  random stuff involving EXO, and I've barely seen any mentions of Chen since January. It's like they become the Mariah \"I can't read suddenly, I don't know\" gif as soon as he's brought up. Hopefully I'm wrong, and hopefully they'll all get over it eventually, but yeah.",
                                                                    "score": 4,
                                                                    "author": "saranghaja"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Not trying to burst your bubble, but to them, it's much easier to hide in your room and behind a keyboard to throw hate towards him than showing up and being an embarrassment of yourself.",
                                            "score": 25,
                                            "author": "yujuismypuppy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You can be a very small minority and make a lot of noise online. The protest was ridiculous and it destroyed the credibility of those antis. And I don't think Chen is paying any attention to them atm, he's busy with a baby.",
                                                    "score": 24,
                                                    "author": "reiichitanaka"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I hope everyone involved is healthy and happy. I’m so SOOOO happy about this, this made my day 😭 \n\nEnjoy the baby and each other, Jongdae 💖",
            "score": 121,
            "author": "prideinparanoia"
        },
        {
            "level": 0,
            "comment": "I'm soo happy for him!! Wishing the little princess health and happiness &lt;3",
            "score": 26,
            "author": "-Afya-"
        },
        {
            "level": 0,
            "comment": "Awww this is so exciting!! Congrats to them. I just know that kid is gonna be adorable af",
            "score": 24,
            "author": "shewshine"
        },
        {
            "level": 0,
            "comment": "Congrats!! The headline is funny though, implying he also gave birth. I know the intention but they could’ve just said Chen’s wife gave birth to a beautiful baby",
            "score": 88,
            "author": "particledamage"
        },
        {
            "level": 0,
            "comment": "Jongdae is now a Jongdaddy. Congratulations to him, and may his family many blessed years.",
            "score": 80,
            "author": "joesen_one",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cue PSY song..",
                    "score": 8,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wait, wife? So they're already married?",
            "score": 19,
            "author": "TYongz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep! They had a private ceremony.",
                    "score": 18,
                    "author": "oshrn"
                }
            ]
        },
        {
            "level": 0,
            "comment": "EXO-L how are we feeling? We are aunties and uncles now!",
            "score": 125,
            "author": "Cxrioxs",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m tearing up because of happiness! I’m so excited to see the real Chen dad side!",
                    "score": 40,
                    "author": "Aeriveluv"
                },
                {
                    "level": 1,
                    "comment": "I’m so happy for him like smiling ear to ear thinking about how much happiness his family is going to give him",
                    "score": 26,
                    "author": "squiddlysquid"
                },
                {
                    "level": 1,
                    "comment": "Super happy for him and his wife. 😊\n\nBut also suddenly feeling really old. People my age are getting married and having kids already? Damn. Where has time gone? 😂",
                    "score": 22,
                    "author": "parabocake",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is exactly where I am lol. Great, congrats to him and his family! ...Holy shit I am so old.",
                            "score": 3,
                            "author": "saranghaja"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Very very happy &lt;3 This is such a beautiful news, I'm just so overwhelmed with happiness for Chen and his wife! It's crazy how much we have experienced with Exo, we truly have grown up with them.",
                    "score": 30,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "I'm...overwhelmed. When I started stanning in 2013 I never thought I'd be here 'til the day the became fathers too, it's crazy! I can't believe he's a whole dad now. But I'm so happy for him and his wife and I'm hope the baby is healthy, and they get the privacy they deserve.",
                    "score": 11,
                    "author": "Stormlady"
                },
                {
                    "level": 1,
                    "comment": "I don't know how I can have so much love for a little nugget I've never met.",
                    "score": 55,
                    "author": "leonoraMTY"
                },
                {
                    "level": 1,
                    "comment": "He better keep her away from the other members or she'll be spoiled rotten lol. I mean, just look at how Kai has interacted with kids in those variety show clips. haha.",
                    "score": 5,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "OMG Congrats Chen and his wife on their daughter!! I hope everybody stays healthy. This is so exciting wow .. Chen is a dad and EXO has a niece now :’))\n\n\nP.s. Zayn’s and Chen’s babies better collab in 18 years...Make it happen haha",
            "score": 34,
            "author": "txtrose"
        },
        {
            "level": 0,
            "comment": "Congratulations to them!",
            "score": 15,
            "author": "foxhatt"
        },
        {
            "level": 0,
            "comment": "Awww this is so exciting! I really hope he gets the chance to enjoy being a new father &amp; doesn't get bothered by his antis during this time. \n\nBut aw I'm so happy for him, I think he is going to be a great father and the rest of EXO are going to be the adoring yet chaotic uncles 😂",
            "score": 15,
            "author": "PinkPurplePolkaDots"
        },
        {
            "level": 0,
            "comment": "I'm gonna cry, I'm so so happy !! I hope that everything went well and that they're all doing good! Congratulations to Jongdae and his wife, I wish them all the best! ❤️",
            "score": 43,
            "author": "cucumberrain"
        },
        {
            "level": 0,
            "comment": "oh HELL yeah I hope he posts photos of the baby!! (even though I would definitely understand if he didn't!!!)\nThe thought of EXO uncles makes me cry ahhhh :')",
            "score": 29,
            "author": "unofficialnasa"
        },
        {
            "level": 0,
            "comment": "Congratulations! \nZayn and Chen's kids are really coming to save the vocal industry 😭",
            "score": 77,
            "author": "tsukisun",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wait what Zayn will be a father? Lmao am i living under a rock, i didnt know",
                    "score": 66,
                    "author": "San7129",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, him and gigi are expecting a baby!",
                            "score": 33,
                            "author": "tsukisun"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wait, Zayn is having a baby? Also lol at how that took me back to my teen years in a millisecond, love it when old fandoms reemerge to kick you in the teeth when you least expect it",
                    "score": 50,
                    "author": "m_--_m",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, Gigi is pregnant 😭",
                            "score": 22,
                            "author": "tsukisun",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is so cute, alexa play Little Things",
                                    "score": 23,
                                    "author": "m_--_m"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Zayn's having a kid?? Damn this thread is two good news for the price of one.",
                    "score": 11,
                    "author": "awkwardgirl"
                },
                {
                    "level": 1,
                    "comment": "[This tweet though XD](https://twitter.com/94uIts/status/1255257680094154753?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1255257680094154753&amp;ref_url=https%3A%2F%2Fs9e.github.io%2Fiframe%2Ftwitter.min.html%231255257680094154753)",
                    "score": 17,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "😂",
                            "score": 4,
                            "author": "tsukisun"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Aww! Congrats to the couple and welcome to the world, little one!",
            "score": 12,
            "author": "BamFeria"
        },
        {
            "level": 0,
            "comment": "Aww. Congrats to them!",
            "score": 12,
            "author": "milkysehun"
        },
        {
            "level": 0,
            "comment": "omg i was actually just wondering a few days ago when /that/ was gonna happen lmao congrats !",
            "score": 12,
            "author": "fluffygr"
        },
        {
            "level": 0,
            "comment": "My heart is melting. Congratulations to them and hopefully both mom and baby are doing well &lt;3",
            "score": 10,
            "author": "ReVeLuVoL"
        },
        {
            "level": 0,
            "comment": "How exciting!! Congrats to him and his wife!",
            "score": 12,
            "author": "greydandelion"
        },
        {
            "level": 0,
            "comment": "What wonderful news! So happy for Jongdae and his family. I can only imagine how wonderful of a father he’ll be, and how his daughter will have the most loving but chaotic bunch of uncles. I only wish that he’d been able to share this with us on his own terms, and hope that moving forward he gets the privacy and peace he deserves.",
            "score": 13,
            "author": "austen1996"
        },
        {
            "level": 0,
            "comment": "CHEN GAVE BIRTH",
            "score": 28,
            "author": "Polish_Duck"
        },
        {
            "level": 0,
            "comment": "SM finally confirmed the news! May Jongdae and his lovely little family be happy forever and always 😭💕",
            "score": 22,
            "author": "sherriablendy"
        },
        {
            "level": 0,
            "comment": "JONGDAE IS FINALLY JONGDAD",
            "score": 11,
            "author": "oshrn"
        },
        {
            "level": 0,
            "comment": "congratulations! Happy for both of them :D❤️",
            "score": 10,
            "author": "iSwedishVirus"
        },
        {
            "level": 0,
            "comment": "Congrats to them! I'm so happy for them! ❤️",
            "score": 10,
            "author": "Phantom_Minds"
        },
        {
            "level": 0,
            "comment": "I'm so, so happy for them!",
            "score": 11,
            "author": "The-Blue-Zephyr"
        },
        {
            "level": 0,
            "comment": "Congrats to them~!",
            "score": 10,
            "author": "iamfurancesco"
        },
        {
            "level": 0,
            "comment": "Awww!! Congratulations to the parents!",
            "score": 10,
            "author": "nerfherder01"
        },
        {
            "level": 0,
            "comment": "So happy to hear! I hope his wife and their baby girl are healthy and happy as well. 😊",
            "score": 9,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Aaaahhhh!!! Congratulations! 🎉🎊🎈 I‘m so happy for them! All the best for their little family :,)",
            "score": 10,
            "author": "ppalganmatata"
        },
        {
            "level": 0,
            "comment": "Awww congrats to him and his wife! Baby's going to get spoiled rotten by her EXO uncles💖😄",
            "score": 9,
            "author": "violetdonut"
        },
        {
            "level": 0,
            "comment": "Congrats to Chen and his family! I hope they get to spend a lot of quality time together before he has to enlist.",
            "score": 9,
            "author": "SugarFolk"
        },
        {
            "level": 0,
            "comment": "im emotional wow\n\nso happy for them ♡",
            "score": 8,
            "author": "bomiwasseoyo"
        },
        {
            "level": 0,
            "comment": "Aww how cute 😍 congratulations to them. \nHope we get to see the baby eventually lol. I love babies.",
            "score": 10,
            "author": "lmpostorsyndrome"
        },
        {
            "level": 0,
            "comment": "JONGDADDY! I wonder who is the proudest uncle.",
            "score": 10,
            "author": "HPDDJ"
        },
        {
            "level": 0,
            "comment": "I'm not even EXO-L but I'm so happy and excited! AAAAAHHHHHHH Congratulations! \n\nEven though mentioning the clinic name is not that good of an idea, it couldn't have been better timing because pandemic restrictions should prevent fans swarming the area (hopefully).",
            "score": 8,
            "author": "Mochisanni"
        },
        {
            "level": 0,
            "comment": "GUYS IT ACFUALLY FINALLY HAPPENED EEEEEEEE. this child is going to grow up loved by not only his/her parents but by the whole kpop community",
            "score": 9,
            "author": "staypeach11"
        },
        {
            "level": 0,
            "comment": "As someone outside of the Exo fandom can I offer my sincerest congratulations and I hope everyone is very happy 🎉🎊",
            "score": 9,
            "author": "Niight_Owl"
        },
        {
            "level": 0,
            "comment": "OH MY GOD!!!!!!!!!!!!!!!!!!!!!! :')",
            "score": 8,
            "author": "anterogradeamnesia"
        },
        {
            "level": 0,
            "comment": "I'm here for news like this! Congrats to both of them and welcome little girl &lt;3 wishing them the best :)",
            "score": 9,
            "author": "popbitesitself"
        },
        {
            "level": 0,
            "comment": "Awww congrats son....I'm a grandmom",
            "score": 8,
            "author": "hipployta"
        },
        {
            "level": 0,
            "comment": "Never saw it coming that Chen would be giving birth one day lol",
            "score": 8,
            "author": "MicaLovesKPOP"
        },
        {
            "level": 0,
            "comment": "On twitter they’re calling her an exo princess and that is just so cute. I’m so happy for him. Wow",
            "score": 8,
            "author": "kjhtclhrj",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh wow my heart can't-",
                    "score": 4,
                    "author": "xxzard"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is such heartwarming news! Congrats to the happy couple, I hope everyone is safe and doing well!",
            "score": 7,
            "author": "oneyesterday"
        },
        {
            "level": 0,
            "comment": "**BIG DADDY CHEN IN THE BUILDING ALL!**\n\nNow, first of all, congratulations are in order to our brand new mom and dad! That Mom and Daughter are in good health and spirits, and recovering well. \n\nSecondly, a warm congratulations to their family and friends on this happy occasion! Also EXO UNCLES are now on duty, they literally have a little princess in their midst!",
            "score": 6,
            "author": "AoifeCheeks"
        },
        {
            "level": 0,
            "comment": "I'm so excited to learn her name now hehe",
            "score": 27,
            "author": "sakurasangel",
            "replies": [
                {
                    "level": 1,
                    "comment": "He won't.SM will probably reveal similar to Kang Gary marriages.\n\nThey won't releases her name but probably will give insight how both of them met.",
                    "score": 3,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sehun: but I’m baby?\n\nCongrats to Jongdad and his wife 😫😫😫 hope she has a speedy recovery and both of them gets lots of rests now because they sure as hell won’t get in the near future",
            "score": 19,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I stumbled on this on a study break. Congrats to Chen! I’m sure he will make a great father.",
            "score": 7,
            "author": "fishbowl147"
        },
        {
            "level": 0,
            "comment": "congrats!! im so happy for them :)",
            "score": 5,
            "author": "perfectlycookedsteak"
        },
        {
            "level": 0,
            "comment": "OH MY GOSH!! Congrats to the new parents!\n\nThat little girl is so lucky, so many doting uncles.\n\nCan't wait for EXO to release a nursery rhymes album lol",
            "score": 5,
            "author": "leonoraMTY"
        },
        {
            "level": 0,
            "comment": "Woooh! Congrats Chen and wife! I’m so excited and happy for them!",
            "score": 6,
            "author": "Aeriveluv"
        },
        {
            "level": 0,
            "comment": "IM SO HAPPY FOR DADDY JONGDAE, HIS WIFE AND BABY GIRL ♡",
            "score": 7,
            "author": "WangXianEXO"
        },
        {
            "level": 0,
            "comment": "I can imagine all the EXO members being great uncles. Chen is going to be a great dad. Congratulations",
            "score": 6,
            "author": "doom_and_despair"
        },
        {
            "level": 0,
            "comment": "I don't think I've read a news before about an idol being a parent. I'm happy for him!",
            "score": 6,
            "author": "grey_unxpctd"
        },
        {
            "level": 0,
            "comment": "Im so happy for him and his little family :')",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "YAY congratulations to him and his wife!!!",
            "score": 6,
            "author": "TIRIPIRI"
        },
        {
            "level": 0,
            "comment": "this little girls gonna have so much power, her uncles are exo oh my god. \n\nshe's gonna be spolit :)",
            "score": 11,
            "author": "austrAlian_amIgo"
        },
        {
            "level": 0,
            "comment": "AHHHHHH my heart is bursting for him and his wife!! Congratulations!! \n\nLol the first of my biases to not only be married but have a kid too. Chen should release an album of lullabies while he's at it haha.",
            "score": 4,
            "author": "paradiseshine"
        },
        {
            "level": 0,
            "comment": "I wonder if she hit that high note coming out.  LOL",
            "score": 5,
            "author": "Sweet_N_Vicious",
            "replies": [
                {
                    "level": 1,
                    "comment": "*I can't believe~*",
                    "score": 4,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Chen saw Zayn's news and said no-oh \n\nJokes aside, many congratulations on their little princess. I am sure she will grow well surrounded by her crazy uncles. And uwu, Chen is going to be the best daddy.\n\nNo wonder EXO's songs are full of baby girl. It was meant to be",
            "score": 9,
            "author": "Thelandoflambs"
        },
        {
            "level": 0,
            "comment": "I'm crying... sending the best of wishes to Jongdae and his wife!! I hope his daughter grows up healthy and happy and is spoiled by her many uncles 🥺✨❤️",
            "score": 9,
            "author": "danosaurrx"
        },
        {
            "level": 0,
            "comment": "congratulations!!! 💓🎁🎊🧸😻\n\nit would be so fun if one day they feel comfortable to share some of their joy with us, but i understand if they don’t. i just hope they are all healthy. good luck to the new parents!",
            "score": 7,
            "author": "ghiblix"
        },
        {
            "level": 0,
            "comment": "IM SO HAPPY FOR THEM!",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Congrats! I'm happy for them! :)",
            "score": 5,
            "author": "depressed_musician_"
        },
        {
            "level": 0,
            "comment": "Congrats to them, this is wonderful news in terrible times 💕",
            "score": 5,
            "author": "Consuela_no_no"
        },
        {
            "level": 0,
            "comment": "congrats!! hope she is always healthy!",
            "score": 5,
            "author": "hiphoepreaper"
        },
        {
            "level": 0,
            "comment": "Chen’s daughter and Bojo’s son are born on the same day",
            "score": 3,
            "author": "i-have-no-idea-help"
        },
        {
            "level": 0,
            "comment": "This makes me happy and I hope it starts a trend. Come on, Sungmin, give us an SJ baby!",
            "score": 3,
            "author": "babylovesbaby"
        },
        {
            "level": 0,
            "comment": "I am so happy for Chen and his wife.  I could almost burst.\n\nHey guys, we have an EXO princess.  :D",
            "score": 4,
            "author": "Galyndean"
        },
        {
            "level": 0,
            "comment": "Congratulations!   \n\nOn the one hand, this is further evidence that going to sleep is a terrible idea. On the other hand, I'm so happy for the both of them!",
            "score": 4,
            "author": "Werewolfhugger"
        },
        {
            "level": 0,
            "comment": "EXO-Ls are currently trending a hashtag on twitter welcoming their little princess. That's so cute. 🥺",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "CONGRATULATIONS TO MY FAVORITE BOY AND HIS GIRL AND HIS LITTLE BABY 😭💖💖💖💖",
            "score": 4,
            "author": "chai7leeb"
        },
        {
            "level": 0,
            "comment": "We have a little angel now. We are all uncles and aunties now. We are now protectors of a different nature. Little Chenette, we welcome you to this world. Congratulations to the couple!",
            "score": 4,
            "author": "KpopKraziness"
        },
        {
            "level": 0,
            "comment": "MY HEART WELCOME TO THE WORLD BABY JONGDAE!! 😭😭❤",
            "score": 3,
            "author": "Optimal-Market"
        },
        {
            "level": 0,
            "comment": "I hope that the little one and her mama are both healthy ❤️ \n\nI don’t think it’s worth discussing how far along Chen’s wife was. There is literally no way for us to know the truth, at all. All I’m hoping for is that they are healthy and  that the little one is thriving!",
            "score": 5,
            "author": "sciencebottle"
        },
        {
            "level": 0,
            "comment": "I hope the haters leave him alone now and let him and his family enjoy this new blessing in peace. God, I hate the amount of fcking haters and their idiocy and logic in hating a Kpop idol. I wish Chen and his family all the best and I hope his wife and baby are both healthy! \n\nCould imagine Chen singing a sweet lullaby to his baby girl 😊",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Nation's vocalist, nation's dancer, nation's visual... And now, nation's dad!\n\nCongratulations, Jongdae.  ❤️",
            "score": 4,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "The hell have I been? Lol I ain’t know Chen had a wife or a baby. Cool",
            "score": 5,
            "author": "jaidreamin"
        },
        {
            "level": 0,
            "comment": "Congrats to them!\n\nAs an aside, it will always bother me when people include the man in their 'giving birth' posts/headlnes. Like, I'm preeety sure only one of those people actually gave birth. Just say 'welcome their first daughter' if you wanna talk about both parties, it's not that hard.",
            "score": 3,
            "author": "Cahbr04"
        },
        {
            "level": 0,
            "comment": "Congrats to Chen and wife! Now I want them on ROS when she becomes a toddler!\n\nI don't follow EXO anymore, but when was his last activity and what are EXO up to these days?",
            "score": 7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "He released a collab song with Dynamic Duo a few days after the pregnancy and marriage news broke in January...I think that was his last activity that I can think of. Other than that, it was EXO's group comeback period in late November/early December. He was pretty busy in 2019 with touring and his 2 solos though, and he's always had much less of an online presence than the other members, so I'm hoping that he's just been staying low-key while busy preparing for the baby rather than hiding out of nerves or pressure from SM. \n\nThe other members are all pretty active and have mostly been preparing for solo or unit activities so far this year. Suho just had his solo and is likely to enlist soon. Baekhyun's having a solo comeback soon, Kai's heavily rumored to have a solo at some point this year, Chanyeol and Sehun have been teasing EXO-SC activities, and SuperM is scheduled to come back too, so KaiBaek will also be busy with that. Lots of random solo activities here and there as well with OSTs, brand partnerships, collabs, photoshoots etc.",
                    "score": 3,
                    "author": "saranghaja"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lol she gave birth to the kid not him",
            "score": 8,
            "author": "nopizzaonmypineapple"
        },
        {
            "level": 0,
            "comment": "Other idols, younger and older, probably look at him with awe and envy. How many of them can boast having a spouse AND a child at his age? He's totally one of the luckier idols in his generation. Congrats, Jongdae.",
            "score": 16,
            "author": "kandnm115709",
            "replies": []
        },
        {
            "level": 0,
            "comment": "congratulations to the brand new parents!\n\ni have a sliver of hope that this precedent will help idols to have an easier time dating and increasing acceptance towards marriage. none of us will get married to our favourites \\^\\^\n\npeople WILL eventually get used to this and the next idol who marries will now be \"ah, like EXO's chen\".",
            "score": 6,
            "author": "JenkinsHowell"
        },
        {
            "level": 0,
            "comment": "Congratulations! Baby's gonna be the nations next vocalist",
            "score": 3,
            "author": "Einescii"
        },
        {
            "level": 0,
            "comment": "Congrats to the new parents! 🎊",
            "score": 3,
            "author": "parabocake"
        },
        {
            "level": 0,
            "comment": "OH MY GOSH OH MY GOSH OH MY GOSH OH MY GOSHSMFL",
            "score": 3,
            "author": "hnlmln"
        },
        {
            "level": 0,
            "comment": "i’m so happy for them 😭😭😭😭😭",
            "score": 3,
            "author": "abidaabidaabida"
        },
        {
            "level": 0,
            "comment": "Oh wow, I was wondering just the other day how he was going with this.\n\nNot going to lie, Chen wasn’t the first member I expected to become a dad.",
            "score": 3,
            "author": "Farrug"
        },
        {
            "level": 0,
            "comment": "Wow a little girl!! I know Chen is too private to ever post pictures but I bet she's the cutest",
            "score": 3,
            "author": "CookieCatSupreme"
        },
        {
            "level": 0,
            "comment": "Massive congratulations to them both. How exciting! I hope both mother and baby had a nice, safe, easy delivery and are happy and healthy. May they be a blissful family unit always.",
            "score": 3,
            "author": "LuxandGold"
        },
        {
            "level": 0,
            "comment": "So happy for Chen--one of the best voices out there, Much luv..",
            "score": 3,
            "author": "mrdcomm"
        },
        {
            "level": 0,
            "comment": "Congrats to them :)\nBtw when did he get married? Last I heard it was fiance/girlfriend. Good for them if they could have it on the downlow",
            "score": 3,
            "author": "9maimz4",
            "replies": [
                {
                    "level": 1,
                    "comment": "They got married in January/February in a private ceremony. The original news about his marriage was that it would be at the start of the new year.",
                    "score": 3,
                    "author": "aridnie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "congratulations for chen and his wife ♥",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "i literally can't believe this still. who knew our baby would be a father this early",
            "score": 3,
            "author": "meridavez"
        },
        {
            "level": 0,
            "comment": "Hooray woo hoo!",
            "score": 3,
            "author": "btssxphia"
        },
        {
            "level": 0,
            "comment": "Congrats Chen!! Please stay on Exo tho. I know a lot of fans got mad at him, but literally how. Dude's done so much for us, I wish him nothing but the best.",
            "score": 3,
            "author": "NotEricOfficially"
        },
        {
            "level": 0,
            "comment": "Awww! This is great news! Congrats to the lovely couple.",
            "score": 3,
            "author": "SassyHoe97"
        },
        {
            "level": 0,
            "comment": "That's so cute aww",
            "score": 3,
            "author": "Zeeyyaa"
        },
        {
            "level": 0,
            "comment": "happiest day of 2020 😭\n\ncongrats to our jondaeddy!!",
            "score": 3,
            "author": "azxla"
        },
        {
            "level": 0,
            "comment": "So incredibly happy for them, and so happy most fans seem to be happy! \nThe best feeling of being part of a fandom is when everyone are happy and sharing the love, hope it can happen more often. \n\nWishing the Kim family lots of happiness in the future too!",
            "score": 3,
            "author": "Likethesunisan"
        },
        {
            "level": 0,
            "comment": "It’s so weird to think of him as a dad and a husband. Contacts to them! Hope his wife recovers well.",
            "score": 3,
            "author": "wildbeest55"
        },
        {
            "level": 0,
            "comment": "the same jongdae who was always passionate on stage, the same jongdae who was always sincere with his fans and members, the same jongdae who gave us wonderful vocals is now a father and I couldn't be happier. just as you have always said you are a proud member of exo, i will also say without hesitation that i am a kim jongdae fan with total pride.\nwelcome little princess!!!!!!!",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I hope he can show up on the return of Superman lmao",
            "score": 3,
            "author": "chamise"
        },
        {
            "level": 0,
            "comment": "I forgot he got married and stuff. \n\nAwesome! Congrats to Chen and family!",
            "score": 3,
            "author": "Ducky2322"
        },
        {
            "level": 0,
            "comment": "I’m so happy for him!",
            "score": 3,
            "author": "dogstope"
        },
        {
            "level": 0,
            "comment": "OUR ANGEL HAD A LITTLE ANGEL AND I'M SO HAPPY FOR THE THREE OF THEM.",
            "score": 6,
            "author": "theweirdchickonline"
        },
        {
            "level": 0,
            "comment": "I'M CRYING WHAT IF WHEN CHEN FIRST HEARD HER CRYING HE THOUGHT NO MUSIC COULD EVER BE MORE BEAUTIFUL WHAT IF HE'S HOLDING HIS LITTLE GIRL LIKE SHE'S THE LOVE OF HIS LIFE SOMEONE HOLD ME I'M SO HAPPY FOR THEM",
            "score": 6,
            "author": "jeonginnielix"
        },
        {
            "level": 0,
            "comment": "Congrats!",
            "score": 2,
            "author": "bhishma-pitamah"
        },
        {
            "level": 0,
            "comment": "It's a baby girl awww that's so awesome. &lt;3",
            "score": 2,
            "author": "pitapatuwu"
        },
        {
            "level": 0,
            "comment": "Awwwww :3",
            "score": 2,
            "author": "[deleted]"
        }
    ]
}