{
    "id": "je37b7",
    "score": 4876,
    "title": "Happy 5th Anniversary to TWICE!",
    "author": "PicklesandHam",
    "date": 1603119600.0,
    "url": "https://www.reddit.com/r/kpop/comments/je37b7",
    "media_urls": [
        "https://i.redd.it/hgkynqmsf2u51.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "A big, heartfelt round of congratulations to the nine extraordinary women of TWICE. As someone who has been a fan of the group since debut, I couldn’t possibly have imagined back then being where we are today. The diligent, earnest, and humble outlook they had at the very beginning still remains true today, five years on from 2015. The road hasn’t been easy, and these past 2 years have been especially tough. My most fervent wish is for Twice’s health and happiness going forward. Congratulations to TWICE, and many thanks from a steadfast once since debut!",
            "score": 365,
            "author": "drhcc",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly, the only reason I got into Twice was because of Tzuyu's controversy. At that time, there were so many new groups and I really only stayed into K-Pop because of SNSD. I felt so bad for Tzuyu though, so I checked out Twice and the rest is history for me. \n\nFrom going to all their US stops on their Twicelights tour last year to always copping all their albums circa Signal era, I wouldn't change my current interest in this group or K-Pop at all. \n\nI can't wait to see what the future has in store for these girls.",
                    "score": 110,
                    "author": "okaysian",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "what was tzuyu’s controversy?",
                            "score": 18,
                            "author": "seungyounie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "She held up a Taiwan flag and China got mad at her",
                                    "score": 96,
                                    "author": "bollarcones",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The crazy thing was that it wasn't even a big flag, it was the size of a desk flag.  Plus she held it for a few seconds at most.",
                                            "score": 41,
                                            "author": "kood25",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And she's Taiwanese! It's kind of absurd that the rest of the world is supposed to pretend Taiwan doesn't exist",
                                                    "score": 57,
                                                    "author": "__ByzantineFailure__"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "LOL even just \"Taiwan\" is enough to rile them up. See what happened with Kiryu Coco (the biggest superchat earner in YouTube ever) and Akai Haato when they showed Google Analytics data that showed \"Taiwan\" in its graphs.",
                                                    "score": 23,
                                                    "author": "wan2tri",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I heard something similar* happened to BTS also? Don’t know the story though",
                                                            "score": 3,
                                                            "author": "kingkuya777",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "They brought up Taiwan too? I thought it was about the Korean War for BTS",
                                                                    "score": 8,
                                                                    "author": "wan2tri",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Well it’s bullshit from Chinese nationalists all the same",
                                                                            "score": 14,
                                                                            "author": "kingkuya777",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Lol yeah that's still the case even if the situation was a bit different",
                                                                                    "score": 3,
                                                                                    "author": "wan2tri"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; The crazy thing was that it wasn't even a big flag\n\nWait what?\nOf all the things about the scandal, *that's* the crazy thing?\nThat the flag wasn't big?",
                                                    "score": 2,
                                                    "author": "Certain_Abroad",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It was a tiny little flag that she held for a moment, she wasn't waving some huge thing you'd find in the Olympics.  Yet China went nuts and that little incident torpedoed Twice's chances at the Mainland Chinese market for good.\n\nIt also influenced Taiwan's presidential election in 2016, bolstering the vote towards a pro-independence president.\n\nAll because of a little flag the size of which you'd typically find on the desk at the principal's office.",
                                                            "score": 18,
                                                            "author": "kood25",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I would have thought publicly shaming and bullying a child for nonchalantly carrying the flag of her home country would be *slightly* crazier than whether the flag fits on a desk or not.",
                                                                    "score": 2,
                                                                    "author": "Certain_Abroad",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The Chinese reaction was absurd, I'm no longer surprised at how thin skinned they get when it concerns something of \"theirs\".  \n\nBut the way Chinese netizens reacted you would think that she was waving a parade banner around and yelling Taiwan #1 at the top of her lungs.",
                                                                            "score": 1,
                                                                            "author": "kood25"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It was a tough 5 years though, we only know  about past 2 years as JYPE disclosed it.\n\nTheir 2015-18 was so busy and tough.",
                    "score": 28,
                    "author": "gamefreak2k11"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Somewhat bittersweet to have a 5th anniversary without full OT9 promoting but hardship has only brought the group and the fandom closer together in the past.",
            "score": 167,
            "author": "loot168",
            "replies": [
                {
                    "level": 1,
                    "comment": "You're right and just like we did for Mina; we just have to hope for a solid recovery for Jeongyeon!",
                    "score": 83,
                    "author": "okaysian"
                },
                {
                    "level": 1,
                    "comment": "Well this was unfortunate news to me. Hmm. \n\nI guess it’s the stress of the comeback right? Because while I know they work hard they surely aren’t doing as much as they did in the first couple years with several CB/year. Wonder what brought this on? Kind of scary to have multiple members drop out",
                    "score": 12,
                    "author": "mais-garde-des-don",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I assume it is the accumulated stress and anxiety of being in the business, mixed with finally allowing oneself to admit a problem. \n\nI am less nervous than before since Mina did ultimately return to full capacity. Obviously, every case is different. But one finds hope where one can.\n\nThe \"optimistic\" take is that many idols likely suffer from poor mental health given the industry's harsh standards and JYPE's policy of allowing idols to take emergency breaks is a good sign rather than a worrying one. As in more idols are going through similar situations in other companies and groups but aren't allowed/don't allow themselves to stay out of a comeback. I don't think that JYPE is that much worse (but also frankly that much better) for a work environment to explain it otherwise.",
                            "score": 40,
                            "author": "loot168",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Prolonged stress and exhaustion can break down even the strongest people. I hope that she rehabs her body and her mind back to 100%.\n\nPersonally, what I find most amazing is that she can still be such a professional and participate in shooting all the Twice content coming out even during these times of COVID and still look like she’s enjoying herself. Not to mention she’s one of the main singers in Twice and she had to record a Japanese album AND their new album. It just blows my mind. \n\nBut like I said, even the strongest people have a limit to the amount of stress they can handle and it seems like Jeong Yeon has reached her limit.",
                                    "score": 11,
                                    "author": "asapkim"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "She's had a couple injuries from what I understand.",
                            "score": 13,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bad injuries too. Herniated discs tend to be really painful lingering injuries.",
                                    "score": 10,
                                    "author": "asapkim"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Five+ years of happiness from our members and ONCE. Here's to five and more.",
            "score": 61,
            "author": "bryan792"
        },
        {
            "level": 0,
            "comment": "My ultimate group, they have come so far😭 \ni hope the new album will bring them even to greater heights\n\nFancy is still THAT song btw",
            "score": 201,
            "author": "FROST_R6",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was just listening to Fancy earlier and I kept thinking about how I think it's their magnum opus. It's so catchy and fun to listen to, and I personally really love it!",
                    "score": 77,
                    "author": "Chimpadyes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think TT, LIKEY and FANCY is the holy trinity of TWICE songs. With Fancy definitely being the magnum opus. I still listen to that song weekly.",
                            "score": 46,
                            "author": "FROST_R6",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The disrespect to WIL",
                                    "score": 21,
                                    "author": "AsIfItsYourLaa",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What is Love doesn’t have the longevity that the other ones have in my opinion. It’s still a super catchy song and definitely in my top 5 TWICE songs. But the other songs are better imo",
                                            "score": 5,
                                            "author": "FROST_R6"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "frfr",
                                            "score": 3,
                                            "author": "why_squ1rtle"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Fancy just happens to be my ringtone lol.",
                                    "score": 9,
                                    "author": "outerdrive313"
                                },
                                {
                                    "level": 3,
                                    "comment": "The taste. These are their best 3 songs to me by far. The music videos (and songs themselves) are iconic, showcasing TWICE’s range and ability to switch concepts flawlessly.",
                                    "score": 5,
                                    "author": "elephantastica"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I upvoted despite disagreeing wit every fiber of my being. I think what is love is their/JYP magnum opus.\n\nThat bouncy synth bass come on now / disney vibes.... classic",
                            "score": 4,
                            "author": "why_squ1rtle"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Twice is not my ult group, but Fancy is my number one played song on Spotify bc I listen to it like twice(didn't even do this on purpose) a day it's addicting",
                    "score": 16,
                    "author": "fannytraggot"
                },
                {
                    "level": 1,
                    "comment": "Fancy shoud've been SOTY. Fancy is more SOTY material than WIL.",
                    "score": 6,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Let me just say that I took Twice’s music for granted. Their stuff fucking slaps! \n\nI remember listening to them during Feel Special, and I was absolutely blown away by the music video, which found my love for elegant/glam concepts! Breakthrough just made me think, “Yep. I’m gonna give this group a listen.”\n\nWhich is pretty crazy, because I didn’t I would be ever interested in their music, but here we are!",
            "score": 99,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[TWICE's official anniversary celebration tweet](https://twitter.com/JYPETWICE/status/1318221674815184901?s=20)(featuring Jeongyeon as a cartoon version of her dog)\n\nIf anyone is wondering, this picture is from their 5th anniversary special live: WITH [teaser image](https://twitter.com/JYPETWICE/status/1313831442187657217?s=20).\n\n**Important YouTube links:**\n\n[YouTube link to live stream](https://youtu.be/EQrwydJDdkM) (Stream has ended; they performed \"Say Something,\" the #12 track on their upcoming album! It's so good)\n\n5th Anniversary Video 1 [\"From TWICE, To ONCE\"](https://youtu.be/kbxQ41aWco8)\n\n5th Anniversary Video 2 \"ONCE BEGINS, TWICE BEGINS\"\n\n* [Like OOH-AHH](https://youtu.be/-tqzk0pOcu4)\n* [PONYTAIL](https://youtu.be/lQ34ohezZDI)\n* [Like a Fool](https://youtu.be/DFdjt6ykwTY)\n* [ONE IN A MILLION](https://youtu.be/715h-XJ9Wzg)\n* [TITLE MEDLEY](https://youtu.be/mLHTbZQSsoQ)\n\n5th Anniversary Video 3 [\"MORE THAN FAMILY = 9-WICE TOGETHER\"](https://youtu.be/ygU9ZOQvThU)\n\n5th Anniversary Video 4 [\"ONCE upon a TWICE, 5 Years\"](https://youtu.be/Cm84W7NxKg4)\n\n**Translations of the members' 5th anniversary messages** (thanks Misayeon):\n\n[Nayeon, Jeongyeon, Momo](https://twitter.com/misayeon/status/1312792690363453440?s=20)\n\n[Sana, Jihyo, Mina](https://twitter.com/misayeon/status/1312794627175579648?s=20)\n\n[Dahyun, Chaeyoung, Tzuyu](https://twitter.com/misayeon/status/1312797331574657024?s=20)\n\n*This might be kind of long, but I'm just going to do a word vomit real quick:*\n\nI mentioned this a couple of times on the subreddit, but I was introduced to TWICE and K-pop after a friend graciously offered me a ticket to a random Music Bank recording in July 2018. At the time, I didn't know a single thing about K-pop, but I was immediately captivated by the performances and variety of genres. But I was particularly interested in TWICE after their backstage interview (specifically when Tzuyu said “\\[For our 1000th day anniversary\\] the members and I ate samgyeopsal deliciously” and Nayeon said “Standing still is the best way to stay cool \\[in the summer\\], BAAM” idk it was really adorable and funny). Watching “Dance the Night Away” in person was a blast (and it’s still one of my favorite TWICE songs) and I was intrigued when they did their infamous ice-cube music win encore. If I remember correctly, I think it was Tzuyu’s height, Momo’s pigtails, and Chaeyoung’s bright orange hair that prompted me to look them up on Google (and subsequently Kprofiles— bless that page). After that, I kind of fell into the K-pop rabbit hole. I discovered the masterpiece that is “Likey” and realized that the over-played BGM songs from my parents’ favorite variety shows were actually a TWICE song (“Cheer Up,” to be exact).\n\nI wouldn’t consider myself a “seasoned” ONCE. I actually regret not becoming a ONCE sooner. But from another point of view, I think I’m very lucky for becoming a ONCE when I did. My first comeback with TWICE was “Yes Or Yes,” which marked a subtle transition between cute TWICE and mature (?) TWICE. Then I got to experience the heartfelt “The Best Thing I Ever Did” and “Fancy,” which was a surprising and radical shift in TWICE concepts.\n\nI also got to be a part of some of the most exciting times as a ONCE— the TWICE LIGHTS World Tour, for example. I also experienced some of the biggest heartbreaks in the ONCE fandom, like Mina and Jeongyeon’s Hiatuses. But regardless, I’m so happy to have seen TWICE grow from DTNA to MORE &amp; MORE. I am so proud of their successes and progress even in the short span of three years. TWICE will always hold a special place in my heart, and I will always be rooting for them. TWICE is the reason I was able to create friendships that I never would have expected to create and they are also why I was interested in becoming a translator in the first place (shout out to TWICE Global and Teudoongie Subs).\n\nThis is way too long but I wanted to let it all out somewhere. Thank you TWICE. 트둥이 fighting!!",
            "score": 88,
            "author": "PicklesandHam"
        },
        {
            "level": 0,
            "comment": "They have come a long way. They are the reason why cute concept will be my favorite type of concept. I hope they will win Artist of the year atleast one time.",
            "score": 43,
            "author": "niteeee"
        },
        {
            "level": 0,
            "comment": "Thank you Twice,  I will always be glad watching that cute/awesome Likey MV for no specific reason, and then keep and keep watching it cause it is so good  \nHappy anniversary!! o/",
            "score": 33,
            "author": "xcdlx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Likey was my second-ever TWICE video. Yes or Yes was my first! 👍",
                    "score": 5,
                    "author": "outerdrive313"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Happy fifth anniversary to TWICE, one of the best groups in the world! Congratulations on making it this far and here's to better things to come in the near future! You deserve everything that you have received up to this point and you deserve so much. It's been a long journey since your debut and you've gone through thick and thin. Keep staying strong and persevering through any of the hardships as we will be with you and supporting every step of the way. TWICE 파이팅!",
            "score": 26,
            "author": "JuliusCaesar44BC"
        },
        {
            "level": 0,
            "comment": "Happy 5th anniversary to the one happy pill that repeatedly keeps saving me during this tough year. When I first listened to their music, I never thought they'd become one my all-time favorite groups ever just a month later and their seemingly endless variety and social media content where they showcase their hilarious, adorable and wholesome personalities, always make my day. They've only entered my life earlier this year but quarantine makes it seem like it's been so much longer since I had the time to watch so much of the content they've put out over the years and listen to their discography and watch their MVs and performances in chronological order, which was almost like experiencing their natural growth and seamless transition from cutesy to mature as if I'd been a fan since Sixteen.\n\nBefore TWICE, I never even entertained the idea of spending way too much money on a lightstick, purchasing monographs, dusting my trading card binder from when I was a kid to put photocards in and actually buying CDs in 2020 - and now I have a whole shelf that is just full of their stuff lmao. There's just something special about them and the way they can brighten your day in a very sincere and sweet way, whether it's with their continuously brilliant musical output, their stunning photoshoots, their uncontrollable crackheadedness or even them just hanging out and literally doing nothing while camping lol\n\nThey deserve the world and I sincerely hope for their happiness, health and success because what makes them happy, makes me happy too. I couldn't be more excited for the upcoming comeback and I'm sending positive vibes to Jeongyeon, who's hopefully resting and recovering well and I'm certain she'll eventually return better and stronger than ever.",
            "score": 20,
            "author": "Shinkopeshon"
        },
        {
            "level": 0,
            "comment": "Happy 5th Anniversary, Twice! They’ve all come such a long way and they just keep getting better and better. Here’s to the next 5 years of absolute bangers.",
            "score": 17,
            "author": "ohmysandeul"
        },
        {
            "level": 0,
            "comment": "My favorite girls 🧡🧡🧡 it’s unbelievable how happy their music makes me feel.",
            "score": 15,
            "author": "thatnorthafricangirl"
        },
        {
            "level": 0,
            "comment": "Congratulations to them and all the accomplishments they've achieved in only 5 years!!\n\nThey have grown so lovely ❤ I hope JYPE will continue to take care of their health and treat them with respect!",
            "score": 15,
            "author": "marimosa"
        },
        {
            "level": 0,
            "comment": "Happy 5th Anniversary TWICE and ONCES!!!!!! 🎉",
            "score": 12,
            "author": "KoL028"
        },
        {
            "level": 0,
            "comment": "5th???? I remember seeing the teasers for like ohh ahh like it was yesterday! Time really does fly... Congrats to the girls for coming so far!",
            "score": 12,
            "author": "mintseok"
        },
        {
            "level": 0,
            "comment": "Happy anniversary, queens!!!💖💖💖\n\nI’m so thankful for finding another group that puts out top quality content for us fans. We’re spoiled by them so much and I’m just grateful. Thank you for all that you do, TWICE!!!😭",
            "score": 22,
            "author": "impeccabletim"
        },
        {
            "level": 0,
            "comment": "-",
            "score": 10,
            "author": "pieceoftrashhehe"
        },
        {
            "level": 0,
            "comment": "It's been years of hit after hit ❤️ Thank you TWICE and happy 5th anniversary 😁🎉🎊",
            "score": 9,
            "author": "ANINETEEN"
        },
        {
            "level": 0,
            "comment": "Happy 5th anni girls!! Proud to be a Once since debut :) Thank you for all your hard work for the past 5 years, looking for many more\\~ I hope you can rest well after this comeback!",
            "score": 7,
            "author": "moonfrequency"
        },
        {
            "level": 0,
            "comment": "MY MAIN GG",
            "score": 6,
            "author": "JeVi_Wannie"
        },
        {
            "level": 0,
            "comment": "Happy 5th Birthday, Twice &amp; Onces! Congrats! Here's to five or more years. 🥰🥰🥰🥳🥳🥳",
            "score": 7,
            "author": "Alto-Joshua1"
        },
        {
            "level": 0,
            "comment": "Wow it's been that long? Granted I have only followed them since right before \"TT\" came out (well I guess that's still 4+ years) but once I got hooked on \"Cheer Up\" they've been one of my favorite K-pop groups if not my favorite. They've given me so much joy and I'm really grateful that they exist! I feel like they're a group that's been more open about some of their struggles and I'm really appreciative of that as well. Here's to more years with TWICE and thank you to also all the ONCE for supporting them!",
            "score": 8,
            "author": "Blueflame407"
        },
        {
            "level": 0,
            "comment": "i can't imagine kpop without these queens !! happy 5th anniversary twice ♡",
            "score": 7,
            "author": "softggukie"
        },
        {
            "level": 0,
            "comment": "I remember being only 15 years old when Sixteen aired and I followed the show religiously. This was soon after both Girls' Generation and Kara split and I felt empty. TWICE was able to give me a happiness that I was afraid I lost. I was in class when LOA dropped and had to secretly watch the music video and kept spazzing. My teacher thought something was wrong with me and I pretended I was sick just to go to the nurse office. I actually just walked around in school repeatedly watching the music video. I went to their concert last year and it was a life altering experience for me. Each time I watch TWICE variety I end up smiling and laughing like an idiot and saying \"This is why I stan them\". \n\n\nStanning them has been such an amazing yet rough journey. They are massively disliked even to this day. Their videos kept repeatedly breaking records for most disliked music videos. And this subreddit enjoyed making negative comments and talking crap on them, even to this day, and each of those comments recieved massive amounts of Karma. Being a Once is something I wouldn't trade away for the world. I am now 21 years old and I am still here. I can remember the days when I was 12 years old waiting for The Boys MV to drop. Time has flew by really fast. Even though the mistreatment and music has had me second guessing things, I am sure ICSTM will renergize me as a Once. Thank you TWICE for all the things you have done. And thank you fellow Onces for supporting our girls!",
            "score": 28,
            "author": "LovingMula"
        },
        {
            "level": 0,
            "comment": "I love Twice as much as I love zapzee",
            "score": 6,
            "author": "twice-fighting"
        },
        {
            "level": 0,
            "comment": "Happy 5th Anniversary TWICE  :)",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "so so proud of these girls.\n\nthey’ve taught me so much through their music and are a pillar of hope and sunshine in dark times. \n\nthank you TWICE, for being you.",
            "score": 7,
            "author": "austrAlian_amIgo"
        },
        {
            "level": 0,
            "comment": "Wow… where do I even start with Twice?\n\nI hesitate to say that they “pulled me into the kpop deep end” years ago, because with Twice it’s really more like Dahyun patting the empty seat next to her and saying “Come join us if you need a place.”\n\nTo me, Twice is the ultimate, fully-realized girl group. They took the playbook laid out by SNSD and polished it to perfection while maintaining their own autonomy. When I look back at all of the content released by Twice, I’m just blown away. This really is a top notch team, both on and off stage, and I’m absolutely including the management in this sentiment. They’ve handled Twice’s meteoric success very well. (That Tzuyu hostage video is still NOT the move, but I digress.)\n\nI’m really grateful to have discovered Twice and through them the world of kpop. The last two years were very rough for me mentally, but I could always count on a Twice video to put a smile on my face, as corny as that sounds. Here’s to many more great years!\n\nEDIT: Downvotes, really? This is just a lighthearted post to celebrate Twice's career thus far. I guess I should just accept my role as a kpop elder statesmen and encourage you to \"grow up\" for the hundredth time.",
            "score": 23,
            "author": "fuckmigraines"
        },
        {
            "level": 0,
            "comment": "Congrats to TWICE🎉\n\nI wasn't there for their beginning, but I'll stick with them till the end (which I hope it never comes😭).",
            "score": 5,
            "author": "Sensei_WA"
        },
        {
            "level": 0,
            "comment": "congrats girls!! here's to five more incredible years :D",
            "score": 4,
            "author": "sohyesgf"
        },
        {
            "level": 0,
            "comment": "they’ve evolved and matured so well! their sound is amazing and their relationships with each other and with onces is so amazing &lt;3 as jeongyeon said, here’s to 5 more years!!",
            "score": 3,
            "author": "ch4per"
        },
        {
            "level": 0,
            "comment": "Been 5 years since my friend randomly chatted me who was my bias and I immediately picked Jeongyeon(or Jungyeon back in those days lmao). I stan my short haired goddess since day 1 and hope she recovers well but take as much time as she needs.",
            "score": 4,
            "author": "TheMerck"
        },
        {
            "level": 0,
            "comment": "Congrats for 5 years! \n\n(I'm trying to get into Twice, I've heard some of their recent songs, what's a good starting place?)",
            "score": 5,
            "author": "LazyPaper0",
            "replies": [
                {
                    "level": 1,
                    "comment": "as other comments say, TT, Likey and Fancy are probably their best 3 comebacks. All their comebacks are really good honestly, it's what made them so famous, their consistency. \n\nPersonally I also like Heartshaker and Feel Special a lot too, if you Don't mind JP releases, Fake &amp; True is my favorite comeback but the classic twice sound is probably BDZ, Candy Pop and Wake Me Up.\n\n\nIf you want to get into albums I recommend Twicetagram, Fancy You and More &amp; More, they have my favorite B-Sides but honestly like everything else, you can honestly just pick anything and i'm sure you'll enjoy it.",
                    "score": 8,
                    "author": "TL_Unbalance",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I would say start at the beginning. Watch all of their MVs, it gives you a good idea of their progression. If you liked a certain MV, listen to its corresponding album.\n\nI would also check out their KR work first just because you can quickly figure out what type of Twice you like (old cute Twice or new more mature Twice) and that can help you choose which Japanese releases to get into.\n\nIf you do end up liking their music a lot and want to get into them more as a group, there's a great infographic on the Twice sub somewhere that goes into the variety shows and the watch order for some stuff. I think watching Sixteen gives a lot of insight into them but the newer youtube documentary does cover some of that, but very briefly. If you want to go into their content though, try to stick chronologically and spoilers from sixteen or other early variety shows will ruin the experience when they reference back to them.",
                            "score": 4,
                            "author": "1033149"
                        },
                        {
                            "level": 2,
                            "comment": "Thank you so much!",
                            "score": 3,
                            "author": "LazyPaper0"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ult bias group for me, here's 5 more amazing years. Ups and down throughout but the ups in particular have been incredible to witness. Still feels like Twice has more to show despite being an \"older\" girl group and I have no doubt then can still outdo themselves with this upcoming comeback! Truly a one in a million group.",
            "score": 5,
            "author": "wardengorri"
        },
        {
            "level": 0,
            "comment": "Oh wow, I know next to nothing about TWICE but based on what I’ve seen, I was under the impression that they have been around for a lot longer, like late 2nd/early 3rd gen which is a compliment to them I guess",
            "score": 3,
            "author": "Matty-W"
        },
        {
            "level": 0,
            "comment": "Twtce",
            "score": 3,
            "author": "Naranu20",
            "replies": [
                {
                    "level": 1,
                    "comment": "hihi",
                    "score": 2,
                    "author": "grey_unxpctd"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My youtube used to be filled with anime and video games videos but one day there was TT - Twice in the recommendation. I clicked it.\n\nThe bounce at the start of the song with nayeon's ba-ba-ba-baby got me. Replayed TT like 15 times that day. That's how I got into kpop.",
            "score": 3,
            "author": "Demi-Fiend"
        },
        {
            "level": 0,
            "comment": "THE FIRST AND ONLY GROUP OF KPOP THAT I AM STANNING ❤️\nHAPPY 5th ANNIVERSARY TWICE AND ONCE ❤️",
            "score": 3,
            "author": "DracOnce3003"
        },
        {
            "level": 0,
            "comment": "Twice came into my life just when I needed it. I was in a really dark place and somehow they helped get me through it. I wish them nothing but success, good health and happiness. They deserve it. Here’s to more years of going on this journey with you! 💗",
            "score": 4,
            "author": "trisha1297"
        },
        {
            "level": 0,
            "comment": "There's a lot I want to say but it's difficult to really put into words. I've never been as dedicated and in love with a group as I am with TWICE. I first got into kpop through Girls' Generation, but it was TWICE that really cemented my love for kpop starting  with Like Ooh-Ahh, and I've always looked forward to every single song they put out. I didn't really dig into the individual members until later on, only really going down the rabbit hole after they announced their US tour. The personalities of all the members and the way they interacted with each other was incredibly fun to see, and I've always loved how honest they are. I feel like their personalities always shine through in everything they do, and I've enjoyed watching them grow over the years. Their struggles are always difficult to watch, and I'm amazed at how strong the girls are, dealing with all the challenges that comes their way and overcoming them with grace. They're quirky, dorky, beautiful, talented and they are an absolute joy to watch either on stage, in variety shows or on interviews. Watching them perform in concert was a dream come true, and seeing to the passion behind their performances that day, hearing their amazing vocals, listening to them talk about how much work went into their stages and how they felt about being able to perform so far from home among so many people was an experience I'll never forget. Even the fandom has been pretty great for the most part, and watching everyone turn their light sticks mint green for Mina, singing and cheering at the top of their lungs throughout the concert and supporting the girls when they were speaking, especially when Jeongyeon started tearing up,  really made me feel much closer to all of these random strangers.  \n\nTheir music and their smiles have brought light to my life in some dark moments, and I will forever be grateful to them for that.\n\n I always liked the way Jihyo explained the bond between an artist and their fans. We're not friends or family, we don't really know each other and we'll most likely never meet, but there is a bond that is formed between artist and fan through music and performance, and it's different from any other type of relationship that exists. It's a special bond that is difficult to explain, but it gives both sides the strength to move forward and follow their dreams. \n\nI wish all of them the best, and will be a ONCE for the rest of my life.\n\nHappy 5th Anniversary TWICE!",
            "score": 4,
            "author": "KamiHaruhi"
        },
        {
            "level": 0,
            "comment": "Jihyos Nails tho 😍 Congrats TWICE!",
            "score": 3,
            "author": "ChiharuYana"
        },
        {
            "level": 0,
            "comment": "The group that brought me full swing into kpop. It's bittersweet to not have OT9 to celebrate today. But here's to 5 more years of happiness for the girls!",
            "score": 3,
            "author": "neverterre"
        },
        {
            "level": 0,
            "comment": "Happy anniversary queens!",
            "score": 3,
            "author": "SCf3"
        },
        {
            "level": 0,
            "comment": "Happy Anniversary, girls, you're all amazing and I hope the future will only be bright for you, from now on as well. For some reason, it feels uncanny that they're already at their five years - they still feel so fresh, to me at least, so it's tilting to know that they've been here for half a decade already, yet here's to many more. I hope they're fine and happy and healthy and I'm truly rooting for them. Happy Anniversary once again!",
            "score": 3,
            "author": "sonamoons"
        },
        {
            "level": 0,
            "comment": "I think it would have been pretty cool if they changed their name to \"FIVE TIMES\" for the day.",
            "score": 3,
            "author": "FlurocL"
        },
        {
            "level": 0,
            "comment": "Happy anniversary!",
            "score": 2,
            "author": "_Nikhedonia"
        },
        {
            "level": 0,
            "comment": "Congrats to the group that has released bop after bop for 5 years straight. At this point, idk if they are capable of releasing a dud.",
            "score": 2,
            "author": "moonoqle"
        },
        {
            "level": 0,
            "comment": "Congratulations to them after being formed I'm a survival show sixteen. Been a fan of them since 8/16/19 99 Ranch Edison played their song Fancy. Note that's the same place where I heard these Snsd Songs Lil Touch 10/20/18 then 3/8/20  Lion Heart and the boys. You can post this for the dedicated Reddit page for them r/Twice",
            "score": 2,
            "author": "AceCombat9519"
        },
        {
            "level": 0,
            "comment": "Cant believe its been 5 years already",
            "score": 1,
            "author": "SevPOOTS"
        },
        {
            "level": 0,
            "comment": "2 more years til they disband that sux",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Wtf did they put on Momo? That looks exactly like my grandma's dress lmao\nAnw, congrats on the 5th yr Twice!! Keep slayin' :)",
            "score": -20,
            "author": "retcorr"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -25,
            "author": "[deleted]"
        }
    ]
}