{
    "id": "ltna6n",
    "score": 4713,
    "title": "Brave Girls achieve their first #1 on Bugs Chart, almost 10 years after their debut, with Rollin’. They have surpassed Blackpink’s Lovesick Girls, BTS’ Dynamite and IU’s Celebrity.",
    "author": "iadoreyouranus",
    "date": 1614429486.0,
    "url": "https://www.reddit.com/r/kpop/comments/ltna6n",
    "media_urls": [
        "https://i.redd.it/txhc6zv7m0k61.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Such an incredible turn of events! I had loved Rollin' when it was first released. I love how it looks like they're having the time of their lives in each stage. Their energy is infectious. I hope this ignites renewed interest in their activities. God, how much luck affects success is mindboggling.",
            "score": 232,
            "author": "adorneds"
        },
        {
            "level": 0,
            "comment": "Congrats to them!\n\nI also have EXID Flashback... Is there any fancam? ;)",
            "score": 757,
            "author": "Delirium112",
            "replies": [
                {
                    "level": 1,
                    "comment": "Apparently it's because of [this video](https://www.youtube.com/watch?v=cfHWIqJkEf4).",
                    "score": 402,
                    "author": "i_hate_shitposting",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Minyoung commented on the video!\n\nHere's what she said (Google translated, sorry):\n\n&gt; Hello, this is Brave Girls Minyoung.\n&gt; Our members have already been there!\n&gt; Since Corona, I haven't been able to perform as much as before, but I really appreciate the creator who made this video.\n&gt; I want to see the soldiers of the Armed Forces who always suffer. Thank you very much for every supportive comment.\n&gt; I was tired of frequent member changes and vacancy.\n&gt; It was us, but with this video, all the members.\n&gt; Get strength and go!\n&gt; Please listen to Rollin'. Thank you!",
                            "score": 262,
                            "author": "queen_soo"
                        },
                        {
                            "level": 2,
                            "comment": "the crowd is so hyped i love it",
                            "score": 198,
                            "author": "caelinday",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Looks like it's performances for active duty military (not going to guess what branch). Those performances always have crazy crowds.",
                                    "score": 96,
                                    "author": "zSolaris",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They do all kinds of branches. Last broadcast on the 25th was for Army Engineers (but as these days they are all online Untact Concerts anyways it doesn't really matter except for the stuff the hosts talk about and the contents of the military quiz for the idols).\n\nThe lineup was pretty good this week. We had Saturday, UPRS Kassy,  V.O.S and EXID Solji.",
                                            "score": 40,
                                            "author": "serigraphtea",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ah I meant the ones specifically in that video.\n\nMy friends who went to the army and navy said these concerts were the highlight of their military service time. Didn't even matter who showed up to them!",
                                                    "score": 36,
                                                    "author": "zSolaris",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "quite a few in the video. you can read the top left corner of the video to identify which branch they're performing to.\n\n0:02 - 1st marine division (goes crazy in 1:00 and 2:15)\n\n0:05 - 37th infantry division\n\n0:11 - capital defense command\n\n0:17 - 6th marine brigade (dancing in 1:07)\n\n0:23 - 30th mechanized infantry division\n\n0:30 - 19th fighter wing\n\n0:34 - 1st fighter wing\n\n0:38 - army special warfare command\n\n1:07 - 3rd armored brigade",
                                                            "score": 28,
                                                            "author": "YoungUO"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Ah lol, I guess if you're really bored you could try and figure it out by the outfits but honestly Brave Girls were on it last year like every two weeks so that would be a very time consuming process.",
                                                            "score": 21,
                                                            "author": "serigraphtea",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I hope this means that sexy concepts are back. Kpop agencies, take notice. Everybody loves this!",
                                    "score": 136,
                                    "author": "gkmaster21",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m dying for sexy concepts again!! 50% of my Kpop playlist are songs w sexy concepts, now that I think about it..",
                                            "score": 72,
                                            "author": "Good_Conversation949",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "me too me TOOO. i need me some hoe anthems!!!!! but i understand why groups nowadays don’t 😩",
                                                    "score": 45,
                                                    "author": "caelinday",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "There is nothing wrong with soft sexiness like this Brave Girls performance. Groups can do sexy without being \"in-your-face\" like Stellar. Both kinds of sexy concepts are missing but especially the first. It's time for a comeback.",
                                                            "score": 37,
                                                            "author": "gkmaster21"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "As long as the members are comfortable. Quite a few members of former girl groups with ‘sexy’ comments have mentioned felling uncomfortable with the whole concept and their clothes/ dances.",
                                            "score": 51,
                                            "author": "superficialNASA"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yujeong's smile in that video is literally a mood booster",
                            "score": 78,
                            "author": "Guerrin_TR"
                        },
                        {
                            "level": 2,
                            "comment": "This is such a great and fun video",
                            "score": 5,
                            "author": "Valehelm"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Who is the Hani's ass of this group lol",
                    "score": 158,
                    "author": "Yojimbo4133",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think it Yujeong stole the show in the viral video. \n\nHer eye smile is very reminiscent of Itzy's Lia (though of course BraveGirls precedes Itzy so it's better to say that Lia resembles Yujeong).",
                            "score": 117,
                            "author": "soyfox",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There are a few idols who have been said to smile like a squirtle.. but I don't think anyone has [Yujeong](https://pbs.twimg.com/media/CcI6UZWVIAA-Fq8.jpg) beat.",
                                    "score": 66,
                                    "author": "AZUR3WRATH"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "For Rollin' era, likely Hayun, who's left the group since.\n\nWhile I prefer Yuna of the era, due to the hair, they're basically all potential Hani asses. Or rather, curves.",
                            "score": 108,
                            "author": "nighoblivion",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah they all have really nice and toned bodies. Yujeong even won the \"bagel body\" award from some show once lol",
                                    "score": 67,
                                    "author": "BaoReeceyang",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[Yujeong always looked like she's having the time of her life performing.  It's really refreshing](https://youtu.be/cfHWIqJkEf4?t=53)",
                                            "score": 63,
                                            "author": "Guerrin_TR",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I watched this vid maybe a day or two ago when it first started to blow up. I don't really know anything about the group but her smile really sucked me in. I love all those little moments the crazy soldiers make them crack up. #feelsgoodman",
                                                    "score": 25,
                                                    "author": "Saidaholic",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Then you should see her in the Rollin' stages. My god this girl could not stop smiling and winking at the crowd. She's my fave for that reason! And the dance for rollin' is hard! They're dancing on top of stools (not really shown well in the video) in high heels and have a real danger of falling and this girl can smile through that? Damn.",
                                                            "score": 18,
                                                            "author": "Rynnikins"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "~~Correct me if I'm wrong but aren't all the girls who were a part of the original Rollin' release all no longer part of Brave Girls?~~\n\nHad a little google and found out the original Rollin' came out after the huge lineup changes and only Hayun is no longer with them but was part of Rollin'",
                                    "score": 5,
                                    "author": "Flippantry",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Rollin' was the first release with the new lineup, before Hyeran and another one from the original lineup (Yujin?) left. Then Hayun left, too.",
                                            "score": 9,
                                            "author": "nighoblivion",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is one of those moments you tell your grandkids you witnessed just like the legendary EXID fancam of the past",
            "score": 147,
            "author": "UA_fly",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've been listening to EXID for a while but I never saw their performances for some reason and thanks to this thread, I finally ended up watching Hani's iconic fancam, followed by their stages for Up&amp;Down and Me&amp;You, two of their hardest bangers ... and *I am not okay*.\n\nHow did Leggo survive any of this? This group is merciless, my god. No wonder that fancam started a revolution lmao",
                    "score": 32,
                    "author": "Shinkopeshon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For context though actual sexy concepts were a lot more common back then and with that came more of this kind of choreo and charisma so we were much more used to it.",
                            "score": 14,
                            "author": "serigraphtea"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It is their first ever #1 in their career and the song is 4 years old. They have joined Apink as the only 2nd Gen girl groups to achieve a #1 on Bugs Real-time Chart this decade. Let’s all congratulate them and beg Brave Entertainment to give them the comeback they deserve!",
            "score": 772,
            "author": "iadoreyouranus",
            "replies": [
                {
                    "level": 1,
                    "comment": "Are they produced by Brave Brothers?",
                    "score": 143,
                    "author": "Delirium112",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Since you got contradictory answers, wikipedia lists the [credits](https://en.wikipedia.org/wiki/Rollin%27_(Brave_Girls_EP)) for Rolllin'.\n\nFor that song specifically, they list Brave Brothers/Two Champ/Chakun as the songwriters,  and Two Champ as the producer.",
                            "score": 72,
                            "author": "justfordc"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah pretty much all of their songs are (maybe all of them I don't remember off the top of my head).",
                            "score": 112,
                            "author": "FireFlyz351"
                        },
                        {
                            "level": 2,
                            "comment": "Not with this particular song, but Brave Girls is basically the “house band” Brave Brothers produces for, just like EXID was for Shinsadong Tiger.  You’ll find that some of Brave Girls’ music is reminiscent of that of another girl group Brave Brothers has produced for, namely AOA.",
                            "score": 68,
                            "author": "bluebirdgm",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey",
                                    "score": 33,
                                    "author": "BrocolliBrad"
                                },
                                {
                                    "level": 3,
                                    "comment": "I remember Mini Skirt. It was such a hit song. \n\nFeel sad at what happened to AOA right now.\n\nI wish that Sexy Concept is becoming popular again :(",
                                    "score": 45,
                                    "author": "Delirium112",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Nope, produced by 2CHAMP. They also commented on that viral video that caused all of this.",
                            "score": 27,
                            "author": "meatgrind89"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Promoting their most recent comeback [we ride](https://youtu.be/4HjcypoChfQ) ! One of the best songs to come out of the recent retro songs trend !",
            "score": 537,
            "author": "wynterflowr",
            "replies": [
                {
                    "level": 1,
                    "comment": "That recent trend has been going since 2015 in Kpop lol",
                    "score": 88,
                    "author": "heavenlyskyfarer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "True but it has had sort of an uptake recently with many groups releasing such tracks. BTS, SSAK3, Twice, BlackPink (kinda?), Gfriend, Mamamoo, Seventeen, TXT, NCT, Everglow and many soloists as well such as Sunmi, JYP, and others.",
                            "score": 173,
                            "author": "luvzz12",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My grass brain is being chopped rn but what nct song is retro? I can’t remember",
                                    "score": 10,
                                    "author": "SaltyAsianChild",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "90's love, it's literally in the name lol.",
                                            "score": 32,
                                            "author": "luvzz12",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I think they might be referring to 90s love? The song itself isn't that retro but the concept was iirc",
                                            "score": 6,
                                            "author": "kathryn943"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 62,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Idk Someone Like U, Platonic Love, I Feel You, Aalow Aalow, All Night, Mamma Mia, I Just Wanna Dance, Finger Tip, Free Somebody, Oh! My Mistake, Love City are all extremely 80s and that's just the ones that came to my mind right now that are at least three years old and are title tracks.\n\nAn argument honestly could be made that the 80s have been in since KARA and T-Ara, at the very least from a producer standpoint, certainly as long as Sweetune and Brave were very active in the industry.",
                                    "score": 41,
                                    "author": "heavenlyskyfarer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think the point was there has been an influx of 80s-inspired tracks in a short amount of time, rather than having them be spaced out like the tracks that you listed down. That is indeed a trend.",
                                            "score": 90,
                                            "author": "islimp",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, types of songs simply existing doesn't constitute a trend lol or else most genres has been trends since the 2000s.",
                                                    "score": 7,
                                                    "author": "SushiMage"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I'd say in the west, retro has been the trend for a good decade now. The late 70s/80s have been in since 2012 when Bruno Mars dropped Locked Out of Heaven with those Police vibes and Daft Punk brought disco and funk back with Get Lucky. It's only grown since then and I agree, K-Pop followed suit in 2nd gen (Reboot is a prime example).\n\nI still wouldn't disagree with those who say the retro trend has been particularly present lately though - the genres have just changed a bit and more artists have jumped on the bandwagon. Last year, pretty much every major group promoted retro-inspired singles, from BTS, TWICE and GFRIEND to EVERGLOW, Lovelyz and NCT. While disco has become a permanent fixture and is as dominant as ever, I'd say synthwave and city pop have gotten more common now compared to 5-6 years ago, while New Jack Swing is also making more appearances.",
                                            "score": 9,
                                            "author": "Shinkopeshon"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Tara had it has a staple since the 2010's lol",
                            "score": 15,
                            "author": "moomoomilky1"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 11,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Mentally, I'm still in 2007, playing Neopets and listening to High School Musical",
                                    "score": 38,
                                    "author": "Stoop_Girl",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I sometimes think I'm still in college.\n\nIt's almost been two decades since I graduated from it.",
                                            "score": 19,
                                            "author": "Galyndean",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Going back to 2007 if you think of the Wonder Girls...",
                            "score": 4,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That's so random lol. I'm glad Rollin' is getting some recognition. It was one of my favourite songs of 2017.",
            "score": 211,
            "author": "HauntedFurniture",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not exactly random as its from the video going viral a few days ago and people finally realising the song is a bop\nhttps://www.youtube.com/watch?v=cfHWIqJkEf4",
                    "score": 123,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Any reason why this video went viral? The song’s really good!",
                            "score": 73,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean seeing the soliders actually losing their minds made me smile, so it probably went viral because it made everyone smile lol\n\nAnd thats even without knowing what the comments on screen are saying, some of them are probably funny",
                                    "score": 116,
                                    "author": "Ozbal42",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The girls look really happy to be receiving that kind of energy from a performance too. That must be really exciting for a lesser-known group.",
                                            "score": 70,
                                            "author": "newmarks"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "A lot of the comments are also from the servicemen who were in the crowd during that performance, talking about how great and memorable it was or pointing themselves out if they see themselves in the crowd shots of the original performance video (that's what most of the comments with timestamps are)",
                                            "score": 24,
                                            "author": "Hyperiok",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I see, thanks!",
                                                    "score": 3,
                                                    "author": "Ozbal42"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow this is so cool, I remember listening to that song when it came out, loving it and wondering if it'd ever blow up. Now here we are lol. \n\nBut honestly I'm so happy for the group",
            "score": 207,
            "author": "luvzz12"
        },
        {
            "level": 0,
            "comment": "They deserve this so much, they're one of my favourite girl groups. I always hoped Deepened would have been their take off point with the \"fitness queens\" concept \n\n\nSide note, I recommend checking out their Immortal Songs performance of [Mapo Terminal](https://youtu.be/4q4UL8XDbfQ) , it's just so entertaining. Especially seeing that one woman in the audience looking like she's having a religious experience",
            "score": 92,
            "author": "BaoReeceyang",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sadly High Heels sold better than Deepened, even if not by much.\n\n\nBut yeah I LOVE Deepened.",
                    "score": 30,
                    "author": "heavenlyskyfarer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am so, so happy for them!! Well deserved, rollin’ was (is!) such a bop",
            "score": 58,
            "author": "abriec"
        },
        {
            "level": 0,
            "comment": "[Check](https://www.instagram.com/p/CLy_DycBmnF/) [the](https://www.instagram.com/p/CLy40wbnhkA/) [members](https://www.instagram.com/stories/bg_eunji92/2518334867479441160/)' [IGs](https://www.instagram.com/p/CLy4u2OFQn-/), they're all freaking out about it!",
            "score": 94,
            "author": "joesen_one",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just know they wanna promote again and be on stage!! We'd be so lucky to get even one new song this year.",
                    "score": 41,
                    "author": "AZUR3WRATH"
                },
                {
                    "level": 1,
                    "comment": "I’m so happy for them! They deserve it so much♥️",
                    "score": 20,
                    "author": "ajmkv"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And not even that weirdo tropical remix, cool.\n\nIf you don't know Brave Girls, check out this widely slept on banger: https://www.youtube.com/watch?v=0_pC3KXT2r4",
            "score": 50,
            "author": "ikigaii",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hyeran's rap here is legendary material honestly, she was so incredible",
                    "score": 14,
                    "author": "wugggs"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a somewhat frequent listener of their discography I'd like to recommend their songs \"No Rush\" and \"Seeing the End of the Road\" both are great songs and I know plenty of people have recommended \"Deepened\" which is a heavy hitter.",
            "score": 108,
            "author": "FireFlyz351",
            "replies": [
                {
                    "level": 1,
                    "comment": "High Heels is also a bop!",
                    "score": 41,
                    "author": "cosmicpolaroid89"
                },
                {
                    "level": 1,
                    "comment": "&gt; \"Deepened\"\n\nStill my favourite by Brave Girls; great rap too! https://www.youtube.com/watch?v=0_pC3KXT2r4",
                    "score": 30,
                    "author": "kulikitaka"
                },
                {
                    "level": 1,
                    "comment": "No Rush is soooooo good! Absolute favorite Brave Girls song",
                    "score": 21,
                    "author": "AnjunaUnnie"
                },
                {
                    "level": 1,
                    "comment": "I still listen to “No Rush” regularly. Love that song!",
                    "score": 9,
                    "author": "24faded"
                },
                {
                    "level": 1,
                    "comment": "I'd recommend Easily from their original lineup! Quite different from every other track of theirs but it's a really great slower, summer reggae track.",
                    "score": 6,
                    "author": "AZUR3WRATH",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Rollin was my most played kpop song in 2017-2018 for a reason. IMO one of my favorite kpop songs of all time. It was criminally underrated then and I am glad more people are catching on.\n\nIdk if they can pull off what EXID did, but hopefully they can gain some momentum from this.",
            "score": 94,
            "author": "Tazui"
        },
        {
            "level": 0,
            "comment": "Congrats!! 😃🎉\nListening to it now; this song slaps! How did this happen after so many years though?",
            "score": 63,
            "author": "Arjun_Jadhav",
            "replies": [
                {
                    "level": 1,
                    "comment": "A YT video going viral. Just search 브레이브걸스 롤린 댓글모음 (Brave Girls Rollin comment compilation). It has 2M views in 3 days and basically reintroduced Rollin as \"#1 on the Milboard\" (Military Billboard because soldiers in the army love it so much because of the happy vibes).\n\nEdit: [here is the vid](https://youtu.be/cfHWIqJkEf4) it is a stage mix plus comment compilation, a lot of comments are saying how the soldiers are having the times of their lives, former soldiers reminiscing about how much they enjoyed brave girls, how the choreo is oldschool (aaahhh... I am showing my age here. I remember sexy concepts being trendy and cool!), how the members are cute and hot, how this should be played at wars and the soldiers will definitely win etc. \n\n\nEdit 2: 4 hours ago, the channel did a [part 2](https://youtu.be/tc4HW5DWkMU)!!",
                    "score": 135,
                    "author": "SeeTheSeaInUDP",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Memes are proven to be the best marketing force once again",
                            "score": 27,
                            "author": "fareastrising",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It is. Srsly. I mean, Rain's career got a renewal because Gang became literally THE meme and people were literally streaming it through \"1 Gang a day\". He went on to do the SSAK3 project, have a 1M subscribers YouTube channel, collab with Zico, JYP, Sumi Jo (Koreas No.1. Soprano), now Chungha, have a episode of Immortal Songs to him, and is now debuting a boy group (which was deffo in planning since a long time but now is the best time to debut them). \n\nThe power of a meme.",
                                    "score": 27,
                                    "author": "SeeTheSeaInUDP",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Don't forget his collab with Zico too! Was big and came out during SSAK3 prep episodes on how do you play iirc",
                                            "score": 11,
                                            "author": "MarikaBestGirl",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh yes how could I forget the Zico collab! And the Gang remix by H1gher definitely helped too.",
                                                    "score": 5,
                                                    "author": "SeeTheSeaInUDP"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Thanks for the info!",
                            "score": 10,
                            "author": "Arjun_Jadhav"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "go go go brave girls\\~\\~",
            "score": 70,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "ROLLIN IS SUCH A BANGER.",
            "score": 34,
            "author": "Enzuiguri"
        },
        {
            "level": 0,
            "comment": "Rollin rollin rollin \\(-_-)/ &lt;(-_-)&gt; \\(-_-)/ &lt;(-_-)&gt;",
            "score": 30,
            "author": "hrbrt7"
        },
        {
            "level": 0,
            "comment": "Whats the reason?",
            "score": 25,
            "author": "veckomote",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think it's cause of this video going viral: https://www.youtube.com/watch?v=cfHWIqJkEf4",
                    "score": 105,
                    "author": "HoneyedOasis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Impressive 2 million views in 3 days. And I reckon most people were just there to just have a laugh at military men going crazy over a girl group perfomance, but then realized the song was a bop.\n\nAlso, my personal highlight of the video was at [2:14](https://youtu.be/cfHWIqJkEf4?t=134)- wherein amidst the chaos, at the bottom left corner there's two men sitting down with their hands over their chin watching the performance like it was a symphony orchestra lol.",
                            "score": 155,
                            "author": "soyfox",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "the comments in the video are from former soldiers, commenting their positive memories of this song during their time in the military :) no laughing, just Korean guys reminiscing.",
                                    "score": 109,
                                    "author": "themaknae"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "HAHAHA the soldiers dancing during the chorus got me lmao",
                            "score": 37,
                            "author": "AnjunaUnnie"
                        },
                        {
                            "level": 2,
                            "comment": "Wow that's amazing!",
                            "score": 5,
                            "author": "DCJii098"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "they're having an EXID moment",
                    "score": 43,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Whoaaa wait what happened? Rollin’ is one of the most unappreciated bangers in existence and in my top 15 most played songs of all time! This is amazing, how did it blow up all of a sudden?",
            "score": 25,
            "author": "azure_atmosphere"
        },
        {
            "level": 0,
            "comment": "[Currently](http://www.kpopchart.kr/%EB%B8%8C%EB%A0%88%EC%9D%B4%EB%B8%8C%EA%B1%B8%EC%8A%A4) at midnight Rollin' is 1 on Bugs, 13 on Genie (it was in the 90s at 9 pm) and 72 on the old Melon realtime system. It isn't on Melon 24Hits or on FLO or Soribada, but the former two can take several hours to chart on because of how they count listeners and the latter is basically a dedicated trot chart at this point. I'm hopeful to see if it lands on Melon 24Hits after the chart unfreezes in the morning... 2017 was the year I got into kpop so I have fond memories attached to a lot of releases from that year.",
            "score": 27,
            "author": "lowelled"
        },
        {
            "level": 0,
            "comment": "OMG, I'm so happy for them! A sweet Cinderella story!\n\nI really hope this is a sign the group will get some GP love for their next comeback! Brave NEEDS to capitalize on this right now. Mother of pearl, I just want Brave Girls to harness this surprise upward trajectory!\n\nAlso, I'd like to throw in some more Brave Girl recs for y'all to check out, in case you haven't heard them:\n\n* [We Ride](https://www.youtube.com/watch?v=4HjcypoChfQ) \\- their most recent comeback. City Pop goodness.\n* [Whatever](https://www.youtube.com/watch?v=7sDlseaORQY) \\- that sassy kiss off song to your ex\n* [Deepened](https://www.youtube.com/watch?v=0_pC3KXT2r4) \\- a slick Brave Brothers R&amp;B style song. Very 2nd gen-esque in sound, IMO.\n* [High Heels](https://www.youtube.com/watch?v=InezMk7Ptt0) \\- I'm partial to the remix (which was on the Rollin' album). Such a sultry, fun song. They truly are Top Girls now.",
            "score": 21,
            "author": "af-fx-tion",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This song was an absolute heater of a track back in 2017.   It's still on my Spotify playlist albeit buried back in the 2017 section.   The fact the choreo for this song had them in heels on a small stool and sitting in mid air boggled my mind in 2017 on the physicality of it all, and it still does seeing it today.\n\nBut damn.  This is really nice to see.    Brave Girls released some absolute bangers,  Deepend,  High Heels and Rollin to name a few.\n\nAnd good old Squirtle having the time of her life performing at [0:53](https://youtu.be/cfHWIqJkEf4?t=53)",
            "score": 22,
            "author": "Guerrin_TR"
        },
        {
            "level": 0,
            "comment": "This song's history is so full of ups and downs. It was a  small hit for them back then in the international side . But they got a lot of side eye since it was a sexy concept . Lot of people expressed that they thought it would have been better if it was a bright summer concept song.  And the company brought out a New version of the MV thats a summer concept . They have a clean version too since the og MV was too risque .  \n\nI'm so happy that this song is getting some attention again ! Their comeback - We ride is one of my favourite songs from last year !",
            "score": 84,
            "author": "wynterflowr",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Does someone want to explain why and how this is happening now? Is it an EXID style situation?\n\nI heard the song kinda got revived (and they made that special release) but that was more than a year ago right?\n\nEDIT: Just saw the reason. Viral fancam, so very EXID! Amazing. So happy for them, but... didn't a couple of the girls leave that were attached to Rollin?",
            "score": 10,
            "author": "gonline",
            "replies": [
                {
                    "level": 1,
                    "comment": "Just one, Hayun, left. The other four are still in the group and they released one of the best K-Pop songs of last year, We Ride. I hope they can capitalize on this!",
                    "score": 20,
                    "author": "ajmkv",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Are they gonna add another member to make it 5 again or keep the 4?",
                            "score": 6,
                            "author": "RangerFan293",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As far as I know, they won’t add another member. Kind of hoping they don’t!",
                                    "score": 12,
                                    "author": "ajmkv",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I would assume they wouldn’t, but isn’t one of the original members on a medical hiatus or did she leave?",
                                            "score": 3,
                                            "author": "RangerFan293",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh, Hyeran? Yeah, she was on a hiatus but Brave Entertainment revealed she left the group and the company back in 2019.",
                                                    "score": 9,
                                                    "author": "ajmkv",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh yeah Hyeran, dang then probably best with the remaining 4",
                                                            "score": 3,
                                                            "author": "RangerFan293"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So deserved! their 2.0 discography has always felt so timeless. High Heels, Whatever (one of the best b-sides of all time?) and We Ride next please! \n\nBrave better find a way to capitalise on this momentum..chances like this do not come about  often and the girls deserve their EXID/Gfriend moment.",
            "score": 17,
            "author": "fakeaf1"
        },
        {
            "level": 0,
            "comment": "ahhhh i love it when underrated girl groups get their resurgence! hope this restarts their career! Rollin is such a masterpiece and it deserves to be more known",
            "score": 32,
            "author": "Vakovich"
        },
        {
            "level": 0,
            "comment": "If you were going to tell me last year that Brave Girls was the group that beat IU in a chart I would laugh. Congratulations to this absolute bop of a song getting it’s credit.",
            "score": 36,
            "author": "jcho430",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wonder if someone jokingly brought it up in the prediction thread a few months ago lol",
                    "score": 7,
                    "author": "Shinkopeshon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Keep it coming. While we're at it, give Rainbow and Dal Shabet their late spotlight too",
            "score": 9,
            "author": "fareastrising",
            "replies": [
                {
                    "level": 1,
                    "comment": "Assuming Kaeun and Jiyul wanted in, I'd like to see this.   BBB was ahead of its time in electropop back in the day.",
                    "score": 5,
                    "author": "Guerrin_TR"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Okay I'm gonna need brave bros to get all their ducks in a row and start booking them some music shows, tv appearances or whatever right about now.\nThe video is doing *wonders* but they should capitalize on it fast so the song doesn't get forgotten the moment the video loses steam, I want everyone in Korea and their dogs standing on top of stools and lollin lollin lollehn like their rent was due tomorrow.",
            "score": 14,
            "author": "potatochipbot"
        },
        {
            "level": 0,
            "comment": "Just amazing, such a beautiful song they deserve it",
            "score": 16,
            "author": "popplug"
        },
        {
            "level": 0,
            "comment": "This is so exciting i’m so happy for them!!",
            "score": 16,
            "author": "flopasf"
        },
        {
            "level": 0,
            "comment": "This is madness - their first number one and it's a song that's been out for four years. You never know when you'll find success I guess lol\n\nCouldn't be happier for them though, they absolutely deserve this and more.",
            "score": 14,
            "author": "Shinkopeshon"
        },
        {
            "level": 0,
            "comment": " exidication of brave girls",
            "score": 14,
            "author": "gowonofficial"
        },
        {
            "level": 0,
            "comment": "Alexa play [B' Girls Are Back](https://youtu.be/4de3aTuJ55U)!!!!!!\n\n\nThis is so nice but also so sad because knowing how Brave Ent operates they won't be able to capitalize on it T_________T\n\n\nAnyways, I hope it brings some more of their excellent discography to the forefront and also makes people hire Brave Bros again for new music because all his fucking shit is dope AF.",
            "score": 14,
            "author": "serigraphtea"
        },
        {
            "level": 0,
            "comment": "listen to deepend too pls",
            "score": 15,
            "author": "moomoomilky1",
            "replies": [
                {
                    "level": 1,
                    "comment": "The rap in that... brilliant!",
                    "score": 6,
                    "author": "kulikitaka"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can they promote this song again? lol",
            "score": 15,
            "author": "metallicwrapper"
        },
        {
            "level": 0,
            "comment": "Thanks for the post! Never heard of them, but will give a listen.\n\nIt’s so good! I let the station continue and was BLOWN AWAY by [Deepened](https://open.spotify.com/track/2csIvlGQz4Xfpk4e5a6ISo?si=EzchDWhzQT23TvY9pVpzlQ). It’s rare to hear such hard rapping in a GG! Gonna be listening more.",
            "score": 13,
            "author": "Rallykat88",
            "replies": [
                {
                    "level": 1,
                    "comment": "Right? Soyeon and Yeeun get praised a lot but I've never heard a hotter verse from ggs",
                    "score": 9,
                    "author": "fareastrising"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's weird how korea seems to pick a underrated group a year to  blow up",
            "score": 13,
            "author": "Ahoy_love"
        },
        {
            "level": 0,
            "comment": "Congrats! This is really great for them. So happy that they can achieve this with Rollin’ which is a bop!",
            "score": 10,
            "author": "cagendary"
        },
        {
            "level": 0,
            "comment": "This song is literally timeless like it fit literally in any years like a brand new song..",
            "score": 14,
            "author": "prime5119"
        },
        {
            "level": 0,
            "comment": "After seeing bestie disband, its nice to see brave girls finally get some credit",
            "score": 13,
            "author": "foodnpuppies",
            "replies": [
                {
                    "level": 1,
                    "comment": "F in the chat for BESTIE.\n\nLove Options was in my list for most played tracks on Spotify from 2018 to now.   Lasting legacy",
                    "score": 5,
                    "author": "Guerrin_TR"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So happy for them. This made me revisit them because I glazed over their recent comeback, but seeing them perform Rollin has made me realize I've been missing out on so much.",
            "score": 12,
            "author": "picklechucker"
        },
        {
            "level": 0,
            "comment": "Rollin is the Brave Girls equivalent of EXID's Up &amp; Down",
            "score": 13,
            "author": "Guren-sama"
        },
        {
            "level": 0,
            "comment": "This is so cool. It was just around 30 yesterday\n\nEdit* wow, they’ve even broken into FLO’s top 100 now",
            "score": 12,
            "author": "ultaudie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, they're at 98 - you can see it [here](https://www.music-flo.com/browse).",
                    "score": 9,
                    "author": "lowelled"
                }
            ]
        },
        {
            "level": 0,
            "comment": "All the current members debuted in 2016 rather than 2011, but it's been a long road nonetheless. This is one of the best things to happen this year so far",
            "score": 10,
            "author": "aplantnamedmozart"
        },
        {
            "level": 0,
            "comment": "Update: [There's part 2 of the viral YT video!](https://youtu.be/tc4HW5DWkMU)\n\nMore of Yujeong's eye smile! The bop that is Rollin! The happy soldiers! The chair choreo!",
            "score": 11,
            "author": "SeeTheSeaInUDP"
        },
        {
            "level": 0,
            "comment": "Congrats!! i love that song so much. I remember one comment of the performance where one said they feared for their chair dance part and another comment said \"they're not called Brave Girls for nothing\".\n\nNow Brave Bros don't give them Rollin' (2021 mix), just another quality comeback like last year's We Ride!?!",
            "score": 8,
            "author": "bv8_4"
        },
        {
            "level": 0,
            "comment": "Well deserved! im very happy for them ROLLIN IS A BANGER",
            "score": 12,
            "author": "Enzuiguri"
        },
        {
            "level": 0,
            "comment": "i heard this song somewhere before but man this is fire. Glad it made it to the top",
            "score": 11,
            "author": "Madphromoo"
        },
        {
            "level": 0,
            "comment": "Are they going down to EXID path or Momoland path?",
            "score": 9,
            "author": "meatgrind89",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think an EXID path",
                    "score": 16,
                    "author": "RangerFan293"
                },
                {
                    "level": 1,
                    "comment": "Going through their top songs on Spotify and they have so many genuinely good and varied songs. So definitely EXID route, if they manage to capitalize on it. But because of covid they are gonna miss out on the college festivals so I hope they get longevity despite that. Maybe they have some hidden variety stars in the group?",
                    "score": 3,
                    "author": "HeartbrokenMoose"
                }
            ]
        },
        {
            "level": 0,
            "comment": "hoping for magical chart peak for \"we ride\" by brave girls... what an iconic song",
            "score": 9,
            "author": "eeeetttt123"
        },
        {
            "level": 0,
            "comment": "Congratulations to them! What are the chances for Brave Girls having Rollin promotions for 2021?!",
            "score": 5,
            "author": "DCJii098"
        },
        {
            "level": 0,
            "comment": "wow that hype lol never heard of it but i like it. Makes me wonder how many other songs i've never heard of that's good",
            "score": 8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Is it possible for them to get nominated and perform Rollin' on music shows again?\n\nIs that what essentially happened with EXID with \"Up and Down\"?",
            "score": 9,
            "author": "ineedanswersokay"
        },
        {
            "level": 0,
            "comment": "Holy shit, I was talking to my brother about how sad that \"Rollin'\" never got the spotlight it deserved!\n\nI just can't be happy enough for these girls. Brave Girls just got lost in the shuffle, like so many other talented groups but this is their time to shine.\n\nP. S. Next up, BVNDIT and \"Dumb\"!",
            "score": 23,
            "author": "agasarang",
            "replies": [
                {
                    "level": 1,
                    "comment": "For real BVNDIT is so underrated 😭😭😭. But I get it the debut song wasn’t IT tbh. If they came out with dramatic or Dumb first it would’ve been a wrap 👏🏾👏🏾👏🏾🔥. Can’t wait for their comeback",
                    "score": 11,
                    "author": "Emannyv93"
                }
            ]
        },
        {
            "level": 0,
            "comment": "IM SO HAPPY I LOVE THIS SONG I LOVE THE OTHER VERSION AS WELL I LVOE THIS WHOLE THING",
            "score": 8,
            "author": "zintone"
        },
        {
            "level": 0,
            "comment": "Fking FINALLY this was one of the best songs of that year",
            "score": 8,
            "author": "KawaiiBLK"
        },
        {
            "level": 0,
            "comment": "Idk what it is, but that \"하루가 멀다 하고 Rolling in the deep\" part has always activated something in my brain that causes immense happiness.",
            "score": 6,
            "author": "_ulinity"
        },
        {
            "level": 0,
            "comment": "i cant tell you how long ive been waiting for them to get ANY recognition",
            "score": 7,
            "author": "hidood101",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Finally justice for Brave Girls and Rollin’. I’ve always maintained if any “popular” group had released Rollin’, it would have been an instant hit, so it’s great to have people finally realise what a bop it is.",
            "score": 6,
            "author": "real_highlight_reel"
        },
        {
            "level": 0,
            "comment": "My bae Yuna finally getting that recognition",
            "score": 7,
            "author": "DumplingsInDistress"
        },
        {
            "level": 0,
            "comment": "Finallyyyyy for so long I wondered why the song wasn't more popular. Even after re-releasing the song it didn't catch but here comes 2021 to save the day. Moral: don't give up ❤ good music is good music",
            "score": 7,
            "author": "itsktothej"
        },
        {
            "level": 0,
            "comment": "Deepened, Rollin and We Ride are soooo good songs!",
            "score": 7,
            "author": "BakuRyou"
        },
        {
            "level": 0,
            "comment": "this is such happy news, I hope they become successful 😣😣😣😣 They have already been successful at delivering bops",
            "score": 5,
            "author": "A_Nx_rD3v3TmloyB3hEE"
        },
        {
            "level": 0,
            "comment": "IT'S HAPPENING RISE BRAVE GIRLS RISE\n\nBrave Ent. please take notes (and action!) on how EXID handled their virality and not how MLD handled momoland",
            "score": 4,
            "author": "pikainthemountains"
        },
        {
            "level": 0,
            "comment": "As a Fearless since deepened it still feels like a dream\nI'm so happy that my favorite group finally gets the attention that they deserve",
            "score": 5,
            "author": "Yaechi"
        },
        {
            "level": 0,
            "comment": "PLS LET THEM RELEASE A NEW SONG WHILE THEY HAVE ALL THIS MOMENTUM GOING!!!!",
            "score": 7,
            "author": "juanitatequila"
        },
        {
            "level": 0,
            "comment": "NO WAY! In 2017 I made a video about my top 10 songs of 2017 and Rollin was number 1, seeing it  going viral now warms my heart so much, here is the link to my video for proof: https://youtu.be/0GJXUzSnGzk",
            "score": 5,
            "author": "Souta17"
        },
        {
            "level": 0,
            "comment": "FINALLY! My CRUSTY ASS WAITED HALF A DECADE. brave ent PROMOTE BG NOW!",
            "score": 4,
            "author": "thruyves"
        },
        {
            "level": 0,
            "comment": "They should do the choreo as a challenge ! It would blow up even more (as long as people credit them)! Like the part they're squatting on their heels at the \"rollin rollin rollin\" chorus part! It was so different and unique at the time and even now! \n\nLike someone else mentioned, I remembered watching a bunch of performances at the time and then realizing, wow that's some hard choreo damn.\n\nThis makes me feel some type of way; I don't even know how to express it! I hope like others said, this is like an EXID situation that helps revive their career with this newfound recognition they should've gotten back then! You really never know how and when something can blow up again, especially in today's day and age which is crazy. \n\nWe Ride is good too! I binged those performances just like I did when Rollin came out; so good. I love watching Yujeong perform cause her smile is so infectious !",
            "score": 5,
            "author": "ineedanswersokay"
        },
        {
            "level": 0,
            "comment": "Wow all I wanted was this song to get recognition back when it came out.\n\nI loved it. I listened to it so much on my solo trip while exploring London and the song takes me right back there when I listen to it.\n\nEven if it is years later, we will take it! Good on the girls. They deserve this feeling!\n\nAlso goes to show how something going viral can really be RANDOM AF.",
            "score": 5,
            "author": "AdehhRR"
        },
        {
            "level": 0,
            "comment": "I remember this being the Rollin that was hot back then and I stumbled across the Brave Girls that way. Very cool that years later it’s flipped!\n\nhttps://youtu.be/CE8x9oEYaBw",
            "score": 3,
            "author": "Jahnli"
        },
        {
            "level": 0,
            "comment": "Wow!!!! Yes!!! Brave Girls!!!!",
            "score": 4,
            "author": "fannytraggot"
        },
        {
            "level": 0,
            "comment": "So strange. Yet amazing.",
            "score": 4,
            "author": "xxxcoercionxxx"
        },
        {
            "level": 0,
            "comment": "WELL DESERVED! It's one of the best songs to come out in 2017 and I've been listening to it almost weekly ever since then",
            "score": 6,
            "author": "ijustwantitsimple"
        },
        {
            "level": 0,
            "comment": "100% deserved tbh. Rollin' has been a bop for years, too many people slept on it.",
            "score": 5,
            "author": "BashfulHandful"
        },
        {
            "level": 0,
            "comment": "Loving these story, remind me of EXID!",
            "score": 5,
            "author": "jasoncyke"
        },
        {
            "level": 0,
            "comment": "I've listened to Brave Girls casually but never got around to learning their names. What's her name at 0:54 in the viral video. She's so cute!!",
            "score": 4,
            "author": "nimagooy",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm so happy for them, I've been following since they released deepend. I hope they have a comeback soon",
            "score": 3,
            "author": "sad-c-unt"
        },
        {
            "level": 0,
            "comment": "I am soooo so proud of them because I know it's been hard, especially when they've been so much time between comebacks.",
            "score": 3,
            "author": "hopeiswaking"
        },
        {
            "level": 0,
            "comment": "This is some Lizzo-type shit.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It's what she deserves!!! That song has aged like a fine wine and it was impeccable on release too.",
            "score": 4,
            "author": "wugggs"
        },
        {
            "level": 0,
            "comment": "this banger finally getting the attention it deserves! we love to see it!!",
            "score": 3,
            "author": "honnibabi"
        },
        {
            "level": 0,
            "comment": "I remember when this song came out! I don't even listen to kpop anymore, but what a blast from the past haha.",
            "score": 3,
            "author": "I_Ruv_Kpop"
        },
        {
            "level": 0,
            "comment": "can't understand why but i absolutely support this -- i still have the entire mini in my playlist!",
            "score": 3,
            "author": "mattachanteeq"
        },
        {
            "level": 0,
            "comment": "This group and song deserved better! Love to see it!",
            "score": 3,
            "author": "MarkoSeke"
        },
        {
            "level": 0,
            "comment": "Good for them! It's about time it's someone different. They have been in this industry for so long!! Ahh *virtual hugs*",
            "score": 3,
            "author": "Littlechickenyeet"
        },
        {
            "level": 0,
            "comment": "I’m so happy for them!! If you like the song, please listen to the mini-album too!",
            "score": 3,
            "author": "unicornomannaro"
        },
        {
            "level": 0,
            "comment": "Better late than never! And Rollin' when it came out was such a bop! \n\nCongrats to the girls!",
            "score": 3,
            "author": "cultured_vulture"
        },
        {
            "level": 0,
            "comment": "I really hope they get an EXID.",
            "score": 3,
            "author": "tershialinee"
        },
        {
            "level": 0,
            "comment": "DESERVE!! Hopefully Brave capitalizes on this with a bangin comeback🤞",
            "score": 3,
            "author": "TheTrashKween"
        },
        {
            "level": 0,
            "comment": "Wait whaaaaat??? What happened? Bruh I used to jam this bop all the time a few years back this is amazing",
            "score": 3,
            "author": "Icyfox22"
        },
        {
            "level": 0,
            "comment": "this is so cool!! i remember everyone hyping this when it first came out. they deserve it.",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Watch BraveBrothers release a anotheR remix of the song",
            "score": 3,
            "author": "HumanEcho2721"
        },
        {
            "level": 0,
            "comment": "Wow Congratulations 👏👏👏👏",
            "score": 3,
            "author": "bhishma-pitamah"
        },
        {
            "level": 0,
            "comment": "oh my god, as someone who remembers when this song was released this is the biggest thing i'm so glad for the girls they really deserved it! i mean literally this song is one of the best kpop songs, i'm so happy they're getting the attention they've always deserved.",
            "score": 3,
            "author": "jeonghan-duh"
        },
        {
            "level": 0,
            "comment": "Can Deepened and High Heels also go viral please...?",
            "score": 3,
            "author": "RoyalNinetales"
        },
        {
            "level": 0,
            "comment": "This is so bizarre to me lol. I never realized how underrated they were. Rollin’ is in my top 50 best kpop songs ever, nearly a masterpiece for me. So this is just so bizarre to me. Glad it’s getting the recognition tho cause it really is an amazing song.",
            "score": 3,
            "author": "killa4lyfes"
        },
        {
            "level": 0,
            "comment": "I am so happy Rollin is finally getting the attention it deserves, one of my go to summer songs!",
            "score": 3,
            "author": "SparkaCat"
        },
        {
            "level": 0,
            "comment": "I'm so happy for them. They released bop after bop and never got the recognition they deserved. Can we please give Nine Muses the same treatment next!",
            "score": 3,
            "author": "dweeby"
        },
        {
            "level": 0,
            "comment": "I've been wondering.. is the original version the one going viral or is it the remix one? 🤔 Loved the original, not so much the remix..",
            "score": 3,
            "author": "lvlz_gg",
            "replies": []
        },
        {
            "level": 0,
            "comment": "PLEASE BE AN EXID MOMENT P L E A S E. These girls have been through so much and they’ve always deserved better.",
            "score": 3,
            "author": "intlPogoTrades"
        },
        {
            "level": 0,
            "comment": "Rollin was always a bop, glad to see it finally get the recognition it deserves!",
            "score": 3,
            "author": "Sunny2456"
        },
        {
            "level": 0,
            "comment": "Rollin is such a great song and I always felt like it was one of their best and one of the top girl group songs of the year. Glad it’s finally getting it’s much needed love.",
            "score": 3,
            "author": "momopeach7"
        },
        {
            "level": 0,
            "comment": "The power of viral and social media amazes me more and more every single day!  \nIt is not even a bad song, I totally love it! ♥♥",
            "score": 3,
            "author": "matousovo01"
        }
    ]
}