{
    "id": "m1s46g",
    "score": 4927,
    "title": "Red Velvet's Wendy to release solo album in April",
    "author": "balloon_wanted",
    "date": 1615361365.0,
    "url": "https://www.reddit.com/r/kpop/comments/m1s46g",
    "media_urls": [
        "https://entertain.v.daum.net/v/20210310162742417"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "She deserves a solo comeback after all she went through. I'm so happy for her.",
            "score": 953,
            "author": "Aggravating_Ad6920",
            "replies": [
                {
                    "level": 1,
                    "comment": "I can’t think of anyone more deserving of this opportunity than Wendy herself. I can’t even imagine the hard work she’s put in to recover and come back after her accident. I’m super excited to see what soloist Wendy has in store for us",
                    "score": 327,
                    "author": "Iblaka"
                },
                {
                    "level": 1,
                    "comment": "I wonder when she wasn't physically able to if she formally worked on it for a long period of time. Of course artistically she'd be brainstorming ideas for sure, but if she had support for many months or a solid year, this makes me super excited for this album. I love her taste in music.",
                    "score": 35,
                    "author": "PandaMoaningYum"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[Update @ 4:45PM KST:](https://entertain.v.daum.net/v/20210310164530089) SM Entertainment confirm Red Velvet's Wendy will be releasing a solo album (format not mentioned) next month in April\n\n\n--------\n\nArticle:\n\nOn March 10th, StarNews shared that Red Velvet's Wendy will be releasing a solo album next month in April.\n\nThis will be Wendy's debut as a solo artist, 7 years after her debut with Red Velvet. Following Irene &amp; Seulgi's unit debut, Wendy will become the first member of Red Velvet to make her solo debut.\n\nWendy debuted with Red Velvet as their main vocalist back in August of 2014 with their title track \"행복 (Happiness)\". Wendy has been noted her vocals and skill in singing sharing both a gentle voice that expresses both warmth and clarity.\n\nWendy has worked with many artists releasing duets like John Legend, Yang Dail, and Eric Nam through SM STATION releases. Wendy has also shared solo OSTs for many dramas.\n\nWendy has been on hiatus since the end of 2019 following a fall from SBS Gayo's rehearsal. Since her return, Wendy has been returning to her activities as an artist through pictorials as well as an MC for JTBC's \"신비한 레코드샵 (Mysterious Record Shop)\". This upcoming solo album release will be an amazing gift to her fans.\n\nLots of anticipation rises ahead of what Wendy will showcase as a soloist in her upcoming solo debut.",
            "score": 392,
            "author": "balloon_wanted",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Lots of anticipation\n\nI'm really curious at what kind of genre(s) she's going to have in the album...",
                    "score": 180,
                    "author": "telemaxine",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wendy really loves jazz so i expect something [along](https://www.youtube.com/watch?v=SrzQk8moDaM) those [lines](https://www.youtube.com/watch?v=8k9p64vdp7E) will be there along with ballad, some pop, and maybe some r&amp;b. Maybe she'll finally get that Yoo Youngjin collab she's been wanting for ages.",
                            "score": 80,
                            "author": "nomoreiloveyous",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'd be surprised if she releases something with [this style](https://youtu.be/p6Q72_kWD_g?t=96)",
                                    "score": 20,
                                    "author": "telemaxine",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "tbh i wouldn't be after that collab actually dropped lol if at least for a bside. i believe in [Wendy going after any style](https://twitter.com/luviedoll801/status/1369571592750002182)",
                                            "score": 15,
                                            "author": "nomoreiloveyous",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "honestly I can see her doing several different styles. She's versatile enough for quite a few of them.",
                                                    "score": 18,
                                                    "author": "telemaxine",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "vocal chameleon Wendy can do it all, and i love her for it, but it does make guessing what she will go with all the more difficult to discern.",
                                                            "score": 12,
                                                            "author": "nomoreiloveyous"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Rap hopefully",
                            "score": 172,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For some reason I can somehow see that happening...&gt;!probably in the form of an SBS diss track!&lt;",
                                    "score": 196,
                                    "author": "telemaxine",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "oh please make it happen",
                                            "score": 40,
                                            "author": "Jakezetci"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They deserve it",
                                            "score": 54,
                                            "author": "VulpesVulpesFox"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Boom Bap Wendy featuring Griselda",
                                    "score": 29,
                                    "author": "BeenWavy07",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Imagine Wendy doing WSG’s adlibs 😂",
                                            "score": 3,
                                            "author": "Danhan1234",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "AYO... boom boom BOOMBOOM",
                                                    "score": 3,
                                                    "author": "BeenWavy07"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "We better get some [swag](https://thumbs.gfycat.com/TheseEveryBallpython-size_restricted.gif) [rapper Wendy](https://www.youtube.com/watch?v=gSsD0gI-ASY) in there",
                                    "score": 13,
                                    "author": "nomoreiloveyous"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Maybe the same as what D.O might take which is R&amp;B? like vocally challenging one.  2021 is definitely the year of soloists. Can't wait for Wendy's solo debut!",
                            "score": 77,
                            "author": "VillageKitchen5380",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I really just hope it's a multi-genre album release... I really like ~~seeing~~ hearing Wendy sing in different styles.",
                                    "score": 45,
                                    "author": "telemaxine"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "ballad mostly",
                            "score": 18,
                            "author": "0okm9",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't know about that, typically the main vocals of SM groups do more R&amp;B type stuff for their solo releases, not ballads.",
                                    "score": 39,
                                    "author": "CronoDroid",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "you got me thinking about that... 🤔\n\n* changmin - pop and rnb\n* kyuhyun - ballad\n* ryeowook - primarily ballad\n* yesung - primarily ballad\n* taeyeon - a large spectrum \n* jonghyun - a large spectrum\n* onew - ballad\n* luna - primarily pop and rnb\n* chen - ballad\n* baekhyun - pop and rnb\n\ntbf it does seem like a lot of ballad, right? not complaining – i love ballads! a lot of artists seem to be straying from ballads to keep “positive energy” during the pandemic, though. i feel like she’ll probably do something funky 👀",
                                            "score": 17,
                                            "author": "ghiblix",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "* Key - r&amp;b and pop\n* Amber - pop hiphop-ish\n* Yuri - dance pop\n* Seohyun - r&amp;b pop\n* Yoona - pop ballad\n* Tiffany - synthpop\n* Hyoyeon - edm\n* Suho - alt rock ballad\n* Henry - electropop with classical instrumental elements\n* Zhoumi - r&amp;b pop\n* Yunho - dance pop\n\nI think there are a fair amount of artists going toward ballads, and i think most suit them, but there are plenty that steer toward more poppy or r&amp;b tracks for solo debuts/releases.",
                                                    "score": 11,
                                                    "author": "scufflegoofy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "indeed, but op specifically said main vocalists! 👆",
                                                            "score": 5,
                                                            "author": "ghiblix",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "oh no i was agreeing with you by pointing out what the lead and sub vocalists did in comparison. Just failing at doing so clearly lol sorry need my morning coffee lol",
                                                                    "score": 6,
                                                                    "author": "scufflegoofy"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I know she can do more than ballad so I'm just curious if she's going to show off that ability in her solo debut.",
                                    "score": 50,
                                    "author": "telemaxine"
                                },
                                {
                                    "level": 3,
                                    "comment": "the only SM soloists that have released mainly ballads are the suju guys. all of the snsd/exo/fx/shinee soloists were more pop/rnb. i'd expect the same for her",
                                    "score": 23,
                                    "author": "a_large_hedgehog",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's not true. Chen and Onew have mainly released ballads. The vocal line members that didnt were already heavily leaning towards RnB in their vocal style (baekhyun, jonghyun, DO most likely). Non vocal line members make music that suits their performance styles (Taemin, Kai, Lay). Wendy hopefully gets to do more exciting music like Taeyeon but the type of songs she does in the radio show, OSTS and in her free time, dont make me hopeful she'll release anything but kballads. Note also how the description highlights \"gentle voice with warmth and clarity\", not \"versatility/crazy vocal acrobatics/power etc\".",
                                            "score": 56,
                                            "author": "nihonbloba",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "LETS FUCKING GOOOOOOOOOOOOOOOOO",
            "score": 104,
            "author": "guywith0imagination"
        },
        {
            "level": 0,
            "comment": "[Holy shit!](https://streamable.com/obbevc)\n\nOMG yes!\n\nI've been waiting for this!\n\nNo wonder her hair has been changing wildly &gt;!and her eyebrows were disappearing!&lt; the past few weeks...\n\nAlso please I want a the album to be released on vinyl...",
            "score": 259,
            "author": "telemaxine",
            "replies": [
                {
                    "level": 1,
                    "comment": "Flashbacks to ootn era",
                    "score": 72,
                    "author": "WrongdoerOptimal9207",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was joking about it on rvcord that her eyebrows are a type of \"litmus test\" for comebacks..",
                            "score": 56,
                            "author": "telemaxine"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Finally some good news to wake up to",
                    "score": 11,
                    "author": "FUCKSTORM420"
                },
                {
                    "level": 1,
                    "comment": "Ooh do you have a link to pics? I’d like to see!",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm sure someone here can provide some twitter links as I was a dum dum and didn't bookmark them... but there was [this](https://reddit.com/r/red_velvet/comments/lvn7te/210226_wendy_gimpo_airport_on_her_way_to_jeju/) a couple days ago where her eyebrows were so bleached they were ~~almost~~ non-existent, then a few days after that they were back again...",
                            "score": 10,
                            "author": "telemaxine",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Omg that’s a wild look for anyone 😬 but she’s a beautiful queen no matter what color her eyebrows are!",
                                    "score": 5,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is crazy!!! ❤️",
            "score": 71,
            "author": "imperial_butts"
        },
        {
            "level": 0,
            "comment": "Could never have imagined this would happen before OT5 comeback, but I'm very excited to see this happen for my fave RV member way sooner than could've been expected. I hope it's a chance to show a side of her she doesn't really normally get to show as a soloist, and isn't a typical ballad. Wendy is an amazing performer with stage presence and enthusiasm that doesn't get highlighted enough. She's already done so many OSTs and ballads. I'd love to see her subvert all expectation and kill a dance track or something equally out of her norm. At the end of the day though, as long as it's something she's happy with, I'll be glad for her.",
            "score": 55,
            "author": "lingeringink",
            "replies": [
                {
                    "level": 1,
                    "comment": "ooh, I’d love if she had a [Free Somebody](https://youtu.be/lpwG8f9nt4s) moment of her own!",
                    "score": 25,
                    "author": "cloudbustingmp3"
                }
            ]
        },
        {
            "level": 0,
            "comment": "she definitely deserves it! highkey expecting it to have at least a ballad or two in it for her lovely vocals",
            "score": 52,
            "author": "_saengdao"
        },
        {
            "level": 0,
            "comment": "Rosé, IU, and then Wendy?!?! I am here for female domination tbh 😤",
            "score": 25,
            "author": "jdbxcv"
        },
        {
            "level": 0,
            "comment": "Okay, I'm speechless. Definitely didn't expect a Wendy solo before an RV OT5 comeback. But it makes sense. Wendy said multiple times already that spring is her season. And her voice was solo material [even](https://www.youtube.com/watch?v=0Q8vdSKaI80) [pre](https://www.youtube.com/watch?v=H1C6S4HwRT4)\\-[debut](https://www.youtube.com/watch?v=xDMLANstgGI). And she is so much better now. Imagine her power! [Come, girl, light us up!](https://www.youtube.com/watch?v=8k9p64vdp7E)",
            "score": 175,
            "author": "kaszadp",
            "replies": [
                {
                    "level": 1,
                    "comment": "Her jazz light me up is a complete work of art.",
                    "score": 17,
                    "author": "jantp"
                }
            ]
        },
        {
            "level": 0,
            "comment": "hopefully sm confirms this soon so i can take off my clown shoes and put on my party hat\n\nedit: CLOWN SHOES OFF, PARTY HAT ON",
            "score": 95,
            "author": "IllamanatiConfirmed",
            "replies": [
                {
                    "level": 1,
                    "comment": "Reading the Wendy Wendy Wendy all I could hear is joy singing that but it’s the American anthem lol love it",
                    "score": 4,
                    "author": "jantp"
                }
            ]
        },
        {
            "level": 0,
            "comment": "First Rosé and now Wendy? This is already the best year for me",
            "score": 50,
            "author": "samy-rosie",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ikr, both my biases. This is amazing",
                    "score": 15,
                    "author": "bbsmydiamonds"
                }
            ]
        },
        {
            "level": 0,
            "comment": "WEN YOU ~~SMILE~~ SING, I AM ALSO HAPPY",
            "score": 51,
            "author": "pearyid",
            "replies": [
                {
                    "level": 1,
                    "comment": "If I could like your comment 100 times, I would",
                    "score": 12,
                    "author": "isavocadoafruit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes!! 2021 is looking to be female solos year! Congrats Wendy!! 🎉",
            "score": 26,
            "author": "Arjun_Jadhav"
        },
        {
            "level": 0,
            "comment": "ARE YOU READY FOR THIS???",
            "score": 25,
            "author": "plenky",
            "replies": [
                {
                    "level": 1,
                    "comment": "ZIMZALABIMMMM",
                    "score": 22,
                    "author": "currypuffff"
                }
            ]
        },
        {
            "level": 0,
            "comment": "REVELUVS WE FINALLY WIN. \n\nso happy for wendy (and hopefully this means a group comeback at some point?)",
            "score": 78,
            "author": "retrosprinkles"
        },
        {
            "level": 0,
            "comment": "whoaaaa what the... very cool if true but then where the hell they gonna fit in a group comeback?",
            "score": 129,
            "author": "fluxural",
            "replies": [
                {
                    "level": 1,
                    "comment": "Late May or June probably. Red velvet are the queens of summer!",
                    "score": 120,
                    "author": "currypuffff",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I feel like they may even wait for fall and put out the third album",
                            "score": 10,
                            "author": "mlk122795",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Their contracts are ending in august. I hope all of them will renew but there are rumours saying otherwise",
                                    "score": 2,
                                    "author": "currypuffff"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[Late May or June](https://twitter.com/baechurenes/status/1362390559688519682) would be my guess.",
                    "score": 38,
                    "author": "IsotopeC14"
                },
                {
                    "level": 1,
                    "comment": "It seems SM is trying YG's starvation tactic /s\n\n2021 really is shaping up to be the year of female soloists and I'm loving it!!!",
                    "score": 72,
                    "author": "Basil-hey"
                },
                {
                    "level": 1,
                    "comment": "The question should be are they all renewing",
                    "score": 17,
                    "author": "vanillabars"
                },
                {
                    "level": 1,
                    "comment": "I have mixed feelings about those news...",
                    "score": 18,
                    "author": "httpshield"
                }
            ]
        },
        {
            "level": 0,
            "comment": "QUEEN SEUNG WAN HEARD Y'ALL WERE DOUBTING WHO THE GOAT VOCAL OF THE 3RD GEN IS",
            "score": 20,
            "author": "BeenWavy07"
        },
        {
            "level": 0,
            "comment": "WE ARE GETTING WOLO GUYSSSSS",
            "score": 35,
            "author": "XxJiniyasxX"
        },
        {
            "level": 0,
            "comment": "Good idea by SM. I'm guessing this is a ballad. Wendy gets more time to heal and she doesn't have to dance unlike with a group comeback.",
            "score": 15,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "FINALLY! SHE FUCKING DESERVES THIS",
            "score": 15,
            "author": "Enzuiguri"
        },
        {
            "level": 0,
            "comment": "Next big female SM solo artist after Taeyeon",
            "score": 56,
            "author": "Zonpig",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly, she has a shot at it. Great vocal as we know, very underrated dancer (just hope her body has healed up), great in variety and one hell of a comeback story.",
                    "score": 58,
                    "author": "BeenWavy07",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "People shouldn't compare her with Taeyeon though, Taeyeon had two massive OST hits within her debut year..",
                            "score": 19,
                            "author": "serowajin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Saying she'll be the next big female solo after Taeyeon doesn't mean she'll be Taeyeon level. She can still be very successful without reaching Taeyeon status.",
                                    "score": 32,
                                    "author": "BeenWavy07",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "She got the international fanbase tho and digital wise she will do better than ty first album for sure! RV is sm's digital monster for a reason!",
                                            "score": 14,
                                            "author": "Batman3002",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[Better than ty first album?](https://pbs.twimg.com/media/CQpVwCvVAAA0JgP?format=jpg&amp;name=medium) Bold strategy cotton",
                                                    "score": 10,
                                                    "author": "serowajin"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yeah I was speaking in general about the Taeyeon comparisons, people always say she'll be \"the next Taeyeon\" which is really doing both a disservice",
                                            "score": 3,
                                            "author": "serowajin",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Taeyeon is also popular for her visual, she was always seen as one of the prettier girl group member. I mean she a very good vacalist, but in Idol world, being pretty is a huge head start.\n\nThat's what makes me worried about Wendy's chance of success, she is by far the best vocalist and one of the best dancer in the group, but she is the least popular. She is also seen as having inferior visual compared to bandmates Seulgi, Irene and Joy. I do hope she is not end up like Luna. One of the most talented Idol Vocalist, flop as a solo singer.\n\nEdit : my god the downvote, god forbid I  talk other than sweet as sugar and pretty as rainbow about idol, or I am a hater.",
                                    "score": 33,
                                    "author": "DramaticLolitoes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don’t get the non-visual part. To me Wendy is very pretty!! And her voice is enough to make her popular with good song choices and promotions",
                                            "score": 33,
                                            "author": "currypuffff",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I mean anyone can be popular with good song choices, but it's hard to know what is a good song choice until it got released and public give their reactions.",
                                                    "score": 7,
                                                    "author": "DramaticLolitoes"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Wendy is definitely not the least popular member i dont know where people get this idea from, and even as a \"less popular\" member she has a very large and dedicated fandom not to mention the majority of Reveluvs are OT5 anyway. Luna meanwhile was never a popular member and never had a sizable dedicated fandom with MeU's being a very solo stan and akgae filled fandom. And Wendy is seen as quite the visual by a great many people, but stuff like that is personally subjective so if you dont find her pretty, especially compared to certain members, thats really just a you thing and not a good generalization.",
                                            "score": 26,
                                            "author": "nomoreiloveyous",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well, I saw some popularity polls before, wendy always comes after Irene, Joy, and Seulgi and even Yeri.\nAnd when talking about Red Velvet visual, Irene, Joy and Seulgi always comes before Wendy. Like, honestly, I don't think I need to tell that Wendy is my bias, but If I say some ugly truth, then I'm a hater by default. Honestly, people. Like it's not a secret that Joy and Irene get ahead of her in popularity just because visual, but it is what it is, I can't change that. I found her very pretty, but I only one person and that doesn't mean shit if thousands other people thinks Irene and Joy are much prettier.\n\nI WILL GLADLY TO BE PROVEN WRONG BECAUSE WENDY DESERVES TO BE THE MOST POPULAR MEMBER OF RED VELVET. HER ALBUM SALES BETTER BE COME CLOSE TO IRENE &amp; SELGI'S ALBUM SALES. NOTHING WILL MAKE ME HAPPIER.",
                                                    "score": 4,
                                                    "author": "DramaticLolitoes",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Popularity polls are highly dependent on where they are taking place and who is responding. Just on r/red_velvet Wendy was the #1 biased member in 2020 and #2 in 2019. For the yearly \"Top 100 Favorite Female Idols Chosen by Lesbian + Bisexual\" polls Wendy was #8 in 2020 (after #1 Irene and #2 Seulgi ), and #8 in 2019 (after #1 Seulgi and #2 Irene). She might have the fewest followers on ig, but even being the last member to create an account months after the others and with only 21 posts in a less than a year and 1/2 (and only 5 posts total in all of 2020) she still has over 4 million followers with a higher level of engagement than many accounts with much higher follower counts. She already has a couple of moderate hits to her name in korea, and her listener count on spotify has been over 1 million user for ages now which is the highest for any RV member and the only one so far to surpass that mark. \n\nPeople know her, she has a really solid reputation in korea, she is active on a variety show right now with her cover songs on there getting some attention, her c-fandom is sizable really dedicated, and ifans stream her music on the regular even with it mainly being old ballad ost and station songs. If sm puts the same level of effort into Wendy' solo debut that they did for I&amp;S's debut then i see solid physical sales and moderate digital performance at the least. There is no predicting the future, especially when it comes to sm, but all the ingredients are there for success.",
                                                            "score": 32,
                                                            "author": "nomoreiloveyous"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes.\n\nGirl has VOCALS and PRESENCE.",
                    "score": 5,
                    "author": "Cocoabeingbean"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is exciting news!!!\n\n&amp;#x200B;\n\nHer colab with John Legend is one of my favorite things in existence:\n\n&amp;#x200B;\n\n[https://www.youtube.com/watch?v=H4a-5BdZ5ck](https://www.youtube.com/watch?v=H4a-5BdZ5ck)",
            "score": 15,
            "author": "Panda_Pez"
        },
        {
            "level": 0,
            "comment": "Expected an OT5 cb but I'm glad we're getting an RV solo now. I've been wondering what a Wendy solo would sound like and she's my bias so this is great news. Seems in line with previous groups' solo debuts too.\n\nWas wondering what will be SM's first April release and I was wondering between Dream and RV and I guess now we know.",
            "score": 13,
            "author": "joesen_one"
        },
        {
            "level": 0,
            "comment": "LET'S GOOOOOOO",
            "score": 14,
            "author": "sarcasmento"
        },
        {
            "level": 0,
            "comment": "April seems so close yet so far...let me listen to [Goodbye](https://www.youtube.com/watch?v=A-emJHnVtZ8&amp;ab_channel=VEM), [What if Love](https://www.youtube.com/watch?v=jndwJe3KUDE&amp;ab_channel=1theK%28%EC%9B%90%EB%8D%94%EC%BC%80%EC%9D%B4%29) and [Spring Love](https://www.youtube.com/watch?v=erErBFKPbMY&amp;ab_channel=SMTOWN) while I wait with respect... (yes this is a shameless promotion post for my favorite songs of hers)\n\nWe might also get OT5 Red Velvet news during her promotions if we are lucky !",
            "score": 11,
            "author": "SwordfishTechnical34"
        },
        {
            "level": 0,
            "comment": "and when we got a beyoncé influenced album THEN WHAT",
            "score": 33,
            "author": "reveldream",
            "replies": [
                {
                    "level": 1,
                    "comment": "The runs!!! Wendy will eat that!!",
                    "score": 18,
                    "author": "currypuffff"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did not see this coming omg. \n\nOn the other hand, maybe we can still get level up project ot5..? I just really miss seeing them together",
            "score": 11,
            "author": "staystrongyerim"
        },
        {
            "level": 0,
            "comment": "Yay! Wendy solo is coming!",
            "score": 9,
            "author": "milkysehun"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 10,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "this ain’t crumbs this is a whole cake as far as i’m concerned\n\nof course a full red velvet comeback would be a cake buffet but i am giddy with joy for one cake",
                    "score": 14,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wendy solooooo!!! (Arguably) the best 3rd gen female vocalist is finally debuting solo!! Been waiting for some ot5 comeback news, but this is amazing too. Like oh my god, the concept possibilities are endless",
            "score": 8,
            "author": "currypuffff"
        },
        {
            "level": 0,
            "comment": "WHAT? LET’S GOOOOO!!",
            "score": 8,
            "author": "kyleseven"
        },
        {
            "level": 0,
            "comment": "Is there a SBS diss track in her album?",
            "score": 7,
            "author": "CynicalMaple06"
        },
        {
            "level": 0,
            "comment": "YESSSSS FINALLY\n\nWendy is going to kill it as a solo artist! She's my favorite person to watch singing, even just on IG Live. I was rewatching some RV concert vids and she has sooo much presence. I'm super excited to see what kind of concept SM gives her :))))",
            "score": 7,
            "author": "Cocoabeingbean"
        },
        {
            "level": 0,
            "comment": "April needed some good news thanks Wendy.",
            "score": 4,
            "author": "2NE1SNSD"
        },
        {
            "level": 0,
            "comment": "YEEEEEEES!",
            "score": 5,
            "author": "coolcoolnodoubt"
        },
        {
            "level": 0,
            "comment": "WENDY SOLO COMING THROUGH HELL YEAH",
            "score": 5,
            "author": "Wolfarick"
        },
        {
            "level": 0,
            "comment": "Wow, awesome!!!",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "And the cherry on top?  SM just released a Red Velvet version of that stupid keyring!",
            "score": 6,
            "author": "Theinternet1134"
        },
        {
            "level": 0,
            "comment": "With all eyes on the recent Idol bullying scandals, it seems SME read the room and realized they can't promote Irene with Red Velvet right now. This is a better idea. With less than 4 months from this release to the end of her contract, it will be interesting to see if she stays.",
            "score": 20,
            "author": "Red_BW",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think it's much more likely that Wendy can't handle a full comeback schedule with choreography and everything yet.",
                    "score": 7,
                    "author": "kerosha"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm so happily conflicted!!!",
            "score": 15,
            "author": "asuka_is_my_co-pilot"
        },
        {
            "level": 0,
            "comment": "HOLY SHIT!!! WAY TO MAKE A RETURN",
            "score": 11,
            "author": "xhammersxthrow"
        },
        {
            "level": 0,
            "comment": "I've been waiting so long for a Wendy solo debut! I bet a group comeback will be shortly after. SM seems to like to have members juggle solo/unit/group comebacks at the same time.",
            "score": 9,
            "author": "mykl55"
        },
        {
            "level": 0,
            "comment": "holy shit I'm so happy, she deserves it so much after everything she's been through 🥺❤️",
            "score": 10,
            "author": "frankachu"
        },
        {
            "level": 0,
            "comment": "What a way to officially end her musical hiatus. I was thinking Seulgi or Wendy would debut solo first but we got Seulrene unit with Seulgi's solo as a bside so I'll take it. I'm excited to see what Wendy does on the songs!!",
            "score": 8,
            "author": "randomneeess"
        },
        {
            "level": 0,
            "comment": "OH MY GOD",
            "score": 5,
            "author": "hydranoid1996"
        },
        {
            "level": 0,
            "comment": "I was expecting a RV comeback but I'll take it. I'm EXCITED for this!",
            "score": 6,
            "author": "nvtoph"
        },
        {
            "level": 0,
            "comment": "Amazing news and she 100% deserves it. With Joy and Yeri saying they'll have something in the first half of the year ot5 will be back in may or June.",
            "score": 8,
            "author": "IsotopeC14"
        },
        {
            "level": 0,
            "comment": "OMG Is this real??? \n\nAlso RV OT5 comeback delayed once again :/",
            "score": 18,
            "author": "AchylesII"
        },
        {
            "level": 0,
            "comment": "YESSSSSS I am ready for my ears to be blessed",
            "score": 4,
            "author": "neocitywayv"
        },
        {
            "level": 0,
            "comment": "I am so happy my favorite voice gets a platform to soar!!!",
            "score": 5,
            "author": "Theinternet1134"
        },
        {
            "level": 0,
            "comment": "I'm so happy for Wendy!!",
            "score": 5,
            "author": "emilie_joyce"
        },
        {
            "level": 0,
            "comment": "WENDY SOLO INCOMING THIS IS NOT A DRILL!!!!!!!!!!!",
            "score": 4,
            "author": "monoclesmash"
        },
        {
            "level": 0,
            "comment": "Vocal queen coming!! I'm so happy she will get this time to shine after nearly having her career and more taken from her just over a year ago. I just hope sm pulls out all the stops for her. I'm curious too if it'll be jazz-focused since its Wendy's favorite genre or more along her biggest hits so far like Spring Love and Goodbye. I've always felt a Wendy solo debut would fit perfectly for spring so this is great.",
            "score": 4,
            "author": "nomoreiloveyous"
        },
        {
            "level": 0,
            "comment": "I am officially back on my Reveluv bullshit, let's fucking gooo!!!!!!",
            "score": 4,
            "author": "Visual-Advertising"
        },
        {
            "level": 0,
            "comment": "Dang where can I preorder",
            "score": 5,
            "author": "jantp"
        },
        {
            "level": 0,
            "comment": "Holy shit!!!!!!!!!!!! Let's goooooooooooooooooooooo",
            "score": 9,
            "author": "ScarfofWonder"
        },
        {
            "level": 0,
            "comment": "Don't mind me, I'm just crying tears of happiness.",
            "score": 3,
            "author": "alldaynapper"
        },
        {
            "level": 0,
            "comment": "Please God, PLEASE have a physical release!",
            "score": 3,
            "author": "mossylungs"
        },
        {
            "level": 0,
            "comment": "Been a Reveluv recently (post Psycho era) and it was worth the wait, since she's also my ultimate bias 💙😭",
            "score": 3,
            "author": "Apogee112"
        },
        {
            "level": 0,
            "comment": "i suspected this once i saw her hair color changes and info of her flying out for an unconfirmed schedule. \n\nso excited for wendy, i know i will love anything she puts out.",
            "score": 3,
            "author": "romancevelvet"
        },
        {
            "level": 0,
            "comment": "the queen is coming to dominate",
            "score": 3,
            "author": "mollytrip"
        },
        {
            "level": 0,
            "comment": "i know we'll get like ballads because shes' a power vocalist but i hope for some quirky indie stuff a la taeyeon and smooth rnb like baekhyun",
            "score": 3,
            "author": "CookieCatSupreme"
        },
        {
            "level": 0,
            "comment": "This is the most exciting news I’ve heard in a long time!!!",
            "score": 3,
            "author": "boopdasnoop"
        },
        {
            "level": 0,
            "comment": "I'd like to remind you people to learn to differentiate between stan twitter clicks and actual gp traction. Sure the other members gets TONNES of clout and recognition, no doubt with their popularity, but Wendy is the only one that actually has LISTENERS. If you're worried about her sales, need I remind you that Monster only won ONCE because it fell off the chart after 3 hours? Not even the 250k sales can save it. Korean gp streaming matters, no matter how good the song intl fans think, if they don't like it then it's over.  Joy's OST was successful due to factors of drama popularity and a remake but that was only once, while Wendy has been consistent with her OST releases, even if it doesn't chart high, people still search for her name and song, some even chart higher than other OSTs in the drama, even if the drama itself wasn't popular (e.g MDIFY). Her listeners on Spotify too, increases every time she releases something, breaking her previous records. No other member has a track record of listeners like Wendy does. Why does it matter if she's not mainstream popular, when she has a dedicated fanbase and gp that are willing to support her?",
            "score": 20,
            "author": "depressedsalmon",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;need I remind you that Monster only won ONCE because it fell off the chart after 3 hours?\n\nWhat? Monster didn't fall off the charts though? It stayed in the top 20 of Melon for weeks. The reason it only won on a music show once is because it was going up against Blackpink's HYLT. Like, Monster was even nominated for SOTY July for Gaon Awards, which is a digital based award. Idk where this perception came that it didn't perform well digitally.",
                    "score": 16,
                    "author": "kerosha",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "to be fair, Monster had to go up against Blackpink HYLT. But yeah, the charting was the major factor, which usually isn't an issue for RV but it was so tough last summer\n\nAlso i probably am not worried about Wendy either, she's such a great singer, the GP usually recognizes it - her song with Eric Nam (Spring Love) always re-charts high on Melon every spring, she has won awards for her OSTs. She continues to get praise in her new role in Mysterious Record Shop. This is not the way some of us imagined either , but everyone who didnt know her now knew her when she had the accident in 2019. Also by virtue of RV themselves being a househould GP name, wendy is obviously fine.",
                    "score": 11,
                    "author": "9epiphany8"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "the format is currently unspecified. it'll most likely be a mini (and hopefully not just a digital release.. wendy deserves the best physical album possible)",
                    "score": 20,
                    "author": "velvetujung",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Holy FUCKING HOLY SNKSJDJD SHIT HOLY SHIT ITS WENDY TIME BOYS LET'S FUCKING GOOOOOOOO",
            "score": 6,
            "author": "MatTheAwesomeCat"
        },
        {
            "level": 0,
            "comment": "BITCH I'M SO, SO FUCKIN HAPPY FOR HER BUT MY WALLET IS ALREADY EMPTY FOR IU'S ALBUMS WHY Y'ALL GOTTA BE SO CRUEL TO MY WALLET :(",
            "score": 2,
            "author": "__underpressure__"
        },
        {
            "level": 0,
            "comment": "EVERYONE MOVING GO GO LET’S GO GIRLS LET’S GO LET’S GOOOOO",
            "score": 2,
            "author": "elswheeler"
        },
        {
            "level": 0,
            "comment": "I hope it a r&amp;b song",
            "score": 2,
            "author": "primasakti"
        },
        {
            "level": 0,
            "comment": "This is so exciting!!!!!\n\nI hope all luvies support her and her sales. This is beautiful, she's gonna serve.",
            "score": 2,
            "author": "challengefanatic"
        },
        {
            "level": 0,
            "comment": "Wow so excited for this! Iam really considering to stan RV since I have been hooked to their B sides than their title tracks and will probably Stan them but before that I have to deal with exams so :') yeah and make some way for this new reveluv",
            "score": 2,
            "author": "tbhguitar_"
        },
        {
            "level": 0,
            "comment": "Guess that means she's renewing then",
            "score": 2,
            "author": "NiceStress"
        },
        {
            "level": 0,
            "comment": "a single tear drop just came out of my left eye",
            "score": 2,
            "author": "WendyIsMyBias"
        },
        {
            "level": 0,
            "comment": "Wanda world domination",
            "score": 2,
            "author": "HatOverall353"
        },
        {
            "level": 0,
            "comment": "OMG SHE DESERVES IT HER VOCALS ARE ONE OF A KIND AND A SOLO ALBUM WILL FINALLY  LET HER SHINE",
            "score": 2,
            "author": "carnvigore"
        },
        {
            "level": 0,
            "comment": "It'd be so nice if she dance. I love it when she shows her sensual side.",
            "score": 2,
            "author": "VjOnItGood81"
        },
        {
            "level": 0,
            "comment": "About damn time!!!",
            "score": 2,
            "author": "fujossi"
        },
        {
            "level": 0,
            "comment": "the best news to wake up to 😭",
            "score": 2,
            "author": "savagedelight"
        },
        {
            "level": 0,
            "comment": "AHHHHHHHHHHHHHHH MY BIAs YEEEEEEEEEEEEE",
            "score": 2,
            "author": "LOONAception"
        },
        {
            "level": 0,
            "comment": "Wohooo!! ♥️♥️",
            "score": 2,
            "author": "Ayana972"
        },
        {
            "level": 0,
            "comment": "YES YESSS 👏 👏 👏",
            "score": 2,
            "author": "jackiechan_4"
        },
        {
            "level": 0,
            "comment": "I seriously couldn't believe what I was seeing on my tl. My first thought was whether today is April Fools lmao. But after seeing the articles being retweeted by big rvluv accts, I felt so happy for Wendy that I wanted to cry. \n\nThe time has finally come. Wendy has always been very vocal about her love and passion for music. I just hope that she can have some freedom to choose what songs to put on her first solo album. Man, no words can really explain how it feels to finally hear that she will be putting out her solo album next week. Can't wait for April to come 😚",
            "score": 2,
            "author": "jjyeon"
        },
        {
            "level": 0,
            "comment": "My dreams are finally coming true I’m so happy for her!",
            "score": 2,
            "author": "rachel_fantasy"
        },
        {
            "level": 0,
            "comment": "Good old reliable Wendy coming in clutch to save my April after the IZONE news 😂",
            "score": 2,
            "author": "calvinised"
        },
        {
            "level": 0,
            "comment": "Yes!! I’m so excited for Wendy! I love her voice and think it suits RnB really well. While I would love to hear an upbeat song from her I do think the former can better highlight her abilities and techniques. Please support her and give her all the love 💙",
            "score": 2,
            "author": "stillwanderer"
        },
        {
            "level": 0,
            "comment": "As a Wendy bias, I'm very happy for her especially after what she went through last year. Wendy is also an exceptional vocalist and deserves a solo album. However, I'm still worry about Red Velvet, and I wonder if this means we won't be getting a RV comeback anytime soon.",
            "score": 2,
            "author": "mad_titanz"
        },
        {
            "level": 0,
            "comment": "OH GIRL COME AND LIGHT ME UP",
            "score": 2,
            "author": "babysnowflake"
        },
        {
            "level": 0,
            "comment": "Yehey ! Wendy deserve it! I'm so excited !",
            "score": 2,
            "author": "darktoken235"
        },
        {
            "level": 0,
            "comment": "sbs better pay every single won of it",
            "score": 2,
            "author": "spicylozenge"
        },
        {
            "level": 0,
            "comment": "Hope they time DO’s solo right so DO and Wendy get a lot of places to run into each other 🥰",
            "score": 3,
            "author": "whyyousaydatt"
        },
        {
            "level": 0,
            "comment": "I love this, but I’m also sad for Joy. She really didn’t have a lot going on last year other than a really popular OST. She didn’t get a sub unit or web show, and hasn’t acted in like three years. I believe it was on Sketchbook that she expressed interest in doing a solo album. Hopefully SM will give her something to do besides endorsements. \n\nPerhaps this is a start to the whole group getting solo albums. If they all renew their contracts and all solo debut a month apart, the last one would be in august, when their seven years are apparently up.",
            "score": 9,
            "author": "smokeyjoey8",
            "replies": [
                {
                    "level": 1,
                    "comment": "[Joy's OST](https://twitter.com/SMTownEngSub/status/1349868902663159808) was the highest sm female release last year and second song only to Psycho, and she received a lot of nominations for it and even performed it and another song on the sketchbook episode you mentioned. That's all a rather big deal for an undebuted soloist. She also had a feature on Crush's song Mayday and took part in the Evergreen Tree charity song for front line workers. She also released the first (and so far only) official and hq song cover on Red Velvet's youtube channel. She also had her spot on Handsome Tigers variety show. She had at least 5 solo magazine shoots last year iirc, and that she is still snatching bigger and bigger cf deals is big too. \n\nThe other members didn't really have a ton going on besides magazine shoots as well because covid and Wendy's injury put a wrench in a lot of plans. Outside of group work the I&amp;S subunit (which was substantial) was near the only work Irene outside cfs had last year. Seulgi had the subunit mainly with a few smaller things like her art book translation, and Yeri only had Yeri's Room (which was unceremoniously cancelled) and the 2 NCSOFT Fever 2020 Cool Summer Project songs. \n\n2021 though has seen the start of a lot of new projects for the girls including new cfs deals for Seulgi, Wendy, Joy, and Yeri. January had Seulgi featuring on Yunho's solo mv and volkwagen cf song and mv with Bewhy, February had Irene's movie debut and solo ost for it, March had Yeri's acting debut, and April will have Wendy's solo debut. Joy is incredibly hard working, and i am sure she has something in the works as well. She has mentioned doing acting again and is likely in demand for more osts after her success last year. Just because one member is getting something doesnt mean another member cant get stuff too.",
                    "score": 40,
                    "author": "nomoreiloveyous"
                },
                {
                    "level": 1,
                    "comment": "That’s gonna kill their album sales",
                    "score": 5,
                    "author": "vanillabars"
                }
            ]
        },
        {
            "level": 0,
            "comment": "YAAAAAAAAAAAAAASSSS",
            "score": 2,
            "author": "markleenct1"
        },
        {
            "level": 0,
            "comment": "If she's gonna do a solo album, since Luna is no longer in SM, I want hers in the same vein as Free Somebody or Galaxy.",
            "score": 2,
            "author": "cultured_vulture",
            "replies": [
                {
                    "level": 1,
                    "comment": "That would be amazing.\n\nBtw, love your flair. \"In my jeans...\" :)",
                    "score": 2,
                    "author": "VulpesVulpesFox"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm so happy for Wendy while simultaneously wishing the rest of Red Velvet would get to also comeback soon.  That's ok though.  I am going to be grateful for this opportunity for her and look forward to hearing what she has for us in April!",
            "score": 2,
            "author": "matmanx1"
        },
        {
            "level": 0,
            "comment": "well i did not expect that... i am so happy for her tho, at least we r getting some reve content. i hope we will get full group comeback soon too 👩🏻‍💻",
            "score": 1,
            "author": "eeeetttt123"
        },
        {
            "level": 0,
            "comment": "YAS REVELUV LETS GO ALL OUT FOR WENDY SOLO &amp; OF COURSE RV COMEBACK WITH MY #1RENE! PREORDER 1K LETS GO",
            "score": 0,
            "author": "Seyfriedly"
        },
        {
            "level": 0,
            "comment": "HOLY FUCKING SHIT WHAT THE MONKEY ASS HOLY FUCKING SHIT OH MY GOSH SWEET SON FUCKING SEUNGWAN WHAT THE FUCK HOLY SHIT",
            "score": 1,
            "author": "Kotaac"
        },
        {
            "level": 0,
            "comment": "I'm so happy! WOLO next month, end of the drought for us luvies!",
            "score": 1,
            "author": "juneaum_"
        },
        {
            "level": 0,
            "comment": "woah! good for her!!",
            "score": 1,
            "author": "sunmi_siren"
        },
        {
            "level": 0,
            "comment": "Hooooly shit let's go",
            "score": 1,
            "author": "ronkalonie"
        },
        {
            "level": 0,
            "comment": "Redveluvs: Red Velvet Comeback when?\nSM: I’ll give you something you didn’t know you wanted \n\nCompletely out of left field and I’m proud of her!! I’m glad she’s going to be promoting on music shows again. I’ll bet 50 bucks it’s a ballad.",
            "score": 1,
            "author": "xailor"
        },
        {
            "level": 0,
            "comment": "oh my god tell me i'm not dreaming",
            "score": 1,
            "author": "kronex1998"
        },
        {
            "level": 0,
            "comment": "so happy for wendy!!! 💙 and hopefully an ot5 comeback after 🥲",
            "score": 1,
            "author": "rvzzb"
        },
        {
            "level": 0,
            "comment": "EXCUSE ME????",
            "score": 1,
            "author": "dblade20"
        },
        {
            "level": 0,
            "comment": "H#$FBJWHK\n\nI'm crying",
            "score": 1,
            "author": "challengefanatic"
        },
        {
            "level": 0,
            "comment": "I expect eargasms!!!",
            "score": 1,
            "author": "cheesykartoffel"
        },
        {
            "level": 0,
            "comment": "Yesss! She deserve it!",
            "score": 1,
            "author": "ThornberryE"
        },
        {
            "level": 0,
            "comment": "Yay!! Awesome that its an album and not just a digital single.\n\nBut this means  RV wont comeback in a while.",
            "score": 1,
            "author": "veckomote"
        },
        {
            "level": 0,
            "comment": "SO FUCKING WELL DESERVED, GO WENDY &lt;3",
            "score": 1,
            "author": "hazeltop"
        },
        {
            "level": 0,
            "comment": "WHAT SHE DESERVES !!!!",
            "score": 1,
            "author": "fawnbeybe"
        },
        {
            "level": 0,
            "comment": "I can’t wait holy moly !!!!",
            "score": 1,
            "author": "CringeInTheClub"
        },
        {
            "level": 0,
            "comment": "I'M SO HAPPY IM LITTERLY IN TEARS",
            "score": 1,
            "author": "WTNVTerezi"
        },
        {
            "level": 0,
            "comment": "This is the best possible news to wake up to",
            "score": 1,
            "author": "army__mali"
        },
        {
            "level": 0,
            "comment": "i hope she can do a ballad or even RnB, i really loved her collab with John Legend\n\nalso hoping WendyxDean 🙏🙏",
            "score": 1,
            "author": "sunnysideyves"
        },
        {
            "level": 0,
            "comment": "Shine on, Wendy, shine on.",
            "score": 1,
            "author": "PolarWater"
        },
        {
            "level": 0,
            "comment": "SOLD!",
            "score": 1,
            "author": "Bizcotti"
        },
        {
            "level": 0,
            "comment": "omg after a year of hiatus, im so happy they're giving her this!! wendy really is about to claim 2021 as she should!",
            "score": 1,
            "author": "dangggg_"
        },
        {
            "level": 0,
            "comment": "She can nail every genre, I have nothing to worry about.",
            "score": 1,
            "author": "depressedsalmon"
        },
        {
            "level": 0,
            "comment": "NANI?!",
            "score": 1,
            "author": "Mark_Kostecki"
        },
        {
            "level": 0,
            "comment": "I'm so glad my wishful thinking for a Wendy solo paid off LMAO. I'm so excited and happy for her!!!!\n\nI wonder if her parents would be at her music show schedules to show support! That would be really sweet.",
            "score": 1,
            "author": "glace0n"
        },
        {
            "level": 0,
            "comment": "wow was not expecting this!",
            "score": 1,
            "author": "thespace4"
        },
        {
            "level": 0,
            "comment": "It feels too good to be true!",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "2021 keeps getting better and better",
            "score": 1,
            "author": "Ex7reMeFx"
        },
        {
            "level": 0,
            "comment": "[OMG!](https://imgur.com/xpbP9XC)",
            "score": 1,
            "author": "missarmc"
        }
    ]
}