{
    "id": "m4qv7b",
    "score": 6836,
    "title": "Brave Girls have taken their first ever music show win for Rollin' on SBS Inkigayo (210314)",
    "author": "CronoDroid",
    "date": 1615708297.0,
    "url": "https://www.reddit.com/r/kpop/comments/m4qv7b",
    "media_urls": [
        "https://i.imgur.com/LsudUT6.jpg"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Soompi: [Brave Girls Takes Tearful 1st-Ever Win With “Rollin'” On “Inkigayo”](https://www.soompi.com/article/1459096wpp/brave-girls-takes-tearful-1st-ever-win-with-rollin-on-inkigayo)\n\nHere's an unofficial upload of [the acceptance speech clip](https://www.youtube.com/watch?v=0cz5AX83MsY) which is included in the Soompi article.\n\n(For region-locked folks, [check the reply](https://www.reddit.com/r/kpop/comments/m4qv7b/brave_girls_have_taken_their_first_ever_music/gqw3ecc/) to this comment for a mirror.)\n\n**[FULL ENCORE LINK](https://youtu.be/bpAYc0D0tXs)**\n\n***\n\n*Congrats, Brave Girls!*\n\n[*Rollin' rollin' rollin' HEY! Rollin' rollin' rollin' HEY!*](https://www.youtube.com/watch?v=cfHWIqJkEf4)",
            "score": 1,
            "author": "alleybetwixt",
            "replies": []
        },
        {
            "level": 0,
            "comment": "One of the best stories of K-pop. Still getting PAKs as we speak. Seeing this all unfold and lead up to this, feels great as a fan, but I can't imagine all the emotions the 4 of them feel now. I hope the Korean public continues to support them and their company doesn't fuck this up for them and not capitalize further on this opportunity.",
            "score": 892,
            "author": "picklechucker",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 279,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lol i can imagine the soldiers making a riot to brave brothers 😂😂",
                            "score": 109,
                            "author": "boboboipablo3792730",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Those men have gone through military training, ready to fight the enemy, they can easily storm a small company lmaoo",
                                    "score": 62,
                                    "author": "SeeTheSeaInUDP"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;Still getting PAKs as we speak.\n\nDespite having big stars releasing their music as well. This is huge!",
                    "score": 277,
                    "author": "ShockernonShaken",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "it's true man, i cried at my heart because i legit tried to push this song to my friends the first it came out, i even got eunji saying happy birthday to me lol\n\nseeing them at this peak, i have found a joy worth living",
                    "score": 68,
                    "author": "freakztaak29"
                },
                {
                    "level": 1,
                    "comment": "Can you summarise what happened? Isn't this an old song?",
                    "score": 16,
                    "author": "SuzakuKururugi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, it's a 4 year old song released in 2017. While it never got trsction amongst the GP, it was a surprising smash hit in the military where it was *extremely* popular. Even so, Brave Girls was on the verge of disbandment when [this video](https://youtu.be/cfHWIqJkEf4) showing a compilation of Brave Girls performing at military bases with comments from service members went viral. Rollin' shot up the charts and hit #1, with the Brave Girls suddenly restarting promotions from the song and going on music shows. And now they've gotten their first win.\n\nIt really is a touching and awesome story, considering the group was talking about disbanding *one week* before the video was posted. A massive turnaround.",
                            "score": 206,
                            "author": "CocaineNinja",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Is there a version with subtitled translation of the comments? I'm so curious to find out what they said :D",
                                    "score": 9,
                                    "author": "LFrittella",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You can turn on the english subtitles with the \"cc\" icon on bottom right.",
                                            "score": 17,
                                            "author": "berserkering"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yeah just turn on Closed Captions, the video already has subtitles.",
                                            "score": 9,
                                            "author": "trapt777",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "The Korean gp is also amazed at how they worked hard performing at over 100 military shows which are low paying and far away to travel to",
                            "score": 11,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "a compilation [video](https://www.youtube.com/watch?v=cfHWIqJkEf4) of their Rollin performance that features several comments was uploaded on youtube and it includes their performance mostly on korean military went viral. The song started to reappear on charts after that and gained no.1 in a week.",
                            "score": 42,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm absolutely thrilled for them! What a great story to start 2021 off with.\n\nOn the other hand, my upstairs neighbor listens to this song incessantly and its practically burned into my skull now",
            "score": 690,
            "author": "TwoHungryBlackbirdss",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lucky, I wish my upstairs neighbour played decent music. Instead they just blast a lot of bad country music and drop what sounds like jars full of marbles (???) at 3 am.",
                    "score": 348,
                    "author": "Nixon4Prez",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm cackling at your description oh my GOD.\n\nI think she's learning the choreo because she'll play like 15 seconds of the song, pause, and repeat it half a dozen times. My eye is beginning to twitch when I hear those opening notes.\n\nStill a great song tho",
                            "score": 263,
                            "author": "TwoHungryBlackbirdss",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's pretty wholesome lol.",
                                    "score": 111,
                                    "author": "[deleted]"
                                },
                                {
                                    "level": 3,
                                    "comment": "I’ve been learning dances at home during the pandemic. By the time I’ve recorded, every 5 second interval of that song has been played at 70% speed like 30 times. My SO’s music taste and mine are becoming more disjoint every day.",
                                    "score": 19,
                                    "author": "Conceptizual"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[your upstairs neighbors](https://youtu.be/4IRB0sxw-YU)",
                            "score": 30,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "My neighbor downstairs blasts rap music and not even good rap music either.",
                            "score": 30,
                            "author": "Goose_Queen"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 60,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Shout out to 아나요 and 요즘너 as well. Brave Bros makes some of the best kpop songs.",
                            "score": 16,
                            "author": "pynzrz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 13,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I really miss Hyeran, she was such a beast! But last I checked she seemed to be very happy living a normal life",
                                            "score": 12,
                                            "author": "krakenjacked"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What city do you live in? Haha",
                    "score": 25,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Seoul! otherwise I probably would have gone upstairs to introduce myself and ask if I can join in haha",
                            "score": 82,
                            "author": "TwoHungryBlackbirdss",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Youe neighbour has taste man. Mine constantly play Schlager music (the German version of trot kinda), music that you'd hear at a alpine ski bar/restaurant. And it's spring.",
                    "score": 9,
                    "author": "SeeTheSeaInUDP"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This has to be one of the best, if not *the best* first wins in kpop history. I cannot imagine how they have felt the past week, pivoting from imminent disbandment to explosive success. Congrats, ladies!!!",
            "score": 1560,
            "author": "austen1996",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's seriously so sweet, up there with EXID and CLC for the sweetest first wins",
                    "score": 458,
                    "author": "Tulra",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "NU'EST's first win is another really sweet one, their encore stage where they're all [so overcome by emotion](https://www.youtube.com/watch?v=diQcbEuCuy4) is so wonderful.",
                            "score": 316,
                            "author": "Nixon4Prez",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh, this is definitely in my list of best wins of all time. The way JR was clearly unprepared and dumbfounded by their win was so endearing. The only thing that could’ve made this moment even sweeter was if Minhyun was there to experience it with them as well (though of course, he indirectly played a huge role in helping them net this win)",
                                    "score": 116,
                                    "author": "austen1996"
                                },
                                {
                                    "level": 3,
                                    "comment": "Adding Pentagon's [first win](https://youtu.be/onYv8RRDBZs) as well!",
                                    "score": 74,
                                    "author": "Stoop_Girl",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not technically a *first* win, but [T-ARA's first win](https://www.youtube.com/watch?v=bKpRo3h7Ovw) post-Hwayoung being revealed as the real bully in 2017 also fits into this category for me of feel-good kpop music show moments.",
                                            "score": 64,
                                            "author": "rainshowerprince",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, this is the most emotional win I've seen.",
                                                    "score": 15,
                                                    "author": "H-E-D"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Is it the longest time to first win? Might depend if you only count the members debut date or the group debut date?",
                    "score": 15,
                    "author": "pynzrz",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "THEY DID IT. The girls did it! South Korea GP did it! The military did it!\n\nI'm so happy for them! I hope Inki releases a full video of the encore as the girls were overcome with emotion! &lt;3",
            "score": 809,
            "author": "starrystillness",
            "replies": [
                {
                    "level": 1,
                    "comment": "The military guys joined in circles and did this\n\n&lt;😄&gt;   &lt;😉&gt;  &lt;😐&gt;  &lt;😀&gt; \n\nㅣ  ..  ... ㅣ  .. ...ㅣ..  ...ㅣ \n\n/ \\  ..  .. /  \\ .. .. / \\ .. . /  \\ \n\nAnd summoned that first win.",
                    "score": 272,
                    "author": "SeeTheSeaInUDP",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This comment always gets me, honestly its helping me learn who's who when I watch the performances",
                            "score": 57,
                            "author": "Django2chaiined",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Loll so \n\n😄  Yoojeong - eye smile and living serotonin \n\n😉  Minyeong - winking main vocal \n\n😐  Yuna - chic/sexy stare, short hair \n\n😀  Eunji - big and pretty eyes, prominent aegyosal (\"eye bags\")",
                                    "score": 86,
                                    "author": "SeeTheSeaInUDP"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Can someone explain the emoji? Which part of the choreo is the | /\\  parts?",
                            "score": 9,
                            "author": "wind__flower",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's the body lol imagine the figure like a stick man",
                                    "score": 20,
                                    "author": "SeeTheSeaInUDP",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I literally cried during their acceptance speech cuz they wouldn't stop crying either 😭",
                    "score": 219,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Eunji (lovingly adored for her distinct eyes) cried so much that her eyes were tiny in the photos on their Twitter account. They all deserved it! &lt;3",
                            "score": 68,
                            "author": "starrystillness"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "rejoice!!!!! so many good things have happened since viditor posted their video nearly 3 weeks ago 😭\n\nit's been fun witnessing history. congrats to Brave Girls!!!",
            "score": 180,
            "author": "lilfreaks",
            "replies": [
                {
                    "level": 1,
                    "comment": "Brave Brothers should buy Viditor a fucking car or something, that guy literally single-handedly saved the career of Brave Girls",
                    "score": 194,
                    "author": "Taibo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I read that the girls have invited Viditor to meet up over a meal to thank them. They're even placing bets on whether Viditor is a guy or girl. Lol.",
                            "score": 162,
                            "author": "starrystillness",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hopefully it won't be like what happened with EXID where their offer got rejected lol.\n\nWhere did you read about this btw?",
                                    "score": 43,
                                    "author": "CocaineNinja",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "They talked about it at around 8:30 of this [interview](https://www.youtube.com/watch?v=ojSEL_V6WA0). Unfortunately, it doesn't have subs yet. I just read a summary translation on Twitter.\n\nAnd based on my very limited Korean, I could understand that this was the case, with the girls divided on whether Viditor is male or female.",
                                            "score": 49,
                                            "author": "starrystillness",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I watched it and they said they wanted to 식사라도 대접해드리고 싶다 which means at the very least treat them to a meal.",
                                                    "score": 18,
                                                    "author": "woonawoona"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Damn, I hate that YT removed community subs. Do you remember where you saw the translation on Twitter?",
                                                    "score": 7,
                                                    "author": "CocaineNinja"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Wait who's Viditor? Were they the one who made the song viral? If so, they truly deserve praise. Congrats to the girls.",
                            "score": 35,
                            "author": "Straight_Tip",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup. They edited the girls military performance and added the performance comments which went viral. There were comments where military people were like we can join the koreas with this song lolol",
                                    "score": 63,
                                    "author": "jackiechan_4"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yea that's the youtube channel that posted the stage mix with comments that went viral.",
                                    "score": 24,
                                    "author": "warhammerkid"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": " I think I just got a little taste of how does it feel when your favorites win 1st place for the first time? And I don't even stan Brave Girls. So happy for them. I would probably die if my ultimate group will ever win.",
            "score": 445,
            "author": "Sleepwalker8686",
            "replies": [
                {
                    "level": 1,
                    "comment": "haha when Dreamcatcher get first win I will definitely faint. \n\nI'm honestly so happy Brave Girls won though, I haven't even heard of them before March but their first win almost made me tear up.",
                    "score": 221,
                    "author": "isimpforsiyeon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "whats sad is they did win till they got screwed over",
                            "score": 52,
                            "author": "Famous_Ad_4542",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As is tradition",
                                    "score": 19,
                                    "author": "gwaenchanh-a"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I'd be crying so much if they did win",
                            "score": 5,
                            "author": "lalalaperson___"
                        },
                        {
                            "level": 2,
                            "comment": "Dreamcatcher best bet is Mcountdown because The Show will change the rules whenever they like just to keep DC from winning",
                            "score": 21,
                            "author": "prime5119"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's so satisfying to see especially since Brave Girls stans have waited a decade for this moment.",
                    "score": 62,
                    "author": "JT810"
                },
                {
                    "level": 1,
                    "comment": "I would probably scream (no pun intended) and squeal out of happiness and mark that day to celebrate for years to come XD",
                    "score": 44,
                    "author": "tbhguitar_"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 28,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow this is really one hell of a comeback! I’m a big shinee and ateez fan but this win........ was well deserved and truly a long time coming for their triumphant return. This is the most wholesome and heartwarming, goosebumps-inducing first win story (I’m sure their 10 years is the longest record so far) I’ve witnessed in real time and I’m really so so happy for them and the fans. This is literally history in the making. \n\nWishing only the best for them going forward and may the odds keep *rollin* (hah) in their favor this time!",
            "score": 288,
            "author": "kqfalala",
            "replies": [
                {
                    "level": 1,
                    "comment": "Brave Girls gets their long awaited first music show win 3,628 days after debut, I think that's a new record for both boy and girl groups on who took the longest before first win?",
                    "score": 202,
                    "author": "JT810",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I believe so! I believe the boy group record is still NUEST at 2613 days after debut",
                            "score": 86,
                            "author": "jaemjenism",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You were almost correct except U-KISS still holds that record for BGs with 2,364 days (6 years, 7 months)",
                                    "score": 40,
                                    "author": "JT810",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you count NUEST W it doesn't count but NUEST was after 7 years, longer than UKISSs 6 and 7 months",
                                            "score": 32,
                                            "author": "jaemjenism"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Counting from date of first release, NU’EST are 2610, U-KISS are 2358.",
                                            "score": 16,
                                            "author": "lowelled"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It depends if you count from 2011 when BG originally debuted or Deepened in 2016, when the group was essentially rebooted with 5 new members added to the existing 2 remaining. If you go by the first they’re the longest overall at 3,628 days but if you go by the second they’re the longest GG at 1,853 days but still beaten by NU’EST (2,610 days), U-KISS (2,358 days) and 1st gen boy group NRG (1,961 days). It’s basically what happened to Minx (total concept reboot, new members added) without the name change. Either way, it's a wonderful achievement, and I think they'll keep winning trophies this week!",
                            "score": 55,
                            "author": "lowelled",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "For girl group, I think [Jewelry](https://twitter.com/chonnazorn/status/1095777101263843330?s=19) got the longest days before winning: 1,493 days.",
                            "score": 8,
                            "author": "aeramarot"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Shawol here. I’m happy for their win. Such a good story.",
                    "score": 35,
                    "author": "oliviafairy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "their reaction honestly made me tear up. definitely a heartwarming moment ☺",
            "score": 136,
            "author": "peachloveee7",
            "replies": [
                {
                    "level": 1,
                    "comment": "I love Eunji's reaction, she's genuinely shocked. Look at how wide her eyes are",
                    "score": 38,
                    "author": "CocaineNinja"
                },
                {
                    "level": 1,
                    "comment": "do you have link to it? i would love to see it (and cry again)",
                    "score": 30,
                    "author": "eeeetttt123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "https://youtu.be/NHYuamnIe2Q",
                            "score": 58,
                            "author": "peachloveee7",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Their reactions 🥺😭\n\nThe crying hours just never stop this weekend. Words can't describe how happy I am for them, this is such a gamechanger.",
                                    "score": 27,
                                    "author": "Shinkopeshon",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I knew they were gonna break a record with this but I didn't know it was nearly an *entire decade* since the group debuted. Now that's gonna be tough to top.\n\nAdmittedly the current lineup is \"only\" from 2016 so I'm sure we'll have people arguing technicalities forever.\n\nWhatever, however you count it, it's an amazing accomplishment.",
            "score": 203,
            "author": "loot168",
            "replies": [
                {
                    "level": 1,
                    "comment": "when you said \"only\" and it's like almost 5 years ago",
                    "score": 93,
                    "author": "mxyzptlxk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm not crying, you're crying!!! \n\n jk we are all crying especially me\n\n I cried when they hit #1 on Bugs, cried when they got a PAK and now I am crying more",
            "score": 138,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Minyoung sobbing in a corner rn. Fantastic timing after seeing their appearance on Rain's channel",
            "score": 85,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did that get English subs yet? I keep checking  but didn't find Subs so far.",
                    "score": 11,
                    "author": "hiroo916",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah it has Eng subs now. Or at least there's a subbed version",
                            "score": 7,
                            "author": "CocaineNinja"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is such a kpop fairytale, it is also a good lesson for people like me for not giving up. Good things happen sometimes",
            "score": 126,
            "author": "kavanathunderfunk",
            "replies": [
                {
                    "level": 1,
                    "comment": "For someone's who more into nugu groups vs the popular groups, this is such a feel good moment. It's  one of the best first wins I've seen",
                    "score": 51,
                    "author": "JT810"
                }
            ]
        },
        {
            "level": 0,
            "comment": "One for the history books, even beating strong competition as well. Congrats to the Brave Girls!",
            "score": 80,
            "author": "joesen_one",
            "replies": [
                {
                    "level": 1,
                    "comment": "And to take the dub on an show where bigger groups or soloists usually win makes it all the more better.",
                    "score": 65,
                    "author": "JT810",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Several big-named groups haven't even won Inkigayo yet, this is a massive flex for Brave Girls as well.",
                            "score": 64,
                            "author": "joesen_one"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is THE win, on a broadcast station too.\n\nThis story keeps getting better and better. Hitting #1, then RAK, gigs lined up left right and centre, then multiple PAK, first win. What’s next? These girls are killing it all round and thank you SK for giving them a chance. \n\nThis is definitely one of the most monumental wins in K-pop history.",
            "score": 124,
            "author": "intlPogoTrades",
            "replies": [
                {
                    "level": 1,
                    "comment": "what’s next?! well, hopefully their company fulfills minyoung’s promise that if they win on a music show, they’ll hold an online concert! aside from that, i’d really just love to see them be consistently successful to prove that they aren’t one-hit wonders, two-hit wonders if the next comeback does well. i want them to show them that brave girls are here to stay! that’s all i could ask for.",
                    "score": 72,
                    "author": "SunsetPlot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If Brave Bros fucks this up I will fly to Korea and burn down their building.\n\nSeriously this is a once-in-a-lifetime opportunity. Ignoring the fact that he owes them for not promoting them properly for years and giving his hit songs to other groups, from a pure business standpoint he stands to make a killing if he strikes while the iron's hot. I hope he takes this seriously and works his magic on their next comeback. If he does things properly Brave Girls can have at the minimum a pretty decent career for the next few years.",
                            "score": 50,
                            "author": "CocaineNinja"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If there will be Queendom 2 hopefully they will be invited",
                    "score": 11,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh I would LOVE them in Queendom! My dream is to watch them performing a special version of High Heels, that song is my jam",
                            "score": 3,
                            "author": "Microkitsune"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is a story for the history books, congratulations girls!!!",
            "score": 64,
            "author": "hydranoid1996"
        },
        {
            "level": 0,
            "comment": "Rollin Rollin Rollin",
            "score": 81,
            "author": "Scarlett_P",
            "replies": [
                {
                    "level": 1,
                    "comment": "Rollin Rollin Rollin ↘️ Rollin Rollin Rollin ↗️ \n\nGidarigo itjanha baby, just only you \n\n&lt;😄&gt;   &lt;😉&gt;  &lt;😐&gt;  &lt;😀&gt; \n\nㅣ  ..  ... ㅣ  .. ...ㅣ..  ...ㅣ \n\n/ \\  ..  .. /  \\ .. .. / \\ .. . /  \\",
                    "score": 118,
                    "author": "SeeTheSeaInUDP",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There it is! Upvote this. lol",
                            "score": 13,
                            "author": "GinInsideMyTonic"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think this is like an impossible record to beat. I know this lineup didn't join Brave Girls until 2016, but the group technically debuted in 2011 so they got their first win after TEN YEARS! But even if you count from 2016, the first win after five years and with a FOUR YEAR OLD SONG is incredible. Unprecedented. \n\nI'm so happy for them, to be working so hard for so long with nothing to show for it but then all of a sudden getting elevated to this position. Magic. I just hope they can continue this success with a proper comeback too. Their songs have always been good, including the pre-2016 ones. They've just been ignored, but Brave Brothers can compose mastahpeeces.",
            "score": 237,
            "author": "CronoDroid",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I believe this is a new record for both boy and girl groups on who took the longest before first win in Kpop. Brave Girls had to wait nearly 3,630 days for this moment",
                    "score": 52,
                    "author": "JT810"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Holy shit. They actually did it! And by a hell of a lot too when compared to SHINee's score. The GP really came in and helped them get over the last hurdle.\n\nIs this the first time an older song (as in, not from a current promotion period) won a music show award? Because this definitely feels like a first, if at least a record.\n\nI'm so happy for the girls. They totally deserve this. Now all they need is a #1 on the Gaon singles chart to really be the cherry on top.\n\nThey're going to the moon!",
            "score": 86,
            "author": "af-fx-tion",
            "replies": [
                {
                    "level": 1,
                    "comment": "I believe EXID did the same with UP and Down, though it wasn't long after their promotions had ended",
                    "score": 46,
                    "author": "jaemjenism",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh yeah, I guess EXID would count. Their turnaround was so quick that I had forgotten that they had stopped promos for the song at the time the song went viral.",
                            "score": 18,
                            "author": "af-fx-tion",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't normally watch music shows but I watched it today just to see Brave Girls win live and see their reactions! I was so nervous the whole show but I'm so happy to see them grab a win! I can definitely rewatch the winner announcement over and over again lol",
            "score": 71,
            "author": "Blueflame407"
        },
        {
            "level": 0,
            "comment": "Congratulations to Brave Girls and Fearless! I live voted for the first time ever on STARPASS because I wanted to help contribute to this amazing underdog story in any way possible. Their reaction to the winning announcement was so priceless, and I can’t even begin to fathom the emotions that the members are feeling right now. Hope that this is the first of many wins for the newly crowned queens!",
            "score": 94,
            "author": "DJJohnnymeister",
            "replies": [
                {
                    "level": 1,
                    "comment": "Me too! I asked my friend who isn't into kpop at all to download starpass because it's blocked on my device, and I voted for them. They D E S E R V E.",
                    "score": 16,
                    "author": "SeeTheSeaInUDP"
                }
            ]
        },
        {
            "level": 0,
            "comment": "tears. one of the rare feel-good moments ever since last year. congrats to brave girls!! now go get that bread",
            "score": 45,
            "author": "hanabanana23"
        },
        {
            "level": 0,
            "comment": "A 9-year old group with a 4-year old song earning their first win.\n\nNever had this on my 2021 k-pop bingo but I am ecstatic. Underdog stories are always the best",
            "score": 41,
            "author": "bespectacIed"
        },
        {
            "level": 0,
            "comment": "Is this what they call a fairytale ending? Or did the tortoise beat the hare? I think this is really the cherry on top. The last week has surely been a story out of a movie for Brave Girls. Nobody would have wrote such a script. Extraordinary, this win will go down in Kpop history.\n\nTo have a first win on a public broadcast channel and Perfect All Kill on all charts in a week is just mind blowing. And they did this as an almost 10 year old group and using a 4 year old song.\n\nDid they say if any group achieves a first win, their fortunes and successes will be all set? I really hope that Brave Ent doesn't fuck up their future schedules now. Well even if they do, I believe they will be able to find new careers and opportunities with their new statuses now.\n\nI hope this win will also inspire all the Elrises/Weki Mekis, Fromis_9s and other under the radar girl goups. I sincerely believe that your time will come one day.",
            "score": 34,
            "author": "pzshx2002",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Or did the squirtle beat the hare\n\nFTFY",
                    "score": 8,
                    "author": "SeeTheSeaInUDP"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Previous record is OT5 Nu'est at 2611 days (7 years 1 month) to get first win \n\nBrave Girls winning today is 3630 days (9 years 11 months)",
            "score": 48,
            "author": "5mayday"
        },
        {
            "level": 0,
            "comment": "This is like a fairytale come to life and I’m glad they managed to net a win for it!",
            "score": 32,
            "author": "adorneds"
        },
        {
            "level": 0,
            "comment": "amazing! on inkigayo too!",
            "score": 36,
            "author": "worstsunday",
            "replies": [
                {
                    "level": 1,
                    "comment": "And by a good amount",
                    "score": 23,
                    "author": "JT810"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&lt;😄&gt;   &lt;😉&gt;  &lt;😐&gt;  &lt;😀&gt; \n\nㅣ  ..  ... ㅣ  .. ...ㅣ..  ...ㅣ \n\n/ \\  ..  .. /  \\ .. .. / \\ .. . /  \\ \n\nAAAAAAAAHHHHHHHH I'M SO HAPPY FOR THEM! BRAVE GIRLS LET'S ROLL TO THE TOP!",
            "score": 23,
            "author": "SeeTheSeaInUDP"
        },
        {
            "level": 0,
            "comment": "AAAAAAAAAAAAAAAAAAA!!!!!!!!!!!!!!!!!! I can't even express how happy I am! They are SO deserving of it, and Inkigayo as a first win is even better since it's usually considered the hardest to get first wins on! Whether you count it as taking 10 years (from the group's inception) or 5 (from the current lineup's addition), it's still a multi-record-breaking win: longest to a first win, and the largest gap from song release to win! Just absolutely insane. They've become a wall on the charts. 14 PAKs and counting. Minyoung mentioned that their dream would be to win on a music show and they DID. And it's only the start! It's been so amazing watching Rollin take off and seeing how genuinely happy and excited the girls are to be back on stage. *This* is how Rollin should've been promoted years ago (no sexy vampire concept, since it's a fun and uplifting song, no lyrics controversy), but at the same time, if it was, we wouldn't have the absolutely crazy, history-making moments we do. As a fan since the OG Rollin era and always hoping BG would pull through to get notoriety, I am just thrilled. I hope many more wins and success come! &lt;3",
            "score": 44,
            "author": "moonfrequency",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It's these beautiful, heartwarming moments that make it worth the effort to support your favorite artists. \n\nSince they started repromoting again you could tell they were genuinely happy to be back on stage; I only wish they could have had a live audience to really hear those cheers of support!",
            "score": 22,
            "author": "breadstal"
        },
        {
            "level": 0,
            "comment": "AHHHH THEY DID ITTTT OMFG MY GIRLS we’ve been dreaming of this day!!! When we ride was released last year and I thought it would be their last release before disbanding 😭 cant believe it!!!",
            "score": 31,
            "author": "kyotodreams",
            "replies": [
                {
                    "level": 1,
                    "comment": "speaking of We Ride, it's currently #106 on Melon, yesterday it was #123. Hopefully it enters the top 100 tomorrow",
                    "score": 19,
                    "author": "yameteeeeeeeeee"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is the first time I see Yuna cries (or show strong emotions 😁)\n\n\nIm so happy the girls win.",
            "score": 30,
            "author": "DumplingsInDistress"
        },
        {
            "level": 0,
            "comment": "Tuned in to the livestream bc I was curious abt the stages but I was late so I was only able to watch the last 3 stages and the results. I had no idea they had a chance to win today but I'm so happy for Brave Girls rn!! And getting a first win at a major music show at that. \n\nI saw the girls esp Yujeong crying and I teared up too huhu, their whole whirlwind success for the past 2 weeks has been really heartwarming for everyone I know even for those who just like me, only discovered them half a month ago and I'm really thrilled with what they've achieved so far. The encore was a bit cut so we didn't see the entire encore so I'm waiting for the full vid.",
            "score": 31,
            "author": "Tinker-Energy"
        },
        {
            "level": 0,
            "comment": "This is like one of those feel-good stories at the end of the evening news that reminds you that every now and then this place isn't so bad. Part of me would like to think this is for Rainbow, Bestie, Nine Muses, Stellar and other GG of that era that never won.",
            "score": 28,
            "author": "3verything_bage1"
        },
        {
            "level": 0,
            "comment": "My god. Can you imagine how they're feeling right now? I cried watching their encore. I hope they succeed and make lots of money from all of this.\n\nWow, what a comeback.",
            "score": 7,
            "author": "CHOOMTOP"
        },
        {
            "level": 0,
            "comment": "Can't wait to see what is in store for the girls. Even if Brave Ent don't fully capitalize on the hype now or fall short, these girls are already well known in Korea, having been booked or are going to booked in every single possible highest rated or popular shows in the whole country. (music shows, variety shows, youtube channels, radio shows etc)\n\nLots of artistes will definitely want to collab with them now, Rain + Brave Girls anyone? OST? Survival show mentors? Reality shows? CFs? Magazine shoots?\n\nBrave Ent will be having a happy headache now trying to get the best deals for the girls. I wish they can finally start to reap the fruit of their labours.\n\nI thought of a good analogy which is they went from being at the bottom of the summit of Mount Everest to scaling to the very top in a matter weeks. No doubt they did it the hard way, with few tools and good fortune/timing.",
            "score": 20,
            "author": "pzshx2002",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly. Oh My Girl still are riding the success of their last comeback and it's been 11 months. Brave don't even need to rush things but would be nice to get a mini album in the summer or a single in June/July and a full album in the 2nd half of 2021.",
                    "score": 16,
                    "author": "gkmaster21"
                }
            ]
        },
        {
            "level": 0,
            "comment": "THEY FUCKING DID IT!! I actually teared up seeing them cry 😭",
            "score": 26,
            "author": "rockthekazb0t"
        },
        {
            "level": 0,
            "comment": "Congratulations! Their fancams continue to rack up VIEWS, hopefully an encore fancam will get released.\n\nEDIT: It's been released! Looks like it's going to achieve 1 million views soon and it hasn't even been 12 hours.\n\nEDIT 2: The encore fancam got 1 million views in 9 hours.~",
            "score": 26,
            "author": "metallicwrapper",
            "replies": [
                {
                    "level": 1,
                    "comment": "Inkigayo would be nuts not to release an encore fancam. The girls are the nation's darlings right now and the views for that one would skyrocket if it were posted. Crossing fingers for it.",
                    "score": 20,
                    "author": "starrystillness"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Makes you believe in magic I swear",
            "score": 26,
            "author": "cheeto1995",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Congrats! I’ll be honest and say that I had no idea who they were but it’s hard to not root for the kind of underdog story they have.",
            "score": 25,
            "author": "BluexFlash",
            "replies": [
                {
                    "level": 1,
                    "comment": "A feel good moment when you remember not only were Brave Girls facing imminent disbandment, they had to wait over 3,000 days for this win.",
                    "score": 18,
                    "author": "JT810"
                }
            ]
        },
        {
            "level": 0,
            "comment": "From \"tomorrow we got disbandment\" to first win in a matter of a month or so, the girls must be very overwhelmed by emotion rn",
            "score": 22,
            "author": "tonyfrancois"
        },
        {
            "level": 0,
            "comment": "What a first win congrats to Brave Girls! This is such an achievement against all odds. Really happy for them can’t wait to see what they have in store next.",
            "score": 16,
            "author": "bluebetaoddeye"
        },
        {
            "level": 0,
            "comment": "To think that this was absolutely unthinkable not even 3 weeks ago... the members must be getting whiplash to go from 0-100 practically overnight",
            "score": 18,
            "author": "KawaiiBLK"
        },
        {
            "level": 0,
            "comment": "&gt; To foreigners who are wondering why BRAVE GIRLS blew up. It is not just about the song Rollin. \nYes, it has to do with Viral video but it is much deeper than that.\nThey went to more than 100 military shows. people now found out about that through viral video and have respect for that hard work. military shows usually don't pay much at all. maybe transport fees. but they went more than 100 times. Idols usually do not want to go perform in these shows maybe once a year. but brave girls even went to a place no idols went to 12 hours drive just for the show and every show they gave it all. you can see it in a youtube video. people now found out about it. it is not just about the song 'rollin'. it is much more than that. you really need to understand why Korea is loving brave girl so much right now.\nit has a lot to do with these girls went to all these military shows, and the general public did not know it. That hit hard. plus they were about to disband two days before the viral video came out. It was really heartbreaking as well. This group is a 10-year-old group. (These 4 members were from 2016) Never had a chance to shine. People want this group to get what they deserve, also became a fan by knowing their personality. \npeople want to support them for what they've done all these years.\n\n&gt; This is the one video that went viral Changed their life. (It has an ENGLISH subtitle so turn it on) \nhttps://www.youtube.com/watch?v=cfHWIqJkEf4\nonly a few days before this video was uploaded member of Brave girl talked about going to work at the cafe on their Instagram live. 2 girls were already moved out from the company to their home. then this video went viral. after 2 days later the song 'rollin' went to about No.20 on the chart. but girls did not want to have high hope and have let down again. but it went No.1 the next day. You can see how surprised it was for them on their SNS posting. They thought it was just for a moment. but it got bigger and bigger. the whole nation was going crazy over these girls. They had only 10 people in their fan club like 3 weeks ago. so basically their life changed during the last 2 weeks. They just won 1st prize on Inkigayo today!\nafter the viral video\npeople are discovering these videos\nhttps://www.youtube.com/watch?v=VIagkQyJLmE&amp;t=1717s\nshowing how hard they worked without anyone knowing.  going around the country. performing for the military. It really touched people's hearts + the story of they were just about to quit the group.\nand also the company for not dropping the group for 10 years even though the group was not making any money. the CEO kept saying ' it is okay you are going to be big one day' He kept saying it to them. He produces songs to make money so he can keep this group. That is why they respect the CEO so much.\n\n&gt; https://www.youtube.com/watch?v=YCuPBYhz6ns\nThis is an interview video but it is in Korean, with no subtitle. she is saying all of those things I wrote up there. They had really low self-esteem. right before they blew up.",
            "score": 6,
            "author": "0okm9",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I was also afraid that during the announcement they will stick groups behind the scene, as they did before (because of too many people on stage due to protocol), but they didn't and it was glorious to see Brave Girls instant reaction.",
            "score": 16,
            "author": "Sleepwalker8686"
        },
        {
            "level": 0,
            "comment": "So happy for them! They’re so talented, i hate that it took them this long to be recognized.",
            "score": 16,
            "author": "Very_Tight_Ass",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Absolute legends🥰🥰🎉🎉🎉🎉",
            "score": 21,
            "author": "Visual-Advertising"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 20,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "i'm gonna need him to take his sweet ass time rather than rush it... review all the works he's done for aoa, sistar, sunmi, etc., and really make sure the song involves the girls' opinions as well! all he needs to remember is that the thing the public loves about the girls are their smiles. make a song that is infectious and great just like rollin'!",
                    "score": 26,
                    "author": "SunsetPlot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sistar passing the summer kpop queens title to Brave Girls? I would like to see it",
                            "score": 11,
                            "author": "rainshowerprince",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is my kind of fairytale story",
                                    "score": 3,
                                    "author": "Microkitsune"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can’t stop listening to this earworm of a song! Congrats to them, this is a truly one-of-a-kind story :’)",
            "score": 15,
            "author": "yestodays"
        },
        {
            "level": 0,
            "comment": "i am so happy but i cant stop crying. they did it... after all the years they did it. so proud of them.",
            "score": 14,
            "author": "eeeetttt123"
        },
        {
            "level": 0,
            "comment": "Rest of ya'll done goofed. The revolution is here",
            "score": 15,
            "author": "Manticore8x",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Brave Girls are the revolution\"",
                    "score": 9,
                    "author": "leonster",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm incredibly happy for them and how everyone is rooting for this moment. Congratulations! I hope the moment keeps rollin!",
            "score": 17,
            "author": "gmssi"
        },
        {
            "level": 0,
            "comment": "This is the power of streaming. 10 years ago an unknown and old song rising through the charts based on downloads (which heavily favors fandom power) would be unheard of. Now with the power of streaming and charts, old songs can always come back due to viral moments w the general public. One famous example would be Mariah Carey’s All I Want for Christmas Is You, which rises to the top of streaming platform every year like clockwork despite being over 25 years old.",
            "score": 17,
            "author": "20815147"
        },
        {
            "level": 0,
            "comment": "2021 peaked 3 months in. congrats to brave girls !!!",
            "score": 11,
            "author": "yeontanfan3000"
        },
        {
            "level": 0,
            "comment": "Impressive.  \nMost Impressive.",
            "score": 26,
            "author": "theangrycamel"
        },
        {
            "level": 0,
            "comment": "Congrats to the girls! They did it! Getting PAKs and finally their first win this week, I’m so happy for them 😭",
            "score": 23,
            "author": "cagendary"
        },
        {
            "level": 0,
            "comment": "this has been such an emotional few days, i’ve been tearing up watching every performance and every appearance they’ve had so far. you can tell how genuinely happy they are. i’m so happy for them",
            "score": 27,
            "author": "caramelsio"
        },
        {
            "level": 0,
            "comment": "3,629 days later, Brave Girls finally gets their long awaited 1st music show win and to think they were all but going to disband before this point. This is the best if not one of the best first wins I've seen for any Kpop groups.",
            "score": 13,
            "author": "JT810"
        },
        {
            "level": 0,
            "comment": "THEY DID IT! HOLY SHIT",
            "score": 12,
            "author": "Enzuiguri"
        },
        {
            "level": 0,
            "comment": "I'm so happy, they did it! Congratulations Brave Girls!! This is seriously the feel good story of 2021 so far, I can't stop smiling",
            "score": 21,
            "author": "Nixon4Prez"
        },
        {
            "level": 0,
            "comment": "Queens!!! I’m so happy that they, as well as *Rollin’*, are getting the attention they deserved all along. So incredible to think that they were extremely close to disbandment only for all of this to go down a week later. I’m really hoping that they snag more wins and that Brave Ent takes full advantage of the moment.",
            "score": 11,
            "author": "hennybee"
        },
        {
            "level": 0,
            "comment": "Best comeback of 2021 by far!",
            "score": 9,
            "author": "KippaIB"
        },
        {
            "level": 0,
            "comment": "Congrats to them! So happy to see them get their first win!",
            "score": 8,
            "author": "milkysehun"
        },
        {
            "level": 0,
            "comment": "I love love this story. May they continue to succeed!",
            "score": 9,
            "author": "Pilose"
        },
        {
            "level": 0,
            "comment": "Congratulations! I literally cannot think of a song more deserving.",
            "score": 9,
            "author": "KeekoTrico"
        },
        {
            "level": 0,
            "comment": "So happy for them! Their content has been keeping me sane these day :)",
            "score": 9,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "One of the most emotional first wins, both for the artist and for me 😭\n\nI’m so happy for them. A month ago no one could have predicted this and that’s what is so amazing. This is a moment all of us here will probably remember years from now.",
            "score": 10,
            "author": "momopeach7"
        },
        {
            "level": 0,
            "comment": "On Inkigayo?? NOMINATED NEXT TO SHINEE?????? This is huge! I'm so happy for them!!!!",
            "score": 12,
            "author": "euphoric-demise"
        },
        {
            "level": 0,
            "comment": "The great cinderella story in kpop history, and we were here to witness it! What a time to be alive",
            "score": 7,
            "author": "TheAsianTheory"
        },
        {
            "level": 0,
            "comment": "So happy for them and to win over 2 huge names must feel so surreal for them. To think they’ve gone from basically being disbanded (there were no plans for a comeback, let’s face it we could’ve gotten a disbandment notice at any moment) to having multiple PAKs AND having multiple songs charting too. This is definitely up there with EXID, CLC, and Girls Day for first wins for me, but feels even bigger because it came out of literally nowhere it felt like there was literally no remaining hype for them prior to this. They’d used up all chances of making it. I bet they feel so vindicated.\n\nI hope we get to see more instances of this happening to other struggling groups (Laboum next please!) and I hope this is the beginning of a long and successful career for Brave Girls finally!",
            "score": 7,
            "author": "fakeaf1"
        },
        {
            "level": 0,
            "comment": "You love to see it.",
            "score": 8,
            "author": "SonnyJohn"
        },
        {
            "level": 0,
            "comment": "Brave girls going bonkers right now has to be one of the coolest Kpop stories ever.",
            "score": 8,
            "author": "Rpeddie17"
        },
        {
            "level": 0,
            "comment": "This win is so much more special when it’s a win in the most viewed music program in korea and it shows the GP actually love them. (no offense to other groups who wins the show but..these wins usually are a lot less « relevant » as most of the groups win because of fanbases + these songs are rarely even in Melon’s top 50)",
            "score": 7,
            "author": "Blajui"
        },
        {
            "level": 0,
            "comment": "With all the other drama going on in the Kpop and Kdrama worlds, it's nice to see these girls earn their first win. As Army vet, I can say that music plays a huge part in morale, and though we didn't have Kpop where I was stationed and deployed, the musicians who did come out were greatly appreciated.",
            "score": 7,
            "author": "SuddenlyStegosaurus"
        },
        {
            "level": 0,
            "comment": "I’m so happy for them ;w;\n\n(Bring back High Heels next 🗣)",
            "score": 3,
            "author": "bananasoymilk",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Hair shaving when",
            "score": 4,
            "author": "Yojimbo4133"
        },
        {
            "level": 0,
            "comment": "This is incredible I’m so happy for them",
            "score": 12,
            "author": "contagiouschemi"
        },
        {
            "level": 0,
            "comment": "Is there a video I can watch? I badly want to see this glorious moment! ♥️",
            "score": 7,
            "author": "Eizenne",
            "replies": [
                {
                    "level": 1,
                    "comment": "[Here's a clip](https://twitter.com/dejunsdear/status/1371007257333276679)",
                    "score": 13,
                    "author": "Nixon4Prez",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Totally deserved!!! Success stories like this make me so happy, good for them.",
            "score": 8,
            "author": "Conscious-Ground-106"
        },
        {
            "level": 0,
            "comment": "Finally some amazing news",
            "score": 8,
            "author": "kKunoichi"
        },
        {
            "level": 0,
            "comment": "OH MY GOD!!! Congratulations Brave Girls!!!",
            "score": 6,
            "author": "DCJii098"
        },
        {
            "level": 0,
            "comment": "congratulations to Brave Girls!!!!! This must be a big milestone for them",
            "score": 6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Congratulations!!! ,🎉🎊",
            "score": 6,
            "author": "Momotaro92"
        },
        {
            "level": 0,
            "comment": "This is fuking awesome........ \n\n\nI don't know why but it  feels so good to see Underdogs get some success , maybe because we all can relate to their struggle. \n\nI hope they somewhat become more popular now, KPOP needs this kind of music.",
            "score": 6,
            "author": "gamefreak2k11"
        },
        {
            "level": 0,
            "comment": "Congratulations! I'm so happy for them!!",
            "score": 6,
            "author": "CantabiLore"
        },
        {
            "level": 0,
            "comment": "Being a Fearless and crying after years of wanting Brave Girls get what they deserved a long time ago. I can’t stop crying. They did it!!!",
            "score": 7,
            "author": "KpopMessyBessy"
        },
        {
            "level": 0,
            "comment": "Their acceptance speech got me a little emotional, they were legit in shock that they won despite topping the charts already...UGH I'M SO HAPPY FOR THEM. Hopefully this is only the beginning!!!",
            "score": 6,
            "author": "juanitatequila"
        },
        {
            "level": 0,
            "comment": "I’m a sucker for a good underdog story and love how SK is rallying behind them, but I really hope that their success continues now more than ever after seeing the joy and tears they had upon winning. For the sake of the group, don’t treat this precious moment like a meme. Support them!",
            "score": 5,
            "author": "SLXO_111417"
        },
        {
            "level": 0,
            "comment": "I'm so happy for them, they deserve the whole world. Rollin' really cheered me up and kept me going in 2017 and it's been so much fun to enjoy it with the whole community and get to know the group better this year. Looking forward to their comeback!",
            "score": 7,
            "author": "714c"
        },
        {
            "level": 0,
            "comment": "This is the greatest success story to ever happen in kpop",
            "score": 6,
            "author": "giannachingu"
        },
        {
            "level": 0,
            "comment": "I'm glad they finally got the win for this song 4yrs later.  I remember when it came out I thought it was a hit then, but they just had bad timing.  There was no oxygen for them at this time 4yrs ago.  You had the end of i.o.i, TWICE released Knock Knock and was clearly taking over for Girls Generation, Ailee's single from Goblin, not to mention releases by several of the top boy groups during this time.",
            "score": 5,
            "author": "cntrldfusion"
        },
        {
            "level": 0,
            "comment": "praying that their company doesn’t pull a momoland and mess with them 🙏🙏",
            "score": 3,
            "author": "zyrether"
        },
        {
            "level": 0,
            "comment": " *기다리고 있잖아 Babe just only you*\n\nThe waiting finally paid off! &lt;3",
            "score": 7,
            "author": "ParaPolaris"
        },
        {
            "level": 0,
            "comment": "Congratulations Brave Girls!  Fantastic song, still delivering the energy after all these years.  Well deserved!",
            "score": 6,
            "author": "Treaya"
        },
        {
            "level": 0,
            "comment": "I'm so happy for Brave Girls and I hope they keep getting more and more recognition and opportunities because they deserve them so bad. They must be positively overwhelmed and I want them to feel like that as long as possible.",
            "score": 6,
            "author": "girlwithpearl16"
        },
        {
            "level": 0,
            "comment": "Congrats! More success to them!",
            "score": 6,
            "author": "iamthirty"
        },
        {
            "level": 0,
            "comment": "congratulations to them! i've been stanning the group since the members we all know and love joined! i'm incredibly proud to them. it's crazy how close they were to disbanding, literally just several days... wow. \n\nwith paks, a digital hit, and a first win out of the way, i hope the next comeback does incredibly well for them. and the next comeback after that, and after that, and so on! it might be a reach, but... let me just dream of the girls becoming unstoppable and prove that they will be more than a group with luck.\n\nmay brave girls walk a flowery road!",
            "score": 4,
            "author": "SunsetPlot"
        },
        {
            "level": 0,
            "comment": "Never took a look at Brave Girls until I saw this post. Watched the rollin' mv and a very recent rollin' live performance. Just read about what's going on and watched the viral military performance video too.\n\nI only have one thing to say: Damn, Yujeong's smile is amazing.",
            "score": 6,
            "author": "berserkering"
        }
    ]
}