{
    "id": "wxyuqk",
    "score": 5641,
    "title": "TWICE - Talk that Talk",
    "author": "GodJihyo7983",
    "date": 1661486400.0,
    "url": "https://www.reddit.com/r/kpop/comments/wxyuqk",
    "media_urls": [
        "https://youtu.be/k6jqx9kZgPM"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "[QR code is a link to the instagram post where they announce the fandom name](https://twitter.com/SubjectKpop/status/1563016171775234048?t=sReD2chzxM_uCNBTM3tCew&amp;s=19)\n\nBro i cant 😭",
            "score": 348,
            "author": "nvtoph"
        },
        {
            "level": 0,
            "comment": "TELL ME WHAT YOU WANT\r  \nTELL ME WHAT YOU NEED",
            "score": 574,
            "author": "xcdlx",
            "replies": [
                {
                    "level": 1,
                    "comment": "Personally: i would want/need for TWICE to keep releasing these amazing songs &amp; MV's as long as they can. Cheesy. LMAO.",
                    "score": 141,
                    "author": "jeepney_danger"
                },
                {
                    "level": 1,
                    "comment": "I already got what I need. \n\nOT9 Twice contract renewals",
                    "score": 105,
                    "author": "Ziiaaaac"
                },
                {
                    "level": 1,
                    "comment": "I'm in love with Sana's \"Talk that talk\" part, her voice was perfect for that line",
                    "score": 22,
                    "author": "JWE25",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "AHHHHH THIS WAS AMAZING AND AN ABSOLUTE BOP!!!!  I AM FOSHO PUTTING THIS ON REPEAT! THIS WAS 100% SANA'S ERA!!!\n\nAlso, I caught some song references within the lyrics. I think it was \"Yes or Yes\" and \"Push and Pull\".",
            "score": 311,
            "author": "No_Rain_4811",
            "replies": [
                {
                    "level": 1,
                    "comment": "There were also \"1 to 10\" ~~and \"Rewind\"~~ references. \n\nEdit: nevermind she says \"Replay\" lol.",
                    "score": 45,
                    "author": "ParanoidAndroids",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This sounds like an elevated version of The Feels… so so so good IMO. I love the double-header of Jihyo/Nayeon power vocals and then Sana’s sweet tone. So well done.",
            "score": 291,
            "author": "raindroppolkadots",
            "replies": [
                {
                    "level": 1,
                    "comment": "\n&gt;I love the double-header of Jihyo/Nayeon power vocals and then Sana’s sweet tone. So well done.\n\nMain course followed by sweet sweet dessert",
                    "score": 47,
                    "author": "ddeka777"
                }
            ]
        },
        {
            "level": 0,
            "comment": "that was probably my favorite title track from them since ICSM, goddamn. 7 years in and still continuing to deliver, love that for them!",
            "score": 265,
            "author": "karpOPPO"
        },
        {
            "level": 0,
            "comment": "The QR code that links to their Once announcement Instagram post 😭",
            "score": 404,
            "author": "hannahginny1112",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why are they always doing this to me, my fucking heart ;_;",
                    "score": 51,
                    "author": "Shinkopeshon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They seem to one-upping how good they look each video.  Also, love that Talk That Talk part. It's oddly satisfying.\n\nI've heard this song a few times now and it just keeps getting better. The whole album is so good. It's the first time I'm not able to pick a favorite track.",
            "score": 253,
            "author": "Holdthesake",
            "replies": [
                {
                    "level": 1,
                    "comment": "They all look sooooo good this era. And I just love the styling for this mv. Not a bad look anywhere.",
                    "score": 51,
                    "author": "ankhes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is waaaay better than I was expecting!? The melody is glorious",
            "score": 75,
            "author": "AnotherExistence"
        },
        {
            "level": 0,
            "comment": "Love the song references! I feel like there’s something so special going in into this comeback, there’s this aura of “yes, we’ve accomplished so much and we are coming for more”, which, imo, is very refreshing!\n\nThe song itself is super catchy and the production really highlights their voices!",
            "score": 204,
            "author": "mcfw31"
        },
        {
            "level": 0,
            "comment": "omg these song references “yes or yes” “push and pull” “1-10” bless these girls",
            "score": 637,
            "author": "kev_in374",
            "replies": [
                {
                    "level": 1,
                    "comment": "[Check out the link in the QR code if you want to shed a few tears.](https://www.instagram.com/p/9oEHhtHZXg/)",
                    "score": 270,
                    "author": "coolrunnings190",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "tears were indeed shed. I love them so much 😭",
                            "score": 48,
                            "author": "bluebloodmooncake"
                        },
                        {
                            "level": 2,
                            "comment": "The QR code actually decodes to the exact same redirect link from the teaser! (http://m.site.naver.com/0YwVB)\n\n It appears they are able to keep changing what it redirects to since at one point it went to an [AR site](https://twice.twicear.com/), then to a [TikTok post](https://www.tiktok.com/@twice_tiktok_official/video/7129525082497551618), and now to the [Insta post](https://www.instagram.com/p/9oEHhtHZXg/)  you linked. Pretty cool!",
                            "score": 28,
                            "author": "unhi"
                        },
                        {
                            "level": 2,
                            "comment": "omg ;_; they really know how to pull at our hearts",
                            "score": 37,
                            "author": "samojoy"
                        },
                        {
                            "level": 2,
                            "comment": "When is this picture? I dont use Instagram and all I can see is 355w, which I assume is 355 weeks ago.",
                            "score": 20,
                            "author": "niteeee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "November 3, 2015 - when Twice gave Once our name. It’s also the code that Jeongyeon entered in the music video - 151103.",
                                    "score": 40,
                                    "author": "MadeOn210922"
                                },
                                {
                                    "level": 3,
                                    "comment": "November 3, 2015. About 2 weeks after they debuted.",
                                    "score": 26,
                                    "author": "coolrunnings190"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I just wish they pushed more onto that since they have a looooot of songs, more than 150 at this point. It would be the best flex they could pull.",
                    "score": 10,
                    "author": "CorruptedMind341"
                },
                {
                    "level": 1,
                    "comment": "The title (TTT) may also be a reference to TT-sunbaenim which is kind of mind blowing. 🤯",
                    "score": 9,
                    "author": "rozeluxe08"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's so nice when the chorus hits just right. \n\nIt's a short song but oh so sweet. I wish it was a bit longer but there's nothing about the song itself that I'd change. \n\nThe pre-chorus to chorus is so good. Legitimately shook when Tzuyu sang the first pre-chorus. Sana's chorus part is worthy of all the teasers, it's just so pleasing to the ears. \n\nWas also surprised at how cute it was during the verses while still feeling like mature Twice. It's like the best of both worlds. \n\nOutfits are on fire and we even have visible tattoos, now. MV itself was filmed well but we did get a box MV in the end.",
            "score": 188,
            "author": "ParanoidAndroids",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My girls have never missed IN THEIR LIVES",
            "score": 64,
            "author": "tcx25"
        },
        {
            "level": 0,
            "comment": "They have seriously hit their stride the past 2.5 years with music that is more mature but still with that fresh, Twice sound.",
            "score": 53,
            "author": "austen1996"
        },
        {
            "level": 0,
            "comment": "That is one strong title track from the melody, verses and the build up to the chorus. It’s not too loud and flows really well. I couldn’t concentrate on the MV because I was appreciating the song. Possibly already one of my favorite title tracks.\n\nEdit: the “tell me what you want” is going to get stuck in my head for the next week lol",
            "score": 676,
            "author": "skylight03",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sana's \"Talk that talk\" is already stuck in my head and is gonna stay there for the next week as well lmao. The way the instrumental hits when she says those words as well is perfection.",
                    "score": 75,
                    "author": "okaysian"
                },
                {
                    "level": 1,
                    "comment": "I'm absolutely blown away, this is their best title since Feel Special imo",
                    "score": 132,
                    "author": "far219",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fr. Most of their recent songs were growers for me but this once was an instant bop like Feel Special was",
                            "score": 20,
                            "author": "ConfuciusBr0s",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Are you me??! This one was an instant love. Feel Special and I Can't Stop Me are also among my faves :)",
                                    "score": 7,
                                    "author": "StripedCatSocks"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not to mention that they've kept their unmistakable TWICE sound whilst having it change and evolve with every comeback. The QR code at the end hits differently",
                    "score": 95,
                    "author": "t4dominic"
                },
                {
                    "level": 1,
                    "comment": "Choreography looks really fun too, I can't wait to see the performances!",
                    "score": 39,
                    "author": "douevenwheelanddeal"
                },
                {
                    "level": 1,
                    "comment": "I'm listening to just the song now on Spotify and it sounds even better without the MV. Amazing production quality, easily SOTY recently",
                    "score": 59,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wow the girls all look stunning. And I love all those references to their past songs",
            "score": 50,
            "author": "Bowmantorch"
        },
        {
            "level": 0,
            "comment": "TWICE QUEENS are back!! Love everything about this! The LOVE choreo is amazing",
            "score": 53,
            "author": "mpham94"
        },
        {
            "level": 0,
            "comment": "God fucking damn. They look absolutely beautiful and holy shit this has already become one of my favorite Twice TTs from just the first minute. This kind of song is right up my alley. Absolutely amazing. This is 100% going on repeat.",
            "score": 375,
            "author": "GodJihyo7983",
            "replies": [
                {
                    "level": 1,
                    "comment": "Would have been a great summer song! Well now it's a fall song haha",
                    "score": 27,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I love this chorus so much wow Sana esp she was crazy with it",
                    "score": 111,
                    "author": "kev_in374",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The chorus is so powerful. Not gonna lie, I was kind of iffy on the first verse just because I'm not a huge fan of random spurts of English but the chorus blew me away.",
                            "score": 45,
                            "author": "MeijiDoom"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I needed that chorus to be 10 seconds longer!",
            "score": 52,
            "author": "JavArc13"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 354,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "yo you gotta put another hyphen there",
                    "score": 123,
                    "author": "ADmax27",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, I was in shock for a moment!",
                            "score": 27,
                            "author": "derndy"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Renewing is a better word, but I know what you meant and I totally agree! Talk That Talk is so refreshing to hear.",
                    "score": 62,
                    "author": "okaysian",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "From the sample I thought this song would be a LOT different, such a BOP",
                    "score": 11,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "the lead-in of the chorus slaps so hard I could listen to that forever\n\nTELL ME WHAT YOU WANT, TELL ME WHAT YOU NEED",
            "score": 127,
            "author": "RenegadeSasuke",
            "replies": []
        },
        {
            "level": 0,
            "comment": "SPOILER ALERT ITS A BOP",
            "score": 451,
            "author": "polkadotfuzz",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Is it just me or do their vocals sound REALLY good in this song",
            "score": 40,
            "author": "kanyreddit",
            "replies": []
        },
        {
            "level": 0,
            "comment": "the instrumental is so fucking good. i love this song already and i haven't even gotten to the chorus!! the prechorus is absolutely beautiful. also everyone is getting so many lines it is great!!! i love the chorus it sooo fun with the L.O.V.E part. twice our angels, thank you for such a great comeback after contract renewals!! i love that jeongyeon got to shine with her beautiful prechorus parts, and her part in the final chorus (final chorus queen). time to go smother my ears in the b-sides.  \n\n\nAND the visuals in this mv are absolutely amazing...",
            "score": 482,
            "author": "Werefie",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; AND the visuals in this mv are absolutely amazing...\n\n[Shout out to Sharon for gracing us twenty seconds into the video](https://gfycat.com/somefearfulgoa)",
                    "score": 165,
                    "author": "okaysian",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "sharon is... gorgeous",
                            "score": 38,
                            "author": "Werefie"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 91,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "agree i like her timbre as well!",
                            "score": 11,
                            "author": "Werefie"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This is such an amazing post-renewal comeback - 7 years in the business and still killing it, we love you Twice ❤️",
                    "score": 60,
                    "author": "highfructose-",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The instrumentals are very good, i think it's still stuck in my brain. I think this is the 1st time i heard those in a TWICE song.",
                    "score": 26,
                    "author": "jeepney_danger"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 114,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Shorter hair suits her sooo well it's ridiculous. She works hard to stay ultimate bias fr",
                    "score": 30,
                    "author": "PraiseGodJihyo"
                },
                {
                    "level": 1,
                    "comment": "Jihyopatra",
                    "score": 20,
                    "author": "NineLanguage"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This song was WAY better than I was ever expecting it to be. I already liked the teasers, but this was just even more than I expected with the vocals. Love the chorus so much.",
            "score": 117,
            "author": "CalzoneBetrayal"
        },
        {
            "level": 0,
            "comment": "From the moment the chorus hit I knew it was an instant favorite. I haven't gravitated towards a Twice track quite like this in a little while - they sound and look amazing!!!!",
            "score": 38,
            "author": "stillaliveSG"
        },
        {
            "level": 0,
            "comment": "The QR code at the end leads to the post announcing their fandom name on the group IG account 🥲🥲\n\nAnd Sana doing the point choreo\n\nI loved everything about this song",
            "score": 35,
            "author": "PotatoBulletGun"
        },
        {
            "level": 0,
            "comment": "My jaw was on the floor when the chorus hit. That was amazing truly a BOP!!\n\nEdit: Just watched it again and I can’t get over how GORGEOUS they are😭 Also the references to their old. songs (Yes or yes, 1 to 10, and push and pull, am I missing more?) I loved it!! Nayeon’s high note at the end like yes lets go queen👑",
            "score": 105,
            "author": "minaabahh",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The Y2k/futuristic/\"retro\" concept is so rampant in K-pop right now, but when TWICE does it, it doesn't look or sound dated at all. Love this release; the title track is refreshing and light on the ears yet powerful to watch.",
            "score": 413,
            "author": "tyarah184",
            "replies": [
                {
                    "level": 1,
                    "comment": "Twice is just so good at making all their title songs trendy but so fresh and quintessentially twice at the same time!",
                    "score": 123,
                    "author": "Fundaysundae",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Their producers do a great job of popifying the funk/disco and synthwave sounds without flattening out too much of what makes the genres so good. \n\nA lot of other recent retro concepts, especially more on the funk and disco side, have stripped too much of the juicy bits out. Especially in the verses. They leave room for some dynamics and some groove.\n\nOn the visual side I think it helps that they're all just... incredibly charismatic people. You can't make them look bad no matter how hard you try. They never look out of place.",
                    "score": 28,
                    "author": "crashbandicoochy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Really wish YouTube had 4K for their premieres",
            "score": 151,
            "author": "Bowmantorch",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Pretty great song, there are portions I'm not totally 100% sold on (the \"no no no\" portion of the chorus I feel is kinda misplaced and the song could have finished the chorus in a different direction). But its still a great listen, better than Scientist for me. Much more in line with the feels which makes sense given the producers",
            "score": 33,
            "author": "1033149"
        },
        {
            "level": 0,
            "comment": "its a banger!!!! \"tell me what you want, tell me what you need!\"",
            "score": 31,
            "author": "Odd-Faithlessness468"
        },
        {
            "level": 0,
            "comment": "The song is good. There is no weak moment. The 80's style is so right on my alley. The girls as always gorgeus and the MV is so well done. My brain can't take it because so many great things happening at once",
            "score": 31,
            "author": "battle_franky"
        },
        {
            "level": 0,
            "comment": "That final chorus is fucking killer",
            "score": 30,
            "author": "KYplusEL"
        },
        {
            "level": 0,
            "comment": "Twice didn’t disappoint. NEVER. This has to be one of their top tier title tracks ever.\n\nGuys, after listening to “Talk That Talk”, I can feel my skin getting clearer, my teacher called me to improve my grades, my day has been made, Twice has blessed us again.",
            "score": 34,
            "author": "chancelloria"
        },
        {
            "level": 0,
            "comment": "WHAT A BOP!  \nVocally and Visually this is amazing! I especially loved Tzuyu and Jeongyeon here, but everyone is just so talented. What a great song.",
            "score": 84,
            "author": "zebrahawk1"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 176,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The rap line slayed so hard HOLY SHIT. They got to SING!",
            "score": 133,
            "author": "sarahrogers9811"
        },
        {
            "level": 0,
            "comment": "THIS SONGGGG and MVVVVV holy crap!!!\n\nThis is AMAZING. I used to not be into Twice much, but then their music has just been speaking to me, and at all a whole new level since Cry For Me and The Feels, and every release since is just so up my alley. I am becoming a huge ONCE and its this current TWICE that is making it happen!\n\n&amp;#x200B;\n\nI LOVE that they're challenging the girls roles/vocals/dance more across the board. Dahyun and Tzuyu's lines stood out to me as 'ooo thats new!'",
            "score": 128,
            "author": "AdehhRR",
            "replies": []
        },
        {
            "level": 0,
            "comment": "ITS SO FUCKING GOOD 😭😭😭😭😭\n\nEdit: I’ll come back once I’ve calmed down\n\nEdit2: I’m still not okay tbh but I feel so emotional just knowing that these girls chose to stay together 🫶",
            "score": 242,
            "author": "jdbxcv",
            "replies": [
                {
                    "level": 1,
                    "comment": "honestly that's just me when any song drops ahahh",
                    "score": 37,
                    "author": "throwaway_afterusage"
                },
                {
                    "level": 1,
                    "comment": "I’m not even a once but twice staying as 9 makes me wanna cry 😭",
                    "score": 11,
                    "author": "sooprotectionsquad"
                },
                {
                    "level": 1,
                    "comment": "Seriously. I almost NEVER love new songs after the first listen but damn this song really changed that. It’s a fucking bop.\n\nedit: I'm a few listens in now and honestly it's gotta be a top 5 song for me all-time. The vibes are just incredible. My absolute favorite Twice title song.",
                    "score": 8,
                    "author": "JWE25"
                }
            ]
        },
        {
            "level": 0,
            "comment": "THEY LOOK SOOO GOOD AND THE CHORUS IS SOOOO GOOD",
            "score": 26,
            "author": "illicitae"
        },
        {
            "level": 0,
            "comment": "Rapper Momo is back!",
            "score": 30,
            "author": "Uchiha_D_Zoro",
            "replies": []
        },
        {
            "level": 0,
            "comment": "the qr code made me tear up",
            "score": 26,
            "author": "daisyisnotokay"
        },
        {
            "level": 0,
            "comment": "BOP! That was so much fun!",
            "score": 25,
            "author": "sakurajp_34"
        },
        {
            "level": 0,
            "comment": "omg we knew it would be good, but it is even better than expected! they talked that talk!",
            "score": 26,
            "author": "verndom"
        },
        {
            "level": 0,
            "comment": "Holy fuck I am floored. Speechless. Involuntary tears. This instrumental is so fucking fire - props to collapsedone for S-tier production work - those lush pads &amp; funky AF bassline are so good! And Twice, you ladies totally killed it on the vocals - harmonizing &amp; ad-libs totally on point - and choreo!!!\n\nIDC if I'm biased, I'm so proud of the members for how far they've come the past 7 years. And also unabashedly glad to be a part of the fandom. Twice 2.0 is just getting started y'all!",
            "score": 25,
            "author": "veritek25"
        },
        {
            "level": 0,
            "comment": "It's pop perfection. As expected from Twice",
            "score": 23,
            "author": "urkitten"
        },
        {
            "level": 0,
            "comment": "Sana's part in the chorus is going to have a permanent hold on my brain I fear",
            "score": 25,
            "author": "IbrahimT13"
        },
        {
            "level": 0,
            "comment": "What an absolute bop",
            "score": 70,
            "author": "Apprehensive_Yard812"
        },
        {
            "level": 0,
            "comment": "HOLY CRAP, Twice keeps getting better and better.. like fine wine.. im glad they're back",
            "score": 107,
            "author": "Jerix18"
        },
        {
            "level": 0,
            "comment": "I really like the outfit of the group for the section in which Nayeon looks like Ada Wong from Resident Evil. Kudos to the stylist.",
            "score": 22,
            "author": "reyzknight",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Tremendous bop. The way the 10-second teaser fit in was perfect",
            "score": 102,
            "author": "EdNaJiRo"
        },
        {
            "level": 0,
            "comment": "Felt like a love letter to ONCE (and after renewing contracts!) with the many references - more more more more, push and pull, yes or yes, 1 to 10. The L-O-V-E choreo was so cute too! And I love how Twice almost always has a singing chorus - it’s great again!",
            "score": 20,
            "author": "MadeOn210922"
        },
        {
            "level": 0,
            "comment": "ANOTHER CERTIFIED BANGER\n\nthe last chorus was literally me ascending to heaven",
            "score": 18,
            "author": "cursed_pineapple"
        },
        {
            "level": 0,
            "comment": "TWICE has never been an ult group for me but I have major respect for how their music has evolved while still keeping their TWICE identity. I love this song, it sounds so fresh! I wish them continued success! 🫶🏽",
            "score": 20,
            "author": "_sushifreak"
        },
        {
            "level": 0,
            "comment": "As Dubu said: don't stop, and just replay.",
            "score": 17,
            "author": "MNLYYZYEG"
        },
        {
            "level": 0,
            "comment": "WHEN I TELL YOU I HAVE CHILLS\n\nPlease I'm begging Twice to PLEASE MISS FOR ONCE T.T\n\nLove all the references to their past songs scattered throughout the songs. An actual singing chorus that's insanely catchy followed by the hook (that's been already released)?\n\nThe Jeongyeon prechorus? Tzuyu showcasing her vocal? Sana's infectious hook? Rap line (now with Momo doing the ad libs) ABSOLUTELY ATE? Nayeon's final high note? The harmonizing in the bridge (Mina's voice is always best for bridge + CHAE SINGING???) \n\nSOUNDS LIKE SOTY!!!! Now I understand why Jihyo has been especially hyped about this comeback. Can't wait to see her next week.",
            "score": 142,
            "author": "20815147",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Damn those mv transitions - especially when Nayeon steps into that stary realm!! Really liked the music video- had a good balance of Y2K and Twice elements.\n\nI really really like Momo's parts. Also finally some real good choreography that translates the music well. Twice Never disappoints when it comes to making creative but effective dance routine!\n\nIt's a A+ from me.",
            "score": 16,
            "author": "Rekkleswiefu"
        },
        {
            "level": 0,
            "comment": "I was smiling throughout the entire MV because it’s just so so so good and made me remember how Twice literally doesn’t know how to miss. They can take any genre/concept and make it their own. Even with the amount of music they come out with, i’m amazed how they just kill it every time. \n\nLine distribution is impeccable, everyone got their time to shine. This song has no bad parts, everyone seem to be comfortably singing in their range. Looks 10/10. Song is catchy as hell. Choreo looks fun. \n\nAnother bop. Look, if you’re still sleeping on my girls, you have a problem.",
            "score": 17,
            "author": "researcherinams"
        },
        {
            "level": 0,
            "comment": "This is so fun, my favourite Twice track since Fancy already. It's a really good first listen.",
            "score": 17,
            "author": "ContinuousThunder"
        },
        {
            "level": 0,
            "comment": "I was unconsciously bobbing my head the whole time! i really liked those past song references too",
            "score": 15,
            "author": "throwaway_afterusage"
        },
        {
            "level": 0,
            "comment": "Surprised at (and love!) the reference to the Apple '1984' commercial at the 2.15 mark.",
            "score": 18,
            "author": "RavenSkies777",
            "replies": []
        },
        {
            "level": 0,
            "comment": "This was such a bop, and I expected nothing less after that amazing highlight medley, time to listen to the album!!",
            "score": 15,
            "author": "wint-el"
        },
        {
            "level": 0,
            "comment": "Praise God Jihyo. That was excellent!",
            "score": 65,
            "author": "stinsonlegend",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm so hyped I can't even describe it. SO GOOD",
            "score": 12,
            "author": "chuseph14"
        },
        {
            "level": 0,
            "comment": "Y'ALL I LOVE THIS 😭😭 the song is so Twice, i loved the references to their other songs like that was so clever lmao. Jihyo looked so amazing 😩 another slay from the girls!",
            "score": 15,
            "author": "nebula_cats"
        },
        {
            "level": 0,
            "comment": "TZUYU'S VOCALS REALLY BLEW ME AWAY. she has come such a long way. the girls did so well, i'm so proud of them. best title track since feel special imo.",
            "score": 13,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’m so glad they’ve continued to keep deep voice Momo.",
            "score": 16,
            "author": "JihYoParkENT"
        },
        {
            "level": 0,
            "comment": "2018 TWICE: Hey boy Look, I'm gonna make this simple for you You got two choices Yes or yes?\n\n2022 TWICE: Tell me what you want Tell me what you need\n\nTWICE providing us with options now, God bless. This was a cute song :)",
            "score": 38,
            "author": "BrittM554"
        },
        {
            "level": 0,
            "comment": "This is one of those insta fucking bops that give you that feeling of electricity even on first listen\n\nholy shit its so fucking good",
            "score": 13,
            "author": "MarikaBestGirl"
        },
        {
            "level": 0,
            "comment": "I’m upvoting based off the thumbnail alone.",
            "score": 13,
            "author": "momopeach7"
        },
        {
            "level": 0,
            "comment": "It feels like a bit of a fusion between I Can't Stop Me and Scientist, and I LOVE it. The choreo seems totally luxurious. The big highlights of the MV for me were Jihyo's gyaru peace in the first chorus, Mina slaying in the bridge as usual, and all of Sana's parts. It's a favorite on first listen.",
            "score": 11,
            "author": "adventurejar"
        },
        {
            "level": 0,
            "comment": "Love! It's rare that we don't see Nayeon singing the majority of the chorus in the TT, and seeing Jihyo's vocal take stage was a true surprise. I also love how we can see all the members singing longer lines at a time, it's no longer Momo, Dahyun, and Chaeyoung getting lines where they say a catchy phrase, but you can clearly hear their singing voices for an extended period of time.",
            "score": 11,
            "author": "fleshypeach",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Tzuyu is definitely not my favorite member usually but she honestly blew me away this comeback in every aspect.",
            "score": 13,
            "author": "Chadryan_"
        },
        {
            "level": 0,
            "comment": "ITS A FUCKING BOP Holy shit.\n\nAlso jihyo can step on me ommmmgg",
            "score": 57,
            "author": "farnizzle",
            "replies": []
        },
        {
            "level": 0,
            "comment": "INVENTED MUSIC!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "score": 56,
            "author": "polonium-69"
        },
        {
            "level": 0,
            "comment": "0/10 no JYP whisper",
            "score": 73,
            "author": "Axeraider623",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow &amp; they also didn’t even bother to give him any screen time ![img](emote|t5_2r1ox|3559)",
                    "score": 31,
                    "author": "EntertainmentOk8785"
                },
                {
                    "level": 1,
                    "comment": "OT 10 forever",
                    "score": 6,
                    "author": "twothumbsnobrain"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This song is sooo fucking good and satisfying at the same time!! The instrumental is really fun to listen to, I love the constant drums. Not to mention how good their voices sound in this song! 10/10 for me",
            "score": 10,
            "author": "ashthemarvelous"
        },
        {
            "level": 0,
            "comment": "TWICE just never disappoints. Banger after banger. Now let's all mentally and emotionally prepare for all the post comeback content.",
            "score": 36,
            "author": "coolrunnings190"
        },
        {
            "level": 0,
            "comment": "The lines right before \"Talk that Talk\" are so addicting by Jihyo and Nayeon",
            "score": 31,
            "author": "Bowmantorch"
        },
        {
            "level": 0,
            "comment": "A bop. A smash. My life could end tomorrow and if this was the last thing I ever heard I would be happy.\n\nThey look and sound AMAZING.",
            "score": 12,
            "author": "SXA89"
        },
        {
            "level": 0,
            "comment": "they combined 80s 90s 00s 'aesthetics' in one and made it work fucking slay",
            "score": 11,
            "author": "the_chaser00"
        },
        {
            "level": 0,
            "comment": "amazing song as always.",
            "score": 9,
            "author": "austintatious8"
        },
        {
            "level": 0,
            "comment": "So fucking good",
            "score": 10,
            "author": "vivifr0mloona"
        },
        {
            "level": 0,
            "comment": "I LOVE IT, this is probably TWICE’s title track I genuinely like from first listen since a while.\n\nPost-renewal TWICE really do hits different!",
            "score": 10,
            "author": "kittenfinger"
        },
        {
            "level": 0,
            "comment": "Worth the wait 1,000%! Twice with another banger song, love this group so much",
            "score": 9,
            "author": "douevenwheelanddeal"
        },
        {
            "level": 0,
            "comment": "This is seriously so good... The instrumentals, the lines, the vocals, the delivery.... Everything is absolutely breathtakingly gorgeous!\n\nNayeon has always captured my attention, but she is SHINING this comeback, her confidence is captivating! Sana's lines were amazing too... I love how her tone suited the sections instrumentals and the emotion so well! Jihyo never fails to blow my mind with her vocals and presense, she did not miss this time too!",
            "score": 9,
            "author": "Landom_facts11"
        },
        {
            "level": 0,
            "comment": "First of all- love it on first listen. That CHORUS is unreal. God I love hearing songs where I know I love it on the first listen. \n\nPlus where they were spelling LOVE out in the choreo? Yeah I can see that getting tons of tiktok traction. Twice really has such an amazing catalogue I can’t wait to sink into all the b-sides.",
            "score": 11,
            "author": "boringestlawyer"
        },
        {
            "level": 0,
            "comment": "we all know that twice never fails to deliver but why does it feel like they LEVELLED UP with this comeback?!??\n\nall the members completely OWNED their moments to shine!!! it really feels like we're in a new era for twice and i for one am already OBSESSED",
            "score": 9,
            "author": "Schlessing"
        },
        {
            "level": 0,
            "comment": "Giving Sana the lines in the chorus is the wisest decision they ever made",
            "score": 10,
            "author": "once_asleepz"
        },
        {
            "level": 0,
            "comment": "Talk that Talk, what a bop!\n\nI'm a simple man, I like good shit whatever the genre. Good music is good music. So between SNSD, Blackpink, and Twice coming back, August has been a very good month for me all around.\n\nAlso treated myself to a nice (quite expensive) pair of earphones, so yeah haha that got some extra enjoyment out of me!",
            "score": 11,
            "author": "kuyaeron"
        },
        {
            "level": 0,
            "comment": "Now that’s a top GG comeback feelsgoodman",
            "score": 8,
            "author": "FaithlessnessMost660"
        },
        {
            "level": 0,
            "comment": "when you're early and want to write a good comment but you're more or less completely speechless because twice went and did it [jasmine masters voice] again.........a fucking gain",
            "score": 32,
            "author": "ghiblix"
        },
        {
            "level": 0,
            "comment": "AMAZING",
            "score": 9,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Oh my GOD! The Visuals! A little disappointed they didn’t stick with the cyberpunk heist concept of the teasers, but everything from the song to the choreo is so good! We stan our queens and hope for a quick recovery from Jihyo for some OT9 stages.",
            "score": 9,
            "author": "BigBadBeluga"
        },
        {
            "level": 0,
            "comment": "That chorus is bopping!",
            "score": 9,
            "author": "cragmorecastle"
        },
        {
            "level": 0,
            "comment": "The girls killed this! They looked and sounded amazing. Full on bop!",
            "score": 9,
            "author": "angies6pack"
        },
        {
            "level": 0,
            "comment": "One of the best chorus to post-chorus I've ever heard!!",
            "score": 10,
            "author": "whatsthisanotherdoor"
        },
        {
            "level": 0,
            "comment": "That chorus is heavenly ✨👼 I love how understated this song is compared to their higher energy tracks. It feels like a dimension of Twice I haven’t seen yet, and I can’t wait to dig into the album and hear more.",
            "score": 7,
            "author": "Bel_Canto"
        },
        {
            "level": 0,
            "comment": "Holy shit!  This is so good.  Like for real. I'm a huge Once but this is the best comeback since feel special.  This is seriously so good.  I'm so glad to have a new comeback with an actual song where not a single part gets weird or boring.",
            "score": 7,
            "author": "pattyfritters"
        },
        {
            "level": 0,
            "comment": "FUCKING WOW. We've had some cute debate, but THIS is actually SOTY, my god. It delivers on all fronts and is so satisfying form beginning to end. I'm just in awe at how consistent and innovative Twice is with each comeback.",
            "score": 24,
            "author": "wardengorri"
        },
        {
            "level": 0,
            "comment": "Retrowave late 90's fever dream. I love the sledgehammer throw from the 1984 apple ad, and the ending seemed like the MC Hammer dance stage of the early 90's.",
            "score": 28,
            "author": "kosmos1209",
            "replies": [
                {
                    "level": 1,
                    "comment": "I caught that reference and then wondered what kitten authority is being smashed lol",
                    "score": 9,
                    "author": "ExWarlockLee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We're currently dealing with a cheshire cat situation in nmixxville right now so I'm glad someone is working on it",
                            "score": 15,
                            "author": "Bortjort"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "That SLAPS.",
            "score": 7,
            "author": "jihyojihyojihyo"
        },
        {
            "level": 0,
            "comment": "They win! I loved it on first listen.  This is an amazing song super catchy.",
            "score": 8,
            "author": "nekocase"
        },
        {
            "level": 0,
            "comment": "This is why i love Twice so much, NEVER NEVER NEVER dissapoints",
            "score": 8,
            "author": "adrian0495"
        },
        {
            "level": 0,
            "comment": "SO GOOD!!! 😭 The girls never disappoint, the chorus is such an earworm",
            "score": 9,
            "author": "murderdocks"
        },
        {
            "level": 0,
            "comment": "So good! The lyrics, their voices, the outfits, the visuals, the theme! Twice never disappoints!",
            "score": 8,
            "author": "AnyIncident9852"
        },
        {
            "level": 0,
            "comment": "It's really really hard for me to like a song at first listen, I always have to give it 2 or 3 listens before I determine if I like it or not, but as I was listening to TTT I immediately fell in love with it! The MV is super fun and stunning as well &lt;3 Love their outfits throughout.",
            "score": 8,
            "author": "abunchofmalarkey"
        },
        {
            "level": 0,
            "comment": "I really like it! \n\nThe chorus is is seriously the best part and I feel like every single one of them got to shine!\n\nThis MV was gorgeous 😍😍 my only complaint is that the song is too short !\n\nAlso the references to other songs!!!!",
            "score": 8,
            "author": "MelissaWebb"
        },
        {
            "level": 0,
            "comment": "The hardest working GG out there, slaying yet another comeback. TTT is a certified banger. Great instrumental, visuals on point and vocal perfection. Twice continue to serve quality music and keep us very well fed!",
            "score": 9,
            "author": "angies6pack"
        },
        {
            "level": 0,
            "comment": "This song is amazing like I said this with Pop but Twice hasn’t made a song that I immediately loved the first listen but Pop I loved it immediately and the same with this song it’s absolutely amazing and also I’m sensing a continuing storyline from scientist here? Considering all the technology and the cat again lol \n\nAlso can we please just have a mini thread to talk about Dahyun’s vocals on her first part like I got literal chills from that over and over I was stuck on it for quite awhile 😂 \n\nI have to easily say this has to be my favorite title track of theirs already and idk but they all seemed so genuinely happy in the MV plus side note Jeongyeon seemed to be in her best condition since hiatus here just genuinely herself again I could go on and on about how amazing this comeback is but it can speak for itself easily",
            "score": 9,
            "author": "EchoUniverse"
        },
        {
            "level": 0,
            "comment": "lol the reference to the Macintosh commercial was nice",
            "score": 10,
            "author": "perfectpurple_"
        },
        {
            "level": 0,
            "comment": "They really hid how good this is in the teasers.",
            "score": 10,
            "author": "neonroli47"
        },
        {
            "level": 0,
            "comment": "I think this might be their comeback domestically, this seems like something the gp will eat up.",
            "score": 7,
            "author": "orngesodaaa"
        },
        {
            "level": 0,
            "comment": "Best song since Fancy",
            "score": 7,
            "author": "MrAdamWarlock123"
        },
        {
            "level": 0,
            "comment": "That ‘tell me what you want, tell me what you need’ is the catchiest hook delivered in a while.\n\nThese days everyone just drops it down and does ‘ratatatata’ or some random shouting. Props to Twice for keeping melody in kpop.",
            "score": 8,
            "author": "Sea_Investigator_947"
        },
        {
            "level": 0,
            "comment": "That was certainly a TWICE song and I mean it in every positive way.",
            "score": 21,
            "author": "niteeee"
        },
        {
            "level": 0,
            "comment": "Is this the one?",
            "score": 20,
            "author": "bryan792"
        },
        {
            "level": 0,
            "comment": "Amazing song, but I have to point out how great Chaeyoung was! Slayed every line!",
            "score": 7,
            "author": "Hepu"
        },
        {
            "level": 0,
            "comment": "It’s so good!",
            "score": 5,
            "author": "ttam23"
        },
        {
            "level": 0,
            "comment": "The song is really catchy and the styling is incredible.",
            "score": 7,
            "author": "SonnyJohn"
        },
        {
            "level": 0,
            "comment": "Really dig the MV aesthetic and the song is sooo catchy, another banger from Twice!",
            "score": 9,
            "author": "elise_ss"
        },
        {
            "level": 0,
            "comment": "Twice have really hit their stride this year in terms of title tracks. It's hard to maintain longevity in Pop music to begin with and incredible to see them still going strong.",
            "score": 9,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I've never heard any bad twice songs. They always comeback with songs I just put repeat on.",
            "score": 8,
            "author": "sejin8642"
        },
        {
            "level": 0,
            "comment": "TWICE IS BACK\n\nwhat a bop!",
            "score": 6,
            "author": "MichaelPFrancesa"
        },
        {
            "level": 0,
            "comment": "one of their best title tracks in a while, the styling of the girls in this mv is top tiered. and the overall design and creative direction - so fun and aesthetic I love it!! \n\nLoved the intro graphic where it resembled the YouTube countdown and also the QR code at the end",
            "score": 6,
            "author": "theofficialguac"
        },
        {
            "level": 0,
            "comment": "Mad that this has instantly become one of my all time favourite TTs from them, but here we are! This is gonna be stuck in my head for the rest of the year/forever, I love them so much 😭",
            "score": 9,
            "author": "gg5ever"
        },
        {
            "level": 0,
            "comment": "best title since feel special. this sound and style suits them so much, I hope this blows up big.",
            "score": 8,
            "author": "Kiramiraa"
        },
        {
            "level": 0,
            "comment": "I have to watch again the MV because I ended up \"just\" focusing on the song. Speaking about that: I love it! It's an instant bop, immediately likeable (at least to me), while some of their songs like Alcohol-Free needed some times to really getting accustomed to the vibe and understand if I liked it or not. \n\nI absolutely love how Jihyo starts and ends the first chorus, it's so powerful and totally set the tone for a fun but \"in your face\" song. Good choice. Nayeon in the second is a safe bet and as always, she delivers. I really like the variations in the third chorus. Jeongyeon singing right before the chorus is perfect, her voice is a treasure. \n\nAll sections are quite short but the song doesn't end abruptly, which is a plus. \n\nAlso... Is it me or Tzuyu voice keeps becoming more addicting each time? I loved her parts.",
            "score": 7,
            "author": "vivianlight"
        },
        {
            "level": 0,
            "comment": "My jaw dropped seeing Mina like 20 seconds in and I don't think I'll ever recover from how good this song is or how good they all look.\n\nPost contract renewal twice just coming for the throat now",
            "score": 7,
            "author": "Guerrin_TR"
        },
        {
            "level": 0,
            "comment": "Holy. Twice really never misses.",
            "score": 9,
            "author": "UnpropheticIsaiah"
        },
        {
            "level": 0,
            "comment": "**SOTY** 😎",
            "score": 8,
            "author": "NightBosman"
        },
        {
            "level": 0,
            "comment": "Sana Carey did what she had to do yet again. I really appreciate how much she gets to sing on songs now. As a Sana main I love that for me lol. Everyone looks beautiful, the song is super catchy and a BOP. Love the references to past songs.",
            "score": 7,
            "author": "SkyRy"
        },
        {
            "level": 0,
            "comment": "thank you twice for being so reliably fun, I was so scared with all the disappointing releases lately but they killed it",
            "score": 6,
            "author": "Fallkitty"
        },
        {
            "level": 0,
            "comment": "Top tier Twice. Which means upper echelon of all kpop.",
            "score": 6,
            "author": "masshysteri"
        },
        {
            "level": 0,
            "comment": "I love how they've come into this mature but still classy concept. They slayed so hard with this comeback. Sana's part in the first chorus is gonna be living in my head rent free for weeks.",
            "score": 7,
            "author": "ImaginaryBerrry"
        },
        {
            "level": 0,
            "comment": "Twice never disappoints !!",
            "score": 7,
            "author": "RB102220"
        },
        {
            "level": 0,
            "comment": "I am in LOVE with this!! They all look stunning and the vocals are no joke - I especially love the contrast between Jihyo’s belting (which always has my jaw dropping to the floor) and Sana’s sweet high register in the chorus, ahhhhhhhh! \n\nI love the entire MV but my favorite shots are in the last half, the early 2000s vibes took me right back to my childhood watching my favorite pop stars on TV. Man, I love Twice so much!",
            "score": 7,
            "author": "lilhomefry"
        },
        {
            "level": 0,
            "comment": "Dayummmm this one is really good. It's giving me the y2k vibes.",
            "score": 7,
            "author": "grondt"
        },
        {
            "level": 0,
            "comment": "I couldn't count how many times I've replayed this song. It's so good. It's one of the better CBs this year definitely, and possibly one of their better TTs, which is impressive, given how stacked their discography is.\n\nThe video gave came close to giving me a heart attack. I'm glad I've seen the teasers and the photo sets. Otherwise, I'd drop dead like that teddy bear from the visual assault.\n\nI understand it's a Macintosh nod, but that sequence where Chaeyoung transformed into Nayeon hurling a hammer towards that screen showing the Scientist cat is hilarious.  I laugh myself to tears every time I watch it. It's so random it's so meme-y. Praying to the gods someone make a GIF of it.\n\nJihyo and Sana coming one after the other, with contrasting very powerful vocals with the sweetest vocals left me even more confused who my ult is.\n\nTzuyu proved she can still improve vocally 7 years into her career as an idol. She was an okay singer to begin with, but what she served in her verse is main vocal material.\n\nJeongyeon is such a treasure. Her beauty shot with the dramatic lighting served old Hollywood glamour meets Madonna-in-her-prime era with that corset worn over a dapper shirt and tie combo.\n\nChaeyoung glowed the most in her red lingerie with black leather(?) jacket look. That was everything. Dahyun served looks too. That black number fits her conservative aesthetic, but also showcased her hourglass curves.\n\nOf course, much had already been said about Mina's S&amp;M outfit. She, Momo and Nayeon served one sexy look after another as usual.\n\nNayeon is especially a joy to watch. She glows in every frame, as if reminding us that prior to this CB, she's already an accomplished, record-setting soloist with a debut song that went viral. Such a boss.\n\nI didn't think it's possible to fall in love even more with Twice. I already gave them my heart and soul last year.\n\nTTT is so good musically. It had incorporated many retro elements but it sounds current.\n\nThose riffs, and also the three notes for the words 'Talk that talk' have that flourish that gives the song an 'Oriental' flavor. I'm sorry for the term, but I can't articulate it properly,  it's like the cliché riff movies use to depict scenes set in (especially historic) East Asia.\n\nThe build up from the prechorus to the chorus is addictive. The bridge to last chorus succession is also so good.\n\nThe verses are the least special but they're also good. The repetitive words adds musicality to the verses. It's also good that they distributed both verses to many members. Momo's lines are nice touches as additional elements.",
            "score": 7,
            "author": "gregMNL"
        },
        {
            "level": 0,
            "comment": "i know im gonna get cancelled for saying this but TALK THAT TALK sounds like its copied from somewhere.. idk just the beat the concept everything it all sounds so familiar i just cant pinpoint exactly where ive heard it.. WAIT i figured it out it sounds like the SONG OF THE YEAR!",
            "score": 84,
            "author": "Uchiha_D_Zoro",
            "replies": [
                {
                    "level": 1,
                    "comment": "![gif](giphy|y2i2oqWgzh5ioRp4Qa|downsized)",
                    "score": 44,
                    "author": "NoMoreGel"
                },
                {
                    "level": 1,
                    "comment": "You had me in the first half, not gonna lie",
                    "score": 27,
                    "author": "gloomswarm"
                },
                {
                    "level": 1,
                    "comment": "when i tell you i was getting ready to fight",
                    "score": 17,
                    "author": "samojoy"
                }
            ]
        },
        {
            "level": 0,
            "comment": "IT'S SO FUCKING GOOD OH MY GOD",
            "score": 18,
            "author": "14MySterY-"
        },
        {
            "level": 0,
            "comment": "Such a gorgeous, gorgeous music video. Adorable concept and a perfect execution. And Sana with bangs!!! We won!!\n\nI was tempted to say it's underwhelmed, but then I remembered how fast Pop and Scientist grew on me. Listening to this a second time with headphones now, I can tell this is going to stick just like they did. The layers in the chorus give you so *much* to listen to. I can't wait to hear the b-sides, TWICE can really do no wrong.",
            "score": 17,
            "author": "archfeybaby"
        },
        {
            "level": 0,
            "comment": "Nayeon absolutely devoured her chorus 😩 &amp; yes Mina with her iconic bridge! The song’s a whole bop",
            "score": 16,
            "author": "paradisetrain"
        },
        {
            "level": 0,
            "comment": "I don't want it to end. Damn it, that was SOOO GOOD. 😭 \n\nEdit: That's the cat from Scientist! Did Nayeon just exploded the cats? 😹 \n\nEdit2: Omg, the B-sides?! Why does the album have a 7 TITLE SONGS?! 🤯",
            "score": 18,
            "author": "magistra023"
        },
        {
            "level": 0,
            "comment": "Such an awesome track!! Damnnnnn",
            "score": 6,
            "author": "Staind1410"
        },
        {
            "level": 0,
            "comment": "I am so fucking happy right now that I could cry 🥺.",
            "score": 6,
            "author": "Affectionate_Dirt_65"
        }
    ]
}