{
    "id": "12bl24v",
    "score": 7,
    "title": "Theatre at Brown (ACADEMICALLY)",
    "author": "idespisereddit352851",
    "date": 1680619025.0,
    "url": "https://www.reddit.com/r/BrownU/comments/12bl24v",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I’m between Brown and another school right now for Theatre, and what’s frustrating me is how little I can find about what Brown offers ACADEMICALLY. I’ve heard all about Sock and Buskin, Shakespeare on the Green, etc. etc., but the TAPS website only contains the requirements for the concentration with no word on professional opportunities, classes I could possibly take for electives in the concentration, career advancement, etc. I’m attending every virtual event I can, but I may not be able to make ADOCH, so in the meantime I’m turning here. I would really appreciate any help from anyone who might know anything about the training I might get at Brown. Please. Thank you!",
    "comments": [
        {
            "level": 0,
            "comment": "So I was at brown 20ish years ago, but FWIW about half the “theater kids” I was good friends with made it professionally in the field. Some playwrights, some actors, some dramaturges a couple who do tech. Various levels of renown, but all doing what they want to be doing. This ratio seems to compare pretty favorably to most other places.\n\nThe theater department is pretty theory-focused, since it’s an academic department, but the classes were very good and there were also a lot of opportunities for students to get practical experience both in on campus productions and in the broader Providence theater community.\n\nHopefully some current students can provide some more info on the current state of the department and the student theater groups, but retrospectively the people who were there a generation ago made out pretty darn well.\n\nAs far as specific academic offerings, you can definitely read the department’s offerings in the online course catalog for some idea. If you can’t attend ADOCH, you might also email one of the department’s concentration advisors and see if you can set up a time to chat.",
            "score": 1,
            "author": "Excellent_Affect4658"
        }
    ]
}