{
    "id": "12c8j57",
    "score": 3,
    "title": "Does Brown give credit for AP scores of 5’s?",
    "author": "Just-Development-552",
    "date": 1680669482.0,
    "url": "https://www.reddit.com/r/BrownU/comments/12c8j57",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Brown will let you place out of certain classes for 4 and 5s (depends on exam and class), but you don’t get course credit. You will still need 30 class units to graduate.",
            "score": 11,
            "author": "Octocorallia"
        },
        {
            "level": 0,
            "comment": "Yes and no. You test out of certain classes, but you don’t get any kind of course credit. It makes sense, to be honest. In my experience, most APs are below classes are state colleges",
            "score": 6,
            "author": "Load_Altruistic"
        },
        {
            "level": 0,
            "comment": "https://college.brown.edu/design-your-education/academic-policies/advanced-placement-exams",
            "score": 7,
            "author": "SpiralKim72",
            "replies": [
                {
                    "level": 1,
                    "comment": "Amazes me how many answers to questions posted in this sub are easily findable on the Brown website.",
                    "score": 9,
                    "author": "BitterStatus9",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I switch back and forth between welcoming all of the admissions questions and wishing they were back to being megathread only",
                            "score": 3,
                            "author": "AssociateClean"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It depends on the exam and the department, but when they do they give placement credit. This is different from regular credit in that, while it appears on your transcript and satisfies course prerequisites and concentration requirements, it doesn't reduce the number of courses you have to take at Brown.\n\nThere might be exceptions if you apply for and receive advanced standing.",
            "score": 1,
            "author": "thespelvin"
        },
        {
            "level": 0,
            "comment": "You can place out of classes with conditions",
            "score": 1,
            "author": "ShoeOpposite8947"
        },
        {
            "level": 0,
            "comment": "There’s no real benefit to placing out of classes with your AP scores, since you still need 30 classes to graduate. It’s better to just retake the classes in college to get an easy A.",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}