{
    "id": "12j91v2",
    "score": 5,
    "title": "Are any of the finance clubs (Brown Finance Club, Brown Investment Group, etc) currently active?",
    "author": "Comfortable_Salad",
    "date": 1681271653.0,
    "url": "https://www.reddit.com/r/BrownU/comments/12j91v2",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Yes, in different ways. BIG is very active right now, and has actually started a very interesting new long/short equity fund in partnership with Point72. Organizations like the Brown Finance Club are more education based, and can offer students a lot of useful knowledge if you seek them out. But yeah, definitely active",
            "score": 11,
            "author": "UnUnimportant-",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you know the best way to seek them out if they're not active online? The other clubs I'm peripherally involved in post their events on Instagram and such",
                    "score": 2,
                    "author": "Comfortable_Salad",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Generally, you just get on their Listserv and attend meetings - there’ll be plenty of opportunities to do the former early in the year\n\nIn terms of the BFC, there’s a mentoring program advertised by/connected to BIG that you would eventually see in an email sooner or later (usually in the Spring; application season)",
                            "score": 1,
                            "author": "UnUnimportant-"
                        },
                        {
                            "level": 2,
                            "comment": "You can just start showing up to BIG meetings on Mondays, they’re in MacMillan at like 8pm I think",
                            "score": 1,
                            "author": "ThanksMaier"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes my roomate is pretty high up at BIG.  It takes up a chunk of his time",
            "score": 8,
            "author": "aurreco"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "lolll ok thanks. i was just poking around, but it doesn't look like any of them have an active social media presence or updated websites.",
                    "score": 1,
                    "author": "Comfortable_Salad"
                }
            ]
        }
    ]
}