{
    "id": "ax8u1u",
    "score": 79,
    "title": "I attended one of the Granoff dinners. Here's a bit about my experience there",
    "author": "paxonhamber",
    "date": 1551716062.0,
    "url": "https://www.reddit.com/r/BrownU/comments/ax8u1u",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm a little hesitant to write about this, but I did get a weird, slightly guilty feeling from attending and what I saw, so I thought I'd write a bit about it.\n\nI obviously want to keep anonymous because of the current atmosphere around here, but for a bit of background: I was certainly invited because of my parents' stature and relationship with MG. My parents are pretty wealthy, but no one you would've heard of unless you happen to be closely connected to the industry my mom is huge in. My dad is also a kind of bigwig in a specific medical field, so they've known MG for a while now and it's just kind of a professional courtesy for him to invite people like me.\n\nAnyway, they got a lot of stuff right in the ProJo article, so I'll skip that mundane stuff and try and add what I can with my perspective. I actually went last year, not this year (for embarrassing, Bajas related reasons), but I assume it was pretty similar.\n\nAs my Lyft approached Al Forno, I tried to remember what my parents had told me in preparation for the dinner: mention them by name (so MG knew who I was), talk to him about my interest in business, and something about the word \"fidelio\". I checked the pockets of my Canada Goose to make sure I hadn't left my iPhone XS Max and Juul in the car, and walked in. When I got to receptionist at Al Forno, I mentioned that I was there for the MG dinner. She told me that it was actually a private event, but asked me if there was anything else I wanted to mention? I was kind of confused, but remembered what my dad had said and mumbled \"uhh, f..fidelio?\" She gave me a knowing smile and welcomed me. Huh, I thought my dad had just been joking.\n\nShe started walking into the kitchen, so I just stood waiting, but after a couple seconds she realized I wasn't following her and told me to follow. Weird! I followed her, past the delicious wafts, to the back right corner of the kitchen. We got to a huge, knurled door that looked *very* out of place in the back of Al Forno's otherwise modern-clean kitchen, but it didn't look bad, either. Strangely, there was no handle on the door, but there was a small hole in the wall, about an inch wide, at about ankle height, from the door. She told me to hang on a sec, and knelt down. I couldn't see super well because the area by the door wasn't lit very well, but she definitely reached into her mouth, winced a little, and then put something into the hole. The door immediately creaked open and I stepped into the foyer. The receptionist wiped the corner of her mouth and told me to enjoy. The door closed behind her, and I noticed that this side didn't seem to have a handle, either.\n\nEven the foyer was nice, though a tad strange. There was a doorman, but his eyes were closed and he didn't speak. He did, however, gesture for my coat, whimpering a little, and I handed it to him. He reached into his pockets (which seemed to make...wet sounds?) and produced a token in exchange for my coat. It was a little lock of red hair, about 3\" long, with a LV band around it. It seemed like there were little clumps of skin at one end of the lock of hair, but that's probably just some fashion thing I don't understand. \n\nI entered the main room, and damn, it was pretty! I went to the wine bar, where there was another man similar to the doorman. I got a wine of a name, color, smell, and taste I had never seen before. Everyone was already mingling. I saw a few people I recognized from class there, talking to wealthy looking older folks. It's kind of funny, when you imagine a special event with the \"ultra rich\", you might imagine $4,000 tailored suits, but most of these people were...pretty casual. A lot of dadcore, bad docksiders with baggy polo shirts, if you catch my drift. Then again, I guess you can dress like that when you buy and sell lesser lives as a side business. \n\nExcept for MG. Though I had never actually met him, despite going to his nephew's Bar Mitzvah ages ago, I guess I expected a typical 81 year old man. He was anything but. The first reason you'll notice him is that he's gotta be 6'8\", maybe more since he was hunched over to talk to the craven plebes near him. He's also just... *bronze*. And not in a trashy Trump way, but like he just got off the yacht from Mallorca. He's also weirdly yoked. He was wearing a beautifully tailored suit, in light tan, but it actually looked almost white against his glowing golden skin. And it wasn't of any material I had ever seen; it had an amazing texture, like leather, but finer, smoother.\n\nI had only been admiring him from a distance, passing the time until I got a chance with him by talking to another alumnus about his visionary business leveraging blockchain tech for disruptive AI to harness CRISPR or something. MG was periodically scanning the room he could see, but I was at about a 160 degree angle behind him, so he never saw me. As the alum was saying something about big data derivatives and his ethical role in tanking the Haitian economy, I suddenly started hearing... I'm not sure, Icelandic? chanting in my head. It seemed like no one else in the room could hear it. It was quickly getting louder and louder, drowning out the visionary, and I began to sway on my feet. Suddenly, I saw MG's head whip around to look me directly in the eyes, and it stopped as if I had never heard anything.\n\nHe excused himself from the current gaggle with a well-timed outro quip and lurched over to us. I say lurched, because I've never seen anything move like that before. It wasn't awkward; if anything, it was stealthy and elegant. It might be partly because of his size, but I didn't even hear any of his footsteps. He introduced himself with a rogueish smile and said  \"...and you must be ___ ________\", using my nickname that only my closest friends call me. Closer, he smelled faintly of sandalwood, and the hair on the back of my neck stood up. While intently asking me about my interests, at one point he sneezed. It could have been the mystery vino and soft lighting, but I swear that as he was opening his eyes post-sneeze, they seemed to open sideways. \n\nI honestly don't know how long we talked, or what we talked about, but it felt like hours. He was wonderful at conversation, polite yet engaged, making it seem like what I was saying at that moment was the only thing in the world he cared about. He asked how my family was doing, and asked me in which order I would consume them. When I caught a glimpse of my watch, it said 7:50, but that didn't really make sense: the watch's hour hand was barely past the 7, and I had gotten out of the Lyft at 7:35 PM. But I wasn't going to complain; talking to him was the happiest I had been in as long as I could remember.\n\nFinally it was my turn to lose him, and he excused himself. He lurched to the center of the room and the lights dimmed slightly. We all instantly stopped (how could you not?) and turned our gazes to him, though it felt out of my control anyway. He barely moved his lips, but his voice filled the room, almost painfully loud. The red velvet on the walls suddenly seemed a little redder. He uttered that he had summoned someone very special there tonight, and from a spiral staircase in the center of the room that no one had noticed until that moment, up came Christina Paxson. She was wearing a Supreme hoodie that they had only released a non-integer number of, as well as Stan Smiths, but they weren't the classic white. They were a color and texture similar to MG's suit.\n\nHe said that it was time to consume of the knowledge of The Book. From her Fjallraven Kanken, CPax withdrew a tome of a texture not unlike her shoes, telling us it was a very special one from the John Hay library and that its contents would allow us to maximize the material in our capitalist paradise. As she said that, her eyes glimmered, and something in MG's pants rustled.\n\nOh, and what secrets they were. Though they were speaking backwards, alternating words, we understood all and I cannot go back to the time before. They told us to walk the garden of forking paths, but beware the fox eating itself. They told us that recycling is nonsense and that though gender is arbitrary, so is human life, so don't feel guilty if you must carve a mural of pain into flesh to succeed in the world of business. They told us how to fold a fitted sheet and to invest in vape-pacifiers, because they heard a hot tip that they would be legalized by 2023. Periodically, MG climbed into an Apparatus that inscribed these words into his back.\n\nThey began to tell us of MG's philanthropic miracles. His gills flared wealthily, and four of the eyeless eunuchs brought out his first generous donation to Brown: a life sized metal bull, almost as bronze as the deity himself. They also dragged out a cowering, nude, filthy child, his pupils the size of dinner plates, on a Gucci 2018 A/W leash. The eunuchs opened a door on the bull's rear, and MG produced from his beautiful suit an LED fidget spinner. Instantly the child snapped to attention, transfixed on the spinner. MG tossed it into the bull, and the child, released, scrambled after it on all fours into the bull. To be fair, it was a pretty sweet fidget spinner. They slammed the door shut and lit a fire beneath it, and then everyone clapped.\n\nAs the first hors d'oeuvres were being brought out by his wretched minions, CPax unzipped her humanskin. \"Holy shit\", I thought. \"They have *pigs in a blanket?\"*",
    "comments": [
        {
            "level": 0,
            "comment": "10/10 Shitpost, would read again ",
            "score": 13,
            "author": "Trevorzky"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 27,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "ye but not ones we \"take\"",
                    "score": 14,
                    "author": "paxonhamber"
                },
                {
                    "level": 1,
                    "comment": "This is a snow day’s worth of effort",
                    "score": 5,
                    "author": "fearne50"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Enjoyed reading this. Thank you. ",
            "score": 7,
            "author": "crackrocknbach",
            "replies": [
                {
                    "level": 1,
                    "comment": "thanks, just reporting the facts.",
                    "score": 5,
                    "author": "paxonhamber"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is quality",
            "score": 4,
            "author": "r3ll1sh"
        },
        {
            "level": 0,
            "comment": "What a meme",
            "score": 3,
            "author": "Nancy-Tiddles"
        },
        {
            "level": 0,
            "comment": "Worthy of /u/\\_vargas\\_.",
            "score": 2,
            "author": "munchler"
        },
        {
            "level": 0,
            "comment": "Ethical role in tanking the Haitian economy lol",
            "score": 2,
            "author": "StudentLoanSlave1"
        },
        {
            "level": 0,
            "comment": "he has court eunuchs? this man is secretly waiting to restart the chinese empire",
            "score": 1,
            "author": "beepybeetle"
        },
        {
            "level": 0,
            "comment": "O, to be a pig in that blanket. ",
            "score": 1,
            "author": "theLucubrator"
        },
        {
            "level": 0,
            "comment": "interesting read lol",
            "score": 0,
            "author": "burningicetea"
        }
    ]
}