{
    "id": "fpm9bt",
    "score": 89,
    "title": "Just got accepted to the class of 2024!",
    "author": "emantheslayer0",
    "date": 1585265776.0,
    "url": "https://www.reddit.com/r/BrownU/comments/fpm9bt",
    "media_urls": [],
    "other_urls": [],
    "postText": "Sorry if there’s a mega and I didn’t see it. I’m shocked. Very grateful and excited to see you all on campus this fall!",
    "comments": [
        {
            "level": 0,
            "comment": "Same here. Congrats and look forward to seeing everyone on campus this fall (hopefully!!)",
            "score": 13,
            "author": "ThuggishRuggishGold"
        },
        {
            "level": 0,
            "comment": "Congrats!  If anyone wants to talk about CS, I’m a current junior and would always be around for a chat",
            "score": 10,
            "author": "G0mega",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just got accepted and I applied for CS! I’m not sure that’s what I got in for, though, because my acceptance letter didn’t specify. Do you know if there’s a way to check if I’m in for that or my alternate concentration (archeology)? I know Brown is different from a lot of schools with their concentrations and open curriculum program, and I probably just got in as a whole, I just would like to figure out if I’m studying CS next year",
                    "score": 3,
                    "author": "infinitemalison",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We don't have concentration quotas. If the world went mad and literally everyone chose CS, there is no University policy preventing it. You technically have until April of your sophomore year to decide, anyway.",
                            "score": 5,
                            "author": "IntingPenguin",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wow, thank you!! I’m overjoyed!!",
                                    "score": 3,
                                    "author": "infinitemalison",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yep — you can do CS, or you can swap to some completely unrelated field should you be interested in it.  You can take classes in whatever, so long as you meet the prereqs.  That doesn’t mean you can get a CS degree taking random classes (there ARE requirements), but you can pretty much take anything :)",
                                            "score": 3,
                                            "author": "G0mega",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That’s so cool! This aspect of the Open Curriculum is one of the reasons I applied",
                                                    "score": 2,
                                                    "author": "infinitemalison"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I took AP computer science principles and thinking about doing a concentration in CS. However, APCSP isn't the most \"intense\" CS class ever, and I'm worried I might \"fall behind\" the other more experienced CS kids. Does the CS department do a good job at introducing CS and allowing students to graduate with a CS degree?",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I came to Brown after taking AP CS online (I got a 2 on the exam, didn't know what ArrayLists were \"why is there an array of lists what does that even mean, why are there two brackets\" -- that type of understanding).  I interned for a game company last summer, and am interning for Amazon this summer as a software engineer intern.  \n\nBrown prepares you EXTREMELY well, it's insane.  No matter the intro sequence you take, you'll be fine, and prepared not only for upper level classes, but landing jobs and performing well.",
                            "score": 3,
                            "author": "G0mega"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "SAME!! Can’t wait to go next year!! Go Brunonians\n 🐻",
            "score": 8,
            "author": "infinitemalison"
        },
        {
            "level": 0,
            "comment": "Good stuff guys, I'll see you there.",
            "score": 10,
            "author": "chrisfortuitous"
        },
        {
            "level": 0,
            "comment": "Me too, hope to see everyone there next semester can’t wait. Congrats y’all.",
            "score": 4,
            "author": "Gilded_Mage"
        },
        {
            "level": 0,
            "comment": "Awesome, I just got accepted too! See y’all there!",
            "score": 5,
            "author": "ianmls"
        },
        {
            "level": 0,
            "comment": "Congrats!! So excited for you",
            "score": 3,
            "author": "vcao9"
        },
        {
            "level": 0,
            "comment": "Congrats, guys!! Feel free to chat with me if you have any questions about premed, languages at Brown, athletics, or just Brown in general!",
            "score": 4,
            "author": "acetrainerelise"
        },
        {
            "level": 0,
            "comment": "me too! i am beyond shocked jnsi$;&amp;,&amp;&amp;:&amp;;",
            "score": 3,
            "author": "opticTacticalPiggeh1"
        },
        {
            "level": 0,
            "comment": "Same!!! Can't wait to meet you all! Is there some sort of admitted students chat or anything?",
            "score": 2,
            "author": "College__Questions",
            "replies": [
                {
                    "level": 1,
                    "comment": "There was a Facebook group for our year I think",
                    "score": 3,
                    "author": "Nancy-Tiddles"
                },
                {
                    "level": 1,
                    "comment": "Yeah there's a groupme! Check the FB group for the link :)",
                    "score": 2,
                    "author": "Spaghetti4WorstPasta",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I just found the groupme this morning actually haha, do you have the link to the Facebook group?",
                            "score": 1,
                            "author": "College__Questions",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's in the applicant portal :)",
                                    "score": 2,
                                    "author": "Spaghetti4WorstPasta"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Me too! Can’t wait to see everyone!",
            "score": 2,
            "author": "WulvOfStockholm"
        },
        {
            "level": 0,
            "comment": "Nice congrats!!",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "We out here",
            "score": 2,
            "author": "20kelly103220"
        },
        {
            "level": 0,
            "comment": "Me too!",
            "score": 2,
            "author": "airyoi"
        },
        {
            "level": 0,
            "comment": "Me too! I'm happy to be a part of this community.",
            "score": 2,
            "author": "Pablo21690117"
        },
        {
            "level": 0,
            "comment": "I’m so excited to see all of you there!",
            "score": 2,
            "author": "Sax-ualContent"
        },
        {
            "level": 0,
            "comment": "Congrats!!’",
            "score": 2,
            "author": "ascensioN4"
        },
        {
            "level": 0,
            "comment": "Im still waiting for my decision. Should I worry?",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "The regular decisions should’ve come out 3 hours ago (7 pm ET).",
                    "score": 4,
                    "author": "infinitemalison",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I found it. Got denied",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Aw :( so sorry",
                                    "score": 3,
                                    "author": "infinitemalison"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Congrats! I'm a junior, and I am here if you have questions",
            "score": 1,
            "author": "doctor_the_stallion"
        },
        {
            "level": 0,
            "comment": "Congratulations to you and everyone else who also got in! If y'all want to get even more excited about your soon-to-be peers and hear some inside perspectives from Brown students themselves, there's a podcast on Spotify called Show-N-Tell that showcases the depth and variety of students' experiences which make the Brown community so special! Hope you enjoy!\n\n[https://open.spotify.com/show/0oouf2cuRmXTtk7fh8n6Do?si=xbn0wauMSmyYKT9MagSocA](https://open.spotify.com/show/0oouf2cuRmXTtk7fh8n6Do?si=xbn0wauMSmyYKT9MagSocA)",
            "score": 1,
            "author": "alibrown8"
        }
    ]
}