{
    "id": "i04i1t",
    "score": 51,
    "title": "What the hell is going on?",
    "author": "TheEnemyOfMyAnenome",
    "date": 1596043080.0,
    "url": "https://www.reddit.com/r/BrownU/comments/i04i1t",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm not on facebook so I'm pretty out of the loop on stuff. But it's absolutely insane how few courses are being offered. Am I wrong to be surprised by this, did I miss an email or something?\n\nI'm a 4th year engineering student and pretty much none of the courses I planned on taking are being offered. I mean there are courses in GEOL and ASYR I was considering, and I looked and neither of those departments even exist in the fall? I don't even know how I'm filling my upper-level science req, not to mention what concentrators are supposed to do.\n\nImo this shit is just unacceptable. I came to brown with the intent of taking structural engineering courses that just don't exist right now, to the point where it might seriously negatively impact my ability to find work post-graduation. Not to mention the years of bullshit 0000-level courses I put up with so I could finally get to the interesting shit. This is super fucked.",
    "comments": [
        {
            "level": 0,
            "comment": "You are definitely right that there are way fewer courses offered this semester. Compared to the average number over the last 3 years, we have 27% fewer options now. I'm really surprised Brown didn't let us know that this was happening or offer a justification for it; I wouldn't have even noticed this was such an interdepartmental problem until I saw your post and ran the numbers just now.\n\nSemester | Number of Courses\n---|---\nFall 2020 | 1105\nSpring 2020 |1597\nFall 2019|1529\nSpring 2019|1538\nFall 2018\t|1493\nSpring 2018\t|1512\nFall 2017\t|1464\nSpring 2017\t|1521",
            "score": 28,
            "author": "US_Govt_Is_Corrupt",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 10,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That would be cool, but it sucks for seniors. They would have to graduate a summer later and not sure how that would pan out for job searching.",
                            "score": 8,
                            "author": "mint-ish",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Plus zero percent chance they let us take summer courses for free lol",
                                            "score": 3,
                                            "author": "TheEnemyOfMyAnenome"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think the departments are still scrambling to list all of the courses...I don't know. I checked CAB and can't seem to find any classes listed in the spring and summer semesters yet. Maybe that's affecting it? But I honestly have no idea",
            "score": 8,
            "author": "1318253"
        },
        {
            "level": 0,
            "comment": "There’s structural engineering courses here?",
            "score": 3,
            "author": "ChessMaster22",
            "replies": [
                {
                    "level": 1,
                    "comment": "I graduated a fair bit ago, but there are a couple. Both 1750 (advanced mechanics of solids) and 1300 (structural analysis) are pretty good (depending on prof). There are also grad level courses like 2340, but those aren't really something that I can recommend.",
                    "score": 2,
                    "author": "Rnet1234"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "lol",
                    "score": 1,
                    "author": "TheEnemyOfMyAnenome"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Isn't that normal though?",
                    "score": 6,
                    "author": "anonymouslyshort",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -3,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Orgo is second semester, first semester is gen chem",
                                    "score": 3,
                                    "author": "shasto"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}