{
    "id": "lsa76p",
    "score": 47,
    "title": "Brown’s War on Drugs",
    "author": "jswrenn",
    "date": 1614269832.0,
    "url": "https://www.reddit.com/r/BrownU/comments/lsa76p",
    "media_urls": [
        "https://www.browndailyherald.com/2021/02/24/wrenn-war-on-drugs/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I think you can guess my position on this.",
            "score": 26,
            "author": "Iegalizecrack"
        },
        {
            "level": 0,
            "comment": "Excellent piece. I'm so disappointed to hear about the new additions to the regulations.",
            "score": 18,
            "author": "clotch"
        },
        {
            "level": 0,
            "comment": "I think the author is making a bigger deal of this than it needs to be.  Brown has these statues to avoid legal problems and loss of federal funding.  When it comes to enforcement, there’s basically none.  I remember living in grad center and seeing students smoke pot on the terrace every night.  DPS will make sure you get home safely before cracking down on you for not being sober.  All organizational decisions are determined by money whether we like it or not.",
            "score": 11,
            "author": "bastardo_per_sempre",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree that Universities deserve tremendous leeway for their compliance with the DFSCA, namely that it maintains [\"standards of conduct that clearly prohibit, at a minimum, the unlawful possession, use, or distribution of illicit drugs and alcohol by students and employees on its property or as part of any of its activities\"](https://www.ecfr.gov/cgi-bin/text-idx?SID=f4f16228a53082845a856167da1e5023&amp;mc=true&amp;node=sp34.1.86.b&amp;rgn=div6#se34.1.86_1100). I take no issue with that. Compliance with this regulation has been the status quo at Brown University — and virtually *all* universities — for thirty years.\n\n*However*, with the most recent edition of the Code of Student Conduct, Brown University now exceeds its legal obligations to the DFSCA. The DFSCA does not compel Brown to:\n\n* prohibit of marijuana use *regardless of its legality*\n* enforce drug prohibitions off-campus\n* restrict students from outright encouraging drug use — and certainly does not compel Brown to restrict students from advertising or distributing adulterant testing kits on the basis that doing so *might* encourage drug use.\n\nI can't find many reasons to suggest that these changes are merely a matter of regulatory compliance. Other universities have not modified their conduct standards in similar ways. (To illustrate how stark the difference in attitude is: URI's equivalent of Spring Weekend is *hosted* by Students for Sensible Drug Policy, and it's called \"Hemp Fest\".) \n\nIf Brown adopted to avoid legal repercussions, it ought to explain that's the case (as it did when the DFSCA was introduced).",
                    "score": 14,
                    "author": "jswrenn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I guess I see a little more nuance in the issue than others. When I was at Brown, i spent a lot of time with disabled students, because i am very disabled myself. I never heard of anyone getting kicked off campus for drug use or distribution per say, but i have met several students who became addicts or alcoholics on campus, which is, in my opinion, a problem no one addresses. I have also met several students who's medical conditions are exacerbated by drug use - eg, marijuana smoke causing migraines.\n\nI'm not against recreational drug use or drinking, but i think the way we have it set up in our universities doesn't really help anyone.",
                            "score": 6,
                            "author": "quetzal1234"
                        }
                    ]
                }
            ]
        }
    ]
}