{
    "id": "ngp3dm",
    "score": 10,
    "title": "Anyone heard about / lived at Found Study?",
    "author": "Snoo61500",
    "date": 1621480016.0,
    "url": "https://www.reddit.com/r/BrownU/comments/ngp3dm",
    "media_urls": [],
    "other_urls": [],
    "postText": "I'm looking at places to live around Fox Point area and stumbled across Found Study. It's in 75 East St., and it seems like it has a dorm room-style setup. My question is, has anyone here leased a room at Found Study? What was the living experience like? I can't really find any information or reviews about the place other than their website. Any info about this place is greatly appreciated!",
    "comments": [
        {
            "level": 0,
            "comment": "Please find somewhere better to live! This place is a scam. The pictures look great online, but in person the place is run down and really gross. I had high expectations for the place, but I was disappointed to come into my \"new room\" with hair and bugs in my mattress as well as literally feces in my toilet... The rooms use central ac, but it doesn't work and none of the windows are properly secured, which makes for a really damp and humid room. All the hallways are musty and there is no maintenance keeping the building alive. The washing machines are broken and the ones that aren't are trashed. The community kitchen is filled with bugs, hair, and other physical contaminates. The community microwave has hair and a ton of food debris in it and smells putrid. Theres only two people running the building and they're college students as well so they don't have much time for the residents. Also they recently jacked up the prices for the summer so they can make more money off of desperate students and interns. My advice is to go on Facebook and look for people subletting their apartments for the summer, as they're are plenty of students doing so and you can find a place for way cheaper and cleaner than here. I am happy to answer any questions you may have! Good luck finding a place!",
            "score": 1,
            "author": "Dino907",
            "replies": [
                {
                    "level": 1,
                    "comment": "ugh I actually signed a lease with them :( now im super worried about living here… do you have any idea  what happens if terminate the lease earlier than what’s in the contract?",
                    "score": 1,
                    "author": "Snoo61500",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I tried to terminate earlier than what stated in the contract aswell and they told me they would keep the security deposit and the first months rent with no refund so I ended up staying :(",
                            "score": 1,
                            "author": "Dino907"
                        },
                        {
                            "level": 2,
                            "comment": "Any updates on how it's going for you? I'm (maybe naively) they've improved the place because it would be very convenient for me to get a short term lease while in school",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hi! So I ended up moving to the unit in late August and it was a complete disappointment. The carpet was dirty, the bathroom was disgusting, the windows were broken, and the bed frame was in shambles. The place was completely trashed and it wasn't even clean when I moved in. There's only one person managing the entire building and she couldn't find someone to fix all of my complaints within the next 2 days so we ended up terminating my lease without a fee. Signing a lease with this place was an actual nightmare and I had to stay in a hotel until I found an apartment last minute. PLEASE DO NOT CONSIDER THIS PLACE. If you need help looking for short term leases, you can reach out to me or there is a Facebook group where people post subleases!",
                                    "score": 1,
                                    "author": "Snoo61500",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I really appreciate you passing that info along and I’m sorry that happened to you. It’s not cool that they’re taking advantage of students who need housing and charging that much for bad living conditions. I will definitely stay away. Thanks",
                                            "score": 1,
                                            "author": "[deleted]"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Hi! I’m currently looking for housing for a summer internship in Rhode Island and I’m struggling… where did you end up living/ could you send me the Facebook group for subleasing?",
                                            "score": 1,
                                            "author": "geologyontherocks",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hey, this is the link to the Facebook group:\n\n[https://www.facebook.com/groups/683411031786289/?multi\\_permalinks=4578376362289717&amp;notif\\_id=1643292699635577&amp;notif\\_t=group\\_highlights&amp;ref=notif](https://www.facebook.com/groups/683411031786289/?multi_permalinks=4578376362289717&amp;notif_id=1643292699635577&amp;notif_t=group_highlights&amp;ref=notif)\n\nA lot of students are subleasing their place for the summer so I think this might be your best bet. I also found my place from GradBnb ([https://www.gradbnb.com](https://www.gradbnb.com)) but I think they do 1-year leases only. Hope this helps!",
                                                    "score": 1,
                                                    "author": "Snoo61500"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "In case you’re still wondering the building flooded over the weekend and it is all being handled very poorly",
                                    "score": 1,
                                    "author": "CanaryCute8991"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}