{
    "id": "olpt5q",
    "score": 12,
    "title": "Can someone explain \"open-curriculum\"?",
    "author": "Former_Astronaut_528",
    "date": 1626468818.0,
    "url": "https://www.reddit.com/r/BrownU/comments/olpt5q",
    "media_urls": [],
    "other_urls": [],
    "postText": "So I'm thinking of applying to Brown because I rly like the idea of open curriculum, but I just want to make sure. Does that mean that I can take whatever classes/courses I want to? Or is there some sort of \"rules\" when designing the curriculum?",
    "comments": [
        {
            "level": 0,
            "comment": "Response by u/stdinis0 pretty much covers everything. The only think I’d like to add or clarify is that the writing designated courses (WRIT) can be found in pretty much any department. There’s a chance you’ll see a class in a non English class you’re interested in and it’ll happen to be WRIT. So don’t stress too much on this point if writing and English aren’t your thing (though you do need two English classes if you want to apply to med school).",
            "score": 5,
            "author": "fascinatingly_stupid",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you, I'll look into the WRIT courses more because I didn't know about it.",
                    "score": 1,
                    "author": "Former_Astronaut_528"
                }
            ]
        },
        {
            "level": 0,
            "comment": "other guy is right up until they say it isnt practically flexible. If you’re just having a normal undergrad experience without premed or prelaw, it’s very flexible.  Even with those, as long as you have a general idea of what you want to do, you can take plenty of classes that have nothing to do with your major. I’m majoring in physics, which is pretty high up there in terms of the required courses, and even then about half of my classes are electives",
            "score": 4,
            "author": "altiernayte",
            "replies": [
                {
                    "level": 1,
                    "comment": "So I want to major in Statistics, but I'm also interested in astronomy, cognitive science, international relations, etc. and I can still take some courses from those majors, right? would that be my electives?",
                    "score": 1,
                    "author": "Former_Astronaut_528",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes. It’s not like you’re taking classes from other majors—it’s more like there’s a giant pool of classes that everyone can choose from, as long as they meet the prerequisites. I’ve taken classes in philosophy, ancient Egyptian history, environmental history, linguistics, and other subjects.",
                            "score": 1,
                            "author": "altiernayte",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "thanks. I think it will make better sense when I actually go there (hopefully). One more question though, what do you mean by the classes having to meet the prerequisites? You mean like as long as I took the prerequisite classes of the class that I want to take?",
                                    "score": 1,
                                    "author": "Former_Astronaut_528"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It means you take whatever you want to take, given you finish your concentration requirements, your premed/prelaw/research coursework, and classes if you intend to go to graduate school. We don't have a \"core\" that forces you to take English classes (though 2 writing-designated classes are required), or take Math, Geography, and PE.\n\nIn theory, it's very flexible. In practice, it really isn't.\n\neg.) I switch from premed to CS my sophomore year. I hadn't taken an intro sequence. I took the accelerated version of the intro sequence and the intermediate course the following semester to get up to speed for interviewing and build the resume. I didn't really have time for electives.",
            "score": 8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "So is it \"possible\" if it corresponds to my major?",
                    "score": 1,
                    "author": "Former_Astronaut_528"
                }
            ]
        }
    ]
}