{
    "id": "pb6c8o",
    "score": 12,
    "title": "Accessibility to shopping locations",
    "author": "midnightchilling",
    "date": 1629876539.0,
    "url": "https://www.reddit.com/r/BrownU/comments/pb6c8o",
    "media_urls": [],
    "other_urls": [],
    "postText": "How accessible are general stores (e.g. Walmart or the like)? If I wanted to purchase paper, batteries, or hygienic supplies, would I have to hire an uber/ride a bus, or are there stores within a walkable distance? And if riding a bus is the best option, how long would it take? Thanks in advance.",
    "comments": [
        {
            "level": 0,
            "comment": "CVS and the Bookstore are both on Thayer and sell all of those. There’s a Staples and a Whole Foods near Thayer as well (maybe a 10-15 minute walk? I’m terrible with distances; or a short bus ride). \n\nEastside Marketplace is also a short bus ride away (or a 10-ish minute walk), and there’s some larger CVS stores only 5-10 minutes away (the one on Thayer is on the smaller side). The Providence Place mall is also a pretty short bus ride or a 15 minute walk away (but that’s like all downhill getting there from College Hill, and uphill coming back, so the bus might be preferable).",
            "score": 10,
            "author": "tzarek1998",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Staples and Whole Foods are more like half an hour I'd say, but it's pretty if you walk down benefit",
                    "score": 3,
                    "author": "roboraptor3000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I also completely forgot about the other Whole Foods near Eastside Marketplace, which is usually less crowded.\n\nBut again, I'm terrible with distances and time.",
                            "score": 1,
                            "author": "tzarek1998",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, I just know the approximate walk time from the staples/whole foods because I live not far from there and sometimes walk it, sometimes bus it (the bus ride does not take long at all)",
                                    "score": 1,
                                    "author": "roboraptor3000"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "ahh that's perfect. thank you for the detailed info, really appreciate it!",
                    "score": 2,
                    "author": "midnightchilling"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you for the info!",
                    "score": 1,
                    "author": "midnightchilling"
                }
            ]
        },
        {
            "level": 0,
            "comment": "imho CVS is overpriced. Walmart/Stop&amp;Shop is accessible by Brown on-call shuttles (it’s kinda like a free uber with a limited range for students, available in the evenings).",
            "score": 5,
            "author": "JahaCakes",
            "replies": [
                {
                    "level": 1,
                    "comment": "i will check that out! thanks for the info :)",
                    "score": 1,
                    "author": "midnightchilling"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There is a free brown shuttle service, all you have to do is call them",
            "score": 3,
            "author": "Isosothat",
            "replies": [
                {
                    "level": 1,
                    "comment": "that sounds great, will do!",
                    "score": 1,
                    "author": "midnightchilling"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Also u can take the ripta basically right up to Walmart :)",
            "score": 2,
            "author": "kevinscremebrulee"
        },
        {
            "level": 0,
            "comment": "Its not too bad to walk to Walmart. Bring a buddy when walking to make the walk less boring.",
            "score": 1,
            "author": "Educational_Paper389"
        }
    ]
}