{
    "id": "pd2ta0",
    "score": 10,
    "title": "Brown University Desks",
    "author": "Low-Asparagus-5668",
    "date": 1630123140.0,
    "url": "https://www.reddit.com/r/BrownU/comments/pd2ta0",
    "media_urls": [],
    "other_urls": [],
    "postText": "How big are the provided desks at Brown University? For reference, I’m going to be a freshman in the Keenny Quad if the sizes vary. Thank you!",
    "comments": [
        {
            "level": 0,
            "comment": "Desk sizes are standard across all dorms. They have one medium sized drawer and space under for a garbage can (that is provided), and desk size was sufficient for me to put a laptop, lamp, and scatter my various notebooks. Had to switch between notebooks though when looking through stuff.\n\nI would just study in the libraries. John Hay is the one that has a Harry Potter feel; most of my humanities friends worked there. All the CS/math/engineering nerds go to Scili basement/3rd floor and B&amp;H engineering center",
            "score": 7,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "CS nerd chiming in — scili basement is neat, but the PCs down there don’t run Linux (nor do they have anything relevant on them for doing work), so if you need a department machine (e.g., no laptop), CS nerds grind in the CIT exclusively. I’d head to the scili basement if I had work that could be done locally though (or had math stuff, cuz the whiteboards in the side rooms are dope).",
                    "score": 4,
                    "author": "G0mega"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Should be standard size. If you move the bookshelf off of it, you can fit a comfortable amount of stuff. I was running a dual monitor setup with my PC and it didn't feel too cramped.",
            "score": 3,
            "author": "IntingPenguin",
            "replies": [
                {
                    "level": 1,
                    "comment": "What size monitors were you using? And what is the standard size?",
                    "score": 2,
                    "author": "Low-Asparagus-5668"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That would be \"Keeney Quad.\" Don't know the desk size though, sorry.",
            "score": -4,
            "author": "BitterStatus9"
        },
        {
            "level": 0,
            "comment": "I measured back when I lived in Keeney and I think the desks are around 40 inches long. Possibly a little less but definitely around 40",
            "score": 1,
            "author": "froggoroll",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "Low-Asparagus-5668"
                }
            ]
        }
    ]
}