{
    "id": "qf43m9",
    "score": 12,
    "title": "How do you report your GPA from Brown? (not Brown admissions related)",
    "author": "sr41489",
    "date": 1635118718.0,
    "url": "https://www.reddit.com/r/BrownU/comments/qf43m9",
    "media_urls": [],
    "other_urls": [
        "https://www.brown.edu/about/administration/registrar/academic-records/academic-transcript-legend)"
    ],
    "postText": "As we know, Brown hasn't been calculating GPAs on our transcripts for like 40 years or something, but I'm applying to grad school during this cycle and wanted to ask - have any alums had experienced reporting your grades and GPA to schools for applications? Brown provides a [legend](https://www.brown.edu/about/administration/registrar/academic-records/academic-transcript-legend) to calculate the number of units and whatnot, so I used that to calculate mine based on the 4.0 scale. I'm just worried that without the numeric value listed at all on my transcript, it will seem questionable plus my Brown GPA kinda helps offset some other weaknesses on my app, lol, so I really want to have this number on there!",
    "comments": [
        {
            "level": 0,
            "comment": "When I applied to grad school, I used the following scale: A = 4, B = 3, and C = 2, with each class being worth one credit. So for example, if you got half A’s and half B’s, your GPA would be 3.5. I doubt anyone will ask about this, but if they do, you can explain it.",
            "score": 15,
            "author": "footnote4",
            "replies": [
                {
                    "level": 1,
                    "comment": "Awesome I did that too! One of my classes was a 3-unit course but that had the “T” next to it and a legend indicating such value. I multiplied that grade by 3 (grad thesis credits) hopefully that’s clear for admissions committees!",
                    "score": 5,
                    "author": "sr41489"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I am sure there is websites online that allow you to input your scores and get the GPA. Have you tried that?",
            "score": 5,
            "author": "DontForget_SeasonTwo",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m not worried about my calculations being wrong, just that it’s not corroborated by an actual numerical value on the transcript, if that makes sense. My undergrad GPA from UC Irvine is clearly depicted at the bottom on my transcript, so I was just worried that admissions committees would consider it problematic. I might be too paranoid at this point lol I just really want to make sure I’m in a decent position for these apps! Ironically I’m not applying to Brown haha",
                    "score": 6,
                    "author": "sr41489",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You are not being paranoid. Don’t worry. I am guessing you did graduate in Brown then.",
                            "score": 4,
                            "author": "DontForget_SeasonTwo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes that’s right! Did my MS there and currently applying to PhD programs",
                                    "score": 3,
                                    "author": "sr41489"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ah wonderful, this is a huge relief! Thank you so much for the well wishes!",
                    "score": 2,
                    "author": "sr41489"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Any thoughts on how to factor in credits approved for transfer to Brown from other colleges? What about an S for an S/NC class?",
            "score": 2,
            "author": "2notarobot",
            "replies": [
                {
                    "level": 1,
                    "comment": "S/NC don't get counted for GPA purposes and T can be calculated based on the letter grade you got.",
                    "score": 1,
                    "author": "darknus823"
                }
            ]
        }
    ]
}