{
    "id": "r191e6",
    "score": 10,
    "title": "Brown vs Colorado Mines engineering",
    "author": "destrucity93",
    "date": 1637771341.0,
    "url": "https://www.reddit.com/r/BrownU/comments/r191e6",
    "media_urls": [],
    "other_urls": [],
    "postText": "Really conflicted between Brown and Colorado Mines.\n\n\nBrown is better known and better located but Mines has better specialized programs.\n\nAny suggestions?",
    "comments": [
        {
            "level": 0,
            "comment": "I suggest that you go to Brown.  With all due respect and love, the vast majority of high schoolers cannot predict what they will want to do when they graduate.  (I changed my path in between junior and senior year).  If you go to either Brown or Colorado Mines, and stick to whatever path you think you're on now, you'll do great and be happy.  But if you, like so many other people, decide that what you thought you wanted to do at 17 or 18 is not what you want to do for the rest of your life, you'll be far better positioned to switch it up if you go to Brown than if you go to Colorado School of the Mines.  A lot of life is about keeping doors open so you can have freedom to do what you want.  I think you close a lot more doors by going to Colorado Mines than Brown.\n\nGood luck!",
            "score": 30,
            "author": "MinimalistBruno"
        },
        {
            "level": 0,
            "comment": "Brown is really good for working in the Renewable Energy fields for sure. You could always go to Brown from undergrad and then to Colorado for Masters/PHD",
            "score": 8,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Brown is an Ivy",
            "score": 4,
            "author": "smookyvett"
        },
        {
            "level": 0,
            "comment": "Our engineering program is good, but is not the best... if you are serious about pursuing engineering you should probably go to a different school. Would note that our program is ABET certified tho",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "What do you want to study?",
            "score": 1,
            "author": "aurreco"
        },
        {
            "level": 0,
            "comment": "brown because brown is brown",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}