{
    "id": "ty2zvs",
    "score": 5,
    "title": "Northwestern vs Brown",
    "author": "Known_Reference7234",
    "date": 1649299279.0,
    "url": "https://www.reddit.com/r/BrownU/comments/ty2zvs",
    "media_urls": [],
    "other_urls": [],
    "postText": "If I want to study chemistry in uni and maybe go into research or pharmacology, should I choose Brown or Northwestern? I was thinking Brown but they are charging me international tax which is almost twice what I would pay for tuition because of the financial aid. Anyways I would love to hear some pros and cons of Brown compared to Northwestern.",
    "comments": [
        {
            "level": 0,
            "comment": "buggen if u pick northwestern 😂",
            "score": 3,
            "author": "lebronulous",
            "replies": [
                {
                    "level": 1,
                    "comment": "stuf ur fucking ranked 100th on qs world report so irrelevant internationally",
                    "score": 0,
                    "author": "Prior-Annual-1390"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Biggest plus for Brown that I always say is the availability of Research opportunities compared to other schools. Brown’s Grad school population is much smaller than other T20s, so there’s quite a few research opportunities open to undergraduates. Brown’s curriculum is also a huge plus, you’ll be able to explore all your fields of interest with little to no hassle. It’s grad school matriculation rates are also super high. \n\nI don’t know much about Northwestern, so I can’t provide much insight there. Do a couple of virtual tours to get a vibe of both campuses, and see which one you prefer. Evanston and Providence are very different locations that will offer different experiences, and your preference will definitely affect your decision.",
            "score": 3,
            "author": "Dysphicon_"
        },
        {
            "level": 0,
            "comment": "I have acquaintances at Northwest and spend some time around Brown personally. The cultures are wildly different. My impression is that Brown values work life balance and has more opportunities per researcher. There is palpably less stress on the campus. They have fun free small conferences with high calibre niche experts. There's curiosity. Researchers are very serious but also playful. I have friends who are early career researchers/faculty at Brown, and they like their jobs...and they're minorities. The worst I hear from them about their institution is occasional administrative bullshit. \n\nI get the impression NW is competitive to the point of cutthroat in some departments. I don't know the people there nearly as well, but they seem much more stressed. Chicago is a great city but they don't get to enjoy it. \n\nProvidence is damned gorgeous. Boston is a 40 minute nice train away. The weather is milder than Chicago. \n\nIt wouldn't even be a question for me.",
            "score": 2,
            "author": "52hertzGraham",
            "replies": [
                {
                    "level": 1,
                    "comment": "I actually go to NU and recently got admitted to brown for grad school, so here’s my perspective of NU. NU doesn’t have a competitive environment in my experience, I would talk to someone from the chem department though because there are a few majors that that have a grind set kinda culture, which isn’t for everyone. Our subreddit is pretty active so if OP makes a post there, I’m sure someone will be willing to chat.\n\nAlso NU isn’t in Chicago, we’re actually fairly disconnected from it. It’s about an hour train ride to downtown, so we have more of a suburban vibe. The weather is also trash for like half the year. I’ve always had tonnes of free time to do whatever, which was also the case with some of my friends.",
                    "score": 1,
                    "author": "CasuaIMoron"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I actually almost did ED Northwestern (but EDd to brown at the last minute n somehow got in), so I know a fair amount about both schools. NU has pretty good research n is highly-ranked in every other field (including chemistry I think). There's plenty of research there. But I've heard the vibe is preppy n rather competitive there. Brown has plenty of research opportunities too n I'd expect it'd be somewhat easier to get them here, also because you aren't competing with grad students for them. Because of the open curriculum, it's also easy to try different classes and change majors at Brown, tho NU is pretty flexible in that regard too. Brown follows the semester system, which I really like; NU's quarter system seems fast-paced, stressful, n not worth it to me, but again, think about what pace you'd vibe with. And of course, look at where you fit with the campus cultures and locations of both schools too. Congrats on getting into both as an international needing financial aid, it's really impressive",
            "score": 1,
            "author": "mithrandir767"
        },
        {
            "level": 0,
            "comment": "From what I heard the chemistry department is a complete mess and all my friends that study it here are pretty miserable. That being said, Brown does let you do a 1 year Masters for Chemistry which may help with employment.",
            "score": 1,
            "author": "a_mall_llama"
        }
    ]
}