{
    "id": "u254m5",
    "score": 4,
    "title": "Need help with decision making. Got an admit to ScM CS for Fall 22.",
    "author": "scarheaded",
    "date": 1649786143.0,
    "url": "https://www.reddit.com/r/BrownU/comments/u254m5",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone, I got an acceptance to join Brown this Fall for ScM in CS. I am an international student(from India)  with 3 years of work-ex and am currently in a dilemma about whether to join Brown or Stony Brooks University. I am interested in Distributed Systems and Databases and I found the course structure at Brown quite interesting. My current inclination is toward industry but I do not want to have doors closed for any future Ph.D. plans. Can anyone help me with the few points below:\n\n1. *Batch Size:* Is batch size for ScM too low? I am not able to find many students on LinkedIn as compared to SBU. Also, what is the percentage of Indians (or Asians) if anyone has any idea about it?\n2. *Workload balance:* What is the normal workload during semesters? I have heard that the courses are tough. Are students able to concentrate well enough on courses while looking out for job opportunities?\n3. *Reputation for CS*: I have heard that Brown is not famous for its CS programs. If this is not true, are master's students given enough attention over bachelor's students. At my last university master's students were not given much attention.\n4. *Career*: How much do career opportunities at Brown help? Do master's students get good enough jobs.\n5. For systems track, how would you rate SBU against Brown if I do not have scholarships at both of these places, I am finding the coursework similar.\n\n&amp;#x200B;\n\nThanks.",
    "comments": [
        {
            "level": 0,
            "comment": "Can't really comment on (1), but can say that there are plenty of international Indian here for CS and similar. I think the Masters' program is mostly internationals. For (2), several of the graduate courses are stacked directly on top of an undergrad analogue; the undergrad courses are pretty straightforward, and their grad counterparts are generally just as manageable, though the end of the semester may be a bit more stressful than otherwise. Regarding (3), I would say that Brown's computer science *education* is exceptional. We aren't particularly highly ranking w.r.t. research -- though, lots of variables go into that, and the real answer is \"it depends on who you work with,\" as usual. The real research titans here are in the Applied Math department, if you care at all. Note that you can access the graduation/ job placement data online. Generally, I would describe the split with \"undergrads are coddled compared to the grad students\" in their courses; anecdotally the opposite is true with faculty. From their perspective, I'd be much more welcoming to a masters' student who knows things about what I do/ has some YOE than an undergrad trying to check the boxes to complete their gauntlet; in both cases, I expect to train them and have them for a year or two. With (4), it's what you make of it; nobody's going to hand you anything, obviously, but the name helps, and 40% or so of the alum I reach out to give me an hour of their time to chat about whatever. I know nothing of SBU for (5), but I do know that, overall, systems is a pretty generic, standard subject in CS, so it follows that required coursework is going to be very similar; elective offerings are going to be different based on funding and the faculty themselves. If you get more particular with your interests, you might get a better answer from someone here who knows more than me.",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}