{
    "id": "uhz2xk",
    "score": 20,
    "title": "Can we talk about terrible On-Call Shuttle experiences?",
    "author": "MojoThreeCents",
    "date": 1651640578.0,
    "url": "https://www.reddit.com/r/BrownU/comments/uhz2xk",
    "media_urls": [],
    "other_urls": [],
    "postText": "Literally the worst attitudes. Like what did we ever do to them as students?",
    "comments": [
        {
            "level": 0,
            "comment": "the brown on-call shuttle driver called me a bitch and shot my dog",
            "score": 29,
            "author": "Euroliis"
        },
        {
            "level": 0,
            "comment": "You sure you’re not just an asshole?",
            "score": 25,
            "author": "Load_Altruistic"
        },
        {
            "level": 0,
            "comment": "Yeah they've been kinda rude in my experience too",
            "score": 4,
            "author": "mithrandir767"
        },
        {
            "level": 0,
            "comment": "What I don't like is the inconsistency with the \"The shuttle is on the way please go right outside.\" message. Sometimes it means they're literally outside, sometimes it means they're 10 minutes away.\n\nAnd then when you wait for them to call you because of this, then in the first case (where they text you when they get there), they call and say \"You need to check your phone we've been outside for 5 minutes\". Okay, how am I supposed to know that though? I'm not gonna stand outside in the cold waiting for it to get there...",
            "score": 4,
            "author": "Iegalizecrack"
        },
        {
            "level": 0,
            "comment": "there was one time i was getting on the shuttle with a friend (who had called) and the driver was asking how many people and where we were going. given that i was the one entering the vehicle first &amp; my friend was behind me outside the shuttle, i answered for him. driver completely ignores me and keeps asking despite me answering again. it isn’t until my friend speaks up from outside that we get on with the drive. it felt terrible &amp; cried a bit idk i felt like shit just being completely ignored like that for no reason. mind u that was the only bad experience i had with on-call, usually it’s all good :)",
            "score": 2,
            "author": "animedumpling"
        }
    ]
}