{
    "id": "zjrhvv",
    "score": 1,
    "title": "didn't submit my CSS until today. how screwed am i?",
    "author": "[deleted]",
    "date": 1670830729.0,
    "url": "https://www.reddit.com/r/BrownU/comments/zjrhvv",
    "media_urls": [],
    "other_urls": [],
    "postText": "i'm an ED applicant. i was completely unaware of CSS and did not fill it out until today. however, i checked through some posts on here and it seems that other ED applicants were emailed if they were missing financial aid info?\n\nfor brown students that were accepted, have you experienced something similar? i'm not sure if this is indicative of an admissions decision bc my entire CSS was literally missing and they never asked abt it",
    "comments": [
        {
            "level": 0,
            "comment": "You’re fine!! I still haven’t even done my IDOC. Since Brown meets all need, there will be no penalties to your aid no matter when you turn it in. You probably just will receive you financial aid after your admission decision.",
            "score": 7,
            "author": "cristaacqua",
            "replies": [
                {
                    "level": 1,
                    "comment": "Cries in international",
                    "score": 2,
                    "author": "Godwithagodcomplex"
                },
                {
                    "level": 1,
                    "comment": "thank you!",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would say it's pretty close to a doomsday scenario. You are done.",
            "score": 0,
            "author": "Overall-Divide-2289",
            "replies": [
                {
                    "level": 1,
                    "comment": "…? i don’t understand why you have to overdramatize the wording. i emailed the financial aid office, they said that there’s no hard deadline for the financial aid and that this wasn’t indicative of any decision.",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A simple Google search would have given you the same answer. So, my sarcasm was meant to feed into your perceived sense of doom, forcing you to find the answer instead of having it given to you. We all learn better under a little pressure and when we actually do the work.",
                            "score": 4,
                            "author": "Overall-Divide-2289"
                        }
                    ]
                }
            ]
        }
    ]
}