{
    "id": "zvghz9",
    "score": 11,
    "title": "Asking for some advice from Brown post grads working in UI/UX :)",
    "author": "cellphone16",
    "date": 1672034467.0,
    "url": "https://www.reddit.com/r/BrownU/comments/zvghz9",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi Brown Alum!\n\nI’m just popping in here to gauge some advice from recent Brown post grads :) A little background on me: I’m currently an undergraduate sophomore, and I was at the University of California, San Diego studying cognitive science and computing arts for my first year. Midway through, I became really intrigued by not only design but the prospect of ethics in the tech industry, and was accepted to Brown as a transfer, which is where I am now!\n\nBoth are great schools, but they’re each offering me something different, and I’d love some input from designers who have recently gone through the hiring process or have been working for a while on what they feel is most valuable for the field.\n\nIn the courses I’ve taken (which range from the philosophy to cognitive science to computer science departments), Brown seems to be quite theoretical, which I understood even coming in, as it was necessary for ethics. But my main concern with Brown is the lack of resources for design and HCI, let alone UI/UX, and if it is, it’s quite heavy on programming. I know computer science at Brown is pretty well-represented, particularly for visual computing (?), but that rigor of computer science isn't necessarily what I'm looking for (?).  The classes are interesting and span a wide breadth, and I feel grateful to be able to learn about all these new things outside my comfort zone, but I’ve found myself feeling quite tired from taking classes that, albeit interesting, don’t exactly allow me to work hands on, and that creeping exhaustion seems to inhibit my productivity for outside passion projects and preparing portfolios for the industry.\n\nI really enjoyed my time at UCSD, and felt it was the right amount of neuroscience, cognitive processing, and design instruction. I felt like my academics and outside passions merged into one, and the fuel I got from my classes helped me proceed with my personal projects. When I transferred out of UCSD, part of the reason was that I was a little scared of being just another designer or another programmer produced by a “factory,” and I left in favor of the greater undergraduate attention Brown prides itself for. Now though, I really miss the work I did there, and I have the opportunity to return either next semester or next year. I was, however, a little concerned on the specificity of the technical aspect. Am I being too short sighted for wanting to learn technical things? Does the lack of breadth make me less valuable across fields, in case I did want to switch out of UI/UX?\n\nUCSD lets me return to their studies, so I was just posting to really gauge what’s valuable in the actual UI/UX field. It’s unrealistic to expect design to just be about prototyping on Figma, so I just wanted to ask Brown grads, how well do you think Brown prepared you for the UI/UX field, especially it being so new, and what specific skills/outlooks did you gain from Brown that enabled you to succeed, or even hindered you?\n\nAny other advice is welcome, and thank you so much again for reading this monster of a post, haha!",
    "comments": [
        {
            "level": 0,
            "comment": "Bruh.. I was literally talking ab this last night with another transfer. Brown is super theoretical, so it’s harder to jump into a technical job straight out of Brown and know what’s up.\n\nI’m not CS, but the company I interned at this summer had a UX team. None of them majored in pure CS. The manager was an artist who self-taught himself UX. Two of them had a bachelors in UX (including one who got his ScB in ChemE from Brown a long time ago), and the intern was an art/engineering design/psychology student.\n\nI thought the fact that none of them were CS majors was a good thing because “how the hell is someone supposed to code this?” wasn’t on their minds whenever they wrote parameters/deliverables for the software developers, just their research.",
            "score": 2,
            "author": "RxnPlumber",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think most people experience this, in just about every field in college.  My thinking has always been to stay where I feel the most uncomfortable…as long as I see a path.  \nI’m sure no matter what you decide you’ll be fine. Especially given the field has opened up….truth is we need all types of people in tech now. Even ones who have zero college credit hours.  Truth is we all “think” differently &amp; that’s ok! Good luck.",
                    "score": 1,
                    "author": "FlanVivid3299"
                }
            ]
        }
    ]
}