{
    "id": "106iddr",
    "score": 0,
    "title": "Best Bars for Clemson Football Games",
    "author": "Saturday_Bar_Hunt",
    "date": 1673181798.0,
    "url": "https://www.reddit.com/r/Clemson/comments/106iddr",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello all,\n\nI am writing this post as I am wanting to gather some information as it pertains to best bars on campuses around the nation to create a website so college football fans know where the best bars are at for their favorite college football team.\n\nBelow are some questions I am looking for a response?\n\nBest pregame bar before Clemson football games? Why is it the best pregame bar?\n\nBest bar to watch Clemson football games? Why is it the best watch party bar?\n\nBest postgame bar after Clemson football games? Why is it the best post game bar?\n\nAny information is extremely helpful and appreciated. I can’t wait to see some of the responses.\n\nThank you",
    "comments": [
        {
            "level": 0,
            "comment": "A brief rundown:\n\nItsurweiner: young crowd, mostly fruity drinks, not the most crowded, pretty good food, just added a “beach” area \n\nBackstreets: find more beer drinkers, good food, upstairs has tables and often an event (live band, trivia) going on, downstairs is standing, not the craziest but usually busy \n\nTiger Town Tavern (TTT): your classic college bar with pool, punching bags, pretty good music, classic bar food, gets very crowded with mainly students, a great place to watch the game \n\nStudy Hall: the most club-ish one, where you’ll find the frat guys and sorority girls, dance floor downstairs, outside upstairs (haven’t been here much tbh)\n\n356: it wants to be a club. sushi restaurant during the day, bar at night, never really busy, not too sure about drinks but i think more liquor, overall ok (only been once)\n\nCharleston Sports Pub: mainly a restaurant, somewhere you can probably go sit down and have a drink, a bit more expensive, not crazy, attracts more parents trying to eat and drink \n\nTD’s: good food, classic Clemson student bar, a bit more country, live music sometimes, good selection of drinks, small upstairs with tables, often can find a table but standing friday and saturday nights \n\nNick’s: the grad student / “professor” bar. great selection of drinks, classic bar food, not blaring music, a place to talk with your friends. it is small so once it gets busy it will be a bit packed \n\nLoose change: haven’t been inside when it’s a bar bc always looks packed but good energy, good food, sometimes live music \n\nMore information added to this and agreements/disagreements appreciated",
            "score": 19,
            "author": "lhird01",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sloan St Tavern: Just a small bar a guy owns for his drinking buddies. Only serves beer from tap for $1. Definitely not a gameday bar",
                    "score": 1,
                    "author": "BigBootyBimbos"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Backstreets always has the best gametime energy",
            "score": 18,
            "author": "rkrahoo"
        },
        {
            "level": 0,
            "comment": "Not answers to your specific questions, but: Esso is classic, TDs, TTT, and Loose Change. I graduated in 2011 and have only been back to bars a few times, so I am sure there are new places or better places.",
            "score": 10,
            "author": "ElVeeCee",
            "replies": [
                {
                    "level": 1,
                    "comment": "You would be mistaken. The classics are still the best. #unbiased",
                    "score": 7,
                    "author": "alternatiger",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not arguing that, just saying I'm not abreast on the GameDay bars like I used to be.",
                            "score": 3,
                            "author": "ElVeeCee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You are though bc they are still the best",
                                    "score": 2,
                                    "author": "tmt22459"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "TDs, Backstreets, Tiger Town Tavern, Loose Change.",
            "score": 2,
            "author": "Akakma"
        },
        {
            "level": 0,
            "comment": "TTT’s! Especially if you go the day before and get a membership to the upstairs bar. Smoking friendly upstairs with pool tables, TV’s and cheap PBR!",
            "score": 2,
            "author": "yunganxietyattak"
        },
        {
            "level": 0,
            "comment": "ttt",
            "score": 2,
            "author": "GardenAggravating171"
        },
        {
            "level": 0,
            "comment": "Esso is the classic game day bar.",
            "score": 1,
            "author": "eastATLient"
        },
        {
            "level": 0,
            "comment": "Walk-ons is brand new, in the old Astro theater. Good food and drinks, plenty of screens to watch, haven’t been on a game day but I’m sure it will be jumpin next season. \n\nOther than that TTT or Backstreets",
            "score": 1,
            "author": "Plantjutzu"
        }
    ]
}