{
    "id": "10x901y",
    "score": 0,
    "title": "Why does the library keep the lights on 24/7 despite no one being inside?",
    "author": "MSIwhy",
    "date": 1675886279.0,
    "url": "https://www.reddit.com/r/Clemson/comments/10x901y",
    "media_urls": [],
    "other_urls": [],
    "postText": "Are admins really that wasteful and vain that they'll kick out all students because they don't want to pay someone to watch them, but still keep all of the lights on so it looks nice?",
    "comments": [
        {
            "level": 0,
            "comment": "There's no cost savings in turning modern lighting off. It actually costs more money to turn them off and turn them back on. \n\nThe return to operating temperature costs more than just leaving them on for the few hours the library is \"closed\"",
            "score": 28,
            "author": "xterraadam",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep. Even if it would save a little bit of money on electricity costs (which are actually pretty minimal for LED and other modern light sources), the installation and management of a system to turn them on/off, or paying someone to turn them on/off would probably cost more (or break even) versus just leaving them on.\n\nHeck, 20 years ago my mom's boss did the math on turning fluorescent tubes on and off. The act of turning on a fluorescent tube consumed as much energy as just leaving it running for an hour. The technology has only gotten more efficient since then.\n\nLike...of all the things to get mad at the administration about...leaving the light on in the library ticks you off?",
                    "score": 18,
                    "author": "TigerDeaconChemist",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not to mention that most failure happens during the power inrush from turning the lights on.",
                            "score": 3,
                            "author": "xterraadam"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; **Misconception #1**\n\n&gt; It takes more energy to start a fluorescent that it does to run it, so leave the lights on all the time to save money on your electric bill.\n\n&gt; **Reality**\n\n&gt; When you turn on a fluorescent light bulb (correctly called a \"lamp\"), there is a very brief jump in current when the ballast charges the cathodes and causes the lamp to start. This inrush of current can be many times greater than the normal operating current of the lamp. However, the spike of current draw normally lasts no longer than 1/10th of a second, and draws the equivalent of about 5 seconds of normal operation. So, if you turn your fluorescent lamp off and on more frequently than every 5 seconds, you will use more power than normal. So, normal switching of fluorescent lamps has very, very, very little effect on a power bill.\n\nhttps://www.lightingdesignlab.com/resources/articles/articles-lighting-fundamentals/should-i-turn-fluorescent-lights-when-leaving-room",
                            "score": 2,
                            "author": "chaud",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I stand corrected on fluorescent lights. Still, doesn't negate the fact that keeping the lights on is not particularly wasteful.",
                                    "score": 1,
                                    "author": "TigerDeaconChemist"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "They’re a climate freak looking for something to cry about",
                            "score": -6,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Motion sensor lights in a library would have the same effect as in a bathroom but more disturbing.",
            "score": 28,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "You could just shut off the lights 5 minutes after close.",
                    "score": 3,
                    "author": "MSIwhy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh, I thought you were talk about when it was still open. My only other guess is safety for security officers, but motion sensors would be even better there. \n\nHonestly, admin doesn't get paid based on keeping costs down. They get paid for bringing in donations and keeping enrollment higher. Donors and prospective students are influenced by shiny things.",
                            "score": 14,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "In the grand scheme of things, the lights being on in the library is nothing when it comes to wasted resources. At least this waste isn’t useless or have any noticeable impact",
            "score": 11,
            "author": "iHadAnXbox1"
        },
        {
            "level": 0,
            "comment": "There's always someone in the library at all times. Last semester, me and my friends pulled an allnighter for a project, we worked from 10am to 9am of the subsequent day. Janitors come in at around 11pm and start cleaning the carpets etc till 4am in the morning and the library staff start their first shift at 5am in the morning, the pod staff came in at 8am and the Starbucks people come in even earlier. And if I'm not wrong, the lights are motion sensed.\n\nThey're closed for students, but there's always someone inside the library at all times.",
            "score": 11,
            "author": "vjdeep",
            "replies": [
                {
                    "level": 1,
                    "comment": "How’d y’all get to stay inside when it was closed?",
                    "score": 2,
                    "author": "pinknotes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It is open for 24 hours during finals week and the week before that",
                            "score": 1,
                            "author": "vjdeep",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Used to be 24 hours all the time. Maybe not weekends but I lived off campus at that time so I didn't use it then. I want to say it was then too. \n\nFriends told me stories of pulling all nighters in the library and napping on the tables. I'd just show up at 5am after they learned it enough to teach it to me and have them give me the rundown and answer my questions before the test. Oh the undergrad days... *precovid",
                                    "score": 3,
                                    "author": "pinkpnts"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Used to be open 24/7 so they probably just didn't feel like changing the lights cause the hours changed",
            "score": 9,
            "author": "Derpinsteen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wait it’s not 24/7 anymore? Man I’m getting old. I remember pulling all nighters all the time",
                    "score": 5,
                    "author": "LostinTigertown",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah this is news to me. I graduated in 2016 and I pulled many an all nighter in Cooper. I’ve slept on those couches down in the dungeon levels.",
                            "score": 1,
                            "author": "FailResorts",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As soon as COVID started, 24/7 has been stopped. And it seems to be permanent for years to come.",
                                    "score": 2,
                                    "author": "theDavidPC",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Holy shit.",
                                            "score": 1,
                                            "author": "FailResorts"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Clemson…. We keep the light on for ya",
            "score": 8,
            "author": "wakawah"
        },
        {
            "level": 0,
            "comment": "Typically buildings do that for safety reasons. Do they kick people out now? I spent many nights in the library when I was there.",
            "score": 3,
            "author": "TunaSafari25"
        },
        {
            "level": 0,
            "comment": "No one is inside? Or is there??",
            "score": 3,
            "author": "Red-eleven",
            "replies": [
                {
                    "level": 1,
                    "comment": "check the bottom floor. *someone’s always down there*",
                    "score": 1,
                    "author": "palexp"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not really that wasteful",
            "score": 3,
            "author": "thumpmenow"
        },
        {
            "level": 0,
            "comment": "Is this really all that you have to worry about?",
            "score": 2,
            "author": "Primary-Ad-9870"
        },
        {
            "level": 0,
            "comment": "the library used to be open 24 hours for students to swipe in, back before covid when it was a public library and during \"open hours\" we didnt need to swipe in. Maybe thats a part of the reason?? Not sure. One semester they kept that screen on the stadium on the whole fucking time, after they won in 2016.",
            "score": 1,
            "author": "communityoven"
        },
        {
            "level": 0,
            "comment": "Library used to be open 24/7 before Covid. Then they shut it down and blamed the decision on Covid. Now that they don’t care about Covid anymore, they still keep it shut down. \n\nAs for the lights, they must have not thought about that when they transitioned from 24/7 to what it is now.",
            "score": 1,
            "author": "Counter-Business"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -6,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lights really don’t use much power. Of all the hills to die on this sure is an odd one.",
                    "score": 0,
                    "author": "TunaSafari25"
                }
            ]
        }
    ]
}