{
    "id": "1161mih",
    "score": 0,
    "title": "admitted student!",
    "author": "spacebear15",
    "date": 1676781329.0,
    "url": "https://www.reddit.com/r/Clemson/comments/1161mih",
    "media_urls": [],
    "other_urls": [],
    "postText": "hi! i am from the midwest and am very nervous about the culture shock of the south. is there lots of racism, homophobia, over all extreme conservatism in the clemson community?? i love the school and campus and really would like to attend but am very nervous of the south!",
    "comments": [
        {
            "level": 0,
            "comment": "Well, as someone who gives tours, I could give you the corporate answer and say “everyone love everyone big Clemson family whatever,” but I’m not.\n\nDo racism and homophobia exist at Clemson? Yeah they do. But they do on every other college campus as well, and I believe Clemson does a great job of uplifting members of the LGBTQ+ community as well as members of many races when compared to many south east schools. \n\nYeah we are a majority white institution, but people with those violent views about other races and genders are less than &lt;1% of the the population. \n\nIn actuality, you’ll most likely love you experience at Clemson regardless of your background. The Clemson family is very loving of everyone, and you’ll always have a seat at the tailgate party. We bleed orange and purple, not hate.",
            "score": 10,
            "author": "bigryzenboy123"
        },
        {
            "level": 0,
            "comment": "as someone who has grown up in the south and been involved with clemson since i was little, questions like these can be really frustrating and hurtful as it continues to perpetuate the idea that the south is nothing but a bunch of backcountry rednecks who haven’t left the 50s (don’t get me wrong they exist but you would have to look for them). i’ve met a few people at clemson who will crack jokes about this aspect of the south and i don’t mind playing along the first or second time, but this attitude ultimately tells me that you haven’t taken the time to get to know a culture you are going to live in past whatever social media representation you have seen. racism, homophobia, and conservatism are everywhere in this country, so to automatically put that label exclusively on the south is narrow-minded. don’t get me wrong, i’ve heard some awful things said about women, LGBTQ+, (two groups i identify with) etc., (i haven’t heard anything racist, not to say it doesn’t happen i just only want to speak to my personal experiences), and you’re always going to have some kind of outrageous stunt from TPUSA (aka affirmative action bake sale - don’t get me started there). however, to ask about the ‘culture shock’ of the south and in the same breath put racism, homophobia, and extreme conservatism is quite frankly extremely rude to me. that is not southern culture, much less clemson’s.",
            "score": 5,
            "author": "bricekrispie03"
        },
        {
            "level": 0,
            "comment": "there will be some rough spots— people have hung junk from trees on holidays related to African Americans, some student organizations have said vicious stuff. but you’ll find a place here. plenty of orgs for students of color, events for queer students, etc. i’ve found both of these communities to be active and warm. daily life isn’t hostile. good luck &lt;3",
            "score": 2,
            "author": "kascxzs"
        },
        {
            "level": 0,
            "comment": "There are sometimes some crazies at the football games where guys outside the stadium will be preaching some absolutely insane stuff, and there's of course the typical conservative orgs (College Republicans, TPUSA), but overall its not much to be worried about other than seeing people upset once a month on social media over whatever controversial things those orgs are doing.",
            "score": 1,
            "author": "EffigyOfKhaos"
        },
        {
            "level": 0,
            "comment": "If you are worried then it is most likely that you will experience a tremendous culture shock. At Clemson you can feel the conservative energy in the environment. Will a person who is a minority experience racism? Probably not. Will there be people who hide their prejudice? YES. There will be a lot of people who will be nice to others because they have to not because they consider them as equals. If you are perceptive enough you can tell the difference between someone who is genuine and someone who is not. My advice will be to visit the campus before making a decision and get a good feel of the culture. \n\nAnd no, it isn't the same at every university. I left Clemson after one semester, and now I am extremely happy at the University of Maryland. DON'T GO TO A SCHOOL WHERE MOST PEOPLE THINK DIFFERENTLY THAN YOU. Most students at Clemson are smart but they are in-state students that grew up in places with a lack of cultural diversity. They have no clue of what having a truly inclusive university is like and as a result topics or comments related to race will come up often even if it is to show support. Here at UMD it is barely a topic, everyone is used to diversity and people don't talk about race issues or homophobia unless you belong to a club with that particular aim, or something significant happens that makes the news. Everyone is considered equal and THERE IS NO NEED TO CONSTANTLY REMIND EACH OTHER ABOUT IT, you can just feel a genuine inclusive energy. \n\nAnyways, I can only speak about my experience, for some people Clemson will be the perfect fit, definitely visit the campus first for a couple of days.",
            "score": 1,
            "author": "VeterinarianOrganic7"
        },
        {
            "level": 0,
            "comment": "The state of South Carolina is a culture shock.  Not really the school.  And I'm from the south, though I've lived out west in multiple states.",
            "score": 1,
            "author": "VZandt"
        },
        {
            "level": 0,
            "comment": "it all depends on who you surround yourself with . yes , it’s the south , and you might run into the people that you think you will . i had a roommate get hatecrimed on the lightsey bridge (called the f slur). thankfully that was the extent of it. however it’s not overbearing . it’s predominantly white but racism isn’t as big as transphobia / homophobia etc and even that isn’t as bad. there are pride events , parades , etc . you’ll love it here",
            "score": 1,
            "author": "kaiganaw4"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Any posts that are not befitting of a member of our fine university will be removed. This includes excessive foul language, racism/sexism and general internet tomfoolery. If you don't want google to display your post under a search of \"Clemson\", it doesn't belong here.",
                    "score": 1,
                    "author": "Clemson-ModTeam"
                },
                {
                    "level": 1,
                    "comment": "liberal left democrat was hilarious. thank you for sharing your view it really was very helpful :)",
                    "score": 0,
                    "author": "spacebear15"
                },
                {
                    "level": 1,
                    "comment": "As someone who goes here and has lived in SC for my entire life… you are entirely and completely mistaken.\n\nYou wear the South like an outfit without understanding the effect it and its intolerant culture have on the people who live here out of necessity and out of family belonging, not out of ‘aesthetic’ or personal pleasure. I won’t make any definitive assumptions about your identity, but I will ask whether you have considered whether the fact that the south has been nothing but friendly and hospitable to you is because its culture was specifically designed to accommodate people like you, not because it welcomes everyone.\n\nHarmful conservative culture is present in this state and especially in this part of the state. White kids raised on intolerant ideologies say horrible things to and about queer students and POC here all the time, and I hardly flinch at the college’s main republican organization condemning homosexuality or the thousandth confederate flag on someone’s rear windshield.\n\nTo OP, it is vital for your happiness that you understand the existence of such troubles at Clemson. They are actually, really present and among the deepest problems the University faces. Equally important for you to understand, though, is that this university has a vibrant and accepting campus community that represents pretty much the same level of acceptance and understanding you can expect at any college. The actual body of students and professors are, more often than not, some of the most understanding and encouraging people you will meet. The collection of multicultural clubs and organizations, including numerous racial, ethnic, and LGBTQ-oriented organizations, are some great examples of those communities fighting for universal acceptance at Clemson.\n\nI am a queer student, and many of my friends, including my partner, are students of color. We have not personally experienced aggression from intolerant people, so for the most part I would say that Clemson is a safe place to be in terms of those identities, but I have certainly met people who have had more negative experiences with intolerance on campus, and I’d be lying if I said that I haven’t shared words with some people who very publicly have voiced that they didn’t want me or my friends around.\n\nHowever, if you want to come here, you definitely should. There are struggles here, like anywhere else, but the community here and almost everyone I’ve ever met, even those heavily involved in more “conservative” campus cultures, like Greek Life or in-depth sports involvement, have been overwhelmingly pleasant and accepting people. Coming here over the other colleges on my list has been one of the highlights of my entire life, and the opportunities for involvement here are deep and fulfilling.\n\nFinally, to Thoth, who I am replying to, please understand that the happiness and life experience of EVERYONE you know who doesn’t look and act like you do is gained in spite of conservative southern culture, not because of it. The south is inherently intolerant, a fact which places like Clemson are slowly starting to break, but ideologies like yours are the primary factor holding us back. I beg that for yourself and anyone close to you effected by intolerance and hate, you can reassess this viewpoint.",
                    "score": 0,
                    "author": "nottooutmyselfbut",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am glad to see another intelligent and unbiased comment here! Hope whoever posted this threat see both our comments and becomes more capable of making an educated decision :)",
                            "score": 2,
                            "author": "VeterinarianOrganic7"
                        }
                    ]
                }
            ]
        }
    ]
}