{
    "id": "116ksrt",
    "score": 8,
    "title": "Housing Off-Campus - The Lofts",
    "author": "Ominous_Aura",
    "date": 1676832963.0,
    "url": "https://www.reddit.com/r/Clemson/comments/116ksrt",
    "media_urls": [],
    "other_urls": [],
    "postText": "The reviews on Google seem to be artificially high. I know they’re under new management and have recently upgraded the apartments. \n\nDoes anyone have personal experience living there, especially under new management?\n\nIf not, does anyone have any other off-campus suggestions?",
    "comments": [
        {
            "level": 0,
            "comment": "i was at the lofts last year and they were nice apartments, the management was all good too i didnt have any complaints. bus route is right there and like you mentioned you can walk to campus pretty easily if needed. i wouldve stayed another year but just wanted to move closer to campus",
            "score": 4,
            "author": "andreeeeeeeee",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay, thanks for the information!",
                    "score": 1,
                    "author": "Ominous_Aura"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The flats or Crawford Falls would be my choices",
            "score": 3,
            "author": "Front-Organization17",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh, really? How come?",
                    "score": 1,
                    "author": "Ominous_Aura",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Flats- cheap very spacious, 3 bed 3 bath, the only issue is the distance away from campus, but that doesn't bother me. Never had an issue with anything.\n\nCrawford- it's kinda the same thing as the flats just closer to campus but a little more expensive.",
                            "score": 3,
                            "author": "Front-Organization17",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, the reason I was looking into the Lofts was because it was virtually within walking distance to campus. How much is Crawford Falls typically?",
                                    "score": 1,
                                    "author": "Ominous_Aura",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I paid 600 last year, but I'm not sure what it is now. That's also not factoring in when I was asking for an apartment.",
                                            "score": 3,
                                            "author": "Front-Organization17"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Where can I find housing that will allow me to bring my 11-year-old?  I have no idea where to start for fall housing and am getting worried.",
            "score": 1,
            "author": "OkShoulder9495",
            "replies": [
                {
                    "level": 1,
                    "comment": "A lot of the student apartments only allow one student per room. So you might have to look for places that don’t count as student housing. Other than that I’m not really sure :/ I know Clemson has an off-campus housing portal, maybe you could look there",
                    "score": 1,
                    "author": "Ominous_Aura",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Nothing for families, a bit disappointed with grad housing for not even helping. This is really a disappointing experience.",
                            "score": 1,
                            "author": "OkShoulder9495"
                        }
                    ]
                }
            ]
        }
    ]
}