{
    "id": "11zjpff",
    "score": 4,
    "title": "Former Clemson Student with issues logging into university gmail",
    "author": "PapaJohnyRoad",
    "date": 1679576500.0,
    "url": "https://www.reddit.com/r/Clemson/comments/11zjpff",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have some old emails I need to access in my @clemson.edu account but I forgot the password and when I try to change it I get a message saying I need to contact my administrator. \n\nAnyone know who I need to reach out to?",
    "comments": [
        {
            "level": 0,
            "comment": "Call ccit. I had to do this before. Just explain the situation and they’ll be able to help you reset it after your verify some info about yourself",
            "score": 12,
            "author": "jklaz"
        },
        {
            "level": 0,
            "comment": "Your @g.clemson.edu account lasts forever, your @clemson.edu will not",
            "score": 10,
            "author": "Grouchy-Purchase",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;Your @g.clemson.edu account lasts forever\n\nThis is no longer true. They are phasing out alumni email and storage because of the new pricing model from Google. Every account will be deleted by next July.\n\nCurrent students will also be migrated over to Exchange as well, but that has a slightly longer timeline.",
                    "score": 13,
                    "author": "tharvey11",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Welp that is unfortunate. July 2023 or July 2024?",
                            "score": 6,
                            "author": "Grouchy-Purchase",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "July 2024. I don't think it's been officially announced yet (other than the original announcement that it would end in October 2021, but they reached an agreement with Google to extend it) but I heard it straight from the CIO. They should be launching a big campaign to help people migrate any data pretty soon.",
                                    "score": 7,
                                    "author": "tharvey11"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}