{
    "id": "120qvtq",
    "score": 8,
    "title": "Where do yall guys cut your hair at?",
    "author": "vjdeep",
    "date": 1679677796.0,
    "url": "https://www.reddit.com/r/Clemson/comments/120qvtq",
    "media_urls": [],
    "other_urls": [],
    "postText": "pardon me if this is a weird question, I'm new to the place. I have this fear of hairdressers and barbers, I tried great clips and it wasn't that great. Do you guys have any recommendation for hair stylists for men?",
    "comments": [
        {
            "level": 0,
            "comment": "Highly recommend Clemson Hair Art next to Wall of Beer. Elizabeth is really wonderful and she’s one of the few stylists I’ll let touch my hair.",
            "score": 12,
            "author": "theyrecalledboobsed"
        },
        {
            "level": 0,
            "comment": "I went to old crow the other day for the first time and I think they did a pretty good job. It can be expensive tho $35 plus a tip if you leave one.",
            "score": 4,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "oof, $35 is a lot. how far away is it from campus?",
                    "score": 2,
                    "author": "vjdeep",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea it is, but I get haircuts maybe once a semester so it’s worth it imo. It’s only a couple miles off campus. Shouldn’t be more than like a 10 min drive.",
                            "score": 2,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Charles and Al’s need appointment \nCash only \nEasy walk from campus\nSolid haircut",
            "score": 2,
            "author": "Legal-Ad-2698"
        },
        {
            "level": 0,
            "comment": "I usually go to the bathroom.",
            "score": 2,
            "author": "goodcat1337",
            "replies": [
                {
                    "level": 1,
                    "comment": "Got any tips on how to start with self cutting?",
                    "score": 2,
                    "author": "vjdeep",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, I was kinda trolling. But, I bought an electric head shaver, a Remington. I always shave my head, and this takes way less time than using any kind of razor.",
                            "score": 0,
                            "author": "goodcat1337"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "In my hometown I normally only go to barbers because I have a little bit more trust in them, but honestly I haven’t had a bad experience with either great clips in clemson, they do a solid job for $15 + tip if you know what you want and tell them\n\nEdit: which great clips did you go to? I typically have better experience at the Bi-Lo over hartwell village",
            "score": 2,
            "author": "singleleg704"
        },
        {
            "level": 0,
            "comment": "Great clips in Anderson at Civic Center Blvd is great. They have wonderful reviews!",
            "score": 1,
            "author": "Great-Award-1453"
        },
        {
            "level": 0,
            "comment": "Ms. Etheredge at great clips does a good job.",
            "score": 1,
            "author": "mcduff1886"
        }
    ]
}