{
    "id": "1243t2f",
    "score": 2,
    "title": "Admitted 2023",
    "author": "Minimum_Lawyer_9514",
    "date": 1679957490.0,
    "url": "https://www.reddit.com/r/Clemson/comments/1243t2f",
    "media_urls": [],
    "other_urls": [],
    "postText": "Anyone who is a Preprofessional Health Studies major, can you tell me anything about it👀",
    "comments": [
        {
            "level": 0,
            "comment": "Find a medical advisor/teacher and talk to them. Most advisors aren't teachers and aren't well versed in what medicine actually needs. What my prof told me recently-you will need to do research that you spearheaded (not just doing lab work under a person). Dr. Vincent G is a very good person to go to for any info on this. \nPay attention in your anatomy classes, you'll see so many things related to it even further down the line.\nMake sure you have a major. I think (I may be wrong, cuz this is from when I came in) preprofessional is a route but not necessary a major? If it is a route, find a major asap. Good luck and congrats!",
            "score": 2,
            "author": "CactusToiletRoll",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much!! I appreciate it!",
                    "score": 1,
                    "author": "Minimum_Lawyer_9514"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don’t think declaring pre-professional health studies is that important. You still get access to all of the pre-med advisors, and you can still join AMSA, pre-dental club. It’s much more important to get involved in research early on. I would recommend after your freshman year seeking out a creative inquiry (CI) or talking with someone who publishes medically related research regularly. Dr. Vincent Gallicchio is a decent option, but he pretty much only wants to help people who do a health mission trip or join his clinical applications of medicine course. \n\nFind out what kind of professional school you want to attend and look at course prerequisites. You basically can’t go wrong with BioSci.\n\nIf you want any additional help/have questions feel free to DM me. I’ve been there and felt overwhelmed during that process so I understand.",
            "score": 2,
            "author": "LevelCarry7023",
            "replies": [
                {
                    "level": 1,
                    "comment": "To add to this: the premed advisor when I was student (17-20), was absolutely useless",
                    "score": 2,
                    "author": "LevelCarry7023"
                }
            ]
        }
    ]
}