{
    "id": "12i9a2d",
    "score": 12,
    "title": "Driving lessons",
    "author": "AsterTheDisaster1",
    "date": 1681189746.0,
    "url": "https://www.reddit.com/r/Clemson/comments/12i9a2d",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi so I still don't know how to drive (had a lot of car trauma stuff)  and I desperately need to learn. Has any other student found any driving lessons programs around the area? I have heard some will come pick you up? Are there any reccomendations? I need a legit program not just random person.",
    "comments": [
        {
            "level": 0,
            "comment": "The **Ables family** has had a [**local driving school**](https://www.ablesdrivinginstruction.com/classes) for years.  Mr. Ables is the husband of my first supervisor when I started working for Clemson.  His son works with him, and they are both very kind.  The family is well-liked by locals.\n\nMy son (now a student) went to the Ables driving school a few years ago.  I knew about it because it was my former boss' family business, and it was recommended at Daniel High School (serves the Clemson area).  I definitely recommend the Ables driving school.\n\nThere's a class coming up on April 29 here in Clemson at the East Clemson Baptist Church.",
            "score": 10,
            "author": "CostcoVodkaFancier",
            "replies": [
                {
                    "level": 1,
                    "comment": "I also took Ables about 5 years ago!! He's amazing and their rule is if you don't pass the driving test, they'll keep working with you/let you use their car for the test if desired",
                    "score": 3,
                    "author": "Fire284",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I didn't know about that rule.  That's pretty cool!",
                            "score": 1,
                            "author": "CostcoVodkaFancier",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It definitely helped calm a bunch of anxious high schoolers about \"what happens if I fail?!?!!\" They mightve changed it by now though.",
                                    "score": 2,
                                    "author": "Fire284"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I also recommend Ables. He is the one who helped me pass my test 15 years ago.",
                    "score": 2,
                    "author": "kristenl0522"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Calling the local DMV may yield some area resources!",
            "score": 2,
            "author": "Crim7860"
        },
        {
            "level": 0,
            "comment": "Tri-County Tech does it. Cat bus goes there.",
            "score": 2,
            "author": "29678"
        }
    ]
}