{
    "id": "149g5fu",
    "score": 2,
    "title": "What is the best way to get to/from Atlanta Airport?",
    "author": "nikhil_raj3",
    "date": 1686769537.0,
    "url": "https://www.reddit.com/r/Clemson/comments/149g5fu",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, I will be coming to Atlanta on 4 or 5 July in the evening. What would be the best method to get to Clemson from ATL? I have been looking into one-way rental cars but there are not any options that I could find. Is there any bus service available? \n\nIf anyone is travelling on the same dates and can accommodate me, I will be grateful. I am willing to split the cost.",
    "comments": [
        {
            "level": 0,
            "comment": "There aren’t any great bus options. Greyhound runs from Atlanta to Anderson but it’s a miserable trip. If you can’t find a ride or a rental, the Amtrak train is a more enjoyable ride than the Greyhound and has a stop directly in Clemson.",
            "score": 5,
            "author": "DoxxicChange",
            "replies": [
                {
                    "level": 1,
                    "comment": "The only Amtrak train from Atlanta is at 11:45pm which drops to Clemson at around 2:30am.",
                    "score": 3,
                    "author": "nikhil_raj3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There aren’t any bus options. You can look into booking an airport shuttle or taking a Lyft which will be costly. People do take the Amtrak. \n\nA rental car should be possible though. I think I have done that once and then I dropped the car in Anderson (from there you will still need a ride back to Clemson).",
                            "score": 4,
                            "author": "drppr_"
                        },
                        {
                            "level": 2,
                            "comment": "Yes. And it’s never on time. \n\nA better option would be to fly into gsp not Atlanta.",
                            "score": 3,
                            "author": "MaggieNFredders"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Like others have said, I would fly into GSP. You could also do CLT (Charlotte Douglas) as the university does offer shuttles from CLT to Clemson, but I’m not sure if they run in the summer. If you want to keep your flight in ATL, Amtrak is the best option.",
            "score": 2,
            "author": "bigryzenboy123"
        }
    ]
}