{
    "id": "xqwy91",
    "score": 11,
    "title": "Is there a lost and found at the school?",
    "author": "Mysterious-Act9999",
    "date": 1664421802.0,
    "url": "https://www.reddit.com/r/Clemson/comments/xqwy91",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have lost a bag that I kept my lab equipment in for my chemistry class, I suspect I left it in either Schilleter Dining Hall or in Hunter Laboratory last Thursday. Is there any way to find it since it has been so long?\n\nEdit: found",
    "comments": [
        {
            "level": 0,
            "comment": "I think lost and found is on a building by building basis. Try going back to those places and ask if your bag was turned in.\n\nEdit: typo",
            "score": 23,
            "author": "tpenna219",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay i understand, i was really tired when I first read your comment!\n\nAll the buildings i went to said that they havent seen it and it wasnt turned in, ive also been to buildings that they said it could have been turned into. Ill keep looking into other places they suggested",
                    "score": 4,
                    "author": "Mysterious-Act9999",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No problem. Sorry you lost your bag. Hope you didn't lose anything valuable.",
                            "score": 2,
                            "author": "tpenna219"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Go to the building you suspect you lost it in and ask an administrator about lost items",
                            "score": 10,
                            "author": "SorryTrash4046"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Generally it’s building by building. You need to talk to the staff at Schilleter. Your TA/professor may know who to contact about finding someone to contact in Hunter.",
            "score": 10,
            "author": "juliatheslayer"
        },
        {
            "level": 0,
            "comment": "Contact the building security coordinator for each building. Make sure they know about it. \n\nhttps://cufacilities.sites.clemson.edu/services/bsc#list\n\nGood luck!",
            "score": 6,
            "author": "MaggieNFredders",
            "replies": [
                {
                    "level": 1,
                    "comment": "It worked! I guess I just talked to the wrong person this morning? Thank you for directing me to the right person!",
                    "score": 8,
                    "author": "Mysterious-Act9999",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s great! At least you got it back.",
                            "score": 5,
                            "author": "MaggieNFredders"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's called Craigslist",
            "score": -3,
            "author": "swineflugamesh"
        }
    ]
}