{
    "id": "xybd1n",
    "score": 12,
    "title": "Where to watch Premier League?",
    "author": "tommye312",
    "date": 1665179622.0,
    "url": "https://www.reddit.com/r/Clemson/comments/xybd1n",
    "media_urls": [],
    "other_urls": [],
    "postText": "Was wondering if there were any bars or restaurants around here that regularly showed premier league games? Haven’t found a spot yet so figured I’d ask here",
    "comments": [
        {
            "level": 0,
            "comment": "I’ve seen Charleston Sports Pub playing PL before",
            "score": 11,
            "author": "DrOrangeSlice"
        },
        {
            "level": 0,
            "comment": "I'd assume CSP like the other commenter said but you can also just request them to put it on at plenty of places.  When I worked downtown, we let customers change channels except for Clemson games and the owners' favorite team.",
            "score": 9,
            "author": "Firebeard3"
        },
        {
            "level": 0,
            "comment": "Check out soccer supporters of Clemson FB page",
            "score": 1,
            "author": "crushdaddy"
        },
        {
            "level": 0,
            "comment": "There is a club but when I msged owner got no response",
            "score": 1,
            "author": "cheezman88"
        },
        {
            "level": 0,
            "comment": "CSP and TD's are the two main places that the Soccer Supporters of Clemson group go to watch the games. If you're not a member of that, DM me and I'll add you to the group on Facebook.",
            "score": 1,
            "author": "tmmatth45"
        },
        {
            "level": 0,
            "comment": "Tds play some soccer games. I watched UCL final there. The problem is some games are 7.30 am and 10 am. Do they open at this time ?",
            "score": 1,
            "author": "almeldin"
        },
        {
            "level": 0,
            "comment": "Well I asked who your team is because it matters. Not sure why someone downvoted me. Anyway, Tottenham Hotspur supporters meet at Community Tap Trailside in The Commons by Unity Park. The official SC Tottenham supporters group helped them pay for NBC Pub Pass so they should be able to get all of the matches. Only reason I asked who your club is is because they only have 2 TVs in the place so if your club is playing at the same time as Spurs you may not be able to get it put on.",
            "score": 1,
            "author": "awall02208"
        },
        {
            "level": 0,
            "comment": "Who is your team?",
            "score": 0,
            "author": "awall02208"
        },
        {
            "level": 0,
            "comment": "Europe",
            "score": -1,
            "author": "CuteAppointment300"
        }
    ]
}