{
    "id": "zabxdw",
    "score": 29,
    "title": "Deffered from Clemson",
    "author": "FriendlyComedian2998",
    "date": 1669956808.0,
    "url": "https://www.reddit.com/r/Clemson/comments/zabxdw",
    "media_urls": [],
    "other_urls": [],
    "postText": "Anyone else get deffered? All my friends and I did, I have above a 4.0 and a 1530 I didn’t think this would happen😭",
    "comments": [
        {
            "level": 0,
            "comment": "Hey y’all! I know hearing back from schools (especially Clemson) can be a very exciting and stressful time. Please utilize the admissions megathread for this. It is pinned. Good luck to all the potential freshman and Go Tigers!",
            "score": 1,
            "author": "EnvironmentalWinter4"
        },
        {
            "level": 0,
            "comment": "1530 out of 1600 and you got deferred? Did you kill someone or something?",
            "score": 67,
            "author": "Skyagunsta21",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol the grade/test inflation on these things are real. \n\nNot saying folks don’t deserve to get in but at least make it believable.",
                    "score": 44,
                    "author": "SCClemson",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Brotha do you want pictures",
                            "score": 11,
                            "author": "FriendlyComedian2998"
                        },
                        {
                            "level": 2,
                            "comment": "Do you mean like people lie about their stats or that grade inflation makes a 4.0 less valuable? \n\n&amp;#x200B;\n\nI would agree with the second one (depending on the high schoo), but a 1530 is in the top couple percentile. It was in the 99 percentile when I scored it last year for both the national and user samples. \n\nNot going to lie though, colleges are finicky, I \\*could\\* see Clemson rejecting them depending on the rest of the application. Stats are nowhere near the end all be all.",
                            "score": 6,
                            "author": "VirusTimes"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nah idek my essay was good too my dads friend does admissions for Yale he read it and checked it for me",
                    "score": -6,
                    "author": "FriendlyComedian2998",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So why didn’t you apply there?",
                            "score": 7,
                            "author": "madelgadoreal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Bestie, you can apply to multiple schools. To just apply to schools like Yale would be a terrible idea, even if you have a really good application. The variance in college admissions is super high, and you need at least a couple schools you feel confident in that you will be accepted.  I applied to like 9-12 schools and that‘s normally kind of on the low end if you’re gunning to get into a top program. It’s not uncommon to apply to 20+ schools, with a full range of acceptance rates. The highest acceptance rate of a school I applied for was like 90% while the lowest was like 3-5%. \n\n&amp;#x200B;\n\nCost is also a factor. Clemson was like $30,000 a year cheaper than my favorite school I applied to and the favorite school I was accepted to.",
                                    "score": 8,
                                    "author": "VirusTimes"
                                },
                                {
                                    "level": 3,
                                    "comment": "Just because you can get into a good school doesn't mean you'll be able to pay for it.",
                                    "score": 6,
                                    "author": "xFearful425"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They’re saving space for transfers for the football team. /s",
            "score": 35,
            "author": "Dreamxr",
            "replies": [
                {
                    "level": 1,
                    "comment": "😂😂😂",
                    "score": 2,
                    "author": "RoroC3"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It’s kind of crazy, if u do a year of community college 30 credits, with only a 2.5 gpa, you will 100% get in , vs these people w perfect records not getting in",
            "score": 25,
            "author": "ImpressionFun2050",
            "replies": [
                {
                    "level": 1,
                    "comment": "May even save some $$$$",
                    "score": 7,
                    "author": "Knor614"
                },
                {
                    "level": 1,
                    "comment": "Well kinda, you're talking about the bridge program and you need to be accepted into the bridge program. Not every would-be transfer student gets in. \n\n\nAdmission through transferring is generally easier than admission out of HS though.",
                    "score": -3,
                    "author": "Skyagunsta21",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Was not part of bridge program, had 3.0 and instant acceptance, had some friends who had 2.6 and just went to tech school for a year and got accepted. I highly recommend people to just go to a tech school for a year (instead of even going through the bridge which is basically same costs as Clemson I believe- I may be wrong)",
                            "score": 8,
                            "author": "ImpressionFun2050",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's a good way to save money but it also can hurt socially. It can be hard to transition to a new school",
                                    "score": 7,
                                    "author": "Skyagunsta21",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah that is true as well, can be harder socially",
                                            "score": 2,
                                            "author": "ImpressionFun2050"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got deferred as well lol, out of state, 4.2/3.9, 6 APs, model un club officer, 4 year rugby starter, think EA is very favored towards in state",
            "score": 20,
            "author": "frodo-_-baggins",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m in state and have high stats, still got deferred along with all of my friends, including one with a 1600 sat score😭",
                    "score": 7,
                    "author": "Fantastic_Shower_173"
                },
                {
                    "level": 1,
                    "comment": "Yeah it must be we got regular decision tho that’s our time",
                    "score": 5,
                    "author": "FriendlyComedian2998"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Damn. Things have really changed",
            "score": 17,
            "author": "PapaJohnyRoad",
            "replies": [
                {
                    "level": 1,
                    "comment": "ya, back in 1999 I only needed a 1220 and a 3.1 and my acceptance came in less than 2 weeks after application.",
                    "score": 6,
                    "author": "Corbanis_Maximus"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lmao i got in with an 1180 superscored and a 3.2. How times have changed in the last 5 years",
            "score": 12,
            "author": "BSV_P",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lol lucky bastard",
                    "score": 4,
                    "author": "FriendlyComedian2998"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wouldn’t be surprised if you get deferred because Clemson knows they’re your safety school. They don’t want to admit people who likely won’t come to Clemson since it’d take the spot of someone who would",
            "score": 12,
            "author": "Vanxsquad"
        },
        {
            "level": 0,
            "comment": "My son got deferred; 4.0 and 1500",
            "score": 9,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Grades don’t matter as much it’s ur extracurricular n essays now.",
            "score": 6,
            "author": "Zorololz"
        },
        {
            "level": 0,
            "comment": "My son got was deferred and eventually got in off wait list. Don’t lose hope. Send them a letter or email and tell them it is your top choice.  That is what my son did and it worked.",
            "score": 7,
            "author": "Hawkeye____pierce"
        },
        {
            "level": 0,
            "comment": "Might not be the option you want but this is an option.  Clemson has a bridge program with tri county technical school.  You could apply for that and use that to get in.  One bonus is that you would get your core classes out of the way.",
            "score": 6,
            "author": "trouble6266"
        },
        {
            "level": 0,
            "comment": "I got deferred in 2019. Out of state tryin to get into engineering with a 3.9 unweighted GPA and a 1450. I wanted to go so bad I took a gap semester and boy did that fuck me. Best of luck. I liked Clemson but it was not worth it to alter my life that much. You’ll get the same thing at many other institutions.",
            "score": 4,
            "author": "InjectedPotato"
        },
        {
            "level": 0,
            "comment": "Seriously?!? In-state or OOS?",
            "score": 3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah OOS",
                    "score": 3,
                    "author": "FriendlyComedian2998",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What major did you go for?",
                            "score": 3,
                            "author": "i_wanna_get_stupid",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Business",
                                    "score": 5,
                                    "author": "FriendlyComedian2998",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That might be why. Business and engineering are the most popular majors. Usually packed out.",
                                            "score": 18,
                                            "author": "i_wanna_get_stupid",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah I guess but still",
                                                    "score": 1,
                                                    "author": "FriendlyComedian2998",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I wouldn’t worry about it. High chances you get in for regular decision.",
                                                            "score": 5,
                                                            "author": "i_wanna_get_stupid",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah hoping for that",
                                                                    "score": 3,
                                                                    "author": "FriendlyComedian2998"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Ahh well that’s a shitty (and overcrowded) major. You’re not as smart as your grades suggest 😂\n\nSeriously though, dude, you’re clearly a smart person, so before you let yourself down, don’t major in business. Just don’t do it. It’s not a real undergraduate discipline. There’s no science. No art really even if you think about it, from an undergraduates point of view anyway. \n\nIf you want to do that, get an MBA after you graduate and have job experience.",
                                            "score": 3,
                                            "author": "fantasticquestion",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thanks for the advice😂",
                                                    "score": 2,
                                                    "author": "FriendlyComedian2998"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Man sounds like you don't know what a business degree is. It's one of the most versatile degrees and and absolutely is a science. Across the board, it's a professional degree.",
                                                    "score": 3,
                                                    "author": "mscout226"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You are wrong here in so many ways...two in my family have business degrees and one has an arts degree. Guess who bought homes, and are making bank? Yeah, it isn't the sister with an arts degree. And guess who is currently getting a business degree-ding-ding-ding, me.",
                                                    "score": -2,
                                                    "author": "Broad-Staff5929"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 0,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I feel sure this kid will ultimately be accepted in the RD round, but dang admission has gotten so competitive.",
                            "score": 4,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I think it’s partly because of all of the COVID bullshit, I heard about a ton of people coming in with no required test scores. So I think we are probably near MAX capacity",
                                    "score": 3,
                                    "author": "Funny_Fee9377"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Stupid they deny you if you apply because they don't want to get rejected (if that really is the case). Seems like some petty relationship hahaha",
            "score": 3,
            "author": "22lava44"
        },
        {
            "level": 0,
            "comment": "I’m so confused by all the deferrals?? I literally got in with a 4.0 and a 1290 SAT which is pretty low compared to everyone who got deferred.",
            "score": 3,
            "author": "magicsandwhich",
            "replies": [
                {
                    "level": 1,
                    "comment": "IKR. I got in with a 1250 SAT. Are you IS or OOS? I live 25 mins to Clemson so I feel like that was a great factor for the admissions during the EA though ECs, essays, and special circumstances make a difference too. Seems like they didn’t have time to review most of OOS.",
                    "score": 2,
                    "author": "dilaelbi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m OOS actually! I had a lot of unique ECs and essays, which helped a lot. I also got in for engineering which is pretty selective.",
                            "score": 1,
                            "author": "magicsandwhich",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ooh nice good for you!",
                                    "score": 1,
                                    "author": "dilaelbi"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "With those numbers I’m sure you’ll land just fine somewhere else and get the education you need…you can always show up on game day for that experience",
            "score": 3,
            "author": "SmokedHamm"
        },
        {
            "level": 0,
            "comment": "that's odd. I have a 4.3 and a 30 ACT and I got in, out of state\n\nno APs but my school doesn't have them. I only have 2 language credits as well",
            "score": 2,
            "author": "Awstudios22",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah that is but congrats!",
                    "score": 2,
                    "author": "FriendlyComedian2998",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks! I’m sorry about your decision!",
                            "score": 2,
                            "author": "Awstudios22"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "For everyone talking about going as a deffered applicant. Do it. Get ALL OF YOUR COURSES pre-approved for Class Credit (not just units). Don't assume your Econ 101 from your local CC will give you credit for Clemson's Econ 101. \n\nSave yourself some cash - take those early classes at a fraction of the price.\n\nGo to Clemson for your Core classes that support your long term goals... take the other classes at a local CC at half the price.",
            "score": 2,
            "author": "slambie"
        },
        {
            "level": 0,
            "comment": "Clemson is def a safety school for you, which may be the reason for the deferrment, but that said you will definitely get in during regular decision. I applied last year late into December with similar stats, and got my acceptance letter within a few days.",
            "score": 2,
            "author": "EffigyOfKhaos"
        },
        {
            "level": 0,
            "comment": "Respectfully, why are you applying here?  Clemson's business program is nothing to write home about, chances are your in-state equivalent is just as good if not better.  Do yourself a favor and don't pay tens of thousands of dollars for something you could get in-state.",
            "score": 2,
            "author": "AdmiralRofl"
        },
        {
            "level": 0,
            "comment": "It seems like they only had time to review the applications of people who were in-state and some OOS. There are just so so many people who got deferred with incredible stats and ecs. Most of them will probably get in considering the relatively high acceptance rate of Clemson.",
            "score": 1,
            "author": "dilaelbi"
        },
        {
            "level": 0,
            "comment": "That affirmative action going crazy this year",
            "score": 1,
            "author": "Sjax4"
        },
        {
            "level": 0,
            "comment": "Why are u applying here lmao",
            "score": 0,
            "author": "cheezman88",
            "replies": [
                {
                    "level": 1,
                    "comment": "Seems fun",
                    "score": -2,
                    "author": "FriendlyComedian2998"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You’re applying to the wrong school. 1520 is the average freshman SAT score for Harvard or Yale. So with a 1530, Clemson should have not only accepted you, but thrown you a parade. \n\nI think the admissions office is telling you that you set your sights too low and you need to apply to Ivy League schools instead with a SAT score of 1530.",
            "score": -6,
            "author": "lostinthought15",
            "replies": [
                {
                    "level": 1,
                    "comment": "Those schools look at those stats as the bare minimum. You have to have a lot more going on than good academic scores.",
                    "score": 4,
                    "author": "Pr0N3wb"
                },
                {
                    "level": 1,
                    "comment": "Yeah ig lol I applied to some of those too but I actually still do wanna go to Clemson but thank you!",
                    "score": 3,
                    "author": "FriendlyComedian2998",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m wondering if they figured you were using Clemson as a safety and weren’t really interested in attending. Why didn’t you do ED?",
                            "score": 1,
                            "author": "Akakma"
                        }
                    ]
                }
            ]
        }
    ]
}