{
    "id": "n63xj4",
    "score": 11,
    "title": "Housing and Residents",
    "author": "HoomanInMars",
    "date": 1620295833.0,
    "url": "https://www.reddit.com/r/Grinnell/comments/n63xj4",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, an upcoming first year here. I have never been to Grinnell before so I have some questions about dorm rooms. Do first year students get to choose location of their rooms, halls by their preference? And there is this policy Gender-Inclusive Housing that allows students to choose a specific roommate. Is that totally true? If that is the case, it would be wholesome I",
    "comments": [
        {
            "level": 0,
            "comment": "Mostly you don’t get to choose your room or hall unless you select gender inclusive or no-substance. Then you will be given a room in one of the rooms in your selected type of hall.\nSelf governance is one of the core qualities of Grinnell which means if it’s midnight on Tuesday and someone on your floor is playing loud music you DON’T call security.\nYou person up and kindly ask the person or people to turn down the music.\nThis is the same for other things. If someone is smoking pot outside your room and you aren’t a fan, ask them if they can go somewhere else of if they can provide a damp towel to put under your door (with your permission).\nGrinnell is all about honestly and kindly asking people to remember the people around the and to remember the people around you.\nI was a student advisor and I always told my first years that self governance was all about respecting yourself (not harming yourself), respecting others (not harming others) and respecting property (don’t punch out windows).\nWhen students are respectful there are many fewer silly rules.",
            "score": 4,
            "author": "IonicPenguin"
        },
        {
            "level": 0,
            "comment": "Yes to everything",
            "score": 2,
            "author": "hypnos1620"
        }
    ]
}