{
    "id": "oxrqm8",
    "score": 13,
    "title": "What to expect for an AO Interview😫",
    "author": "Myeonmeows",
    "date": 1628080517.0,
    "url": "https://www.reddit.com/r/Grinnell/comments/oxrqm8",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m sorry for asking admission stuff in this sub but this is my first interview so I’m really nervous 😭 I’ve went through the entire A2C sub and couldn’t find any post about Grinnell interview question :(\n\nWhat questions do AO’s normally ask???",
    "comments": [
        {
            "level": 0,
            "comment": "my interview was so nice and really not that stressful! I don’t remember exactly what questions my AO asked but we did talk about my favorite classes/teachers from high school, what majors I was interested in, and what drew me to Grinnell. There may have been one about what I liked/disliked about my high school. He also asked if I prefer cake or pie! It was more like a conversation than being interviewed really. Because you’re doing the interview before they get your application (I assume), they really just want to get to know you. This also means you can spend a lot of time talking about your extracurriculars and stuff and you won’t be telling them stuff they already know!\n\nFrom my experience, grinnell really likes students who really like grinnell. So be enthusiastic, smile, think of questions to ask, and don’t worry too much! Good luck!",
            "score": 7,
            "author": "jellastro",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you so much!!!!",
                    "score": 3,
                    "author": "Myeonmeows"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I worked as an intern at the admission office, and, while I did not conduct interviews myself, I believe I can give you some insights. The main purpose of the interview is not about academic, but to understand what type of person you are and what you add to the Grinnell community. The questions will likely be personal, maybe about favorite classes, projects, passions, why Grinnell, etc. If I could give very specific advice, if you have any particular passions, highlight them in the interview and make sure to be yourself! The process is quite laid back and is not meant to feel like an interrogation but more like a friendly conversation, so try to be formal but not too formal. \n\nAs someone else responded, be enthusiastic, smile, and ask questions. Remember, even though this is an interview to know what type of person you are, it is an opportunity for you to see if Grinnell is the right school for you. It is also one of the few instances where you will be able to ask either a current student intern or staff (many of which are Grinnell alumni) personal questions (so ask questions!).\n\nIn any case, try not to stress about it a lot, as it is not a large part of your application. Hope this helped and good luck!",
            "score": 5,
            "author": "ogEmu",
            "replies": [
                {
                    "level": 1,
                    "comment": "THANK YOU SO MUCH this was super helpful!!",
                    "score": 2,
                    "author": "Myeonmeows"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I just had my Grinnell interview yesterday, and I was asked these questions:\n\n1. How did Grinnell end up on your college list?\n\n2. How are you feeling in the application process?\n\n3. What are you interested in?\n\n4. How did you respond to challenges during the pandemic?\n\n5. How have you grown in the last few years?\n\nMy interviewer was really friendly and not at all intimidating. I wouldn’t stress about the interview at all…you got this!",
            "score": 2,
            "author": "OutlandishnessLegal1"
        },
        {
            "level": 0,
            "comment": "My flight to Iowa just got canceled and I'm going to miss my interview 😢. Grinnell is my top choice and I can't even visit there I'm literally so done.",
            "score": 1,
            "author": "IX_Green"
        }
    ]
}