{
    "id": "qwx5wz",
    "score": 2,
    "title": "submit a resume?",
    "author": "cosmojerk",
    "date": 1637262772.0,
    "url": "https://www.reddit.com/r/Grinnell/comments/qwx5wz",
    "media_urls": [],
    "other_urls": [],
    "postText": "Q1) I've submitted my ED I application to Grinnell. I have a resume ready with me to submit to colleges but it mostly is a repetition of what's in my application. while it explains in-depth about some of my ECs and also mentions 2 or 3 other ECs that aren't in my common app, other stuff in it is basically what's in my application... so do you think it's beneficial to submit my resume to Grinnell?\n\nQ2) I made a small mistake in my application that I realized after submitting it. If I submit my resume, it will clarify that mistake, however, if I don't submit my resume, is there any other way to clarify my mistake? ",
    "comments": [
        {
            "level": 0,
            "comment": "I think the resume wouldn't hurt but also would not make a significant difference. You can probably just contact any of the AOs about mistakes in your application.",
            "score": 2,
            "author": "IX_Green",
            "replies": [
                {
                    "level": 1,
                    "comment": "don't you think it's better to submit the resume if it discreetly corrects the mistake and does not harm my application rather than contacting the AO about a mistake?",
                    "score": 1,
                    "author": "cosmojerk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Like I said, it would help, but extra materials like that are usually just glanced over, given how many apps they have to go through. Go ahead and submit it, it can only help.",
                            "score": 1,
                            "author": "IX_Green",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "yes, I'll make sure to highlight imp points so that they read what is important.\n\nThanks, buddy! you a freshman at Grinnell?",
                                    "score": 2,
                                    "author": "cosmojerk",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm actually an ED1 applicant just like you haha... let's hope they take us both!",
                                            "score": 3,
                                            "author": "IX_Green",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "yess! all the best!",
                                                    "score": 2,
                                                    "author": "cosmojerk"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "any idea when they are releasing the decisions?",
            "score": 1,
            "author": "[deleted]"
        }
    ]
}