{
    "id": "ryydp2",
    "score": 5,
    "title": "Why tf is Grinnell being so silent ? And A few general Qs about the college",
    "author": "TheUCsimp",
    "date": 1641643369.0,
    "url": "https://www.reddit.com/r/Grinnell/comments/ryydp2",
    "media_urls": [],
    "other_urls": [],
    "postText": "Idk what it is but it's freaking me out I applied ED2 to Grinnell and although they've never bombarded me with emails I don't like the suspense and the eerie silence. I'm scared I'll get rejected just like my ED1 choice 😧😧\n\nNow, the Qs \n1) Does Grinnell have a good finance/ Econ department ? If anyone has taken some classes or have graduated y'all could answer.\n2) I really want to get into banking so does Grinnell have a good network in the finance industry ?\n3) How's the social life like there ? Are there good bars and restaurants around ? \n4) Is sports big there ? If not what is ?",
    "comments": [
        {
            "level": 0,
            "comment": "Hi! \n\nI am an intended econ major with an interest in finance, and although Grinnell doesn't have many classes in finance, Grinnell does a great job providing us with resources to learn more about finance such as the Harvard Business School CORe Program.\n\nSome of the profs in the economics department are incredible. I know some people may be disappointed with the intro, but I strongly suggest taking the second course in the major (lower 200 levels) because that's what sparked my interest in pursuing the major!  \n\nI'm not sure how Reddit works (it's my first time using it) but if there is a dm option, lemme know if you have any other questions :)",
            "score": 3,
            "author": "Ok_Wolverine_3068"
        },
        {
            "level": 0,
            "comment": "This is a bit late, but feel free to ask here or DM me about the econ department. I'm an econ and math double major, so I should be able to provide some answers to your question.",
            "score": 2,
            "author": "Candid_Possible_2679"
        },
        {
            "level": 0,
            "comment": "3 &amp; 4: Just no\n\nSocial life is mainly on campus parties + high street + the lil taverns in town like Rabbitt’s\n\nSports as in collegiate sports? Pretty popular option to attend games. But pro sports dear god no",
            "score": 1,
            "author": "melo-guy",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dang so what are the usual fun things y'all do ? Cuz I just found out there's no KFC nearby 😭",
                    "score": 1,
                    "author": "TheUCsimp"
                }
            ]
        }
    ]
}