{
    "id": "145i2r5",
    "score": 24,
    "title": "I switched to an economically pessimistic trading strategy and the universe started throwing money at me...",
    "author": "TheMightyThimble",
    "date": 1686347762.0,
    "url": "https://www.reddit.com/r/wallstreetbets/comments/145i2r5",
    "media_urls": [],
    "other_urls": [],
    "postText": "I've only been trading for a few years and up until recently I had always tried to catch stocks at lows and hold them until their highs and mostly just ended up holding a lot of bags. Buying shares and call options just doesn't work out in my favor 99% of the time. So I started doing the exact opposite and buying puts on stocks reaching all time highs after drastic single day jumps and after a week of doing this my portfolio has increased 4x and I'm finally at an all-time net gain for the first time since I started messing around with the stock market. It's hard to ignore the observations that stocks just generally go down more than they go up these days and the last week has cemented this observation in my mind as fact. I almost feel a little guilty betting on failure but it seems to be the only way to get ahead at all anymore.",
    "comments": [
        {
            "level": 0,
            "comment": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|7 months ago\n**Total Comments**|9|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&amp;subject=scan_comment&amp;message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&amp;subject=scan_submission&amp;message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)",
            "score": 1,
            "author": "VisualMod"
        },
        {
            "level": 0,
            "comment": "You know who else goes down…",
            "score": 24,
            "author": "Curious_Chessie1020",
            "replies": [
                {
                    "level": 1,
                    "comment": "OP behind the local Wendy's dumpster.",
                    "score": 19,
                    "author": "Random_Guy_47"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hope you haven’t tried this strategy on NVDA",
            "score": 18,
            "author": "80milesbad",
            "replies": [
                {
                    "level": 1,
                    "comment": "Id you shorted market open after earnings, youd be green for a few hours, hell you couldve shorted many times at the high and made money",
                    "score": 1,
                    "author": "BorochovA"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Works until it doesn't.",
            "score": 52,
            "author": "Moist_Lunch_5075"
        },
        {
            "level": 0,
            "comment": "I'm pretty sure you're just bad at picking stocks.",
            "score": 10,
            "author": "julian101801",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do the reverse of what you think, guaranteed 1 million % return",
                    "score": 5,
                    "author": "macrosquid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ah yes, the Costanza Method",
                            "score": 2,
                            "author": "73Shellder"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I understand what he’s saying, I don’t think he meant stocks generally go down more then they go up. But rather I think he’s saying stocks tend to dip down quickly after a big bull spike more than the opposite. Usually after something drops drastically it stays there a while and slowly builds back up. Thats atleast my experience.",
            "score": 7,
            "author": "Cool-Independent9926",
            "replies": [
                {
                    "level": 1,
                    "comment": "That is a better way of saying it than I was able to come up with at the time. Thank you.",
                    "score": 7,
                    "author": "TheMightyThimble"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I thought I found the golden goose trading the VIX, that worked until it didn't and this stupid pump has wiped out everything I previously made and more.\n\nIt could turn around fast but it hasn't happened yet.",
            "score": 3,
            "author": "Matt6453",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sounds like you were probably putting 100% of your portfolio into each trade lol",
                    "score": 3,
                    "author": "Illustrious_Tax4404"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;You're right, it is harder to make money by buying stocks and holding them for the long term these days. A lot of people have been burned by doing that in recent years. The key is to be nimble and take advantage of short-term opportunities when they present themselves. That's where puts can come in handy. By betting against stocks that are due for a fall, you can often make a tidy profit very quickly. Just be careful not to get too greedy or overleverage yourself, as markets can always turn around unexpectedly and leave you nursing heavy losses.",
            "score": 6,
            "author": "VisualMod",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why thank you for the insight, friendly bot. You have wonderful day.",
                    "score": 4,
                    "author": "TheMightyThimble"
                },
                {
                    "level": 1,
                    "comment": "Has anyone thought about opening an account for visualbot to play on Robinhood?",
                    "score": 4,
                    "author": "olearygreen"
                },
                {
                    "level": 1,
                    "comment": "How does one know that a stock is 'Due For A Fall'?\nthanks in advance 😊",
                    "score": 2,
                    "author": "Due_ortYum"
                },
                {
                    "level": 1,
                    "comment": "I'm still teaching my son to buy and hold. Every time I ever sold in the past, I've come to regret 2 decades later.\n\nJust the dividend alone would have been enough to justify holding.",
                    "score": 1,
                    "author": "StCreed"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can you let us know what stocks you're short right now? I trade a similar strategy on sectors.",
            "score": 2,
            "author": "banana_buddy"
        },
        {
            "level": 0,
            "comment": "Well see, your problem is that you're a m#ron and you convinced yourself you should apply your intellect to something you don't understand. \n\n&gt; I've only been trading for a few years and up until recently I had always tried to catch stocks at lows and hold them until their highs and mostly just ended up holding a lot of bags.\n\nTiming the market generally doesn't work. \n\n&gt; Buying shares and call options just doesn't work out in my favor 99% of the time.\n\nProbably because you're buying dumb shares and call options. \n\n&gt; It's hard to ignore the observations that stocks just generally go down more than they go up these days and the last week has cemented this observation in my mind as fact.\n\nExcept the historical reality is entirely the opposite. \n\n&gt; and the last week has cemented this observation in my mind as fact.\n\nGood. And cementing this trading strategy will make sure you eventually lose all of your temporary gains.",
            "score": 8,
            "author": "peterpanic32",
            "replies": [
                {
                    "level": 1,
                    "comment": "... why did you censor \"moron\"?",
                    "score": 51,
                    "author": "TheMightyThimble",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Best comment I have seen in years. Bravo",
                            "score": 10,
                            "author": "No-Currency7741"
                        },
                        {
                            "level": 2,
                            "comment": "flawless response",
                            "score": 7,
                            "author": "DRVK3R"
                        },
                        {
                            "level": 2,
                            "comment": "😅🤣🤣🤣",
                            "score": 7,
                            "author": "macrosquid"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh so you just buy low and sell high, got it got it I’ve been doing this all wrong",
            "score": 2,
            "author": "sQGNXXnkceeEfhm"
        },
        {
            "level": 0,
            "comment": "same last year. 3x inverse FTW!",
            "score": 1,
            "author": "Particular-Yogurt-21"
        },
        {
            "level": 0,
            "comment": "One week of gain  : « guys I’ve found how to make money it’s so simple »",
            "score": 1,
            "author": "ishouldworkatm",
            "replies": [
                {
                    "level": 1,
                    "comment": "One week of trading the same stocks with a different strategy that's offset years of losses in a week. This wasn't a single fluke of luck on a single transaction. If that were the case this would be more of a \"hit the jackpot\" gains-porn kind of post. Someone else here said I'm just shitty at picking stocks and in the classical sense they're quite correct. I didn't start picking 'better' stocks, I just started playing the ones I was familiar with differently and quit hoping for miraculous rebounds but rather spectacular corrections to drastic spikes, which seems to happen much more consistently.   \n\n\nI'm not saying I figured out any grand secrets or anything. Just found something that's working well for me (for now)",
                    "score": 5,
                    "author": "TheMightyThimble"
                }
            ]
        },
        {
            "level": 0,
            "comment": "One week of trading has ‘cemented’ a view? Hmm. Seems dangerous.",
            "score": 1,
            "author": "Glass_Mango_229"
        },
        {
            "level": 0,
            "comment": "So where’s your proof?  You might as well say -I look at my neighbors socks and if they’re green the markets up and if they’re red , it goes down.  🤮",
            "score": 1,
            "author": "HVB12345",
            "replies": [
                {
                    "level": 1,
                    "comment": "she doesn't ever wear any socks but ya pretty much",
                    "score": 1,
                    "author": "TheMightyThimble"
                }
            ]
        },
        {
            "level": 0,
            "comment": "OP, ignore all the salty replies. It sounds like  you have found a strategy that has won for you and may even continue to win for you for even longer. You've found a \"rhythm\" so to speak. Eventually it will stop working but until then just put a percentage of your gains into another account. Don't keep on rolling all your gains into the next trade. Each victory will make you more aggressive and make you wish you had been more ballsy - this is a trap that should be avoided, though. \n\nAs many mentioned there are some stocks (like Nvidia) that destroy even the smartest of bears.",
            "score": 1,
            "author": "Shakedaddy4x"
        },
        {
            "level": 0,
            "comment": "We technically have a hard time betting against a company we truly probably know very little about.  As a general retail investor.  I like your strategy \n\nHit the puts on the swing high!!  I’m lookin* for one tonight.  Thanks",
            "score": 1,
            "author": "Sudden-Shock-199"
        },
        {
            "level": 0,
            "comment": "key takeaways:\n\n\"after A WEEK of doing this\"\n\n\"stocks just generally go down more\"\n\n&amp;#x200B;\n\nnext.",
            "score": 0,
            "author": "Loightsout"
        }
    ]
}