{
    "id": "146oefm",
    "score": 903,
    "title": "Americans owe nearly $1 trillion in credit card debt—here's the breakdown by age",
    "author": "spiralstix",
    "date": 1686471827.0,
    "url": "https://www.reddit.com/r/wallstreetbets/comments/146oefm",
    "media_urls": [
        "https://www.cnbc.com/2023/06/09/how-much-credit-card-debt-americans-hold-by-age.html"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "OP what’s with the clickbait title at least share the chart. Credit card balance averages by age group:\n\nhttps://preview.redd.it/jpdtjh3fud5b1.jpeg?width=1170&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=353ae3206e1b8708f7d99e825dac7608be88e2db",
            "score": 1,
            "author": "ItsNotYourFault",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I pay my credit cards off every month. I am doing something wrong.",
            "score": 687,
            "author": "Dismal_Complaint2491",
            "replies": [
                {
                    "level": 1,
                    "comment": "Only thing you are doing wrong is posting here. \n\nWay too in control",
                    "score": 303,
                    "author": "ZeePirate",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I bought CVNA puts.",
                            "score": 85,
                            "author": "Dismal_Complaint2491",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "![img](emote|t5_2th52|29637)![img](emote|t5_2th52|12787)",
                                    "score": 36,
                                    "author": "iPigman"
                                },
                                {
                                    "level": 3,
                                    "comment": "I knew you had it in you.",
                                    "score": 3,
                                    "author": "Friendly-Airline2426"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same I paid mine off and only use it for gas and groceries then pay it off at the end of the month spent 10 years paying off 8k fuck credit cards and their interest rates",
                    "score": 89,
                    "author": "Ornery_Gene7682",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm careful to spend half on women and whiskey and the other half I just waste.",
                            "score": 31,
                            "author": "cranialrectumongus"
                        },
                        {
                            "level": 2,
                            "comment": "I got a call on my first day in college by Visa and had little self control. I spent my early 20's stressed out about $2k in cc debt from collectors. Finally paid off everything by my 30's. Now I pay off my balance every month. I'd rather starve than have that debt, especially at that interest rate. I'll take on debt over my dead body.",
                            "score": 17,
                            "author": "theheat715",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It took you ten years to pay two grand?",
                                    "score": 14,
                                    "author": "KingOfTheP4s",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Kind of a long story. I never had much money and always scraped by. It also took me longer to finish college, I went back to community college for two years and had to pay full out of pocket tuition for some time to get student aid back. It was a rather uphill battle but I got there.",
                                            "score": 5,
                                            "author": "theheat715",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You're in the right place here, you can trade options on margin",
                                                    "score": 10,
                                                    "author": "KingOfTheP4s"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I get 5% cash back on groceries and 3% back on gas… the right way to use credit cards is to have a black card so the poors who carry a balance are subsidizing your spending and lifestyle.",
                    "score": 61,
                    "author": "Affectionate_Cup9112",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Damn straight.",
                            "score": 11,
                            "author": "usernamesarehard1979"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No that's great. Do mine too.",
                    "score": 15,
                    "author": "amlyo"
                },
                {
                    "level": 1,
                    "comment": "I pay off credit card balances like these in the figure every month \n\nSo alternate title: Americans spend $12 trillion every year? I for one am shocked",
                    "score": 64,
                    "author": "Zaros262",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea does this article actually say these balances are carried over?\n\nThese cnbc \"articles\" are just advertisements",
                            "score": 24,
                            "author": "DoctorOzface",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It's almost like we are a consumer driven economy.",
                            "score": 38,
                            "author": "iPigman",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Almost like we drive the economy with our wants and our needs just keep people employed in safe sectors",
                                    "score": 21,
                                    "author": "xDubnine"
                                },
                                {
                                    "level": 3,
                                    "comment": "It's almost like we live in a capitalist country.",
                                    "score": 2,
                                    "author": "Ok_Nefariousness2090",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yeah I’m a bit confused, my bill last month was like $6k which is a bit higher than normal, but I pay it off every month like normal.",
                            "score": 13,
                            "author": "Modestkilla",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And they probably gave you $120 in rewards last month too",
                                    "score": 3,
                                    "author": "StewieGriffin26"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That’s what’s really scary. Think about what these averages would look like if you didn’t include all the people with zero or near-zero balances.",
                    "score": 38,
                    "author": "stoneman9284",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I feel like the credit rating firms either don’t correctly model or intentionally punish folks who churn expenses through their cards without paying interest.",
                            "score": 8,
                            "author": "ski-dad",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’ve paid off my credit card in full every month since I was 15 and I have a near perfect credit score. They pay me (cash back) not the other way around. If they’re trying to punish me it ain’t working.",
                                    "score": 13,
                                    "author": "FrostyDub"
                                },
                                {
                                    "level": 3,
                                    "comment": "No they reward it. Credit ratio matters a lot. I pay my card down to zero every month when the balance rolls over and is reported. I run every penny I can through my card for cash back/points. My credit score is at or near perfect at all times.\n\nNote: if you are just paying balance due you are still paying interest because of the way they sneakily apply it. It has to be zero.",
                                    "score": 1,
                                    "author": "peepeedog",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you’re paying it off every month, you would still have a balance until you pay it off. That’s included in these statistics too, not just people who don’t pay off fully every month.",
                    "score": 7,
                    "author": "Hemingway92"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 5,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you instead pay on the due date, that's an interest free loan for almost a month every month! With current HYSA around 4%, something to think about.",
                            "score": 13,
                            "author": "Environmental-Low792",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Paying off $1T credit card balance every month.  Mad respect.  You 3D printing those coins in your basement?",
                    "score": 5,
                    "author": "cranialrectumongus"
                },
                {
                    "level": 1,
                    "comment": "We are known by the credit card companies as \"deadbeats\". I always found that amusing.",
                    "score": 5,
                    "author": "wonderfulwilliam"
                },
                {
                    "level": 1,
                    "comment": "Just means you’re below average",
                    "score": 3,
                    "author": "ppenn777",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How did you know my penis size?",
                            "score": 2,
                            "author": "Dismal_Complaint2491"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That's how you do it, hack the CC companies for Cashback rewards. I put $15-25k on mine every month, and pay it off every month. I get charged zero interest, but every month I get a couple hundred bucks in cashback automatically. I particularly like the Fidelity card because it's so simple, it's 2% back and automatically splits that 50/50 into the kids 529 college savings accounts, so easy! My other favorite card is my Amazon card, just because we spend SO MUCH on Amazon (usually around $25k/yr), and it gives 5% cash back, and some items and some sales give 10% cash back.",
                    "score": 3,
                    "author": "ReddiGod",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wtf are you buying?",
                            "score": 9,
                            "author": "Dismal_Complaint2491",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Got every household expense put on auto charge CC. Got all my businesses costs on CC. And we eat out and travel a lot (a LOT).",
                                    "score": 1,
                                    "author": "ReddiGod"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Does that not mean your essentially a month in debt?",
                    "score": 2,
                    "author": "ElderberryCalm8591",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "https://preview.redd.it/muxv76r2we5b1.png?width=2532&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=fc154dff8cfc5f3f77d32e7be736f94797e79e8b",
                    "score": 3,
                    "author": "farfacogin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And it's gone",
                            "score": 2,
                            "author": "Realityistruth123"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We have reduced CC use by about 90% by switching to cash.\nNo cash, no purchase!\n\nYes, we do without, and yes, it requires a lot of personal discipline but we can see the results every week.\nFuck CCs",
                    "score": -14,
                    "author": "Transplantdude",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean…if you’re like the average American who are irresponsible with money and spending, otherwise you’re losing out on cash back and points",
                            "score": 34,
                            "author": "SubiWhale",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I went out to dinner Friday night with $200 in my wallet and I still use my credit card to pay for the meal.  If you have the discipline to only spend what you make then putting everything on a credit card and paying it off in full every month is a no-brainer.\n\nI have flown three times in the last 5 years using only reward miles and paying the taxes each time.  Round trip tickets for two = miles + $60 in taxes and fees each time.",
                                    "score": 16,
                                    "author": "ADynes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Exactly. As someone who flies between the US and Japan multiple times a year, I’ve never once paid full price for a ticket, only ever taxes.",
                                            "score": 7,
                                            "author": "SubiWhale",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Not to mention, with some travel cards, there are: lounge access, seat or class upgrades, better cancellation polices, flight delay insurance, \"free\" baggage check, hotel or resort upgrades and dining/experience credits , and even medivac insurance benefits.",
                                                    "score": 4,
                                                    "author": "iPigman"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Yes, we do without, and yes, it requires a lot of personal discipline but we can see the results every week. Fuck CCs\n\nI don't really get this. Do you buy less stuff when you see the cash leave your hands vs just swiping? Otherwise you'd come out ahead with CCs and cash-back.",
                            "score": 16,
                            "author": "9MMofFuckitol",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Plus the added protections that can come from CC's. The ability to charge-back for services or products that don't fulfill what was promised. Added warranty plans that come with some CC's. Cash Back or other forms of Reward Points.\n\nJust treat it like Cash and maintain discipline!",
                                    "score": 9,
                                    "author": "KodakDC"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yes.\nIt becomes more real when something leaves your hand and causes a reevaluation of the purchase",
                                    "score": 0,
                                    "author": "Transplantdude",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "People using cash getting downvoted lol. Budgets revolve around the use of money and having a physical, tangible account is much better than guessing and swiping.",
                                            "score": 5,
                                            "author": "nate68978263"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Plus, I want the points for chartering a plane to Vegas.  This cash shit is such a Gay Ramsey move.",
                                    "score": -1,
                                    "author": "iPigman"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You’re doing it wrong. I buy literally everything with card and pay it off every month. The credit card company pays me 3% on every purchase as cash back and then I pay them no interest.",
                            "score": 7,
                            "author": "Leafy0"
                        },
                        {
                            "level": 2,
                            "comment": "The mentality of a poor, doesn’t know how to use credit effectively so they demonize it",
                            "score": 4,
                            "author": "onGuardBro"
                        },
                        {
                            "level": 2,
                            "comment": "Lmao I’m glad that this is getting downvoted",
                            "score": 1,
                            "author": "NaNaNaNaNaNaNaNaNa65"
                        },
                        {
                            "level": 2,
                            "comment": "Always wanted to try this. I spend so much on bullshit just mindlessly swiping. Smooth brains here don’t understand you second guess spending 50 a pop on something dumb when pulling out the cash because they still have a gas card from mommy",
                            "score": -1,
                            "author": "jackjack95",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Managed to reduce debt to zero declutter all the retail crap, and put 6figures away doing this.\nI owe no one anymore.",
                                    "score": 2,
                                    "author": "Transplantdude"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same here, shit.",
                    "score": 1,
                    "author": "bangladeshi_atheist"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As I see the chart - correct me if I'm wrong - the average increase in debt is less than actual inflation.\n\nSo, imo: Nothing to see here.",
            "score": 38,
            "author": "Primary_Try_Feature",
            "replies": [
                {
                    "level": 1,
                    "comment": "Besides boomers, everyone’s debt went up about 20%. Higher than inflation. And with the ~20% interest rates on that additional debt, it looks real fucked, to me at least.",
                    "score": 2,
                    "author": "SayNoToBrooms"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So do these statistics show overdue debt or all? Cause when I travel for work I end up having 5k balances easily, but never had an overdue payment. Credit card balances may be up due to inflation and less use of cash, without indicating anything at all about robustness of the economy.",
            "score": 150,
            "author": "olearygreen",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think you’re right in that it’s ALL debt (like not over due, but like you said, you have $5k on the cc and the auto pay on-time date is still 3-weeks away (and of course that auto pay date was the previous months charges.)\n\nI think that because when I first refinanced in sept 2019, I was told by the refi company that I’d need to pay down completely all of the debt on on of my credit cards to get below their debt to income ratio  (only other debt was a then fresh $35k auto loan) to be approved for that low rate. I did, was approved and closed on the refi within a week.\n\nSo yes, this is a click-bait-y article that shows monthly revolving credit card use is up in line with inflation.",
                    "score": 19,
                    "author": "martman006"
                },
                {
                    "level": 1,
                    "comment": "Yes would be interesting to know because this being average means some people could just spend a whole lot buying luxury goods all the time and still pay it off at the end of the month resulting in no additional interest payment",
                    "score": 46,
                    "author": "WaltNak",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I moved my mortgage to another company for a better rate. They did a credit history and told me I have to pay off my credit card debt. I didn’t think I had any debt!\nI purchase everything on my credit card and pay off my bill every month. To the bank it looks like I have $1500 of credit card debt.\nI agree with your post that these numbers are slightly misleading.",
                    "score": 34,
                    "author": "Chance_Preparation_5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same. When we bought our house, the mortgage broker tried to tell us we’d need to stop using cards between approval and closing. We just told him lol not a chance.",
                            "score": 5,
                            "author": "ski-dad"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That’s called the delinquency rate and it’s actually super low. 2008 saw delinquency rates around ~8%, we’re sitting at ~2%.",
                    "score": 13,
                    "author": "wizardwusa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "is delinquency not missed payments? I think the original question was if this is for carryover balances. you can make payments on high amounts of credit card debt, which would make you not delinquent.",
                            "score": 8,
                            "author": "9yr0ld",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Overdue debt/payment implies to me missed payment. I guess the context he used it implies a carried balance. Idk, I’m but a lowly regarded.",
                                    "score": 4,
                                    "author": "wizardwusa",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Americans are the most well capitalized in history. If you didn't get all that stimulus/low rate juice you got fuckity fucked.",
                            "score": 3,
                            "author": "65210"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I pay off my credit cards each month too, but I don't travel for work and I'm paying off 1k max, not 6k.\n\nIf the numbers are inflated, as long as they are measuring the same thing, they are still showing relative differences - and the implied carry over balances at some percentage of the total.",
                    "score": 3,
                    "author": "BiscuitRampage",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Looks like it stayed about tye same in last 4 years, not sure what the fuzz",
                    "score": 2,
                    "author": "I_like_salads"
                }
            ]
        },
        {
            "level": 0,
            "comment": "$390 on my credit cards.. I'll never financially recover from this",
            "score": 23,
            "author": "helloimderek",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I’ve gotten pretty fucked up with credit cards lol but luckily my debt is under 8k, shit gets BAD for a lot of  people with higher limits",
            "score": 128,
            "author": "BadMon25",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ya for real some of these limits it’s just insane the credit card companies give you playing with fire.",
                    "score": 52,
                    "author": "emconite",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's the whole point. A lot of people are not financially responsible and almost each one of us at some point do make impulse purchases. Waking up one day and feeling like you really need item #36 that just got released to be truly happy. Then spend the entire year paying it off. \n\nThey made the \"buy\" button easy to press and we press it.",
                            "score": 73,
                            "author": "EdliA",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’ve always thought of consumerism as a game, when you spend they win, if you can hold on to your money you win.",
                                    "score": 41,
                                    "author": "420Secured",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Bingo",
                                            "score": 2,
                                            "author": "Sweet717"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think they do it on purpose so you will go into debt and have to pay them an insane amount of interest",
                            "score": 21,
                            "author": "WiIIworkforfood",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I’m 21 with a combined(4 cards) limit of almost 30k. I use them responsibly but I never asked for credit limit increases",
                            "score": 7,
                            "author": "iFunnyAnthony",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If you have even the slightest bit of self control you should get limit increases. Assuming your spending doesn't change your credit utilization ratio will go down, which improves your credit rating for the day you actually need a lot of credit (i.e., a mortgage)",
                                    "score": 10,
                                    "author": "WACS_On",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I dont buy anything extra, ever. I've only ever got 1 limit increase, from $500 to $2k.\n\nI don't answer if they ask about income or anything though so maybe thats why.",
                                            "score": 2,
                                            "author": "iHater23",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Regardless of this, you should increase your limit if you want to decrease your overall credit utilization. This will raise your credit score.",
                                                    "score": 3,
                                                    "author": "kozzmo1"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Why doesn't everyone just default all at once? They can't jail everyone. Just max out credit card, buy magic internet money, sell for cash, deposit into Robinhood, buy NVDA 6/15 400C. If you win you win, if you lose just declare bankruptcy. Literally free money",
                    "score": 21,
                    "author": "NvidiaRTX",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You don’t go to jail for credit card debt anyway. Anyone who wants to default on it can do so with few consequences other than having shitty credit.",
                            "score": 28,
                            "author": "originalusername__",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Only thing that sucked about having bad credit was not being able to get a mortgage. \n\nThat was in my 20s. \n\nNow I have perfect credit and don’t even need it …\nI own my house and cars so like, what do I need credit for ? Could easily max out my cards and never pay and I’m not sure what repercussions there would be.",
                                    "score": 9,
                                    "author": "MuzzyIsMe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It would just be a hassle of collectors, possible court summons, garnished wages, etc. but not jail.",
                                            "score": 12,
                                            "author": "originalusername__"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Get a cash back or other points card, pay off monthly to avoid interest charges and make the credit company pay you for the privilege.",
                                            "score": 6,
                                            "author": "Deadeye313",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Home boy here thinking debtor prisons still exist like it's the year 1700",
                            "score": 4,
                            "author": "WACS_On"
                        },
                        {
                            "level": 2,
                            "comment": "Why doesn’t everyone just pay off their balance.  Think how much money the Card Companies make on 30% interest.  If we took that revenue away from them they probably wouldn’t be able to keep the lights on in a couple months.",
                            "score": 2,
                            "author": "Only_Caterpillar3818",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If everyone could just pay their balances they wouldn’t have balances",
                                    "score": 14,
                                    "author": "Messiahhh"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I just set out ot max a 10k credit line while it's 0% intro APR and t-bills pay 5%. I don't know why they're giving me free money but I won't say no.",
                    "score": 3,
                    "author": "gnocchicotti"
                },
                {
                    "level": 1,
                    "comment": "I have 3 main cards, total of a 72k limit between them.    \n\nIt's nuts how much they give you.",
                    "score": 2,
                    "author": "sniperhare"
                }
            ]
        },
        {
            "level": 0,
            "comment": "in other thread: why is there no recession?\n\nthis thread: why\n\nthey all just maxing credit cards",
            "score": 233,
            "author": "Champter24",
            "replies": [
                {
                    "level": 1,
                    "comment": "Prolonging the inevitable.",
                    "score": 75,
                    "author": "TeamDoubleDown",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Learned from the best. If only we had the same power and could pressure cc companies to raise the credit ceiling",
                            "score": 44,
                            "author": "apexisdumb",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not how it works. \n\nYou’re describing a budget process, not the paying process. The debt ceiling is a bullshit anachronism to not pay the bill for the steak you already decided to buy and eat.",
                                    "score": 26,
                                    "author": "Hacking_the_Gibson",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Isn’t it how it works? I truly believed the joke was:\n\nPeople are soon running out of cash to maintain liquidity for bills. If you only could raise the spending limits on their credit cards they could lend more to pay their credit card bill. Which in your example could’ve been spent on a steak.\n\nI’m a regard tho, so probably wrong.",
                                            "score": 12,
                                            "author": "clapsandfaps",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No, it’s not. \n\nIf you decided you were going to spend the money on those bills six months ago, the bank gave you the money, you spent it, and now you have to pay for it otherwise your credit goes to shit. The debt ceiling is the last part. There is no debt ceiling analogy for your household budget because nobody is stupid enough to intentionally not pay the bills to prove some point to your significant other.",
                                                    "score": 6,
                                                    "author": "Hacking_the_Gibson",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "There are literally thousands of divorces every year where spouses will not pay bills just to stick it to the other person.",
                                                            "score": 10,
                                                            "author": "Thencewasit",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Intentionally not paying the bills even if you have the ability to do so does not exist in the lives of ordinary people. \n\nElecting to do that is idiotic.",
                                                                    "score": 3,
                                                                    "author": "Hacking_the_Gibson",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yeah it’s not like we have a phrase defining purposeful default despite financial ability.  There totally isn’t a Wikipedia entry about that exact situation.\n\nhttps://en.m.wikipedia.org/wiki/Strategic_default",
                                                                            "score": 3,
                                                                            "author": "Thencewasit"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Still not getting it, like a true regard.\n\nThe difference is that a country can always find  someone to lend it more money whereas a person can’t. Which makes a country go infinitly in the red, while a person end up behind wendy’s dumpster.\n\nThe concept is the same though. Lending more to spend more until you can’t pay back either in the form of a personal recession or fucking the entire global economy.",
                                                            "score": 1,
                                                            "author": "clapsandfaps",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You seem to confuse borrowing with lending interchangeably in your messages. \n\nAnyway, have fun.",
                                                                    "score": 2,
                                                                    "author": "Hacking_the_Gibson",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "They will raise your limits, or use a card with dynamic limits.",
                                    "score": 1,
                                    "author": "iPigman"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If unemployment gets bad then this could snowball. No jobs, not paying off CC debt. Yikes.",
                            "score": 3,
                            "author": "nasty_nater"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thats not what this shows. It shows credit card debt YoY *decreased* which was a sign of absolutely ridiculously well capitalized consumers. It has now increased again.",
                    "score": 6,
                    "author": "65210"
                },
                {
                    "level": 1,
                    "comment": "Oh wow we’re at the levels of the Great Recession of 2020? ![img](emote|t5_2th52|4271)",
                    "score": 6,
                    "author": "reddituser736985",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We’re actually far lower unless those numbers are adjusted for inflation",
                            "score": 3,
                            "author": "Shdwrptr"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I took out a personal loan from SoFi, the approval paperwork said I couldn’t use the money to buy equities, so I bought options",
            "score": 121,
            "author": "generic-affliction",
            "replies": [
                {
                    "level": 1,
                    "comment": "This short little blurb cancels that entire novel of SOFI dd that guy posted the other day.  PUTS on SOFI it is.",
                    "score": 40,
                    "author": "spartanburt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "FYI SoFi had a major payment processing issue a few months back. What’s the interest lost on millions of accounts for a 14 day period?",
                            "score": 4,
                            "author": "generic-affliction",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not as much as the interest gained going forward",
                                    "score": 7,
                                    "author": "ZeePirate",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "![img](emote|t5_2th52|29637)![img](emote|t5_2th52|31125)",
                    "score": 1,
                    "author": "iPigman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "OK, so with ~68k, I'm doing something wrong I guess.",
            "score": 16,
            "author": "Electrolight",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I pay my credit cards off monthly.\n\nNow........let's look at the margin accounts.................HOLY SHIT!! $1k in in interest a week!!!\n\nMy stonks are gonna hit...........I can feel it!!\n\nSigned,\n\nRegarded",
            "score": 15,
            "author": "Mindless_Mechanic007"
        },
        {
            "level": 0,
            "comment": "Weird thing about credit cards is you have to build credit to build higher limits over time, unless you have a high income job \n\n\nI know 3 different people who all became pharmacists and got their first credit card with like $20k limit right after college",
            "score": 14,
            "author": "Seanishungry117",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is that weird? Feels like people with high income jobs are much less likely to default on the debt, and the card company is going to want to give you as much rope to hang yourself with as they feel comfortable risking.\n\nI would guess income predicts eventual repayment better than credit score. In fact, I'd guess (with no actual knowledge) that high income - kinda bad credit score is actually the sweet spot, they'll hold lots of debt and make a lot of interest payments, but are unlikely to cut and run completely.",
                    "score": 8,
                    "author": "aboardreading",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's not about the interest payments, it's about the merchant processing fees.\n\nSomeone that's high income, uses their credit card heavily but pays it off each month still generates a healthy amount of revenue for the credit card company.\n\nLiterally 90% of my spending is through my CC; visa gets somewhere around 3% of that from the merchants.   Naturally, Visa wants me to have a high limit, despite that I never paid a dime in interest.",
                            "score": 5,
                            "author": "Csquared87"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fuck, I wish I only had $8k of CC debt. Moving + layoffs suck balls.",
            "score": 79,
            "author": "Zenfinite1",
            "replies": [
                {
                    "level": 1,
                    "comment": "getting sick and having to live off your credit is the literal worst.",
                    "score": 44,
                    "author": "Turinggirl",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "AI will solve the problem",
            "score": 36,
            "author": "Pitiful_Difficulty_3",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yup, it’s gonna look at it and just decide to terminate all the debt",
                    "score": 12,
                    "author": "redditmodsRrussians"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Americans when the rate for a home is over 5%:\n\nJESUS CHRIST this is so expensive oh my god the rates are so big! \n\nAmericans when credit card APR is 20%+:\n\n*Debt slavery my beloved*",
            "score": 28,
            "author": "DisAccount4SRStuff",
            "replies": [
                {
                    "level": 1,
                    "comment": "*oh fuck, accidentally spent $427,000 on the credit card again*",
                    "score": 17,
                    "author": "heavym3talc0wb0y2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wonder how much these numbers are calculated. I put almost everything on credit cards because I get 2% cash back and 2 extra years of warranty. I paid it off each month, but I end up carrying a balance of typically 4-6k each month. I have 4 cards I use, each one has a purpose: 2% cb, 3% for food and drug stores, 3% off at specific stores, etc. \n\nI have other cards but these 4 I apply for limit increases when they allow, which has gotten them to limits in the 30-50k range. \n\nWhen I bought a new roof with solar panels (65k), I put it on credit card because they didn't charge me any differently than with check.",
            "score": 21,
            "author": "y90210",
            "replies": [
                {
                    "level": 1,
                    "comment": "I essentially paid for my entire masters degree using credit cards because College Ave apparently hates money. Paid the cc balance off every month and pocketed scores of Chase points. If you're not a dipshit credit cards are basically free money.",
                    "score": 27,
                    "author": "WACS_On",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's all the dipshits paying fees and interest that makes this possible.  Thanks to those in the debt holes, I guess?  Sucks to be them essentially paying for everyone else because of their bad choices.",
                            "score": 9,
                            "author": "SortedChaos",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The printer can solve it all in 1 single day",
            "score": 19,
            "author": "tengosuenocabron",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Zero debt with excellent credit is the second best thing to being rich 🤑",
            "score": 6,
            "author": "DRVK3R"
        },
        {
            "level": 0,
            "comment": "So does affirm go under when all the poors can't pay their debt owed?",
            "score": 5,
            "author": "xDubnine",
            "replies": [
                {
                    "level": 1,
                    "comment": "Affirm just relays the debt onto your card on file, they are effectively a middle man. So if you can’t pay, affirm already charged your card and your issuer will come after you",
                    "score": 3,
                    "author": "onGuardBro"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Americans can't stop fucking spending boys.  It's like consumerism is a disease, and the cure is to buy more shit.\n\n1. Get paycheck.\n2. Pay bills.\n3. Consume.\n4. Acquire more debt.\n5. Repeat.\n\nI don't know what stage of capitalism this is but seems like the endgame is approaching.  Something like 60% of Americans have less than 5k in savings.\n\nThe squeeze is on its just a matter of time before something breaks.",
            "score": 62,
            "author": "Edz_",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s also got quite a bit to do with the privatization of absolutely everything and then adding micro transactions and monthly fees to shit that absolutely doesn’t need it coupled with heavy doses of “upselling” for more than a “basic” package in something for shit that was simply included in the past. \n\nall manner of shit has been itemized to squeeze every single last nickel out of it. Want a Tesla? Fuck you unless you want a monthly service fee for the full use of your purchase. We’re not far off from being charged for the air tiers we breathe.",
                    "score": 39,
                    "author": "WeeWooDriver38",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "People were pretty frugal before / during the pandemic. Couple years of spending isn't the worst thing.",
                    "score": 11,
                    "author": "Potato_Octopi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What? I saw loads of people pissing money away on all sorts of things they can’t afford during the pandemic.",
                            "score": 10,
                            "author": "TheSeek3r_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "https://www.frbsf.org/economic-research/publications/economic-letter/2023/may/rise-and-fall-of-pandemic-excess-savings/#:~:text=Conclusion,remains%20in%20the%20overall%20economy.\n\nTypically no.. consumer spending tanked and savings spiked. Took a while for that to unwind.",
                                    "score": 10,
                                    "author": "Potato_Octopi"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The saddest part is that when it does break, it won't matter if you have $5k or $50k in savings, it'll all be worthless.",
                    "score": 6,
                    "author": "MrStealYoBeef"
                },
                {
                    "level": 1,
                    "comment": "I literally can't grasp the fact that Americans relay so much on credit cards it's fucking wild, unless i need to rent something i can't find a reason for it. \n\nAre debit cards a thing in the US? Or kids get 9 credit cards as soon they turn 21.",
                    "score": 1,
                    "author": "operationfrackola",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why would I ever use a debit card? Credit cards give you cash back and rewards. Just pay them off every month and have self control.",
                            "score": 12,
                            "author": "AIFlesh"
                        },
                        {
                            "level": 2,
                            "comment": "My wife and I use cash back credit cards (one each personal, one joint) for everything, just pay it monthly, treating it like a debit card essentially, except with some cash back and a couple other minor side benefits.",
                            "score": 9,
                            "author": "Ibuprofen-Headgear"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "America and most country run on debt, you guys are making it sound like this some new shit or something.",
            "score": 27,
            "author": "Coolzx",
            "replies": [
                {
                    "level": 1,
                    "comment": "lmao not consumer debt",
                    "score": 3,
                    "author": "podkolzin",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Countries yes but individual people did not use to run on debt.",
                    "score": 9,
                    "author": "Vobat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They ran on Dunkin.",
                            "score": 26,
                            "author": "tslGUH",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "As I see the chart - correct me if I'm wrong - the average increase in debt is less than actual inflation.\n\nSo, imo: Nothing to see here.",
                            "score": 10,
                            "author": "Primary_Try_Feature",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "that's not how inflation works. People's incomes did not increase to adjust for that inflation.",
                                    "score": 0,
                                    "author": "65210",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The average increase in debt is very little, that's my point, inflation was just a good image to prove how insignificant it actually is.\n\nIf the cc iterest rate is 20% and the average increase in debt is like ~15%, people are actually **paying off** their debt, instead of spending their money (which is now less valuable than a year ago) on products&amp;services.\n\nSo my point: We're still in a recession, people have less spending power, but all within reasonable limits, all as expected. Just read the data right.",
                                            "score": 3,
                                            "author": "Primary_Try_Feature"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "At least since the Eighties.",
                            "score": 6,
                            "author": "iPigman"
                        },
                        {
                            "level": 2,
                            "comment": "[https://tradingeconomics.com/united-states/households-debt-to-gdp](https://tradingeconomics.com/united-states/households-debt-to-gdp)",
                            "score": 3,
                            "author": "Coolzx"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I feel like you have to consider cards like amex report a bal monthly even though some of these folks may be paying them completely off every month...",
            "score": 4,
            "author": "SeatPristine1492",
            "replies": [
                {
                    "level": 1,
                    "comment": "That is true.",
                    "score": 1,
                    "author": "iPigman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I put nearly everything on credit/charge and pay off in full every month. Are these numbers before or after interest has been accrued?",
            "score": 10,
            "author": "calebthelion"
        },
        {
            "level": 0,
            "comment": "Let’s see the breakdown of males and females ?",
            "score": 17,
            "author": "-Dreamville-",
            "replies": [
                {
                    "level": 1,
                    "comment": "In the german bubble on TikTok there is a trend where girls „flex“ with their Klarna debt (mostly buying overpriced clothing)",
                    "score": 8,
                    "author": "DesmondNav"
                },
                {
                    "level": 1,
                    "comment": "Great idea! I put my money on the guys having more debt😃",
                    "score": 0,
                    "author": "ThickMoneyWizard",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I watched a bank repo auction and the cars were 98% bromobiles like Chargers Challengers and F-150/RAM 1500. Just saying",
                            "score": 5,
                            "author": "gnocchicotti"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I came across a CC statement for my boomer step dad and it was $100K. That was one card. I’m sure he has more. I guess when you buy a house for $40k and it’s worth over $1.5 million now, fuck your credit card debts and keep spending.",
            "score": 9,
            "author": "nailattack",
            "replies": [
                {
                    "level": 1,
                    "comment": "$100k limit or balance?  If balance that's insane.\n\nReally, both are insane.  It took me two decades to build up to a credit line just over $40k on a single card.",
                    "score": 8,
                    "author": "TedriccoJones",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Balance. His mentality was that his investments will more than make up for it.",
                            "score": 5,
                            "author": "nailattack",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He belongs here",
                                    "score": 3,
                                    "author": "kazkeb"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "98% are influencers in the making. +$3500 when Vision Pro is released",
            "score": 5,
            "author": "BonjinTheMark"
        },
        {
            "level": 0,
            "comment": "Americans are cash backing",
            "score": 2,
            "author": "arpatel530"
        },
        {
            "level": 0,
            "comment": "Calls on American Express?",
            "score": 2,
            "author": "Fit-Boomer",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am curious to see their Platinum Card retention rate over the next few years.",
                    "score": 3,
                    "author": "iPigman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "![img](emote|t5_2th52|4271)",
            "score": 2,
            "author": "Jaffer0x"
        },
        {
            "level": 0,
            "comment": "I’m doing my part!",
            "score": 2,
            "author": "KingKongCain"
        },
        {
            "level": 0,
            "comment": "What this tells me is that a certain segment of the US just lived thru by far their most lucrative successful financial years. \n\nSome people were hitting personal low credit card debt, super low refinanced home payments, wages adjusted for inflation, and tons of stimulus. \n\nOther people were totally priced out of the housing market and got no stimulus. \n\nIts insane how little mention this divergence gets.",
            "score": 2,
            "author": "65210"
        },
        {
            "level": 0,
            "comment": "Alternative view: Americans are crushing CC points.",
            "score": 2,
            "author": "PIK_Toggle"
        },
        {
            "level": 0,
            "comment": "This doesn’t seem that bad. Accounting for inflation the levels are basically back to precovid amounts. Was expecting it to be much worse.",
            "score": 2,
            "author": "whiplash100248479"
        },
        {
            "level": 0,
            "comment": "Oh we going to start pointing fingers on who owes what? Looking at you US government. I learned it from watching you!",
            "score": 5,
            "author": "cletus_"
        },
        {
            "level": 0,
            "comment": "Glad to know it’s not just anecdotal that most people I meet aged 40-65 are fucking degenerates with their finances",
            "score": 3,
            "author": "rpnye523",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s anecdotal lol. This data is just balances not debt so it basically means how much each group is spending. \n\nIt’s not crazy that the age group with the most money is spending the most.",
                    "score": 2,
                    "author": "AIFlesh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was a joke. I’m not coming to wallstreetbets for learning anything about the current state of the economy",
                            "score": 3,
                            "author": "rpnye523"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "With that card it makes me wonder if the boomers are in the borrow stage of the buy, borrow, then die technique",
            "score": 2,
            "author": "saryiahan"
        },
        {
            "level": 0,
            "comment": "The average credit card debt for someone my age is 76k.  That's insane.  Mine is zero.",
            "score": -4,
            "author": "Sensitive_Jelly_5586",
            "replies": [
                {
                    "level": 1,
                    "comment": "7.6k\n\nYou're off by a factor of 10.",
                    "score": 22,
                    "author": "PlushSandyoso",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He's 400 years old, so he 10x'd it",
                            "score": 25,
                            "author": "Lolsmileyface13",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "https://m.youtube.com/watch?v=2-nSwKOVZyk&amp;pp=ygUVRnV0dXJhbWEgY3JlZGl0IGNhcmRz",
                                    "score": 1,
                                    "author": "spartanburt"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think she meant 76k dogecoin.",
                            "score": 6,
                            "author": "Dismal_Complaint2491"
                        },
                        {
                            "level": 2,
                            "comment": "Ah.  I just woke up and apparently need my glasses.",
                            "score": 3,
                            "author": "Sensitive_Jelly_5586",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Happens to the best of us. Have a nice day",
                                    "score": 2,
                                    "author": "PlushSandyoso"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's just a handful of people with a billion dragging up the average.  That's why median is more useful.",
                    "score": 3,
                    "author": "spartanburt"
                },
                {
                    "level": 1,
                    "comment": "I've still got an $8k balance at 0% for a few more months.",
                    "score": 3,
                    "author": "Potato_Octopi",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You know you get back charged all the zero interest months if it’s not paid to zero before the term is up, right?",
                            "score": 3,
                            "author": "Fun_Entrepreneur_254",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why would I get \"back charged\"? That's not in the terms of the loan. I'll pay it off when it's no longer 0% anyways. $8k is trivial.",
                                    "score": 1,
                                    "author": "Potato_Octopi",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well you know what you agreed to, that’s all that matters. It’s just an overwhelming majority of the 0% interest CCs have this caveat: if not paid in full, you will be back charged for all promotional months of no interest. \n\nThat’s how they make so much money on zero interest. It’s an extremely low percentage of borrowers who comply, and then bam get $1000+ in interest charges all at once",
                                            "score": 1,
                                            "author": "Fun_Entrepreneur_254",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's a 0% rate for 1.5 years w/a 3% transaction fee. They make the 3% up front and earn interest on any new charges as the 0% gets paid off first. I just don't add new charges.",
                                                    "score": 1,
                                                    "author": "Potato_Octopi"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|4|**First Seen In WSB**|11 months ago\n**Total Comments**|19|**Previous Best DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&amp;subject=scan_comment&amp;message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&amp;subject=scan_submission&amp;message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)",
            "score": 1,
            "author": "VisualMod"
        },
        {
            "level": 0,
            "comment": "They make retail lose any more money in the market and them cards ain’t getting paid back 😏",
            "score": 1,
            "author": "snippythehorses"
        },
        {
            "level": 0,
            "comment": "Meanwhile the markets grind higher",
            "score": 1,
            "author": "BreakfastOnTheRiver"
        },
        {
            "level": 0,
            "comment": "These personal attacks have to stop",
            "score": 1,
            "author": "CalicoJack_81"
        },
        {
            "level": 0,
            "comment": "This is lower than I’d expect",
            "score": 1,
            "author": "amach9"
        },
        {
            "level": 0,
            "comment": "Credit card debit is only a small % of total consumer debt and it's a small % of disposal income:\n\nhttps://wolfstreet.com/2023/05/15/households-far-from-tapped-out-credit-card-balances-burden-credit-limits-available-credit-delinquencies-collections/",
            "score": 1,
            "author": "SpaceCatVII"
        },
        {
            "level": 0,
            "comment": "Thanks for letting me know I have more credit card debt than anyone else my age ![img](emote|t5_2th52|4260)",
            "score": 1,
            "author": "rip_lyl"
        }
    ]
}