{
    "id": "1480uwr",
    "score": 280,
    "title": "Some House Members Introduce Bill To Fire Gary Gensler And \"Restructure\" SEC.",
    "author": "rightlibcapitalist",
    "date": 1686612768.0,
    "url": "https://www.reddit.com/r/wallstreetbets/comments/1480uwr",
    "media_urls": [
        "https://www.reddit.com/r/wallstreetbets/comments/1480uwr/some_house_members_introduce_bill_to_fire_gary/"
    ],
    "other_urls": [
        "https://www.foxnews.com/politics/house-republicans-introduce-bill-remove-sec-chair-gary-gensler)"
    ],
    "postText": "Key points:\n\n&gt;Several representatives in the United States House of Representatives are making efforts to find ways to remove Gary Gensler, the Chair of the Securities and Exchange Commission (SEC), from his position. However, the legality of such actions is not a straightforward matter. Warren Davidson, an Ohio Representative, recently introduced the SEC Stabilization Act with the explicit purpose of dismissing Gensler. Gensler has been serving as the head of the SEC since April 2021, and his term is expected to continue until 2026.\n\n&amp;#x200B;\n\n&gt;While Davidson has made serious allegations of misconduct and abuse of power against Gensler, removing an independent agency official who was nominated by the President and confirmed by the Senate is a complex process. It is unclear if the President has the sole authority to fire an SEC commissioner. According to a legal expert, there needs to be a valid cause for forcing an SEC official to leave their position. A Supreme Court decision in 2010 established that commissioners can only be removed by the President under specific circumstances, such as inefficiency, neglect of duty, or malfeasance.\n\n&amp;#x200B;\n\n&gt;Unlike cabinet secretaries who serve at the pleasure of the President and can be asked to leave at any time, removing an SEC commissioner is more challenging. Expelling fellow lawmakers from Congress also requires a two-thirds vote and has been a rare occurrence in U.S. history, happening only 20 times.  \n&gt;  \n&gt;Davidson introduced the SEC Stabilization Act in response to a tweet from Paul Grewal, the Chief Legal Officer of Coinbase. If this legislation becomes law, it would restructure the SEC by adding a sixth member to the commission, which currently consists of four commissioners and one chairperson. It would also redistribute certain powers from the chairperson to the commissioners.  \n&gt;  \n&gt;Some media companies reached out to the SEC for comment, but a spokesperson declined to provide any statement.\n\n[House Republicans introduce bill to remove SEC Chair Gary Gensler, restructure agency](https://www.foxnews.com/politics/house-republicans-introduce-bill-remove-sec-chair-gary-gensler)\n\n&amp;#x200B;",
    "comments": [
        {
            "level": 0,
            "comment": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|1 year ago\n**Total Comments**|90|**Previous Best DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/v20sua/what_stocks_politicians_bought_the_dip_bullish_on/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&amp;subject=scan_comment&amp;message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&amp;subject=scan_submission&amp;message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n&gt;TL;DR: Several representatives in the United States House of Representatives are making efforts to find ways to remove Gary Gensler, the Chair of the Securities and Exchange Commission (SEC), from his position. However, the legality of such actions is not a straightforward matter.",
            "score": 1,
            "author": "VisualMod"
        },
        {
            "level": 0,
            "comment": "It's all performance art.",
            "score": 129,
            "author": "Isabella_Bee",
            "replies": [
                {
                    "level": 1,
                    "comment": "Coming to an AMC theater near you. ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)",
                    "score": 31,
                    "author": "plomii",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "More like streaming service",
                            "score": 0,
                            "author": "Dmartinez8491"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes, they are on your side. Don't worry they will move mountains to ensure your little crypto pile will be able to be exchanged for a lambo in 6 months.",
                    "score": 7,
                    "author": "Legitimate-Source-61"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Someone likes Doge better than Gary",
            "score": 17,
            "author": "ByteTraveler"
        },
        {
            "level": 0,
            "comment": "Gamestamp",
            "score": 12,
            "author": "middlename_neil"
        },
        {
            "level": 0,
            "comment": "I dont even need to search for the political donations these members got ![img](emote|t5_2th52|4271)\n\nJust like this article 2 years ago [https://www.theonion.com/congress-takes-field-trip-to-goldman-sachs-to-learn-how-1846994562](https://www.theonion.com/congress-takes-field-trip-to-goldman-sachs-to-learn-how-1846994562), reality is onion rn",
            "score": 23,
            "author": "pm-me-nice-pics"
        },
        {
            "level": 0,
            "comment": "An under informed j/a doing the bidding of people that own him via donations…news at 11!",
            "score": 21,
            "author": "send2devnull2"
        },
        {
            "level": 0,
            "comment": "Hey, do you have a source? Please add a link in the post or as a reply to this comment!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*",
            "score": 4,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I smell another Supreme Court case brewing",
            "score": 14,
            "author": "Environmental_Buy878",
            "replies": [
                {
                    "level": 1,
                    "comment": "https://preview.redd.it/6udidj8kwo5b1.jpeg?width=160&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=5182255aed27d82beda1a122c990fb9b4ff25960",
                    "score": 4,
                    "author": "BigBeagleEars"
                },
                {
                    "level": 1,
                    "comment": "About what? The SEC is accountable to Congress and nothing about the SEC is constitutionally protected. \n\nCongress could eliminate the SEC entirely if they wanted.",
                    "score": -5,
                    "author": "VeryStandardOutlier",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Incorrect. SEC is an agency under executive branch. This is a “separation of powers” issue which is from the constitution. Did you even go to school?",
                            "score": 2,
                            "author": "dtseng123",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Did you even Google before posting such a confidently incorrect answer?\n\nThe SEC was established by the Securities Exchange Act of 1934. It's part of the executive branch but it's existence is dependent on Congress. Same thing for the CFTC, EPA, and other regulatory agencies.\n\nThe Executive's authority over agencies only exists because Congress permits Presidential reorganization authority. That authority can be withdrawn by Congress and all agency activity is subject to Congressional oversight.",
                                    "score": 0,
                                    "author": "VeryStandardOutlier",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You should have said this first as your original statement. I’m aware how agencies are created. Congress can try to have 2/3 vote to override the President for a bill that would restructure the SEC. It’s not going to happen as this is entirely performative.",
                                            "score": 1,
                                            "author": "dtseng123",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The Chairman of the Financial Services Committee (which oversees the SEC) and the Majority Whip laid into Gensler during his Congressional hearing. Chairman McHenry gifted us this clip of Gensler refusing to define Ethereum: [https://www.youtube.com/watch?v=VhA1dZXeao0&amp;ab\\_channel=GOPFinancialServices](https://www.youtube.com/watch?v=VhA1dZXeao0&amp;ab_channel=GOPFinancialServices)\n\nThese are not junior members of Congress threatening him.",
                                                    "score": 0,
                                                    "author": "VeryStandardOutlier"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Gensler going full regard is because CZ (Binance) took down thier biggest donor, SBF (FTX).\n\n\nThe Coinbase lawsuit is just a red hearing so that it doesn't look like they're taking revenge on CZ.",
            "score": 22,
            "author": "frappuccinoCoin",
            "replies": [
                {
                    "level": 1,
                    "comment": "*herring",
                    "score": 2,
                    "author": "cristian0_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "🦻🏼",
                            "score": 3,
                            "author": "DirtyFatB0Y"
                        },
                        {
                            "level": 2,
                            "comment": "I said what I said",
                            "score": 1,
                            "author": "frappuccinoCoin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Crypto losers feeling butthurt",
            "score": 27,
            "author": "Regular_Chipmunk7593",
            "replies": [
                {
                    "level": 1,
                    "comment": "Except those \"losers\" have the legislative power to repeal the only Acts that allow the SEC to exist",
                    "score": -6,
                    "author": "VeryStandardOutlier",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or so they think lol this will go nowhere",
                            "score": 8,
                            "author": "samstones"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Gary is actually the good guy. The ones bashing him are doing so because he's actually making some real changes. If you're into crypto and mad at him, take a moment a self-reflect and start hating yourself because crypto is garbage you stupid loser.",
            "score": 4,
            "author": "RandyMacLahey"
        },
        {
            "level": 0,
            "comment": "Yeah, but these people are just random morons. Classic legislative grandstanding, nothing to see here. \n\nThat said, if the crypto morons win, we all lose.\n\nMoney that goes into crypto is money that goes into the abyss.",
            "score": 18,
            "author": "peterpanic32",
            "replies": [
                {
                    "level": 1,
                    "comment": "The shit abyss randers?",
                    "score": 9,
                    "author": "I_Love_To_Poop420",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hear that?\n\nThe sounds of the whispering winds of shit",
                            "score": 3,
                            "author": "NoTransportation2899"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In the bigger picture it’s better than money that stays at the top. People are still going to use that Bitcoin to buy shit, no one can solely survive on internet-bought cocaine (except me, I swear.)",
                    "score": -5,
                    "author": "thomstevens420",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No one uses bitcoin to buy a god damn thing.",
                            "score": 4,
                            "author": "Gandalftron"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; In the bigger picture it’s better than money that stays at the top. \n\nCrypto leads to a vastly less equal wealth distribution. \n\nAnd at least money at the top of the real economy gets invested, crypto is a non-productive asset of zero economic value. It's like if vast quantities of capital holders began to bury their money in the ground instead of investing it into something productive. \n\n&gt; People are still going to use that Bitcoin to buy shit, no one can solely survive on internet-bought cocaine (except me, I swear.)\n\nNo one uses Bitcoin though. You're actively and inherently disincentivized from doing so and it sucks relative to lower friction means of transaction.",
                            "score": 2,
                            "author": "peterpanic32"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Looks like somebody wants to appease the crypto bros. Nothing to see here really...",
            "score": 6,
            "author": "enginvest"
        },
        {
            "level": 0,
            "comment": "if they were republican house members\nthrn there wont be any logic behind it\n\njust sillyness",
            "score": 9,
            "author": "nicealtyagotthere",
            "replies": [
                {
                    "level": 1,
                    "comment": "The logic is pretty logical. Banks and hedge funds pay for their campaigns. They, drooling, read off of prepared notes.",
                    "score": 8,
                    "author": "silentbuttmedley"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fire him. Out of a cannon. In to the sun.",
            "score": 4,
            "author": "AaarghCobras"
        },
        {
            "level": 0,
            "comment": "Should add a clause that requires they wear clown makeup so everyone knows how serious to take them.",
            "score": 2,
            "author": "JamesHutchisonReal"
        },
        {
            "level": 0,
            "comment": "Do you really think congress does anything unless they absolutely have to",
            "score": 4,
            "author": "Tay_Tay86",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well it is a part time job, *with full time benefits. Benefits most Americans haven't seen in two or three generations.*",
                    "score": 3,
                    "author": "iPigman"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a crypto supporter I’m going to get drunk af if they get rid of this Gollum like looking person",
            "score": -6,
            "author": "cryptoguy66"
        },
        {
            "level": 0,
            "comment": "I mean if you believe coin base it seems like he is abusing his power. \n\nThey SEC still can’t define what a security is.\n\nWhen Europe already has launched comprehensive regulation.\n\nHe is either corrupt and has ulterior motives or is just doing his job poorly. There is no reason to kill crypto in the US as it will just continue without you leaving a lot of taxable income on the table",
            "score": -3,
            "author": "0AKTR3E",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes the SEC can. \n\nA security is an a) investment of money with b) the reasonable expectation of profits from c) a common enterprise by d) the effort of others. \n\nRemember two years ago when all the new altcoins talked about their usecases, and that they will increase in value when everybody will recognize their usefulness? They essentially advertised themself as securities.\n\nThe SEC made it very clear in their lawsuite why all the altcoins the alledge are securities, should be seen as securities. Read it, it might enlighten you. \n\nThey went to court because the do not want to overstep their mandate, but let a judge decide if their interpretation of the law is correct.\n\nNone of this shuld kill crypto in the US. There are tons of securites offered every year in the US. The only reason it would kill crypto, is that crypto can't survive with basic fraud protection.",
                    "score": 3,
                    "author": "Dark_Tigger",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; Remember two years ago when all the new altcoins talked about their usecases, and that they will increase in value when everybody will recognize their usefulness? They essentially advertised themself as securities.\n\nWill the new CBDCs be securities? nah, they'll just print more CBDC coins and drive the value down just like the US dollar.",
                            "score": 1,
                            "author": "Lurker_Investor",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "a) I doubt they will get wide adoption\n\nb) do they fulfill condition b) and c)?\n\nIf not, no they won't seen as securites. Just like Bitcoin isn't.",
                                    "score": 1,
                                    "author": "Dark_Tigger"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Genuine question, why is BUSD (a stablecoin pegged to the USD) stamped as a security then? There is absolutely 0 expectation of profit from holding BUSD, you can only lose money (unless you use third party stuff but that comes with additional risk). And yet the SEC said BUSD is a security.",
                            "score": 1,
                            "author": "superfilthz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Seriously read the SEC complaint. Your answer is found on page 77, 78 and 79 section \"Binance sold BUSD as a security\".",
                                    "score": 1,
                                    "author": "Dark_Tigger"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Your comment is the most interesting I have read about the Crypto SEC issue in the US.  I feel we just need the US to pass clear regulations on crypto. At least there are several projects that have been built to handle compliance. Polygon ID and AllianceBlock NexeraID was created for this.",
                            "score": 1,
                            "author": "gisnirhk"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There's a bit of information people leave out when they say this. The CFTC claimed jurisdiction on cryptocurrencies years ago. You can look up news articles that suggest there were probably some heated discussions between the SEC and CFTC behind the scenes but ultimately CFTC seemed to come out on top. The SEC couldn't bring any enforcement action against any crypto exchanges.\n\n_Until_ FTX was such a huge and colossal fuck up either the SEC was told to move forward so it didn't look like everyone was corrupt or a moron (ha!) or GG decided to move forward anyway figuring that nobody was going to raise a stink about jurisdiction.\n\nI'm just a smooth brain but we can't have a legitimate conversation about whether the SEC is corrupt without considering the CFTCs involvement/obstruction.",
                    "score": 1,
                    "author": "halt_spell"
                }
            ]
        },
        {
            "level": 0,
            "comment": "All my homies hate Gensler",
            "score": -6,
            "author": "snippythehorses",
            "replies": [
                {
                    "level": 1,
                    "comment": "Gary looks like the kid who ratted out his friends for candy in elementary school.",
                    "score": -1,
                    "author": "Rawniew54"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fire him and get a non boomer",
            "score": 1,
            "author": "TPL531"
        },
        {
            "level": 0,
            "comment": "\\&gt; It is unclear if the President has the sole authority to fire an SEC commissioner.\n\nbecause the SEC is an independent agency, typically means outside of the hierarchy of the executive branch (agencies where the President is the CEO)\n\nWarren Davidson needs to get that out of committee and onto the floor asap.",
            "score": -8,
            "author": "thetaFAANG"
        },
        {
            "level": 0,
            "comment": "GarY gUt mEH teNdiEs!",
            "score": -1,
            "author": "BenRichards79"
        },
        {
            "level": 0,
            "comment": "crypto bag holders",
            "score": 1,
            "author": "SaintBiggusDickus"
        },
        {
            "level": 0,
            "comment": "Fire Gary!",
            "score": 1,
            "author": "Accomplished_Hunt_21"
        },
        {
            "level": 0,
            "comment": "Here's the bill: https://www.congress.gov/bill/118th-congress/house-bill/4019?s=1&amp;r=1",
            "score": 1,
            "author": "halt_spell"
        },
        {
            "level": 0,
            "comment": "Yawn why even waste the time posting this! Anything coming out of the house is DoA.",
            "score": 0,
            "author": "Snoo_96430"
        }
    ]
}