{
    "id": "148gqty",
    "score": 0,
    "title": "Disney Puts? What are everyone’s thoughts?",
    "author": "MaverickArchitect",
    "date": 1686666570.0,
    "url": "https://www.reddit.com/r/wallstreetbets/comments/148gqty",
    "media_urls": [],
    "other_urls": [],
    "postText": "So recently Disney has decided to scale back marketing for Indy 5 and the new Star Wars project the Acolyte. They already acknowledged that both projects are over budget and expect them to tank. Made a chunk of money a month ago on puts and now i think it looks good to repeat the process.\n\nKeep in mind they sunk over a billion dollars on their star wars hotel just to have it open for less than a year and finally put an axe to it. Now there is rumors about selling Lucasfilm back to George Lucas himself.\n\nOh yeah, almost forgot; Disney tanked Willow another Lucas property. At this rate, I wonder if Disney would be selling Lucasfilm at a loss?\n\nIts genuinely baffling why Disney has not about faced with Star wars and Lucasfilm. I know the long term whale investors are pissed off at Kathleen Kennedy. You can say what you want about woke this and that or that the pandemic changed the markets but numbers don’t lie. Lucasfilm is bleeding money and in life support and yet Kathleen Kennedy keeps running the company into the ground. On top of that, they fired Chapek who was there for about 2 years and re-hired Iger who put Disney in this mess to begin with. The man is an acquisition guy and it shows. Disney is now top heavy with stuff but no real leadership or vision to manage it.  They might as well be a media monopoly and yet they are sinking like the Titanic. A monopoly shouldn’t lose money at all.\n\nSo what’s the play?\n\nEdit:\n\nThe rumor of the sale to Lucas comes from an apparently high bill owed to Comcast.\n\nThought i would add some more DD. Disney has had slow park attendance since the pandemic and with consumers carrying $5k in credit card debt month to month Disney is expecting a small turnout to their parks globally.\n\nGiven the extended covid restrictions in California among other economic and environmental issues, I’m not sure that Disney park will ever turn around.\n\nDisney has also been hit with a class action lawsuit after modifying annual pass holders contract.\n\nMarvel is also on a death spiral. Comic books are near death with both Marvel and DC comic book sales reaching all time lows. Meanwhile, Marvel movies are barely limping along. Although the recent Guardians movie was genuinely pretty good, ticket sales were less than expected.\n\nI don’t think I need to mention the losses from the little Mermaid movie. I think the little mermaid ride at the magic kingdom should have been a tip off that no one would give a shit.\n\nToy sales are non-existent, with countless marvel and star wars toys ending up on clearance or returned to the manufacturer. Let’s not forget the Grogu doll fiasco; once they finally made the doll Christmas had already come and gone and no one gave a shit when they finally hit shelves.\n\nLastly, Disney Plus keeps seeing huge dips in subscribers. There does appear to be boycotting of its shows but i think the main driver is that no one can afford it since they keep raising the price tag.",
    "comments": [
        {
            "level": 0,
            "comment": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|2 years ago\n**Total Comments**|345|**Previous Best DD**|\n**Account Age**|5 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&amp;subject=scan_comment&amp;message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&amp;subject=scan_submission&amp;message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n&gt;TL;DR: Buy puts on Disney and hope for Lucasfilm to be sold at a loss.",
            "score": 1,
            "author": "VisualMod"
        },
        {
            "level": 0,
            "comment": "Buying calls instead!",
            "score": 40,
            "author": "stickler4dd",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same.\n\nWhat's your thoughts on the next month?",
                    "score": 8,
                    "author": "Nduguu77",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I expect sideways trading for the next month and the coming period, but on the long term there should be a recovery, especially when Disney is going to reinstate its dividend payments. Disney at its core has a strong business with a diverse offering of services and products. Its leadership is trying to turn things around, but progress is slow and investors do not have the patience at this stage to hold and wait.",
                            "score": -1,
                            "author": "stickler4dd"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "There's no way Disney sells Star Wars back. It's an important component in their portfolio of IPs and Star Wars fans - like real, actual manchildren that buy the toys and shit - are a captive audience. They'll pay dividends for decades. \n\nI own shares in DIS. They're not going anywhere.",
            "score": 16,
            "author": "TheMovement77",
            "replies": [
                {
                    "level": 1,
                    "comment": "They apparently owe a lot of money to comcast. Hence the start of the rumor.",
                    "score": -18,
                    "author": "MaverickArchitect",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They do not owe money to Comcast.  They are in a contractual agreement to purchase the remaining shares of Hulu from Comcast so Disney will own 100% of Hulu.  Disney can pull an Elon/Twitter and just decide not to agree to the contract.  This will then result in renegotiating the price tag or an expensive court date for both companies.  Disney also can decide to sell their ownership of Hulu to reduce debt (but Iger has stated he is still planning to purchase complete ownership of Hulu).  \n\nI am a Long Share holder of Disney and see quite a bit of sideways trading for most of this year.  But end of 2023 and going into 2024 should have some catalyst and recovery to their balance sheet.\n\nThe dividend reinstatement will make the hedgefunds and older investors happy and allow for some minor upward movement.  Disney has reduced debt by cancelling the Willow series as well as others, renting off some of its material to other streaming services and closing its Star Wars hotel (too expensive for the real fans) fiasco.  They have another brand new Cruise ship setting sail in the next year or two which will attract plenty of interst as their cruise business has been running strong during the recovery.\n\nESPN is also a drag on Disney, but there is a lot of questions for how they proceed...Sell it or focus on the agreements and ownership they have in place with Draftkings DKNG to create more opportunities for income streams for both compnanies.  \n\nAlso, do not forget that Disney will be at the forfront of using AI.  They will be able to improve their Website and mulitple apps (parks, shopping, cruise, etc...) they will use it for interactions on their rides in their stores as well as their magicbands. They will develop more relationships with companies like they currently have such as Apple where they will have content for viewing with the Apple Vision and will be able to produce games for augmented reality and VR.  \n\nIt is still the TOP Global Licensor in the world.\n\nIn summary maybe a short Term short play (but i do not see the price moving much further down) Disney is more of a 2+ year play as they improve their balance sheet and figure out the correct path for future leadership after the previous Fuck up.",
                            "score": 3,
                            "author": "kdizz15",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Great DD, thanks",
                                    "score": 1,
                                    "author": "MaverickArchitect"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The star wars hotel has been open for more than year.  It's currently still open.",
            "score": 12,
            "author": "yougetwhatyougive88",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not for long",
                    "score": 8,
                    "author": "Electronic_Eagle6211"
                },
                {
                    "level": 1,
                    "comment": "Didnt they just shut it down?",
                    "score": 1,
                    "author": "Outside-Ad-3998",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Closes end of september",
                            "score": 1,
                            "author": "yougetwhatyougive88"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s closing and no it hasn’t been a year.",
                    "score": -8,
                    "author": "kingedward41",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The hotel officially opened to guests March 1 2022..currently still open and closes September 28th. Math.",
                            "score": 15,
                            "author": "yougetwhatyougive88",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But I feel it’s been open later and someone else confirmed it because they felt it too.\n\nGet out of here with your facts.",
                                    "score": 3,
                                    "author": "BJaysRock"
                                },
                                {
                                    "level": 3,
                                    "comment": "We don’t take kindly to facts round here",
                                    "score": 3,
                                    "author": "Outrageous-Cycle-841"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "They also have Elemental, Wish and a theme park business that’s going to make a profit in coming quarters. And they are cutting costs rapidly on a money losing streaming business and had layoffs. Hard to say where this falls. I wouldn’t necessarily bet against the mouse based on movies, especially through the summer park season. Likely more it just sits in a range.",
            "score": 10,
            "author": "jemilk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, the park attendance is actually down and they stabbed their annual park pass holders in the back starting a class action lawsuit. On the other hand we may still see a pop in profits this summer. We’ll see.",
                    "score": -18,
                    "author": "MaverickArchitect"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Cannot see Disney selling Lucasfilm. One, likely not get much, and who could do a better job. Two, believe management expects SOMETHING profitable will be produced. Expect management will get rid of creative-types that have produced tv shows/movies/cartoons that have been rejected by traditional Disney customers.",
            "score": 3,
            "author": "63367Bob",
            "replies": [
                {
                    "level": 1,
                    "comment": "Apparently they owe a lot of money to comcast, which is what triggered the rumor",
                    "score": -9,
                    "author": "MaverickArchitect"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you make your investing decisions based off of politics you will lose money.",
            "score": 10,
            "author": "sokpuppet1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not necessarily. When the constantly angry short term memory mob gets angry at something and causes the stock to dip before moving on to the next thing a week or two later you can get some discounts.\n\nNot sure if that is considered investing based on politics or just paying attention to a trend though.",
                    "score": 4,
                    "author": "OffByOneErrorz"
                },
                {
                    "level": 1,
                    "comment": "Nancy Pelosi disagrees. Oh wait, we call that insider trading.",
                    "score": 1,
                    "author": "Lordsaxon73"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I bought 110$ calls for Aug and 115$ for Sep",
            "score": 5,
            "author": "Ahhmuzement",
            "replies": [
                {
                    "level": 1,
                    "comment": "Good luck",
                    "score": 2,
                    "author": "MaverickArchitect",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks. I agree with a lot of what you said in your post but i believe a lot of this is already priced in. Disney stock has been hurting for a while and a lot of it can be connected to Chapek. Iger is in the process of undoing a lot of what chapek did and i trust Iger to turn the company around. I bought calls for aug and sep more so hoping for a pump on good future guidance. Disney is building a new cruise ship that i think will launch within a year, along with a new private island and they are currently finishing up a lot of projects around their theme parks across the globe. They are also adjusting the Annual Passholder disaster and I think with these new updates parks will see increase in attendance.   I will say movies and disney plus is a toss up and that could keep the stock down so we shall see.",
                            "score": 2,
                            "author": "Ahhmuzement"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kathleen Kennedy is BY FAR the worst thing for Lucas Films. Fire that cunt already",
            "score": 2,
            "author": "fixerdrew02"
        },
        {
            "level": 0,
            "comment": "They also raised the price of their streaming service by over 10% where I live. Got the mail today.",
            "score": 2,
            "author": "Hovlands_grin"
        },
        {
            "level": 0,
            "comment": "Don’t fuck with the mouse",
            "score": 6,
            "author": "MrKrustySocks",
            "replies": [
                {
                    "level": 1,
                    "comment": "Rat pussy",
                    "score": -8,
                    "author": "MaverickArchitect"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Seems fairly priced around $95 to me.",
            "score": 3,
            "author": "terrybmw335"
        },
        {
            "level": 0,
            "comment": "Rule #7: Don’t fuck with the mouse",
            "score": 2,
            "author": "GoodGuyDrew",
            "replies": [
                {
                    "level": 1,
                    "comment": "Rat pussy",
                    "score": 1,
                    "author": "MaverickArchitect"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I didn’t know they were pondering selling Star Wars. But I do know they’re butchering the IP. Over saturation with mid to terrible shows and movies. Proof that IP can only carry you so far. Can’t just keep slapping Star Wars onto a pile of shit plot and expect accolades from the masses.",
            "score": 1,
            "author": "kingedward41",
            "replies": [
                {
                    "level": 1,
                    "comment": "Apparently the start of this rumor is that they owe a big amount of money to comcast. Calls on Comcast?",
                    "score": 0,
                    "author": "MaverickArchitect",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Comcast deal is priced in. It’s not a secret. Disney have to buy out Comcast’s stake in Hulu.",
                            "score": 2,
                            "author": "blackbarminnosu"
                        },
                        {
                            "level": 2,
                            "comment": "I live in Philly and we hate Comcast here even though they basically built our entire skyline. Use that DD as you will lmao",
                            "score": 1,
                            "author": "kingedward41"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It might not amount to anything. There are a lot of rumors coming out of Lucasfilm in particular. I think they could make a killing if they just made a show about the behind the scenes drama that has allegedly happened in the past 7 years.",
                    "score": -1,
                    "author": "MaverickArchitect"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;There are a few possible plays here. One would be to short Disney stock, betting that the company's troubles will continue and its share price will fall. Another possibility would be to buy put options on Lucasfilm, betting that the studio will underperform expectations in the near future. Finally, one could also bet against specific Star Wars projects like Indy 5 or The Acolyte by buying put options on those films' box office performance.",
            "score": 1,
            "author": "VisualMod",
            "replies": [
                {
                    "level": 1,
                    "comment": "Turing Test failed, you huge R word",
                    "score": 1,
                    "author": "kingedward41",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "right?!?! makes me feel better about AI stealing my job",
                            "score": 1,
                            "author": "sackhuck7"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "DIS premiums suck and barely move even if ITM. Might be better to short the stock or do credit spreads.",
            "score": 1,
            "author": "ElCalvo069"
        },
        {
            "level": 0,
            "comment": "New uptrend confirmed",
            "score": 1,
            "author": "Outrageous-Cycle-841"
        },
        {
            "level": 0,
            "comment": "The current downtrend seems priced in from the last earnings. The Comcast bill is recoverable. Losing or selling the Star Wars franchise would be foolish. Iger and the blackrock board have plans. Wait and see how stupid they get.",
            "score": 1,
            "author": "CartoonistHumble3027"
        },
        {
            "level": 0,
            "comment": "If Disney mention AI once to improve customer experience. It will moon.",
            "score": 1,
            "author": "NewToTradingStock"
        },
        {
            "level": 0,
            "comment": "Disney will need to buy Hulu between min 9B-25B what disney wants to pay vs what comcast wants to sell for; their current cash position doesnt look too good; they dont have to buy rn but will eventually do, mid term i think they will fall of a cliff but in short term i expect disney to clean balance sheet as much as possible to pump share price so they can leverage their tits up again in the future at a higher price",
            "score": 1,
            "author": "AustinPowers007",
            "replies": [
                {
                    "level": 1,
                    "comment": "The best case for calls i have seen is the reinstatement of dividend payments",
                    "score": 1,
                    "author": "MaverickArchitect"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wtf? Dis only at 94 a share? Way too much upside to short",
            "score": 1,
            "author": "waxheartzZz"
        },
        {
            "level": 0,
            "comment": "Every time I touch Disney I lose a ton of money. Calls or Puts. Leave it alone",
            "score": 1,
            "author": "Queasy_Olive6713",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nice, so your money was what paid out my puts last month",
                    "score": 1,
                    "author": "MaverickArchitect",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably was. Disney was a turd last month and I bought calls lol",
                            "score": 1,
                            "author": "Queasy_Olive6713"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don't fuck with the mouse",
            "score": 1,
            "author": "Dangerous_Boot_3870",
            "replies": [
                {
                    "level": 1,
                    "comment": "Rat pussy",
                    "score": 1,
                    "author": "MaverickArchitect",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "FAFO",
                            "score": 1,
                            "author": "Dangerous_Boot_3870"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't fuck with The Mouse. You can't take me down with you.",
            "score": 1,
            "author": "B12-deficient-skelly"
        },
        {
            "level": 0,
            "comment": "I've been fucked trying to read DIS movements.  Have gained some and lost more.",
            "score": 1,
            "author": "pharmafarm"
        },
        {
            "level": 0,
            "comment": "Nope. It’s call time on Disney!",
            "score": 1,
            "author": "STOPbuyingPUTS"
        },
        {
            "level": 0,
            "comment": "Never fuck with the mouse. It’ll drop DIS dick in your mouth. Been there.",
            "score": 1,
            "author": "WillSwimWithToasters"
        }
    ]
}