{
    "id": "1cbak4",
    "score": 9,
    "title": "MineCraft Server for those who want to play with people.",
    "author": "Topduck",
    "date": 1365918702.0,
    "url": "https://www.reddit.com/r/IUP/comments/1cbak4",
    "media_urls": [],
    "other_urls": [
        "http://roguegaming.net/"
    ],
    "postText": "So, a while back someone was looking for some help setting up a MineCraft server. Me and some friends got together and set a TeamSpeak and MineCraft server. We worked pretty hard on it. It has a 3 worlds, 1 pvp, 1 survival, and 1 creative. Both the survival and pvp have stores. There is also a website set up and we are hoping to have more people playing.\n\nThe site:  http://roguegaming.net/\n\neverything is on there, IP's and direct connects, server is updated. \n\nPlease, if you join us don't ruin all the work we put into the servers. \n\nThank you! and everyone is welcome to play.",
    "comments": [
        {
            "level": 0,
            "comment": "Nice.  I'll check it out tomorrow.  I haven't played Minecraft in months, just because there aren't any usable servers out there.  I'm using the shitty on-campus network in the dorms, so I can't just make my own either. \n\nThank you!",
            "score": 2,
            "author": "bublz",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks man, send me a message if you have trouble or when you get on and I can show you how everything works, I hope you enjoy it!\n",
                    "score": 2,
                    "author": "Topduck"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Do any of you play mod packs such as FTB or Tekkit?",
            "score": 1,
            "author": "akolesar",
            "replies": [
                {
                    "level": 1,
                    "comment": "its normal minecraft. it has a little changes like a shop and it keeps stats where you can build up skills, theres some warps and setting your home. ",
                    "score": 1,
                    "author": "Topduck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Alright well I've joined on the website, how long will it be until I've been whitelisted?",
                            "score": 1,
                            "author": "akolesar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "use the direct connect of roguegaming.net and you should be able to log on\n",
                                    "score": 1,
                                    "author": "Topduck"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}