{
    "id": "67dm68",
    "score": 5,
    "title": "Thinking of transferring to IUP",
    "author": "r0botindisguise",
    "date": 1493085256.0,
    "url": "https://www.reddit.com/r/IUP/comments/67dm68",
    "media_urls": [],
    "other_urls": [],
    "postText": "I've found some mixed reviews of the school, so I'm just curious what it's really like. I wouldn't be transferring until next year though. I'm thinking of majoring in early education. By the time I transfer I'll be married. He is looking at psychology. Obviously we'd be living off campus if anyone has opinions on that too.",
    "comments": [
        {
            "level": 0,
            "comment": "Campus is nice ",
            "score": 5,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "But what about the school itself?",
                    "score": 1,
                    "author": "r0botindisguise"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Social Science is top notch. I loved my time there and the friends I made. ",
            "score": 3,
            "author": "unidentifiedbomb"
        },
        {
            "level": 0,
            "comment": "The education program there is one of the best in the state, although most of my contacts through it were more focused on music ed. The psych department is also good, as far as I've known, it's a smaller but very focused department. \n\n\nOff campus housing is a necessity (assuming) assuming you're looking for something somewhat isolated from the student hubbub. If you're looking for recommendations, PM me and I can give good suggestions on any side of town. ",
            "score": 2,
            "author": "Hibberdijibbit"
        },
        {
            "level": 0,
            "comment": "I can't speak for those departments, but there is a wide range of off campus housing.",
            "score": 2,
            "author": "rootedoak"
        },
        {
            "level": 0,
            "comment": "Nursing Alum here. Also got a minor of psych. Dr. Long wrote a textbook on social psych, super great professor. I've heard there's someone there who specializes in internet addiction research too. I was super impressed with that course but the rest of it was just eh. I can't speak for education but hey, some people like it!",
            "score": 2,
            "author": "akolesar"
        },
        {
            "level": 0,
            "comment": "We have a great early childhood/special education program. I just graduated in December. You end with a dual certificate. The faculty are some of the nicest people you will ever meet. They see your passion and meet it. They also offer a professional development school which gives you a ton of classroom experience.",
            "score": 2,
            "author": "munchiemike"
        }
    ]
}