{
    "id": "79c6e6",
    "score": 12,
    "title": "Any good jobs anyone wants to recommend around campus? Dosent even have to be great pay, just a job that dosent suck. FUCK ROMEOS.",
    "author": "K10RumbleRumble",
    "date": 1509220213.0,
    "url": "https://www.reddit.com/r/IUP/comments/79c6e6",
    "media_urls": [],
    "other_urls": [],
    "postText": "Title says it all. Looking for a new job that isnt going to force me to do nothing but work 40 hours a week. ",
    "comments": [
        {
            "level": 0,
            "comment": "If you can, try to get a job on campus. The library and college computer labs are good places to look. I had a job like that and it was super easy. I was allowed to do homework during my shift as long as I did my work. I was getting about 15-20 hours per week, which was enough to pay my bills and buy food. \n\nMost of those require Federal Work Study award though, so you might not be able to find one. Still, it's worth looking into.",
            "score": 2,
            "author": "bublz"
        },
        {
            "level": 0,
            "comment": "I worked at Romeo's for a year. Just get out of there, it's a harsh environment that pays min wage.\n\nWhat is your major?",
            "score": 2,
            "author": "rootedoak"
        },
        {
            "level": 0,
            "comment": "The Papa John's on Oakland Ave is a good spot, if you can make the trek. The management there treats you well, and drivers have a good chance to clear $75-100 in tips a night. You will have to deal with drunk people, and working during major drinking holidays. IUPattys, homecoming, and the Superbowl are crazy days for pizza. ",
            "score": 2,
            "author": "Hibberdijibbit"
        },
        {
            "level": 0,
            "comment": "A little late to the party but Diamond Drug is always hiring at their location on Kolter Ave, and bus route 4 stops right outside. Pay is not great but it's easy to get in and they usually work with hours. ",
            "score": 2,
            "author": "[deleted]"
        }
    ]
}