{
    "id": "pft5ry",
    "score": 19,
    "title": "6 Years Ago Today, IUP Swept My Best Friend's Death under the Rug and Called it a suicide due to Overdose - His drug screen came back clean, and autopsy pointed towards foul play. They still fight his mother to this day",
    "author": "MiNiHiKiD",
    "date": 1630500376.0,
    "url": "https://www.reddit.com/r/IUP/comments/pft5ry",
    "media_urls": [
        "https://www.altoonamirror.com/news/local-news/2015/09/ashville-family-mourning-tragedy/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "IUP has a history of not protecting those with mental illness",
            "score": 1,
            "author": "ThatVictoriousgirl",
            "replies": [
                {
                    "level": 1,
                    "comment": "A day before he died he mentioned to me that he was the happiest that he had ever been and made a ton of new friends.... His father committed and he called him a pussy all his life for it.  I just said in the post that all signs pointed towards foul play.  jeez",
                    "score": 1,
                    "author": "MiNiHiKiD"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The article linked specifically says that foul play was not suspected. Can you provide more information?",
            "score": 0,
            "author": "octokit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thats what IUP gave as an official statement 2 hours after his body was found, but before the actual autopsy, well before our private investigation, and way before their \"investigation\" which they let expire after 4 years, as a school investigation cant exceed 4 years per state law.",
                    "score": 2,
                    "author": "MiNiHiKiD",
                    "replies": [
                        {
                            "level": 2,
                            "comment": " Can you provide any articles with more information, such as the toxicology results or autopsy reports? I'm not calling you a liar, but it's difficult to take what you're saying as fact when you're simply saying \"Here's an article and it's bullshit\" without offering evidence to back up your claims.",
                            "score": 1,
                            "author": "octokit",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If there's enough interest i can photograph the results from the report and the screen and post them here. There is no public information stating otherwise. Just grieving still",
                                    "score": 0,
                                    "author": "MiNiHiKiD",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think that would be prudent information to share if you're going to publicly post a claim that the university intentionally covered up the real cause of death of a student. I hope you understand how serious this situation is.",
                                            "score": 2,
                                            "author": "octokit",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm merely just posting as a way to grieve, theres no way to get justice at this point unless his killer came out himself.",
                                                    "score": 1,
                                                    "author": "MiNiHiKiD",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "If you just want to grieve, write in a diary or talk to a therapist. You're posting serious allegations in a public forum and you are burdened with providing proof or at least evidence to back up your claims. You can't be so naive as to think that it's wise or appropriate to say \"This college is covering up a murder\" without any evidence whatsoever and not expect them to come after you for libel.",
                                                            "score": 3,
                                                            "author": "octokit",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Again, if more people ask for proof, then I will photograph it and post it due to public interest. Respectfully to you, im not banging on his mothers door on the anniversary of his death to photograph sensitive drug screen results because one guy on a forum demanded it... Ill do it if you really really want it though, but just accept that this was a tragedy either way and its something to be remembered and to possibly learn from. The point was to let Devns story be known and to also educate people on IUP's attitude towards their well being. \n\nThe college will not come after us for libel, I promise you that. We aren't saying anything untrue either. That is the most true thing that I know. IUP just wants us to shut up about it. Theyve blocked some of our numbers. I truly wished they tried though.",
                                                                    "score": 1,
                                                                    "author": "MiNiHiKiD"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "If youre interested, I actually wrote and recorded a song about it, filmed the music video at IUP, and it was covered on WTAJ News. https://youtu.be/rtcvkotxFXc",
                                                                    "score": 0,
                                                                    "author": "MiNiHiKiD"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yes man, but unfortunately its something we've been fighting. It truly is serious, and he was my best friend. If you check the security report, it says that nobody has died on campus in passed ten years. Not even concerning Devn, thats a lie. Theres nothing we can do now. They seized all of his belonging for four years, let it expire, and robbed us of the window of opportunity to find the evidence because of it. Im just here to let people know what happened. Its far too late to do anything, unfortunately. I just want people to know that the uni doesn't care and will do ANYTHING to save their bottom dollar - even if it means covering up murder.",
                                                    "score": 0,
                                                    "author": "MiNiHiKiD",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The Hawkeye, an independent student run newspaper, were the only ones kind enough (at the time) to let out our side of the story: https://thehawkeyeonlinenews.wordpress.com/2016/05/05/life-after-death-at-iup-student-bereavement-policy-adopted/",
                                                            "score": 1,
                                                            "author": "MiNiHiKiD"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "And again... this was 6 years ago, 2 years after they let their phony investigation expire, 3 years after exhausting our private investigation (which got nowhere because IUP seized all of his belongings for 4 years), and many years after contacting proper representatives. Just here to tell devns story. Unfortunately there is no way to get justice because of how IUP handled it.",
            "score": 0,
            "author": "MiNiHiKiD"
        }
    ]
}