{
    "id": "1222bqz",
    "score": 5,
    "title": "Same question but for DePaul? Am I making a stupid choice or no? And why should I pick DePaul over Loyola?",
    "author": "XO_Akuma",
    "date": 1679785004.0,
    "url": "https://www.reddit.com/r/depaul/comments/1222bqz",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I would recommend DePaul in a way because of the smaller class sizes. So far, I’ve only gotten classes with 12-25 people. It’s a nice touch because you can talk to your professor easier and ask for help when needed.  Everyone is really nice and friendly here! It makes you feel comfortable.\n\nThe only con I’ve seen so far at DePaul is the lack of activities and engagement on campus. Stuff happens every now and then, but not many people attend as it’s a commuter school. I’m a commuter myself. It’s not necessarily a con for everyone, as the city is supposed to be your campus. They don’t want you staying at DePaul, but to explore the many things chicago has to offer. With that being said, loyolas campus is also bigger than DePauls.\n\nI feel as if you can get the same social life at either school. You’ll have access to the city no matter what, as both schools have the red line close to their campuses. I would weigh the pros and cons of each school, but focus on which has the better program.",
            "score": 5,
            "author": "organellejanelle",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm mainly concerned about aid at this moment, but as far as my program (History) goes, I'm concerned about getting a good internship or fellowship at a museum and getting into a combined BA/MA program",
                    "score": 1,
                    "author": "XO_Akuma",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Im not sure if this would help, but I recall there was a “University Partner Fest” held here around February, It was at the art institute of Chicago and they mentioned that they were doing a museums career panel and info on internships. Here’s the [link](https://www.artic.edu/events/5621/university-partner-fest)\n\nBoth DePaul and Loyola students were able to attend, so it probably doesn’t help with your decision but I thought it might be of interest..",
                            "score": 2,
                            "author": "organellejanelle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Regardless of which one I choose, this will probably help thanks",
                                    "score": 1,
                                    "author": "XO_Akuma",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No problem!",
                                            "score": 1,
                                            "author": "organellejanelle"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think you need to sit down with a counselor and decide what you want out of your education. If you want a laid back, low stress environment and you have connections, like a family business you can work at post graduation, then I would 100% choose DePaul. However, I found it very hard to find a job even with a 3.9 gpa and relevant internship experience. If I personally could do it all over I would’ve chosen U of I.",
            "score": 4,
            "author": "Double_Anybody",
            "replies": [
                {
                    "level": 1,
                    "comment": "Im not OP but why would you have chosen U of I if you could’ve done it all over again? I’m mostly asking because I’m considering transferring out of DePaul and to U of I, and I’m not sure if I should.",
                    "score": 1,
                    "author": "organellejanelle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Most of my friends who went to U of I found excellent jobs. Most of my friends from DePaul struggled pretty hard.",
                            "score": 1,
                            "author": "Double_Anybody",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s pretty interesting. Especially since DePaul and students there openly advocate about how many internship opportunities are available here…",
                                    "score": 2,
                                    "author": "organellejanelle",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think you should go online and see how DePaul ranks vs other schools in the area. DePaul is known for having a very high acceptance rate and hardly failing anyone. It is not known for academic rigor. When I transferred from community college, I found the classes to be much easier. If academics and future employment are on OP’s mind, then they should pick somewhere else.",
                                            "score": 1,
                                            "author": "Double_Anybody",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thanks for the advice!",
                                                    "score": 1,
                                                    "author": "organellejanelle"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Have you found that to be true?",
                                            "score": 1,
                                            "author": "XO_Akuma",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I haven’t found an internship but that’s because I’m focusing on what I should major in as I am undecided. I do know they have multiple resources to help you find internships, such as alumni outreach and the career center. Plus you’re in the city so I would assume there would be plenty of internships. Some business students I know have found internships and have worked around the city. So it’s honestly 50/50 I would say?",
                                                    "score": 2,
                                                    "author": "organellejanelle",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Oh okay",
                                                            "score": 1,
                                                            "author": "XO_Akuma"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "What were their majors?",
                                    "score": 1,
                                    "author": "XO_Akuma"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What was your major? What career were you hoping to pursue?",
                    "score": 1,
                    "author": "XO_Akuma",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Economics. I was trying to get into finance, insurance, and banking. My other friends where in business and CIS.",
                            "score": 2,
                            "author": "Double_Anybody",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Funny enough that was my last major at UT. Honestly it would've been a fine major to continue there, but I just can't force myself to go back, and honestly I don't have a whole lot of passion for it anyways.\n\nAs a History major, I feel like being close to a museum like CHM will give me great opportunities for internships, fellowships, jobs, etc. I'm mainly worried about having to compete with other students though, especially UChicago students.",
                                    "score": 1,
                                    "author": "XO_Akuma",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you want a job at any of the museums in Chicago you’re going to be competing with grad students. I would highly recommend you talk to a counselor. Also remember if you want to be competitive, DePaul isn’t the school. If you want a stress free, easy experience DePaul is the school.",
                                            "score": 3,
                                            "author": "Double_Anybody",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They don't even have undergrad internships at the Museum?",
                                                    "score": 1,
                                                    "author": "XO_Akuma",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I would highly suggest you talk to a councilor. There are limited internships and you’re not only competing against other schools, but DePaul students as well. So you’d have to be near the top of your class just to beat out your classmates.\n\nIt’s possible that 100+ students would be fighting for only 10-20 internships. Grad school students would obviously be at the top of the list, then UChicago, U of I, and then DePaul.",
                                                            "score": 1,
                                                            "author": "Double_Anybody"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}