{
    "id": "12b076k",
    "score": 13,
    "title": "Quarter system? Good? Bad?",
    "author": "phillychile",
    "date": 1680560842.0,
    "url": "https://www.reddit.com/r/depaul/comments/12b076k",
    "media_urls": [],
    "other_urls": [],
    "postText": "How do people feel about the quarter system? Are there advantages or disadvantages to not being on the same schedule as other schools?",
    "comments": [
        {
            "level": 0,
            "comment": "Honestly I think it’s an advantage for having a long winter break. Also Fridays are off for most students at DePaul. Class 4 days a week is a dream.",
            "score": 14,
            "author": "crispyfry7",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Class 4 days a week is a dream.\n\nEven at universities on the semester system, once you get past your first year, you are very likely on a 3 or 4 day schedule.\n\nQuarter system is a lot faster pace if you've never dealt with it. Don't fall behind on your studies or homework.\n\nThe long winter break was amazing to reset and be re-energized though.",
                    "score": 4,
                    "author": "MustardCat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had it at my college and loved it. My son loves it at DePaul. It’s a quick and dirty set up and if you don’t like the class - knowing that it’s for such a short time makes it easier to digest! But, if you can fall behind quickly it’s not good. My daughter would not thrive with it. Hence why she’ll go someplace with a semester system.",
            "score": 4,
            "author": "theladyoctane"
        },
        {
            "level": 0,
            "comment": "So there are a lot of advantages to the quarter system and a few disadvantages i can think of. \n\nFor me, I love that we get to try so many different classes. Every quarter we get to try 4 new classes, we can add a 5th 2 credit too. \n\nThis comes with the disadvantage that we move really fast. Like its 11 weeks with finals. So you have to stay on top of your work. \n\nWe also have an extremely log winter break. We have 6 weeks off. We end the Tuesday before Thanksgiving and are off until the Monday after new years. \n\nThe downside is our spring break is crap. Like jts technically 5 days, then you dive back in and don't finish until the second week of June. \n\nOn the other hand we start after labor day, so we have a lot of time off. \n\nWe also have an easier time declaring double majors, this is due to the amount of classes we have to take each year. \n\nOn the other hand we have a lot more requirements that may or may not feel like a waste of time. \n\nBut then again you might find more classes you like. We have anime history, wine drinking, pottery, lifting classes, and more. So you won't be board.",
            "score": 3,
            "author": "CollegeSnitch"
        },
        {
            "level": 0,
            "comment": "I love it. I've done a bachelor's degree at a semester-based school, and now I'm working on a separate bachelor's at DePaul, and I wouldn't go back to semesters. I personally can't tell the difference in terms of the quarters being shorter than your traditional semester. Most classes that require more time get split into separate courses (e.g., in Computer Science, they have the introductory programming classes, data structures, discrete math, and computer systems all split into two different parts). Having Fridays off is great for running errands and scheduling appointments, and getting a large winter break from Thanksgiving through New Years is wonderful. Also, by the time you realize that you don't like a class, you've usually only got a couple more weeks to grind it out.",
            "score": 2,
            "author": "ob1jakobi"
        },
        {
            "level": 0,
            "comment": "I loved it, I graduated last year and I’m in graduate school now and I miss it. It kinda sucked seeing all my friends finish in May while DePaul finished early-mid June but imo not starting until after Labor Day and then that sweet, sweet winter break made it all okay. I like the pace of the classes too\n\nI’m not sure if this is specific to schools that follow a quarter system but I also loved having Fridays off",
            "score": 2,
            "author": "ag9910"
        },
        {
            "level": 0,
            "comment": "In my opinion the quarter system is way better and is fast paced. Winter break is a month long and the classes are only 10 weeks.",
            "score": 2,
            "author": "rizvia13"
        }
    ]
}