{
    "id": "1464r2l",
    "score": 0,
    "title": "Happy moving out day!",
    "author": "SugarsCamry",
    "date": 1686415060.0,
    "url": "https://www.reddit.com/r/depaul/comments/1464r2l",
    "media_urls": [],
    "other_urls": [],
    "postText": "As a neighborhood of DePaul resident and alum, I just want to share the joy I feel watching everyone move out of the dorms this time of year. I know the number of morons I see wandering up and down my street smoking weed will go down by about 90%. Gotta love summertime!",
    "comments": [
        {
            "level": 0,
            "comment": "don't worry, im staying for summer, so ill carry the status for the squad until they pull back up.",
            "score": 7,
            "author": "CollegeSnitch",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea I quoted 90% BC I knew some degenerates would still be around",
                    "score": -6,
                    "author": "SugarsCamry",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "you know when the two comments responding to your post have more upvotes than your post, you might be the jerk...",
                            "score": 4,
                            "author": "CollegeSnitch",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why would I care what the feelings are of loser college students who think blatantly smoking weed in family neighborhood is cool?",
                                    "score": -4,
                                    "author": "SugarsCamry",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You moved into an area with a university that was established in 1898; and your offended on how college students act. In a college area. You are in deed an asshole. You knew what you’d expect when you moved into the area. As an alum I’m disappointed to have any association with you based on that sole trait. \n\nDo better than call people out on Reddit for engaging and enjoying their youth in a place that fosters it. You don’t like then please get the fuck out of the area",
                                            "score": 5,
                                            "author": "stang_thang26",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I personally think their heart may give out when they learn that NorthWestern literally has a student discount with a dispensary in Evanston 😂",
                                                    "score": 2,
                                                    "author": "CollegeSnitch"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "And you think doing drugs around kids was an accepted behavior amongst students that whole time?",
                                                    "score": 1,
                                                    "author": "SugarsCamry",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You moved into the area knowing that’s something your kids could be potentially exposed to. So no, I don’t feel bad that you moved into a college area and are not happy that students are acting like students. It’s like complaining that you took your kids to see Deadpool and that it has too much violence and sexual scenes, since it had a marvel stamp on it.\n\nIf you’re not happy with the area then move. They were there first. You picked this path, so figure it out\n\n![gif](giphy|ZauXEnpww4xwbokowa)",
                                                            "score": 3,
                                                            "author": "stang_thang26",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Useless analogy. You act as if this degenerate behavior has always been this commonplace and blatant here. It hasn’t. Students used to be more courteous and respectable than this. \n\nOverall, I’m very happy with the area and have no plans to leave. I’ll continue calling you scumbags out when necessary/entertaining, but otherwise paying no nevermind to you",
                                                                    "score": 1,
                                                                    "author": "SugarsCamry",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You’re on Reddit complaining. It’s bothering you deeply. Also since you’re so ignorant on DePauls history of cannabis. Might I recommend that you use your alumni discount to take the class “cannabis studies”. There’s literally a section about DePauls history with weed. Spoiler. It’s been prevalent since the 60’s. Furthermore my analogy holds since you’re comparing what you expected from what you got. \n\nMaybe just maybe enlighten yourself and do some pot? Maybe gain some culture that your sorely lacked getting during your degree path. It’s quite pathetic that you choose to look down on students and name call them. When you made the stupid decision to put yourself in this situation",
                                                                            "score": 2,
                                                                            "author": "stang_thang26",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "OooOooOo there’s a class on this now? I should come back for it, and take another telling me there are more than two genders while I’m at it \n\nI was not complaining, I was rejoicing, as I still am, that the number of moron pothead students smoking weed in the neighborhood will go down for the next 3 months. It makes our spectacular Chicago summers all the more enjoyable.",
                                                                                    "score": 1,
                                                                                    "author": "SugarsCamry",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "But it is, very cool.  \"Family neighborhood\", wtf Ward it's 2023.",
                                            "score": 3,
                                            "author": "masterjack-0_o",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And? Don’t think Carl Winslow woulda approved either.",
                                                    "score": 0,
                                                    "author": "SugarsCamry"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The university has been around for 125 years. long before your dad even considered if your mom should have swallowed you or not. 😂 Your mad, thats students in a college area, that has legalized weed are smoking. huh. Did you think you would gain any sympathy or respect from the students that you seem so unhappy with? Like seriously, how lame are you? You're an alum and the best you have is, see you pot smokers in 12 weeks? 😂😂 Like seriously move to one of the 20 odd states that didn't legalize weed and leave us alone.",
                                            "score": 2,
                                            "author": "CollegeSnitch",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’m not sure what the point of citing that 125 year history is. Legalization and the decay of the student body to the point where people now don’t care about doing drugs in front of kids and think anyone critical of that practice is an asshole is a very recent development \n\n\n&gt;\tYour \n\nYou’re**",
                                                    "score": 0,
                                                    "author": "SugarsCamry",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's not. People have always done things that people don't consider right. Not to mention this is a campus first before your neighborhood. So if someone decided to raise kids in an area that they knew young college kids would live in and experiment in, that is their choice. But for 9 months out of the year this campus is the home for thousands of students. Just because you're unhappy isn't our problem. This action is legal and a good way for students who are stressed to de-stress. You on the other hand decided to live near a campus, you decided to live in a blue state that legalized it, and worst of all came to reddit to be a jerk with the intent of making college students feel bad. Something you once were. This is our home, this is where we come to learn and try new things. If you don't like it I implore you to leave and never communicate with any depaul staff, student, or alumni as long as you walk this earth.",
                                                            "score": 1,
                                                            "author": "CollegeSnitch",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt; This action is legal \n\nIt's not legal to consume in public, nor is there anything unreasonable about desiring that it not be consumed around kids. I'll continue to call the cops / make fun of you degenerates as I please.",
                                                                    "score": 1,
                                                                    "author": "SugarsCamry",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "if you bring your kids around people who are smoking thats your problem. People don't have to move to make room for you and your crotchgobblins 😂 and yeah, because chicago please show up quick and will do more than ask people to move",
                                                                            "score": 1,
                                                                            "author": "CollegeSnitch"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Loser alert",
            "score": 3,
            "author": "Campey13",
            "replies": [
                {
                    "level": 1,
                    "comment": "I will give you ten dollars if you can find anything on this planet that I care less about than I do the opinions of college aged potheads",
                    "score": 0,
                    "author": "SugarsCamry"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Borrrrrring booooooo lame alertttttttt booooooo",
            "score": 15,
            "author": "Responsible-Ad-1587"
        }
    ]
}