{
    "id": "mvtl0o",
    "score": 57,
    "title": "Covid-19 vaccine will be required for students in fall 2021 “who intend to be on campus for any period of time”",
    "author": "Justinbeiberispoop",
    "date": 1619052157.0,
    "url": "https://www.reddit.com/r/depaul/comments/mvtl0o",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Thanks for posting this. Not really surprised by it.  think I read that something like over 50 universities have already announced this.  My guess is that it will be a requirement pretty much everywhere by this fall.",
            "score": 15,
            "author": "notoriously_late",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree. For better or worse, it will likely just be the norm.",
                    "score": 3,
                    "author": "Sherman1963"
                }
            ]
        },
        {
            "level": 0,
            "comment": "People are going to complain about this and talk about their freedom of choice. This disease spread like crazy even when very few people were on campus. And you want to come back to school unvaccinated? You’re free to take your ass to another school or online classes.",
            "score": 50,
            "author": "char88j",
            "replies": [
                {
                    "level": 1,
                    "comment": "Here’s the thing. I am young, and getting covid would probably not affect me much. All of my loved ones who are susceptible are vaccinated. I am very very scared of the possibility of infertility, which is listed as a possible side affect on the insert for the vaccine. That is something I just don’t want to take the risk with, and there is no way I can just do all online classes as most of the classes I need are on campus (I tried to get all online ones for this reason). What do you suppose I do?",
                    "score": 1,
                    "author": "Shadowsnaxx",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean I’m a woman but",
                                    "score": 1,
                                    "author": "Shadowsnaxx",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ok I get what you’re saying but do you think a 21 year old college student can afford to freeze her eggs?",
                                                    "score": 1,
                                                    "author": "Shadowsnaxx"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Like I’m bot even really against the vaccine. I’m really not. I just feel like since it is important to me to be able to have kids in the future, I feel safer giving it a year or two so that we really know what the side effects are going to be. All my friends and family that already have kids or don’t plan to have any I would actually encourage them to get the vaccine! I want this crap over as much as the next person for sure, I just feel like that is a big risk to take with my personal health for something that most likely is not a danger to me, and others who it is a danger to should already have the vaccine",
                                                    "score": 1,
                                                    "author": "Shadowsnaxx",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 1,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The CDC says there is no evidence that the vaccine causes infertility, but how can we know that this soon? Also that is incredibly privileged to assume that getting ones eggs freezes is a “marginal fee”. I don’t think you understand how much that really costs",
                                                                    "score": 1,
                                                                    "author": "Shadowsnaxx"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I suppose you either suck it up and get the shot or don't go on campus. Simple choice really.",
                            "score": 1,
                            "author": "Cub_xD"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "shut up",
                    "score": -60,
                    "author": "wrenchinaccountant"
                }
            ]
        },
        {
            "level": 0,
            "comment": "https://i.imgur.com/UdxFHgm.gif",
            "score": 18,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "What if you're allergic to it?",
            "score": 3,
            "author": "tuckfenpin",
            "replies": [
                {
                    "level": 1,
                    "comment": "They said in the announcement that they will consider medical and religious exemptions.",
                    "score": 14,
                    "author": "TheRegistrar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I really hope they require medical proof.",
                            "score": 22,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My hope is that they make it arduous enough, that only the really dedicated antivaxx types push for the exemption. Everyone else who is on the fence and uncertain will hopefully go for the path of least resistance and just get the shot.",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was planning to quit DePaul anyways next year, but I'm glad I didn't want to stay because I don't want to get vaccinated",
            "score": 2,
            "author": "programmer4567"
        },
        {
            "level": 0,
            "comment": "Lol. What about the “religious reasons” people. Using it as an excuse. And I mean this from literally people without any sort of belief, using that tab to admittedly not get vaccinated or tested at uni.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": -8,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Untrue. The wild type COVID strain didn't affect kids as much, but the currently dominant strain B.1.1.7 is spreading much more easily in kids and teens.\n\n[https://abc7chicago.com/covid-chidlren-variant-coroanvirus-coronavirus-vaccine/10486843/](https://abc7chicago.com/covid-chidlren-variant-coroanvirus-coronavirus-vaccine/10486843/)",
                    "score": 6,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": -5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think DePaul should have slightly modified how they worded this, primarily for the reasons I suspect you're concerned about. The way the email DePaul sent out phrases it, it sounds like students/faculty/staff *have* to obtain vaccination prior to returning to campus in the fall - no exceptions. To anyone who isn't in a high-risk group, and/or who wants to wait until one/all of the vaccine(s) obtain full FDA approval, they can get a medical exemption. All others have to get vaccinated before returning to campus. There's also going to be religious exemptions, but I'll hold off on giving my thoughts on that.",
                                    "score": 6,
                                    "author": "ob1jakobi",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": -1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah, that's why I mentioned that DePaul could've rephrased how they're doing it.  The way it reads is polarizing, where it sounds like they're saying what you mentioned: anyone wanting to return to campus in the fall *must* be vaccinated against COVID.  In reality, it's no different than any of their other vaccine requirements.  Anyone who doesn't want the vaccine can submit a medical or religious exemption and return to campus.  They'll probably be tested for COVID routinely, but as long as they're negative for COVID, they'll likely be able to participate like everyone else who had been vaccinated.\n\nAnyone not in a high-risk group that doesn't want to get vaccinated while the vaccines are only approved for use via Emergency Use Authorization, as opposed to full FDA approval, should be able to get a waiver from their physician.  Hell, I got both Pfizer doses and *I'm* worried that there might be unnoticed/unrecognized adverse events related to the Pfizer vaccine - especially in light of how the [CDC &amp; FDA have recommended a pause on administration of the J &amp; J vaccine](https://www.cdc.gov/media/releases/2021/s0413-JJ-vaccine.html).\n\nThere's a lot about both COVID and the vaccines that we just don't know, and I can't blame a healthy 18-22 year old college student for wanting to wait until full FDA approval; to them the risk of adverse events from vaccination might outweigh the risk of complications from COVID infection, which sounds reasonable to me.  In that case, they can just submit a medical waiver and call it a day.",
                                                    "score": 3,
                                                    "author": "ob1jakobi"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It's almost as if you already had to submit prior vaccination forms to attend DePaul anyways 🤔",
                                                    "score": 4,
                                                    "author": "DirtyDanThe3rd",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": -1,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You are a) assuming that the only humans who attend DePaul are kids and b) ignoring the current data from people who have already been vaccinated. There are no credible reports of people dying from the vaccine, there ARE however, many people who have died from covid itself.",
                                                                    "score": 4,
                                                                    "author": "DirtyDanThe3rd",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I know the other person deleted their comments, but I just double-checked, and [you're correct that none of the vaccines have been the cause of death](https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/adverse-events.html). There have been a few thousand people who *have* died at some point in time after receiving vaccination(s), but no deaths have been shown to be *directly caused* by the vaccine itself.\n\nI figured that surely *at least* one person has died from the vaccine, but I'm actually really pleasantly surprised to find this out. I think there's a few cases they're still looking at with the J &amp; J vaccine; however, I've got to say that I'm really impressed by how well scientists managed to not only create these vaccines as quickly as they have, but also provide the remarkablely high level of safety and efficacy too.",
                                                                            "score": 2,
                                                                            "author": "ob1jakobi",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I'm impressed as well, I wish that people wouldn't try to use that VAERS site the person who deleted their comments was using as a definite source, considering that literally anyone can add entries and none of them prove causation. Even if they all did I'd be better set to take my chances with the vaccine than with covid itself.",
                                                                                    "score": 1,
                                                                                    "author": "DirtyDanThe3rd",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 1,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "First off you have a weird definition of kids. Now that that's out of the way, don't twist my words, I said there are no credible reports of anyone dying from covid. Do you believe the medalerts reports? Let's also take a look at the fact that you are ignoring the adverse effects of covid for young people that don't die from it. Including damage to the heart, lung, and Guillain-Barre syndrome. Not to mention blood clots. (Mayo Clinic: https://www.mayoclinic.org/diseases-conditions/coronavirus/in-depth/coronavirus-long-term-effects/art-20490351#:~:text=Brain.,Parkinson's%20disease%20and%20Alzheimer's%20disease.). I also find it interesting interesting you question government reports and then cite a .gov. even if we are to take your source at face value (which we shouldn't, considering VAERS themselves states that reports of adverse events don't indicate causation, and because of the fact that anyone can submit a report, including those who may be anti-vax.) That would still be a lower risk than catching covid itself, considering the higher number of deaths and the MUCH higher chance of long-term adverse effects.",
                                                                                    "score": 1,
                                                                                    "author": "DirtyDanThe3rd",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Look at Michigan, which is currently a hotbed of disease thanks to \"open er up\" rhetoric. [https://www.michigan.gov/documents/coronavirus/20210406\\_Data\\_and\\_modeling\\_update\\_vmediaT\\_002\\_721704\\_7.pdf](https://www.michigan.gov/documents/coronavirus/20210406_Data_and_modeling_update_vmediaT_002_721704_7.pdf)\n\nTheir early data is showing all time high for children, higher then at our highest peaks of the pandemic. Look at the data for 4/1/2020 and compare it to today. Even when the adults were spiking, child cases stayed low. Now we have spiking adult cases, and child cases are following suit.",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": -1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Not really, no. I was specifically disproving\n\n&gt;  a disease that is of almost no risk to them is wrong \n\nand as I've demonstrated, that is no longer the case, because children are catching COVID at higher and higher rates\n\n I think the burden is on you to prove, with scientific evidence that 1. the vaccine is worse then getting covid and 2. that not vaccinating teenagers is better then enabling community spread and reservoirs of disease on campus.",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": -1,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Basic fact about viruses: the more hosts they have, the more chance they have to mutate and become more dangerous. By hosting reservoirs of disease, you enable the virus to mutate and potentially escape vaccines, endangering the high risk vaccine population.\n\nAnd, lets not forget, COVID has a wide-range of side-effects beyond death, including permanent organ damage (to an extent we don't know about), and cognitive effects such as depression and brain fog. Long COVID has been documented clinically, and while it's too early to know the extent of these long-haul symptoms in teenagers, it'd be absolutely foolish to roll the dice on this. It's not just \"the flu bro\".\n\n[https://www.cdc.gov/coronavirus/2019-ncov/long-term-effects.html](https://www.cdc.gov/coronavirus/2019-ncov/long-term-effects.html)",
                                                                    "score": 3,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": -2,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Like I said, wild type COVID didn't infect kids much so we don't have a ton of data. b.1.1.7 does infect children at a much higher rate, and is a new mutation that has become dominant in a scarily short amount of time (within a month or two of being detected in the US). We simply don't know, and I'd rather not find out. The only thing we know is that mild COVID is not a mild flu, and potentially has much more severe consequences.\n\n\\&gt; Instead, all the athletes, kids, celebrities, etc that have gotten this are fine.\n\nThis is purely anecdotal from you, but I can also purely anecdotally say offhand that I've heard numerous celebrities say the exact opposite. And that's not even the celebrities who've fucking died from it, lol.\n\nYou seem to be reaching for the personal attacks, so I'll give you some advice before leaving you too it: If you want to be convincing about why we shouldn't vaccinate literally everyone who is reasonably susceptible to COVID and it's nasty effects (as stated above), you probably should make an argument for why the vaccine's harm outweighs COVID's harm.",
                                                                                    "score": 1,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}