{
    "id": "10afz10",
    "score": 5,
    "title": "CSUSM TRANSFER. WILL I GET ACCEPTED?",
    "author": "Traditional-Tea3279",
    "date": 1673570074.0,
    "url": "https://www.reddit.com/r/csusm/comments/10afz10",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi guys. I had a very low gpa when I first started college (when COVID first started). Online school wasn’t for me. I started with a .8 gpa and brought it up to a 2.7. I also am about to get my ADT. What are my chances into getting in CSUSM as a transfer? and i’m a local going for psychology.",
    "comments": [
        {
            "level": 0,
            "comment": "Hey man, I got in with a 2.7. You definitely have a chance",
            "score": 5,
            "author": "Who_cares73",
            "replies": [
                {
                    "level": 1,
                    "comment": "thank you so much!! 😭😭",
                    "score": 2,
                    "author": "Traditional-Tea3279"
                }
            ]
        },
        {
            "level": 0,
            "comment": "yes.",
            "score": 2,
            "author": "jacksondavis1"
        },
        {
            "level": 0,
            "comment": "You will get in. I got in with a transfer GPA of 2.3 (not local), I remember stressing about being accepted. I did remarkably better at CSUSM. Just finished my last semester being on the deans list and now moving to the next step in life. Don’t over think it. 👍",
            "score": 2,
            "author": "northgate8",
            "replies": [
                {
                    "level": 1,
                    "comment": "Did you have any D/F/W?",
                    "score": 1,
                    "author": "Traditional-Tea3279"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If you're transferring from Palomar, they (used to?) have an agreement of sorts that if you have at 2.0 or higher and transfer with most of your required courses completed in your major, they have to accept you at CSUSM.\n\nAt least that's how it was in 2006. Not sure if that's still the case.",
            "score": 1,
            "author": "lunayoshi",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m at miramar college!!",
                    "score": 1,
                    "author": "Traditional-Tea3279",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It might be the same deal with them, but I've heard that you'll have to retake some lower division courses once you get to Cal State because the Miramar version doesn't line up somehow. I forget which ones. They told us during online orientation a year and a half ago. My memory's fuzzy. I didn't pay attention because I was from Palomar.\n\n(For clarity's sake, I transferred from Palomar to CSUSM in 2006, dropped out, went back and took classes at Palomar again to get back in the groove in 2019, and transferred again with no issue. The only difference was my History 103/104 classes stopped being valid over that long break and since you can't retake a class you've gotten a C in or higher, I had to take a different pair of history classes instead.)",
                            "score": 1,
                            "author": "lunayoshi"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I also got in with a 2.7! Since you said you’re local i think you’ll be fine :)",
            "score": 1,
            "author": "SatanicDesmodium"
        },
        {
            "level": 0,
            "comment": "Maybe. You should understand that nobody here can give you realistic odds.",
            "score": -1,
            "author": "SimplySerenity",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree, each years probablity is different depending on many different factors. The main factor will be how many apply the same year you do and among those, how many will be infront of you in terms of having a higher probablity of getting accepted ( i.e. gpa, local vs. non-local, how many apply to your respective major, is your major impacted that year........on and on.....)\n\nyour best chance will be to apply to as many schools as you can.\n\nAgian, this is not a troll post\n\nIt is the realistic and most honest answer you will get",
                    "score": 2,
                    "author": "sdbigs"
                },
                {
                    "level": 1,
                    "comment": "thanks but i just wanted to see if anyone has relevant experience. maybe you should be kinder",
                    "score": -2,
                    "author": "Traditional-Tea3279",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sorry I wasn’t trying to be rude. I’ve just seen this type of thread many times before.",
                            "score": 1,
                            "author": "SimplySerenity",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "sorry for coming off harsh. Thank you!",
                                    "score": 2,
                                    "author": "Traditional-Tea3279"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think you get accepted automatically as a local if you meet your major’s gpa",
            "score": 0,
            "author": "Ill_Requirement_3525"
        }
    ]
}