{
    "id": "2ear5a",
    "score": 15,
    "title": "TKE Date Rape e-mail",
    "author": "[deleted]",
    "date": 1408731280.0,
    "url": "https://www.reddit.com/r/csusm/comments/2ear5a",
    "media_urls": [],
    "other_urls": [
        "http://www.csusm.edu/title9/",
        "http://www.ccssd.org/.end_of_the_skype_high",
        "http://www.ccssd.org/.",
        "http://www.csusm.edu/title9/"
    ],
    "postText": " \nStar JPEGUniversity Police Department\n425 La Moree Road\n\nSan Marcos, California 92078\n\nPhone: 760-750-4567\n\nRobert G. McMANUS, Chief of Police\n\nCRIME ALERT\nTau Kappa Epsilon (TKE) Fraternity\nAKA- The Kollege Experience\n \nTHIS BULLETIN IS POSTED TO ADVISE YOU OF INCIDENTS THAT CONCERN THE SAFETY OF THE UNIVERSITY COMMUNITY.  PLEASE TAKE ALL NECESSARY PRECAUTIONS.\nThe California State University San Marcos University Police Department received a report of sexual assault (rape) over the weekend of May 4, 2014 at an off-campus party hosted by the Tau Kappa Epsilon (TKE) fraternity and its members (TKE is not a recognized CSUSM student organization).  TKE is also known as “The Kollege Experience.”  The circumstances of the alleged assault suggest the involvement of date rape drugs and that the assailant is alleged to be a member of TKE.  The University Police Department is working with the Oceanside Police Department in their investigation of this incident, which is ongoing. \n \nThe university has received additional reports of sexual assaults purportedly involving the Tau Kappa Epsilon fraternity and its members.  These additional alleged incidents were described as having occurred on or near the university campus, and at off-campus residences allegedly inhabited by TKE members.  Other alleged recent criminal behaviors related to the TKE fraternity include, but are not limited to, pervasive hazing, illegal victim/witness intimidation, harassment and tampering, vandalism, providing drugs and alcohol to minors, and illegal drug use. A more detailed alert can be found at www.csusm.edu/SAFE .\n \nIf you have any information that might be helpful in the ongoing administrative or criminal investigations related to these incidents, please contact the CSUSM SAFE line at (760) 750-SAFE or University Police at (760) 750-4567.  If you wish, you may report anonymously by calling the CSUSM SAFE line.  You may also contact the following to make a report:\n \nOceanside Police Department, Case # 14-005745:  (760) 435-4900\nSan Diego County Sheriff’s Department:  (858) 565-5200\nThe California Attorney General’s Office:  Deputy Attorney General Jodi Cleesattle at (619) 645-3150 or jodi.cleesattle@doj.ca.gov\nDr. Bridget Blanshan, CSUSM Title IX Coordinator:  (760) 750-4056 or http://www.csusm.edu/title9/\n·       Crime Stoppers (888) 580-8477\n\n \nCONFIDENTIAL SUPPORT:  Victims of any form of sexual harassment or assault are also strongly encouraged to seek confidential support at CSUSM’s Student Health and Counseling Center, 120 Craven Road Suite 100, (760) 750-4915; office hours are Monday-Friday, 8:00 am – 4:45 pm.  Off campus, The Center for Community Solutions offers a 24-Hour toll free County-wide crisis line for crisis intervention and information referrals related to sexual assault in San Diego at 1-888-385-4657 (FREE).  More information is available at http://www.ccssd.org/.end_of_the_skype_high  Reporting to a confidential counselor or sexual assault advocate WILL NOT RESULT IN A REPORT TO LAW ENFORCEMENT OR THE UNIVERSITY.  These counseling professionals are required by law to keep your identity and information confidential\n \n \nBelow is the Campus Alert in its entirety\n \nCalifornia State University Police\n\nCSUSM CAMPUS CRIME ALERT\n\nPossible Threat to the Campus Community\nSexual Assault and Rape\nAugust 22, 2014\n\nIn compliance with the \"Timely Notice\" provisions of the federal Jeanne Clery Disclosure of Campus Security Policy and Campus Crime Statistics Act of 1998, and CSUSM University Police Department's policy, we are issuing this notice of reports and allegations of disturbing acts of violence:\n\nREPORTED INCIDENTS: The California State University San Marcos University Police Department received a report of sexual assault (rape) over the weekend of May 4, 2014 at an off-campus party hosted by the Tau Kappa Epsilon (TKE) fraternity and its members (TKE is not a recognized CSUSM student organization). TKE is also known as \"The Kollege Experience.\" The circumstances of the alleged assault suggest the involvement of date rape drugs and that the assailant is alleged to be a member of TKE. The University Police Department is working with the Oceanside Police Department in their investigation of this incident, which is ongoing.\n\nThe university has received additional reports of sexual assaults purportedly involving the Tau Kappa Epsilon fraternity and its members. These additional alleged incidents were described as having occurred on or near the university campus, and at off-campus residences allegedly inhabited by TKE members. Other alleged recent criminal behaviors related to the TKE fraternity include, but are not limited to, pervasive hazing, illegal victim/witness intimidation, harassment and tampering, vandalism, providing drugs and alcohol to minors, and illegal drug use.\n\nVictim/witness intimidation and harassment constitutes illegal retaliation, could result in criminal charges if it interferes with a criminal investigation, and will not be tolerated.\n\nPLEASE BE ADVISED: TKE is not a recognized student organization at CSUSM. However, most of its local members are believed to be current CSUSM students, some of whom are alleged to have engaged in these unsafe and violent behaviors directed toward other CSUSM students. TKE lost its recognition as a student organization in 2005 as a result of underage alcohol use and failure of the organization to maintain academic standing required of recognized fraternities and sororities. All recognized student organizations at CSUSM participate in an advisement and education program. Additionally, recognized student organizations have a responsibility to conduct themselves in a manner reflective of the university's core values including respect, inclusivity and diversity. Recognized student organizations must have organizational policies that are consistent with those of the university including regulations involving non-discrimination and no hazing.\n\nSUSPECT: White male, 19 years old, 5'9\" and 130 lbs., blonde or brown hair and blue eyes. Other suspects yet to be identified.\n\nBecause there has been more than one report, and because of the nature and severity of the alleged criminal behavior, we consider these reports to represent a potentially serious and continuing threat to students and others in the university community, and that conditions may continue to exist that may pose a threat to the campus community into the future. While all reasonable precautions are being taken by law enforcement and the university, it is our duty to warn of possible dangerous conditions on or near the campus. You should carefully consider whether your presence at or near TKE social events and parties could place you in danger of sexual assault, date rape drugs, or similar illegal drug or alcohol use and abuse.\n\nThe phenomenon of drugs being used to facilitate sexual assault has been widely reported across the country. The CSUSM Police Department urges the university community to be alert to the possibility and take steps to protect themselves. Date rape drugs, commonly known as Rohypnol, GHB, and Ketamine, can be slipped into an unsuspecting person's drink. Rapid and severe intoxication follows, along with dramatically reduced inhibitions and memory loss. In this condition, anyone can be extremely vulnerable to sexual assault.\n\nTo protect yourself, do not leave drinks unattended and be wary of accepting drinks from people you do not know well. To be even more careful, make sure that you open and pour your own drink, and don't share drinks with others. It is also wise to use the buddy system while socializing – when you go out with friends, agree to keep an eye on one another and to go home together. If a friend exhibits symptoms of severe intoxication, and/or date rape drug ingestion, seek medical help immediately. Signs to look for include: dizziness and/or nausea, memory loss, breathing or motion difficulties, acting disproportionately intoxicated relative to the alcohol consumed.\n\nIf you or anyone you know has been the victim of such illegal conduct, including threats, intimidation and/or retaliation, please report these incidents to the university, local law enforcement or the California Attorney General's Office (at the contact numbers indicated below).\n\nCONFIDENTIAL SUPPORT: Victims of any form of sexual harassment or assault are also strongly encouraged to seek confidential support at CSUSM's Student Health and Counseling Center, 120 Craven Road Suite 100, (760) 750-4915; office hours are Monday-Friday, 8:00 am – 4:45 pm. Off campus, The Center for Community Solutions offers a 24-Hour toll free County-wide crisis line for crisis intervention and information referrals related to sexual assault in San Diego at 1-888-385-4657 (FREE). More information is available at http://www.ccssd.org/. Reporting to a confidential counselor or sexual assault advocate WILL NOT RESULT IN A REPORT TO LAW ENFORCEMENT OR THE UNIVERSITY. These counseling professionals are required by law to keep your identity and information confidential.\n\nIn emergency situations, always dial 911.\n\nIf you have any information that might be helpful in the ongoing administrative or criminal investigations related to these incidents, please contact the CSUSM SAFE line at (760) 750-SAFE or University Police at (760) 750-4567. If you wish, you may report anonymously by calling the CSUSM SAFE line. You may also contact the following to make a report:\n\n·       Oceanside Police Department, Case # 14-005745: (760) 435-4900\n·       San Diego County Sheriff's Department: (858) 565-5200\n·       The California Attorney General's Office: Deputy Attorney General Jodi Cleesattle at (619) 645-3150 or jodi.cleesattle@doj.ca.gov\n·       Dr. Bridget Blanshan, CSUSM Title IX Coordinator: (760) 750-4056 orhttp://www.csusm.edu/title9/\n·       Crime Stoppers (888) 580-8477",
    "comments": [
        {
            "level": 0,
            "comment": "Why would you join a frat that isn't even recognized by the university?\n\n\nEdit: Ahh, I've cracked the case. This is on the front page of their website: \n\n\"Although scholastics and community involvement are of the utmost importance to our chapter, we still believe in a “well-balanced diet” which includes a healthy amount of college social interaction. Dubbed “The Kollege Experience” (TKE) our chapter continues to host some of the most reputable nightlife experiences San Marcos, and the surrounding community has seen.\"\n\n",
            "score": 9,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "If all this is true, then I hope this rotten fraternity chapter crashes and burns.  It's not the 70's anymore, this shit ain't gonna fly.  I don't know if CSUSM has the legal authority to do anything about this, since they're already unaffiliated with the fraternity, but at the very least I hope they're ostracized by everyone in San Marcos.  \n\nAlso, if the assault happened back in May, why are we getting notified about it now?  Did the victim just recently come forth and report it, or did the police just decide they only now have ample information to warrant this email?",
            "score": 7,
            "author": "Kikiteno",
            "replies": [
                {
                    "level": 1,
                    "comment": "Possibly intended to coincide with start of the semester on Monday. Also, today is move in day for many students. ",
                    "score": 6,
                    "author": "Mistajustin"
                },
                {
                    "level": 1,
                    "comment": "I wondered why we just heard about it now too. Maybe because they wanted the freshmen to have it in their e-mails as well so they know who to avoid. TKE is a notorious roofy crew at CSUSM. About time they GTFO.",
                    "score": 4,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This sounds just like TKE. CSUSM knows how to party, it's just that it's done privately and quietly. [TKE has a history](http://www.10news.com/news/4-arrests-made-taser-used-in-wild-san-marcos-house-party) and they just don't know how to get drunk without making it into the news. ",
            "score": 3,
            "author": "oOoleveloOo",
            "replies": [
                {
                    "level": 1,
                    "comment": "They have a history of rape and overall douchery. If it's done quietly or not it makes no difference. ",
                    "score": 5,
                    "author": "douchebaglevel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ok, let me clarify, I didn't mean keep quiet about rape. I meant that they don't know how to party without \"being quiet\" meaning bringing attention to yourself by breaking the law. It is possible to party without breaking laws and bringing attention to yourself. ",
                            "score": 3,
                            "author": "oOoleveloOo"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I remember this, but I didn't realize it was also TKE.  Those guys really need to just fuck off.",
                    "score": 4,
                    "author": "Kikiteno"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Exonerated.",
            "score": -1,
            "author": "dmher"
        }
    ]
}