{
    "id": "yvperw",
    "score": 6,
    "title": "What are the chances of ever getting one of the studio dorms?",
    "author": "thrustnbust123",
    "date": 1668495075.0,
    "url": "https://www.reddit.com/r/csusm/comments/yvperw",
    "media_urls": [],
    "other_urls": [],
    "postText": "I submitted an application in an attempt to get a studio dorm in the UVA building. There was already a waitlist when I applied. How long are the waitlists? I imagine there must be hundreds of people on the waitlist. With that being said, should I ever expect to get in? I’m thinking that it might take a few semesters, if I can ever get in at all.",
    "comments": [
        {
            "level": 0,
            "comment": "*Writing this from my studio dorm at the moment*\n\nI applied for a studio dorm and got an agreement to sign just days later. It's based on what's available when they get to your name on a list, it's not in order of who applied first. That's what I understood from how it was worded anyway. So if there's a studio open when they get to processing your application, it'll be offered to you. \n\nIf my understanding is correct, then it's based on pure chance. Hopefully you're lucky enough when they get to your application :)",
            "score": 5,
            "author": "SFDinosaur2019",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s crazy. Must’ve gotten super lucky. I’m jealous. I’m not expecting to get a studio pretty much ever but we will see I guess. How’s living on campus btw? I’m aware that the school is no SDSU but I can’t imagine it’s too bad. Would you say that moving into the studio has been worth it?",
                    "score": 3,
                    "author": "thrustnbust123",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's great! Campus is beautiful. Visit sometime, if you haven't already. You get to see the prettiest sunsets. \n\nOther than some really noisy neighbors, my experience living in a studio dorm has been wonderful. Definitely worth it - I think what you get for the price is excellent, considering what the current housing market looks like. \n\nGood luck, hope you get what you're after!",
                            "score": 2,
                            "author": "SFDinosaur2019",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Are you a freshman right now or did you transfer from a community college btw?",
                                    "score": 1,
                                    "author": "thrustnbust123",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I transferred :)",
                                            "score": 1,
                                            "author": "SFDinosaur2019",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh awesome, yeah I’ll be transferring as well. What is your major? I’m transferring with a major in business administration with a focus in accounting",
                                                    "score": 1,
                                                    "author": "thrustnbust123",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Awesome! Accounting is a good major to have - I could never. I'm terrible with math haha. \n\nI also transferred with a business administration degree, but my emphasis is in marketing :)\n\nSave yourself some trouble and research all of your professors beforehand. Some of the business professors are tough and have a reputation around campus for being that way.",
                                                            "score": 1,
                                                            "author": "SFDinosaur2019",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yea I’m hearing that the accounting classes are tough. Have you been able to make friends at csusm? I hear that the social life there isn’t all that great. I’m rather introverted which doesn’t make things easier. Apparently you have to join clubs and the Greek societies and really go out of your way to make connections.",
                                                                    "score": 1,
                                                                    "author": "thrustnbust123",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yeah! I was very nervous and introverted before I came here as well. It's definitely what you make of it. You can go through your whole time on campus avoiding people and keeping to yourself, if that's what you choose. \n\nComing from 200 miles away and not knowing anyone in the area, I chose to make the best of it. I talk to the people next to me in class and try to join conversations I see happening after class. Becoming friends with the people you share classes with is great, because you know you'll see them every week. You might even make a friend just talking to someone in line at Starbucks. It doesn't take much. If you're a decent person to be around, which I'm sure you are - most people are willing to have a chat with you. Sometimes you have to start the conversation or get involved, which isn't always easy - but again, it comes down to if you wanna make the most of things. \n\nI didn't think I'd be able to make friends at first either, I was worried coming here alone. Now I see people I know around campus everyday, and they're very cool people :)\n\nI have been to one club meeting and know nothing about Greek life, not involved in that at all. \n\nAnd if you'll be here next semester - let me know and I can show you around campus sometime! Seriously, I love showing people what this campus has to offer. I'd love to show you all the cool study spots and resources available to you :)",
                                                                            "score": 1,
                                                                            "author": "SFDinosaur2019",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I assume you came from San Fran given the username. I could never travel that far away from home. Don’t think I have the courage to do that at the moment. I’m definitely gonna try and join some clubs so that I can meet new people. I will indeed be there next semester and would love a little tour. Is there a social media that I could contact you through other than Reddit? I don’t use Reddit as much as Instagram for example.",
                                                                                    "score": 1,
                                                                                    "author": "thrustnbust123",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}