{
    "id": "11elon3",
    "score": 3,
    "title": "Ccny biology?",
    "author": "[deleted]",
    "date": 1677622430.0,
    "url": "https://www.reddit.com/r/CCNY/comments/11elon3",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone I got accepted into ccny for the fall. Before I make a choice I want to know what are the pros and cons as a bio major or student in genera? Did you like it here? How is the tutoring service like? Thanks",
    "comments": [
        {
            "level": 0,
            "comment": "Hey! I also got accepted to the CCNY biology program. Let's be friends",
            "score": 2,
            "author": "Plastic_Foundation53",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why not? Do you plan on going in the fall?",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah! I'm going this fall. I'm an international student btw. The Bio department is good. I heard the math department was not so great.",
                            "score": 2,
                            "author": "Plastic_Foundation53",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Really but they’re known for stem? Also congratulations! Where are you coming from if you don’t mind me asking?",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I’m from Nepal",
                                            "score": 1,
                                            "author": "Plastic_Foundation53",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Ooh nice!",
                                                    "score": 1,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm not a bio major (doing biochem), but I am taking intro to bio 2. This is my first semester here as a transfer, so I can't speak on intro to bio 1. So far, I like the class. It's a lot of busy work imo, but it is doable with good time management. Some of the labs are also in different areas of nyc, which is kinda cool.  Tutoring seems to be very accessible, but I can't speak on its quality since I've never felt the need to use it. \n\nCcny is a good school, and I really like being here. Nyc is a cool place. The school does have some downsides, but they don't bother me much. I'll list some out. Ccny is a commuter school, so it can be a little harder to make friends. Many of the buildings are old and need renovations. The Wingate gym is lacking imo. The nac building is terrible, but you are a bio major, so you won't be in there much. \n\nThe positives about ccny outweigh the negatives for me, but it might not be the same for you.",
            "score": 1,
            "author": "RecycledExistance",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for responding! Different areas of nyc? Isn’t that inconvenient in a way? And yes I went on a tour and I really liked it so I hope the pros really do outweigh the negatives, thank you again!",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You're welcome! Almost all the labs are at ccny, only like 2 of the 10 are somewhere else.  The class I'm in has one at the natural history museum and one at Inwood Park.\n\nCcny is awesome, and I'm sure you'll really like it here!",
                            "score": 2,
                            "author": "RecycledExistance",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you so much!",
                                    "score": 2,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}