{
    "id": "13f6dpl",
    "score": 1,
    "title": "PHYS 20800 Summer Class",
    "author": "joeshenn",
    "date": 1683854407.0,
    "url": "https://www.reddit.com/r/CCNY/comments/13f6dpl",
    "media_urls": [],
    "other_urls": [],
    "postText": "Im not a CCNY student but I've decided to take PHYS 20800 here to transfer the credits over to my university and I cam across an issue. CUNYFirst wont let me enroll in it bc I don't have the pre-reqs. I'm technically taking the pre-reqs at my school this semester and I uploaded the syllabus for calc 3 and mechanics. My concern is that there isn't much space in the class and that Im not sure if they will let me enroll bc my transcript isn't the most updated at the moment.",
    "comments": [
        {
            "level": 0,
            "comment": "Yeah... you're most likely not getting a seat unless you go down to CCNY and explain the situation",
            "score": 1,
            "author": "T2C247",
            "replies": [
                {
                    "level": 1,
                    "comment": "i got the last spot thankfully",
                    "score": 1,
                    "author": "joeshenn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Wow, good work. Who's teaching it? I took it in like 2017 I think and an NYU professor taught it in the summer at CCNY. Was pretty cool",
                            "score": 1,
                            "author": "T2C247",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Salvatore Di Bartolo, couldn't rlly find anything abt him online",
                                    "score": 1,
                                    "author": "joeshenn",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh wow that's him\n\n[https://www.ratemyprofessors.com/professor/189533](https://www.ratemyprofessors.com/professor/189533)\n\nYou can't find anything of him online from CCNY ratemyprofessors because ratemyprofessors seems to have reset the whole site for some professors when they did their website refresh. \n\nListen it was pretty easy to get an A in his class. I was being lazy cause it was summer and I threw away a free A which many people got. Maybe he's a bit different now. But pretty easy quizes, gave good prep material for exams. Hopefully it's still the same.",
                                            "score": 1,
                                            "author": "T2C247"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}