{
    "id": "13tayod",
    "score": 3,
    "title": "Schedule advising",
    "author": "SecretWintery",
    "date": 1685202917.0,
    "url": "https://www.reddit.com/r/CCNY/comments/13tayod",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello everyone, I need some advice on scheduling as some classes I have registered have prerequisites and requirements. The classes are gen chem 1 and calc 1, they both require a c minimum in math 195. I got a D in math 195 which is passing but i already am registered for gen chem 1 and calc 1. All my other classes I received A’s but unfortunately due to a bad professor I received a D in math 195. I am not sure if it is absolutely required to get keep taking 195 until I meet minimum requirements or I can just move along without having to take it again. I was advised to speak with my advisors and maybe convince them to allow me to take gen chem and 195 together in the fall if i do plan on taking it again. How do I go about this situation?",
    "comments": [
        {
            "level": 0,
            "comment": "I took college algebra and then skipped precalc, went straight to Calc 1. I think you can probably reason with your advisor if they try to boot you.",
            "score": 2,
            "author": "hartguitars",
            "replies": [
                {
                    "level": 1,
                    "comment": "How did you skip pre calc? I’m an incoming freshman majoring in CS and I got placed in math 190 but I need calc 1. How’d you manage to skip the course and was it worth it?",
                    "score": 1,
                    "author": "ReporterSweaty9193",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I was a transfer student with no math credits (but 105 overall credits). Technically I was a ‘senior’ even though it was my first year at CCNY. I took the placement test and was put in college algebra/trig. At the end of the semester I was able to enroll in Calc 1 (thanks CUNYFirst). No one said anything to me, so I just showed up the first day. I had a great algebra instructor (he was also my Calc 1 instructor) and he gave me some stuff to study over the winter break. I got a 100 in both classes, so I’m happy that I was  able to slip precalc, it would have been a waste of time and money for me",
                            "score": 2,
                            "author": "hartguitars",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wow congrats. That’s great! Who was your professor if you don’t mind me asking, I’m gonna take college algebra in the fall and need some recommendations?",
                                    "score": 1,
                                    "author": "ReporterSweaty9193",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "you can actually take a look at all the professors in the math 190 department by searching up math 190 ccny, they name all the professors and at what time they teach, i took college algebra with Lavinia Ciungu and she was amazing",
                                            "score": 2,
                                            "author": "SecretWintery"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Unfortunately he was a grad student that left shortly after I had those classes",
                                            "score": 2,
                                            "author": "hartguitars"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "same thing happened to me, i’m still enrolled in calc 1 and gen chem 1 even tho i didn’t meet the prerequisites. I guess i’ll go with your advice and probably go along with it, if someone questions me i’ll speak to my advisors",
                                    "score": 1,
                                    "author": "SecretWintery",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you feel decent with your skills I would recommend plugging forward. If you are nervous, study over the summer so you are prepped for the fall. Either way I would skip any classes I could.",
                                            "score": 1,
                                            "author": "hartguitars"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}