{
    "id": "vecuus",
    "score": 5,
    "title": "Incoming CCNY-student, coming back after 6-years! Where are the best places to eat?",
    "author": "10pumpsclassic",
    "date": 1655471490.0,
    "url": "https://www.reddit.com/r/CCNY/comments/vecuus",
    "media_urls": [],
    "other_urls": [],
    "postText": "I graduated back in 2016, so it's a homecoming and reunion of sorts. I had so many places to eat on campus; halal food, Subway's, McDonald's, the NAC Cafe, Cafe One, deli across Amsterdam or Convent. What are some new places to eat?\n\nMainly looking for pasta, or rice, or sandwiches. You know, college-people food. \n\nThanks.",
    "comments": [
        {
            "level": 0,
            "comment": "The McDonalds is no longer there! The NAC Cafe upgraded and it’s not longer the same /: Cafe one is still good. Halal is a classic. Fumo across the street has some amazing Italian food. It’s pricy but so good. Next to it is their pizza place and it’s awesome. And next to that is an Indian place. They have a lunch buffet that’s filling. The Grange is also pricy but very good. For fresh juices I like yellow banana. The delis are all also pretty good",
            "score": 2,
            "author": "MindlessWarning7252",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks for responding. Which is your favorite? Is the Subway sandwich restaurant still there? Mainly looking for quick bites to eat, that I can chomp down in 15 or so minutes.",
                    "score": 1,
                    "author": "10pumpsclassic"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Bunch of idiots protested the NAC food areas demanding free food and saying have to pay for food is greed, capitalist this that. Welp they chased out the food vendors, and for the following semester there was NO food from the area. It was utterly ridiculous. Ever since then it wasn't the same although I graduated around 2 years ago. There was 1 vendor and basically that was it.",
            "score": 2,
            "author": "T2C247",
            "replies": [
                {
                    "level": 1,
                    "comment": "The food is free at NAC? I just had orientation and they said nothing about it being free",
                    "score": 2,
                    "author": "Ottobre14",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, I said idiots demanded all food be free.",
                            "score": 2,
                            "author": "T2C247",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Got you",
                                    "score": 1,
                                    "author": "Ottobre14",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I hope there's more food vendors, there's a good deli and others across the street from the nac",
                                            "score": 1,
                                            "author": "T2C247"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}