{
    "id": "140059s",
    "score": 3,
    "title": "Meal Plan",
    "author": "Izukusnovia",
    "date": 1685850840.0,
    "url": "https://www.reddit.com/r/CSUSB/comments/140059s",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was wondering as an incoming freshman what meal plan would you suggest ? Also how is the food?",
    "comments": [
        {
            "level": 0,
            "comment": "i had 15 meals per week the first semester and dropped down to 12. if you will be going home a lot i would suggest the 12/10 per week. \nhonestly the dining hall isn’t the worst, there are amazing days, and then there’s the REALLY bad days. meal swipes cannot be used outside the dining hall / howl and growl (on *special* occasions [ex: days when the dining hall is closed + nothing else is open]. with the meal plan comes dining dollars, which can be used (tax free) at any restaurant on campus. they do roll over from fall to spring semester if u have any left. \nhope this helps!",
            "score": 3,
            "author": "aliciaishere"
        },
        {
            "level": 0,
            "comment": "I usually get 12 meals a week.",
            "score": 1,
            "author": "JackfruitSwimming683",
            "replies": [
                {
                    "level": 1,
                    "comment": "how’s the food?",
                    "score": 1,
                    "author": "Opaguex",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Honestly, it hasn't been that great since 2021. You're better off getting food off-campus. There's more variety.",
                            "score": 2,
                            "author": "TheNerdWonder",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "does the meal plan work for the habit or just the cafeteria there? eating off campus all the time sounds like it’ll be a ton of $",
                                    "score": 1,
                                    "author": "Opaguex",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Meal plan is exclusively for commons, but it comes with money you can use at the habit.",
                                            "score": 1,
                                            "author": "JackfruitSwimming683",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "How’s the commons to you? Average ?",
                                                    "score": 1,
                                                    "author": "Opaguex",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Some stuff is good, but less restaurants are active now.",
                                                            "score": 1,
                                                            "author": "JackfruitSwimming683",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I was just browsing and trying to get an idea since I will be transferring next year, and want to plan financially. I’m not too picky with food so I might have to just eat at the commons with a plan.",
                                                                    "score": 1,
                                                                    "author": "Opaguex",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Oh in that case, it might be economical to get the plan. You can actually take food out.",
                                                                            "score": 1,
                                                                            "author": "JackfruitSwimming683",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "That’s good to hear, since i’m gonna be a commuter approximately 1hour drive I will have to eat one way or another either off campus or on campus. Off campus seems like it would be too expensive if you eat 2-4 a week.",
                                                                                    "score": 1,
                                                                                    "author": "Opaguex"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}