{
    "id": "woej3d",
    "score": 7,
    "title": "Has anybodys Financial Aid disburments or refunds gone through?",
    "author": "YerBoii244",
    "date": 1660505335.0,
    "url": "https://www.reddit.com/r/CSUSB/comments/woej3d",
    "media_urls": [],
    "other_urls": [],
    "postText": "I think for everybody the finical aid disbursements, or when they are applied to your account, were on the 11th of this month (8/11/2022). But nothing happened that day for me and neither for a friend of mine. I have direct deposit set up and don't have any other charges dues besides Fall now. I'm not sure if this happened to me last year but from what I see in my finical acticvity was that all aid went through the same day as well.  I'm kinda worried that I have some sort of hold or issue with enrollment that I can't see, my \"Holds\" and \"Tasks\" are empty. Did anybody have their financial aid go through?",
    "comments": [
        {
            "level": 0,
            "comment": "Had mine go through after two days of the indicated disbursement date. Might be slightly delayed this time around.",
            "score": 4,
            "author": "DauntlessCulprit"
        },
        {
            "level": 0,
            "comment": "Mien and through on the 12",
            "score": 2,
            "author": "eucalyptusbaby"
        },
        {
            "level": 0,
            "comment": "I’m still waiting on mine. I set up direct deposit the day prior so maybe I’m getting mine in the mail? Hopefully 😬",
            "score": 2,
            "author": "Dan_man25"
        },
        {
            "level": 0,
            "comment": "Still nothing 🥲",
            "score": 2,
            "author": "AffectionateFilm4495",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea me neither",
                    "score": 2,
                    "author": "YerBoii244"
                },
                {
                    "level": 1,
                    "comment": "YOOO I just got mine right now",
                    "score": 1,
                    "author": "YerBoii244"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I got mine the 12th this time but last fall semester even though I had direct deposit they sent it through the mail it was like a week after.(no holds or anything too)",
            "score": 1,
            "author": "Poyo1388"
        },
        {
            "level": 0,
            "comment": "mines got disbursed today but I'm waiting for it to hit my credit union. Hopefully it hits today or it might come in the mail so crossing my fingers",
            "score": 1,
            "author": "crzyazn26",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh, usually if you have direct deposit enabled it would transfer the remaining aid the next day.",
                    "score": 2,
                    "author": "YerBoii244",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thanks 🙏",
                            "score": 1,
                            "author": "crzyazn26"
                        },
                        {
                            "level": 2,
                            "comment": "do you know what time the disbursements hit your account?",
                            "score": 1,
                            "author": "crzyazn26",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not sure, I can't really see the time of the refunds but my \"financial activity\" page shows that its about 1 day after aid is distributed that I get the extra, I've had only one instance where it took 2 days",
                                    "score": 1,
                                    "author": "YerBoii244"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "On the \"activity\" page for financials, does the disbursements show as 8/16 or 8/10 for the posted date?",
                    "score": 1,
                    "author": "YerBoii244",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It shows it’s posted for today.",
                            "score": 1,
                            "author": "crzyazn26",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Alrighty, thank you, hopefully mines get through soon.",
                                    "score": 2,
                                    "author": "YerBoii244",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Has yours went through? Mine has went through yet",
                                            "score": 1,
                                            "author": "AffectionateFilm4495",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Nope",
                                                    "score": 1,
                                                    "author": "YerBoii244"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did you by any chance take any summer classes?",
            "score": 1,
            "author": "Nice-Log-6037",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea",
                    "score": 1,
                    "author": "YerBoii244",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I called rn and they said that people who took summer classes have to wait until their SAP report processes and that should be either today or tomorrow",
                            "score": 2,
                            "author": "Nice-Log-6037",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "ohhh, that makes sense, thank you",
                                    "score": 1,
                                    "author": "YerBoii244",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Heyy can you please keep me updated when your fafsa gets disbursed. I'm in the same boat as you haven't received it yet. But just yesterday I recieved the SAP email. So I'm hoping I receive it tonight",
                                            "score": 1,
                                            "author": "AffectionateFilm4495",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yea absolutely, you got a sap report for summer? I only have a sap report from spring 2022.",
                                                    "score": 1,
                                                    "author": "YerBoii244",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Heyyy honestly it does not say, but I know I got one back in July and one just yesterday so I I'm assuming the one I got yesterday was the one that I needed to have my funds reimbursed",
                                                            "score": 1,
                                                            "author": "AffectionateFilm4495"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}