{
    "id": "13ukyu5",
    "score": 10591,
    "title": "Rebecca F Kuang rejects idea authors should not write about other races",
    "author": "trisul-108",
    "date": 1685335123.0,
    "url": "https://www.reddit.com/r/books/comments/13ukyu5",
    "media_urls": [
        "https://www.theguardian.com/books/2023/may/28/rebecca-f-kuang-rejects-idea-authors-should-not-write-about-other-races"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "I agree with her.",
            "score": 3537,
            "author": "sirbruce",
            "replies": [
                {
                    "level": 1,
                    "comment": "Americans' obsession with race is weird to me.\n\nI mean, it makes sense given how big a deal Americans like to make about their ancestry, but I find it very strange.\n\nGoing around telling people what they are and aren't allowed to do based on the colour of their skin is, to my mind, exactly the kind of thing we should be trying to get away from, not moving towards.",
                    "score": 2739,
                    "author": "moepsenstreusel",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's segregation with extra steps.",
                            "score": 846,
                            "author": "wants_the_bad_touch",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nah, it's actually with a few steps less. It always starts with policing the mind. Thoughts, then words, then deeds. Zarathustra had this figured out 3 thousands years ago already.",
                                    "score": 336,
                                    "author": "Akhevan",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I just had a conversation at a BBQ with people who were so turned in circles by what they should and should not say/do according to some nameless authority that somehow presided over their lives but they couldn't point to... Can't question this, have to be in favor of that, but unable to really explain why.\n\nFear is why. Why would you be afraid of holding an unpopular opinion, if it's what you've thought through and believe? Because other people have been hurt for not simply accepting a prevailing opinion without argument. \n\nIt's just strange to me. I'm not averse to change, but I won't change my view on something because others say I should. I'll think it over. When did that become wrong?",
                                            "score": 188,
                                            "author": "HawkeyGawds",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It’s really a bad thing this overly sensitive mentality that’s caught on. I’ve had a lot of similar experiences in the last 5 years. It’s become increasingly difficult to have an actual conversation without it devolving into a discussion of who’s allowed to say what, who’s racist, who can be racist, who can experience racism, the difference between racism and prejudice… it’s maddening frankly. It’s even worse because you can’t even talk about it without someone getting way too upset, then the whole discussion is ruined, nothing was said about the actual issues and people resent each other.",
                                                    "score": 75,
                                                    "author": "GlorifiedBurito",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I saw this perfectly illustrated at a festival last summer. Long running \"hippie\" festival, they had a \"tolerance zone\" or something like that. A \"space for all non-traditional genders and sexualities to gather and discuss and share in tolerance.\" But with the very specific caveat \"two-spirit identities will *not* be tolerated\".\n\nSame festival, a friend of mine sells his art, which sometimes contains PNW native motifs. He's gotten shit for it because he is white and blonde. To the point that he tries to go out of his way not to incorporate any of it anymore. His grandfather lived in a longhouse in BC. Is he supposed to hang up his ancestry.com results like a liquor license to sell his art?",
                                                            "score": 104,
                                                            "author": "PM_ur_Rump"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "An increasing proportion of the population lack the ability or desire to think critically, or go against the grain in any meaningful way",
                                                    "score": 89,
                                                    "author": "3ntrops",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Segregate the book characters!!!!",
                                    "score": 33,
                                    "author": "sillyadam94",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "It's racism with no extra steps",
                                    "score": 10,
                                    "author": "McFeely_Smackup"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[This you](https://www.reddit.com/r/bestof/comments/13q1p3q/uquothe_answers_the_question_why_do_racists/jm15wzb/)? \n\n&gt;It's not rocket science.\n&gt;\n&gt;Anti-gypsy sentiment is so widespread for the simple reason that negative experiences with gypsies are so widespread.\n&gt;\n&gt;It's not a case of, \"I hate gypsies because I was raised that way\", but rather of, \"I dislike gypsies because almost every interaction I have had with them has been unpleasant.\"\n&gt;\n&gt;There's surely a lot of confirmation bias — you can't tell a gypsy just by looking, and a lot of gypsies keep quiet about their heritage.\n&gt;\n&gt;The upshot is, 99% of the gypsies you knowingly encounter will be up to \"typical gypsy\" stuff, i.e. begging, thieving or something else anti-social.\n&gt;\n&gt;Even a lot of liberals dislike them because they fuck things up for other immigrants. A very deprived area near here called Marxloh was making a decent go of it — Turkish immigrants had established a cottage industry for bridal wear, and it became regionally renowned as the place to go for a wedding dress.\n&gt;\n&gt;Then a few years ago, loads of gypsies moved in, and now it looks like this because putting waste in the provided receptacle is apparently just too fucking much for them. And now nobody goes to Marxloh any more.",
                            "score": 336,
                            "author": "bony_doughnut",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lmao. What a fucking hypocrite",
                                    "score": 172,
                                    "author": "ReptAIien",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No offense to Europeans but that hypocrisy has been my entire experience with European redditors.",
                                            "score": 179,
                                            "author": "RemodelingMyself"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I know it looks like it from the news, media and such, but Americans don't have an obsession with race. What you are seeing is a vocal minority having their loud rantings picked up by a media looking for anything that will draw people's anger and other emotions to generate engagement. The majority of Americans don't give a fuck about who writes what as along as its good writing.",
                            "score": 441,
                            "author": "Waywardson74",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You're not wrong. \"X sparks outrage\" basically means \"X sparks click-hungry journalists to manufacture outrage\".",
                                    "score": 142,
                                    "author": "goatamon"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; The majority of Americans don't give a fuck about who writes what as along as its good writing.\n\nI'd argue the majority of everyone doesn't have a clue what race an author is in the first place. I have read all of Andy Weir's books and I have no clue what he looks like. Andy could be a female or male name and he/she could be a giant with elephantiasis for all I know.",
                                    "score": 72,
                                    "author": "OutlyingPlasma",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Compared to other countries, Americans are definitely way more racially conscious. Way more.\n\nIt's generally a good thing though. In my experience Americans are generally less prejudiced. People in other more homogeneous countries are openly pretty prejudiced but they don't get backlash because culturally it's not a big deal like it is in the US.",
                                    "score": 256,
                                    "author": "hoffmanmclaunsky",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Americans are more racially conscious because they live in a more racially diverse country. Not hard to see why Americans would be more mindful of race than those in more homogeneous countries",
                                            "score": 153,
                                            "author": "BirdLawProf",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Well put. I was floored by the casual racism I saw in Europe.",
                                            "score": 124,
                                            "author": "TheSnarkling",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Australia as well",
                                                    "score": 53,
                                                    "author": "argothewise"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Very true, the US is one of the most diverse places on the planet. Definitely far from perfect but a lot farther along working through the issues than a lot of the European monocultures.",
                                            "score": 46,
                                            "author": "Bourbon-neat-"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "9 out of 10 times when I'm taking part in some online study or survey and they ask me for my race or ethnicity it's an American study. In most other countries researchers for the most part just don't care about your race.\n\nIt's understandable giving the U.S.' culture but these things can seem obsessive to an outsider who got nothing to do with all of that.",
                                    "score": 59,
                                    "author": "Oninonenbutsu",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Nah that part is a good thing. Other countries barely have data available on racial/ethic disparities. For example, have you ever tried to find data about France's muslim minority? It's fuckin hard. But, idk, it feels like it would be useful to know what's happening with their youth unemployment rate... When the data we *do* have from a decade ago shows it was at disgustingly high rates (40%+ (see [here](https://www.economist.com/europe/2013/02/23/forgotten-in-the-banlieues),  but this is not the study I'm thinking of that showed it nationwide among muslim youths, which I'm having trouble finding)) due in large part to [discrimination](https://archive.is/239A2).\n\nThe truth is that a huge number of countries have similar, though obviously different, problems to the U.S.. Closing your eyes to those problems is not a way to fix them. For reference, the U.S. has monthly &amp; quarterly stats of the unemployment rate among our various subgroups. Muslims in the U.S. are actually employed at similar rates to the general population, so our most comparable subgroup would be young african americans - who have an [unemployment rate of ~14%](https://www.bls.gov/news.release/empsit.t02.htm).",
                                            "score": 136,
                                            "author": "SoMuchForSubtleties",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Canadian, and we have a very similar and weird attitude to race as the US, for similar historical reasons. Less slavery, but otherwise similar.\n\nI can't remember what is asked on the census exactly, but it is similar to many surveys, and there is a \"race\" analog usually, \"ethnic background\" or something similar.\n\nUsually it's a \"check all that apply\" deal, so that gets messy for me. My ancestors were pretty open about who they married.",
                                                    "score": 17,
                                                    "author": "GrimpenMar",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Lots of countries that are not the US are pretty much racially homogenous. Yes they have other ethnicities, but they are still mostly homogenous. Other countries are like wow its so weird in the US with all this talk, but they don't have the same dynamic of a melting pot like the US does. \n\nWe talk about race because as others have pointed out its to make sure no one gets overlooked. In more homogenous countries that tends to happen. \n\nOther countries pretend they don't have an issue, because they have smaller minority populations. But there's definitely a lot of hidden racism.",
                                            "score": 199,
                                            "author": "vertigo42",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Europeans will tell people with dark skin that no matter what language they speak or where they were born, they will *never* be German/Swiss/Italian/etc. and then condescend Americans when it comes to race.",
                                                    "score": 259,
                                                    "author": "Kinda-Reddish",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "And most of them are all \"fuck all Romani\" while also telling us Europe doesn't have racism. Oh but the Romani don't count. They're sub-human. Totally not racism.",
                                                            "score": 47,
                                                            "author": "onioning"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Its really wild to see that and they don't see the hypocrisy when criticizing the USA.",
                                                            "score": 122,
                                                            "author": "vertigo42",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Or that they’ve shifted all the blame of AST and European Colonialism on the US. \n\nSure the US said will be got the good bad guy as government policy after the Philippine American War, but the average American doesn’t care and barely benefits from this.",
                                                                    "score": 56,
                                                                    "author": "mramisuzuki",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "AST?",
                                                                            "score": 3,
                                                                            "author": "Tal_Vez_Autismo",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I’m not him but I assume Atlantic Slave Trade",
                                                                                    "score": 16,
                                                                                    "author": "Skyllama",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "There is an unstated view in European history that WW1/WW2 wiped the slate clan so their past actions no longer matter therefore now everything is America's fault.",
                                                                            "score": 27,
                                                                            "author": "Puzzled-Rope-5392",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Europeans will do that to any ethnicity, not any race. \n\nA Pole or an Italian living in Germany will never be German either.",
                                                            "score": 30,
                                                            "author": "donjulioanejo"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "One time I was talking to a Scottish guy who was saying that Americans should stop claiming their genetic heritage as an identity and solely adopt the national identity.\n\nI said that was rich coming from the Scot with his 90% genetically homogenous country.\n\nHe said he wasn't Scottish, he was Brown. \n\nThen he realized what he said and rage quit the conversation and blocked me.",
                                                            "score": 80,
                                                            "author": "peachwithinreach",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "My fave thing about Brits who say that is is that they’ll mock an American for trying to own any ancestry, even if it’s just a few generations back, but will then turn around and with a totally straight face tell you the British Royal Family is German even though no member of that family has been born in Germany for well over a century.",
                                                                    "score": 70,
                                                                    "author": "Commercial_Place9807"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "They live in countries where protectionist immigration policy has ensured that their populations are 95% white people, then talk about how they don't understand why the US is so racist. Europeans think that not talking about or acknowledging racism in Europe = no racism.",
                                                            "score": 66,
                                                            "author": "koreanwizard"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "There is a *vast* difference between asking what your race/ethnicity is and being unhealthily obsessed with race.\n\nBeing weirded out by people asking what your race is is definitely a place I don’t think Americans should return to.",
                                            "score": 60,
                                            "author": "peachwithinreach",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "European countries are still filled with racism, they just pretend not to be. Look at Vinícius Jr’s continued mistreatment in Spain, or what Europeans think about the Romani. Maybe other countries should care instead of pretending the problem doesn’t exist.",
                                            "score": 79,
                                            "author": "madmax766"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yes because we’ve found that simply ignoring race or pretending it doesn’t exist, isn’t actually good. The country didn’t magically become more inclusive after Jim Crowe ended. Ignoring race is a great way to make sure marginalized communities have no voice",
                                            "score": 89,
                                            "author": "alex891011"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; In most other countries researchers for the most part just don't care about your race.\n\nThat's because racism is so ingrained in their society they don't even account for it in studies. The U.S. has a huge problem with racism, but at least we acknowledge it and try to make it better. Meanwhile places like France, japan, India, the entire middle east, and most of Asia are so incredibly racist they don't even see it.",
                                            "score": 77,
                                            "author": "OutlyingPlasma",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You missed the rest of the entire world. Basically every country is pretty racist and in reality while America is certainly racist its actually one of the better ones compared to the rest of the world. But Asia, Europe, Australia, South America, and Africa all have lots of racism. \n\nWith that said America's obsession with race is not perfect either. We definitely take it too far sometimes where it leads to bad things or even in itself becomes racist.",
                                                    "score": 23,
                                                    "author": "shoonseiki1"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Is it really that weird that a country that used to have racially based chattel slavery followed by decades of a totalitarian caste system is preoccupied with the issue?  To me it would be weird if we weren't.  It's our original sin. We fought our bloodiest war over it and those divisions are still alive and well today as any political map of the US will clearly show.  \n\nWe also, as a nation of immigrants, are trying to figure out how to maintain a democracy when we have no single identity or idea behind what it means to be American. We have to talk about these issues.  They aren't going to magically go away if we ignore them.  That said, I agree wholeheartedly that some people take things way too far and try to make everything about race, but that doesn't mean we shouldn't be talking about it at all.",
                            "score": 133,
                            "author": "serpentjaguar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;That said, I agree wholeheartedly that some people take things way too far and try to make everything about race, but that doesn't mean we shouldn't be talking about it at all. \n\nI'm not the person you are responding to, but I would hazard to guess they feel exactly the same way. I doubt they think we should just ignore it and hope it goes away.",
                                    "score": 24,
                                    "author": "PM_ur_Rump"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That’s a nice idea, but the US has a different history with race than most other places. Less than 70 years ago most races were still fighting for civil rights. You can’t expect all of that to just vanish out of nowhere",
                            "score": 81,
                            "author": "MorgulValar",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I hate when non Americans say this. Wow, a country founded on the backs of black chattel slaves and the slaughtering of entire indigenous tribes is concerned about race and respecting marginalized voices and cultures in modern times. Shocker.",
                            "score": 327,
                            "author": "envydub",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s always silly and a weird flex like “psh we ignore racism and just let it run rampant around us, you weird Americans are always TALKING about it and trying to make things better for minority groups in your country. You should just pretend racism isn’t real like we do! Btw did you see that hilarious video of Germans being insanely racist to an Asian woman filming herself walking around?”",
                                    "score": 271,
                                    "author": "SoCalThrowAway7",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah it's funny how often people go on about \"Americans' obsession with race\" whilst they ignore the fact plenty of other countries are just as Race focused though it's more of a behind closed doors type situation. \n\nFor example in Japan and China you can **literally** be turned around from an accommodation, bar, restaurant etc for being a foreign race. \n\nObviously that's not the average but something like that happening in the US would make nation wide news.",
                                            "score": 105,
                                            "author": "themolestedsliver"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "the problem is not that it's talked about, it's the idiocy behind what's said about it",
                                            "score": 43,
                                            "author": "hopingforabetterpast",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It's always some European too, as if the mere mention of the Roma didn't send them into a fit of anger.",
                                    "score": 167,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Having lived in Europe, Europeans have a kind of racism that a nice White Republican from the suburbs would recognize as lacking self awareness.\n\nThey invented racism, built an entire colonial world based around it,  and then act like it's so weird that people in the US or Brazil or South Africa ask racial demographic questions in their surveys.",
                                            "score": 159,
                                            "author": "Mendicant__",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Preach 🙌",
                                                    "score": 23,
                                                    "author": "WuckingFurries"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Someone literally pulled an anti-Roma comment from the commenter I replied to’s post history. The self awareness is non existent.",
                                            "score": 27,
                                            "author": "envydub"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Divide and Conquer.",
                            "score": 6,
                            "author": "TudorSnowflake"
                        },
                        {
                            "level": 2,
                            "comment": "As an American, I'm a little annoyed by an outsider telling me what my culture is, which I guess is the point of the people who gripe about others writing about their culture.\n\nThat said I don't necessarily disagree with her.",
                            "score": 8,
                            "author": "cold08"
                        },
                        {
                            "level": 2,
                            "comment": "Skin color isn’t even a determining factor for race anyway. America is still caught in the old 5 “races” when science has debunked it in nearly every way.",
                            "score": 38,
                            "author": "Deshra",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We’re all a bag of guts that wants to be free from stress and contempt. Racism is profoundly ridiculous.",
                                    "score": 14,
                                    "author": "O________I________O",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Reading the article the title message seems to get a bit muddled since it sounds like she wrote a book about a White person that steals the story of Asian person. \n\nI definitely think people should be able to write stories about characters that aren't like them in real life but uh, if you are arguing you should be able to do it so you can continue the trend of writing about how evil White people are, I don't see how that's progressing in the right direction.\n\nBut hopefully I'm wrong, the article doesn't say much more than she wrote a White person stole a story from an Asian person, but considering everything else she said, I highly doubt I am.",
                    "score": 231,
                    "author": "Abestar909",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And what exactly is \"the right direction\" that she is obliged to progress towards, in your opinion?\n\n&gt;The problem is, Kuang thinks, is that this has now “spiralled into this really strict and reductive understanding of race”. As a result, a movement that began as a call for more authentic stories about marginalised communities “gets flipped around and weaponised against the marginalised writers to pigeonhole them into telling only certain kinds of stories”.  \n&gt;  \n&gt;The issue is addressed in Kuang’s recent novel, Yellowface, in which a white writer claims a dead Chinese friend’s manuscript as her own. When the book, about Chinese farm workers who supported Britain in the first world war, becomes a huge success it sparks a debate about the supposed author’s right to tell the story.\n\nThis does sound like an interesting setting to bring up. I can easily imagine that in a scenario like that, the dumb online conversation would be entirely lost between \"she is bad because white people shouldn't write about these issues\", and the equally dumb  \"she did nothing wrong because anyone can write about anything they want to\", and overlooking the nuances of the situation, while at the same time the nuanced understanding is still that yes, there is still an underlying racial problem with the publishing industry that incentivizes that kind of conflict.",
                            "score": 357,
                            "author": "Genoscythe_",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I kinda thought this too at first because Babel also is pretty heavy on the “white women bad” idea. However after reading her new book (light spoilers) &gt;!it’s actually pretty clear that the main character is pretty right in a lot of what she says,  even if she takes it too far. For example she points out that the original writer was from a wealthy background but wrote about poor people so why is it ‘okay’ to write outside one’s own class but race is off the table!&lt;",
                            "score": 149,
                            "author": "TheLindberghBabie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I didn’t get the impression that she was right in many things.  I strongly dislike her and for good reason. She is the epitome of an unreliable narrator. She tells us things in a way that make it sounds better for her, but in reality, she’s behaving much worse than what she makes us believe. \n\n\n(Hopeful the spoiler tag works: ) \n\n&gt;!For a start, she claims she was not friend with Athena, when clearly they were friends, at least that’s what Athena thought of them. June was too jealous and bitter because her friend was more successful than her. She constantly makes excuses for her behaviour, twisting things to make herself look better. Athena dies and she steals the manuscript, and she edits it in a way that’s questionable at best. She refuses any sort of criticism and she constantly belittle chinese people, their food, their English, their culture, and doesn’t even know the difference between Korean and Chinese. The issue here is not that she wrote about another race - it’s the fact that she not only stole Athena’s manuscript, but she changes it in a way that’s incredibly ignorant and disrespectful. She can’t even be bothered to understand naming conventions. She clearly thinks she’s above them all. She talks about oppression without knowing anything about it and then tries to make the reader feel sympathy for the oppressors. It would be the same effect if a rich person where to write about homelessness just for clouts, without even trying to understand, empathise, and ultimately telling us that the homeless are homeless because they’re lazy.!&lt; \n\nEdit: typos",
                                    "score": 60,
                                    "author": "ellieofus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s wild to me how many people have read this book and missed the unreliable narrator angle to it. Were they just… reading along hoping June wouldn’t be found out? Taking all her crazy justifications at face value? This book would be a very different experience if you were doing that I suppose.",
                                            "score": 57,
                                            "author": "Thursday6677",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I am baffled by the number of people that sympathise with June. Much like all those people that were on Letty’s side in Babel.",
                                                    "score": 23,
                                                    "author": "ellieofus",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I actually went to a talk featuring Kuang and she said that she intentionally wrote June to be a bit sympathetic, especially to struggling authors and creatives.",
                                                            "score": 8,
                                                            "author": "benevolent_llama",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Babel disappointed me a bit. I absolutely loved the the depth and the linguistics stuff, but it was just SO heavy handed “white people bad” to the point where I literally would roll my eyes at times. Every single white character is an evil caricature (the one white “friend” has got to be up there in most easy to hate characters of all time) and every nonwhite character is brilliant - the scenes in China really killed me for this.  I just felt like, look, you’re preaching to the choir here! Your audience is completely on board with how terrible colonialism is. You don’t need to smack us over the head with it every few sentences.",
                                    "score": 87,
                                    "author": "dogfee",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I agree at points in the story I felt this way. I think I had a “you are preaching to the choir” moment as well reading the China scenes. I liked what the author was doing with Letty’s character except for the very confusing moment at the end &gt;!Suddenly escalating to killing a friend made no sense at all IMO!&lt; I understood the character of Letty of being an example of how the “necessary violence” required for revolution/change is an act that will force an ultimate divide even among allies. &gt;!She wanted to support her friends up until supporting them threatened the physical safety of her family and her own home!&lt; which I found to be a very interesting thing to explore. Because you can think this is a “white people bad” fact, but its true for all human beings, anyone can be an advocate for others under safe-ish conditions. Here in Canada we have an awful history of how natives got and get treated. I have friends who are really passionate advocates for their protections and doing right by them. Not a single one of those friends would give up their homes or daily comforts to return stolen land though, if it came down to it. This does not make them bad people, it just makes them human beings who do need to look out for their own well being first. I just enjoy pointing out their hypocrisy when they start letting what a good “ally” they are get to their own heads and begin to feed their ego.",
                                            "score": 32,
                                            "author": "Stahuap",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yea I agree with every concept she introduces, that’s a big part of my critique - her audience is not in need of convincing that colonialism is bad. I just found it really heavy handed and caricatured. \n\nWhich is fine, she can write a anti colonialism book that’s heavy handed and lacks subtlety, but doesn’t mean that readers are going to enjoy that approach - to me it didn’t feel like a novel/story first and an anti colonialism screed second but the other way around. \n\nWhich is again totally fine! But it’s also fine for readers to find that frustrating. Multiple times I almost was saying in my head “I AGREE with you holy crap!” Again preaching to the choir - and truly “preaching” was how it felt, heavy handed and without any nuance. \n\nDon’t get me wrong I actually enjoyed the book, I just found it so over the top at times that it took me out of the story and world and was disappointing compared to the much more subtle/nuanced/integrated social commentary of her previous trilogy (Poppy War) where the story still came first. In those books the narrative was inseparable from her commentary on class and her message still came across clearly, but it didn’t take away from the story and writing itself, whereas in Babel to me it did.",
                                                    "score": 23,
                                                    "author": "dogfee"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Babel was very heavy handed indeed. I wanted to love it but had to give up halfway through and from what I'ver read, it didn't get better.\n\nYellowface though? Perfect.",
                                            "score": 7,
                                            "author": "Calimiedades",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "So sounds like a bit of both then.",
                                    "score": 18,
                                    "author": "Abestar909"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There are enough obstacles in the way of creativity. People should be allowed to write about whatever they want, even if it's about a white person stealing the story of an Asian person - vote with your wallet.",
                            "score": 61,
                            "author": "alexander_london",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh I do, but that doesn't mean I should be happy about people following a trend of demonizing a particular race, so if I see it yeah, I'm gonna criticize it, people certainly do it when it's anything even close to saying something offensive about people that aren't White. Hell one of the people that responded to me even said you absolutely have to have sensitivity editors if you are writing about \"POCs\".\n\nThis idea that one deserves kid gloves and the other doesn't is what needs to stop.",
                                    "score": 18,
                                    "author": "Abestar909"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You should be allowed to write whatever you want no exceptions. The world is getting to demanding of writers and artists and trying to police everything they do and that's not right.",
                            "score": 51,
                            "author": "BenzeneBabe",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Her book is much more sympathetic toward the character than you would expect. The problem with the character is that they make all the wrong choices when writing about a different culture.",
                            "score": 39,
                            "author": "calamityseye",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I definitely did not get that impression having read it this week. We dislike the white character more and more as the story goes on, every decision she makes is completely self centred, sometimes in a calculated way and sometimes just because she’s thoughtless. Where was the sympathy? We view the story through her eyes because she’s the narrator but I thought it was pretty obvious the “woe is me” thoughts are not accurately representing the events - the author quite cleverly shows us that disconnect.",
                                    "score": 65,
                                    "author": "Thursday6677",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Absolutely agree with you. My dislike grew for the main character as the book went on.",
                                            "score": 19,
                                            "author": "ICU_nursey"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "My opinion is authors should be allowed to write about anything and everything, from any POV. But the rule is do the research, do it right, and make it good. Fuck it up and the author deserves every criticism.",
            "score": 3305,
            "author": "Bunnytown",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah absolutely. \n\nI find the argument that writing from another ethnic perspective is appropriation is ridiculous. By the exact same logic no man should be allowed to write from the perspective of a woman. Writing itself is basically an act of appropriation, it has to be or else every single novel ever would be an autobiography. You are always inhabiting other perspectives. \n\nYes, it can be done horribly and has been horribly many times, but that doesn't mean it's wrong in principle. It just means its hard. But that's obvious, really, it's always hard writing from a wildly different perspective and the ability to do so respectfully is one of the marks of a good writer. If a writer does it poorly they should be criticized, but they should not be criticized on the principle of it. \n\nI find it concerning how discussions of the segregation of art are becoming more common, regardless. It seems racial essentialism is on the rise as a common ideology, but modern racial groups are social constructs. They exist via consequences of how that construction has shaped society, but by completely segregating perspective based on those constructs all you do is serve to forever enshrine them. I think it's an anti-progressive mindset that has unfortunately become default for many of my fellow progressives.",
                    "score": 648,
                    "author": "SheoGodofMadness",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The exclusion aspects I don't like. There was an article decolonize your scifi bookshelf. And it was saying not to welcome new voices but to sweep away the old white guys who are no longer worth listening to. \n\nThat's going too far in the other direction. It's not actually making the conversation broader and more open. But the appeal of it is understandable. Gatekeeping appeals to a certain mentality and it smells like power. It's fun to run the purity tests and get to tell people they're voted off the island.",
                            "score": 96,
                            "author": "jollyreaper2112"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; I think it's an anti-progressive mindset that has unfortunately become default for many of my fellow progressives.\n\nHoly fuck, yes. As a Gen-Xer, the rhetoric I'm hearing from my kids' generation is disturbingly similar to the stuff I used to hear from my very racist grandfather. People are reduced to the colour of their skin. That's the most important thing about them. The diversity that's being pushed these days is quite literally skin deep. Deviance of opinion is not tolerated.\n\nIn fact, large swathes of the Left have become very intolerant and dogma-driven, and that disturbs me greatly.",
                            "score": 224,
                            "author": "moepsenstreusel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As another gen-Xer (and I'm not just progressive but very much leftist), I also agree.",
                                    "score": 24,
                                    "author": "Senuf"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Or: there is no such thing as \"allowed\" or \"not allowed\" and playing along with that phrase is submitting to semantic infiltration so this whole discussion all kinda dumb.",
                    "score": 20,
                    "author": "Agreetedboat123"
                },
                {
                    "level": 1,
                    "comment": "It also means you shouldn't write about things you've not directly experienced. Only murders are allowed to write murder mysteries. :/\n\nThat being said, there is justified embarrassment for the author to be found out not even knowing anything about the topic. The murder writer killing the victim with baking soda slipped in the wine. What? That's not hurting anyone. You didn't research your poisons. \n\nThat being said, if you're a white dude from the burbs you're probably not going to do a good job writing a coming of age story for a young girl in Morocco. Though if you can pull that off, good for you.",
                    "score": 19,
                    "author": "jollyreaper2112"
                },
                {
                    "level": 1,
                    "comment": "Agreed. If nothing else, only writing about what you *are* would make for very limited stories.",
                    "score": 41,
                    "author": "JamesCDiamond",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Rick riordan I always felt was a perfect example of this- he makes a very concerted effort to include different races as his main characters AND writes about them respectively and frequently touches on their cultural identity. It’s a great example for 8-12 year olds to see",
                    "score": 40,
                    "author": "Kind_Pomegranate4877"
                },
                {
                    "level": 1,
                    "comment": "Literature is a form of art. \n\nNobody is forcing you to think a certain way about it. \n\nIf you can’t “write unless you do it right” then you might as well say “you can’t paint unless you do it right”.\n\nBoth are ludicrous statements to anybody with any kind of understanding of how a progressive society works.",
                    "score": 125,
                    "author": "4inaroom",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm pretty sure they mean don't write people as just offensive one dimensional stereotypes.",
                            "score": 40,
                            "author": "roflmaolz"
                        },
                        {
                            "level": 2,
                            "comment": "anyone can write, but we’re not obligated to think their book is good just because they wrote it. i’m not going to just blindly praise bad literature but that doesn’t mean the author didn’t have a right to write it. we have a right to criticize just as they have the right to write.",
                            "score": 56,
                            "author": "toledosurprised",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "who said anything to even imply that you should \"blindly praise bad literature\", where is that even coming from?",
                                    "score": 17,
                                    "author": "Mandamelon",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I mean well executed, not morally or socially right. There is a profound difference. Skill matters. We're talking about published authors here, people who think they know how to write authentically from another person's perspective, not people learning the craft.\n\nI didn't even say anything about it not being art either, that is you trying to shoehorn your own seperate argument in. All of your quoted statements aren't even quotes of what I said.",
                            "score": 28,
                            "author": "Bunnytown",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "what if they want to write a story a certain way and you consider it derivative?",
                    "score": 8,
                    "author": "Overtaker40",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Then that's my opinion, doesn't make it true and if I'm being a dumb ass then I should get countered quickly. Difference of opinion on writing can lead to interesting discussion too.",
                            "score": 14,
                            "author": "Bunnytown",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The author is going to get every criticism even if they do it right, and whether they deserve it or not. If you put writing into the world, people are going to criticize it. If someone wants to be a writer, they have to get over that.",
                    "score": 9,
                    "author": "Islanduniverse"
                },
                {
                    "level": 1,
                    "comment": "Yes. It sounds really hard to do right though. In movie equivalents, you don't wanna end up with long duk dong and Mr. Yunioshi and me love you long time as a result of someone from one race writing another. And I think it'd be really hard for someone not Chinese or at least grew up very embedded in a Chinese community to be able to write the code switching of everything everywhere all at once. All technically possible and certainly \"allowed\" but really really difficult IMO. (Preemptive disclaimer: of course still possible for same culture/race people to get it horribly wrong and people of different cultures/races to get it right)",
                    "score": 16,
                    "author": "Notexpiredyet"
                },
                {
                    "level": 1,
                    "comment": "I agree. If you are writing about anything you aren't familar with, it's on you to do the research. Double so if it's a culture you aren't familar with.",
                    "score": 9,
                    "author": "zak55"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Having actually read this book, which most people seem to not have, it’s a lot more complex in Kuang’s thinking than “this is good/this is bad.” June (the narrator) has a lot of really clear sensitivity issues in the book and self righteousness. She also has a lot of interpersonal issues and clear actual psychological issues. On the other hand, her critics are very much framed as flawed as well. The moral is not supposed to be evil vs good; it is very much about the complexity of the issue, and Kuang’s own feelings being complex.",
            "score": 298,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 245,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Her interviews are also pretty incredible. I know she's a professional author who is good with dem words, but she is also a fantastic speaker. Honestly I'd urge people to just listen to her responses to the interviews yourself because they paint a pretty clear picture of her morals around it (why are you writing in the first place, what is your goal with the writing, what is the effect on victims whose stories you tell, etc). In the book neither the white or racial character are presented as 'good', and writing other peoples stories as the token minority author, for bad reasons, is attacked nearly as much as the character pretending to be another race for bad reasons. \n\nI'm not sure if it was the same interview rebroadcast by CBC, but every answer sounded like they'd given her a month to prepare an answer, when she was just giving off the cuff responses, on the phone, while apparently also doing her laundry.",
                            "score": 43,
                            "author": "Beetin"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The fact that you have to come out and say \"segregating art is bad\" like it is not obvious is depressing",
            "score": 902,
            "author": "FreeAd6935",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a leftist I will say that elements of the left have certainly moved towards segregation in general as an ideal, abandoning the idea of multiethnic society in many ways. Not just the segregation of art. \n\nTo them, segregation is sort've the ultimate anti-colonialism, the removal of white influence and dominance in totality. It's of course a bizarre idealogy given what their grandparents had fought for, but I can see the logic I suppose. \n\nThe problem is, despite all of our progress, it often seems like we've made none.  So nowadays people are keen to give up on the project of diverse society, something which was never going to be easy. \n\nIn the US for example, black nationalism has seen a notable increase in recent years. Again, I can understand where the mindset originates from, these people have suffered centuries of oppression at the hands of white dominance. I just firmly disagree that the ideal solution is the total abandonment of the idea of diversity and the creation of ethnostates.",
                    "score": 204,
                    "author": "SheoGodofMadness",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's not that mostly. Internet hivemind is bloodthirsty. And you can't beat blood out of a stone, so softer targets tend to get the worst of it.\n\nThe more optimistic take would be that people are powerless to change so many things, so they go for easier things, even if the change they push for is unnecessary or worse, counterproductive.",
                            "score": 69,
                            "author": "GladiatorUA",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "There's even been cases where the hivemind went after someone for what they thought was someone getting something wrong and the author has to come out and say \"well actually I'm xyz, so I don't think I'm trying to be xyz-ist\" \n\n\nThe attack helicopter short story comes to mind, which was even taken down due to all the hate. Then the author has to do themselves after receiving tons of hatred against them. \n\n\nSo why would any artist risk that?",
                                    "score": 22,
                                    "author": "mynewaccount5"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The fact that the US can't seem to get beyond talking about race is odd.\n\nThe US is probably the most genetically meshed country in the world, yet it seems absolutely stuck on talking about race. whereupon i come from one of the most historically homogeneous countries in the world, but that has 25% of the population come in as immigration in 30 years and have never ever seen race come into any debate.\n\nCulture is talked about a fair deal, but bit race, because race is just a construct and has nothing to do with anything.",
                    "score": 139,
                    "author": "Andreomgangen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, there are some countries that keep no data on race (France is one).\n\nBut then there are movements by minorities to change that. Why? Because NOT talking about race can end up meaning that the numbers are hidden when there are widespread racial issues.\n\n\"Race is just a construct\" doesn't matter when landlords or hiring managers see things differently. If you don't talk about race, then you can miss some important stuff happening.",
                            "score": 255,
                            "author": "kangareagle"
                        },
                        {
                            "level": 2,
                            "comment": "How is it odd? This is an honest question. Asking why people talk about race is such a bizarre question that ignores the reality of everyday life. Why do people talk about race? Because people are racist and some of those people actively try to commit harm to others who don't look like they do. Those people are \"others\" and once you feel that way, it becomes incredibly easy to start blaming them for all your problems.\n\nThe US has an abhorrent history of racism and you know, the whole slavery thing, and one way we have improved things was to talk  openly about it. We still talk about it because improving does not mean the problem was solved. Hell, we are currently on a backslide with racist and misogynist laws being enacted. We absolutely _must_ keep talking about it. \n\nThe argument that racism is a construct... so? None of that matters to the person getting dragged behind a pickup truck because their skin was too dark. Racism is a _human_ problem, worldwide. The EU liked to think it didn't have a racism problem until migrants started flooding across the border. Then the \"I'm not racist _but_\" people will start having microphones shoved in their face and some of their real opinions will start spilling out. \n\nFinally you should probably tell us what mysterious place you come from where people don't notice differences in other people. I'm sure you chose not to because it wouldn't take much digging to find that no, it isn't some racism free miracle of humanity, you are just viewing things like everyone else does before changes start actually affecting them. Racism is _always_ in the background. Most people are decent enough to keep their opinions to themselves and hell may not even realize they hold those opinions because they have never been confronted by a situation where they could come out.\n\nOnce you start having a population change of significance, and times get tougher, racism comes out. It is always easier to blame someone else for your problems than it is to look inward and take responsibility for your situation.",
                            "score": 88,
                            "author": "raziel686",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Why would a racially homogenous country concern itself with race? The supremacy is implied. A racially diverse country is concerned with race because of that diversity.",
                            "score": 40,
                            "author": "CptNonsense",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "You make it seem like it's just a US problem...",
                            "score": 48,
                            "author": "Whyherro2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Anytime someone says \"race isn't a problem in my country,\" they are really saying that they either (1) live in an ethnically or cultural homogenous country or that (2) they are part of the majority culture/ethnicity in their country, so race/ethnicity doesn't make them a target for discrimination.",
                                    "score": 14,
                                    "author": "BonJovicus"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Systemic Racism is alive and well in the US. Until it’s not, people will continue to talk about it.",
                            "score": 155,
                            "author": "Token_Creative",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Seriously, we aren’t “stuck” talking about race, we’re stuck with people being racist.",
                                    "score": 106,
                                    "author": "Slow_Like_Sloth",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I mean, if your country used race as a primary divider for which neighborhoods to bulldoze, which people to illegally experiment on, which populations to introduce drug epidemics to, and all sorts of other fucked up shit that doesn't even make it into US history books much of the time, you might care a lot about race as well. As it stands, every time I hear complaints like this, I'm just hearing the same \"I am profoundly ignorant of history\" sentiment being expressed, over and over and over.",
                            "score": 18,
                            "author": "FragrantBicycle7"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;whereupon i come from one of the most historically homogeneous countries in the world, but that has 25% of the population come in as immigration in 30 years and have never ever seen race come into any debate.\n\nI'll forgive you because you are not American, but your opinions are incredibly naive. \n\nDoes it really surprise you that a country with such diverse populations of individuals talks about race and ethnicity a lot when that has been the source of so much discrimination in the past and present? Even when immigration to the US was primarily from Europe, it was a controversial topic, but those populations have long been assimilated into \"White\" America in a way that a lot of other cultures could never be. \n\nI'd be curious to know what country you live in. I often hear Europeans frequently play the \"race isn't an issue in our country\" meanwhile, Turkish, Ghanian, and Algerian immigrant sing a different tune. Guess what? White Americans claimed they didn't know how bad things were for minorities during the Civil Rights Era and then again when George Floyd was murder. It is very easy to not be aware of race when it isn't a factor in your life.",
                            "score": 9,
                            "author": "BonJovicus"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;The US is probably the most genetically meshed country in the world, yet it seems absolutely stuck on talking about race. whereupon i come from one of the most historically homogeneous countries in the world, but that has 25% of the population come in as immigration in 30 years and have never ever seen race come into any debate.\n\nHuh? You realize how obvious what you just said is, right? Of course a country with no/much less racial diversity doesn't have as many conversations about race, they're irrelevant there. Those countries are typically far more racist, there's just far fewer minorities that have to deal with that racism. And obviously a country with a ton of different races will and should talk about issues of race more often in order to avoid said racism. \n\nTalking about it is a good thing, I don't understand why Europeans and others always try to act like talking about these issues is a bad thing for America. Almost the entire rest of the world isn't \"beyond talking about race,\" they haven't even reached that point yet to where they are talking about it in a meaningful manner. Do you think a country like China has better racial relations because they don't talk about it? Absolutely not.",
                            "score": 89,
                            "author": "Liimbo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Because the US makes everything about race even when it's not relevant. And that's a bad thing. Because it just feeds into the silly tribalism that exists there.\n\nAlmost every news article states the race of the people involved except when they're white. \n\nThere is very clear stoking of racial tensions there and even things that have nothing to do with race are sensationalised into being about the race of the people involved if they were different.\n\nTwo people have an altercation over cheese, no racism involved at all, but if one is black then it becomes about race. The cheese is irrelevant, now it becomes a racist encounter. To some the white person is obviously oppressing that black person by wanting the cheese, and to others black person is threatening the safety of the white person by wanting the cheese. \n\nYou say it's good to talk, fair enough, but you guys are having the wrong conversations.",
                                    "score": 66,
                                    "author": "Forsaken_Jelly",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;You say it's good to talk, fair enough, but you guys are having the wrong conversations.\n\nThis is an entirely different issue. I agree that in many cases the wrong conversations are being had, but the answer in that case isn't to not talk about race at all.",
                                            "score": 6,
                                            "author": "joe1240132"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I mean if we as humans can't even write about dwarves and elves, who's gonna do it then?",
            "score": 282,
            "author": "Sandalphon92",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ironically, tons of versions of elves and dwarves across the literary landscape would be *fucking pissed* if they found out humans were writing about them.\n\nThey'd probably get super racist about why they're pissed, too.",
                    "score": 60,
                    "author": "frogandbanjo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I always figured that if we ever make contact with intelligent extraterrestrial life, a lot of stuff is going to become racist like instantly",
                            "score": 3,
                            "author": "tcavanagh1993"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Can you imagine asking Tolkein this?",
                    "score": 52,
                    "author": "Anakin_Sandwalker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Theoretically, if he were still alive, he'd probably scoff at the idea.\n\nLiterally, standing over his grave and asking that question... euh...",
                            "score": 30,
                            "author": "The_Greyarch",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think he’d have more interesting and thoughtful things to say than scoffing. I don’t know how much credence to give to the idea that he was trying to craft a nonexistent mythological tradition for the English people, but I’m sure there’s a grain of truth to it.",
                                    "score": 8,
                                    "author": "cheesecheesecheesec"
                                },
                                {
                                    "level": 3,
                                    "comment": "Nah, just got off the weegee board with him. He said it’s all Gucci.",
                                    "score": 12,
                                    "author": "Somnacanth",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Pretty sure that’s how they got their ideas for the Gollum video game.",
                                            "score": 5,
                                            "author": "sillyadam94"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;weegee\n\nFyi, it's ouija",
                                            "score": 9,
                                            "author": "BookQueen13",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Literally just finished Babel last night and while I didn’t agree with quite a bit of her writing/narrative style, it is kind of heartening to know she’s a voice against reductivism.",
            "score": 83,
            "author": "wasabi_weasel",
            "replies": [
                {
                    "level": 1,
                    "comment": "I commented this elsewhere but Babel disappointed me a bit. Some people didn’t like the “textbook” feel which I loved, I found it really fresh and different and I do love linguistics. I wish I was more familiar with the Oxford campus because I think that would have made me enjoy it even more. But it was just SO heavy handed “white people bad” to the point where I literally would roll my eyes at times. Every single white character is an evil caricature (the one white “friend” has got to be up there in most easy to hate characters of all time) and every nonwhite character is brilliant - the scenes in China really killed me for this.  I just felt like, look, you’re preaching to the choir here! Your audience is completely on board with how terrible colonialism is. You don’t need to smack us over the head with it every few sentences.",
                    "score": 63,
                    "author": "dogfee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah the linguistics was what drew me in in the first place. I was disappointed we only got to see the ‘gears’ of the world building rather than the whole clock, so to speak. We got hints of the day to day use of the bars but rarely saw them in action. \n\nAnd fully agree about her preaching to the choir. Her heavy handed approach was unfortunately my main take away from the book. For someone so imaginative and intellectually curious as she seems to be, I find it odd that she didn’t trust her audience to understand that Like, Colonialism is Real *Bad*, yo.",
                            "score": 33,
                            "author": "wasabi_weasel",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Totally agree. I loved her previous trilogy as well, and it had a lot of discussion about class inequality that I didn’t find as jarring or heavy handed. When I started Babel I was so excited to sink my teeth into it after how much I enjoyed the previous books, and was a little disappointed.",
                                    "score": 12,
                                    "author": "dogfee"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I’ve been reading Babel… I thought I was reading a novel, not a linguistics textbook. I’m getting real sick of waiting for the story to happen while characters discuss languages.",
                    "score": 9,
                    "author": "BigBobbert",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It does very much read like someone fictionalised their undergrad thesis about language and power. \n\nWhile I do like some of the world building, those footnotes are a lot for sure.",
                            "score": 16,
                            "author": "wasabi_weasel"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Of course!  \n\n\nIf this were a thing then bye bye every bit of scifi that deals with aliens. You can't write about them either.  \n\n\nWhat a ridiculous idea.",
            "score": 8,
            "author": "crunchyfrog555",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Fantasy writers need to stop writing about other species because they don’t really understand the dragon point of view.",
            "score": 57,
            "author": "quad64bit"
        },
        {
            "level": 0,
            "comment": "I agree. The idea of gatekeeping who can or cannot write certain stories isn't progressive in the slightest. In fact, I'd call it entirely regressive.",
            "score": 29,
            "author": "Graham-Barlow-119"
        },
        {
            "level": 0,
            "comment": "Writers should write about whatever they want to and be left alone to do it.\n\nEdit: of-course it's up to the author. If they are going to pursue a subject or POV that they aren't well-versed on, then they should probably perform the appropriate research, etc. And if they don't, then the market can respond appropriately. But in general, writers rightly should be free to write about whatever the hell they want, and the market can choose whether or not to give them a platform, reward them with book sales, etc.",
            "score": 114,
            "author": "mattyblewis",
            "replies": [
                {
                    "level": 1,
                    "comment": "No one's stopping authors from writing about anything. Some people want to equate receiving criticism with prohibition, though.",
                    "score": 24,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "If it's good. Then it's good and will be shared word of mouth at least.",
            "score": 5,
            "author": "IGetHypedEasily"
        },
        {
            "level": 0,
            "comment": "Anyone should be free to write about whoever they want.  Let the audience and critics decide if they did a good job of it.\n\n&gt; BIPOC authors\n\nMan, I hope that acronym is retired soon.  It's really uncomfortable to treat every non-White, non-Black, non-Indigenous group as generic and able to be lumped together into one term, POC, but Black and indigenous people deserve special mention over them.\n\nIf we want to treat people equally, let's not use terms that promote inequality.  If we want to treat authors equally, judge them by the book they produced, not their personal qualities.  If we want to end discrimination, we should stop avoiding or seeking out books based on the skin color of the author.\n\nTreat people like people rather than a checkbox, judge them on their actions and what comes from their mind.",
            "score": 404,
            "author": "Autarch_Kade",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's especially awkward when used in a European  context. Uh, who do you think is the indigenous population of the UK?",
                    "score": 269,
                    "author": "mediadavid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "REMOVE LATINITE VERMIN\n\nREMOVE GERMANIC SCUM \n\nTHE ISLES BELONG TO THE CELTS",
                            "score": 213,
                            "author": "SheoGodofMadness",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I know you're joking but the celts weren't the first people to live there either.",
                                    "score": 76,
                                    "author": "GodlessCommieScum",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Only Pictish authors should write about the British Isles!",
                                            "score": 119,
                                            "author": "HootieRocker59",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Pah! Typical outsider using colonial terms. This is why only native Irish should be allowed to write about the North Atlantic Isles.",
                                                    "score": 28,
                                                    "author": "WoahThereBookaroo",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The Irish? Sounds like immigrants taking over our glorious Bell-Beaker lands!",
                                                            "score": 9,
                                                            "author": "vonnegutflora"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "What have the Picts ever done for us?",
                                                    "score": 19,
                                                    "author": "hour_of_the_rat",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "If no one did it before them, maybe the Picts helped get rid of the local Neanderthals...",
                                                            "score": 11,
                                                            "author": "Twerking4theTweakend"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "They were but they weren't celtic. There wasn't a big invasion when celtic culture came to the area with them coming over and intermingling with the indigenous people so that the indigenous people just sort of became the British celts.",
                                            "score": 3,
                                            "author": "0b0011"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "We have no name nor concept of identity for the first people to live anywhere, really, except for the areas of the Earth most recently colonized for the first time like the Polynesian islands. We've given some broad archeological labels to the groups we have evidence for but at a certain point its all very, very undefined. \n\nHumans have been migrating out of Africa for tens of thousands of years and for the vast majority of that time kept no record of themselves beyond oral stories.\n\nThe whole concept of land being owned by any one cultural group is quite silly in principle due to that, but its generally always said within the context of recent history.",
                                            "score": 20,
                                            "author": "SheoGodofMadness",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Who's your favourite Briton author?",
                            "score": 22,
                            "author": "AvalancheMaster"
                        },
                        {
                            "level": 2,
                            "comment": "In a US context it seems like it's intentionally used instead of POC to exclude Hispanic and Asian minorities",
                            "score": 64,
                            "author": "mooimafish33",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hispanic and asians are included in the “black, indigenous, people of color” as Hispanics and Asians are people of color in the US English sense of the word.",
                                    "score": 17,
                                    "author": "Yara_Flor"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Elves",
                            "score": 4,
                            "author": "Exploding_Antelope"
                        },
                        {
                            "level": 2,
                            "comment": "Not in all of Europe, there are indigenous populations in the north of Europe.",
                            "score": 10,
                            "author": "RaspberryTurtle987"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;Treat people like people rather than a checkbox, judge them on their actions and what comes from their mind.\n\nExactly this. I can't say how many times I've seen posts here talking about adding more [insert gender or BIPOC term] authors to their bookshelves simply for the sake of inclusion. Read what you want to, on if the book calls to you specifically, not because the author is a Native American female. The end.",
                    "score": 60,
                    "author": "TigRaine86",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That seems silly to me, is it not obvious that different people have different perspectives due to various different factors, and that effects their writing? There are more good books out there then anyone could possibly read in a lifetime, so it's not like thinking \"hmm I think I'll look for a good book by a Chinese author since I've not really read any before\" is going to do any harm to you. All that it will do is give you the opportunity to read something that might have some aspect to it that you have never come across in another book before.",
                            "score": 51,
                            "author": "Adamsoski",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;Anyone should be free to write about whoever they want. Let the audience and critics decide if they did a good job of it.\n\nThat *is* what is happening, there isn't some cabal of ghouls that exist outside of audiences and critics. The problem is that they often don't do a good job of it because they aren't familiar enough with the cultures they are trying to write, so audiences and critics from those cultures respond badly to it.",
                    "score": 21,
                    "author": "SquidsEye"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm a book illustrator and they have the same attitude with artists. There's so many publishers that state don't even submit your portfolio unless you are bipoc, lbgtq, etc.\n\nI completely understand if their book is very based on some culture or social theme, or it's very historical, and you need to hire a technical artist to get the details on point. But they are using it as a sweeping brush for all their books. What does being gay have to do with painting dragons for a fantasy cover. I'm sorry, but what. \n\nIt should really come down to style and what vibes most with the authors work. The most important to me is that my work speaks to the author on a personal level. There's something magical about connecting art to the right book. \n\nThe other thing is... Like how connected to their culture are they. You are assuming that based on their face or name they are like grounded in their roots. I am the first born American in my family and if you asked me to illustrate a book about my family's \"native country\" I don't feel like I am any better qualified than anyone else. My name's superficial. I am pretty much americanized at this point.",
            "score": 21,
            "author": "gravityofthesitu",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; I'm a book illustrator and they have the same attitude with artists. There's so many publishers that state don't even submit your portfolio unless you are bipoc, lbgtq, etc.\n\nAgree, I have talked to authors who've effectively been told the same thing. I guess it would end up working the other way too: Imagine being a Martian writing about Earth and the publishers saying to you: \"The problem is, you're not *Martian enough*!\"",
                    "score": 11,
                    "author": "Psittacula2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a fucking shit show in these comments. Good luck out there, everyone.",
            "score": 59,
            "author": "sandalsnopants",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yep, a lot of people missing the fucking point entirely.",
                    "score": 18,
                    "author": "TheSnarkling",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I like the amount of people not even bothering to read and comprehend the *comment* they're oh-so-angrily replying to just above them, let alone the original article lol",
                            "score": 7,
                            "author": "frozenrussian"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The difficult part is writing a character (of another race) that doesn’t get turned into a stereotype  while at the same time being able to use their race as something that needs to be pointed out and adds something to the story or character.\n\nThere’s also this weird dynamic where writers/people of the same ethnicity are given a pass in writing characters of the same group a certain way but would get criticized if they were a different ethnicity.\n\nIt would be fascinating experiment if they were able to get a manuscript that has characters written with certain tropes and stereotypes or focuses heavily on race and give one group of editors/critics a copy with the pretext of “this was written by a (insert ethnicity) author” and give another group of editors/critics the exact same manuscript but change the ethnicity of the author and then ask them their thoughts on how the characters were written.",
            "score": 27,
            "author": "tom_fuckin_bombadil",
            "replies": []
        },
        {
            "level": 0,
            "comment": "You can tell 99% of the people commenting didn’t even read the article.",
            "score": 51,
            "author": "TheDarkGoblin39",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly. This author has the exact opposite position the title implies, and the title implies the problem is completely different than what is discussed.\n\nNo one is telling authors what they can and can't write.  And there are still tons of white male authors being picked up by publishers.\n\nThe issue has always been that there are so many more non-BIPOC authors picked up than anyone else that the majority of stories in the public consciousness about BIPOC came from white male authors -- which IS a problem.\n\nGen Z is choosing to get stories from people of other backgrounds.  This is good and fine - People have the right to choose what they read as well.  Publishers are choosing to cater to that.  And also responding to upset from their customers about untasteful portrayals by adding reader feedback from people from those communities to the editing process.\n\nNo one is telling anyone what to write.  But as has always been true, people are selective about what they want to read and accept as genuine.  Publishers are responding to that.  Publishing has always  influenced what gets written and by who --  and this is actually an improvement of that problem, being framed as the opposite.  It is very 2023.",
                    "score": 25,
                    "author": "Vrayea25"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's weird to be told \"race doesn't matter\" and simultaneously \"your race dictates what you are and aren't allowed to do\"",
            "score": 23,
            "author": "McFeely_Smackup"
        },
        {
            "level": 0,
            "comment": "If writers were restricted to only writing about their personal experiences, there would be no such thing as fiction.  The premise of being able to picture something beyond oneself is the very foundation of imagination.",
            "score": 32,
            "author": "Kakashimoto77",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It’s almost like there’s ways of respecting and appreciating other cultures without appropriating them or insulting audiences",
            "score": 13,
            "author": "gregbraaa",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly. Thank you. She even goes into that in the article",
                    "score": 5,
                    "author": "katz332"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Honestly who fucking cares?  Write about what you want to write about, read what you want to read.  If it sucks, read something else .",
            "score": 34,
            "author": "Strict_Locksmith_108",
            "replies": []
        },
        {
            "level": 0,
            "comment": "As little as thirty years ago, if someone would have prophesized that in the future, there would be people demanding that you only write about your own race, people would have been like „Hell, not these guys again.“",
            "score": 9,
            "author": "PlatypusXray"
        },
        {
            "level": 0,
            "comment": "Naturally.",
            "score": 3,
            "author": "MahavidyasMahakali"
        },
        {
            "level": 0,
            "comment": "No brainer, the fact that some play mental gymnastics in this arena shows you brain washing is real. Write away about whatever you want.",
            "score": 3,
            "author": "h23s88"
        },
        {
            "level": 0,
            "comment": "Usa's obsession with \"races\" is fucking insane from outside of this country. From your bigots to your \"\"most progressive\"\" it always looks fucking insane.",
            "score": 158,
            "author": "La_mer_noire",
            "replies": [
                {
                    "level": 1,
                    "comment": "IT really is fucking crazy. I've never read a book set in a European/Scandinavian setting and thought \"I wonder if this is really written by a white person, or if it's another color trying to steal my culture...\", but it seems a common thought among americans.",
                    "score": 59,
                    "author": "Bagelfuze",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's really not that common, it's just very present online. In reality, some of our most popular books involve white authors writing about non-white characters. Many people happily read them.",
                            "score": 54,
                            "author": "madelinegumbo",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "People are saying it's an online thing, and I agree with one caveat -- our media also tries to give the impression that the average person is enraged over this stuff as well. The last I checked, the media didn't ask me or anyone I know what I thought before they published some dumb shit. That's because the point is to try to influence people, not actually represent what is happening.\n\nBut I live in a major city that is very diverse. I used to work at a nonprofit. This is not the average opinion for people who go outside.",
                            "score": 24,
                            "author": "non_avian",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I know others are saying it but yeah, this is definitely more a fringe online thing. \n\nYes, racial relations are definitely more front and center in the US. It's not that surprising or confusing when you look at America's history of racial oppression and literally being built out of a slave state. \n\nThat historical baggage has led to the current situation but people from the outside looking in will always tend to get the most extreme of positions. That's the sort've stuff that gets attention, especially internationally. \n\nThe majority of Americans, though, don't give a shit. Most Americans aren't chronically online wokescold-type leftists. and I say that as an American leftist. \n\nThe internet has an unfortunate effect of amplifying the most absurd perspectives, and you can see the results of that politically across the entire world but especially here in the US. Most people don't have the mental energy to worry about shit like this lol",
                            "score": 25,
                            "author": "SheoGodofMadness"
                        },
                        {
                            "level": 2,
                            "comment": "It’s only a common thought because of how common historically it’s been here and how cringe those depictions are.  I remember reading a book while in college about a slave who was repeatedly beaten by her master to the point she…. Fell in love with him.",
                            "score": 6,
                            "author": "ChristTheNepoBaby"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's more of a loud minority with media access. Your average everyday American couldn't give two shits about someone's race.",
                    "score": 31,
                    "author": "Drs83",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can’t speak for 330 million people, but I think viewing the world through a racial lens seems more common. Books like “White Fragility” were front and center in bookstores everywhere",
                            "score": 36,
                            "author": "heyiambob"
                        },
                        {
                            "level": 2,
                            "comment": "Yes, it is actually refreshing to talk to Americans about it, because the internet would suggest that it is an extremely sensitive topic. My experience is that the whole discussion is way more nuanced than what you would think.",
                            "score": 15,
                            "author": "tyeunbroken",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I do think it's possible to find little pockets here and there of people who are really caught up in the whole thing. Unfortunately media outlets sell controversy and normal is boring so it gets a lot of airtime.",
                                    "score": 6,
                                    "author": "Drs83",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "People should write about whatever the hell they want, and people should read whatever the hell they want.\n\nToo many control freaks in society.",
            "score": 11,
            "author": "ryneku"
        },
        {
            "level": 0,
            "comment": "&gt;Kuang was critical of those who believe that “the only people getting book deals right now are BIPOC \\[Black, Indigenous and people of colour\\] writers”, including Joyce Carol Oates, who tweeted last year that editors do not want to look at debuts by white male writers. Oates “really just needs to get off Twitter”, Kuang joked, but also said “if you just walk into a bookstore you know that’s not true.”\n\nKuang is right, but I must admit I've been looking for BIPOC writers in the last couple of years and especially female writers. There is a void in publishing space that is slowly starting to fill.",
            "score": 122,
            "author": "trisul-108",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m going to be very honest- the only place non white men authors have surged in popularity is young adult books. Every else has stayed the same. Stephen king, James Patterson, Brian Sanderson, etc have dominated adult genres the same as before. They’re not being pushed out by any stretch",
                    "score": 24,
                    "author": "Kind_Pomegranate4877"
                },
                {
                    "level": 1,
                    "comment": "The problem is when you’re a part of the group that’s used to getting 90% of the attention suddenly only getting 70% feels like you’re loosing out. (Number pulled out of my arse but i think they illustrate my point well enough).",
                    "score": 104,
                    "author": "Danimeh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've heard it phrased something like \"When you're accustomed to privilege, equality can feel like oppression.\"",
                            "score": 138,
                            "author": "mistakes_were_made24",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And then you have people that no one gives a shit about. I'm a brown Muslim male. \n\n\nAt the very best, I have Asian awareness week, but even then other Asians often get pissed off that I (an Afghan) identify as a fellow Asian.\n\nIt's always interesting when people are like \"we barely get representation - and when we do, it's as (stereotype)!\"\n\n\nAnd I'm like \"you get representation?!\"\n\n(I mean, I guess we do get some casting as terrorists or cavemen. I think we made it into Ironman as the bad guys, so you can say that my people are the reason the avengers exist!)",
                                    "score": 10,
                                    "author": "HaikuBotStalksMe"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "True, but on the other hand, it feels like 90% of the new authors that get relentlessly promoted on social media and win awards are \"BIPOC\" American writers (like Kuang), at least in the fantasy genre. It is starting to get very tiresome, especially when most of the time they are not that good. So I can see where both Kuang and Oates are coming from.\n\nNot that it matters that much to me. I am mostly reading translated Japanese fantasy books these days, and they tend to get ignored by anyone who is not already a manga or anime fan.  And the rest is made of new fantasy books by older \"white\" authors that I already like, and who get ignored by anyone who is not already a fan of those authors. So I could not care less about what the authors of the books I read look like, only about how good their books are. \n\nAnd since I know that the books whose authors I like are never going to get any attention on social media, no matter what the \"race\" of their authors actually is, it makes that kind of debate and \"whining for attention\" feels very shallow, especially when coming from authors that are already very popular on social media.",
                            "score": 68,
                            "author": "NekoCatSidhe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is why I don't trust 'best of the year' fantasy lists and don't know where to go to find new authors. It seems like a lot of recommendations are geared towards fixing issues of representation rather than just being about good writing.\n\nAnd representation is important, but it doesn't help me find good books.",
                                    "score": 35,
                                    "author": "PoiHolloi2020"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "And, I wholeheartedly agree.",
            "score": 9,
            "author": "patrick_lansing"
        },
        {
            "level": 0,
            "comment": "Do we want a world where all books are filled with only characters of the author's race, nationality, gender, whatever?\n\nI like my casts of characters to be a bit more diverse, and it would be a little jarring to read a book set in 2020s London that only had one race, for example.\n\nWould Star Trek have been better with a homogeneous cast?",
            "score": 12,
            "author": "m0le"
        },
        {
            "level": 0,
            "comment": "&amp;#x200B;\n\nCertain acronyms read like someone actively tries to segregate today’s literature. I don’t care or any of that. I like to go and buy new (contemporary) authors by standing in a bookstore for hours until I finally decide, regardless of race and sexual orientation, who I get home.",
            "score": 15,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hey that's the same approach I take to finding a date.",
                    "score": 4,
                    "author": "mybunsarestale"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm so glad I read mostly scifi, since it's been mostly insulated from this horseshit, as long as you ignore the joke that the Hugos have become.",
            "score": 7,
            "author": "warpaslym"
        },
        {
            "level": 0,
            "comment": "Just like any other topic if you do your research your writing is less likely to suck.",
            "score": 7,
            "author": "equality-_-7-2521"
        },
        {
            "level": 0,
            "comment": "The whole \"cultural appropriation\" thing is bullshit. There's no criterion everybody would agree with.\n\nIs hippie culture with all its \"expanding conscience via eclectic combination of pieces of other cultures and psychoactive substances\" that?\n\nOr maybe playing chess is cultural appropriation? It came to Europe from India via Iran and Levant after all.\n\nAre people in the West who eat sushi and soy stuff doing cultural appropriation?\n\nI mean, for me this whole idea sounds like a very subtle way segregation mentality has survived into our age. Such a \"benevolent\" segregation, separate to preserve and all that.\n\nIn any case, when you want to destroy someone, you are not going to write about them usually. You are going to try and prevent others from writing about them, and if they do, ridicule the authors and those you hate.",
            "score": 31,
            "author": "mithnenorn",
            "replies": []
        },
        {
            "level": 0,
            "comment": "If she was white, the reception would be different.",
            "score": 31,
            "author": "petepro",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The Identity Politics Grifter mission is to keep arguments like this going forever.\n\nIf a writer tells a story entirely involving white suburban middle class heterosexuals, they can easily be demolished on twitter for their singular focus and lack of diversity.\n\nDo the opposite, and tell a tale with a rainbow coalition of characters from a variety of ethnicities, sexualities etc and they can be dismissed for appropriating their ideas, or lacking in authenticity. \n\nThe grift rolls on regardless.\n\nMeanwhile, artists and writers are made to feel restricted in what they are 'allowed' to do.\n\nWhilst readers miss out on wonderful stories like Cloud Atlas or English Passengers, featuring a range of global locations, time periods and character backgrounds. A Pulitzer Prize winner like 'Orphan Masters Son' set in mid 90s North Korea, couldn't even exist. Nor essentially any historical novel set anywhere over 90 years ago, or featuring groups and languages that have died out entirely (like the Romans or Greeks)",
            "score": 36,
            "author": "mankindmatt5"
        },
        {
            "level": 0,
            "comment": "Hard agree. \n\nPeople demanding that writers need be from an ethnicity to \"authentically and safely portray it\" is just... exclusionary and damaging to the image and idea of togetherness and inclusion that we *should* see championed in literature.\n\nShould men never write women? Should women never write men? Should fantasy and scifi writers avoid writing about elves and space elves because we don't know how it can affect future generations of elves and how they might be culturally portrayed?\n\nNot going to lie, when I read a book about a family or person of another ethnicity, and the whole book is 99% characters of that ethnicity and the only white people in it are racists or antagonists... I mean it hurts. It's not a charming image of my people, and I think what it represents is damaging and going to contribute to fueling a deeper divide.\n\nIt hurts seeing the industry champion this behavior and it hurts seeing people get snubbed over the alternative.\n\ninb4: \"BUT I KNOW LOTS OF RACIST WHITE PEOPLE AND THEY SHOULD BE PORTRAYED AS SUCH, AND YOU ARE RACIST FOR NOT BEING AS IRRATIONALLY ANGRY AS I AM AT PERCEIVED RACISM\"",
            "score": 16,
            "author": "Agaeon"
        },
        {
            "level": 0,
            "comment": "Authors should be allowed to write about anything they want. However, if someone who belongs to the group they're writing about has a criticism of how they are portrayed, the author should listen and take corrective action if necessary.",
            "score": 7,
            "author": "Arkholt",
            "replies": []
        }
    ]
}