{
    "id": "13vpljv",
    "score": 18,
    "title": "Beautiful You (wtf?)",
    "author": "Forever_Pancakes",
    "date": 1685451440.0,
    "url": "https://www.reddit.com/r/books/comments/13vpljv",
    "media_urls": [],
    "other_urls": [],
    "postText": "Guys, I gave myself a challenge to just pick up a used book based on the cover without knowing anything about it. I landed on Beautiful You by Chuck Palahniuk. Has anyone read this and can tell me wtf did I just read?\n\nIt was awful, but also like a train wreck that I couldn't look away and put it down? I truly don't know what genre this is, like a fantasy smut distopian adventure book? I mean MFC scales mount everest in a wedding dress ffs to find an ancient sex guru to learn the tantric ways of self fulfilment to save the female population from nanobots that enter their blood stream through newly invented sex toys, lmao! \n\nIt was a very interesting experiement that I will try again, but as a first book to pick this way, my head is still spinning! \n\nAnyone else read this and can have a discussion on wtf I just read🤣",
    "comments": [
        {
            "level": 0,
            "comment": "I haven't read that one but that's pretty much the feeling you have reading any Chuck Palahniuk book.",
            "score": 31,
            "author": "lemewski",
            "replies": [
                {
                    "level": 1,
                    "comment": "I never read anything from him so I was in for a big surprise.",
                    "score": 4,
                    "author": "Forever_Pancakes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He wrote the book that the movie Fight Club was based off, so I had some inkling that as an author, he would mess with my head lmao",
                            "score": 5,
                            "author": "Braign",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah I was like ohhh he wrote Fight Club and the movie was great so this should be alright! LOL",
                                    "score": 2,
                                    "author": "Forever_Pancakes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "fight club is one of the few book to film adaptations where I would argue the film is 100% better.",
                                            "score": 5,
                                            "author": "em_ee_see"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That was your mistake.  LOL.  I made the same mistake.  I didn't know what I was getting into when I read Guts.",
                            "score": 11,
                            "author": "Snoo57923"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh wow, nice introduction. \n\nChuck writes what can be defined as transgressive fiction.\n\nHis most famous work is Fight Club, but a lot if his books focus on damaged people in situations outside the bounds of what is considered socially acceptable, at best, or purile grossness, at worst.\n\nOften satirical, his works can be heavy handed and his hit rate is uneven.\n\nGenerally speaking, his best books are his earliest (this is not one of them) and decline in quality as you go along. However, his last couple have seen somewhat \"return to form\", with The Adjustment Bureau (which I actually thought was pretty poor) and The Invention of Sound (which didn't quite hit the mark but was closer than most).\n\nIf you enjoyed it (or were sufficiently intrigued) by Beautiful You, I'd recommend trying some of his earlier stuff, but also reading a synopsis before you dive in!",
            "score": 10,
            "author": "CriticalNovel22",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a huge Chuck fan I 100% agree with this comment. Early Chuck is fantastic but it feels like his written himself into a corner. He's so good at making you see or feel moments in his book. I bet he could write a fantastic horror novel if he decided to change things up. \n\nRant is my personal favorite and I feel like everything written after has been a miss. I'd have no issue with recommending everything written prior to and including Rant.",
                    "score": 1,
                    "author": "omegaterra"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Damn, what an author to stumble into!",
            "score": 8,
            "author": "Francis_Bonkers",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was NOT ready!",
                    "score": 2,
                    "author": "Forever_Pancakes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I've got eight of his books, and the only one that didn't make me question why I continued reading was Fight Club, which is mild compared to most of his stuff. I bet that's the last time you get fooled by a books title lol",
                            "score": 2,
                            "author": "Francis_Bonkers",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I went all in and got 7 books based on the cover/title alone, so who knows whats in store next for me 😄",
                                    "score": 2,
                                    "author": "Forever_Pancakes"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I typically love his work but Hated this book! It’s the worst one in my opinion.",
            "score": 5,
            "author": "iceicejaime",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha I totally see why!",
                    "score": 2,
                    "author": "Forever_Pancakes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh, I am so sorry you stumbled onto this one!\nI got really into Palahniuk in my early college years because his stuff made me feel edgy and cool and adult but this is definitely the one I like the least. He writes \"transgressive\" fiction but this one honestly feels like he totally phoned it in and was allowed to get away with it because of his body of work. \n\nBeautiful You is definitely his most \"not like other girls\" work of fiction - he intended it to be an examination of our relationship with pleasure as a society and it ends up being more of a  commentary on the smutty stuff that has always been really popular among women, books like \"Clan of the Cave Bear\" \"50 Shades of Grey\" hell, even \"Twilight.\" \n\nI have yet to revisit this one from his collection and am not sure if I will - I much prefer some of his earlier stuff like Invisible Monsters, Survivor, and Haunted, which all have their moments but don't seem like 200+ pages of \"lol, isn't this stuff like by primarily women so dumb?!\"",
            "score": 4,
            "author": "Deliriums_Fish",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes I got the \"not like other girls vibe\"! This really felt like, how much weird sex shit can I interate into one book while it still \"kind of\" hold itself together!",
                    "score": 2,
                    "author": "Forever_Pancakes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a first book to stumble upon. Chuck Palahniuk was my absolute favorite author a long time ago, but I feel like I've outgrown him. I definitely plan on reading his new work but I stopped after Damned. \n\nHonestly his early work is way better than the newer (that I know of). If you ever want to give him another chance, Survivor and Invisible Monsters are amazing and I still think about them to this day. They get insane, but still very good.",
            "score": 3,
            "author": "InitialQuote000",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha! Thanks for the recommendations! I will check them out but I need a palette cleanser or 2 before😂",
                    "score": 2,
                    "author": "Forever_Pancakes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Haha completely understandable!",
                            "score": 2,
                            "author": "InitialQuote000"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had this book recommended to me by a girl from Tinder that I briefly dated.  I generally like weird stuff, but that one was a bit of a noodle scratcher for me.\n\nIf you want a real brain twister by Chuck Palahniuk, check out Survivor.  Its about a guy who grew up in a cult and then survived a mass suicide event forcing him to go live in normal society.  Due to a newspaper misprint his phone number is listed as the number for a suicide prevention hotline and it leads to some very interesting events that I won't write here for spoiler purposes.  If you like dark dystopian humor its worth checking out.  Also I'm sure I'm going to get some very strange targeted ads after trying to Google the plot of that book because I couldn't remember the name.",
            "score": 2,
            "author": "Xeibra",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha thanks! I will check it out! I don't know what that girls vibe was but if anyone seriously recommended this book to me and truly liked it, I might question their tastes for everything! 😄",
                    "score": 1,
                    "author": "Forever_Pancakes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"MFC scales mount everest in a wedding dress ffs to find an ancient sex   \nguru to learn the tantric ways of self fulfilment to save the female   \npopulation from nanobots that enter their blood stream through newly   \ninvented sex toys\"\n\nOMFG!  That is the most epic summary of a book I have ever read and you TOTALLY made me snarf!!!",
            "score": 2,
            "author": "fieldenm",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lmao! Even re-reading what I wrote Im still shocked that I made it through the whole thing 😂",
                    "score": 1,
                    "author": "Forever_Pancakes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh, this should NOT be the first Palahniuk book you should read.\n\nHe’s my favorite author, and he always writes experimentally. In this one, the experimental writing is using very basic sentence structures. This is not how he writes, LOL, I assure you. Read his more older works, like Survivor or Choke.",
            "score": 2,
            "author": "SilverDrifter"
        }
    ]
}