{
    "id": "140v3wp",
    "score": 123,
    "title": "The Book That Made Stephen the King: Revisiting His Story Collection Night Shift",
    "author": "largeheartedboy",
    "date": 1685922686.0,
    "url": "https://www.reddit.com/r/books/comments/140v3wp",
    "media_urls": [
        "https://slate.com/culture/2023/06/boogeyman-movie-stephen-king-night-shift-short-story.html"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Man, I love that cover. First time I read King I was 12 years old, sitting in front of a roaring fire in Killington Vermont. Ass kicked from 10 hours of hard skiing. But once I saw that cover in the bookcase I was entranced. Stayed up far too late mesmerized by his creeping horror as the snow fell and part of my innocence faded away.",
            "score": 29,
            "author": "Just1morefix",
            "replies": [
                {
                    "level": 1,
                    "comment": "Loved that cover for years, just last week actually read I Am The Doorway, absolute chills",
                    "score": 2,
                    "author": "KingAndSanderson"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That was the first SK book I read. Still one of my favs. I love his short stories. The rats in the basement...The boogeyman in the closet...Time to quit smoking, or else! (Quitters, Inc is so good)",
            "score": 17,
            "author": "uuneter1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same here. In fact it was only the other day I read it too. Amazing stories in this collection, even the most ridiculous premise is turned into something terrifying that makes you want to take cover beneath your sheet.\n\nThe one about the teacher and his students did absolutely terrify me, I’m not ashamed to admit.",
                    "score": 3,
                    "author": "Squid00dle"
                }
            ]
        },
        {
            "level": 0,
            "comment": "*Carrie* is the book that made Stephen King.",
            "score": 15,
            "author": "DJGlennW"
        },
        {
            "level": 0,
            "comment": "This came out after *The Shining*. It hardly \"made\" him.\n\nHeck, the introduction was written by John D. MacDonald, who was one of the bestselling authors of thrillers from the 1960s into the early 1980s, as little as he is rememberd nowadays.",
            "score": 9,
            "author": "EpicTubofGoo"
        },
        {
            "level": 0,
            "comment": "Love that collection.  I have that exact cover.",
            "score": 10,
            "author": "Adequate_Images"
        },
        {
            "level": 0,
            "comment": "The Mangler, Battlegrounds, Quitters Inc, I Am The Doorway, Gray Matter, Trucks, Graveyard Shift, The Ledge, Lawnmower Man, all classics.",
            "score": 3,
            "author": "TriscuitCracker"
        },
        {
            "level": 0,
            "comment": "I was so intrigued by that cover as a kid. I remember it on the bookshelf in my parents' room in my earliest memories of our house. I think I actually read it when I was 11 or 12. Scary movies were almost always too intense for me as a kid but I loved a scary book.",
            "score": 2,
            "author": "pedestal_of_infamy"
        },
        {
            "level": 0,
            "comment": "What a great collection. Got it from a thrift bin as a kid and had absolutely no idea what I was picking up. Absolute master of his craft.",
            "score": 2,
            "author": "icarusrising9"
        },
        {
            "level": 0,
            "comment": "My gabourite collection from him, apart from the Bachman novellas. I think he's the master of the unsettling short story. His writing style (and typically less than great endings) really lends itself to this format.",
            "score": 2,
            "author": "Beforeibegan"
        },
        {
            "level": 0,
            "comment": "Just wanted to say - thank you for still blogging. I remember reading your stuff in and around college (graduated in 2007).",
            "score": 1,
            "author": "bunsNT"
        }
    ]
}