{
    "id": "1419d7q",
    "score": 76,
    "title": "What Books did You Start or Finish Reading this Week?: June 05, 2023",
    "author": "AutoModerator",
    "date": 1685959212.0,
    "url": "https://www.reddit.com/r/books/comments/1419d7q",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi everyone!\n\nWhat are you reading? What have you recently finished reading? What do you think of it? We want to know!\n\nWe're displaying the books found in this thread in the book strip at the top of the page. If you want the books you're reading included, use the formatting below.\n\n**Formatting your book info**\n\nPost your book info in this format:\n\n**the title, by the author** \n\nFor example:\n\n**The Bogus Title, by Stephen King**\n\n* This formatting is voluntary but will help us include your selections in the book strip banner.\n\n* Entering your book data in this format will make it easy to collect the data, and the bold text will make the books titles stand out and might be a little easier to read.\n\n* Enter as many books per post as you like but only the parent comments will be included. Replies to parent comments will be ignored for data collection.\n\n* To help prevent errors in data collection, please double check your spelling of the title and author.\n\n**NEW**: Would you like to ask the author you are reading (or just finished reading) a question? Type **!invite** in your comment and we will reach out to them to request they join us for a community Ask Me Anything event!\n\n-Your Friendly /r/books Moderator Team",
    "comments": [
        {
            "level": 0,
            "comment": "Finished **How to Get Filthy Rich in Rising Asia, by Mohsin Hamid** and loved it! No idea where I got the recommendation from, but I'm glad I did.",
            "score": 1,
            "author": "Kinkfink"
        },
        {
            "level": 0,
            "comment": "Finished: **The Singer's Gun, by Emily St. John Mandel**\n\nA good book, but it feels a bit short and I was unsatisfied with the main character's happy ending. My least favorite of her works. \n\nStarted: **The Real Life Of Sebastian Knight, by Vladimir Nabokov**\n\nNo idea what to expect from this one.",
            "score": 1,
            "author": "glorytocalifornia"
        },
        {
            "level": 0,
            "comment": "**Finished: Sorrow and Bliss, by Meg Mason**\n\nLoved parts of this book but it was quite a difficult read at times, presumably deliberately due to subject matter. \n\n**About to start: Station Eleven, by Emily St. John Mandel**\n\nSea of Tranquility was my favourite book of the year so far, so excited for this one.",
            "score": 1,
            "author": "electricbonsai"
        },
        {
            "level": 0,
            "comment": "Finished:\n\n**The Steppenwolf, by Hermann Hesse (transl. Kurt Beals)** \n\nYes, *The* Steppenwolf - Beals argues for this in his introduction. I like his approach to this translation, and the result is excellent. Steppenwolf itself is great, of course - perhaps less revelatory than if I had been born 70 years earlier and read it shortly after its release, but still. Much is made of how to read Steppenwolf and whether parts are supposed to be taken literally, as metaphor, or both - it's \"easier\" in that respect than Journey to the East, though, &gt;!particularly if you're already used to the idea of psychological archetypes, the now-common trope of various parts of the subconscious manifesting themselves as different personae, etc.!&lt;\n\n**The Norse Myths, by Caroline Larrington**\n\nAn overview of Norse myth rather than a (for example) Gaiman-style retelling, Larrington's book is lucid, informative, and quite funny at times, despite its academic approach. I like that she traces different versions of the myths, where relevant, instead of taking one version the way that narrative retellings (once again, like Gaiman's) do.\n\nStarted:\n\n**Provenance, by Ann Leckie**",
            "score": 1,
            "author": "lydiardbell"
        },
        {
            "level": 0,
            "comment": "Didn't finish ***The Curator by Owen King***, because, while the setting is interesting (fantasy world with two moons that worship cats) the characters were just dull as shit and the story just kind of plodded along. Owen King (of whom I didn't realize who he was until googling him) is absolutely not his father in terms of talent.\n\nMoving on to **Salman Rushdie's Victory City**.  Hopefully it'll be better.",
            "score": 1,
            "author": "PM-Me_Your_Penis_Pls"
        },
        {
            "level": 0,
            "comment": "Finished Killman Creek. Starting Wolfhunter River",
            "score": 1,
            "author": "tulip79"
        },
        {
            "level": 0,
            "comment": "Finished: Strange the Dreamer, by Laini Taylor",
            "score": 1,
            "author": "ladeeedada"
        },
        {
            "level": 0,
            "comment": "**Lady Constantine, by Andy Diggle**",
            "score": 1,
            "author": "Read1984"
        },
        {
            "level": 0,
            "comment": "Started reading “The Killing Star” by Charles R. Pellegrino and George Zebrowski",
            "score": 1,
            "author": "brat112"
        },
        {
            "level": 0,
            "comment": "Finished: Imperialism, the Highest Stage of Capitalism by Vladimir Lenin  (4/5)\n\n-Really concise and mostly pretty objective view of the nature of imperialism and it’s relation to economics, especially at that time. Many comparisons to draw to modern day issues. All in all a good read. An insightful leftist glance at modern economics for anyone to read.\n\nStarted: The Grapes of Wrath by John Steinbeck\n\n-never read this and absolutely should have. Im not even a fifth in, and am already loving it. I remember not being the biggest fan of the only Steinbeck novel I’ve read so far, which was In Dubious Battle. The writing is so much different and much improved from that book in this. If you haven’t read this, it’s place as an American epic is absolutely deserved, and it’s narrative is necessary in understanding a key part in American history.",
            "score": 1,
            "author": "longview25"
        },
        {
            "level": 0,
            "comment": "Finished: To Be Taught If Fortunate, by Becky Chambers\n\nStarted: Book Lovers, by Emily Henry",
            "score": 1,
            "author": "Character_Guitar_731"
        },
        {
            "level": 0,
            "comment": "Finished: \n\n**Demon Copperhead, by Barbara Kingsolver** - 5/5 stars. It’s an instant classic. Demon is one of the greatest characters/narrators I have ever read. \n\nStarted: \n\n**Middlesex, by Jeffrey Eugenides**",
            "score": 1,
            "author": "phantasmagoria22"
        },
        {
            "level": 0,
            "comment": "Finished: Conversations with friends, by Sally Rooney\n\nStarted: A moveable feast, by Ernest Hemingway",
            "score": 1,
            "author": "TenakthoverCarja"
        },
        {
            "level": 0,
            "comment": "finished **The Butterfly Garden, by Dot Hutchison**  \n\nfinished **All The Ugly and Wonderful things, by Bryn Greenwood**\n\nStarted: **If You Tell, by Gregg Olsen**\nThis is the first book I’ve read by this author and I’m struggling to get into the book because of the way it’s written.",
            "score": 2,
            "author": "Flamingo_Onyx",
            "replies": [
                {
                    "level": 1,
                    "comment": "I'm stuck at 30% on If You Tell. It's a slog.",
                    "score": 2,
                    "author": "Iambexyb",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m at 25% hopefully it picks up.",
                            "score": 1,
                            "author": "Flamingo_Onyx"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Finished: Crime and Punishment, by Fyodor Dostoevsky \n\nStarted: Snow Country, by Yasunari Kawabata",
            "score": 1,
            "author": "Ok-Green-7698"
        },
        {
            "level": 0,
            "comment": "Currently Rereading: ***The Girl in the Tower***, by Katherine Arden (Book #2 of the Winternight Trilogy)\n\nFinished: ***In the Lives of Puppets***, by T.J. Klune, finished: 6/5. ***The Queen of Nothing***, by Holly Black (Book #3 of The Folk of the Air Trilogy), finished: 6/5, ***The Bear and the Nightingale***, by Katherine Arden (Book #1 of the Winternight Trilogy), finished: 6/6, and ***T******he Girl Who Fell Beneath the Sea***, by Axie Oh finished: 6/6.",
            "score": 1,
            "author": "seafry00"
        },
        {
            "level": 0,
            "comment": "Finished:\nBlood Meridian by Cormac McCarthy - my first time reading it and I can't stop thinking about it the past 2 days since finishing.  I reread the final few passages a couple times.  Totally understand why some people would find it overrated, but it's instantly a top 5 book for me personally.  \n\nContinuing to read:\nMistborn The Final Empire by Brandon Sanderson\n\nStarted Reading:\nSmashed by Junji Ito",
            "score": 2,
            "author": "Poetleigh",
            "replies": [
                {
                    "level": 1,
                    "comment": "Rereading blood meridian at some point is almost essential. I read it a few years ago and reread it recently, discovering so much more than I did on first glance. Genuinely my favorite novel. So dense with topics and ideas",
                    "score": 1,
                    "author": "longview25"
                }
            ]
        },
        {
            "level": 0,
            "comment": "**Surfacing, by Margaret Atwood**  Margaret Atwood's second novel, from 1972, features a group of 4 friends going to the backwoods of Quebec, searching for one friend's father. But has she told them what to expect? \n\nI just finished this one and it's a bit of mystery, and whole lot of social commentary (grief, misogyny, spousal abuse, off-grid living, etc.), this book was so deep and covered so much in a tidy little 200 pages. Be warned that there is anti-colonial sentiment masquerading as anti-American sentiment. This is old school, hella literary Atwood, my absolute fave.",
            "score": 1,
            "author": "ilovebeaker"
        },
        {
            "level": 0,
            "comment": "Started reading Fair Play last night",
            "score": 1,
            "author": "Ivf_2021"
        },
        {
            "level": 0,
            "comment": "Started: The Secret History by Donna Tartt",
            "score": 2,
            "author": "TopAcanthocephala258"
        },
        {
            "level": 0,
            "comment": "finished: a cruel and fated light\n\nstarted: the priory of the orange tree",
            "score": 1,
            "author": "gay_space_dads"
        },
        {
            "level": 0,
            "comment": "Finished: Joyous Body by Clarissa Pinkola Estes\n\nFinished: Perpetual Adolescence by Porterfield, Polette, &amp; Baumlin\n\nStarted: Upstream by Mary Oliver\n\nStarted: The Lost History of Redwyn by William Jay",
            "score": 1,
            "author": "PorcupineHollow"
        },
        {
            "level": 0,
            "comment": "Finished: **The running club, by Ali Lowe**\n\nStarted: **The last namsara, by Kristen Ciccarelli**",
            "score": 1,
            "author": "Wolves_walk_the_moon"
        },
        {
            "level": 0,
            "comment": "Finished: **The Handmaid, by Frieda McFadden**\n\nReally gripping if slightly predictable thriller.\n\nStarted: **The Handmaid's Secret, by Freida McFadden**\n\nFirst time in a while I'm reading a sequel (don't normally go for literary series) so will be interesting to see how this compares.",
            "score": 1,
            "author": "Susan_Screams"
        },
        {
            "level": 0,
            "comment": "Finished: **Night Shift, by Stephen King**\n\nAn interesting, if a bit uneven, short story collection. \n\nStarted: **The Singer's Gun, by Emily St. John Mandel**\n\nLast book of hers I haven't read. Can't wait to see what my favorite author has in store for me next!",
            "score": 2,
            "author": "glorytocalifornia"
        },
        {
            "level": 0,
            "comment": "I finished La forja de un rebelde and Valor y miedo. Both by Arturo Barea.\n\nStarting reading: Invitation to a Beheading by Vladimir Nabokov",
            "score": 2,
            "author": "Infinite_Ad4515"
        },
        {
            "level": 0,
            "comment": "Started reading **World War Z, by Max Brooks**.",
            "score": 3,
            "author": "breadofthegrunge",
            "replies": [
                {
                    "level": 1,
                    "comment": "The audiobook version was phenomenal",
                    "score": 1,
                    "author": "jonwtc"
                },
                {
                    "level": 1,
                    "comment": "Do you like it, I just was going to start reading this one too",
                    "score": 1,
                    "author": "0xDima",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah, it's great so far. The interview format is really interesting.",
                            "score": 2,
                            "author": "breadofthegrunge",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "1000% different than the movie and SO good!",
                                    "score": 2,
                                    "author": "PorcupineHollow"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Started Bright Young Dead by Jessica Fellowes",
            "score": 2,
            "author": "bruceymonkeyalice"
        },
        {
            "level": 0,
            "comment": "I just finished **The Whispers, by Ashley Audrain**\n\nI liked it okay but not as much as The Push by the same author, and I wasn't that satisfied with the ending...&gt;!like wasn't it just kind of odd? And I felt bad for Whitney. Idk.!&lt;\n\nAlways love good summer-y neighborhood dramas though",
            "score": 2,
            "author": "Sylvia_Whatever"
        },
        {
            "level": 0,
            "comment": "Just started:\nWe Spread, by Iain Reid",
            "score": 1,
            "author": "redditusernamehelen"
        },
        {
            "level": 0,
            "comment": "**Five Little Pigs** by **Agatha Christie**.",
            "score": 2,
            "author": "LostNail1840"
        },
        {
            "level": 0,
            "comment": "Started: \nSapiens, by Yuval Noah Harari\nVery very interested in this book so far, 100 pages in and I'm already wanting to do a deep dive on mankind's past!",
            "score": 2,
            "author": "dcow2"
        },
        {
            "level": 0,
            "comment": "Finished **The Counterlife** by Philip Roth. \n\nStarted **Rabbit Is Rich** by John Updike.\n\nDick Lit par excellence!",
            "score": 3,
            "author": "MyOwnRobot"
        },
        {
            "level": 0,
            "comment": "**The Robber Bride, by Margaret Atwood**",
            "score": 1,
            "author": "Britonator"
        },
        {
            "level": 0,
            "comment": "THE BIG SLEEP by Raymond Chandler",
            "score": 3,
            "author": "philmwrites"
        },
        {
            "level": 0,
            "comment": "Đơn Phương - Keigo Hinashino",
            "score": 2,
            "author": "Born-Cut8979"
        },
        {
            "level": 0,
            "comment": "Finished I am Legend Richard Matheson \n\nWow! I've been meaning to read this book for years and finally got around to it. It was absolutely terrific, and of course so much better than the movie as usually is the case. Stephen King once said Richard Matheson influenced him the most and I can clearly see it.\n\nAbout to start \n\nDune Messiah",
            "score": 2,
            "author": "rrivers730"
        },
        {
            "level": 0,
            "comment": "Started:\n\n**Ivanhoe, by Walter Scott**\n\nReading this book because of its connection to my local area. About 1/3 of way in.\n\nIt's an interesting description of the political tension in England during that time between the conquered Saxons and the Norman conquerors. And ticks all the boxes for a classic medieval tale",
            "score": 1,
            "author": "hontouso"
        },
        {
            "level": 0,
            "comment": "Finished: \n\n**The Beet Queen, Louise Erdrich** Loved\n\n**Tales from the cafe, Toshikazu Kawaguchi**\nLoved\n\n**One Italian Summer, Rebecca Serle**\nDid not like\n\nStarted:\n\n**The Glass Castle, Jeanette Walls**",
            "score": 2,
            "author": "ugotmeontheropes"
        },
        {
            "level": 0,
            "comment": "Finished The Adventures of Amina Al-Sirafi. It was awesome!",
            "score": 2,
            "author": "fitandstrong0926"
        },
        {
            "level": 0,
            "comment": "Starting the blade itself!",
            "score": 3,
            "author": "ultimatum12"
        },
        {
            "level": 0,
            "comment": "Reading: \n\n**Last of the Breed, by Louis L'Amour**\n\nI decided to read my dad's favorite LL book of all time. (He's only read like 100 of them.) Can't wait to chat with him about it! \n\n**The Ladies of Grace Adieu and Other Stories, by Susanna Clarke**\n\nFinished:\n\n**The Book Eaters, by Sunyi Dean**\n\nEnjoyed this a lot more than I thought I would based on the rating it has on Goodreads. But I do love a book that has something to do with books... \n\n**Gregor the Overlander, by Suzanne Collins**",
            "score": 1,
            "author": "kmc9_9",
            "replies": [
                {
                    "level": 1,
                    "comment": "I loved Gregor the Overlander! Do you think you’ll keep reading the series?",
                    "score": 1,
                    "author": "sapphirecarapace",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not sure yet. Is it worth it? I felt like the first one tied everything up pretty nicely, aside from the remaining prophecy that was mentioned toward the end.",
                            "score": 1,
                            "author": "kmc9_9"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Reading:\n\n**Before Your Memory Fades, by Toshikazu Kawaguchi**\n\nand\n \n**The Engagement, by Samantha Hayes**",
            "score": 2,
            "author": "itsmefrom413"
        },
        {
            "level": 0,
            "comment": "Finished:\n\n**The Men Who Stare At Goats** by Jon Ronson. Back in the 1970s, the US Army got the idea of using psychic powers to influence the battlefield. What if I told you, they succeeded? Just with horrible torture instead of psychic powers?\n\n**Encounters in the Woods** by Ethan Hayes. A collection of (allegedly) true stories of encounters with Sasquatch. If you believe any of this at all.\n\nAbout to start:\n\n**Under the Banner of Heaven: A Story of Violent Faith** by Jon Krakauer. A true crime story about murder in a splinter Mormon sect in Utah.\n\nContinuing:\n\n**For Your Eyes Only** by Ian Fleming. It's a collection of five short Bond stories so I've read the first two (From a View to a Kill and For Your Eyes Only) with the remaining three to go (Quantum of Solace, Risico, and the Hildebrand Rarity.)",
            "score": 1,
            "author": "ZOOTV83"
        },
        {
            "level": 0,
            "comment": "Now reading: \n\n**Almost Midnight, by Paul Doiron**\n\nFinished this week:\n\n**The Time Has Come, by Will Leitch**\n\n**The Kind Worth Killing, by Peter Swanson**\n\n**The Comeback, by Lily Chu**\n\n**Swamp Story, by Dave Barry**",
            "score": 1,
            "author": "jellyrollo"
        },
        {
            "level": 0,
            "comment": "I started\n\n**Scattered Minds, by Gabor Maté**\n\nAbout 80 pages in. One of the most interesting books I've read in a long time. I am an elementary school teacher so this is a subject that is very present in my everyday life.\n\n**La Boite de Pandore, by Bernard Werber**\n\nI loved Werber's books as a teenager. This one is about a man who can \"travel\" through his past lives and what happens to him both in the past and in his current life. It's a fun read so far! (About 350 pages in).",
            "score": 2,
            "author": "Bara_Chat"
        },
        {
            "level": 0,
            "comment": "Nothing.\n\nIt is possible to paralyze yourself with too many projects open at once. Set aside the books this week. Finishing off a professional certification adding to my skill stacks instead.\n\nOccasionally I pick up The First 20 Hours: How to Learn Anything Fast and remind myself I tend to throw myself into too many hobbies and skills and learning activities. Too much and you do not have sufficiently timed repetition to grow in any of those areas. Occasionally make the brutal cuts to focus energy on the areas for skill drilling. To use and apply the information learned.\n\nEnjoying the nothing. Looking forward to finishing off the new skills. And return to the reading for What Next.",
            "score": 3,
            "author": "decrementsf"
        },
        {
            "level": 0,
            "comment": "Finished: The Fourth Monkey by J.D. Barker\nStarted: The Fine Print by Lauren Asher",
            "score": 1,
            "author": "AwwwSookieSookie"
        },
        {
            "level": 0,
            "comment": "Finished:\nMember of the Family by Dianne Lake - about the youngest Manson family girl that testified against them mostly about what it was like being with them.  She wasn’t part of the killings \n\nLeaving the Witness by Amber Scorah - about a Jehovahs Witness finding her way out of the religion while being an undercover missionary in China. \n\nStarted:\nCults by Max Cutler\n\nAnyone sensing a theme?",
            "score": 2,
            "author": "Herbscrystalsandcats"
        },
        {
            "level": 0,
            "comment": "Read: **Blue World, by Robert R McCammon**.",
            "score": 1,
            "author": "SalemMO65560"
        },
        {
            "level": 0,
            "comment": "Started/Completed:\nQueen Charlotte, by Julia Quinn and Shonda Rhimes\nBlueberry Blunder, by Amanda Flower\nThe Ballad of Never After, by Stephanie Garber\nWisteria Wyverns, by Angela Pepper\n\nContinued:\nThe Thunderhead, by Neal Shusterman\nCertain Dark Things, by evejenson\n\nStarted/ won't complete:\nKidnapping Phoenixes, by Ramy Vance\n\nStarted:\nGone Girl, by Gillian Flynn\nThe Prime of Miss Jean Brodie, by Muriel Spark\n\nIt's been an odd week",
            "score": 1,
            "author": "BatadeCola"
        },
        {
            "level": 0,
            "comment": "**Cosmo Familia Vol. 1, by Hanokage**\n\n\nWell this was a thing. An interesting thing. At times an odd and fantastical thing. But it was a thing that was pretty kewl to read.",
            "score": 1,
            "author": "Roboglenn"
        },
        {
            "level": 0,
            "comment": "**A Fever in the Heartland, by Timothy Egan**\n\nReally disturbing history. Why do we elevate monsters and charlatans? Leaves you thinking that anyone who says \"It can't happen here\" hasn't read a shred of history. Chances are, whatever \"IT\" is, it's already happened here.",
            "score": 2,
            "author": "_JJMcA_"
        },
        {
            "level": 0,
            "comment": "**Shadows of Pecan Hollow, by Caroline Frost**",
            "score": 1,
            "author": "zsreport"
        },
        {
            "level": 0,
            "comment": "Horse by Geraldine Brooks.  Loved it. Love all her stuff.",
            "score": 1,
            "author": "abirgel1789"
        },
        {
            "level": 0,
            "comment": "Finished:\n\n**Our Hideous Progeny by C.E. McGill**\n\nThis took its time, I’m not sure that I loved it. The premise had a lot of potential but the characters were very black-and-white. The male characters in particular were all plainly bad (except for Jamsetjee) and that got boring and repetitive quick.\n\nI haven’t started anything, but I’m going through **Missing from the Village by Justin Ling**. I got really into it last night but I was so sleepy, but I’m definitely finishing it by the weekend.",
            "score": 3,
            "author": "Dancing_Clean"
        },
        {
            "level": 0,
            "comment": "Finished - The Covenant of Water by Abraham Verghese. What a sprawling narrative based on a family in olden days Kerala. Highly recommend for fans of books like The Eighth Life. \n\nCurrently Reading - The Shards by Bret Easton Ellis. Very captivating beginning. Love the mix of facts and fiction.",
            "score": 2,
            "author": "platinumhobi"
        },
        {
            "level": 0,
            "comment": "Finished: **Killers of the Flower Moon, by David Grann.** Very well written but depressing true crime history. I would have liked more Osage and less FBI, but the lack of source documents probably made that impossible.\n\nStarted: **Western Lane, by Chetna Maroo.** Reading this for the Tournament of Books summer camp discussion.\n\nContinuing: **Mercury Pictures Presents, by Anthony Marra.** Haven\"t had time to get into this one.",
            "score": 2,
            "author": "helen_twelvetrees"
        },
        {
            "level": 0,
            "comment": "Finished - Severance by Ling Ma. Absolutely loved this, and I didn't realise how well timed it was reading this two weeks after quitting my job, but it definitely affirmed my decision!\n\nCurrently reading - Lords of the Desert by James Barr. This has been pretty interesting so far and very accessible for a subject I have very little knowledge of, it's pretty dry though so I'm taking my time with it.",
            "score": 1,
            "author": "EthanSheppard98"
        },
        {
            "level": 0,
            "comment": "Finished **The Name of the Wind, by Patrick Rothfuss**\n\nStarted **The Wise Man’s Fear, by Patrick Rothfuss**",
            "score": 1,
            "author": "GunZinn"
        },
        {
            "level": 0,
            "comment": "Finished: Empire of Pain by Patrick Keefe. Excellent, well researched story of the family behind Purdue Pharma and OxyContin.\n\nAlso finished: Over the Edge of the World by Laurence Bergreen. Another well researched historical story of Magellan and the first men to circumnavigate the globe.\n\nUp next: Into Thin Air by John Krakauer. Will be my second reading - timely at the end of Everest’s (newest) deadliest season.",
            "score": 1,
            "author": "parkrangerbill"
        },
        {
            "level": 0,
            "comment": "The Weight of Blood, by Tiffany Jackson. Her books are seriously amazing. This one has some tones of Stephen King’s Carrie, but is a little more intense and deeper. My favorite of hers is Monday’s Not Coming. And yes this old lady loves the YA stuff haha.",
            "score": 1,
            "author": "Wen60s"
        },
        {
            "level": 0,
            "comment": "About to finish: Snow Crash by Neal Stephenson (last 30 pages) \n\nNext on list is: The Naked Sun by Issac Asimov",
            "score": 3,
            "author": "Low_Educator_6510",
            "replies": [
                {
                    "level": 1,
                    "comment": "How did you like Snow Crash?  It’s been on my shelf for awhile now but for some reason I keep picking up other things first.",
                    "score": 1,
                    "author": "Slartibartfast102",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I didn't enjoy it to be honest. It started great but somewhere in the middle the author just decided to put down to many things and the frustrating thing for me was that at the end some of those were not even closed off. For me it was not an easy read, and I just pestered on only to know how it ends.",
                            "score": 2,
                            "author": "Low_Educator_6510",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ha well, fair enough.  That's sort of the feeling that keeps knocking it down in my \"next up\" list.  Thanks.",
                                    "score": 2,
                                    "author": "Slartibartfast102",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I had the exact opposite experience with Snow Crash. I only was interested in it cause of the title but it was such a great read for me. The story felt a bit odd especially at the end and it felt rushed, but the overall experience was great, maybe cause I really loved the characters in it.",
                                            "score": 3,
                                            "author": "HairyBaIIs007",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I've decided it's fourth in line right now.",
                                                    "score": 1,
                                                    "author": "Slartibartfast102"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm midway through **Imaginary Friends, (edited) by John Marco and Martin H. Greenberg** . It's one of those delightful anthologies that's like a box of chocolates where the flavors vary but they're all very enjoyable. I think my favorite so far is probably the weird kind of Lady of Shalott one, which was surprisingly dark with a bittersweet ending. Although I did very much like the very earnest Mountie named Ian too. \n\nNext on my list is **The Affair of the Mysterious Letter, by Alexis Hall** which is promising to be like Sherlock Holmes but with a sorceress and a soldier back from an interdimensional war as her Watson/Wyndham. He is, to pull a quote from the description, going to be: \"beset by criminals, menaced by pirates, molested by vampires, almost devoured by mad gods, and called upon to punch a shark.\" It promises to be memorable.",
            "score": 1,
            "author": "gonegonegoneaway211"
        },
        {
            "level": 0,
            "comment": "Finished:\nAge of Vice by Deepti Kapoor\nThe Rabbit Hutch by Tess Gunty\n-Age of Vice was an epic read while the latter was okay. \n\nStarted:\nHappy Place by Emily Henry\n*I liked People We meet on Vacation but I did not like Book Lovers. I’m giving this one a chance. \nFive Survive by Holly Jackson\n*I read her last three (the trilogy), so thought I’d give this one a shot.",
            "score": 2,
            "author": "niconillawafer"
        },
        {
            "level": 0,
            "comment": "Finished: the candy house by Jennifer Egan\n\nThoughts: I loved coming back to the Goon Squad characters and all of their children/acquaintances. Egan is such a master of this format. I loved how she took a sci-fi concept and placed in in a world, but then focused on the characters and the human condition rather than the intricacies of the tech world she built. Was sad it was over!\n\nStarted: foster dade explores the cosmos by nash Jenkins \n\nThoughts: about 100/500 pages in - really intricate exploration of life in a boarding school in 2008. Definitely dense but hoping things pick up!",
            "score": 2,
            "author": "peaches192191"
        },
        {
            "level": 0,
            "comment": "Finished: *Zone One* by Colson Whitehead\n\nHonestly the most boring zombie apocalypse book though the final 50 pages were fun. He is a great writer and his prose is top shelf. But man I wanted more action.\n\nStarted: *Snow Crash* by Neal Stephenson\n\nGiving him a second shot. I hated Cryptonomicon. 25 percent in and enjoying it far more. So hopefully this keeps up.",
            "score": 4,
            "author": "eganba",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s funny I loved Zone One that exact reason! That book launched me into my Whitehead obsession",
                    "score": 1,
                    "author": "_kayayay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "See I went in thinking I would like it as well. But it just felt like the tangents served almost no purpose. Like he spent no time on why things went kaput at the end. He had ample time to dive into why the plan failed in NYC or how the skels (his term) were evolving and what that means. Instead he wasted pages on describing how people were living soulless lives before the apocalypse so why does it matter?",
                            "score": 1,
                            "author": "eganba"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Snow Crash is the only Stephenson book I have read and I loved it.",
                    "score": 1,
                    "author": "HairyBaIIs007"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Finished: Invisible Cities, by Italo Calvino\n\nRating: 4/5 stars\n\nThoughts: second time reading it. Incredibly beautiful. Extremely conceptual and not always easy because of the vignette style of the cityscapes. Definitely worth reading even for the language alone.\n\nStarted: Fierce Invalids Home from Hot Climates, by Tom Robbins\n\nThoughts: I just finished reading Jitterbug Perfume by Robbins earlier in the year with my husband. Robbins is as funny and captivating as Vonnegut IMO. His books are incredibly fun. I’m enjoying this one very much so far. A character drops XTC and his eyes are described as being as dialated as the burners on a dollhouse stove. Just a great talent for language.",
            "score": 3,
            "author": "Ok_Annual_2630",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Invisible Cities, by Italo Calvino\n\nI read this for the first time earlier this year. It's poetry by stealth!",
                    "score": 3,
                    "author": "TigerHall"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Finished: They Both Die at the End by Adam Silvera\n\nRating: 4.5/5 stars. \n\nThoughts: I really enjoy the book. One of the best books I’ve read in a long time. The only reason I did’t give it a 5/5 is because I feel like there are some stuff in the last 10 pages of the novel that can really be delved into if there is ever a true sequel to the 1st Death-Cast novel. \n\n\nStarted: The First to Die at the End by Adam Silvera. \n\nI’m looking forward to this book. A prequel to the 1st Death-Cast novel that sounds extremely intriguing. \n\n\nUp next once I’m done with Death-Cast novels. Percy Jackson &amp; the Olympians by Rick Riordan.  \n\n\nI’m really hoping that all of the upcoming live-action adaptations at Netflix and Disney+ respectively do them justice",
            "score": 2,
            "author": "Forsaken_Tip_596"
        },
        {
            "level": 0,
            "comment": "Finished- **Five Carat Soul by James McBride** \n\n5 out of 5 stars\n\nStarted- **The Sympathizer by Viet Thanh Nguyen**\n\nUtterly captivating so far. I think I may have picked two amazing books to read in a row.",
            "score": 6,
            "author": "Guster61"
        },
        {
            "level": 0,
            "comment": "Finished: Liberation Day, by George Saunders\n\nNot his strongest collection, but I enjoyed a few of the stories. \n\nStarting: Candide, by Voltaire",
            "score": 3,
            "author": "Ice9Vonneguy"
        },
        {
            "level": 0,
            "comment": "Finished: Contact by Carl Sagan\n\nStarted: Time to Kill by John Grisham",
            "score": 5,
            "author": "headphonehabit",
            "replies": [
                {
                    "level": 1,
                    "comment": "How did you like Contact?",
                    "score": 1,
                    "author": "HairyBaIIs007"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Finished: Divide &amp; Conquer, by Madeline Urban &amp; Abigail Roux; Hurricane Child, by Kacen Callender\n\nStarted: The Wisteria Society for Lady Scoundrels, by India Holton",
            "score": 3,
            "author": "yawnralphio"
        },
        {
            "level": 0,
            "comment": "Finished: An Immense World by Ed Yong\n\nStarted: the Sunny Nihilist by Wendy Syfret and The Lost Apothecary by Sarah Penner",
            "score": 3,
            "author": "peace_love_n_cats"
        },
        {
            "level": 0,
            "comment": "Finished: The Gunslinger by Stephen King\n\nThoughts - I thought it was a great start to a series. Though it is short it completely focuses on character building and background of our main protagonist while also moving forward plot. I thought this was more fantasy series than horror when I started, but I was wrong. He still has his eerie writing style in it that could make a fun scene freakishly chilling. The reason I am not going to the second one just yet is because I started this on my kindle and decided that I wanted to read it on paperback so I am waiting for the whole collection to come in from Amazon. I recommend it for any fantasy series fans out there. Just maybe read it with the lights on... lol\n\nStarts: The Midnight Library by Matt Haig",
            "score": 2,
            "author": "SillyChallenge2462"
        },
        {
            "level": 0,
            "comment": "Finished: invisible man by R. Ellison\n\nStarted: Slan by A E Van Vogt",
            "score": 2,
            "author": "thevoidcaptain"
        },
        {
            "level": 0,
            "comment": "Finished Stephen King - The Mist. \nStarting S.A. Cosby - All Sinners Bleed tomorrow.",
            "score": 1,
            "author": "Terrible-Ad1587"
        },
        {
            "level": 0,
            "comment": "The Count of Monte Cristo, by Alexandre Dumas\n\nI had watched the movie (2002) first and had no idea the original novel was so different. I'm still confused about how I feel about the end.",
            "score": 5,
            "author": "Resident_Judgment480"
        },
        {
            "level": 0,
            "comment": "**The Splendid and the Vile: A Saga of Churchill, Family, and Defiance During the Blitz by Erik Larson** \n\nIf it didn't actually happen, you would think they were exaggerating, Winston Churchill was a kooky eccentric genius who turned the tide of history on it's ass, in the midst of deep suffering, with the awesome power of words, while drunk and wearing funny costumes... Erik Larson is great. (also, Winston's son, Randolph Churchill was a total asshole).",
            "score": 1,
            "author": "vibraltu"
        },
        {
            "level": 0,
            "comment": "Started: Fight Club by Chuck Palahniuk\nFinished: The Night Circus by Erin Morgenstern (reread to wash out my other recent)\nFinished: Tender is the Flesh by Augustina Bazterrica",
            "score": 3,
            "author": "Getmeasippycup",
            "replies": [
                {
                    "level": 1,
                    "comment": "Loved fight club when I read it",
                    "score": 1,
                    "author": "thevoidcaptain"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A few hours ago I finished Hamlet by William Shakespeare, which I had started last week. My reason to read it was to get to know the play because I also started reading the fantasy novel The Raven Tower by Ann Leckie which is a Hamlet retelling in s fantasy setting so I thought I needed to know the play first.",
            "score": 3,
            "author": "IsabellaOliverfields"
        },
        {
            "level": 0,
            "comment": "Started/Finished Pride and Prejudice in 3 days. Wow! What a book! Made it into my top 3 of favorite fiction books right behind Three Musketeers and in front of 1984. \n\nCount of Monte Cristo is next. I don't know when I will finish that one.",
            "score": 3,
            "author": "EDPhotography213",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just finished a reread of P&amp;P! It never gets old ❤️",
                    "score": 2,
                    "author": "_kayayay",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m happy to hear!!! Will definitely read it in the future. \n\nI’m not going to lie, I was prejudiced against the book. As a guy, and hearing some people talk about the romance portion of the book, I thought that it would be like a Charolette Brontë book. And I’m not hating on romance novels, I just hate it combined with all prose that Brontë uses. I can deal with all the prose, hell, I loved A Picture of Dorian Gray. So when I started reading it, and then these characters started jumping to conclusions and showing their pride, it made me want to tell the characters “yea, perhaps you need to take a step back!.” That was the moment that I was like “holy shit, Jane Austen, you are on to something here.” \n\nIt is a criticism of the time with parents wanting their daughters to marry out of money/status, while showing how dumb it was back then to see someone a few times before getting hitched, parents who don’t care and aren’t focused on their children, etc, but to me is was more an exploration of behavioral psychology and on logic.\n\nI mean, I can keep going on and on about this book. \n\nI will say, that I love tragedies. Many people hate it when the hero or lovable character dies or when an ending is ambiguous, which they will say that it was a bad ending, but I love them. Yet, this was the first book where I was heavily rooting for Elizabeth and Darcy to end up together(and Jane and Bingley too). I would have been massively crushed if they didn’t. I don’t think I can say the same for other books.",
                            "score": 1,
                            "author": "EDPhotography213"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Finished: Kaiju Preservation Society by John Scalzi\nFinished: Well of Ascension by Brandon Sanderson",
            "score": 2,
            "author": "Baked_Nebraska",
            "replies": [
                {
                    "level": 1,
                    "comment": "Finished: Alloy of Law by Brandon Sanderson (because they didn’t have Hero of Ages at the library)",
                    "score": 1,
                    "author": "Baked_Nebraska"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Soulsmith, by Will Wight\n\nRe-reading the series for the release of the final book.",
            "score": 1,
            "author": "Dalton387"
        },
        {
            "level": 0,
            "comment": "started: Agency, by William Gibson",
            "score": 2,
            "author": "BASerx8"
        },
        {
            "level": 0,
            "comment": "Started, “Lincoln Highway”",
            "score": 1,
            "author": "rich22201"
        },
        {
            "level": 0,
            "comment": "The Hunger Games by Suzanne Collins !! I’ve never read them before so very excited",
            "score": 3,
            "author": "appl3ju1ce87"
        },
        {
            "level": 0,
            "comment": "Just finished Nightbitch by Rachel Yoder. \n\nAnd started Roses, in the Mouth of a Lion by Bushra Rehman.",
            "score": 2,
            "author": "only_pans_"
        },
        {
            "level": 0,
            "comment": "Finished: **The Iron Wyrm Affair, by Lilith Saintcrow**\n\nStarted: **Stealing the Show: A History of Art and Crime in Six Thefts, by John Barelli**",
            "score": 2,
            "author": "wolfytheblack"
        },
        {
            "level": 0,
            "comment": "Reading\n\nThe Wisteria Society of Lady Scoundrels by India Holton - A group of ladies who use magic to fly around in houses and be pirates. Seems a bit lighthearted.\n\nRereading\n\nThe Sword of Shannara by Terry Brooks - I haven't read this since my early twenties and I'm now 40. This is a very nostalgic book for me.",
            "score": 2,
            "author": "myyouthismyown"
        },
        {
            "level": 0,
            "comment": "Star Wars: Dark Legends by George Mann",
            "score": 3,
            "author": "Hancock02"
        },
        {
            "level": 0,
            "comment": "Finished The Goldfinch by Donna Tartt \nWish I had known she was very inspired by Dickens before reading but overall it was a good read",
            "score": 1,
            "author": "machettemonkey"
        },
        {
            "level": 0,
            "comment": "I started re-reading **Queen of Conqueror- The Life of Matilda, Wife of William I by Tracy Borman**.",
            "score": 1,
            "author": "Larielia"
        },
        {
            "level": 0,
            "comment": "The Odyssey",
            "score": 2,
            "author": "TheProdigalApollyon"
        },
        {
            "level": 0,
            "comment": "I finished The Gatekeeper by James Byrne",
            "score": 1,
            "author": "Hollandmarch76"
        },
        {
            "level": 0,
            "comment": "Started: How to Read Literature Like a Professor Thomas C. Foster",
            "score": 1,
            "author": "bromodragonfly11"
        },
        {
            "level": 0,
            "comment": "Finished: The Long Ships, by Frans Bengtsson",
            "score": 1,
            "author": "sharklazers7"
        },
        {
            "level": 0,
            "comment": "East of Eden by John Steinbeck!\nI wish i could read more than one book at a time, but this is an amazing book. It’s been on TBR list for a while and finally got into it.",
            "score": 7,
            "author": "BroomPeople26",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just finished EoE this morning! Absolutely incredible book. I didn’t want it to end",
                    "score": 2,
                    "author": "show_me_the_cookie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "We have Always Been Here by Lena Nguyen \n \nThe City of Dreaming Books by Walter Moers\n\nYellowFace by K.F. Kuang \n\nThe Violin Conspiracy by Brendan Slocumb",
            "score": 1,
            "author": "Izzywillow19",
            "replies": [
                {
                    "level": 1,
                    "comment": "What did you think of *Yellowface*? I found it very gripping and couldn't stop reading once I started, but I found to be extremely \"contemporary\" and I feel like it will age really quite badly. I can see it being forgotten about entirely in a few years.",
                    "score": 1,
                    "author": "snlnkrk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "interesting. I think it will go down as \\*the\\* book that captured the insanity of 21st century US identity politics in the times of Social Media and its impact on the literary world to a T. of course the world is fast moving etc but I feel it will become part of university curriculums for decades to come",
                            "score": 2,
                            "author": "honkyhonk202"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Finished:\n\n**Afterparties, by Anthony Veasna So** 5/5, representation matters. \n\n**Killers of a Certain Age, by Deanna Raybourn** 2/5.\n\nStarted:\n\n**Beach Read, by Emily Henry**\n\n**We are Never Meeting in Real Life, by Samantha Irby**",
            "score": 2,
            "author": "finallypluggedin"
        },
        {
            "level": 0,
            "comment": "Finished \nInciting Joy, Ross Gay\nTastes Like War, Grace M Cho\nA Head Full of Ghosts, Peter Tremblay\nMistakes Were Made, Meryl Wilsner \n\nStarted\nWynd Vol. 2, James Tynion IV \nAlive at the End of the World, Saeed Jones\nWolf in White Van, John Darnielle",
            "score": 1,
            "author": "skippymcdippy97"
        },
        {
            "level": 0,
            "comment": "Just got done reading East of Eden. Pry the best book I have ever read. Enlightening and sad with great characters. I highly recommend",
            "score": 4,
            "author": "tetragrammaton19",
            "replies": [
                {
                    "level": 1,
                    "comment": "My favorite book ever. Reread it at least once every year or so. It's astounding to me one man was able to write a book so intricate and descriptive.",
                    "score": 1,
                    "author": "Guster61"
                },
                {
                    "level": 1,
                    "comment": "I just started if yesterday, only a few chapters in and it’s incredible",
                    "score": 1,
                    "author": "BroomPeople26",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Keep going, there's always a character you can relate to and to inspire to be like *cough* Samuel *cough*",
                            "score": 3,
                            "author": "tetragrammaton19"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Finished:\n\nShuggie Bain by Douglas Stuart - An absolute emotional rollercoaster and I loved it. 5/5 definitely going down as an all-time favorite\n\nThe Sanatorium by Sarah Pearse - Unfortunately I DNF, I couldn't get into the writing style, it irritated me.\n\nHeartstopper, Volume 2 by Alice Oseman - The wholesome adorable break I needed. I basically ran to the bookstore to get the next 2 volumes\n\nStarting:\n\nConversations with Friends by Sally Rooney - I just bought this and have heard good things so I'm looking forward to reading!",
            "score": 2,
            "author": "origamicyclone"
        },
        {
            "level": 0,
            "comment": "Started:\n\n**The Robber Bride, by Margaret Atwood.**",
            "score": 1,
            "author": "GrudaAplam"
        },
        {
            "level": 0,
            "comment": "Atm I'm reading **Wuthering Heights, by Emily Brontë** and **Dune Messiah, by Frank Herbert**",
            "score": 1,
            "author": "natus92"
        },
        {
            "level": 0,
            "comment": "Rabbits by Terry Miles\n\nGreat idea, but maybe implementation is a little bit straightforward and plain. This book might become sort of virus and obsession if would have been written better. Nevertheless, really enjoyed it and found lots of intriguing references for books, concepts, movies etc, as from the book itself as well as from reviews.",
            "score": 1,
            "author": "Terrible_Proposal739"
        },
        {
            "level": 0,
            "comment": "Started:\n\n**Not on My Watch, by Alexandra Morton**\n\nFinished:\n\n**The Luminaries, by Susan Dennard**\n\nDNF'd:\n\n**A Gentleman in Moscow, by Amor Towles**",
            "score": 1,
            "author": "hershey-13"
        },
        {
            "level": 0,
            "comment": "Started and Finished: The Picture Bride by Lee Geum-Yi\n\nCurrently not reading anything, have a bit too much on my plate to start a new book",
            "score": 1,
            "author": "Master-Strawberry-26"
        },
        {
            "level": 0,
            "comment": "The Running Man, by Richard Bachman (A.K.A Stephen King)\n\nReally enjoyed it, of the three Bachman books I've read I'd put it below The Long Walk but above Rage.",
            "score": 1,
            "author": "BigBortlesBrand"
        },
        {
            "level": 0,
            "comment": "I'm re-reading Hitchhiker's Guide.   I have the 4-book volume on my Kindle.   I finished the first one.  I'm a few pages into Restaurant at the End of the Universe.\n\n&amp;#x200B;\n\nI may DNF it.   I already know all the humor before I read it.",
            "score": 1,
            "author": "ZaphodG"
        },
        {
            "level": 0,
            "comment": "Finished:\n\nThe Serpent &amp; The Wings of Night by Carissa Broadbent\nSix Scorched Roses by Carissa Broadbent\n\nStarted \n\nThe Ashes &amp; The Star-Cursed King by Carissa Broadbent\nIt Happened One Summer by Tessa Bailey",
            "score": 1,
            "author": "esmebeauty"
        },
        {
            "level": 0,
            "comment": "I finished The Lunar Chronicles #3 at the end of the week and started The Last Kingdom #4.\n\nAlso finished An Abundance of Katherines at the beginning of the week.",
            "score": 1,
            "author": "Beautiful-Cat-1519"
        },
        {
            "level": 0,
            "comment": "Finished:\n\n**Inherent Vice, by Thomas Pynchon**\n\nStarted:\n\n**Oliver Twist, by Charles Dickens**",
            "score": 2,
            "author": "Significant-Tea8004"
        },
        {
            "level": 0,
            "comment": "I just finished With My Little Eye by Joselyn Jackson.  I enjoyed it a lot.  I like Joselyn Jackson a lot.  My only complaint was the ending felt kind of abrubt.\n\nI am starting Prarie Fires by Carolyn Frasier.\n\nI'm still listening to A Rip Through Time by Kelley Armstrong.  Honestly, I get interrupted so much when I'm trying to listen to audio books that I might just go ahead and down load this to finish it on my e-reader.",
            "score": 1,
            "author": "Minute-Mushroom-5710"
        },
        {
            "level": 0,
            "comment": "*Finished:*\n\n**Black House by Stephen King and Peter Straub -** This was my read for the state of Wisconsin for my Cross-country Literary Road Trip. I love King's writing in general, and this was very him. I'm still not sure why I needed to read The Talisman first, but it was also enjoyable. I like how much some of his stuff ties together behind the scenes, and some of it doesn't hide the connections at all. There were some bits in here that make me question King's mind, but also, he has always been inventive and tends towards some truly WTF kind of stuff so, not that surprising. \n\n&amp;#x200B;\n\n*Starting Soon:*\n\nI'm not entirely sure, I do know I'm going to read something light as a palette cleanser, and I'm taking a one or two book break from my road trip(I've finished everything East of the Mississippi, so I think I deserve a teensy break from it); so something where those two objectives align.",
            "score": 0,
            "author": "Affectionate-Crab-69"
        },
        {
            "level": 0,
            "comment": "Finished:\n\n**Uncle Fred in the Springtime, by P.G. Wodehouse**\n\nIt's not my favourite Blandings Castle book. I miss Galahad and find the plot just a bit too complicated. But Uncle Fred is a fun character, and it was still good enough to get me to laugh out loud a few times.\n\nStarted:\n\n**Mrs Frisby and the Rats of NIMH, by Robert C. O'Brien**\n\nI was inspired to read it by a recent post on this sub. I loved the movie as a kid but had never gotten around to reading the book.",
            "score": 1,
            "author": "Missy_Pixels"
        },
        {
            "level": 0,
            "comment": "Started:\n\n***Swann's Way*****, by Marcel Proust**\n\nBeautiful writing, but I'm in a slump and may put this aside for now.",
            "score": 1,
            "author": "a-g1rl-has-no-name"
        },
        {
            "level": 0,
            "comment": "Read this week:  The Nickel Boys\n\nStarted this week: The case for mental imagery",
            "score": 3,
            "author": "couchjitsu"
        },
        {
            "level": 0,
            "comment": "Read this week:\nThe Recipient, Audrey J. Cole \n\nTomorrow and Tomorrow and Tomorrow, Gabrielle Zevin. \n\nReally enjoyed both!!\n\nStarted this week:\nA Man Called Ove, Fredrik Backman \n\nMindfulness, Ellen J. Langer\n\nHoping to finish both by the end of the week.\n\nNot sure what I will be reading next.",
            "score": 2,
            "author": "sflo97"
        },
        {
            "level": 0,
            "comment": "Finished ‘The Children of Red Peak’ by Craig DiLouie.\n\nStarted ‘The Only Good Indians’ by Stephen Graham Jones",
            "score": 2,
            "author": "Arkio-Pteryx"
        },
        {
            "level": 0,
            "comment": "I started **The Land of Little Rain, by Mary Hunter Austin**.",
            "score": 1,
            "author": "OodlesOfPoopNoodles"
        },
        {
            "level": 0,
            "comment": "Started The Perfect child by Lucinda Berry. So far enjoying it. \n\nI tried reading Spare but just could not get into it.",
            "score": 1,
            "author": "nickygirl19"
        },
        {
            "level": 0,
            "comment": "Just started Necronomicon by Lovecraft :)",
            "score": 1,
            "author": "Veridiyus"
        },
        {
            "level": 0,
            "comment": "Finished rereading **To Kill a Mockingbird, by Harper Lee**\n\nStarted reading **Missoula: Rape and the Justice System in a College Town, by Jon Krakauer**. So far, one of the most infuriating books I've ever read.",
            "score": 1,
            "author": "twobrowneyes22"
        },
        {
            "level": 0,
            "comment": "Finished: **Network Effect, by Martha Wells** (Murderbot Diaries #5) - I just LOVE this series, and honestly this is one of my favs so far. Hoping to read the next one this week or next based on library holds.\n\nFinished: **The Spy, by Paulo Coelho** \\- This was for my book club's monthly theme (any book by Paulo Coelho). I know very little about Mata Hari, the real person who apparently did some crazy stuff during her life, and I thought the way this told the story (from her perspective, in letter(ish) format), was interesting and compelling. I didn't get a full message from it, but I enjoyed the read and the writing style.\n\nFinished: **Gideon the Ninth, by Tamsyn Muir** (The Locked Tomb #1, audiobook) - This is the 2nd time I've read this book; I wanted to listen to the audio and OH BOY was it amazing! 17 hours of listening is a huge commitment, but I am so happy I took the time.\n\nStarted: **The Scarlet Letter, by Nathaniel Hawthorne** \\- You guys, I'm gonna be honest, I don't know if I can read this again. It's for my book club's July theme, which is a reread of a book you hated (likely in school) but seriously? I'm staring at a 45 page Introduction apparently written by the author for his own work and I think I dozed off twice so far. I'm going to power through, but when I get bored I've got a couple others next up in the queue:\n\n**Spy x Family, Vol. 6, by Tatsuya Endo**\n\n**Flux, by Jinwoo Chong**",
            "score": 0,
            "author": "maolette"
        },
        {
            "level": 0,
            "comment": "Started: The Forest by Alexander Nemerov",
            "score": 1,
            "author": "WakeMeForSourPatch"
        },
        {
            "level": 0,
            "comment": "Finished: “Never Never” by Colleen Hoover\n\nStarted: “The Seven Husbands of Evelyn Hugo” by Taylor Jenkins Reid",
            "score": 1,
            "author": "Opposite-Cry-9661"
        },
        {
            "level": 0,
            "comment": "Finished: **House of Sand and Fog,** by **Andre Dubus III**\n\nStarting: **Shopgirl,** by **Steve Martin**",
            "score": 1,
            "author": "meatballhead_"
        },
        {
            "level": 0,
            "comment": "* Finished: **1984, by George Orwell**\n* Started and finished: **Project Hail Mary, by Andy Weir**\n* Started and DNFed: **The Water Keeper by Charles Martin**\n* Started: **How to Read Literature Like A Professor by Thomas A. Foster**\n* Continued: **The Idiot by Dostoevsky**",
            "score": 2,
            "author": "Previous_Injury_8664"
        },
        {
            "level": 0,
            "comment": "**The Paris Apartment, by Lucy Foley**. Good things first: it was much better than Foleys The Guest List. However, it was exactly what I expected from her: a throwaway murder mystery that would surprise no one besides newbies to the genre. **6/10**\n\n**We Begin at the End, by Chris Whitaker**. A somber family drama with engaging characters and heart-wrenching ending. It has everything to be a smash hit. I'm surprised it's not more popular. **8/10**",
            "score": 4,
            "author": "Romt0nkon"
        },
        {
            "level": 0,
            "comment": "Finished: **The Song of Achilles,** by **Madeline Miller**\n\nStarted: **Frankenstein,** by **Mary Shelley**",
            "score": 3,
            "author": "BattyNess",
            "replies": [
                {
                    "level": 1,
                    "comment": "What did you think of Song of Achilles?",
                    "score": 1,
                    "author": "maolette",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It was an easy, fun, quick read but the book itself was ok. I didn't feel as emotionally stirred as one would expect. I wasn't blown away considering I have heard so much about it on this sub. I am glad I read it, once :)\n\nEdit to add: On the other hand, absolutely loving Frankenstein. Half way through and best book I have read this year!",
                            "score": 3,
                            "author": "BattyNess",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I liked Song of Achilles and LOVED Circe. I'd try that one if you haven't already. My dad's favorite book is Frankenstein and I've not yet read it!",
                                    "score": 3,
                                    "author": "maolette",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Circe is better? I read Song Of Achilles and I sobbed through the whole ending, which definitely made it better for me, but I didn't think the characters were particularly well developed. Circe is on my list.",
                                            "score": 2,
                                            "author": "Beautiful-Cat-1519",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Circe gives lots of time to dig into this character who is often sidelined and pigeonholed into being an archetype of a woman rather than a fully-fledged character. Reading from her perspective made me want to run away to an island and be a badass witch!",
                                                    "score": 2,
                                                    "author": "maolette",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That sounds so much better!!! I think I'll put it on my pile and read it soon.",
                                                            "score": 2,
                                                            "author": "Beautiful-Cat-1519"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Circe is better? I read Song Of Achilles and I sobbed through the whole ending, which definitely made it better for me, but I didn't think the characters were particularly well developed.",
                                            "score": 1,
                                            "author": "Beautiful-Cat-1519"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I was going to skip Circe but I will read if you say so!",
                                            "score": 1,
                                            "author": "BattyNess",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I really enjoyed Miller's writing and I read Circe first and it was one of my books of the year. I read Song of Achilles after and definitely felt it wasn't as good. I do wonder if it's because we all know the story of Achilles, and we have our Hollywood heroes who've played the roles, but with Circe this story is fully told, with snippets of stories it crosses.",
                                                    "score": 2,
                                                    "author": "maolette",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I agree, part of it could be because most of us know the story of Achilles.",
                                                            "score": 1,
                                                            "author": "BattyNess"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Permanent Record, by Edward Snowden.",
            "score": 2,
            "author": "smurfy1634"
        },
        {
            "level": 0,
            "comment": "Started **Poverty, by America, by Matthew Desmond**.  Desmond won a Pulitzer for *Evicted* a couple years ago.  I'd read an interview recently where he discussed his new book and it got me interested. Listening to the audiobook.  So, so full of information, though the content is admittedly a bit overwhelming and depressing.",
            "score": 1,
            "author": "Gigantosaurous"
        },
        {
            "level": 0,
            "comment": "Continuing\n\n\nOur Share of Night by Mariana Enriquez\n\nGhostwater by Will Wight\n\nThe Idiot by Fyodor Dostoevsky\n\n\n*** I don't normally include books I read to my children but we just started Odder by Katherine Applegate. It's inspired by a true story of Monterey Bay aquarium sea otter. It's told in a lyrical style and has these charming black and white illustrations. It's very different from other children's books we've read but it's really captured all of us.",
            "score": 2,
            "author": "iverybadatnames"
        },
        {
            "level": 0,
            "comment": "FINISHED\n\n**Cat Diary: Yon &amp; Mu, by Junji Ito:** My first time reading Junji Ito (and first time reading a manga!) and I really liked it! It's pretty weird and funny and I love the art style. I bought the collector's edition (cover glows in the dark! :)) and read it on the bus while traveling home. I plan to read more Junji Ito's horror stuff!\n\nSTARTED\n\n**Persepolis, by Marjane Satrapi:** Since I'm kind of in the \"graphic novel mood\" I decided to finally read Persepolis. I watched the movie years ago and loved it. Got the graphic novel for my previous birthday.",
            "score": 4,
            "author": "Pitiful_Knowledge_51",
            "replies": [
                {
                    "level": 1,
                    "comment": "Both of these are fabulous graphic selections!",
                    "score": 2,
                    "author": "maolette"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lord of Emperors by Guy Gavriel.\n\n\"Uncrown, Lord of Emperors awaits you now.\"\nI finished that book in two days. Now I can't get Sarantium out of my head.",
            "score": 2,
            "author": "Aabirroy00"
        },
        {
            "level": 0,
            "comment": "Finished yesterday: Love on the Brain by Ali Hazelwood. I thoroughly enjoyed it, it was so cute and funny!",
            "score": 1,
            "author": "National_Sky_9120"
        },
        {
            "level": 0,
            "comment": "Finished: \n\n**Boonville, by Robert Mailer Anderson**\n\n**I'm Glad my Mom Died, by Jennette McCurdy**",
            "score": 2,
            "author": "ReadWriteHikeRepeat"
        },
        {
            "level": 0,
            "comment": "Finished:\n\n**The Stranger, by Albert Camus**\n\n**Poster Girl, by Veronica Roth**\n\n**Old Man's War, by John Scalzi**\n\n**The Hidden Life of Ice, by Marco Tedesco**\n\nPassing comps and traveling = so much reading. Poster Girl is honestly my favorite book by Veronica Roth to date. Some of the dangers of data/digital oversight was a little on the nose but very well-written and engaging. Definitely a Roth ending, which I appreciate.\n\nCurrently reading:\n\nRereading The Stranger, read it too fast the first time.\n\n**Vicious, by V. E. Schwab**\n\n**The Serpent and the Wings of Night, by Carissa Broadbent**\n\nThis might be a DNF, I think I'm aging out of the YA/NA fantasy genre :(",
            "score": 1,
            "author": "Gopuleius"
        },
        {
            "level": 0,
            "comment": "Finished: \n\n**Slenderman, by Kathleen Hale**.  Book on the Slenderman Stabbings.  I only realized at the end that all the girls in this book were the same age as my oldest child.  It was very well-written, but she has an obvious agenda and made a couple of statements I see as pretty dubious (chiefly, that 11- and 12-year-olds don't understand that death is permanent), and also pretty much relegated the victim to footnote status after the crime.  She was only mentioned a handful of times, while her would-be murderers got the bulk of the text.  Which, on the one hand I sort of get that that's where most of the story was since the author was making a case against trying such young adolescents as adults, but on the other it felt disrespectful to the one person in the book who did nothing wrong.\n\nStarted:\n\n**The Hidden, by Melanie Golding**: Fairly interesting, but not earth-shaking.  For some reason this is classed as a thriller, even though it's very slow-moving and has some elements of fantasy.  There's some tense-jumping I'm not very fond of, but it's holding my interest.",
            "score": 2,
            "author": "Grave_Girl"
        },
        {
            "level": 0,
            "comment": "Finished **Leviathan Falls, by James S.A. Corey** and **The Sins of Our Fathers, by James S.A. Corey** to complete The Expanse. It was a good ride with the Roci and her crew. \n\nStill reading **The Waste Lands, by Stephen King**.",
            "score": 1,
            "author": "GanymedeBlu35"
        },
        {
            "level": 0,
            "comment": "Just finished: Transcendent Kingdom, by Yaa Gyasi\nIt really touched me; the novel deals with such heavy topics which I could relate to on a personal level. [[Family drama, addiction, depression]]\nI was to start another book right away because I'm participating in a reading challenge, but I just couldn't. I need some time after this one.",
            "score": 3,
            "author": "Atota419"
        },
        {
            "level": 0,
            "comment": "Still Reading:\n\n**A Crown of Swords by Robert Jordan:**\n\nEverything I've read about the WoT series says this is where the \"slog\" starts, but I would disagree. I've really enjoyed this one so far and feel the pacing is even stronger than *Lord of Chaos* was. My journey through the Wheel of Time will take a while as I am not the fastest reader but I am thoroughly enjoying the series and just how massive of a world Jordan created.",
            "score": 1,
            "author": "rolandofgilead41089"
        },
        {
            "level": 0,
            "comment": "Finished:\n\nBurnt Sugar, by Avni Doshi \n\nStarted:\n\nThe First Book of Calamity Leek, by Paula Lichtarowicz",
            "score": 3,
            "author": "pinkhplays"
        },
        {
            "level": 0,
            "comment": "Finished:\n\n**Leech, by Hiron Ennes**\n\nI absolutely adored this. I was pretty shocked to hear it had such mixed reviews, and that it was the author's first novel. The settings are charming and well developed, the prose is delightful, and the main character's fairly unique premise is well executed. I feel like maybe it may not hold up as well on a reread, but for the time being I'm very charmed by this book.\n\n**Below, by Laurel Hightower**\n\nI'm not going to be writing home about this one, but as a horror novella it was done well enough. A good concept; could probably make a decent movie. I was disappointed that the creature on the cover didn't have more screentime.",
            "score": 3,
            "author": "SwayzeCrayze",
            "replies": [
                {
                    "level": 1,
                    "comment": "Leech is so good. Every time I thought I knew what was going on, another twist proved me wrong. It was such an original premise and so so bizarre (but in a good way) I loved it and have recommended it to other people.",
                    "score": 2,
                    "author": "iverybadatnames"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Finished \n\n**Yellowface by R.F. Kuang -** I loved it, it's generally ridiculous and unhinged and I'm into that so it was a good one for me.\n\nStarted\n\n**The Dark Forrest by Cixin Liu -** I'm so intrigued by this series, I can't wait to see where this book takes us and there the next one does\n\n**A Memory Called Empire by Arkady Martine -** Been on a sci-fi kick as of late, and I'm really enjoying this, especially with the politics. And I wanted to start off pride month right with a queer book",
            "score": 6,
            "author": "umm-iced",
            "replies": [
                {
                    "level": 1,
                    "comment": "Both of those sci-fi picks are fun reads, although if you're looking for more \"progressive\" character descriptions then you won't find them with Liu.\n\nI personally found *Yellowface* to be crazy but good fun, but I feel like it is quite \"contemporary\": seems to me like it will age poorly.",
                    "score": 2,
                    "author": "snlnkrk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I agree with you on Liu, super fun book, but yeah the character descriptions leave something to be desired",
                            "score": 1,
                            "author": "umm-iced"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Finished \n\n**Ella Baker and the Black Freedom Movement, by Barbara Ransby**\n\na richly reported biography of a lesser known but pivotal civil rights figure, this should be required reading for anyone interested in modern american history. \n\nStarted\n\n**Shadow of the Torturer, by Gene Wolfe**\n\nthe first book in a 4 book cycle which Wolfe is best known for. it's quite good. gene wolfe invented pringles.",
            "score": 2,
            "author": "megalomike"
        },
        {
            "level": 0,
            "comment": "Finished:\n\n**The Ruin of Kings, by Jenn Lyons**\n\nPublished in 2019, it's the first book in The fantasy series, [A Chorus of Dragons](https://www.goodreads.com/series/237019-a-chorus-of-dragons). The story follows an orphan named Kihrin, primarily about the discovery of his innate abilities and true heritage. Unfortunately this story has some serious drawbacks — poorly structured worldbuilding, a convoluted plot, and unsympathetic characters. I won't be reading further in this series.\n\n----------------------\n\nStarted:\n\n**The Habsburgs: To Rule the World, by Martyn C. Rady**\n\nPublished in 2020, this is the history of a powerful European dynasty that assembled a global empire and ruled it for centuries. The author, Martyn Rady, is Masaryk Professor Emeritus of Central European History at the School of Slavonic and East European Studies, University College London. Although retired, Rady continues to research and write about Central European history.",
            "score": 1,
            "author": "BohemianPeasant"
        },
        {
            "level": 0,
            "comment": "*Finished:* \n\n**The Fifth Season, by N.K. Jemisin**\n\n*Started:* \n\n**The Obelisk Gate, by N.K. Jemisin**\n\n*Continued:*\n\n**A Prayer for the Crown-Shy, by Becky Chambers**\n\n**Babel, by R.F. Kuang**",
            "score": 4,
            "author": "octobersunny"
        },
        {
            "level": 0,
            "comment": "Finished: Cress by Marissa Meyer\n\nStarted: Fairest by Marissa Meyer",
            "score": 3,
            "author": "SirGav1n",
            "replies": [
                {
                    "level": 1,
                    "comment": "I finished Cress this week too! I love Marissa Meyer so much!!! ❤️\n\nWhat did you think of it?",
                    "score": 1,
                    "author": "Beautiful-Cat-1519",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Cress was my favorite so far. I like Captain Thorne a lot. I stepped out of my usual hard sci-fi genre and went to YA. Such a unique book and no regrets.",
                            "score": 1,
                            "author": "SirGav1n"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Finished: **The Outside Man, by Don Bentley**\n\nStarted: **The Handler, by M.P. Woodward**",
            "score": 2,
            "author": "Awatto_boi"
        },
        {
            "level": 0,
            "comment": "*Finished*\n\n* **Heart of the Sun Warrior, by Sue Lynn Tan** \\-absolutely loved this duology based in Chinese mythology. Thanks to r/books for hosting the book club and AMA with the author\n* **Sign of the Four, by Sir Arthur Conan Doyle** \n* **A Natural History of Dragons, by Marie Brennan** \\- this was a re-read now that I own the rest of the series. Enjoyed it even more the second time around.\n\n*In progress*\n\n* **Middlemarch, by George Eliot** \\- reading with r/ayearofmiddlemarch and enjoying immensely.\n* **Incredible Tales, by Saki** \n* **The Poetic Edda, translated by Jackson Crawford** \n* **Great Classic Stories III 22 Unabridged Classics, by Herman Melville, Kate Chopin, Willa Cather, Mark Twain, Anton Chekhov, Ambrose Bierce, Bret Harte, Jack London** \\- this contains some excellent stories.\n* **The Idiot, by Fyodor Dostoevsky** \\- reading with r/ClassicBookClub and anxious to read more.\n* **Haunted Ground, by Erin Hart** \\- a nice mystery\n* **A Thousand Names for Joy, by Byron Katie and Stephen Mitchell** \n* **The Daughters of Izdihar, by Hadeer Elsbai** \\- reading with r/fantasy book club\n* **The House on the Borderland, by William Hope Hodgson** \\- an old-fashioned horror story\n\nShort stories\n\n* Diary of a Madman by Nikolai Gogol \n* The Will of the God of Music by PH Low - this was some excellent body horror from Fantasy Magazine",
            "score": 4,
            "author": "Trick-Two497"
        },
        {
            "level": 0,
            "comment": "Finished: Aurora by David Koepp\n\nStart: Legion by Brandon Sanderson.",
            "score": 2,
            "author": "Officer_Warr"
        }
    ]
}