{
    "id": "141dht9",
    "score": 0,
    "title": "Is the writing of Harry Potter actually liked, or more like tolerated?",
    "author": "Silvere01",
    "date": 1685969312.0,
    "url": "https://www.reddit.com/r/books/comments/141dht9",
    "media_urls": [],
    "other_urls": [],
    "postText": "Whenever HP and its writing comes up, the strengths are usually said to be the description of the images and the character driven story, while the overall writing is okay. \n\nOne of the most repeated arguments in favor of the writing a lot of times is how the earlier books were written for children, and how they evolved over time to age with their readers.\n\nNow, I have problem with that; Or more like, am confused. I LOVED the first movies and the world. Before that I got the first book as a child. And I absolutely HATED the book. I was no big reader, but I read. And boy, I couldnt get through any amount of double digit number of pages before putting the book to the side. As a child, I found it so utterly terrible written; I only went to the movie because of friends. After the awesome first movie I tried to get back into it - Goddamn, I just couldnt stand it.\n\nAs it happens, HP content likes to hit the front page. Im still nostalgic for the movies, so I often look into the threads. As the people argue, they often cite quotes of the books. And nearly without exception, even with later books, I groan and feel put off by the writing. E.g. conversations, they never flow or feel natural for me. It all reads so bad. I know this ain't GRRM levels, but I just can't read this. And I got through Eragon back then!\n\nSo, since the latest frontpage post, this just got me wondering... Does JR have some specific style that I absolutely dont vibe with? Is the writing in general just bad and people praise it for nostalgic reasons? I cant think of any other book (granted I read only a few a year) that gets such reactions out of me. Maybe something like 50 shades of grey, but thats only from hearsay - The movies I was forced through were enough.\n\nIm just so confused because even as a kid I hated it so much, and I never warmed up to the books. Instead, it only gets worse whenever I see some book excerpt.",
    "comments": [
        {
            "level": 0,
            "comment": "Different people like different things. \n\nIt's fine for you not to like the writing. If it doesn't click for you, it doesn't click for you. There are some people who, obviously, really liked the books and even liked the writing. \n\nThere's nothing to be confused about: some people like things that other people don't, and that's okay.",
            "score": 40,
            "author": "Samael13",
            "replies": [
                {
                    "level": 1,
                    "comment": "Certainly. I found the books not very enjoyable but my sister absolutely loved them. We both enjoy the series, just she prefers the books and I prefer the movies. Difference in what we like reading.",
                    "score": 1,
                    "author": "Methuselah780"
                },
                {
                    "level": 1,
                    "comment": "&gt;There are some people who, obviously, really liked the books and even liked the writing. \n\nYeah, people are well in their right to like the books! And the writing.\n\nIm just wondering if the writing style is part of the magic for them, or if everything else works together so nicely that they tolerate the, in my mind, worse part.",
                    "score": -13,
                    "author": "Silvere01",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes. \n\nLook, with a book as widely popular as Harry Potter (or almost any book, really) there are going to be people who like it in all kinds of different ways. Some people will like it despite the writing style. Some people will like it *for* the writing style. Some people will be neutral on the writing style. \n\nI don't really understand what these kinds of posts are looking for. Are you hoping people will somehow change your mind?",
                            "score": 11,
                            "author": "Samael13",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; I don't really understand what these kinds of posts are looking for.\n\nI was wondering if I should re-evaluate my opinion of the books, since many people kept discussing the writing and, as I understood, JRs writing was mostly considered to be middling. I mostly wanted to see if other people share my feelings, or if I'm the odd one out and should bother to have another look.\n\nBut don't worry, the second I was accused of making this about JR itself, any plan for re-evaluation was gone.\n\nI now know that I might have been off about the general consensus about JR and more people than I thought like it, and thats good enough for me.",
                                    "score": -6,
                                    "author": "Silvere01",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think you're just better off accepting that you won't always like things that other people do, *and that's okay.*\n\nLike, sometimes people will make a drink for me or suggest I try a beer I haven't had before. Sometimes I like them. Sometimes I don't. If I don't, I don't spend a lot of time interrogating people \"do people really like this? It's so X. Do people just like the concept of this and pretend to like it?\" I just move on and order a drink I like more. \n\nYou can find TONS of reviews that will tell you exactly what people like about *anything*. Asking \"do people *really* like this, or do they just tolerate it?\" just comes across as kind of condescending. It doesn't really come across as a sincere question.",
                                            "score": 11,
                                            "author": "Samael13",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; I think you're just better off accepting that you won't always like things that other people do, and that's okay.\n\nSure, but at the same time I surely am allowed to allow myself to take the chance to broaden my worldview and maybe retake a look at something, before deciding to set that opinion into stone? This was my attempt to open the lock and take that plunge. Didn't succeed, but well.\n\n&gt; Asking \"do people really like this, or do they just tolerate it?\" just comes across as kind of condescending. It doesn't really come across as a sincere question.\n\nI can only apologize for that. As I said, I thought it was general consensus that JRs writing is considered middling at best. I didn't think it was a far stretch that some people love her world building (or other strengths the book has), and not the writing itself.",
                                                    "score": -5,
                                                    "author": "Silvere01",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Of course you're allowed to broaden your worldview. \"Do people *actually like this*\" isn't doing that. \"What are people's favorite part of JKR's writing style?\" is how you do that. Reading reviews about the book is how you do that. Rereading the books with a new eye is how you do that. \n\n\"I'm confused; I hate this thing that so many people like, and I just don't get what people get out of it. Are they just tolerating it?\" just comes across as a way of shitting on something other people like rather than a serious attempt to interrogate your own tastes.",
                                                            "score": 17,
                                                            "author": "Samael13",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt; \"Do people actually like this\" isn't doing that. \"What are people's favorite part of JKR's writing style?\" is how you do that.\n\nYou know what, I can actually see it, thinking it over. I still think its not worded too badly, but I can understand if people feel aggravated by it.\n\nThere definitely was no ill intent behind it.",
                                                                    "score": 8,
                                                                    "author": "Silvere01"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I honestly really liked the writing, it was amazing and I fell in love with the first book immediately as a a child.",
            "score": 23,
            "author": "Peppermint_Teacakes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Huh, interesting! /closethread\n\nWere there ever any parts where you felt like it actively could have been written better, or were put off by some passages? Or was it smooth sailing from start to end?",
                    "score": -8,
                    "author": "Silvere01",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think it was pretty smooth sailing however I was put off originally by how the scenes with the Dursleys were written as I really just wanted to get into the magic bit as a child and reading about the muggle world was and practically torture to little me, and the final battle at the end, there was so much going on that I had to read it over a couple times but now that I've reread the books a couple times I enjoy it all a lot and I enjoy the writing style of JK Rowling.",
                            "score": 8,
                            "author": "Peppermint_Teacakes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Alright, thanks for the answer!\n\nSeems like a definitive me problem with all the answers!",
                                    "score": 0,
                                    "author": "Silvere01"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I don't think people are drawn to Harry Potter because of the gorgeous prose - we're talking about JK Rowling, not Toni Morrison. I think they enjoy the books because the world and the characters are engaging and the storytelling draws you in. \n\n&gt; I know this ain't GRRM levels\n\nIt's funny that you mention GRRM because I think of both him and JKR as authors whose prose is just ok and whose books live on the strength of their world, their storytelling and their characters. If anything, I think GRRM's writing is worse than JK Rowling's, because there were definitely times when the bad prose (or the endless damn lists of foods) pulled me out of the story, and I never experienced that with Harry Potter. But this is just further proof that something like 'is this good writing', even though there may be some broad agreements (Pulitzer shit &gt; YA) can be highly subjective.",
            "score": 21,
            "author": "hairnetqueen",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, by now it mostly seems I had a wrong preconceived notion about general agreed opinion on the quality of her writing, and let my bad experience with it influence that further.",
                    "score": 3,
                    "author": "Silvere01",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think the quality is just fine - it works for what it needs to do, which is create an interesting world and tell a good story. It's just not like, on some kind of pulitzer level, because that's not what she's trying to do. If JK Rowling was out here writing like Donna Tartt, it would actually make the story less enjoyable and less accessible. \n\nThe fact that you seem to think GRRM writes on a much higher level than JK Rowling, even though I'd say in both cases their prose is fairly workmanlike, makes me think that in your mind 'bad writer' = writer whose work does not personally appeal to me.",
                            "score": 5,
                            "author": "hairnetqueen"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Very much this. The writing in Harry Potter is... fine. It's not unique or special, not especially \"good\" or not especially bad. Like most books, it's the story and characters that draw people in, not the prose itself.",
                    "score": 1,
                    "author": "ShrubbyFire1729"
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a 12 year old I didn’t even know ‘writing style’ was even a thing. As an adult, I don’t care. Why are you still stuck on a book series that you don’t like some what, 20+ years old? Just let people live.",
            "score": 8,
            "author": "FirstOfRose"
        },
        {
            "level": 0,
            "comment": "The writing style is actually VERY well liked and at the time it came out, it was said to be engaging whole swathes of children who would not normally read books.",
            "score": 20,
            "author": "Sophie_Blitz_123"
        },
        {
            "level": 0,
            "comment": "It wouldn't have the success it has if it was merely 'tolerated'. \n\nSo yes, people like Rowling's writing and it just doesn't click with you.",
            "score": 42,
            "author": "MishimaRabbit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, its a supposedly engaging mystery story with strong characters.\n\nSome games can find success even when their gameplay sucks, but other factors work out; I dont think the question is that far fetched.",
                    "score": -20,
                    "author": "Silvere01"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's fine, good. Something so universally well-liked is generally not going to have such a core component of it be \"tolerated\". It might not have an elegant and slowly deliberate style that the writing style is shining above other parts, but it's more than tolerable in its own.\n\nIf you don't like it, you don't like it, that's fine. But it seems you're not trying to open back into the idea of liking it or even trying to understand, but just looking for affirmation that \"it sucks\" and you want to continue to believe \"it sucks\".",
            "score": 7,
            "author": "Officer_Warr"
        },
        {
            "level": 0,
            "comment": "I can be critical of HP. There are some things in the series that don’t make sense in my opinion. But overall I really love the world and story. And I do think the writing is good. Is it the best ever? No. But I think it’s absolutely on the better end when compared to some other Middle grade/YA books. Despite her flaws JK is a really talented author in my opinion.",
            "score": 16,
            "author": "casualroadtrip"
        },
        {
            "level": 0,
            "comment": "It's both well-written and accessibly written, which helps explain why it's so widely beloved. It just doesn't work for you, for whatever reason.",
            "score": 13,
            "author": "zumera"
        },
        {
            "level": 0,
            "comment": "When I was young reading HP, I didn’t really take the prose into account. (Series of unfortunate events was my first realization of a writers voice). JKs voice is pretty generic for youth fiction so I don’t know why it would rub you the wrong way. Especially as a child.",
            "score": 12,
            "author": "Tellenit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Tbf, isn't writing and prose sometimes often like cinematography in that it can often contribute to your enjoyment without you ever really noticing? Even if the Harry Potter books aren't particularly unique or groundbreaking in how they were written, they were easy to follow (something especially important with fantasy fiction) and engaging for the majority of an audience throughout.",
                    "score": 8,
                    "author": "HoneyedLining",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To expand on that analogy if the cinematography in a movie is noticeably bad it can distract you from from an otherwise good film.",
                            "score": 0,
                            "author": "Hellblazer1138"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not OP but you've just described exactly why it rubbed me the wrong way. I was a big reader as a kid, so the way everyone was praising this incredibly generic book as being great bothered me. It just wasn't anything special.",
                    "score": -1,
                    "author": "Act0108",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "While her writing style wasn’t anything special, the world she created was!",
                            "score": 3,
                            "author": "Tellenit"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, I cant exactly you why either. I just found zero engagement and was utterly bored by it and couldnt disconnect from the character dialogues I found unrealistic and whatnot. On my very first read I couldnt even got through the prologue!\n\nI definitely didnt have a great understanding back then (and probably even now)  either; In this case it just didnt want to click, regardless of how much I tried.",
                    "score": -4,
                    "author": "Silvere01",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe it actually has more to do with the overall scenario of having already seen the movie and knowing the story and finding reading the book slow compared to the faster paced movie, more than it has to do with the specific writing style.",
                            "score": 10,
                            "author": "tuctrohs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nah, I was already put off before the movie. I only gave it another chance because of the movie - A bit farther because I was interested in all the parts not shown, but alas I just couldnt get far.",
                                    "score": 0,
                                    "author": "Silvere01"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was in college before Harry Potter became a sensation so I read books 1-3 at that time and then 4-7 as they came out. I enjoyed them very much. I read a lot, and always have, and thought it was a great world with lovable and hateable characters and a fun storyline. I never get all critique-y about books I read, I mostly read simply because I enjoy it. I think that when a book is utterly intolerable for us it has a lot to do with the writing just being incompatible with what we prefer to read, it doesn't always mean it's written terribly. There are some books I hate with every fiber of my being. I only read a few chapters of them, and even years later thinking of them makes me react viscerally, too. Largely because I feel my time was wasted on such tripe. But other people love the books because many of them were long-lasting best sellers. Just a difference in what we like and why.",
            "score": 9,
            "author": "KimBrrr1975",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, it might be that Im calling the writing bad only because Im incompatible with it.\n\nWith it being a Child-YA series, and the general perceived opinion on how \"the writing gets better\", I might simply have had the wrong impression about how people feel about JRs writing in general.",
                    "score": -1,
                    "author": "Silvere01"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think JKR is a fantastic writer. She created a world and characters beloved by millions. And while the HP books are YA, the prose is quite good. My daughter is challenged more by the writing/vocabulary in these books than most she reads. I also enjoy the writing and find it to be quite good--as well as a welcome break from my relentless pursuit to finish everything by Dickens and Joyce.",
            "score": 3,
            "author": "filmguerilla"
        },
        {
            "level": 0,
            "comment": "It's beautiful writing. I know it's chic to attack the author but separate the work from the artist.\n\nIt's amazingly well done from start to finish, and I still find something new after countless rereads.",
            "score": 18,
            "author": "PotterAndPitties",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;I know it's chic to attack the author but separate the work from the artist.\n\nDont put things in my mouth, thank you.",
                    "score": 2,
                    "author": "Silvere01",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The post is borderline absurd. The writing is beautiful and is still enjoyed by millions every day. The books are classics. You just bash it with no examples.\n\nMaybe it's just not your thing, and that's fine. But bashing writing loved by so many just seems like it has an ulterior motive.",
                            "score": 16,
                            "author": "PotterAndPitties",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Agree to disagree. I dont need specific examples when I dont jive with anything from it; As a child to YA book you wouldnt expect great writing quality anyways.\n\n&gt;But bashing writing loved by so many\n\nIm not bashing it, Im literally asking and wondering if people actually like the writing itself, or tolerated it when other parts shone brightly, like the created world.",
                                    "score": 2,
                                    "author": "Silvere01",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You read a handful of pages.\n\nWe wouldn't still be so enamored with the books if they weren't well written.  There are brilliant passages in every book, and the last few chapters of Deathly Hallows has some of the best writing I've ever been fortunate enough to read.\n\nThe writing is layered and fascinating. The storytelling is engaging and the characters come to life. She doesn't bash us over the head with detail like Tolkien might, but makes us care deeply about the characters and the world they inhabit.\n\nI feel sorry for anyone unable to enjoy it, they are books accessible and that carry universal messages that all can relate to and learn from.",
                                            "score": 10,
                                            "author": "PotterAndPitties",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;You read a handful of pages.\n\nYeah, and they freaking sucked for me. Also, I read more after the movie, but still couldnt get into it. Its not like I didnt try.\n\nI consumed Stephen Kings \"on writing\" in a single day because I was captivated instantly, and thats not even some story to lose yourself in. I couldnt get ASOIAF out of my hands and were enthralled throughout. I loved Malazan, even where the first book is considered as the worst and most boring.\n\nI'll happily admit that I have no clue how the last 2 books were, as I am unable to tell which book quotes are from what book the later they get, but yeah, I cant work with anything from that.\n\nNow take a chill pill and dont feel personally attacked by the mere thought of mine, that people might prefer the magical world and mystery over the writing style.",
                                                    "score": -2,
                                                    "author": "Silvere01",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;Yeah, and they freaking sucked for me.\n\nDeep literary analysis.\n\nLook in the mirror. You tell me to take a chill pill while you have taken shots at everyone in your replies with a condescending attitude and snide remarks. \n\nYou don't enjoy it. Fine. Stop insinuating that those of us who do are somehow not adults or literate.",
                                                            "score": 16,
                                                            "author": "PotterAndPitties",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt;Deep literary analysis.\n\nSaying how a story is layered is no deep analysis, either. \n\nI have taken no shots at everyone, Im understanding and even putting the fault onto me in most answers.\n\nIm only hating on you because you clearly are feeling attacked and cant handle this - And Im not faulting you for that, with Potter being literally in your name. But yeah, get over yourself.\n\nI wont engage with you anymore.",
                                                                    "score": -7,
                                                                    "author": "Silvere01",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Lol can dish it, can't take it.\n\nGot it.",
                                                                            "score": 11,
                                                                            "author": "PotterAndPitties",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "You're the person that comes off as hostile and condescending in this thread.\n\n208k karma in a year - including plenty accumulated on HP subs - indicates he was right to disengage. You spend all your time arguing with people, and there's no reasonable discussion to be had with the terminally online.",
                                                                                    "score": 1,
                                                                                    "author": "NeuralRust"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I mean if you’re going to bring up George RR Martin, we could discuss how his writing meanders, his over-the-top descriptions, his inability to finish a story. So yeah, it’s all subjective. So it’s a little bizarre that you would come in here and be all “do people really like the writing of one of the bestselling series of all time? I’m just asking the question.”",
                                                            "score": 15,
                                                            "author": "minneapple79",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "This. I don't go around to things I don't enjoy and question as to why others enjoy it.",
                                                                    "score": 13,
                                                                    "author": "PotterAndPitties"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I really did not think that it even stands to question if GRRM has a better writing style than JR.\n\nEspecially when one of many arguments for the series down the line is, how JRs writing improves with it. That part alone insinuates that it is not exactly incredible.\n\nSo yeah, I am operating on a line where JR writing style is not perfect and I feel others are better, with the assumption that others acknowledge that JR dossnt have perfect writing - WHICH IS OKAY.\n\nWhere am I off here? Do people consider JR to be a better writer than GRRM? Am I that off base?",
                                                                    "score": -2,
                                                                    "author": "Silvere01",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You are surprised an author's writing improves from their first book on? \n\nThe first book is also relatively simple because Harry is 11. The story is from his perspective. The books grow along with Harry, a fact that makes me appreciate the writing of the first book even more. \n\nPersonally not a fan of GRRM's writing, though I appreciate his storytelling. I read several of the ASOIAF novels but lost interest in later books as it just didn't seem to be going anywhere. But that's me, I don't go into the GoT boards asking why others enjoy it. \n\nIf you are looking for perfection, then perhaps human writers aren't the choice. There is a reason there are so many writers and so many genres, different voices appeal to different people.",
                                                                            "score": 9,
                                                                            "author": "PotterAndPitties"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The two are fundamentally different writing styles and you can't say one is \"better\" than the other. Harry Potter is written for children. A Song of Ice and Fire is assuredly not. \n\nNobody said JKR has perfect writing. Nobody even said the prose in HP is great. She's not Toni Morrison but she's not supposed to be. Her writing is engaging and easy for a wide range of ages. \n\nWhere are you off? By coming here with a condescending tone and then being all, \"I'm just asking the question.\"",
                                                                            "score": 5,
                                                                            "author": "minneapple79",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[removed]",
                                                                                    "score": -2,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "All that sounds like is that you're into horror/grimdark, it says nothing about the quality of the writing (none of those are good writers).",
                                                            "score": 8,
                                                            "author": "Amphy64",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt; All that sounds like is that you're into horror/grimdark,\n\nMy post says that I read Eragon. That's neither horror, nor grimdark. Neither would I put Malazan into grimdark territory; I find it more to be Epic Fantasy akin to Tolkien. Nevertheless;\n\n&gt; (none of those are good writers).\n\nFirstly I alluded to that they are better writers, not \"good\". I'm also thinking you gotta be taking crazy pills when you say that Stephen King is not a good writer. But I'm not going into a discussion for that, because my literacy knowledge is nowhere near any point where I could comfortable argue for that. Edit: Though I admit he definitely got some issues.",
                                                                    "score": -2,
                                                                    "author": "Silvere01",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "He's a popular writer (which is exactly what he wants to be), and good at what he does, I suppose.\n\nI definitely wouldn't argue that Harry Potter is great literature, or even that the writing isn't plain bad in sections of the final book (it's the last book that gets the most criticism). But in any case, seems that you simply didn't like it.\n\nI wonder if there was maybe a cultural divide? I was given a copy of the first book for my tenth birthday (also started to be given more adult classics to read shortly after, like Jane Eyre). For me, being British, the opening descriptions of the Dursleys were instantly funny and thus engaging, but that typical British/English preoccupation with class is a significant enough aspect that I'm surprised HP did catch on so much internationally.",
                                                                            "score": 8,
                                                                            "author": "Amphy64",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "&gt; But in any case, seems that you simply didn't like it.\n\nYeah, with all the other comments, that mostly seems to be the case.\n\n&gt; I wonder if there was maybe a cultural divide?\n\nMaybe! I honestly couldn't tell, I wouldn't be aware of that as a kid when I disliked it as much as I did. The only thing I can definitely say is that I still can't get behind the dialogue that is quoted when I take a glimpse of it - The easiest explanation would be that I'm no teenager anymore and can't connect to the characters as much, but that's an idiotic take when other authors are able to have me do a suspension of disbelief. And I'm non well-read enough to even attempt to put out any strong argument for literally introspection.",
                                                                                    "score": 2,
                                                                                    "author": "Silvere01"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I certainly like it. Whether you like it or not is your own business.",
            "score": 7,
            "author": "farseer4"
        },
        {
            "level": 0,
            "comment": "Yes, the writing evolves and reflects the evolution of the characters and their ages. Rowling is very good at painting a picture with describing a couple of gestures and making readers feel like they know exactly the characters and types of people she means. She also has good insight with children’s and teenagers’ way of thinking. While at the same time including details for her grownup readers (to the tune of gut-wrenching moments for parents, for instance). \n\nI only know a couple of kids who weren’t HOOKED from the beginning. Neither read for pleasure before or after, in general. I do know kids whose parents had to insist a lot to make them read and it was always a chore, until they got to read HP. Avid readers enjoy the first couple of books from around 8 years of age. So-so readers from 10-11. \n\nWere you too young when you tried book 1? Or perhaps you didn’t have the required level of reading comprehension? The story and writing are more complex than the Geronimo Stilton or the Wimpy Kid series, for instance. \n\nI am also a bit surprised that you loved the movies and the world and didn’t persist with the reading (but I’m only saying this judging from my own experience. I usually down all the books in a series a enjoy… and wish more reading were available).",
            "score": 5,
            "author": "bofh000"
        },
        {
            "level": 0,
            "comment": "I was 11 when the first book came out, and I instantly fell in love. I loved the writing, the world she created. I grew up with the books, and the writing got better and better. More in depth. I love the movies too, and I think they're brilliant. Of course though as is with all books turned to movies, there's a lot more to the world than the movies can cover.",
            "score": 2,
            "author": "Chickady07"
        },
        {
            "level": 0,
            "comment": "It’s a masterclass in world building",
            "score": 6,
            "author": "HeySlimIJustDrankA5",
            "replies": [
                {
                    "level": 1,
                    "comment": "The world she created is great, yeah!",
                    "score": 0,
                    "author": "Silvere01"
                }
            ]
        },
        {
            "level": 0,
            "comment": "One thing to consider: it was an international success, and atleast the German translation is done very well.",
            "score": 3,
            "author": "Vlad__the__Inhaler"
        },
        {
            "level": 0,
            "comment": "JK Rowling isn't the best children's author of all time, but her writing style can be humorous and whimsical. Have you tried listening to the audiobook? Some books are more enjoyable when they're read aloud, especially when there's a lot of wordplay.",
            "score": 4,
            "author": "vivahermione",
            "replies": [
                {
                    "level": 1,
                    "comment": "Jim Dale is riveting reading these books!",
                    "score": 3,
                    "author": "EllenSoGenerous"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I understand where you are coming from OP. I might have a higher tolerance for mediocre/bad prose though; I've read Terry Goodkind.\n\nI think the first book is alright and they get better for the first few but after a while the books became a bit bloated.\n\nMy enjoyment of the the HP books dropped significantly when Order of the Phoenix was released; that's when I feel that the writing stopped working for me.\n\nI did finish the series as they released but it took some effort. Deathly Hallows was such a chore for me to read.",
            "score": 1,
            "author": "Hellblazer1138"
        },
        {
            "level": 0,
            "comment": "I'm sure I'll get downvoted to hell, but you're not alone OP. I am what most would consider a pretty avid reader, and I read a lot of genres, including YA. But, I couldn't get through HP. The friend group I had at the time was *very* into the series (in line at midnight for book releases and that sort of thing), so I pushed myself to read up through the third book because the fourth was about to be released and they were all excited. I never actually finished the third book. The writing felt subpar, even by YA standards, and I could not connect at all with any of the characters. I didn't feel the world building was all that impressive either. So, yeah, it just doesn't click for some people. 🤷",
            "score": -1,
            "author": "Sherringford-Mouse",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you - I at least dont feel as alone with my take here.\n\nI really didnt think I was that off base with my assumption of it being considered not great at the very least, with people repeatedly criticizing parts of the story and mentioning her improved writing in later books.\n\nBut the karma bleed for a genuine question is real, hahaha.",
                    "score": 3,
                    "author": "Silvere01"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I completely agree with you - the writing is mediocre at best. I think what sold it was the world. I had trouble with the first book, too - I found the pacing dreadfully slow.",
            "score": 0,
            "author": "Act0108"
        },
        {
            "level": 0,
            "comment": "haber como estara la seria remake",
            "score": 1,
            "author": "RCFORCEX"
        },
        {
            "level": 0,
            "comment": "Her writing is pedestrian at best. On par with books like romance novels and cheap adventure paperbacks. She put words to the page, she avoids grammatical mistakes, she repeats words and phrases occasionally but sometimes in the same chapter or on the same page, sometimes character movements don’t make sense based on environment as she described it or based on the characters previous movements, some plot threads don’t make sense logically or logistically.",
            "score": -4,
            "author": "Anonamitymouses"
        },
        {
            "level": 0,
            "comment": "Not sure why you're being down-voted to oblivion. HP's writing is pretty much something that I can only engage on in like a YA level... and even then... YA content is good when there's some kinda underlying theme or message or something deeper. Joanne just kinda writes... which a lot of people need and want and adore. \n\nI found the movies a lot more palatable. The actors and directors find a lot of meaning in situations and lines that isn't really there in the book, which kinda gives it another layer and makes it work... when it works.",
            "score": -7,
            "author": "HomoVulgaris"
        },
        {
            "level": 0,
            "comment": "I'm actually glad to hear it wasn't just me!! I was a reader (granted I was into Stephen king by 12 so that might have been why going \"backwards\" was hard) Honestly those books had people in my family who weren't readers absolutely HOOKED (great they were reading at least) I mean they would all reread each book and I tried so hard to get through the first pages and just thought is it me? I tried again over the years and I agree with you the book just never read right to me🤷‍♀️",
            "score": -3,
            "author": "songofpennywise"
        },
        {
            "level": 0,
            "comment": "The writing is not very good; it’s young adult fiction, after all, not literature. People love the concept and the world and the characters",
            "score": -8,
            "author": "TheWhiteUsher",
            "replies": [
                {
                    "level": 1,
                    "comment": "Leaving Harry Potter aside for a minute, I don't agree that YA books are intrinsically bad just  because they're written for teens. If that were true, you wouldn't see teens maturing into avid adult readers. They want and deserve well-written books for their age group to keep them hooked on reading. The Giver is one example.",
                    "score": 8,
                    "author": "vivahermione"
                },
                {
                    "level": 1,
                    "comment": "It's 100% literature. Are you are arguing that books aimed at younger audiences can't be literature?",
                    "score": 9,
                    "author": "PotterAndPitties",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It certainly can be, but in the case of Harry Potter, it's by no means as clearly accepted as that, and is a bit early, anyway. Some universities are studying it, but that was bound to be the case given the significance. I think it will be regarded as a classic but not literature.",
                            "score": -7,
                            "author": "Amphy64",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "By what standard? What do you define as literature, exactly?",
                                    "score": 7,
                                    "author": "PotterAndPitties",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "By the standard of academic consensus. Work of outstanding literary value, at least in certain areas.",
                                            "score": -10,
                                            "author": "Amphy64",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Are we gatekeeping now…? Really…?",
                                                    "score": 6,
                                                    "author": "Longjumping_Bid_2651",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "How so? This is genuinely a question that is discussed by academics - there's a book of analysis called 'Terry Pratchett: Guilty of Literature', since Pratchett had denied writing any!",
                                                            "score": -2,
                                                            "author": "Amphy64"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm not a fan of bashing YA and its writing as a whole, even though I understand that you cant except the greatest writing from it.\n\nBut we have some, supposedly adults, here, who liked the writing, so Im just going with how Im the odd one out.",
                    "score": 0,
                    "author": "Silvere01"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was 11 when the book came out. I had read nothing like it before. The horror of the Dursleys, the intensity of magical coincidences, the discovery of magic at the castle—I was totally hooked.\n\nAs, um, an 11 year old, the intended audience, I wasn’t highlighting passages or lingering on prose. I think it was the pacing and character-driven narrative and the constant introduction of small twists. \n\nThen again, the movies didn’t exist so I didn’t have any confusion there.",
            "score": 1,
            "author": "EllenSoGenerous"
        },
        {
            "level": 0,
            "comment": "I read Harry Potter for the first time as an adult since my mom wouldnt allow me to read them. The books were easy to read, we're captivating, and were a page turner. I read the series back to back and couldn't wait to see what happens next. This feeling is rare for me as an adult even with books that would be seen as objectively better. Bring able to write page turners is a skill of its own.",
            "score": 1,
            "author": "Purplegalaxxy"
        },
        {
            "level": 0,
            "comment": "I can only comment on the Japanese editions because I'm reading them in Japanese as part of my language study. \n\nThey're not horrible, but I wouldn't label them timeless masterpieces either. Competent.",
            "score": 0,
            "author": "Comfortable_Study_11"
        }
    ]
}