{
    "id": "142zkdp",
    "score": 145,
    "title": "What's the most you've ever been creeped out?",
    "author": "xenoscumyomom",
    "date": 1686101511.0,
    "url": "https://www.reddit.com/r/books/comments/142zkdp",
    "media_urls": [],
    "other_urls": [],
    "postText": "What's the book/scene that's gotten under your skin the most and left you with the heebie-jeebies?\n\nMine is Annihilation by Jeff Vandermeer. The scene years later that still comes to mind is when she goes down into \"the tower\" and the walls have writing on it that's alive and the deeper she goes the creepier it gets, until she makes it to the bottom where the light keeper is. That book had so many scenes that weren't jump scary but just got under my skin and creeped me out and took awhile to leave me. I had trouble sleeping after reading each night. Also I was on holiday when I read part of it and in the middle of the night there was an earth quake and I've never felt one before and I straight freaked out because I was already so creeped out from the book and then come out of a full sleep to the world shaking I panicked.\n\nWhat's yours?\n\nEdit: Thank you everyone for all the great rec's and stories! I really appreciate it. I can't wait to have the time to go through all the comments and upvote and add to my ever growing tbr list.",
    "comments": [
        {
            "level": 0,
            "comment": "Blindness by Jose Saramago. The entire book. SO MANY heebie-jeebies. Scariest apocalypse book I’ve ever read, and I’ve read a lot of them!",
            "score": 30,
            "author": "MidwestHiker317",
            "replies": [
                {
                    "level": 1,
                    "comment": "Added to the list. Heebie-jeebies here I come.",
                    "score": 7,
                    "author": "xenoscumyomom"
                },
                {
                    "level": 1,
                    "comment": "Reading this now, kind of stuck at page 244 having a little trouble with the narrative style. I will finish and i agree it is a grim story just a bit hard to get through for me",
                    "score": 2,
                    "author": "DpvReno"
                },
                {
                    "level": 1,
                    "comment": "I've only read one Saramago book and I really really need to read this one already, I've heard so much about it!",
                    "score": 2,
                    "author": "yellowyellow2"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Definitely The Last House On Needless Street by Catriona Ward\n\nIt's an incredibly good book, and one of the few \"you'll never guess the ending\" thrillers I've read where I actually for real did not guess the ending. The crewpi g unease and dread are intense, and the content it deals with is extreme disturbing, especially in opposition to the initial premise. I really can't say much without potential spoilers, but for an actual skin-crawling but still thoroughly Artsy (?) And emotionally satisfying read I can't recommend it enough.",
            "score": 28,
            "author": "taraxac13",
            "replies": [
                {
                    "level": 1,
                    "comment": "The garage scene in The Only Good Indians by Stephen Graham Jones also messed me up. The outsider-looking-on-in-unnreality-disbelief-and-anxiety is strong",
                    "score": 16,
                    "author": "taraxac13",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah this was at the front of my mind too. I honestly did not know horror books could be that horrible, there are a dozen scenes I can recall very strongly from it, I don't want to spoil it for anyone else reading this but you kind of never get to feel calm. I had to put the book down and ask my partner for a hug every so often. I can't recommend it highly enough to anyone wanting to read horror that will truly get under the skin and stay there.",
                            "score": 7,
                            "author": "Sad_Meringue_4550",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I have no partner and I live in a small cabin by myself. I might be in for a rough ride.",
                                    "score": 4,
                                    "author": "xenoscumyomom",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes you might have a bit of A Time. I agree with taraxac13 that it's violent, the gore is visceral and purposeful. \n\nI do want to caution folks (you or others who decide to pick up the book based on these recommendations) and I want to try to do it without spoiling anything; if you're the kind of person who ought to look up specific trigger warnings before consuming media, this is one to look up those triggers ahead of time.",
                                            "score": 5,
                                            "author": "Sad_Meringue_4550"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Stephan Graham Jones is hands down one of my favorite horror writers ever. If gore bothers you, you might struggle with his work, but it's very worth it. He deploys violence in a similar way to Guillermo del Toro - no punches pulled but it very much serves a purpose",
                                            "score": 4,
                                            "author": "taraxac13"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Oof yes. Totally fucked up.",
                            "score": 2,
                            "author": "wheeeeeeeeeetf"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I just looked it up and combined with what you wrote it's on my tbr list now. Sounds great. Thanks! I don't know how authors pull off that creepy unease where there's really nothing that I can put my finger on but my hair is standing on end nonetheless that I love.",
                    "score": 3,
                    "author": "xenoscumyomom"
                },
                {
                    "level": 1,
                    "comment": "I listened to this in the car on a vacation, and the different voices for the characters were very effective!",
                    "score": 3,
                    "author": "MidwestHiker317",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The voices, even just on the page, are so unique and distinct and compelling I was blown away",
                            "score": 2,
                            "author": "taraxac13"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "i got baked and sent an entire fan email to catriona ward for needless street 🫠 it's the one book i recommend to absolutely anyone and everyone. i read it in february last year for the first time and i think about it at LEAST once a week, most of the time once a day. true art 🫶",
                    "score": 2,
                    "author": "miatheherbi"
                },
                {
                    "level": 1,
                    "comment": "She’s FANTASTIC at creating this creepy brew of sinister “other-ness” in her books. I’ve read Sundial and Little Eve by her and each one was phenomenal. Sundial especially, I was so uneasy and really felt a lot for those characters.",
                    "score": 2,
                    "author": "covensoffering"
                },
                {
                    "level": 1,
                    "comment": "I have added this to my library holds!",
                    "score": 1,
                    "author": "Illustrious-Many70"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The soldier skinning scene in Murakami's _Wind-up Bird Chronicle_. I've wanted to re-read the book, but I know that scene's in there and keep putting it off.",
            "score": 26,
            "author": "richtl",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was about to comment this! That scene traumatised me for days. I also really want to re-read the book but am put off because of it!",
                    "score": 1,
                    "author": "PangolinAggressive40",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think the scene was appropriate to the story. It was just, well...",
                            "score": 2,
                            "author": "richtl"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "“The Road” by Cormac McCarthy, when the father and son are desperately hungry and poking around an apparently empty house looking for food. They find a hidden door and go down into this cellar/basement and the father just has the lighter held out in front of him and they realize it’s a dungeon full of people being kept alive for purposes of cannibalism (one of the victims is missing both legs). The father obviously freaks out and they manage to climb out of the cellar and when they look out one of the windows they see a group of people (the apparent cannibals) approaching the house. Gives me goosebumps anytime I think about it.",
            "score": 23,
            "author": "WyomingWinters",
            "replies": [
                {
                    "level": 1,
                    "comment": "Came here to say this scene. Ooft.",
                    "score": 4,
                    "author": "somereasonableadvice"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A scene where a character tortures and kills a cat in one of the books by Yukio Mishima.",
            "score": 16,
            "author": "MsStormyTrump",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Sailor Who Fell From Grace With the Sea. That  scene was extremely disturbing.",
                    "score": 10,
                    "author": "BelaFarinRod"
                },
                {
                    "level": 1,
                    "comment": "I just read up on him and he committed seppuku!? It's not surprising he was able to go to some intense places in his writing.",
                    "score": 5,
                    "author": "xenoscumyomom",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh, he was a character alright!",
                            "score": 9,
                            "author": "MsStormyTrump",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "A fascist *and* incredibly gay!",
                                    "score": 3,
                                    "author": "dwilsons"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Check out his short story “Pariotism”",
                            "score": 3,
                            "author": "capricioustrilium"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah, this scene was fucked up. It made me consider dropping the book, which I rarely do.",
                    "score": 2,
                    "author": "Nenechihusband"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had to read The Hot Zone in 30 page increments.  Based on historical events which makes it all the scarier.",
            "score": 14,
            "author": "Synthwoven",
            "replies": [
                {
                    "level": 1,
                    "comment": "This book made me wash my hands after touching everything!  And people coughing made me jump out of my skin.   I read this when it came out in 1994, and I still think about it....",
                    "score": 3,
                    "author": "daisy-girl-fall"
                },
                {
                    "level": 1,
                    "comment": "Sounds creepy. I watched the movie hostel while I was traveling and staying in hostels. I missed the boat by not reading this during the early days of covid. It's on my list now though. I'll wait until I have a cold or something.",
                    "score": 2,
                    "author": "xenoscumyomom",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I read it well before COVID.   I don't think I could have read it at the start of the pandemic.   I still sort of want to watch the movie Contagion, but I am scared of it too.",
                            "score": 2,
                            "author": "Synthwoven"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Scared the 💩out of me as well.",
                    "score": 2,
                    "author": "cinderellie1"
                },
                {
                    "level": 1,
                    "comment": "This book was fantastic, read it during lockdown so it had an extra kick so to say.",
                    "score": 2,
                    "author": "Beforeibegan"
                },
                {
                    "level": 1,
                    "comment": "The Hot Zone is sooooo good!!!",
                    "score": 2,
                    "author": "witchy_moongoddess"
                },
                {
                    "level": 1,
                    "comment": "Yes! During the height of covid I couldn’t help but think back on this book and how we’d all be screwed if it was Ebola or as contagious as Ebola",
                    "score": 1,
                    "author": "Sharkysnarky23",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Covid is more contagious than Ebola, but less deadly.",
                            "score": 1,
                            "author": "Synthwoven"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Neal Shusterman’s “Unwound” the scene where you experience unwinding from the victims point of view. I don’t do horror, so maybe I’m a lightweight but it was psychologically terrifying.",
            "score": 15,
            "author": "lissawaxlerarts",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes. That book was so interesting how it approached so many different issues.  That’s such a messed up thing. To have life and be able to live a lot of it and gave your parents unmake you Id you don’t turn out how they want.",
                    "score": 3,
                    "author": "Herbscrystalsandcats"
                },
                {
                    "level": 1,
                    "comment": "I remember flipping through that in a bookstore while shopping for my kids. I found that scene and couldn't put the book back fast enough. I was horrified that it's meant for teens and young adults. It's so disturbing.",
                    "score": 1,
                    "author": "Kindly_Coconut_1469",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 1,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No plain text spoilers allowed. Please use the format below and reply to this comment once you've made the edit, to have your comment reinstated.\n\nPlace &gt;! !&lt; around the text you wish to hide. You will need to do this for each new paragraph. Like this:\n\n    &gt;!The Wolf ate Grandma!&lt;\n\nClick to reveal spoiler.\n\n&gt;!The Wolf ate Grandma!&lt;",
                                    "score": 2,
                                    "author": "CrazyCatLady108"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The scene where the kid runs after their ball into the blind spot in the road. Pet Semetary",
            "score": 15,
            "author": "areibim",
            "replies": [
                {
                    "level": 1,
                    "comment": "Pet Semetary was the first Stephen King book and first horror novel that I couldn't finish just because I got too creeped out.\n\nTo be fair, this was about 35 years ago, as a teenager, when I just started reading horror and Stephen King. Since then, I haven't finished some of his, let's say, later and denser work just because the style and quality changed over the decades as well as my own reading tastes.\n\nThe only reason that I haven't gone back to it is that is was a borrowed copy, either from a family member or the library, and there's just too many good new books to be read and so little time and such a small new book budget when you live somewhere without libraries that have English language books...",
                    "score": 2,
                    "author": "EmmaInFrance"
                },
                {
                    "level": 1,
                    "comment": "That part is semi-autobiographical. King wrote about it (somewhere?) With his youngest son, Owen. They were all outside having a meal or something, and Owen got away and was running towards the highway frequented by the logging trucks. Anyway, they got him just in time, but the book part allowed King to explore \"what might have been\" from a safe distance.",
                    "score": 1,
                    "author": "floridianreader"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not the most original answer, but The Shining. I read it for the first time in college and legit couldn’t sleep for two weeks. Something about those animal topiaries..",
            "score": 60,
            "author": "oknice_86",
            "replies": [
                {
                    "level": 1,
                    "comment": "I never thought I'd be afraid of a bunch of bushes, but here we are. 😅",
                    "score": 14,
                    "author": "valpal1237"
                },
                {
                    "level": 1,
                    "comment": "Those scared me too. I read it way too young. 7th grade.",
                    "score": 10,
                    "author": "TheMadIrishman327"
                },
                {
                    "level": 1,
                    "comment": "Yes I read it in high school and started to only read it during the day after the bathtub part.",
                    "score": 6,
                    "author": "Adept-Emphasis5111",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You could have tried putting the book in the freezer",
                            "score": 9,
                            "author": "adsfew"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The movie did it for me. I am a grown adult and I still get the creeps from long hotel hallways.",
                    "score": 5,
                    "author": "The_Lime_Lobster"
                },
                {
                    "level": 1,
                    "comment": "I was going to say, when Danny is in the snow on the playground oh my god I felt all the hair stand up on my neck.",
                    "score": 5,
                    "author": "zombieasuicude22"
                },
                {
                    "level": 1,
                    "comment": "I read this while working a job that saw me in a farm building, at night, completely alone. I was 21 and terrified. I quit the job after 2 days and slept with the lights on until I finished the book!",
                    "score": 5,
                    "author": "Amzuja"
                },
                {
                    "level": 1,
                    "comment": "I keep my copy in the freezer.",
                    "score": 7,
                    "author": "waveheart222",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Beth's really sick and I'm not sure she's going to make it.",
                            "score": 5,
                            "author": "KickFriedasCoffin"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's a classic for a reason. I need to definitely read more of King. I have IT sitting here and I should start on it soon.",
                    "score": 3,
                    "author": "xenoscumyomom"
                },
                {
                    "level": 1,
                    "comment": "Same. I read it when I was 12 and the topiaries were the scariest part for me.",
                    "score": 3,
                    "author": "cinderellie1"
                },
                {
                    "level": 1,
                    "comment": "I just started reading this today, wish me luck!",
                    "score": 2,
                    "author": "Chernobyl-Pondwater"
                },
                {
                    "level": 1,
                    "comment": "That was my first King book at around 12 or 13 and I was hooked after that, but yeah, it was pretty wild.",
                    "score": 2,
                    "author": "Daghain"
                },
                {
                    "level": 1,
                    "comment": "Also, the dead woman in room 237...the idea of her just on the other side of the door...😳",
                    "score": 2,
                    "author": "Antique-End4344"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I read Salem's Lot when I was around 19. I recall reading it at night mostly and one particular time while visiting my sister. \n\nShe lived in a small village in Northern Ireland. House backed onto fields, she had no curtain in the spare room, so outside was pitch black. \n\nI got to the section where the Glick brother comes to the window asking to be let in (think of the famous scene in the TV movie/series). I was BRICKING it. Never had tingles up my spine like it.....",
            "score": 28,
            "author": "fknbawbag",
            "replies": [
                {
                    "level": 1,
                    "comment": "I read Salems’ Lot ages ago and that is the only scene I remember from it.",
                    "score": 5,
                    "author": "speckledcreature"
                },
                {
                    "level": 1,
                    "comment": "Same thing happened to me with the same scene in the same book! I was home alone, really late and I heard something scratching on the window screen. I scared myself silly",
                    "score": 3,
                    "author": "Kateg8te777"
                },
                {
                    "level": 1,
                    "comment": "I just read a review where the person read it in their teens and kind of liked it, and reread it as an adult and absolutely loved it. Might be time for a reread? It's on my list now. Thanks for the rec.\n\nAlso why do so many of us read this kind of book at night? Then lay there and drift off and your imagination goes wild and reality becomes more malleable and you get even more freaked out. Gluttons for punishment we are.",
                    "score": 3,
                    "author": "xenoscumyomom"
                },
                {
                    "level": 1,
                    "comment": "Danny Glick is the reason I will NOT look out a window at night.",
                    "score": 2,
                    "author": "cinderellie1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "House of Leaves when you live alone.",
            "score": 28,
            "author": "NoPerformance5952",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wooooo damn I ll tell ya this book was an EXPERIENCE  like nothing else",
                    "score": 7,
                    "author": "Hamsterbonesdaddy89",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Same. One of my faves",
                            "score": 1,
                            "author": "NoPerformance5952"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "When Johnny tells you to not look up from the page I was like BRO",
                    "score": 6,
                    "author": "yeetmaster05",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I actually felt like something was behind me haha",
                            "score": 2,
                            "author": "KiwiTheKitty"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "100% creepy",
                    "score": 2,
                    "author": "Comfortable_Study_11"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Mine is probably The Shards by Ellis. Not only disturbing but he did an incredible job using elements of the Manson family and blending social commentary on the lavish California lifestyle to immerse the reader. Highly recommend.",
            "score": 8,
            "author": "mram_47",
            "replies": [
                {
                    "level": 1,
                    "comment": "This was one of my favorite books so far this year. So good!",
                    "score": 2,
                    "author": "oknice_86",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s such a good page turner. I love it",
                            "score": 1,
                            "author": "mram_47"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Probably one of the scenes in Pretty Girls. There was… something done with a machete that I thought I must have misunderstood due to the sheer mechanics of the act. Then, later in the book, the protagonist finds pictures of the aftermath of the… thing with the machete, and it turned out, I didn’t misunderstand at all.",
            "score": 8,
            "author": "MinxyMyrnaMinkoff",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don’t even remember the machete scene. There was so much wrong in that book",
                    "score": 3,
                    "author": "Herbscrystalsandcats"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Pretty Girls by Karin Slaughter. I listened to audiobook and I think it’s one of the most messed up things I have ever read.",
            "score": 9,
            "author": "Herbscrystalsandcats",
            "replies": [
                {
                    "level": 1,
                    "comment": "I had never read any of her books before and I read this and was pretty horrified. I read a lot of thrillers but this was disturbing in a gross and exploitative way.",
                    "score": 4,
                    "author": "blessup_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes. It was just really disgusting the layers of this book. I don’t want to give away the ending but the “bad guy” does so much messed up stuff on a physical and mental level. I was more bothered by it than a lot of the true crime I’ve read",
                            "score": 4,
                            "author": "Herbscrystalsandcats"
                        },
                        {
                            "level": 2,
                            "comment": "Agreed. By the end of the book, I had honestly wished I hadn’t read it. No desire to read her other books now",
                            "score": 4,
                            "author": "khernandez1024"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I couldn't finish it. Traumatized",
                    "score": 2,
                    "author": "EngineerLow7088"
                },
                {
                    "level": 1,
                    "comment": "I really like Karin Slaughter but I chose to skip that one after reading some of the reviews.",
                    "score": 2,
                    "author": "Kindly_Coconut_1469"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So many Stephen King short stories… I really think he is the master of these, but the final sentences of “I am the Doorway” and “The Jaunt” are the only times I can say the hair on the back of my neck literally stood up.",
            "score": 8,
            "author": "Bathysphered",
            "replies": [
                {
                    "level": 1,
                    "comment": "For me, the most hair-raising Stephen King story is \"Mrs. Todd's Shortcut.\" Having grown up traversing mysterious backcountry roads like those described, it seems all too plausible.",
                    "score": 3,
                    "author": "jellyrollo"
                },
                {
                    "level": 1,
                    "comment": "Farther than you think, Dad! Yikes",
                    "score": 2,
                    "author": "Daghain"
                },
                {
                    "level": 1,
                    "comment": "I don't know if creepy fits but The Pupil and The Library Policeman were disturbing.",
                    "score": 2,
                    "author": "Kindly_Coconut_1469",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I always said The Library Policeman would make one hell of a horror movie. I mean, they already adapted The Langoliers and Secret Window, Secret Garden from the same collection book.",
                            "score": 1,
                            "author": "IsabellaOliverfields"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Creepiness is one of the hardest literary moods to sustain IMO. Horror, gore, suffering? All very possible in novels, but for me, creepiness - that moment when the world's mask *slips* - is best at short-story length.\n\nAdmittedly, I read his stories at a formative age, and the deliberately academic tone may not appeal to everyone (the collection it comes from is called 'Ghost Stories of an Antiquary') but M.R. James' ['Whistle and I'll Come to You, My Lad'](https://gutenberg.ca/ebooks/jamesmr-ohwhistle/jamesmr-ohwhistle-00-h.html) is still the winner for me. There's no gore, since it's a pure ghost story, but the core concept is just so original and creepy that I've linked it on Gutenberg Australia for those who haven't read it. The 1968 BBC TV adaptation starring Michael Hordern is the best, and [available on Youtube](https://www.youtube.com/watch?v=B-nJTOIPEfw).\n\nClose runners-up:\n\n* The Yellow Wallpaper - Charlotte Perkins Gilman  \n* The Beckoning Fair One - Oliver Onions  \n* A Recluse - Walter de la Mare  \n('The house was not haunted, it was infested'. De la Mare is a master of creepiness)  \n* Dr. Voke and Mr. Veech - Thomas Ligotti  \n(If you want stories that make you profoundly thankful that magic doesn't actually exist, Ligotti is your man.)",
            "score": 8,
            "author": "Velinder"
        },
        {
            "level": 0,
            "comment": "A Head Full of Ghosts- I didn’t think I would like the book at first, took a sec to get into it but then…WOW. It is a story of a family falling apart (is the sister possessed or mentally ill). I love creepy books and this one stuck with me! Read it in an evening because I couldn’t put it down.",
            "score": 8,
            "author": "Illustrious-Many70"
        },
        {
            "level": 0,
            "comment": "There is a scene in Fantastic Land by Mike Bockoven that involves a young person and a forced branding gone very wrong. Straight up made me take a break from reading and reconsider how I spent the rest of my free time that day.",
            "score": 5,
            "author": "NIRPL"
        },
        {
            "level": 0,
            "comment": "Lord of the Flies as a teenager",
            "score": 7,
            "author": "North-Value9631",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same. I realize everybody and their brother has deconstructed it in various ways, but I had to read it for school when I was 14. I wished like hell I had not read it and just taken the zero.",
                    "score": 3,
                    "author": "Kayakchica"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hyperion by Dan Simmons. It's like reading the weirdest of the weird Twilight Zone episodes that all feature a spiky Terminator who likes impaling people on a tree made of spikes.",
            "score": 6,
            "author": "Scoobydewdoo",
            "replies": [
                {
                    "level": 1,
                    "comment": "And if I remember correctly, the people don't die.",
                    "score": 3,
                    "author": "Awfki"
                }
            ]
        },
        {
            "level": 0,
            "comment": "A Boy and His Dog by Harlan Ellison. I read it in college. The whole thing was disturbing and the end had me freaked out for days.",
            "score": 4,
            "author": "BelaFarinRod",
            "replies": [
                {
                    "level": 1,
                    "comment": "You got to love Harlan, such a way with words",
                    "score": 2,
                    "author": "SillyPuttyGizmo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Robert Harris' Hannibal. I read it at night, in a camp-bed in the awning of a caravan. It's fair to say I did not sleep well.",
            "score": 5,
            "author": "friendswithpenguins"
        },
        {
            "level": 0,
            "comment": "The Shining. Not the hedges, not the room, nothing tangible or imagined. It was the lengthy description of the fire hose and Dannys anticipation of it to start moving. It never did, but holy shit if that wasn’t the night I couldn’t fall asleep…",
            "score": 5,
            "author": "Lachtaube"
        },
        {
            "level": 0,
            "comment": "The Stand, tunnel scene",
            "score": 4,
            "author": "asteinberg101",
            "replies": [
                {
                    "level": 1,
                    "comment": "I live north of Denver and I have been through that tunnel many times. That makes it worse to imagine.",
                    "score": 2,
                    "author": "Daghain"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was in my parents back yard (the house i grew up in) reading IT, by Stephen King, specifically a part where he describes a weird terrifying bird, when a kind of bird i had never seen before landing in the yard. It looked...freaky. And it creeped me out big time.",
            "score": 5,
            "author": "Callasfan"
        },
        {
            "level": 0,
            "comment": "I just finished The Haunting of Hill House. \n\nIt's like watching innocence die.",
            "score": 4,
            "author": "Letholdus13131313",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was terrified when they went outside and down to the stream",
                    "score": 2,
                    "author": "Amazing-Panda-5323"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The chapter in Haunted by Chuck Palahniuk where a character gets his intestines sucked out when sitting on the inlet port the pool filter and circulation pump. It's been YEARS and I still get icked out when I think about it.",
            "score": 11,
            "author": "Naive_Possibility668",
            "replies": [
                {
                    "level": 1,
                    "comment": "Came here to say this. I think about this randomly sometimes, and way more often than I should.",
                    "score": 3,
                    "author": "motocross_25"
                },
                {
                    "level": 1,
                    "comment": "I used to watch 1000 ways to die which talks about crazy ways people have died and this was one of the deaths, so I believe this actually happened to someone!",
                    "score": 2,
                    "author": "pilapalacrafts",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh noooo!",
                            "score": 2,
                            "author": "Naive_Possibility668"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh man I was SO squicked out by that. I'm getting the creeps just thinking about it.",
                    "score": 2,
                    "author": "Daghain"
                },
                {
                    "level": 1,
                    "comment": "Ah good old Saint Gut-Free",
                    "score": 2,
                    "author": "Merryprankstress"
                },
                {
                    "level": 1,
                    "comment": "Omg yes. I need to read more of him. He does field research to find out what freaks people out the most.",
                    "score": 1,
                    "author": "xenoscumyomom"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fulgrim, the whole book is a slow decent into absolute madness. I felt so uneasy the entire time I was reading it watching the corruption slowly take hold.",
            "score": 4,
            "author": "thesolarchive",
            "replies": [
                {
                    "level": 1,
                    "comment": "I've been working my way through the Horus Heresy novels but it's hard to imagine anything topping the carnage of the performance in La Fenice. I just can't move past it .",
                    "score": 2,
                    "author": "Littleshebear",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The thing that's wild to me about these HH books, is knowing how things all end up in 40k but still being absolutely enthralled by the journey to it. I know a lot of people that won't read/watch something because they know how it'll end. But the journey there still can be incredibly entertaining. But yeah, that whole sequence is going to stick with me for a while haha.",
                            "score": 2,
                            "author": "thesolarchive",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh knowing what's coming doesn't detract from the enjoyment at all. It adds to it in a way, it's like a Greek tragedy; you desperately want things to go differently but you know they won't. It's harrowing.",
                                    "score": 1,
                                    "author": "Littleshebear"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lies of Locke Lamora. There's a torture scene involving a bag a broken glass that I have never been able to shake",
            "score": 5,
            "author": "Elephant42OR"
        },
        {
            "level": 0,
            "comment": "My biggest phobia is home invasion so one particular scene of The Shadow Over Innsmouth by H. P. Lovecraft genuinely had me sweating and had my heart racing.\n\nI also had chills reading the Ringwraith pursuit scenes in the first book of Lord of the Rings. Even (or rather especially) the scenes where they can be heard screaming in the distance, and others pipe up from other directions, communicating with each other and revealing just how surrounded the Hobbits are.\n\nNot a fan of horror in general but atmospheric, psychological, slow-burning horror seems right up my alley! Looking for recommendations!",
            "score": 3,
            "author": "TheSiegmeyerCatalyst"
        },
        {
            "level": 0,
            "comment": "Blood meridian, any scene with Judge Holden, the outhouse scene at the end of the book gave me the chills, closest thing to a jumpscare in book form.",
            "score": 4,
            "author": "LonelyGamingPotato"
        },
        {
            "level": 0,
            "comment": "The first time I read Tanith Lee's short story Elle Est Trois...when Death the Murderess enters really made my skin crawl. The story never had the same effect in subsequent readings...",
            "score": 4,
            "author": "medusawink"
        },
        {
            "level": 0,
            "comment": "Annihilation is right up there for me as well. But there is a moment near the end of the next book in the series, Authority, that will be with me for life. The scene isn't even very scary, but it's unexpected and supremely creepy. So I guess that's my answer.\n\nSome runners-up would be Revival, by Stephen King (the ending!), The Troop, by Nick Cutter, and A Head Full of Ghosts, by Paul Tremblay. Each one gave me genuine and long-lasting creeps.",
            "score": 4,
            "author": "waveheart222"
        },
        {
            "level": 0,
            "comment": "The scene with the rats in 1984.",
            "score": 3,
            "author": "hannahismylove"
        },
        {
            "level": 0,
            "comment": "In asoiaf, when Arya is taken by Yoren back north (iirc), there's a description of the lice infestation in his beared. made me itchy irl",
            "score": 5,
            "author": "marble-polecat"
        },
        {
            "level": 0,
            "comment": "The cornfield \"clubhouse\" chapter in The Lovely Bones. Mr Harvey is too real. He's the creepy guy who orbits close enough to go undetected through meticulous design. He's the bad feeling in your neighbourhood. The eyes you feel burning into you when you know you're being watched. He's the guy who knows you're too polite to listen to your gut. He's the ultimate predator, and that chapter scares the shit out of me because I know I could be a Susie.",
            "score": 5,
            "author": "VeterinarianIcy1766"
        },
        {
            "level": 0,
            "comment": "The scene in Dracula were Jonathon looks out of his window at the castle, and sees the count wearing his clothes. Then the count leans out of the window, and scuttles down the wall like a lizard. It makes me feel so horribly uncomfortable every time I read it, like properly nauseated.\n\nThe first time I read the passage in Stephen kings It were they figure out that the creature had laid eggs, Stan knew that and that's why he killed himself, had me straight up gagging and pausing the audiobook for a while.",
            "score": 8,
            "author": "mermaidandcat",
            "replies": [
                {
                    "level": 1,
                    "comment": "The beginning of Dracula is so good. Wish the rest of the book was like that.",
                    "score": 2,
                    "author": "utilizador2021"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The old guy's death scene in Apt Pupil where he feels the hands of the people he killed reaching up to pull him into the afterlife as he's dying.",
            "score": 3,
            "author": "theguineapigssong"
        },
        {
            "level": 0,
            "comment": "The most horrific scene I’ve ever read was in Reprisal by F. Paul Wilson. I won’t spoil it by describing it. Fans will know what I’m talking about.",
            "score": 3,
            "author": "TheMadIrishman327"
        },
        {
            "level": 0,
            "comment": "Gather the Daughters by Jennie Melamed has really stuck with me...",
            "score": 3,
            "author": "Sylvia_Whatever"
        },
        {
            "level": 0,
            "comment": "End of Exquisite Corpse by Billy Martin (published by Poppy Z Brite, originally). Fucked me up for months.",
            "score": 3,
            "author": "AnthonyPi1999"
        },
        {
            "level": 0,
            "comment": "I’m gonna go old school and say The Turn of the Screw by Henry James. But then maybe that’s because I’m a big pansy who doesn’t read much horror. Definitely left me spooked on more than one occasion though.",
            "score": 3,
            "author": "LetumComplexo"
        },
        {
            "level": 0,
            "comment": "The girl next door by Jack Ketchum.  The fact that it actually happened, creeps me out.  Something like that could be happening near me and I wouldn't even know.",
            "score": 3,
            "author": "The_Bad_idea_Man"
        },
        {
            "level": 0,
            "comment": "The Road by Cormac McCarthy.\n\nThe scene where they break into the house to look for food or supplies, then find a locked trap door…",
            "score": 3,
            "author": "Calm_Bookkeeper_6336"
        },
        {
            "level": 0,
            "comment": "*House of Leaves* by Mark Z. Danielewski really did a number on me back in high school. The \"monster\" never really appears and the scenes of going through the infinite house just triggered this existential dread.",
            "score": 3,
            "author": "Comfortable_Study_11"
        },
        {
            "level": 0,
            "comment": "Pet Sematary. I find the concept incredibly disturbing. How far would you go to save a loved one? Despite the evidence that it fundamentally changes them and they're not the same as they were before. At what point would you realise you've actually gone insane in pursuit of the impossible?",
            "score": 3,
            "author": "welshyboy123"
        },
        {
            "level": 0,
            "comment": "Let’s just say that I stopped using garbage disposals after I read *Firestarter*\n\nAlso that scene in *The Only Good Indians* that involves a post-mortem C-section. That hoof . . . I still think about that.",
            "score": 3,
            "author": "Binky-Answer896",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Let’s just say that I stopped using garbage disposals after I read Firestarter\n\nI avoided them for a LONG time afterwards and still won't stick my hand down one to retrieve anything.",
                    "score": 3,
                    "author": "Daghain"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Jeff VanderMeer [did an AMA here](https://www.reddit.com/r/books/comments/3es2af/im_jeff_vandermeer_the_author_of_the_southern/) you might want to take a look.  [Here's a full list of our upcoming AMAs](http://www.reddit.com/r/books/wiki/amafullschedule)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/books) if you have any questions or concerns.*",
            "score": 2,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "the entirety of House of Leaves...just seeing the book on my shelf sends a chill my way",
            "score": 2,
            "author": "raraohhgaga"
        },
        {
            "level": 0,
            "comment": "We Need to Do Something by Max Booth III. The scene with the \"dog\" made me feel legitimately paranoid and I actually looked over my shoulder at one point. Was reading it while laying on my side and I had to roll onto my back because I felt unsafe with it exposed. \n\nThe Deep by Nick Cutter is another. There's a lot of scenes that have stuck with me from that one, particularly Little Bee and Alice's fates.",
            "score": 2,
            "author": "mfkr9"
        },
        {
            "level": 0,
            "comment": "I've had a succession of those through the years, but an oldie stands out. When I read H. P. Lovecraft's 'Lurker at the Threshold' as a young teen. That one creeped me out for years after.",
            "score": 2,
            "author": "00Pueraeternus"
        },
        {
            "level": 0,
            "comment": "Not sure if it's the vibe you're talking about but in Worm by wildbow there is a chapter written from the POV of a mother looking over her new infant daughter. The chapter does a really good job of endearing this woman to you, making her sympathetic all while slowly adding in a few small details here and there until you realise this woman you were sympathizing with is a full on white supremacist nazi. Made my skin crawl.",
            "score": 2,
            "author": "Ulura"
        },
        {
            "level": 0,
            "comment": "Reading House of Leaves alone while listening to the related Poe album.",
            "score": 2,
            "author": "Logthephilosoraptor"
        },
        {
            "level": 0,
            "comment": "Child of God by Cormac McCarthy dude kills a couple then stores the woman’s body in his attic so he can have ~fun~ times with her. The scenes with the killer talking about the body grossed me the fuck out. This book fucked me up.",
            "score": 2,
            "author": "cr0ikee"
        },
        {
            "level": 0,
            "comment": "Deliverance movie scared me good, so I thought I'd read the book. I was a bundle of nerves when he climbed up the rocks with his bow at night and then just waited...",
            "score": 2,
            "author": "Amazing-Panda-5323"
        },
        {
            "level": 0,
            "comment": "There's a collection of 90s-based horror stories called _Ahh! That's What I Call Horror_ and there's a scene in one of the stories where a teach is talking to a student and the ick is so wonderfully subtle and awful. The whole anthology is full of amazing stories.",
            "score": 2,
            "author": "pepperdrop"
        },
        {
            "level": 0,
            "comment": "This may sound weird HG Wells' Time Machine. For as much Post Apocalyptic novels I have read, no other book has reminded me as much of the inevitable collapse of everything as The Time Machine",
            "score": 2,
            "author": "Realistic_Caramel341"
        },
        {
            "level": 0,
            "comment": "Stephen King's Pet Sematary, when 4 year old undead Gage is hunting their old neighbor.\n\n\"I'm gonna fuck with you old man, I'm gonna fuck with you all I want\"\n\nJust wrong.",
            "score": 2,
            "author": "TennisGuy6161"
        },
        {
            "level": 0,
            "comment": "I don’t read creepy books so mine was actually “the virgin suicides” in my opinion it just felt like there was a grown man trying to sexualise puberty of teenage girls. It has put me off reading books written by men for a while.",
            "score": 2,
            "author": "Redderv5"
        },
        {
            "level": 0,
            "comment": "Probably The Wasp Factory by Iain Banks which I have attempted to read at least twice, at least two decades apart, but still not finished.\n\nThe first time, it was a much slower read than usual due to the book's disturbing nature, I was struggling to get into it.  I had to stop because I was moving across country and it was a library book.\n\nA few tears ago, I picked up a second-hand copy locally and tried again. \n\nUnfortunately, for the last few years, I've been dealing with very bad anhedonia due to the menopause that had reduced my desire to read to almost nothing. I went from reading every single night before sleep, as I had done my entire life since the age of 3 - yes,  I'm hyperlexic - to not reading a single book for nearly a year!\n\nWhile I have started reading again, it was a slow start and it has meant giving many books plenty of second and third (and more, if necessary!) chances. It means recognising that I **have** to match my mood with the book that I am reading.\n\nBut my second attempt at the The Wasp Factory came before I had fully come to understand all of this, so once again it is put back on the shelf, waiting for the right day.\n\nI have also got House of Leaves on that shelf. I bought it a long time ago but at a time when my life was very stressful. I didn't even make it past the first few pages, far enough to be creeped out! I just wasn't in the right headspace to be able to enjoy it. One day though. Maybe not ,while I live in my current house though? It's actually on the edge of a forest in the French countryside, with no neighbours!\n\nOther difficult books from the thousands I've read over the years (my memory is getting a bit fuzzy on details now) that stand out: \n\nThe Sparrow and its sequel by Maria Doria Russell - not so much creepy but grim, still an extremely compelling read though.\n\nThe Hollow Places by T. Kingfisher - in many ways, this is the closest that I've come to feeling 'jump scares' while reading, certainly in recent memory. Not so much gross gore creepy but weird and hauntingly creepy.\n\nTo be honest, some of the creepiest fiction that I've read has been in short stories. And that was the ideal place for it and where it was able to have the most impact. There's only so much creepiness that we can tolerate in one go.\n\nI do find that I have a much, much higher tolerance for horror, gore, and overall creepiness in written form than on screen.\n\nI very rarely read graphic novels, comics or manga so it's hard to say how they affect me in comparison.\n\nI do have total aphantasia which probably helps in that regard.",
            "score": 4,
            "author": "EmmaInFrance",
            "replies": [
                {
                    "level": 1,
                    "comment": "Wow, I now understand what is happening to me, I’m 46 and this has started for me too. It’s like a puzzle just felt into place reading your post. I have left things I really used to enjoy. Thank you.",
                    "score": 1,
                    "author": "Worth_Competition863",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You might want to come join us in r/menopause?\n\nI haven't posted there for ages as my treatments are pretty stable but it's a very friendly place and full of excellent information!\n\nThe anhedonia was one of my very first symptoms when I had it for 12 days, alongside a 12 day period.\n\nIt was as if my entire world changed from technicolor to black and white overnight, when my period started. \n\nI couldn't taste food any more, it just tasted like cardboard, so I stopped eating.\n\nI stopped feeling joy. Intellectualy, I could see something that was beautiful, like a butterfly, but I couldn't feel and enjoy that beauty.\n\nI lost all interest in my usual hobbies and interests, in my usual TV shows, in reading.\n\nIt was such a stark difference!\n\nThen my period ended after 12 days and it all came back.\n\nThat was in July 2019 and was just a precursor of what was to come. The long term anhedonia started in the autumn of 2019 with all the other symptoms and slowly crept up on me.\n\nI do find that it varies throughout the day and tends to be worse in the evenings.\n\nIt's not depression. I have severe lifelong depression that is treated and stable and none of the markers for that have returned. \n\nObviously check for yourself that you don't have any other signs of depression but, at the same time, don't let doctors dismiss it as 'just depression' either.\n\nIt's absolutely hormone related.",
                            "score": 3,
                            "author": "EmmaInFrance"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I love T Kingfisher but her horror is weird. She's good at creepy",
                    "score": 0,
                    "author": "Awfki",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I really, really love her fantasy. \n\nThe Hollow Places is the only one of her horror books that I've tried so far, simply because I have to be in the right mindset for it and that doesn't happen as often these days.",
                            "score": 0,
                            "author": "EmmaInFrance"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Read Borne by Jeff Vandermeer. It takes place in a post-apocalyptic world, mainly in a city that's controlled by a giant flying bear named Mord. The eponymous character is a cross between a precocious child and the monster from the Thing. It's an incredible novel, and so is its prequel Strange Bird.",
            "score": 1,
            "author": "gganate",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sounds good. He really knows how to write bears. The bear in Annihilation was freaky too. I watched the movie before reading the series and that was the scene in the movie that got me the most.",
                    "score": 1,
                    "author": "xenoscumyomom"
                },
                {
                    "level": 1,
                    "comment": "Borne is great, I am doing a marathon of readings and rereadings of Jeff Vandermeer (Annihilation, Authority, Acceptance, Borne, The Strange Bird and Dead Astronauts) as soon as I finish my current marathon of Ann Leckie.",
                    "score": 1,
                    "author": "IsabellaOliverfields"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Origin in Death by JD Robb.  \n• Clones of women for sex slaves. \n• Imperfect clones (aka children) are \"culled\".  \n• Read one time.  \n• One of two Robb books I cannot reread. 😖",
            "score": 1,
            "author": "Dlbruce0107"
        },
        {
            "level": 0,
            "comment": "The Stand by Stephen King. I read it around the same time The Day After movie came out - the one with Steve Guttenberg about nuclear bombs dropping in the US. The Stand scared me far more than the movie. Kept thinking about that during 2020.",
            "score": 1,
            "author": "Kindly_Coconut_1469"
        },
        {
            "level": 0,
            "comment": "The Boy in Striped Pajamas",
            "score": 0,
            "author": "KingCreepish"
        },
        {
            "level": 0,
            "comment": "I must be wired differently.  I've never been scared by a fictional book.  The real world creeps me out far more than a book ever could.",
            "score": 0,
            "author": "loneacer"
        },
        {
            "level": 0,
            "comment": "A Wizard of Earthsea by Ursula K LeGuinn gave me nightmares. The part where Ged breaks into the forbidden library and calls a shadow monster. \n\nThis is probably because I was reading it when I was 7. My dad handed me it in the library and said he thought I’d like it. Its been decades but I still have trouble wanting to read her stories. Shame, she’s such a fantastic author.",
            "score": 1,
            "author": "Love-that-dog"
        },
        {
            "level": 0,
            "comment": "Some Christopher Pike book I read when I was a kid had me fucked up. The cover had a car or something on it, I haven’t been able to find it since though.",
            "score": 1,
            "author": "bebebotanica",
            "replies": [
                {
                    "level": 1,
                    "comment": "I had a quick google, it looks like it might be \"Road to Nowhere\", if you're still trying to find a copy for nostalgia it's on Amazon",
                    "score": 2,
                    "author": "VeterinarianIcy1766"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What creeped me out - I've been on a bit of an ebook binge lately, and I stumbled across this one called Whispering Secrets of Enigma. It's not a long read, but man, it packs a punch. This book had me hooked from the get-go and sent me spiraling through a journey that I just did not see coming.",
            "score": 1,
            "author": "AvidReaderChic"
        },
        {
            "level": 0,
            "comment": "The turtle scene in The Troop by Nick Cutter, or the part of the book where Shelley does literally anything",
            "score": 1,
            "author": "thesaucygremlin"
        },
        {
            "level": 0,
            "comment": "when i read ted the caver",
            "score": 1,
            "author": "ActivateGuacamole"
        },
        {
            "level": 0,
            "comment": "Not gory/creepy but psychologically creepy, is Tampa by Alissa Nutting.",
            "score": 1,
            "author": "Daghain"
        },
        {
            "level": 0,
            "comment": "There are a number of moments with ASOIAF, but for me the character of Qyburn makes my skin crawl. Especially when it comes to Cersei gifting him supplies for his projects. Ick.\n\nThere's also a decent amount of gang-rape :(",
            "score": 1,
            "author": "Skotus2"
        },
        {
            "level": 0,
            "comment": "I was reading Metro 2033 in bed, alone in the house in basically the dark. The part where the Librarians were completely silent in their killing and movement freaked my brain right out at that moment since my house was also dead silent.",
            "score": 1,
            "author": "Felicity1840"
        },
        {
            "level": 0,
            "comment": "Peter Straub's *Ghost Story* is still the gold standard for me. There aren't too many other novels I found to be scary; even Robert Marasco's *Burnt Offerings* is a distant second. (David Morrell's *The Totem* is a great book, but I would argue that it's truly frightening only at the end.) Lots of short stories really shook me up, though: \"Flies\" (Anthony Vercoe), \"The Lovely House\" (Shirley Jackson), \"Niemandswasser\" (Robert Aickman), \"The Colour Out of Space\" (Lovecraft), \"Sometimes They Come Back\" (King).\n\n***Edit:*** And this one, which I consider the greatest *Twilight Zone* episode that never was: \"The Thirteenth Floor\" by Frank Gruber. https://www.unz.com/print/WeirdTales-1949jan-00034",
            "score": 1,
            "author": "NotJustYet73"
        },
        {
            "level": 0,
            "comment": "I remember being very unnerved by *House of Leaves* when I first started reading it. Specifically, the parts where the narrator (not the people in the house, but the guy who found the accounts of what happened) starts to realize that he can feel *something* watching him. It definitely didn't help that I chose to read it at night and while alone. I still think about that feeling—knowing that some kind of monster is watching you but not knowing, specifically, what it is or when it might come for you.",
            "score": 1,
            "author": "The_Omniphage"
        },
        {
            "level": 0,
            "comment": "Kiss the Girls by James Patterson. There's one chapter in the book where I've put a sticky note just so I don't accidentally read it again. It honestly felt like the whole purpose of that chapter was to remind the reader that we were supposed to hate the antagonist even though the reminder was not needed.",
            "score": 1,
            "author": "TheBigKrangTheory"
        },
        {
            "level": 0,
            "comment": "The house on hackmans hill.  ... some kids accidentally upset anubis. I was around 12 and I still remember how scared I was over this book like I remember how sad I was over where the red fern grows.",
            "score": 1,
            "author": "ar-razorbear"
        },
        {
            "level": 0,
            "comment": "I generally don’t read creepy books so there’s definitely some Goosebump books from my childhood that still creep me out.",
            "score": 1,
            "author": "ThisPaige"
        },
        {
            "level": 0,
            "comment": "The murder scene in In Cold Blood",
            "score": 1,
            "author": "whydreaming"
        }
    ]
}