{
    "id": "143eb42",
    "score": 0,
    "title": "Is reading books the only human activity through which you can engage in conversation with the greatest minds from the past to the present?",
    "author": "Delicious_Maize9656",
    "date": 1686146989.0,
    "url": "https://www.reddit.com/r/books/comments/143eb42",
    "media_urls": [],
    "other_urls": [],
    "postText": "I can engage in conversation with Feynman, Plato, Darwin, Penrose and Buddha through reading books.\n\nBooks indeed provide an extraordinary opportunity to engage with the greatest minds of the past and present. Through the written word, we can access the knowledge, ideas, and perspectives of brilliant individuals from different eras and cultures. Books serve as a means of communication across time, enabling us to delve into the minds of philosophers, scientists, writers, and thinkers who have shaped our understanding of the world. I can communicate with those writers by expressing my agreement or disagreement with their ideas, concepts, and books, much like engaging in a friendly conversation. It's fascinating to consider that most writers invest great care in crafting their books, ensuring that every word and idea is thoughtfully presented. As a result, reading their works goes beyond simple conversation (chat).\n\n&amp;#x200B;\n\nI can't imagine any other activities that can provide this level of engagement.",
    "comments": [
        {
            "level": 0,
            "comment": "You are not engaging in conversation with them.. you are witnessing their monologue and then sisvusding it with yourself",
            "score": 45,
            "author": "Lostgal2",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; sisvusding\n\nVerb: to incorporate different learned experiences into one's own personal philosophy",
                    "score": 21,
                    "author": "-SparksLinerHigh-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "i just googled sisvusding and the only result was this thread, so it's a thing now",
                            "score": 9,
                            "author": "kibble_dust",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lol I think they typo'd discussing, but it sounded like a real word haha",
                                    "score": 10,
                                    "author": "-SparksLinerHigh-",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "i know but now it's a thing, it's not everyday someone comes up with a great new word",
                                            "score": 7,
                                            "author": "kibble_dust"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You could say \"engage with ideas from the greatest minds\", but it’s not a conversation. They are not listening to you.",
            "score": 30,
            "author": "Distinct_Armadillo",
            "replies": [
                {
                    "level": 1,
                    "comment": "One definition of engage is \"become involved with.\" No, obviously. That's the point of books, it's a one way conversation directed to the world. But you can have a conversation with other living people about what is in a book, engaging with it and the thoughts expressed.",
                    "score": 1,
                    "author": "bonjour-robot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I maintain that it is possible to engage with an idea",
                            "score": 1,
                            "author": "Distinct_Armadillo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I use a necromancer.",
            "score": 22,
            "author": "webauteur",
            "replies": [
                {
                    "level": 1,
                    "comment": "In this economy??",
                    "score": 9,
                    "author": "Nithuir"
                },
                {
                    "level": 1,
                    "comment": "That's out of my budget. I settle for a seance and talk to their ghosts.",
                    "score": 6,
                    "author": "Francis_Bonkers"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No. You're interpreting somebody else's work. You can do the same with any art form, artifact, or really anything. It's not a conversation.",
            "score": 23,
            "author": "noknownothing"
        },
        {
            "level": 0,
            "comment": "This reminded me of a line from Aldous Huxley's work:\n\n“In spite of language, in spite of intelligence and intuition and sympathy, one can never really communicate anything to anybody. The essential substance of every thought and feeling remains incommunicable, locked up in the impenetrable strong-room of the individual soul and body. Our life is a sentence of perpetual solitary confinement.”\n\nI am just stating this...not intended to discourage.",
            "score": 8,
            "author": "LostNail1840",
            "replies": [
                {
                    "level": 1,
                    "comment": "Huxley has never experienced the perfect gif, used in the most appropriate of circumstances",
                    "score": 11,
                    "author": "-SparksLinerHigh-",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you know there are thoughts &amp; phrases I wouldn't be at all surprised to read sooner or later.  But 'Huxley has never experienced the perfect gif' wasn't one of them.  \n\nThanks for the surprise.",
                            "score": 11,
                            "author": "chortlingabacus"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He must have been really misunderstood.",
                    "score": 2,
                    "author": "bonjour-robot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Folks, OP is a bot account.",
            "score": 3,
            "author": "obake_ga_ippai",
            "replies": [
                {
                    "level": 1,
                    "comment": "no im not",
                    "score": 1,
                    "author": "Delicious_Maize9656",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And yet this is the only comment you have replied to in this thread. How come you can’t respond to anyone unless they accuse you of being a bot? Seems quite convenient to me.",
                            "score": 0,
                            "author": "Kyrgyznecromancer"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sean: Do you think you're alone?\n\nWill: What?\n\nSean: Do you have a soul-mate?\n\nWill: Define that.\n\nSean: Someone who challenges you in every way. Who takes you places, opens things up for you. A soul-mate.\n\nWill: Yeah. Shakespeare, Nietzsche, Frost, O'Connor, Chaucer, Pope, Kant…\n\nSean: They're all dead.\n\nWill: Not to me, they're not.\n\nSean: But you can't give back to them, Will.\n\nWill: Not without a heater and some serious smelling salts, no…\n\nSean: That's what I'm saying, Will. You'll never have that kind of relationship in a world where you're afraid to take the first step because all you're seeing are the negative things that might happen ten miles down the road.\n\n**- Good Will Hunting**",
            "score": 2,
            "author": "tofu_block_73"
        },
        {
            "level": 0,
            "comment": "No. Listen to some music.",
            "score": 2,
            "author": "MllePerso"
        },
        {
            "level": 0,
            "comment": "I wouldn't say you're conversing with them. But I do like how books convey the time that they were written in and the context around that. It's kind of like a time capsule.",
            "score": 2,
            "author": "pilapalacrafts",
            "replies": [
                {
                    "level": 1,
                    "comment": "But also, they contain people's thoughts and it often feels like you are right there with the author, sharing their thoughts.",
                    "score": 0,
                    "author": "bonjour-robot"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Idk how the hell you think you are talking to plato, this isn’t a conversation, or if it is, its just a one-way conversation. If you read Plato’s republic, or the Bible, Plato isn’t talking to you- he is talking to the people of his time about a political system he thought better suited them, and Jesus isn’t talking to you either. He was talking to the people of ancient Judea. And maybe you can read the things they say, but the things they say remain rigid and unchanging, sure the meaning of what they say can change through the millennia, but nonetheless what they said originally is rigid. And that’s no conversation.",
            "score": 2,
            "author": "Kyrgyznecromancer"
        },
        {
            "level": 0,
            "comment": "\"Hello History\" app is an AI app that uses the writings of famous people throughout history to build individual AI's that you can converse with. From philosophers to celebrities. Fun little app.",
            "score": 1,
            "author": "CrassDemon"
        },
        {
            "level": 0,
            "comment": "Your post reminded me of an old Steve Allen program called Meeting of Minds. He would sit down with (actors) people such as Einstein, Newton, and others and have a table discussion, with himself as the host. \n\nIt wasn't always great, but it struck me as an insightful attempt to create what you're talking about.\n\nI see that full episodes are to be found on Youtube.",
            "score": 1,
            "author": "danellender"
        },
        {
            "level": 0,
            "comment": "Love this!! Even if they aren’t real conversations I too respond to what I’m reading and discuss in my mind.",
            "score": 1,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Would love to hear Darwin's responses to your conversation.",
            "score": 1,
            "author": "Autarch_Kade"
        },
        {
            "level": 0,
            "comment": "I've had this thought about books too! It's a big reason why I love them. I don't know if I'd necessarily say all of them are \"great minds\" but whatever.",
            "score": 1,
            "author": "bonjour-robot"
        },
        {
            "level": 0,
            "comment": "It's a sentiment writers have expressed, including one I have a special soft spot for, Louis-Sébastien Mercier. He was passionate about literature and it means a lot to me to know he felt that and often seems to have had it on his mind. I think there is a difference between the feel of that, say, Rousseau with his chatty style, aimed at provoking a response from contemporary readers (which I suspect was part of his popularity and why contemporaries can write as if they knew him even if they didn't. He pre-empts disagreement and seems to encourage it at times), and Mercier's utopian novel, set in the far future - he's also wanting to address contemporaries but thinking about posterity, including the future of literature, which of his favs will be seen as worth reading (big Voltaire fan!). There are scenes evoking the idea of connection across time, it's lovely. Still, writing of this sort being constructed with the expectation of a 'general' (depending on the expectations of the period and individual writer. Mercier wanted everyone to read) audience, also means the view we get of the writer is with them having been aware of that.\n\nThere can be more intimacy, sometimes uncomfortably, to reading letters (at least depending on the purpose of the letters in question, some may have had publication in mind). There is recorded speech as well. I've visited a few writer's houses, with the Bronte sisters' Haworth Parsonage having been especially memorable (darn that hill. Also very much reccomend reading their letters to anyone interested in them). Being physically in the space is different even to having seen a photograph, objects can be meaningful/touching as well.\n\nI learnt French wanting to understand the revolution and revolutionaries better (the two things are really inseparable), but even with daunting amounts of text of various kinds (fiction, political writing, newspapers, letters, parliamentary minutes and documents, accounts of varying reliability, personal books and lists of them) trying to get 'closer' in that way is even more overwhelming in terms of just how much is lost, how much you can't know. Of course this is different across different periods (it's made me see photographs of ninteenth century writers with new eyes. Portraits though are also a form of communication and could be designed to convey information to the viewer. And we have recordings of more recent writers, like Virginia Woolf, then video of Sartre - we don't always have to imagine what them having a conversation is like) and circumstances. I was previously more interested in medieval lit at university, and we can be 'lucky' to know a writer's name. Can we think we know the Pearl poet from the few personal details we guess at from the text? In comparison for the eighteenth century there's a lot and for me though I'll always have the interest, it's hard to go back. In other ways there isn't, and, as is obvious in a book set in a utopian future, there's the things beyond their imagination (Mercier imagines support for widows and orphans. He was right, but couldn't have anticipated that there'd hardly be any to need it in modern France. He depicts a sound recording device, which is pretty amazing, but no video). Writing, including writing now, is a bit like a snapshot of someone in one moment, from a certain angle. Writers can very much contradict themselves and change over time and moment to moment.\n\nI think in a way part of what looking more deeply at historical individuals has done, is that fictional characters feel less adequate as a way to convey the complexity of an individual - besides that glimpse of the writer.",
            "score": 1,
            "author": "Amphy64"
        },
        {
            "level": 0,
            "comment": "“When evening comes, I return home and go into my study. On the threshold I strip off my muddy, \rsweaty, workday clothes, and put on the robes of court and palace, and in this graver dress I enter \rthe antique courts of the ancients and am welcomed by them, and there I taste the food that alone \ris mine, and for which I was born. And there I make bold to speak to them and ask the motives of \rtheir actions, and they, in their humanity, reply to me. And for the space of four hours I forget the \rworld, remember no vexation, fear poverty no more, tremble no more at death: I pass indeed into \rtheir world.” ― Niccolò Machiavelli",
            "score": 1,
            "author": "BernardFerguson1944"
        },
        {
            "level": 0,
            "comment": "I agree with the sentiment but I also feel we connect in an intimate way when listening or playing music from the past, or viewing any kind of art.",
            "score": 1,
            "author": "CryptographerTrue499"
        }
    ]
}