{
    "id": "145nzo3",
    "score": 93,
    "title": "What’s up with the Colleen Hoover hype?",
    "author": "Bentalamar",
    "date": 1686363741.0,
    "url": "https://www.reddit.com/r/books/comments/145nzo3",
    "media_urls": [],
    "other_urls": [],
    "postText": "I was recommended a few Colleen Hoover books by friends and family, including: “It Ends With Us” and “Verity”. I read them and I was very… underwhelmed? I couldn’t visualize the characters at all and felt they had no depth. The writing also felt very middle school. \n\nI guess I’m struggling to understand what the hype is. I’ve been seeing that she’s very popular on TikTok and Instagram, and even has a movie coming out based on one of her books. \n\nAny thoughts or opinions?",
    "comments": [
        {
            "level": 0,
            "comment": "One doesn't have to be a *great* writer to become a *popular* writer. I read a book of hers, or perhaps two? and wasn't impressed but I thought maybe those kinds of stories just aren't my thing.",
            "score": 59,
            "author": "MacAlkalineTriad",
            "replies": [
                {
                    "level": 1,
                    "comment": "One of my friends read her books to show off.She said,\"it's cheap and it would make me look cool.\" I don't think true readers can be impressed with that little effort.",
                    "score": -3,
                    "author": "Normal-Platypus-5954",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's a really weird reason to read anything.",
                            "score": 13,
                            "author": "MacAlkalineTriad",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't understand the mentality of people like that. In my class, at least 50% of the girl have read it or seen carrying around with them.",
                                    "score": 3,
                                    "author": "Koreanturd"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "*True readers*\n\nNot a fan of this gatekeeping.",
                            "score": 22,
                            "author": "UntossableSaladTV",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "By true readers I meant the people who read the book for the knowledge or the entertainment the book provides,not the people who just buy books to show off.",
                                    "score": 3,
                                    "author": "Normal-Platypus-5954",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You’re still saying that one person’s reason for reading is superior to another person’s reason for reading. \n\nI get why you might find it distasteful, I do as well to be honest, but I try to refrain from judging others just because their motivations are different from mine. \n\nIf they are reading, there’s a good chance the magic will infiltrate them in the end :)\n\nAnd, if they are buying books just to look cool, they are still supporting authors, the people we need in order to fuel our passion. It’s still a win in my *book* :)",
                                            "score": 3,
                                            "author": "UntossableSaladTV",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I think you’re being too harsh. Isn’t reading/buying a book *just to show off* a little less than reading for any other motivation? Really? I think that’s pushing the gatekeeping thing.\n\nMaybe it’s because it’s Colleen Hoover, lord knows that if anyone came on here saying they’re reading Ulysses *specifically to show off*, they wouldn’t be treated mildly.",
                                                    "score": 4,
                                                    "author": "little_carmine_",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That was why I added my last point. Someone buying a book “just to show off” has zero negative consequences on anyone *except* for the holier-than-thou readers that are upset that someone is buying a book. \n\nMaybe I’m missing something, but the more I think about it the less offended I am by it.\n\nAs to it being Colleen Hoover, I don’t care if it’s James Joyce, James Patterson, or James Bond that they choose to “show off” with. If they’re buying a book, they’re supporting an author/publisher/secondhand bookstore, which is beneficial to other readers.",
                                                            "score": 0,
                                                            "author": "UntossableSaladTV"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Still gatekeeping.",
                                            "score": 2,
                                            "author": "SecretAchievement",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "How? Isn't gatekeeping keeping others out of a hobby because you don't like them?",
                                                    "score": 2,
                                                    "author": "LoquatLoquacious"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "As a reader and a writer, there's nothing extraordinary about her writing. In fact, the prose is markedly bland and lacks any kind of voice. But after giving it some thought as to why I was able to read It Ends With Us and It Starts With Us in the span of 2-3 days, I think that's what makes her books so popular. \n\nIt ignited in me that same drive to keep reading that I used to get from reading fanfiction when I was younger. The writing was very accessible and relatable and not at all deep. I think this appeals to a lot of the general public, and also lets the story take centre stage while the prose kind of turns \"invisible\". The story itself relied on a lot of the drama and tropes that I recognized in fanfiction too, like guy-from-your-past-reappears-in-your-life-all-hot-and-successful, guy-from-your-past-has-longed-for-you-all-this-time, guy-you're-meant-to-be-with-discovers-you're-being-mistreated, hot-guy-saves-you-from-your-bad-boyfriend, you're-pregnant-and-he-helps-you, etc. Stories I used to eat up as a teenager because I may have daydreamed about myself in similar centre-of-attention scenarios or being noticed/rescued by a guy. \n\nTo sum it up, I'm convinced that the books' success is due to its similarity to tropey fanfiction.",
            "score": 174,
            "author": "secondblush",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think you're spot on.  They're easy to read/get into and you kinda know what you're in for.",
                    "score": 28,
                    "author": "MacAlkalineTriad"
                },
                {
                    "level": 1,
                    "comment": "I agree with you that many people find her books relatable to their life.",
                    "score": 7,
                    "author": "Outrageous_Books_"
                },
                {
                    "level": 1,
                    "comment": "i agree! i am not much of a fan but i IEWU did get me back into reading after a few years. you can finish them so fast that that feeling alone it's satisfaction. once i explored other authors i realized how bland she is.",
                    "score": 6,
                    "author": "effullgent"
                },
                {
                    "level": 1,
                    "comment": "This trope is getting old.",
                    "score": 7,
                    "author": "Normal-Platypus-5954"
                },
                {
                    "level": 1,
                    "comment": "&gt;As a reader and a writer, there's nothing extraordinary about her writing.\n\nIm laughing and dying",
                    "score": 5,
                    "author": "Sorry_Arm2829",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Its true isn't it?",
                            "score": 4,
                            "author": "Koreanturd",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The sad truth",
                                    "score": 1,
                                    "author": "Sorry_Arm2829"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This just reminds me of back when ppl where hyping over The Midnight Library and I was so confused omg",
            "score": 20,
            "author": "vanillapancakes73"
        },
        {
            "level": 0,
            "comment": "I think she’s the contemporary Dan Brown but with romance",
            "score": 15,
            "author": "OkTea8570"
        },
        {
            "level": 0,
            "comment": "Some people really like fastfood.",
            "score": 64,
            "author": "KoeiNL",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well if it's helping them into the habit of reading, it's a plus right?",
                    "score": 6,
                    "author": "Koreanturd"
                },
                {
                    "level": 1,
                    "comment": "This is the explanation.",
                    "score": 3,
                    "author": "rustblooms"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Her books are extremely underwhelming. Themes aren’t explored very well, characters don’t have much depth to them, they remind me of something I’d find off Wattpad (which isn’t bad, but Wattpad is hit or miss). Just all in all, I felt like I wasted my time reading It Ends With Us and I’ll never get it back. Her books went viral on booktok, if I’m not mistaken. However overall, I just think her writing style is very bland, cliche and cringe. I think her books are lazy story telling. However, they’re good to read if you’re not looking for something heavy or too much to get into",
            "score": 30,
            "author": "immieisarevert"
        },
        {
            "level": 0,
            "comment": "The big hype before her was (effectively) E.L. James and the *Fifty Shades of Grey* series, so I've got to question whether people should see Hoover's style as bad, or a step up from where we were.",
            "score": 7,
            "author": "TheChocolateMelted"
        },
        {
            "level": 0,
            "comment": "I am going to be honest. I have never read her. But a lot of the people I have seen raving about her haven't been the brightest people. I really don't mean it to be an asshole. In reality, any reading is good. Regardless of what it is. But it didn't seem like something I would like.",
            "score": 6,
            "author": "meg8278"
        },
        {
            "level": 0,
            "comment": "This post is very hard to respond to without being called pretentious by half this subreddit 🤷🏼‍♀️😂",
            "score": 47,
            "author": "Critical-Lobster5828",
            "replies": [
                {
                    "level": 1,
                    "comment": "I felt pretentious making the post, but I genuinely want to know! 😭",
                    "score": 21,
                    "author": "Bentalamar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I put her books in the \"beach reads\" category. Something light and entertaining and an easy read for when you don't want to think too hard, just enjoy a story. For some people that's their favorite genre and that's fine, we all read for different reasons and get different sorts of enjoyment from stories",
                            "score": 17,
                            "author": "dive-europa",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "this is why i don't hate crappy generic hallmark christmas movies.  they have their place: you can put them on and they don't demand your full attention, they are formulaic so you can drift in and out of the room and at any moment you stop by you can tune in and enjoy some christmas schlock.",
                                    "score": 5,
                                    "author": "ActivateGuacamole"
                                },
                                {
                                    "level": 3,
                                    "comment": "This makes a lot of sense! I think that’s why her books are good for people who are trying to get back into reading, the plots aren’t too thick and they’re nice, easy reads",
                                    "score": 3,
                                    "author": "Bentalamar"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I honestly think it's fine to be pretentious when it comes to books, all it means is you have specific standards that things you spend time on have to live up to 🙏",
                            "score": 7,
                            "author": "mallaktd76640"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Colleen Hoover has me thinking maybe I can write a book",
            "score": 22,
            "author": "amberenergy7"
        },
        {
            "level": 0,
            "comment": "Why don’t you ask your friends who recommended the books? They had reasons that they enjoyed them so much that they recommended them to you. \n\nPersonally I’m not a fan, and I honestly think she does damage with her books, but I can see why they’re so popular. I feel the same way about sports though, so it’s kind of whatever.",
            "score": 5,
            "author": "monsterosaleviosa"
        },
        {
            "level": 0,
            "comment": "She’s been pretty popular for a while. I remember hearing about her almost a decade ago. I think she was one of the first popular authors in the “new adult” genre, which is the bridge between YA and adult. Typically that means books are written in a YA style, but feature adult characters and more adult themes and relationships. \n\nI’ve never been a Colleen Hoover fan, but I can understand why her books do well. You can breeze through them in a day or two. Her writing has the familiarity and comfort that YA does, but doesn’t have to shy away from adult themes. They’re not meant to be literary works of art, more like a hallmark movie",
            "score": 4,
            "author": "imsosleepyyyyyy"
        },
        {
            "level": 0,
            "comment": "I’ve made this comparison in this sub before, but CoHo is the Lays potato chips of writers— it hits a certain spot, but you’re also aware that the bag is at least half air, and you’ll sure as hell need a bigger meal later.",
            "score": 5,
            "author": "badbitchfunkywitch"
        },
        {
            "level": 0,
            "comment": "I read It Ends With Us.  It was pretty okay.  I liked the ending.  But thought the whole thing was pretty obvious....and I just couldn't relate to the main character.\n\nI started Verity this week and ended up quitting.  It was so ridiculously written.  Complete Mom-Porn.  I'm also pretty sure Colleen Hoover has never had the kind of relations she \"tries\" to describe in her books.  It reeks of someone writing about something they know nothing about at all....like a 12 year old imagining what it's like to be a hot young adult",
            "score": 4,
            "author": "ptb4life",
            "replies": [
                {
                    "level": 1,
                    "comment": "Exactly! I read verity two weeks ago and it read like try-hard erotica!!!",
                    "score": 4,
                    "author": "Bentalamar"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I find that people either really love her or really don’t.\n\nI can’t even stand the fact that she’s called CoHo… for whatever reason that just makes me nuts.",
            "score": 10,
            "author": "MinniesWorld",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's perfectly normal imo to hate those kinds of nicknames. It just gives off \"Millennials using tiktok\" vibes, which is a-ok to hate on.\n\nI've never read her books because romance isn't my thing, so for all I know she might be worth the hype.",
                    "score": 1,
                    "author": "jezt1984"
                }
            ]
        },
        {
            "level": 0,
            "comment": "There's some great roasting on YouTube. Check out @readwithcindy on Verity.",
            "score": 9,
            "author": "SnooPets2312"
        },
        {
            "level": 0,
            "comment": "Why not ask the people who recommended you read it? Ask what they liked about the books, etc. \n\nAnyway, now you know you don’t have the same taste as those people and will make your own reading decisions.",
            "score": 17,
            "author": "ViniVidiVelcro"
        },
        {
            "level": 0,
            "comment": " I think people like her personal underdog story - struggling, originally self published, lived in a trailer, etc. It gives hope to aspiring writers maybe. But I agree, that her writing and storytelling is underwhelming.\n\n  If you're looking for a writer with a \"bootstraps\" backstory, I would go with the late Virginia Lanier. Orphaned, chronically ill, very modest lifestyle but a voracious reader, one day she threw a book across the room, said she could write better. Her husband told her to go ahead and do it. The result was the first book in the series \"Death in Bloodhound Red\" a fun, well written, mystery with an original voice. Way better than Hoover. Only 6 books in the series, the last one was published after her death.",
            "score": 3,
            "author": "avidreader_1410"
        },
        {
            "level": 0,
            "comment": "I really don’t get it and I enjoy trashy, formulaic romances. \n\nHoover’s writing is so intensely bland and boring. I could see how people wouldn’t mind that if she was doing something fresh or unique, but she’s not. It’s the same stuff everyone’s writing, just with no energy or life in it.",
            "score": 3,
            "author": "RealitiBytz"
        },
        {
            "level": 0,
            "comment": "Reminders of Him has put me in a 2 month book slump. I got bored within the first chapter and have had zero interest to read a single book since. BookTok hyped about her for so long but she’s just… meh.",
            "score": 3,
            "author": "ariellani",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s the only book I’ve ever read by her. It was underwhelming. It felt like a 16 year old was trying to write adult romance. I’ll never read another book by her and I’m convinced that her target audience is 15 to 17 year old girls that have zero life experience and think that abusive relationships are romantic.",
                    "score": 2,
                    "author": "fitandstrong0926",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh yeah, she definitely romanticises abusive relationships and I think her target audience are that age range, too. Her books are easy reads which I think makes her books likeable but ultimately they really aren’t good at all. I did think Verity was really good though! Just do not waste your time reading Layla. That book was so bad.",
                            "score": 2,
                            "author": "ariellani"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Whats popular isnt always whats good. In my opinion, more often its not.",
            "score": 3,
            "author": "vpons89"
        },
        {
            "level": 0,
            "comment": "If it gets people to read, it’d fine I think. Not my thing, but that’s okay.",
            "score": 3,
            "author": "ambiverbena"
        },
        {
            "level": 0,
            "comment": "Not directed at you, but these posts about her are getting annoying.\n\nShe has a clear demographic and what appears to be an echo chamber on TikTok (BookTok). She doesn't have to put anything into marketing. She releases at a high volume, so I wonder if her crowd will eventually get sick of it, like the MCU.\n\nI've never read any of her books, but I respect the hustle. I don't care if it's not \"real\" literature. She makes bank. Good for her. I'm pretty sure there was an article floating around where she herself didn't know why her books were so popular.\n\nI don't really care if her books are trash, but I find it strange that a lot of online critics target her so ferociously. If you saw that all her books were chart toppers and you feel bad for spending money on a book you hated, that's on you. \n\nIt's just a perfect storm. When or if it'll subside in the near future remains to be seen. Seems to be going strong.",
            "score": 14,
            "author": "John___Titor"
        },
        {
            "level": 0,
            "comment": "Honestly talking,I've never read a collen hover book(it's not that much dark for me,I like zade meadows more)but the tiktok and Instagram just ruined it for me.There are plenty of good books out there to read but that old same concept is not just my cup of tea.I'd rather spend my time reading a good sci-fi or even a thriller.",
            "score": 2,
            "author": "Normal-Platypus-5954"
        },
        {
            "level": 0,
            "comment": "I have read only 2 of her books, Verity and It ends with us. I didn't find anything special in her writing but her way of telling a simple story in a more interesting manner is what has made her books interesting for me.\nI feel that her books are overhyped, the books are nice but don't have that crazy element that everyone is talking about.",
            "score": 2,
            "author": "Outrageous_Books_"
        },
        {
            "level": 0,
            "comment": "The tropes are too cliche to begin with",
            "score": 2,
            "author": "gingertea95"
        },
        {
            "level": 0,
            "comment": "I do not get the hype for Verity. It seemed like a book I would have loved as a pre-teen/teenager though.",
            "score": 2,
            "author": "RayDeaver"
        },
        {
            "level": 0,
            "comment": "the first colleen hoover book i read was “It Ends With Us” and i liked it a lot. though my opinions change a lot after i read books after some time thinking about it and i can now say looking back on it, the book isn’t amazing. I however do really like “Verity”, i liked the plot twists and the possibility of how it actually ends (i’m team manuscript). i remember after that, i bought loads more colleen hoover books, now have about 11 on my shelves, but i have no desire to read them anymore. i was convinced i loved them but the more i think about the ones i’ve read and read everyone’s critiques, i get it. i’ve only read “It Ends With Us”, “Verity” and “Ugly Love”, basically the holy trinity of colleen hoover",
            "score": 2,
            "author": "seabass_03"
        },
        {
            "level": 0,
            "comment": "i was friends with her son forever and didn’t know until recently lmao",
            "score": 2,
            "author": "1-800-NO-BEATS"
        },
        {
            "level": 0,
            "comment": "I personally don't like her work. 🤷",
            "score": 2,
            "author": "BookyCats"
        },
        {
            "level": 0,
            "comment": "It's trauma porn wrapped in romance. She found a formula that sells so good for her. All my coworkers read them non stop. I read Ugly Love  just to see the hype and it was ok.",
            "score": 2,
            "author": "trailrunner79"
        },
        {
            "level": 0,
            "comment": "Thank goodness for goodreads and those ratings.  I'll never know just how unsatisfying hoover books are 🤓",
            "score": 2,
            "author": "Qigongbounce"
        },
        {
            "level": 0,
            "comment": "I don’t get it. At all.",
            "score": 2,
            "author": "LeftandLeaving9006"
        },
        {
            "level": 0,
            "comment": "I wonder the same thing. My first Hoover book was Verity, and I actually loved it. I read several others (November 9th, Without Merit) and also felt that the characters had no depth and the story was flat.",
            "score": 2,
            "author": "First_Blackberry_820"
        },
        {
            "level": 0,
            "comment": "I avoided her books for the longest time bc of all the hype but finally read one and loved it.\n\nI just think everyone reads and likes their own things, nothing should be so hyped as her books are.",
            "score": 2,
            "author": "d-wurld"
        },
        {
            "level": 0,
            "comment": "Basic people like basic books. Someone’s gotta write for them",
            "score": 2,
            "author": "shadowdra126"
        },
        {
            "level": 0,
            "comment": "Imo, the only people who love her are the ones who are just getting started with reading romance books. Otherwise, for people who have read many other and better books, it is bland and meh. It’s like you realise you deserved better than colleen hoover.",
            "score": 6,
            "author": "PretendAnt6639"
        },
        {
            "level": 0,
            "comment": "Not to be rude, but you don't *have* to understand the hype. People like different things. That's okay.",
            "score": 7,
            "author": "eschuylerhamilton",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m moreso coming from the place where I’d like to have an open discussion about it, I understand people like different things and I agree that that is okay.",
                    "score": 4,
                    "author": "Bentalamar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Right, so why does it matter why they like it? You don't. I don't understand why people like romance books, but I'd never ask someone to justify their taste in books to me. At the end of the day, people are gonna like what they like and dislike what they dislike.",
                            "score": 2,
                            "author": "eschuylerhamilton",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why is OP not allowed to ask why people do or don’t like things? They’re being curious, they aren’t being rude or trying to dismiss how others feel. They aren’t asking people to “justify” why they like something, they’re asking them to explain it— and people are well within their rights to not answer if they do choose.\n\nWhy are you trying to shut down what could be a reasonable discussion?",
                                    "score": 5,
                                    "author": "Longjumping_Bid_2651"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I have read  \"It Ends With Us\", \"It Starts With Us\", and \"All Your Perfects\". \n\nIEWU was the very first book I've ever truly experienced fear while reading.  We all know how easily the situations could have been much worse.\n\nI don't understand why ISWU was made. TikTok got that book made. It was literally just what her diehard fans asked for, more Atlas.\n\nAll your Perfects was interesting because it made me really evaluate parts of marriage.",
            "score": 6,
            "author": "MaggieThePriest",
            "replies": [
                {
                    "level": 1,
                    "comment": "I was shaking after finishing It Ends With Us. It’s not my favorite of hers, but it definitely struck a nerve.",
                    "score": 2,
                    "author": "BeansBooksandmore"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This question is nearly as popular as people asking if they should finish the book they don't like.",
            "score": 3,
            "author": "OptimalAd204"
        },
        {
            "level": 0,
            "comment": "It's all advertising and marketing. Smoke and mirrors.",
            "score": 3,
            "author": "Keksis_theBetrayed"
        },
        {
            "level": 0,
            "comment": "I read IEWU and a couple others. I didn't hate them. But, as a bookseller, I appreciate that she has brought droves of people to our store who would  otherwise have never been. It is nice to see people so excited about an author. And a refreshing change from the readers who chew on Overstory or Lincoln in the Bardo or Cloud Cuckoo Land like pretentious twats. CoHo is opening up the world of reading to new people. And I lover her for it.",
            "score": 3,
            "author": "Physical_Salad6217",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know a lot of people who are getting back into reading have explained to me that Hoover was an easy enough read to get them hooked again, so I understand that sentiment! That’s really great.",
                    "score": 2,
                    "author": "Bentalamar"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Her books are very unreal and toxic and someone wrote that her books was what could be called as trauma porn( i totally agree)... the book is always about characters whose personalities were based on their traumas and they have tons of sex...i tried to read more of hers since i believe in second chances and most people were saying her books were sooo good but i guess it was just really dissapointing.\nI think alot of people like her books because it is mostly romance which ig its simpler to get into and also the writting is easy. The stories dont have big plot twists which make them easy to read specially for new book worms.  Also it worries me seeing young girls reading such books bcs i have seen so many of them saying they love such toxic characters(example Ryle).\n\nBut really booktok reccs arent always the best....",
            "score": 4,
            "author": "braless_bra457"
        },
        {
            "level": 0,
            "comment": "That's nothing walk into a Target and she's got like 15 books on the shelves. Just the current popular author, before it was Elin Hildebrand, also probably since most of the protagonists I believe are women, they seem more relatable. I read It Ends With Us and it seems like she hates women after putting the main character through so much shit.",
            "score": 4,
            "author": "wildadragon"
        },
        {
            "level": 0,
            "comment": "i actually enjoy her which surprised me cuz ive only brought one of her books so i could roast her and say that that she is shitty XD. im mainly a high fantasy reader, and all of my books are hard reads, and sometimes it just feels relaxing to read something simple where i don't have to turn pages every minute to watch the family trees and the maps and other things. im not a romance fan and i dont like books that are purely romantic, but i think coho tries to write some action in her books as well and they are just what me and my mom call \"beach reads\". its simple, won't make you think about it a lot, can be read in one sitting and relaxing.",
            "score": 2,
            "author": "Nicks_thefrog"
        },
        {
            "level": 0,
            "comment": "'It ends with us' was not bad, but it wasn't good either. I feel like this is something I should've read for free on Wattpad and then be like \"OMG,what a great book\".",
            "score": 2,
            "author": "jiafeifei"
        },
        {
            "level": 0,
            "comment": "The people who can relate to the topics she writes about, or have seen others close to them go through similar things as her characters, tend to enjoy her books. The people who have never gone through that kind of stuff (or just struggle with empathy, in the case of some) tend to dislike her books. I really do think it's as simple as that for most people. Books don't have to be super deep or detailed or have outstanding writing in order for the topics to hit home with people. It always bothers me when I see people talking about how they hate Colleen Hoover's characters for being bland or they hate the books because \"that situation just isn't realistic\" or \"they're so dramatic,\" because for a lot of people in this world, those situations ARE real. Obviously, not every person is going to relate to every bit of her books 100%. But I have both experienced and witnessed firsthand the kinds of abuse, trauma, grief, coping mechanisms, fear, isolation, etc. that she writes about. So I'll continue reading and enjoying her books because it's therapeutic for me to read about those things, in a setting far away from me in bookland, where there is a clear relief/ happy ending, because it's therapeutic for me as someone who understands and relates to those topics. You know now that maybe her stuff just isn't for you, and that's okay. It is a good conversation to have with your friends, about the sorts of things you each want to get out of the books you read, so they can recommend stuff that's more your style or just accept that you have different tastes.",
            "score": 2,
            "author": "NoExamination2438",
            "replies": [
                {
                    "level": 1,
                    "comment": "I’m sad that you’re getting downvoted for your response. While I don’t personally like her books, for probably more general reasons and my own personal reasons, I understand why you do and I’m glad they’ve helped you.",
                    "score": 2,
                    "author": "Longjumping_Bid_2651"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Writing style is off. Not sure about the hype. You know when you try and tell a story to your friends through your group chats? I feel the same style with Colleen Hoover less the animation, no joke.\n\nShe's boooring",
            "score": 3,
            "author": "AdBackground1419"
        },
        {
            "level": 0,
            "comment": "The person who recommended her to me also loves Emily Giffin and Nicholas Sparks, which tells me everything I need to know, lol. Of these 3, I actually think CH might be the worst writer of the bunch. NS is sappy and corny and EG is predictable and trite but at least they have a discernible voice in their writing. CH writes at like an 8th grade level. She’s bad and boring.",
            "score": 1,
            "author": "KitchenCommittee1827"
        },
        {
            "level": 0,
            "comment": "I think her books shouldn’t be as hyped and stuff. My friend told me that most of them have doormat characters or romanticize abusive relationships, or the girl ending up pregnant half the time. All of that alone bugs me and turns me away from it. I also can’t believe that one is becoming a movie —.",
            "score": 1,
            "author": "Sea_Philosophy4256"
        },
        {
            "level": 0,
            "comment": "Can we ban these posts?",
            "score": 0,
            "author": "J-blues"
        },
        {
            "level": 0,
            "comment": "One day this will be touted as a well known huge ad campaign for an author. \n\nShe made plenty of money off of it, so it was likely worth it.",
            "score": 1,
            "author": "Ridonkulousley"
        },
        {
            "level": 0,
            "comment": "What's with the project hail marry or \"being read to is the same as reading\" hype?",
            "score": 1,
            "author": "Dry_Tangerine_3664"
        },
        {
            "level": 0,
            "comment": "Honestly speaking I had read  some of her books  and really liked her work in them  but my last read  Reminder of Him was so boring ,I don't feel like reading her books from then..",
            "score": 1,
            "author": "Sea_Discipline6361"
        },
        {
            "level": 0,
            "comment": "A lot of people I know like them as a sort of guilty pleasure. Almost like reality TV. They aren’t the best product, but they can be compelling and can fulfill a need for instant gratification since you can read them pretty quickly. I’ve read a few of her books and mostly enjoyed them. The best one I’ve read is Reminders of Him, and I was honestly surprised by how much more I liked it compared to her other books. It seemed like it was more thought out than the others I had read.",
            "score": 1,
            "author": "BeansBooksandmore"
        },
        {
            "level": 0,
            "comment": "I was curious as well.  Everyone at the pool the other day was reading the second book.  I looked up the books, and just by the description, it seemed like the plot would fall flat. I didn't bother with them.",
            "score": 1,
            "author": "penartist"
        },
        {
            "level": 0,
            "comment": "She's just very popular right now. I have absolutely no interest, but I don't begrudge her her success. She obviously is connecting with a lot of people, I'm just not one of them.\n\nDon't kid yourself that she's the only writer like this. There have been many writers in the past who took the world by storm, but who weren't valued in literary circles. Does the name Danielle steel ring a bell?",
            "score": 1,
            "author": "Ineffable7980x"
        },
        {
            "level": 0,
            "comment": "Honestly when I was a teenager I loved her books in a sense that I did not dwell too much on the context and impact but rather just the whole romance and gushy aspect. Myself from almost a decade ago enjoyed it because I was the target market of her books and most probably the same as to why she is booming right now. Though a lot of her most well known books now are IMO not her best works, I will not shy away from saying {November 9 by Colleen Hoover} is a great read. Remains my favorite of hers despite having to reread at the present time.",
            "score": 1,
            "author": "sippingonice"
        },
        {
            "level": 0,
            "comment": "I’ve only read two of her books - Ugly Love, which I thoroughly enjoyed - and Verity, which I could not understand the hype at all. I’ll read more if the library ever has them available, but I won’t purchase them. But, then again, I don’t buy any books anymore… 🤷‍♀️",
            "score": 1,
            "author": "linkydinks"
        },
        {
            "level": 0,
            "comment": "No idea why her books are as popular as they are, I think they're mediocre at best",
            "score": 1,
            "author": "Prestigious_Tiger979"
        }
    ]
}