{
    "id": "146cvmw",
    "score": 189,
    "title": "Just finished Crime and Punishment and my mind is blown",
    "author": "bunnybunny81",
    "date": 1686435577.0,
    "url": "https://www.reddit.com/r/books/comments/146cvmw",
    "media_urls": [],
    "other_urls": [],
    "postText": "Incredible book, incredible characterization. I almost put it down since the beginning is slow to start but I’m so glad I didn’t. It’s super interesting and much more demented than I expected, I had just reread Sharp Objects by Gillian Flynn and was looking for something well written and dark to move onto next. It’s very suspenseful and there’s a lot of detailed clues, imagery and symbolism. When you look back and reflect you notice so many little details that are tied into everything else. Even the color of the wallpaper. I’m moving onto The Brothers Karamazov next, this book has definitely made me a Dostoevsky fan. \n\nStop here if you don’t want to read anything about the book, I’m going to discuss a scene. It’s not directly related to the main narrative since it’s a dream/flashback so I’m not tagging this as spoiler, but if you are intent in going in completely blind click off! It also includes discussion of animal abuse/death. \n\nThere is a scene where Raskolnikov dreams of his childhood, where a group of people stand around and jeer while a horse is being beaten to death in the middle of the road. The owner demands the old horse carries a far too heavy load, more and more people load onto the horse and laugh as it buckles. As punishment, he violently continuously beats it. Bystanders cry out in disbelief, shame, contempt, but do nothing to stop the monster from beating his horse since it’s his property. Raskolnikov as a child runs towards the horse and kisses its dead face, weeping and his father rips him away. The reasoning? It’s really none of their business. I found this scene to be a powerful reflection of the apathy our society propagates, the cruelty and sickness. Here Raskolnikov is still a pure child, capable of empathy. This moment is a turning point for him, a realization that the world cares and stops for no one. That the innocent and compliant will be tortured.",
    "comments": [
        {
            "level": 0,
            "comment": "We actually had to read this in high school (AP English)  I really enjoyed it and it has stuck with me.  It was even an easy book to write a paper on.",
            "score": 21,
            "author": "jsr0928"
        },
        {
            "level": 0,
            "comment": "You might like the Sympathizer by Viet Thanh Nguyen",
            "score": 19,
            "author": "boxer_dogs_dance",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you!",
                    "score": 1,
                    "author": "bunnybunny81"
                },
                {
                    "level": 1,
                    "comment": "ooh I really, really enjoyed this book, I had a friend give it to me and they said it was boring so they couldn't get into it, I will never understand that but to each their own",
                    "score": 1,
                    "author": "gusloos"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I read this book in high school with no reaction. I re-read it as an adult, and was blown away. One of my favorite books.",
            "score": 10,
            "author": "huberific"
        },
        {
            "level": 0,
            "comment": "I liked Dostoevsky's The Idiot as well, even though it's not as good a story.",
            "score": 8,
            "author": "x_lincoln_x"
        },
        {
            "level": 0,
            "comment": "You should check out notes from the underground as well, it is a very quick read and is really good.",
            "score": 27,
            "author": "Timely-Huckleberry73"
        },
        {
            "level": 0,
            "comment": "Just finished the book a few days ago! The part when Katerina Ivanovna went into a fit of hysteria, pulling her young children out to the streets to perform, made me as uncomfortable as the horse dream did. I was really in awe of how much the side character's presences stuck with me even in chapters when they weren't mentioned",
            "score": 8,
            "author": "pancakeyellow",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes! I was thoroughly disturbed. The children crying and her beating them. So brutal. Many of the characters display some narcissistic characteristics.",
                    "score": 5,
                    "author": "bunnybunny81"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’m scared but excited to hear this, as I just started reading it today! I am currently mostly confused, but still having fun with all of the interesting characterisations and situations that Dostoevsky makes.",
            "score": 7,
            "author": "SiriusMoonstar"
        },
        {
            "level": 0,
            "comment": "How much crime and punishment is in there?",
            "score": 7,
            "author": "HeySlimIJustDrankA5",
            "replies": [
                {
                    "level": 1,
                    "comment": "A little bit of both",
                    "score": 6,
                    "author": "Timely-Huckleberry73"
                },
                {
                    "level": 1,
                    "comment": "Punishment was reading through 100 pages of him slowly going insane, slowly driving me insane in the process.",
                    "score": 2,
                    "author": "LTareyouserious"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's been a while since I read Dostoevsky. I loved C&amp;P and BK. BK is looooooooong so be prepared for that. But it's worth it.",
            "score": 14,
            "author": "SnooPets2312"
        },
        {
            "level": 0,
            "comment": "Wow I did not get that at all when I read it. I disliked Raskolnikov a lot, always thought he believed he was above everyone else and then near the end when he starts believing in God because he's in jail, I disliked him even more. Thank you for sharing that, I still feel no sympathy for him, but I think that what you explained is what Dostoevsky intended to convey.",
            "score": 10,
            "author": "Hg2357",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't think you are supposed to like Raskolnikov.  His main goal in the story is&gt;!to kill some random easily overlooked victim just to see if he is as great as Napoleon.  As if that would could ever be some kind of proof.!&lt;",
                    "score": 11,
                    "author": "x_lincoln_x",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ya you are definitely not supposed to like him as a person, or root for him. He represents a nihilistic way of thinking that Dostoyevsky was deeply opposed too. However, I absolutely love him as a character, he is very interesting and watching him unravel was a darkly hilarious experience. I think he is my second favourite character in literature after the underground man.",
                            "score": 10,
                            "author": "Timely-Huckleberry73",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I agree.  I always wondered did the word \"rascal\" become popular from Crime and Punishment or did Dostoevsky choose to name him rascal because he is not a hero.  I never did look up the etymology of the word rascal.",
                                    "score": 6,
                                    "author": "x_lincoln_x",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The surname of the main character Raskolnikov derives from a russian word 'raskol' - division, or schizm. It has deep symbolism in russian culture. Society often seems to be divided on so many matters, name symbolizes it. Or it can be the other way around: protagonist separates himself from the rest of people, regarding them of inferior quality; and he feels injustice that how such a great man as himself can live such a miserable life and so he decides to prove that he deserves more.",
                                            "score": 5,
                                            "author": "Iamboringaf",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Great explanation.  Thank you!",
                                                    "score": 2,
                                                    "author": "x_lincoln_x"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Haha I never considered that. But I just looked it up: “derived from 12th century Old French rascaille (“outcast, rabble”) (modern French racaille), perhaps from rasque (“mud, filth, scab, dregs”), from Vulgar Latin *rasicō (“to scrape”).",
                                            "score": 3,
                                            "author": "Timely-Huckleberry73",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I figured it was a very slim chance Dostoevsky penned that word.  Until I learn otherwise, I'll believe he chose to name the main character rascal intentionally to mean something akin to \"outcast, rabble\".",
                                                    "score": 2,
                                                    "author": "x_lincoln_x",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Haha I am skeptical but it is certainly fitting!",
                                                            "score": 2,
                                                            "author": "Timely-Huckleberry73",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Great theories haha! I believe this article will answer your questions : \n\nhttps://en.m.wikipedia.org/wiki/Old_Believers",
                                                                    "score": 1,
                                                                    "author": "cryptographic-panini"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "No, the pawnbroker he killed was not random, she was perceived as a deserving victim... the validity of that is debatable.  He also kills her niece who happens to show up unexpectedly... forgive me if I'm misremembering that aspect, it's been 25 years since I've read C&amp;P.  That has all sorts of other implications.  Is it permissible to kill tyrants? What moral framework are we operating in?  This is where Nietzsche enters into the discussion. This is all very complicated and it's why Dostoevsky is so great.",
                            "score": 6,
                            "author": "planesflyfast",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I meant random in that her death would be overlooked as in she isn't famous or well-connected.",
                                    "score": 2,
                                    "author": "x_lincoln_x"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I read crime and punishment and now 40% through Brothers Karamazov. CAP was one of my all time favourite books, absolutely loved it. Brothers Karamazov, I find, is a very different kind of book. You still get the detailed examination of characters but it is far more diverse. Whilst in CAP you only really get fully immersed in Razkolnikov, in BK there are 4-5 'main characters' all of whom are completely different. \n\nI started reading it probably about a month ago now and didn't realise at the time what I was getting into. It is incredibly heavy and at times a difficult read. This, for me, has likely been accentuated by the fact that I'm currently in the middle of my final school exams, which, in hindsight, was not the best timing to read such a difficult book. I finish my study every evening at around 9 30, exhausted, only to have to take on this behemoth of a book. But I love it. Its an incredible book. I have the feeling that it is one of those books that I will finish and almost immediately read it again. Especially since I've likely overlooked a lot of the hidden details since I'm practically brain dead while reading. \n\nI'd recommend to read it quite slowly. It's not a book you can skim over or rush through. Quite a few times I've had to re-read chapters in order to fully grasp whats being said, and even then I'm often still lost. Hope you enjoy it as much as I am.",
            "score": 3,
            "author": "killiancurran",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just started today! Looking forward to it. Thoroughly enjoyed crime and punishment and you made me excited for this one as well.",
                    "score": 1,
                    "author": "mistyblue_lilactoo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The Brothers Karamazov is my favorite book of all time, but Crime and Punishment is basically the reason I found Christ. Both excellent books.",
            "score": 5,
            "author": "Cheddarface",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;the reason I found Christ\n\nWhere was he hiding?",
                    "score": 4,
                    "author": "kombatunit"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Still my all-time favourite.",
            "score": 2,
            "author": "jm626"
        },
        {
            "level": 0,
            "comment": "I have a special love for the Doestoevsky books, and most of his novels I read had I great impression on me. \n\n+ I’m happy that I’m able to read his books in the original language, because his use of language is as much amazing as his books plots",
            "score": 2,
            "author": "Rakchnmvox"
        },
        {
            "level": 0,
            "comment": "The horse dream is one of my favorite (if disturbing) parts of any novel.",
            "score": 2,
            "author": "AsymptoticSpatula"
        },
        {
            "level": 0,
            "comment": "After I read In Search of Lost Time Im going to Brothers Karamazov",
            "score": 2,
            "author": "vpons89"
        },
        {
            "level": 0,
            "comment": "One of my favorite books of all times. I’ve read it at least 4 times!",
            "score": 2,
            "author": "need2bsober"
        },
        {
            "level": 0,
            "comment": "I read it in high school and remember it being a blah blah russian bullshit thing then ooh slow burning  build that escalated incredibly. It got me sweating and riled. I should probably read it again as an adult!",
            "score": 2,
            "author": "lord-southpaw"
        }
    ]
}