{
    "id": "146mqyb",
    "score": 45,
    "title": "Did reading suddenly \"click\" for you?",
    "author": "lainetherobot",
    "date": 1686465819.0,
    "url": "https://www.reddit.com/r/books/comments/146mqyb",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey all.\n\nLike the title says, I'm curious if you hit a point in your life when reading suddenly \"clicked\" for you. On the other hand, did your love of reading happen gradually?\n\nI'll be honest: I'm 21, taking a gap year, and I didn't start reading for fun until a few days ago (which I'm pretty upset about). Sure, I read a decent amount during school, but none of it was \"pleasure reading\" for me. I'm working my way through Crime and Punishment right now and I absolutely LOVE it. At first, I was sort of forcing my way through it, but then, I got totally engrossed in its psychology of the main character and the symbolism to the point where I was absorbed in it. It was really amazing to finally understand the joy of reading, even though it happened so late!\n\nSo, anyways, how did it happen for you?",
    "comments": [
        {
            "level": 0,
            "comment": "Probably since I was a baby. I loved my parents reading to me and when I turned six and learned to read I started reading by myself nonstop",
            "score": 14,
            "author": "MorriganJade"
        },
        {
            "level": 0,
            "comment": "I’ll give you 2 diff experiences:\n\n\nMe: I got into reading as a kid in 5th grade reading all the goosebump books..read like crazy for a while and of course Harrry Potter helped. Then academic books kind of killed reading for me from age 20 to about 26. Then I read a book or 2 a year. Didn’t get back into reading until 2 years ago in my 30s when I started getting recommendations from my sister and a friend and we are reading buddies that talk about reading all the time. \nIt’s really a great hobby once you’re really into it. For me, as an adult, it clicked when I bought a Kindle in 2021 and was able to check out books through Libby. I’m not spending money to buy books and figure out which ones I love. \n\nMy sister: hates reading, hated books, tried reading and would put it down after 5 pages bc it’s not “her thing”. Late 20s, I recommended a book to her and we started a book club with some friends and she wanted to be a part of it so she just tried reading.\n\nThat book (The Last time I lied by Riley Sager) is what clicked for her. Since then she’s been reading and she actually reads more than me. It’s been 2 years and it’s fun to talk to her and get recommendations from each other and talk about how stupid some characters are and stuff.\n\nBased on my sister’s experience, I would say it’s about finding your niche. In the past I’ve tried to read the classics and stuff that ppl say are “must reads” and it made me hate reading. It’s about finding your genre, exploring other genres when you feel comfortable, go at your own pace, challenge yourself to x amount of time or x amount of books if you want, find people or join book clubs locally to get a community out of it.\n\nIt’s a hobby that’s completely yours—it’s your world and your mind that creates the worlds you read about.",
            "score": 11,
            "author": "cricoidpressure25"
        },
        {
            "level": 0,
            "comment": "Yes, clicked. I could not read well, this in the many decades be there was a name for the problem. My mom, an avid reader, despaired. Then I discovered Dr. Doolittle and Nancy Drew. I cured myself, mostly, and I have read a good many books in the ensuing sixty plus years. Just finished another one a few minutes ago.",
            "score": 7,
            "author": "shillyshally"
        },
        {
            "level": 0,
            "comment": "For me it was a gradual growth. My interest in reading became more and more serious over time, in both the desire to read and in content.  I can look back and see a lot of missed opportunities but I’m also happy with where I’m at today.   And if you’re reading Dostoevsky at 21 you have me beat by about a decade, so enjoy, it’s certainly a wonderful pastime.",
            "score": 5,
            "author": "BinstonBirchill"
        },
        {
            "level": 0,
            "comment": "When I turned 30. Up until then I read probably 5-10 biography/history books. I had an existential crisis that led to me to religion/spirituality books, but the big breakthrough was fiction. I always thought I could get my fiction through tv and film, but working my way through the classics, short stories, and now even poetry. History should taken in like a work of fiction but I digress. The world is full of great minds that have left behind absolute treasures. It’s a shame when we ignore them or shut off because they might seem dated or inaccessible. There is plenty of commentary that can help these days. Once it clicks, it is a joy for life.",
            "score": 5,
            "author": "Kingspark2",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;The world is full of great minds that have left behind absolute treasures. \n\nSuch beautiful phrasing.",
                    "score": 5,
                    "author": "MarshmallowRhubarb"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes, reading suddenly \"clicked\" for me when I started the 9th grade (almost 6 years ago). I tried reading a few books before then, but I just couldn't read more than one or two chapters. But when I started the 9th grade our Romanian teacher told us to write a short recommendation for our favourite book and I realised I didn't have one and for some reason I felt kind of bad about that. That was the day I decided I would find a favourite book and soon after that I finished my first full novel. I suddenly started to enjoy books and reading bacame my hobby. I don't know what changed in my brain that day, but I am grateful that my teacher gave me the push I needed to start reading. 😆",
            "score": 3,
            "author": "Wonderful-Elk5080"
        },
        {
            "level": 0,
            "comment": "Last year I read 2 books. So far this year I’ve read 43.  It clicked.",
            "score": 3,
            "author": "Due_Advertising8837"
        },
        {
            "level": 0,
            "comment": "I read a lot, fror when I was a kid. But reading literature, specifically, clicked for me when I read LOLITA. I was 30 years old, and realized the difference between “literature” and “fiction.” \n\nThat was never taught to me in school. We just learned that there were two kinds of books, “fiction” (made up), and “non-fiction” (true/factual). Boy, was that ever an over-simplification!",
            "score": 3,
            "author": "BitterStatus9"
        },
        {
            "level": 0,
            "comment": "It was just a natural thing for me, from a very young age.",
            "score": 5,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I was an early reader...5 books each week from the Library.  It was my 1st experience in going off by myself . Making my own selections helped in my development, as well.\nI thank God for my book hunger.  It has changed my life and made me a broader thinking person!",
            "score": 2,
            "author": "rockyblue15"
        },
        {
            "level": 0,
            "comment": "I've always loved reading. I come from a family of readers so I grew up surrounded and fascinated books.  Working 40 hours has made reading somewhat difficult but I do try to make an effort to get some reading in.  I cannot imagine what would happen if I were ever to lose the ability to read. That would be devastating.",
            "score": 2,
            "author": "bookworm519"
        },
        {
            "level": 0,
            "comment": "Click it did. I was always an avid, yet casual reader and, a few years ago, were in a bit of a slump until i have started Grapes Of Wrath. Ever since then there was no stopping me",
            "score": 2,
            "author": "elmo1611"
        },
        {
            "level": 0,
            "comment": "Someday you'll realize that 21 years old doesn't count as late.\n\nI have loved reading from day 1, but around 21 is when I started loving more literary fiction and classics. Up until then I was almost exclusively a genre reader, give or take a few classics. That was basically the YA of 25-30 years ago, SFF and cozy mysteries.",
            "score": 2,
            "author": "smtae"
        },
        {
            "level": 0,
            "comment": "When I was a youngen I had a hard time reading. My parents and school tried a lot of things to get me to read. It wasn't until my 4th grade teacher, Mrs. Rosenthal, got her hands on me. She saw my potential and intelligence and pushed me to work at my studies and reading. She accepted no excuses from me and ensured I grew as a person. That year the book fair came through and my parents encouraged me to pick something I was interested in. I found a book on Greek gods and goddesses and I fell in love with reading. I still have that book on my shelf, and I'm in my 30's. Now I love to read. All thanks to that book and Mrs. Rosenthal.",
            "score": 2,
            "author": "ok_chaos42"
        },
        {
            "level": 0,
            "comment": "I used to love reading when I was younger, but I quickly ran the well dry when it came to the horror selection in the school library. I then changed schools and my new one barely even had a library, and the local city library was closed for the foreseeable future. Those two roadblocks led me to stop reading. I still read comics and manga but that was about it. It wasn't until late summer of last year that I fell down the rabbit hole of disturbing and transgressive literature. I quickly became enamoured with the genre and I've been reading pretty consistently since.",
            "score": 2,
            "author": "mfkr9"
        },
        {
            "level": 0,
            "comment": "When I read “The Good Earth “ on a whim. WOW I was blown away. Character development, emotion and impeccable storytelling. I want more, more, more.",
            "score": 1,
            "author": "bgb372"
        },
        {
            "level": 0,
            "comment": "My parents convinced me to go to my first day of school by promising me that would learn to read\\* my storybooks myself… never stopped.\n\n\\*I *was* annoyed that this was not fully accomplished on that first day &amp; argued with the teacher when told to leave the Reading Circle so the next batch could read the first page (with 3 words on it!).",
            "score": 1,
            "author": "Gloomy-Lady"
        },
        {
            "level": 0,
            "comment": "I just remember being 9 and on winter holiday with my grandparents. We went to a library and they bought me a book. I can't remember which book it was, but it was from a collection issued in my country, with red covers, for children. that hooked me on reading. I read the stories of Sissi, empress of Austria and re read them many times. I got a lot of books from that collection, including Little women and other famous books. I remember having short stories books that I read and re read. I re read soo much when I was little.\n\nWhen I was a teenager a friend introduced me to Sidney Sheldon. we use to lend books to ech other, my friends and I. and I re read a lot. \n\nNowadays I read in english on my kindle, so I dont borrow books from my friends and I practically don't re read at all.",
            "score": 1,
            "author": "lagrime_mie"
        },
        {
            "level": 0,
            "comment": "Crime and Punishment was the first book that really made me feel like I was reading. It felt epic from the very first page. I've always loved reading but C&amp;P is the book that inspired me to read more difficult books.",
            "score": 1,
            "author": "iverybadatnames"
        },
        {
            "level": 0,
            "comment": "I've been reading for too long to remember if I never liked reading. Although I do remember reading and re-reading only one book at school and eventually I began bringing in my own. It was around the same time that I discovered Doctor Who so I have to conclude that the two events are linked.",
            "score": 1,
            "author": "PeterchuMC"
        },
        {
            "level": 0,
            "comment": "It clicked on for me in third grade! My teacher was reading us Where the Red Fern Grows, I loved it and I got impatient with waiting so I checked it out from the library.... I read it all in a day and never looked back avid reader for life!",
            "score": 1,
            "author": "MusclesAndCharisma"
        },
        {
            "level": 0,
            "comment": "Click! From the very first kiddie comic I was able to read all by myself. I remember a giddying feeling of triumph, independence and new worlds opening up. Everything was new and interesting, and I devoured pretty much anything I could get my hands on :).\n\nAs an adult reading for pleasure has been an on again/off again thing. When stressed out I don't read at all, but pick it up again when I'm feeling more balanced.",
            "score": 1,
            "author": "ImmanentCat"
        },
        {
            "level": 0,
            "comment": "It “clicked” for me a couple years ago when I stopped forcing myself to read stuff I didn’t truly enjoy. And the more I read, the more I understand what I like, which encourages me to read even more.",
            "score": 1,
            "author": "sflo97"
        },
        {
            "level": 0,
            "comment": "Yep, it clicked for me in kindergarten when I learned to read. I was immediately smitten.",
            "score": 1,
            "author": "NeilOffTheYoungOnes"
        },
        {
            "level": 0,
            "comment": "\"Hand, hand, fingers, thumb.\"  \n\nI wanted to be able to read when I was about 4.  I remember almost being able to read.  That was the book that I was always practicing on.  I remember wondering if I was reading, or if I just had it memorized.  I remember the words and how I would recognize the shapes but I wasn't quite able to wrap my head around reading the shapes.\n\nThen, a couple months into Kindergarten it clicked and I could read.  After that, it was smooth sailing.  \n\nNow a lot of that really came from being read to a lot when I was a kid.  My grandma always read Jack London books to me, or Alice in Wonderland, Sherlock Holmes stories, that sort of thing.  I listened to books on tape/record all the time too.  I remember being really freaked out by the record of \"The Gold-bug.\" by Edgar Allen Poe.  I don't know why that one scared me, but it did.  It must have been the voice talent.\n\nNow my friend who's family was less into reading, as in no reading at all, never could read well until about 6th grade.  He started reading romance novels just because they were easy reads and that really helped him become able to read at his grade level. From then on, he read all the time.\n\nI think a love of reading comes from starting very early.  You can acquire it later in life, but it's harder to start.",
            "score": 1,
            "author": "mostlygray"
        },
        {
            "level": 0,
            "comment": "My parents read to me from the day I was born. I can't imagine life without books.",
            "score": 1,
            "author": "Trick-Two497"
        },
        {
            "level": 0,
            "comment": "I developed my reading habit gradually but even now there were days when i don't feel like reading anything but again after a period i get \"click\" to restart reading....i think it's totally okay to do so but am trying to build the habit of reading everyday",
            "score": 1,
            "author": "Sea_Discipline6361"
        },
        {
            "level": 0,
            "comment": "Yes, I was four.",
            "score": 1,
            "author": "nobody-yesbuddy"
        },
        {
            "level": 0,
            "comment": "I'm 28 and it's only recently clicked for me since getting a library card. Now I've got a plethora of free books at my disposal!",
            "score": 1,
            "author": "pilapalacrafts"
        },
        {
            "level": 0,
            "comment": "LOL no! What finally 'clicked' is I just had to re-read the same page for 20min to kill my monkey brain before I can start to actually read. For school/work reading we jump/scan/inhale, but long-form reading needed a different skill.",
            "score": 1,
            "author": "Sabots"
        },
        {
            "level": 0,
            "comment": "Sometime before I remember. When I was really little I loved picture books. When I got a bit older I loved Bruce Coville's books. A bit older than that and I went on to Jane Yolen and Patricia C. Wrede. By 7th grade I moved into the Adult section of the library (at the time YA didn't really exist, other than \"Little Women\", \"Go Ask Alice\", and the trauma porn of Cynthia Voight and Lurlene McDaniel). So fantasy led to Alan Dean Foster, Anne McCaffrey, and Robert Aspirin.",
            "score": 1,
            "author": "Express_Barnacle_174"
        }
    ]
}