{
    "id": "axym8m",
    "score": 61227,
    "title": "Textbook costs have risen nearly 1000% since the 70's",
    "author": "teafortat",
    "date": 1551877584.0,
    "url": "https://www.reddit.com/r/books/comments/axym8m",
    "media_urls": [
        "https://www.vox.com/the-goods/2019/3/6/18252322/college-textbooks-cost-expensive-pearson-cengage-mcgraw-hill"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "So has tuition.  In the late 60s my father was able to pay for an entire semester with only the money he saved from a summer job.\n\nEDIT:  Alot of people saying this is still possible if you work full time in summer and save every dime.  Theoretically yes you could pay tuition alone with that.  My dad lived alone, bought his own mercury Cougar, and still paid for his first semester of college every year.  Books and everything included.  Grandparents paid for the spring semester, that was their deal.",
            "score": 3727,
            "author": "mikedeich",
            "replies": [
                {
                    "level": 1,
                    "comment": "It always saddens me to read about higher education being so expensive in the US. Doesn’t it discourage people from going to university?\n\nEdit: It’s very interesting to read everyone’s stories. From what I’m gathering, a lot of people feel discouraged because they don’t want a lifetime of debt, yet many of them feel the need to take out loans anyway because having a degree seems like the only way to get a job. ",
                    "score": 1616,
                    "author": "jaisies",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Not really because it's relatively easy to get expensive public and private loans to pay huge tuition bills. Then it encourages students to go into deep debt. ",
                            "score": 1617,
                            "author": "lovemeinthemoment",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "On top of that, the loans are often federally guaranteed so they have nothing to lose and can freely inflate cost.",
                                    "score": 894,
                                    "author": "ShotgunMage",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I tried to explain this to my mother when she wondered aloud as to why tuition has exploded in cost. She just said, \"no that's ridiculous.\" This woman has a masters degree in education. ",
                                            "score": 636,
                                            "author": "LowOnPaint",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I obviously don't know your mom, and this is not an insult at all, but she might be too optimistic to understand bitter realities and less influenced by what she may perceive as \"cynicism.\" As a millennial, I've seen this in older people (55+) who couldn't fathom how and why a school would charge so much for tuition.\n\nA guy (~70) in my old neighborhood was from a small town and did most of his studies at a smaller college in the south back in the late 1960s. He said that a semester's tuition was, I shit you not, $75.",
                                                    "score": 533,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm a millennial and I can't fathom how expensive college has become.\n\nThe article says that the cost of university schooling has increased by 63% since 2006?? It was already outrageous in 2006!",
                                                            "score": 100,
                                                            "author": "kenlubin",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yes it boggles my mind that more people don't see this as the crisis it is, and that blame is still applied to the \"whining millennials\" that simply don't want to pay for college. A lot of people point at the the 60s, 70s, and to a less extent the 80s as times when you could \"work a summer job and pay for college\". But that was still kind of true even through the early 90s. When I entered the college scene in 1993 a semester of tuition at most state schools was around $1400-1600. That was still manageable for most kids if they really tried. Today? No way anyone is paying their way through a 4 year education.",
                                                                    "score": 82,
                                                                    "author": "SuperKato1K",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;too optimistic to understand bitter realities\n\nOh she absolutely is. She sees the world through rose tinted glasses especially when in comes to education. The idea that an educational institution might have profits in mind and not necessarily the best interests of it's students is unfathomable to her. In her mind the education systems are staffed only by the most moral and upstanding people even though she worked in public school administration and saw on a daily basis that this was not the case to the point she retired early to escape it. The cognitive dissonance is strong with her. Don't even get me started on her political views because they're even more insane.  ",
                                                            "score": 316,
                                                            "author": "LowOnPaint",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It would be a lot nicer it they favored students over profits. I enlisted in the national guard just to be able to cover the costs of school. I was still having to pay out of pocket for some expenses and finally decided to switch to a cheaper school. As soon as I did that and told my advisor I was leaving due to the insane price of tuition, the school cut the price of tuition in half for military.... And it's still more expensive than the school I transferred too 😂",
                                                                    "score": 99,
                                                                    "author": "Piscis_Volans",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I attended a junior college in the early 80’s and paid $10 a semester hour. My second year went to $12 and hour. I went on to a private college my third year to the tune of $50 an hour.  In junior college my books could cost almost as much as tuition.   Those were the good ole days. I have put my three kids through college and my how college had changed. ",
                                                            "score": 23,
                                                            "author": "mlmfwb",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "It’s along the same thinking of “Well why don’t you just go out there, pull yourself up by your boot straps and get a job!”. People in the older generations are either in denial or just don’t know that the world is a much more complicated place now. \n\nTuition costs a lot more, minimum wage is nowhere near liveable, the cost of living has gone up too and finding a job isn’t as straightforward either. \n\nI’ve tried explaining to my parents how you can’t just walk into a business and physically hand them a resume and then expect a job because you showed “initiative”. If you try that in the world now you typically get a response of “please go on our website/job portal and fill out the form”. ",
                                                            "score": 49,
                                                            "author": "OutoflurkintoLight",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Career fairs were like that for me. Networking doesn't get you very far when they direct you to a Taleo portal to fill out an application. Unless you can get their business email and you're speaking to someone in that field instead of their HR. ",
                                                                    "score": 19,
                                                                    "author": "QueefyMcQueefFace"
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "My favorite is, \"Make sure you follow up with them.\" Follow up with who? I applied to a website. No name, much less email or phone number. Even if there's some generic HR email address buried somewhere in the corporate site, there's no guarantee it'll even get to someone in the same state as the office I'm applying to.",
                                                                    "score": 31,
                                                                    "author": "ninjuh1124"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "The quickest solution would be to cap the amount of money a student can take in loans every year and still have it federally guaranteed.\n\nAs of right now there is no limit. The cost per year at my old school is reaching 70k this year. They will not stop pushing that higher and higher as long as there is nothing stopping irresponsible 18 year olds from borrowing as much money as they want.\n\nWithin 15 years a Bachelor's Degree will cost nearly half a million dollars.",
                                                            "score": 82,
                                                            "author": "Try_Another_NO",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "These loans are the entire reason books and tuition are so expensive.  It's made universities unaccountable to the market forces that are *supposed* to keep prices down.",
                                    "score": 111,
                                    "author": "Deathwedgie",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I agree with you 100%. I often tell people that a semester long Intro to French course at an expensive private college costs you much more per hour than if you took private one-on-one lessons from the very same instructor. ",
                                            "score": 61,
                                            "author": "lovemeinthemoment",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 47,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "And that's the rub.",
                                                            "score": 21,
                                                            "author": "SilverMedal4Life",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 78,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For a future phd, I would say prestige matters for the connections and lab funding, but for nursing that matters way less. Def look into board exam pass rates.",
                                    "score": 33,
                                    "author": "Kkoifishies"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There are a lot of studies that suggest the increase in gov't aid has lead to the rise in tuition and related costs.  Guaranteed revenue for the colleges means they can and have jacked up the prices. ",
                            "score": 115,
                            "author": "DarthRusty",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No one talks about reduced state funding, which also correlates to higher tuition. \n\nhttps://www.acenet.edu/the-presidency/columns-and-features/Pages/state-funding-a-race-to-the-bottom.aspx?fbclid=IwAR20mkqWRLP7C3Gx299cKHNK-qtTsu6HYo2IyfZ0vKXQQ2FpXqm0tNvoJv0\n\nAlso, minimum wage jobs, when adjusted for inflation and cost of living, had a lot more buying power so you *could* work your way through school.\n\nIt's a perfect storm of fuckery and students are the one bearing the brunt. We *need* student finance reform *now!*\n\nedit: added link",
                                    "score": 141,
                                    "author": "rhythmjones",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, now you can work your way through school AND come out with tons of debt.  What a college experience!!!!",
                                            "score": 66,
                                            "author": "Midwake",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No one *ever* talks about how kids shouldn't be working through school because they should be, you know, FOCUSING ON SCHOOL!",
                                                    "score": 82,
                                                    "author": "rhythmjones",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "yeah as someone who made mistakes and had to come back to school for round 2 while still making sure i make rent and utilities, shits rough yo. ",
                                                            "score": 38,
                                                            "author": "blackgandalff",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "In the same boat and everyday is like a living nightmare where I not only have to continue learning and paying for it, but also paying rent and everything along with it.  Oh and working fulltime.  \n\n\nBut hey, I learned a good life lesson right?  Every college institution cares only about milking you dry.  Everything is geared towards you paying more money for even the most basic services.  ",
                                                                    "score": 36,
                                                                    "author": "In0nsistentGentleman",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Excactly.",
                            "score": 21,
                            "author": "Jahoan"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In the early 70s, I  went to a state university and paid for most of my school expenses (tuition, dorm and food) from my summer job.  At this school you paid $10 to rent textbooks.  This was for the entire time you attended that school whether for one semester or four years.  And  you got that $10 back when you left.\nWhy are we doing this to young people?  It just isn't right to them to incur horrendous debt to get an education.",
                    "score": 191,
                    "author": "bincyvoss",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Parking passes can often be $200+... PER semester ",
                            "score": 142,
                            "author": "booklovingrunner",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": " $400 per semester at my school, $800 annually",
                                    "score": 88,
                                    "author": "TheBookWyrm",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And only for lot B and F.. God forbid you want to park next to the library sometimes. \n\nAll of our parking lots were filled with foreign exchange students' fancy cars. Pretty funny seeing a 19 year old pull up in a Maserati.",
                                            "score": 46,
                                            "author": "flyingtrashcan",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I saw a Lambo truck the parking garage of my ~5000 student state school satellite campus. And I just watched a Porsche 911 rear end a shitty Trailblazer the other day. Rich Chinese exchange students are pretty entertaining, except when they're giving each other test answers in their own language at the back of the class lol",
                                                    "score": 22,
                                                    "author": "BHOmber",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 14,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I commend you for recognizing the advantages you had. Many in your age group look down on us younger people as if they somehow forgot that. My Dad paid his way through college by working weekends and summers at McDonald's... Im sure that would be impossible now. ",
                            "score": 27,
                            "author": "FerrisMcFly",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "“Because fuck you got mine”- said by 99% of all boomers while pulling up the ladders.",
                            "score": 107,
                            "author": "Thewalrus515",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Jokes on them, i can't afford to pay for your retirement home, because i'm poor! ",
                                    "score": 42,
                                    "author": "Venken"
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm a boomer and I agree with you.  Your anger is justified.",
                                    "score": 31,
                                    "author": "bincyvoss"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "That was a big fight I had with my dad when I transferred to a 4 year.  I managed to finish my work at a community college by paying out of pocket, but I knew I had to take out loans for my last 2 years.  My dad screamed at me endlessly, saying if I hadn't wasted my money on this or that, I wouldn't have to get any loans, that he saved his money and spent it wisely and was able to graduate (in the 80s) from the same school I was going to completely debt free.  Finally I asked him how much he had to pay.  He said a semester was $300, including textbooks.  I showed him tuition now was over $3500/semester, not including books or parking.  He left me alone about it after that.",
                    "score": 92,
                    "author": "littletrashgoblin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "$3500 a semester is a fucking steal. Where is this? ",
                            "score": 51,
                            "author": "Axios911",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "CSU Stanislaus.  As far as universities go, def one of the best values in the area",
                                    "score": 18,
                                    "author": "littletrashgoblin",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I went there. When I started tuition was $1,800/semester. In the short 3 years I attended tuition shot up to $3,200. Parking also trippled in price and they closed down any  \"free\" parking surrounding the university. \n\nThis major price hike was happening in the middle of the recession. On top of all that classes were being cut like crazy so I wasn't actually able to get into the classes I needed to graduate. I eventually dropped out because I was paying out of pocket and couldn't afford paying so much money for classes that were getting me no where. ",
                                            "score": 23,
                                            "author": "HopBender",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Some of the successful people in my family chastise me for this. They say that oh at 17 I moved out and was able to live on their part time job while paying for college. I just want to reply, \"back when you were 17 rent was probably 1/3 of what it is now, and tuition was probably 10x less than what it was.\" But then they'd find a way to try to make my statement false so I don't reply.",
                            "score": 11,
                            "author": "Dbss11",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hey now, I had friends that paid their way though school with their part time job.\n\n&amp;#x200B;\n\nI mean they sold drugs, but still.  What else pays?",
                    "score": 61,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "but but millenials are so entitled with their avocados and 6 dollar per hour jobs. in the 50´s i only earned 5,50 dollars!",
                    "score": 97,
                    "author": "MoustacheAmbassadeur",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Was probably a summer job where he made a nickel each day too.  Now our summer jobs pay us just enough to have a tank of gas to get to classes for the month ",
                    "score": 32,
                    "author": "Bobafett79",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Textbook piracy up 1000% as well, for me anyway.\n\n&amp;#x200B;\n\nI've seen quite a shift at the local university over the years. I would say an assigned textbook for a course is now becoming a minority as prices have gotten ludicrous. Profs are aware of it more and more, they just assign free versions or get the library to stock more copies.\n\nEdit: up 10000% reading the BS a lot of people have to put up with. I swear it's time for some of you to mobilize and find new fangled ways to game the purposefully rigged system instead of just taking it. It's hard, I know.\n\nEdit2: To the folks asking for help with piracy, no that's against Rule 6 of the sub. Those homework access code situations aside, you often *don't even need the textbook even if it's \"required\"*, so there's always just not buying it at all in many cases.",
            "score": 3673,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "My grad school has a google drive filled with PDFs that has been passed down through the years to the incoming class.",
                    "score": 240,
                    "author": "dabilge",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's some Doing God's Work right there.",
                            "score": 103,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Ha! Undergrad here. In my case, someone removed the entire drive files like a couple of weeks ago during the exam period (that includes past notes/exams). Luckily, some people backed up the files and re-shared it (lucky us)!",
                            "score": 24,
                            "author": "UnsungKhla"
                        },
                        {
                            "level": 2,
                            "comment": "In most of my MBA classes they don't even use a textbook anymore, they just give articles or cases to read and course notes.",
                            "score": 29,
                            "author": "Juergenator",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "My grad school made instructors include an open source textbook on the syllabus ",
                            "score": 13,
                            "author": "420everytime"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Piracy isn't even a valid option in a lot of cases anymore, as many classes require an access code to use the online homework or whatever. That access code can only be used once.",
                    "score": 1709,
                    "author": "Totallynotatimelord",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You know why?  Those textbook companies make the online homework absolutely ridiculously easy for the profs.  I taught a semester at a community college and inherited the book/syllabus because I was hired at the last minute (previous guy got a real job a few weeks before class started).  All I had to do to assign homework was flip through the website and click the boxes of the problems I wanted to assign.  A week later I go back and copy/paste grades into my gradebook.  Utterly ridiculously easy and I can believe that a lot of professors will happily let each student get reamed for $50/class to make their life simpler.  They could charge $200/student and plenty of profs would still do it.  \n\n\nPersonally it was all a big shock as someone who went through college before online homework was a thing.  We used to contact our profs for the next semester at the end of the previous one, then buy the textbook cheap in the \"used\" section of Amazon (back when they just did books).  I probably never spent more than $150 per semester on textbooks after my freshman year.",
                            "score": 272,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 164,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "True, but honestly there's no such thing as an original problem in freshman level courses anyway.  Even if you can't find the exact question, you can find one awfully close with an explanation.\n\nMy philosophy was always that homework is mostly for learning and I really don't care if you work together, look it up, etc.  Do whatever works for you.  Tests are where you show your knowledge and where most of your grade comes from.",
                                            "score": 101,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If the student looks up a similar problem, reads the explanation, then applies that to his homework, pretty sure he has learned the topic anyway.",
                                                    "score": 50,
                                                    "author": "goodoldgrim"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "MyMathLab. *enraged flashbacks*",
                            "score": 178,
                            "author": "PanOfCakes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh, you did your problem correctly but you didn't code it exactly the right way for the software to understand?  \n\n&amp;#x200B;\n\nNo points for you.",
                                    "score": 139,
                                    "author": "LookingforBruceLee",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don't understand how a program like that can be so successful with such shitty syntax recognition. It wasn't fucking merit based that's for sure. ",
                                            "score": 65,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Who needs accuracy when you have all these juicy contracts from schools that are contracting out the work they are already overpaid to perform?",
                                                    "score": 52,
                                                    "author": "LookingforBruceLee"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "a monopoly, thats how.",
                                                    "score": 14,
                                                    "author": "peerless_dad",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "MyMathLab: “Writing 3 x 11 huh? WRONG!!!”\n\n\nStudent: “Wtf? I’m sure I did that right. What was the answer then?”\n\nMyMathLab: “11 x 3”",
                                            "score": 58,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Don't even get me started about putting fractions in. You'd input 3/11 for instance  and it would be wrong.  Then you'd check the answer page and it would show the \"correct answer which would look exactly like you input it. Turns out you need to use the fraction button on the side bar for any answers that are fractions.\n\nTLDR: don't use a backslash for fractions use the fraction button on my math lab ",
                                                    "score": 33,
                                                    "author": "Eoho",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 17,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I have myMathLab, The economics version of it, and the accounting version of it. Each cost me 100+ each. These shitty programs can’t even recognize when I get the right answer because I haven’t worded it right. ",
                                    "score": 16,
                                    "author": "Shrumples1997"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That's very sad. I haven't encountered anything like that before.",
                            "score": 329,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I regularly spend $400+ on access codes a semester for school. And what’s worse is that the professors all use different companies so we can’t even utilize the “unlimited access” some of the companies offer. ",
                                    "score": 537,
                                    "author": "Sierradarocker",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Just in case you didn't already think the $120+ textbooks that you could at least resell/lend/share was a ripoff...",
                                            "score": 234,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes!! And even if they offer a physical textbook, it’s usually the loose leaf one that won’t be worth more than $5 at the end of each semester -.-",
                                                    "score": 183,
                                                    "author": "Sierradarocker",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "My $110 first year Math book was irrelevant at start of new year, since the new edition had arabic numbers rather than the roman numerals I had one edition before. \n\nPisses me off to this day.   \n\nEDIT: Roman numerals as page numbers. ",
                                                            "score": 109,
                                                            "author": "GreyMatter22",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Wait, are you saying that all the math was using Roman numerals? Or that the chapters/section numbers were labeled with them?",
                                                                    "score": 35,
                                                                    "author": "koopatuple",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I meant the page numbers only.",
                                                                            "score": 34,
                                                                            "author": "GreyMatter22",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "i still don't get it, is content same? How is it irrelevant then with new edition?",
                                                                                    "score": 19,
                                                                                    "author": "StackKong",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I would give anything to see an all Roman numerals university-level math book lol",
                                                                            "score": 10,
                                                                            "author": "GoBuffaloes",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That’s insane.  I teach political science 101 and assign a textbook that’s available for free online.  College costs way too much as it is.  I’m not about to make 50 students each pay an extra $100 every semester.",
                                            "score": 85,
                                            "author": "PoliticalScienceGrad",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I’ve seen professors assign a *required* textbook that they wrote themselves. The American college system is quite literally insane. ",
                                                    "score": 88,
                                                    "author": "dinosbucket",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I had that once. The teacher had it printed locally. We could go to the printer and get it loose leaf for $10.  Spiraled was $15. Other options like hard back etc for more money.  Damn good thinking on that teachers part. ",
                                                            "score": 27,
                                                            "author": "Gorechi"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I see this incentive and (obvious) conflict. \n\nBut why the access codes for homework thing? Does the school get a kickback?\n\nI don’t even remember having that much “homework” outside of STEM classes. And even then, the the main parts of the grade were the midterm and final. ",
                                                            "score": 9,
                                                            "author": "NYCSPARKLE",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Because it forces you to buy something. It makes grading and tracking easier for the teacher than collecting everything and grading by hand, and it's also kinda convenient for students being able to just ctrl+f through a book and stuff.\n\nSome colleges had their professors leak that they were given incentives by the publishers to force books/access codes onto students for royalties. If the professors forces you to buy the $100 access code by only putting the homework online locked behind a website, they get told for every student they'll get 10% in pocket or something.\n\nAlso it's not just homework, but your tests and quizzes are sometimes on these websites too. So you quite literally will fail the class if you don't buy access. And they don't include it in the cost of the class :^)",
                                                                    "score": 27,
                                                                    "author": "huntrshado",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I’m in the business college at my school and it seems that this college has more required texts than many other colleges at my school. I’m lucky enough to have not had to buy a textbook for each of my classes this semester. ",
                                                    "score": 21,
                                                    "author": "Sierradarocker",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That's absolutely insane. Maybe a stupid question as I'm not American but how the hell are the students not in the streets protesting against this robbery? Your whole education system seems fucked up but is anyone actually standing up against it?",
                                            "score": 40,
                                            "author": "Yunhoralka",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "We have possibly the most docile middle class in the history of humanity ",
                                                    "score": 78,
                                                    "author": "ahappyhotdog",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I just can't imagine something like this in France, for example. They'd be out in the streets in a day.",
                                                            "score": 27,
                                                            "author": "Yunhoralka",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Nobody does anything because the country is f\\*\\*\\*\\*\\* in so many other ways, that everyone is too tired to do anything about it. Everyday we read stories about shady government s\\*\\*\\*, or shady corporation s\\*\\*\\* and it never seems to stop or  get fixed. Then when you do try and take a stance as someone under 40 they call you \"entitled\" and ignore all of your valid points.",
                                                                    "score": 40,
                                                                    "author": "SendPiePlz",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It is the internet you know you can swear.  \nThe callign you entitled and dismissing points is a thing that happens everywhere where people who are generations behind the general public in age( in my country parlament is on average 71.8 years old the average age in the country is just over 44). Most idiots in the goverment dont understand things like technology/fair living conditions/ fucking price inflation or htey pretend not to for a large enough paycheque from a lobbyist/s",
                                                                            "score": 15,
                                                                            "author": "[deleted]"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Here in the US, protests yield zero results, zero change. If we take time off to GOP protest, we risk losing our job or missing a class and being punished. So knowing there is all risk and zero reward, what's the point? ",
                                                                    "score": 23,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I didn't know that, that's really horrible. Can it even still be called democracy if the people can't let their voices be heard?",
                                                                            "score": 9,
                                                                            "author": "Yunhoralka",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 22,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "The idea that you have to pay another company to do homework is just absurd in itself.",
                                                    "score": 42,
                                                    "author": "Minenash_"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "What happens if you don't have the money to buy access codes and then can't do the homework? Do you get an F?",
                                                    "score": 17,
                                                    "author": "C00kiz",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah. ",
                                                            "score": 17,
                                                            "author": "SpanosIsBlackAjah"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeap, I got out of college a couple years ago now, and vividly remember having to pay $80 *on top of tuition* in order *to turn in my fucking homework and get graded for it*\n\n\n\nThe university system in this country is undeniably broken. Shattered. \n\nThey're ripping off our future generations in every way possible, and still manage to get a large part of the population to demonize the kids for getting into 100s of thousands of debt in order to get an education.\n\n\nShit's fucked, yo.",
                                    "score": 43,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Unfortunately it’s becoming more common. You buy the access code and most of the time can’t even access the book after the semester is over (if you buy the electronic version)",
                                    "score": 87,
                                    "author": "Totallynotatimelord",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Although it would be unlikely to help your own cohort, I feel like that's crossing a line where I would strongly consider organizing against it with whatever student political body your school has (if any...). In other words, riot, or game it in *some* other way. What bullshit.",
                                            "score": 66,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I doubt you'd be able to get through your freshman year at most big universities without encountering it nowadays. ",
                                    "score": 35,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This was common when I started University in 2006. I'm amazed there are people with degrees who haven't heard of this.",
                                            "score": 21,
                                            "author": "BensonBubbler",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Its a very american invention. ",
                                                    "score": 23,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "There's definitely a multi-tier system when it comes to quality of instruction in higher ed. Not a single person I know who went to an Ivy League college had to deal with those codes, but the kids I knew from the next-tier private schools and top public schools did. I took a look at some of the online homework assignments once and I died a little inside. Filling in numbers in a square isn't even close to what higher learning actually is...",
                                    "score": 51,
                                    "author": "YouHaveToGoHome",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don’t know if it’s a tier or prestige thing. I’m on the complete opposite side of the ivy system, currently in grad school at a public commuter school.   Can’t get more basic.  So far none of my professors have used codes or new text books.  I even had one post PDFs of older textbooks to use for the class.  ",
                                            "score": 32,
                                            "author": "directrix688",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah I went to community college and basically all of my professors said “fuck this, we know you’re poor” and just handed out printed copies of the pages we needed. I think I bought a book twice in the twenty or so courses I had, along w/ the occasional $30 lab manual that was course-specific. Never had to deal with any codes or online BS. Thank god. ",
                                                    "score": 24,
                                                    "author": "Turgurd",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Community college is awesome.  One of the best decision of my life was to save the cash, and go to a community college for the first two years of my university education.  Way cheaper, still a good education if you apply  yourself.",
                                                            "score": 15,
                                                            "author": "madrury83",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Seems to be a bell curve. ",
                                                            "score": 8,
                                                            "author": "Jenaxu"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I honestly think No Child Left Behind and standardize tests tainted higher education and turned them into publicly funded for profit centers. \n\n“If you want such and such funding, you need to make it on X list.” Kinda bullshit pushed state schools to becoming high school 2.0",
                                            "score": 47,
                                            "author": "Acevedo1992",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Federal guarantees of student loans is the big one.\n\n",
                                                    "score": 17,
                                                    "author": "[deleted]"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Went to an Ivy, definitely had to deal with those codes for language classes and some STEM (usually general level math or science).\n\nIt was especially annoying when a professor or department mandated that you had to have a physical copy as well as the online one and couldn't just use the online book.",
                                            "score": 14,
                                            "author": "Akitcougar",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I found an online pdf of one of my textbooks, but it doesn't have any of the images. It's an art history class. I had to cave and actually buy the book this past weekend.",
                            "score": 19,
                            "author": "huntingladders",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Exactly this. McGraw Hill, Pearson, and all these other textbook publishers push the benefits of the online textbook/homework platform hard, knowing that it eliminates the resale market. At least half of my classes require paying full price for an online textbook I never read just to access the homework for the course.",
                            "score": 20,
                            "author": "toominat3r"
                        },
                        {
                            "level": 2,
                            "comment": "And then the access code is 90% of the full value of book + code new",
                            "score": 13,
                            "author": "xsly_tendenciesx"
                        },
                        {
                            "level": 2,
                            "comment": "Not to mention people like myself with ADHD or other learning disabilities who have little to no comprehension when reading off of a screen and *need* to purchase hard copies.... or print the whole textbook which in most cases (for me at least) is just as expensive and takes hours",
                            "score": 28,
                            "author": "gorillaguerrilla",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Next up: \"millenials are destroying the textbook industry\". ",
                    "score": 41,
                    "author": "ragvamuffin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The textbook industry is destroying itself. Drive the price up to the point where people can't pay, and people stop paying the price.\n\nThat's economics 101.",
                            "score": 30,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Funny how most of the industries being destroyed by millennials are industries that aren't adapting.",
                                    "score": 6,
                                    "author": "elcarath",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "As a uni student (at a community college) about half the classes I’ve took you actually need the textbook/code. They’ll usually tell you to get it then never use it, or they’ll tell you you can find it free online. One of my teachers this semester even scanned it and put it on her website(probably illegal). ",
                    "score": 77,
                    "author": "McKayCraft",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep, I've witnessed a much smaller handful of profs pretty much break the law too, and just upload something like the PDF of the textbook itself. Good profs.",
                            "score": 59,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Then you have holier than thou students who turn in said teachers. Shitty we never could find out who did that or that book bag might have ended up in the local lake. ",
                                    "score": 45,
                                    "author": "born2bfi",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What a garbage student ugh. Probably bought the book before the class got started and got annoyed that the teacher did that.",
                                            "score": 36,
                                            "author": "McKayCraft"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; book\n\nThat's a weird way to spell body.",
                                            "score": 6,
                                            "author": "barrsftw"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I had a professor who wrote his own textbook but didn't actually care about the money from it. If you told him you couldn't afford his book he would print it out for you and put it in a binder. ",
                                    "score": 13,
                                    "author": "imadethisformyphone",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "My school started using OpenStax, which I love. Free digital versions &amp; $5 if you want an iPad version, which fits the screen better. Some teachers still don’t use it though",
                    "score": 15,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I was looking for an EPUB the other day, because I figured it'd be cheaper (and it was, it was about half the price), but found a PDF while I was looking.  \n\nDidn't end up buying the ebook. ",
                    "score": 40,
                    "author": "Aardvark_Man",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My sample size of one personal experience being at/working at a university for years and years is... over 95% of the time the textbook is irrelevant. Anything undergrad has tons of resources all over the Internet, profs assign books but rarely teach from them (they are often just supplemental), etc etc. What matters is going to the classes and doing the course work.\n\nSum all of that together, and then you look at the textbook prices for a four month course and it's like... You've gotta be fucking kidding me. I've usually pirated the textbook and more often than not it goes unused for the course anyway.\n\nNow, things can be a little different depending on the course/stream/degree. I have the STEM perspective. Things were different in the philosophy courses I took, *although* many of those were classic philosophy texts and you could Project Gutenberg for free.",
                            "score": 21,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not to mention you’ll get back $20 on $1000 if you sell em. ",
            "score": 640,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is why when I was in undergrad we had a book swap at the start of the semester in the chem department office. If you were taking biophysics and you'd already taken physical inorganic you'd just swap books with someone who needed physical inorganic - they're not exactly the same value, but it's a hell of a lot more than you'd get from the bookstore.\n\nToo bad the single use access codes have nixed that for a lot of departments..",
                    "score": 248,
                    "author": "dabilge",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah it’s pretty ridiculous with the single access codes... and “coincidently” more and more courses are requiring specific textbooks with online access which of course is the one time code that you can’t swap. ",
                            "score": 87,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That shit needs outlawed.",
                                    "score": 23,
                                    "author": "adamdoesmusic"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yeah, it's a racket. Glad I got in before the digital stuff became common, mine came with CDs rather than log ins so I was still able to resell them at the end of the term.\n\nIt was a joke anyway, given a list of 6 or 7 books in my first term and then the lecturers never referred to them once. After that I ended up just ignoring the lists and bought the Feynman Lectures insead, which carried me through the entire first 2 years of my degree without ever having to open another book.",
            "score": 1122,
            "author": "HobbsLane",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 380,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "My biophys professor wrote the textbook and she told us not to buy it because you could just download the PDF one \"free sample\" chapter at a time from her website",
                            "score": 313,
                            "author": "dabilge",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Damn. My professors wrote the books they required us to buy overpriced. ",
                                    "score": 207,
                                    "author": "i_says_things",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That sounds like it should be illegal...",
                                            "score": 131,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's pretty common sadly. ",
                                                    "score": 105,
                                                    "author": "VieElle",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "If it’s a traditional textbook, professors apparently get very little from sales. It’s a racket on all sides. ",
                                                    "score": 57,
                                                    "author": "K8Simone",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This. It's usually the publishers who set the price",
                                                            "score": 28,
                                                            "author": "Ewokitude"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I had a class on plasma where another prof had written a textbook on the topic. The current prof told us it was really not adapted to the class he gave, but it was school policy that if a teacher from the school had written a book on the topic, it must be the one that is required.",
                                            "score": 23,
                                            "author": "Fredissimo666"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Mine too, his book was $200. And every semester he would make a minor revision or tweak and sell it in the book store as a new edition, meaning you could no longer sell the old edition back to the bookstore. Total fucking racket, he’s probably bought a yacht by now off this scheme they have created.",
                                            "score": 27,
                                            "author": "WickedRafiki",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hm. In my college there were two CS professors who wrote most of the textbooks you would use in CS classes, and you could buy printouts of them at the bookstore for like 25 or 30 bucks. I don't know why more teachers don't follow this model, they get more direct profit from the books, kids can mark them up like crazy since they're cheap and printed on regular-ass paper, and they can still revise every semester (every class I had with one of those books had a free \"errata\" PDF that you got at the beginning of the semester, little mistakes and new problems to solve).",
                                                    "score": 11,
                                                    "author": "itsthebando",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Supply and demand, all in one!",
                                            "score": 7,
                                            "author": "VRichardsen"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That’s a prof who cares!",
                                    "score": 36,
                                    "author": "___ApplePie___"
                                },
                                {
                                    "level": 3,
                                    "comment": "My A&amp;P prof worked on a live textbook that was freely available online.  Basically it's constantly updated and corrected but never costs anything.",
                                    "score": 26,
                                    "author": "podrick_pleasure",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I just got mine through library loans, never bought a book. I probably got a copy here and there from someone who bought the most recent edition (if it mattered, especially for problems), but otherwise it was just fine.",
                            "score": 12,
                            "author": "frogdude2004",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "At my library any book that was being used in a class was put on the reference only shelf to stop people from taking it home. You could still look at it in the library. ",
                                    "score": 11,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I stopped taking some extra foreign language courses because they made me buy a new book for every term, plus an extra $80 login code just to do homework. I figured I wouldn't waste my time and money and just used a free online program.",
                    "score": 52,
                    "author": "Override9636",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When I was in uni (and dinosaurs roamed the Earth), you could \"test out\" of foreign language classes and essentially get free credit for them... One of my buddies figured out that the 101 level classes were so insanely basic that nearly anybody with a pulse could test into 102, hence he got 12 credit hours by testing out of 4 different foreign language classes. The kicker: he had never studied any of them! He had only studied Spanish in high school, and took Spanish 101 as an easy way to pad his GPA.",
                            "score": 59,
                            "author": "Cgk-teacher",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; you could \"test out\" of foreign language classes and essentially get free credit for them...\n\nThat's awful! Acting like the point is to know things rather than expend a certain amount of effort for exactly four years...",
                                    "score": 34,
                                    "author": "MuonManLaserJab",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I always waited till after the first class to find out if I actually needed the book or if I could get by with an older version.",
                    "score": 62,
                    "author": "Up7down",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 29,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I got in at just the right time. The internet made third party books available and cheap, while the industry hasn't quite caught on yet.  I actually sold a few books back to the bookstore *at a profit*!",
                    "score": 18,
                    "author": "boredcircuits"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is why I don't assign textbooks when I can avoid it. When I can't, I assign an older edition, because nothing has changed besides graphics. ",
            "score": 364,
            "author": "middledeck",
            "replies": [
                {
                    "level": 1,
                    "comment": "Likewise.\n\nI also have never given a lecture or a test, but that’s because I’m not a professor.",
                    "score": 244,
                    "author": "GilesDMT",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well shit, what don't you teach? ",
                            "score": 76,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh, you name it and I don’t teach it",
                                    "score": 120,
                                    "author": "GilesDMT",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Can you give some examples of when students actually needed the books?  Ive had teachers PUSH selling the books soooo hard in classes where they never used them even once, even after asking \"Do we REALLLLY need these books?\"  Online courses ive taken i NEEDED them, but i have never had to use a book in a class outside of online.",
                    "score": 26,
                    "author": "yovalord",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think that's exactly the problem talked about in the article. A lot of professors assign specific books because they come coupled with online coursework and material (via one-time use codes) because it's easier than creating coursework from scratch. So often professors will assign books specifically for the online materials. Especially with the rise of adjunct professors teaching courses, they don't often have time to prepare as much to teach their classes so they just assign these books that come with the online coursework.",
                            "score": 16,
                            "author": "teafortat",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I used to wonder why, in the UK, all the books I bought were marked \"international edition\". Now I know why.\n\nI liked what my university did.\n\n* books were recommended but never mandatory, no use of those bullshit online tests \n* recommended books were always available in the library, or where possible, books with online versions were used\n* if passages from a book were essential the lecturer would usually just photocopy or scan in the bits needed \n* some lecturers would happily tell you the differences between edition X and Y, if you had an older copy",
            "score": 90,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Why are textbooks so important to universities in the USA? In my country you usually get a script from the professor and a few reading \"suggestions\" on the topic. But you can always just get them at the library or the digital version via the university's VPN? And even if I buy them I never saw one for more than 80€, what is already incredibly expensive? \n\n&amp;#x200B;\n\nWe only have typical textbooks at school and there they are provided by the school and used for several years.",
            "score": 289,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Some professors don’t teach, in my experience. They let the textbook do their job for them, or a heavy amount of test material comes from the textbook. ",
                    "score": 326,
                    "author": "lovethecoffeelife",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Some professors wrote the textbook and it's a sales pitch.",
                            "score": 210,
                            "author": "Atomic_ad",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I've had profs who \"curated\" books aka took existing books and cut them down or threw in another chapter from a different book, and rebranded it as that class' textbook, with them in the author credits",
                                    "score": 58,
                                    "author": "TSMDOUBLEDONEZO",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I had a prof that did that. He literally photocopied pages from different books and had the school bind them to sell to us for $70. I despised that guy.",
                                            "score": 26,
                                            "author": "Ryochai",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Those collages are $70 because they have to pay copyrights to the original authors/editors. They are significantly cheaper than the source book(s) would have been, and most likely the professor doesn't get a single cent from the sale. I see that as them trying to help you, not sure why you would despise them.",
                                                    "score": 16,
                                                    "author": "Elkazan",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Counterexample: I had a great professor who wrote her own textbook. It cost only $20 dollars and the content was excellent. \n\nShe did it, because she thought the other textbooks on the subject were either too expensive or not good enough. \n\nIt was a fantastic course and the textbook was an excellent resource, partly due to how the notation used in the textbook perfectly matched the notation used by the professor. It felt like a perfect extension of each lesson.",
                                    "score": 20,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "A professor I had recently had a minimum price for the class of $150, as the ebook and online access portion of the class were that expensive. Of course, they recommended the $250 physical book package. We do book activities all day. \"Higher education\" my ass, T E A C H me.",
                            "score": 38,
                            "author": "ThatDeceiverKid",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 39,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It was Spanish and the professor, to my knowledge, was not doing any research.",
                                            "score": 13,
                                            "author": "ThatDeceiverKid",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Any textbook for a course I took in college was available in the library. I spent a lot of time in the library and copy room those first weeks of the semester. ",
                    "score": 25,
                    "author": "DarthRusty",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "When students (or the parents of students) are willing to pay the equivalent to about 30,000€ just for tuition, professors, Universties and publishers won't think it's a big deal for a measly extra 500€-1,000€ on textbooks.\n\nI had the same thing as you, a few reading suggestions. I bought all of them (the lectures chose good ones that were decent value) for about 100-150€ each year but still hardly ever used them as that's what lecture notes are for. Everything you were expected to know had to be in the lecture notes, otherwise, why the hell are you even going to University instead of just studying a book?!",
                    "score": 24,
                    "author": "Spanky2k",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I did my exchange year in America, and I just couldn't get over the fact how expensive the textbooks were. I took Spanish there, and we had to buy this super expensive book to get some damn code so we could access the exercises online. During the course, the textbook had no other use than the code that was a one-time use, making it not possible to resell the book.\n\nA lot of the other books I had to buy for my courses magically became unresellable after the semester was over, so I could only get like 20 bucks back at the end of the semester.\n\nIn my country textbooks are expensive, but they can be used for many years, and when you re-sell them to the store they actually give you up to 60% of the money back, depending on the condition that the books are in. And we actually use the books in lectures, and you wouldn't pass the courses if you didn't have the required books. ",
            "score": 151,
            "author": "Falathrin",
            "replies": [
                {
                    "level": 1,
                    "comment": "The languages and other fine art courses are particularly egregious. At my Uni, required literature and narrative classes to graduate use books that are published each academic year, and they are mandatory $150 or so books.\n\nGuess who entered college during the middle of the academic year and got to spend &gt;$300 on books that I couldn't resell for entry level courses...",
                    "score": 32,
                    "author": "ThatDeceiverKid",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I had a professor who showed us the differences between the prior and new required edition. They changed the font and size, which screwed up the page numbers. There was one new paragraph in the introduction. \n\nThe old edition was $67. The new edition was $325.\n\nHe wrote us a key to cross reference page numbers, and told anyone who had bought the new text to return it. \n\nGood guy. ",
            "score": 126,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Funny, mine doubled in price from the time I started in 2007 to graduating in 2012. ",
            "score": 110,
            "author": "Itsbeenemotional",
            "replies": [
                {
                    "level": 1,
                    "comment": "That's on par with what's mentioned in the article.",
                    "score": 36,
                    "author": "teafortat",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 45,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "What a coincidence.  I just finished a meeting with a rep from McGraw-Hill.  She was trying to sell me on keeping their book for my courses (our department is moving to open-source, free books).  She claimed that this was the \"old model\" and that high prices only met their costs.  When a new edition was released, they had to charge $240 because rentals, used-books, and piracy meant that they wouldn't make any money the following years.  Which, as anyone who interacts with students can tell you, is false.\n\nOpen-educational Resources are great.\n",
            "score": 32,
            "author": "Ainkydoo",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 123,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "the fucking truth but that just makes too much sense for an upstanding govt that cares for our people",
                    "score": 24,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Access codes have become and even bigger scam. Companies realized that students were either pirating books or just not buying them so they invent this bullshit to keep ripping students off ",
            "score": 24,
            "author": "pryda22"
        },
        {
            "level": 0,
            "comment": "Today’s youth are being so fucked over by the older generations, and we need to fight back. Want grandkids? Oh well!",
            "score": 207,
            "author": "Beo1",
            "replies": []
        },
        {
            "level": 0,
            "comment": "b-ok.cc",
            "score": 12,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm a college professor and feel VERY strongly that the textbook industry is greedy and corrupt. I've refused to assign textbooks for years. I also refuse to write them, and only write open-source materials, to the detriment of my career. They can all fuck off.",
            "score": 56,
            "author": "ironicgoddess",
            "replies": [
                {
                    "level": 1,
                    "comment": "You’re one of the good ones, professors being aware that it’s a corrupt system is a step in the right direction. ",
                    "score": 17,
                    "author": "Trappinoutdahbando"
                },
                {
                    "level": 1,
                    "comment": "Not all heroes wear capes, thank you kind soul. ",
                    "score": 9,
                    "author": "fallacyz3r0"
                },
                {
                    "level": 1,
                    "comment": "You the real mvp",
                    "score": 9,
                    "author": "mjangle1985"
                },
                {
                    "level": 1,
                    "comment": "You’re a good person.",
                    "score": 7,
                    "author": "bibasik7"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's absolute bullshit what those publishers do. Churning out a new edition every year with 99.9% of the same content just so people can't buy used. Not to mention the Professors who require their own book for a class and oh it costs $175 and we won't use it. Biggest racket going.",
            "score": 67,
            "author": "D1Foley",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 15,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "What's more frustrating is, as the article points out, that most students can find textbooks online or buy them used. However, companies like McGraw-Hills and others have hooked the entire educational system into this scam of doing \"quizzes/homework\"  online which kneecaps a lot of students who are financial strapped. And most of these online work can easily be done by the professors themselves. There must be a way we can get out of this trap.\n\nEDIT: these online work can't be done without buying NEW textbooks that have special access codes. ",
            "score": 45,
            "author": "lionheartlui",
            "replies": []
        },
        {
            "level": 0,
            "comment": "My professor just sawed the binding off his teachers edition and photocopied us the relevant pages when needed.",
            "score": 15,
            "author": "TheUlfheddin"
        },
        {
            "level": 0,
            "comment": "People are making fortunes off it. I personally know 2 families that are millionaires off brokering textbooks. ",
            "score": 12,
            "author": "DiabolicalTrivia"
        },
        {
            "level": 0,
            "comment": "Just gonna add my two cents here as a college student paying for there own tuition I shouldn't have to pay 125$ for a book of short stories that would normally be 12$-18$ just because its \"a textbook\"",
            "score": 13,
            "author": "RazgrizTwitchmain"
        },
        {
            "level": 0,
            "comment": "My Calc 3 prof assigned a textbook that was 3 editions out of date. Cost $36 and was almost exactly the same as the newest $350 one. She did it because she didn’t want us to pay so much. Need more profs like her. ",
            "score": 12,
            "author": "Michael97035",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I recently started going back to school and was buying (renting) my books online. For one book, it had several options to pick from all starting at ~$220 for a 4-month or greater time. Keep in mind it's digital. At the very bottom of the list, there was a small drop down arrow, which led to one additional option for $27. I was like, c'mon, that's so scummy. ",
            "score": 26,
            "author": "WeazelBear",
            "replies": []
        },
        {
            "level": 0,
            "comment": "A large majority of that information has been the same since 70s too.",
            "score": 9,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "When I was in college I found someone had uploaded a torrent where they took 400 jpeg photos of the textbook and uploaded it online.\nPeople like that are real heroes",
            "score": 8,
            "author": "Mustang678"
        },
        {
            "level": 0,
            "comment": "Our library has an annual book sale and we accept donations.  Got a textbook with a price stamped in it for $600.00. We sold it for a quarter.",
            "score": 33,
            "author": "bincyvoss",
            "replies": []
        },
        {
            "level": 0,
            "comment": "International editions can be had cheap online. They are usually exactly the same except the cover. Recently got a book from alibris.com for 16 bucks. Bookstore at school wanted like 200. ",
            "score": 6,
            "author": "FriarNurgle",
            "replies": []
        }
    ]
}