{
    "id": "cwp4g9",
    "score": 38222,
    "title": "Principal Who Banned Books In Classroom Arrested for Child Pornography",
    "author": "catagator",
    "date": 1567018603.0,
    "url": "https://www.reddit.com/r/books/comments/cwp4g9",
    "media_urls": [
        "https://bookriot.com/2019/08/28/principal-tied-to-censorship-arrested-faces-child-pornography-charges/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "He only read books with pictures in them.",
            "score": 4925,
            "author": "tricky_dick_01",
            "replies": [
                {
                    "level": 1,
                    "comment": "His favorite picture book was Lolita",
                    "score": 1522,
                    "author": "butters_cotch",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Mobydick??",
                            "score": 287,
                            "author": "sgt-skips",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s right. The illustrated version of Lolita does, in fact, feature Moby’s Dick",
                                    "score": 339,
                                    "author": "butters_cotch",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Jason Bourne wants to know your location",
                                            "score": 85,
                                            "author": "Rudy_Ghouliani",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "David Webb wants to know your location",
                                                    "score": 38,
                                                    "author": "FOOLS_GOLD",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Chris Hanson wants to know your location.",
                                                            "score": 27,
                                                            "author": "GrizzlyZissou",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Hot singles in your area already know your location.",
                                                                    "score": 12,
                                                                    "author": "autoboxer",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "He also will not pay for the mugs he bought.",
                                                                    "score": 8,
                                                                    "author": "throwawaybottles"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Moby, another celebrity brought down by the metoo movement.\n\nEdit:  I had no idea that this was actually a thing...",
                                            "score": 23,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That and nobody listens to techno",
                                                    "score": 32,
                                                    "author": "thebite101",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Now let's go!",
                                                            "score": 14,
                                                            "author": "Justindr0107",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Just give me the signal, I'll be there with a whole list full of new insults",
                                                                    "score": 6,
                                                                    "author": "GaloGang"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "He would have had his career badly effected by it at any time period, its not even metoo he claimed he dated her when she was nearly a minor and he was in his 30s, she publicly corrected it, he doubled down and posted some pictures of them, then he remembered he used to do fuck tons of drugs and might have only jerked off thinking about her rather than actually knowing her on a first name basis. Apologies and ended the book tour and I assume he's back to making white noise albums to sleep to, because people sometimes by those without realizing it's a Moby album.",
                                                    "score": 14,
                                                    "author": "[deleted]"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Really?",
                                                    "score": 8,
                                                    "author": "TooFastTim",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Eh, sort of. He said that he \"dated\" Natalie Portman. (He didn't) When Ms Portman set the record straight, she pulled zero punches.\n\nThere wasn't any assault or abuse that I'm aware of, but the situation was creepy.",
                                                            "score": 34,
                                                            "author": "TheRiflesSpiral",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Oh so kinda wishful thinking pervert! Gross",
                                                                    "score": 10,
                                                                    "author": "TooFastTim",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Yeah. Super gross.",
                                                                            "score": 12,
                                                                            "author": "TheRiflesSpiral"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That sicko!",
                                            "score": 10,
                                            "author": "ThePrussianGrippe"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Call me Inmate #24601.",
                                    "score": 26,
                                    "author": "Jwhitx",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "MY NAME IS JEAN VALJEAN",
                                            "score": 26,
                                            "author": "MzunguInMromboo",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And Im Javert, do not forget my name. 24601",
                                                    "score": 16,
                                                    "author": "[deleted]"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Oh my, Yes please!",
                                                    "score": 5,
                                                    "author": "arkartita"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I added you on discord.",
                                            "score": 9,
                                            "author": "[deleted]"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Welcome to Oz",
                                            "score": 3,
                                            "author": "raish_lakish"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Moby what?!",
                                    "score": 14,
                                    "author": "AggravatingOnion",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "*Please* tell me you know what reference you are making, because it's awesome and I love it.",
                                            "score": 11,
                                            "author": "LRaconteuse",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "What you are gonna do if I don't? Put me in the chokey?",
                                                    "score": 15,
                                                    "author": "AggravatingOnion",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "There she blows!!!",
                                    "score": 5,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "So, being serious for a sec... can somebody explain what Lolita is, and why it's apparently so controversial? I've never read it and know very little about it. There's no actual sex stuff in it, right?",
                            "score": 36,
                            "author": "TyHarvey",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In short, its a book about a dude who fantasized about a 12 year old girl, became her step-father, and basically groomed her. And there isn’t any literal, explicit sex scenes iirc, but it’s 100% implied. There’s drugging, murder attempts, and a lot worse; read up on the plot on wiki, it’s fucked up lmao",
                                    "score": 127,
                                    "author": "PichusOten",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Okay, that's messed up... And that's basically the entire book? Like, I know Stephen King has written about underaged characters having sex, but it's done in a way that actually adds to the story... but with Lolita, it's basically the entire story itself? No other plotlines or whatever, just \"guy loves kid, guy drugs kid, etc\" or whatever? \n\n\nI'll look it up later. I'll probably regret it, but I'll look it up eventually.",
                                            "score": 31,
                                            "author": "TyHarvey",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes, that is the entire book, but that isn’t what makes the book so brilliant. What makes the book great is how beautifully written the prose is. Theres all of these wordplays and sort of inside jokes going on throughout the book that just make the experience that much better. Nabokov’s ability to write an untrustworthy narrator is top notch. Although its not to the same extent as some of his other works, what happens in Lolita is still a heavily filtered version of what may have actually happened through the eyes of a pedophile. As the reader, we don’t get to know what Dolores thought of it all. We only get to see how much Humbert loved her and why he thought what he was doing was right.",
                                                    "score": 118,
                                                    "author": "PurelyCreative",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;We only get to see how much Humbert loved her and why he thought what he was doing was right. \n\nNot even that, we only see how much he *claims* to have loved her and why he *says* he thought he was doing what was right.\n\nThe nature of the unreliability of Humbert really leaves this up to question on whether any of this is true or to come across as more sympathetic.\n\nIt really is a brilliant novel.",
                                                            "score": 47,
                                                            "author": "-FeistyRabbitSauce-"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The story is told from the perspective of Humbert Humbert, a deranged pedophile with a silver tongue. The incredible feat of the book is that the subject matter is so utterly repulsive and vile, while the the prose and language used to describe it are just immaculate. Truly some of the best prose of all time.\n\n\nThe book and its author do not in any way promote pedophilia, but the style in which the book is written seduces the reader themself, and in some way makes you an 'accomplice' to the protagonist's crimes.  A summary will never suffice though. It is far more ambiguous, layered, and self-reflexive than most books.",
                                                    "score": 79,
                                                    "author": "Laampooned"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It’s not gratuitous. It’s a beautifully written book that will send your head for a bit of a spin as you wonder how you came to pity a pedophile.\n\nThen you’ll realise that, maybe, you can’t really trust this dude’s account of the story, and you’ll start hating him properly. But you’ll still laugh at his self-deprecation and twisted humour despite yourself. It’s fantastically funny.\n\nThe writing itself is like the richest chocolate mud cake you can imagine. So good, but so fucking dense and creamy and... I could only read  a chapter or so at a time.",
                                                    "score": 83,
                                                    "author": "jojoblogs",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Plot aside, it is one of the most beautifully written works of fiction you’ll ever read. Go to Amazon or whatever and read the intro. You’ll be simultaneously pulled along with the narrator and his obsession...and somewhat nauseated most likely.",
                                                    "score": 35,
                                                    "author": "eriksrx",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It's basically entering the mind of a depraved pedo, and how rationalizes it. In a somewhat similar vein, I recommend The Tunnel by Ernesto Sabato, which is about a similar subject matter, just with murder instead of pedophilia.",
                                                    "score": 5,
                                                    "author": "DP9A"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It's a classic example of the unreliable narrator.  Humbert Humbert does his best to convince the reader that his actions are perfectly fine, but they're really obviously not.",
                                                    "score": 5,
                                                    "author": "Smauler"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I mean there’s a lot of plotlines, but yeah all of it revolves around the dude and the girl; happy reading",
                                                    "score": 5,
                                                    "author": "PichusOten",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It's the way he write.\n\nBook starts off...\n\n“Lolita, light of my life, fire of my loins. My sin, my soul. Lo-lee-ta: the tip of the tongue taking a trip of three steps down the palate to tap, at three, on the teeth. Lo. Lee. Ta. She was Lo, plain Lo, in the morning, standing four feet ten in one sock. She was Lola in slacks. She was Dolly at school. She was Dolores on the dotted line. But in my arms she was always Lolita. Did she have a precursor? She did, indeed she did. In point of fact, there might have been no Lolita at all had I not loved, one summer, an initial girl-child. In a princedom by the sea. Oh when? About as many years before Lolita was born as my age was that summer. You can always count on a murderer for a fancy prose style. Ladies and gentlemen of the jury, exhibit number one is what the seraphs, the misinformed, simple, noble-winged seraphs, envied. Look at this tangle of thorns.”",
                                                    "score": 7,
                                                    "author": "papaHans"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I’m still currently reading the book but basically, it’s from the POV of a pedophile who ‘falls in love’ with (and possibly abducts; he does in the movie but idk about the book yet) a child, Dolores/Lolita. From my understanding there’s no actual sex scenes but they’re very strongly implied, and even though I’m only 50ish pages in, his attraction to her/‘nymphets’/girls is by no means subtle. \n\n\nIt’s controversial because it’s beautifully written, which contrasts heavily with the contents of the story. Humbert doesn’t sound like a monster with how it’s presented to you, even though he’s sick.",
                                    "score": 39,
                                    "author": "DevianttKitten",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's how he thinks of himself. No genuine monster thinks they're a monster. The book makes you peer into the mind of a well spoken pedo",
                                            "score": 47,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Eh, I think plenty of ‘monsters’ think they’re monsters, they’re perfectly aware cognitively that what they want/do is wrong, they just don’t *care*.    \nFor them it’s only a facet of their overall personality, and they’ve compartmentalized it to the point it doesn’t effect them knowing that they’re fucked up.",
                                                    "score": 20,
                                                    "author": "DevianttKitten",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 145,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He banned that book for false advertising.",
                            "score": 105,
                            "author": "Maddie-Moo",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I’m sure his dick runs with the constant drip, drip, drip, of gonorrhea",
                                    "score": 37,
                                    "author": "Zachsyd",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That is not a pretty picture that just popped in my head.",
                                            "score": 19,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "No, the book was \"See dick, run!\". He didn't want the students getting any ideas.",
                                    "score": 8,
                                    "author": "meltingdiamond"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nah, he uses a PDF file",
                    "score": 89,
                    "author": "lobroblaw",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So he is a PDFile?",
                            "score": 178,
                            "author": "UnPrecidential",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Peter File you mean?",
                                    "score": 49,
                                    "author": "thegrayman9",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In America they say \"PEH-dophile\"! :)",
                                            "score": 26,
                                            "author": "Biggoronz",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "*pee-TAH-file* is how the British say it 😂",
                                                    "score": 14,
                                                    "author": "thegrayman9",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "i know! i was continuing the \"IT Crowd\" quote lol",
                                                            "score": 24,
                                                            "author": "Biggoronz",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Good work, Jen. You've grabbed a normal.",
                                                    "score": 4,
                                                    "author": "sgtxsarge"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Lol I love how the post explaining the joke in the previous post is the one which gets more upvotes and a silver",
                                    "score": 12,
                                    "author": "banjowashisnameo"
                                },
                                {
                                    "level": 3,
                                    "comment": "Why did this post get more up upvotes than the actual joke",
                                    "score": 5,
                                    "author": "SemenMoustache"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "People tend to imitate those they are attracted to.",
                    "score": 35,
                    "author": "sithmaster0",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I do *not* imitate a well-read black lady, sir!",
                            "score": 33,
                            "author": "DeathcampEnthusiast",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And reading is what?\n\nFundamental.",
                                    "score": 9,
                                    "author": "Werwanderflugen"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Unbelievable the depths of hypocrisy, some people can achieve. Heaven forbid students are challenged with difficult material or vernacular \"that offends\". Meanwhile this bastion of morality is using the saddest and most despicable of pornography.",
            "score": 2275,
            "author": "Just1morefix",
            "replies": [
                {
                    "level": 1,
                    "comment": "Honestly, I think that the vast majority if not all of the people who publicly get outraged at \"immoral\" things and rally against them are in fact doing the same thing or something even worse in secret.",
                    "score": 979,
                    "author": "clouddevourer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "'Tis the \"methinks thou doth protest too much.\" effect. People who are wracked with guilt over their horrible actions are much more likely to pursue moral crusades against others, as a way of convincing themselves they're actually one of the good guys.",
                            "score": 593,
                            "author": "AnomalousAvocado",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think it's more to try to convince everyone that they are pure and above suspicion.",
                                    "score": 253,
                                    "author": "snerp",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think its more that they notice they cant stop bringing it up or someone catches them searching for it, and then decide that since the conversations are inevitably going to happen they had better have a good reason why its always a topic",
                                            "score": 110,
                                            "author": "MBCnerdcore",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Also, I think it's often a part of themselves that they hate and can't control so when they see even small signs of other people doing or behaving in a manner that reminds them of that part of themselves they hate, they project their self loathing onto other people and lash out",
                                                    "score": 89,
                                                    "author": "darkwing42",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's definitely more this subconscious projection than it is a premeditated behavior. They're not trying to preemptively protect themselves. They're impulsively attacking what they hate most about themselves.",
                                                            "score": 47,
                                                            "author": "Sciensophocles"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "This is the correct answer. Projection, 100%. People hate seeing their worst qualites in other people. I'm not sure I understand the psychogy of it, but it's how the brain works. A lerfect example of this is getting possed at peolles trafffic behaviors that one is guilty of doing themself. I try and catch myself doing this when Im self aware enough to.",
                                                            "score": 10,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Self-awareness is an important quality to have. A disproportionate amount of people are unwilling or unable to acknowledge their own flaws. I have mine, and I rarely realize my flaws in the moment or until I play back recent events in my head.",
                                                                    "score": 10,
                                                                    "author": "sgtxsarge"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You're all right",
                                                    "score": 15,
                                                    "author": "cantlurkanymore"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 36,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This is one of the big reasons that “homosexuality is a choice” people tend to end up getting caught in homosexual affairs.\n\nThey spend every day of their conservative religious lives struggling with and denying their homosexual urges, so they assume (since of course they are straight) that ALL straight people actually want to have sex with the cute guys at the truck stop, and that it’s only deviants that choose to act on it.",
                                                    "score": 38,
                                                    "author": "Typo2D",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It always makes me think of the priest in the scarlet letter.",
                                    "score": 18,
                                    "author": "mokeyss"
                                },
                                {
                                    "level": 3,
                                    "comment": "I'm not perfect and I've made mistakes in my time. Nothing seriously reprehensible or heinous, but as a former alcoholic I've had my share of crazy nights and moments of stupidity. It's not who I truly was at heart. I wanted to be someone better. But I've totally turned things around and been stone sober for the last 18 months. I won't go back to my old ways.\n\nI don't white knight or virtue signal or take holier-than-thou stances on anything. There's one thing I've learned about human behavior in all of my great and terrible times: people are complicated. People, myself included, fuck up...some more than others but the principle is the same. Everyone has made mistakes and done the wrong thing for selfish, shortsighted reasons. It's extremely difficult for me to get legitimately angry and chastise someone because I've experienced enough to know what kind of guilt and shame he/she is feeling. It's often indescribable.\n\nI don't think the people playing holier than thou on social media are all guilty of some hidden wrongdoing of their own. Many of them probably *are* hiding something. The rest are shouting due to their *lack* of life experiences and personal mistakes. They haven't been exposed to the other side, personality variations, and showing sympathy/empathy when it's the last thing you want to do. They haven't faced the ethical conundrum of seeing someone they know well and respect do something shameful. It's not so black-and-white. Because people are unbelievably complicated.\n\n\n\n\n\n\n\n.....but FUCK this principal. If he did all of what he's been accused of then he really is the absolute worst kind of person.",
                                    "score": 63,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I definitely agree that many people who are (mildly/moderately) vocal and judgemental about morality simply lack the life experience to be more understanding. Experience is really key when it comes to being open-minded. I've never been very judgemental of others' mistakes, but I can certainly admit that I had a more black-and-white view of morality before trauma led me straight into drug addiction, which promptly kicked me in the ass and took me down a few pegs. Making mistakes really demonstrates the fact that much of the world is one big shade of grey and that, as you say, people are complicated. And the silver lining of adversity is that it frequently creates empathy.\n\nAlso, congrats on your 18 months of sobriety! I've been clean for 6 months.",
                                            "score": 23,
                                            "author": "CricketSongs"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I believe it was Marc maron who said he can't respect people who haven't completly gone off the rails for a few years, it gives a certain wisdom that regular life just can't teach haha",
                                            "score": 23,
                                            "author": "Krombopulos_Micheal",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I symbolically give you platinum. Dude, if there is a silver lining to decades of alcoholism it is this hard won wisdom. You can certainly learn that lesson without alcoholism, but alcoholism seems to be a catalyst for that realization. It forces this humility on you.\n\nAnd life is so much easier when you just stop judging everyone. It’s easier to get along with people. You have fewer silly disagreements. It just adds a lot to life to drop the habit of judging others.\n\nGreat job in 18 months.",
                                            "score": 4,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Real (possibly dumb) Question: Is this a confirmed thing or a theory?",
                                    "score": 5,
                                    "author": "Landler656",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's probably true in some cases, but people who hate muslims aren't secretly reading the Quran under the cover of night, so I'd take it with a grain of salt",
                                            "score": 9,
                                            "author": "Supercoolguy7"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I think it can come from the other extreme too. People who grew up conforming to very conservative social values resent the fact that other people are now happily living more carefree lives. Regardless, I think there’s many reasons people try to force these values on others. There’s just far to many of them for it to be explained by just one or two factors.",
                            "score": 26,
                            "author": "nightpanda893",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Biology can influence a person's moral disposition, certain parts of the brain are more likely to be more active in conservative people. Many articles of varying quality available online.https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3092984/",
                                    "score": 16,
                                    "author": "flickering_truth",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "On this note, I think those groups of vigilante paedophile hunters you see on social media likely have a higher than average proportion of closeted paedophiles in their membership",
                            "score": 45,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 25,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;\"It was for research.\"\n\nWorked for Peter Townshend...which song suits best \"Won't get fooled again\" or \"Boris the Spider\"",
                                            "score": 10,
                                            "author": "Temetnoscecubed",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "While studying to become a therapist a girl I knew kept sending me these absolutely horrible clips of porn stars breaking down on set. So, I asked her wtf is going on with her but, apparently, if I ever would have to treat someone who’s been raped I should see just what that is like. Some people *truly* are addled.",
                                            "score": 12,
                                            "author": "DeathcampEnthusiast",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The guy who ran PervertedJustice.com (the website that inspired \"To Catch a Predator\") turned out to be grooming a 16 year old \"online girlfriend\".  I seem to recall one of the other baiters on that website was revealed to have a large collection of \"art books\" full of nude children",
                                    "score": 22,
                                    "author": "MarkHirsbrunner"
                                },
                                {
                                    "level": 3,
                                    "comment": "Like ol @Dr. Pizza, the Ars Technica writer who was constantly ranting on twitter about pedos and... oh my god you won't believe this... ended up being a pedo.",
                                    "score": 3,
                                    "author": "ReverendDizzle"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not everyone who cares about morality is a hypocrite, those are just the types that get more headlines.",
                            "score": 15,
                            "author": "Hattless"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 76,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "*KNOCK KNOCK*\n\nThank you for your service, comrade.",
                                    "score": 38,
                                    "author": "messybeaver",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I serve the Soviet Union.",
                                            "score": 15,
                                            "author": "se7enfists",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "For Mother Russia!",
                                                    "score": 6,
                                                    "author": "NRGT",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "***MY NAME IS VIKTOR REZNOV!***",
                                                            "score": 6,
                                                            "author": "Valdios",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "*ahem.*  Decent joke, sucks I don't find any of this funny anymore.\n\nBut yeah.  That's what the American Republican party has been doing for a while.  I heard this from an old-timer, he said he first heard it in the 80s -- \"if you want to know what the Republicans are up to, look at what they're accusing the Democrats of.\"",
                                    "score": 45,
                                    "author": "bennzedd",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "So me being publically outraged by child pornography means I own child pornography?",
                            "score": 7,
                            "author": "Alexexy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No, but if you brought it up in every conversation and couldn't talk about anything except how terrible child porn is, people would start to wonder who you were trying to convince...",
                                    "score": 22,
                                    "author": "LictorForestBrood",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Cant go lower than 0. I think some people genuinely have no ethics, yet we keep expecting a bottom to their behavior.",
                    "score": 38,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 19,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "This is the kind of \"morality\" based on the idea of \"if I don't see it, talk about it, or read about it, it doesn't exist and therefore cannot hurt me or my children.\"",
                    "score": 16,
                    "author": "WHYAREWEALLCAPS",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Almost like some sort of projection",
                    "score": 5,
                    "author": "uwsdwfismyname"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a wild ride of a headline!",
            "score": 781,
            "author": "Surefire_Intel4realz",
            "replies": [
                {
                    "level": 1,
                    "comment": "“Stupid sexy kids and their stupid sexy books”",
                    "score": 573,
                    "author": "ihaveallthelions",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hahahahaha! This is the funniest thing I've read all day",
                            "score": 34,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Even funnier now that the simpsons creator has been accused of foot rubs on Lolita express.",
                                    "score": 60,
                                    "author": "AnistarYT",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "my family did a family tree and in the 90s i have been been a little excited to tell people i'm distantly related to Matt Groening.  now im just like 'shit i hope that this disorder isn't based on a gene'.",
                                            "score": 28,
                                            "author": "MBCnerdcore",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well I would say that most likely GET THAT HAND OFF MY KNEE, SIR.",
                                                    "score": 10,
                                                    "author": "DeathcampEnthusiast"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Gee, I wonder who else I respect is a fucking pedophile. I hate this world.",
                                            "score": 40,
                                            "author": "ncolaros",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Probably a fuck tonne more than you think. Someone said on another thread a month or two back that it's apparently between 1 and 5% of the population. Although I guess we're talking about actual full predators, so probably less than that",
                                                    "score": 21,
                                                    "author": "Azaj1",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It took sharp turn right off a cliff.",
                    "score": 27,
                    "author": "bertiebees"
                }
            ]
        },
        {
            "level": 0,
            "comment": "In my experience, the more a person tries to push their morality on others, the worse that person's morality is.",
            "score": 800,
            "author": "AntifaInformationist",
            "replies": [
                {
                    "level": 1,
                    "comment": "sinners assume everyone else sins",
                    "score": 279,
                    "author": "PriorInsect",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Now listen here you redditors with your hibbity pibbity you gotta pull up your pants and turn down that rap music and say \"hello!\" with the jello!",
                            "score": 65,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well if you come at me with that line... I mean, a poet is a poet, right?",
                                    "score": 9,
                                    "author": "DeathcampEnthusiast"
                                },
                                {
                                    "level": 3,
                                    "comment": "Cosby's tour telling black youth the reason they couldn't get ahead in life was because of their clothing and music was so odd. Cosby had all the years and experience to know that was absolute bullshit, yet he still did it. What was the motivation?",
                                    "score": 8,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's called projection.",
                    "score": 21,
                    "author": "carnage11eleven",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Gaslight. Obstruct. **Projection**.",
                            "score": 15,
                            "author": "AntifaInformationist",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "At least Rasputin believed that the more you sinned the holier you were, and stood by it like the absolute yolo madlad he was.",
                    "score": 51,
                    "author": "DeathcampEnthusiast",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "He was the lover of the Russian queen.\n\nBut as you said, he was a cat that really was gone.\n\nWhile Russia's greatest love machine,\n\nIt was a shame how he carried on.",
                            "score": 38,
                            "author": "Scyhaz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "RA RA RASPUTIN lover of the Russian queen",
                                    "score": 8,
                                    "author": "HARITHKAUSHIK16"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The one that gets me is that people who are super jealous of their partners cheating are usually the ones cheating",
                    "score": 18,
                    "author": "jimmyboy456",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I have always assumed most politicians who are anti abortion forced some girl in high school to have one.",
                    "score": 14,
                    "author": "parabox1",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Once again, someone who was a piece of shit turned out to be a piece of shit.",
            "score": 49,
            "author": "InprissSorce",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It looks like \"Lessons from a Dead Girl,\" one of the banned books talked about in the article, is about a girl trying struggling with being sexually abused by her (female) friend after the abuser's death.",
            "score": 324,
            "author": "foxeared-asshole",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well, it fits well with how most who want to ban Mockingbird are racist dinks.",
                    "score": 52,
                    "author": "DeathcampEnthusiast",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Or very misguided Audubon Society members.",
                            "score": 24,
                            "author": "AdmiralAkbar1"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Laurie Halse Anderson was listed as another banned author.  Her book Speak dealt with sexual trauma as well.  It was one of the few books I was assigned in high school that stuck with me and I enjoyed reading.\n\n&gt;  “Some parents have complained that the novels contain foul language and cover topics — including sex, child abuse, suicide and drug abuse — unsuited for discussion in coed high school classes.\n\nThis drives me nuts.  Those kids should have access to books like these *because* they are in a coed high school class.",
                    "score": 41,
                    "author": "Scops",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm at as loss as to what being in coed classes has to do with those books supposedly be inappropriate? If they weren't coed classes would the parents find them acceptable then?",
                            "score": 12,
                            "author": "redsjessica",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Probably more so, yes.  They're convinced that their children are perfect little angels who would never act out any sexual impulses or morality that the parents disagree with unless they're corrupted by those dastardly books and have other fellow corrupt students to experiment with.  It would also never cross their minds that said perfect angel could be anything other than straight as an arrow.",
                                    "score": 15,
                                    "author": "SirTrey",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 63,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Her abuser died and she's struggling with dealing with the abuse she suffered when she was alive",
                            "score": 121,
                            "author": "agent_raconteur",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I think it's worded oddly. There is only one abuser, the female friend, and the story is about after her death. At least, that's what makes the most sense to me given the context.",
                            "score": 45,
                            "author": "Arreeyem"
                        },
                        {
                            "level": 2,
                            "comment": "She was abused by a zombie /s\n\nFrom context I assume that the story happens after the death, but the abuse before it.",
                            "score": 24,
                            "author": "not-a-candle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sounds like a porn category that, unusual as it sounds, most likely already exists",
                                    "score": 5,
                                    "author": "hamjandal",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Rule 34 my friend",
                                            "score": 5,
                                            "author": "SpankaWank66"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm disappointed in this article, i wanted details on the principal's crime, how they caught him, etc.",
            "score": 72,
            "author": "nonamecats",
            "replies": [
                {
                    "level": 1,
                    "comment": "“his arrest citation, KSP says a complaint came in from George Rogers Clark High School, which shares the campus with the area technology center, that Wilson had child porn and was sharing it with someone else.” - From the article linked within the article.",
                    "score": 68,
                    "author": "Ativan_Ativan",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "so he had it at work, where hundreds of kids are all the time?  what a smarty pants.  if he had just left it at home he wouldnt have even gotten caught.  people are so fuckin selfish and dumb that they destroy everything around them,",
                            "score": 39,
                            "author": "MBCnerdcore",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Another Kentucky teacher just recently got caught putting a hidden camera in the girls bathroom. They caught him by rewinding the tape to show him placing the camera",
                                    "score": 34,
                                    "author": "Pat-Sajak",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "WHAT? \n\nI’m in Kentucky. Where the fuck was this?",
                                            "score": 16,
                                            "author": "DankeyKang11",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Not that I know this, but I'm assuming it's pretty hard to install a hidden camera if you're recording onto tape.",
                                            "score": 3,
                                            "author": "majungo",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The problem isn't the hundreds of kids, the problem is him committing a crime on a public network which is being monitored and all activity logged. How stupid was this guy?",
                                    "score": 52,
                                    "author": "Zoltie",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "It seems he's been getting away with it for a while, so he likely got complacent.",
                                    "score": 4,
                                    "author": "AdmiralAkbar1"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;that Wilson had child porn and was sharing it with someone else.” - From the article linked within the article.\n\nim not doubting this particular case but i'm wondering how easy it would be to set someone up for something like this.\n\nthe recent tech stuff i've read on here... holy fuck.",
                            "score": 7,
                            "author": "hoxxxxx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yea... idk. I always feel like these things should be kept anonymous until the trial is over or something because you just never know what’s actually going on. The guy was obviously not well liked. I doubt he’s innocent but I’m not really the correct person to judge that, nor is anyone else in this thread that assumes his guilt etc... I feel like in these cases they don’t tend to arrest people without good evidence though. Idk... tech stuff is scary in this sense. It will probably only get scarier.",
                                    "score": 12,
                                    "author": "Ativan_Ativan",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "he should have been fired just for banning books",
            "score": 122,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It's the opposite of shocking when holier-than-thou people are secretly the most immoral ones of all.",
            "score": 16,
            "author": "DontCallMeTodd",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Its becoming increasingly (if not already blatantly) obvious, anyone trying to keep information and education away from the people, do so for nefarious purposes. Before, it was to keep people in their place, now its to fuck kids... probably was to fuck kids before as well, anyways..",
            "score": 211,
            "author": "Byrdsthawrd",
            "replies": [
                {
                    "level": 1,
                    "comment": "The romans were notorious kid fuckers",
                    "score": 44,
                    "author": "wagstah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, no that was Pederasty, it was different.\n\n/s",
                            "score": 25,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I mean weren’t you considered an adult by 13 in Rome or some ridiculously young age by today’s standards.",
                                    "score": 12,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Probably as soon as you could start breeding, so maybe. I'm not too sure.",
                                            "score": 7,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You're thinking of the Greeks",
                            "score": 8,
                            "author": "LordDongler",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nah Romans could fuck kids but only slave kids. And I'm pretty sure they had to be your property or the property of your host (if you're at a dinner party).",
                                    "score": 12,
                                    "author": "ddaveo",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "“Can I interest you in some grapes? Or children? We have some lovely ones, carted in fresh from the Barbary coast.”",
                                            "score": 11,
                                            "author": "DeathcampEnthusiast",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Curious if Lolita was banned. Talk about some inner conflict.",
            "score": 111,
            "author": "Zamperweenie",
            "replies": [
                {
                    "level": 1,
                    "comment": "nah even lolita was too old for him, kid fuckers hate puberty",
                    "score": 17,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can see him enacting the end of Fahrenheit 451 where he goes to a remote area with other paedophiles where they describe the pornography they've seen.",
            "score": 22,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It always seems to be the case. The more strident people are in their prohibition of something, the more likely they have some hypocritical secret they are hiding. Vociferously against gays? Is molesting boys in secret. Fanatically anti-abortion? Has mistresses who secretly get “procedures.” It’s sickening.",
            "score": 10,
            "author": "penny-wise"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 29,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "/r/nottheonion",
            "score": 28,
            "author": "magondrago"
        },
        {
            "level": 0,
            "comment": "I am a poor writer. I shall let the [greatest philosopher of the 20th Century](https://www.azquotes.com/quote/630902) say it for me.",
            "score": 106,
            "author": "Veganpuncher",
            "replies": [
                {
                    "level": 1,
                    "comment": "I dunno... seems like an insult to Apache transvestites to me.",
                    "score": 60,
                    "author": "vplatt"
                },
                {
                    "level": 1,
                    "comment": "Are Apaches known to be affordable cross dressing sex workers?",
                    "score": 20,
                    "author": "Zebirdsandzebats",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Asking for a friend?",
                            "score": 11,
                            "author": "Nostromos_Cat",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It just seems like a weirdly specific prejudice, is all. I mean, I'm sure there's probably plenty of weirdly specific First Nations prejudice out West or whatever, but I've just never heard it.",
                                    "score": 16,
                                    "author": "Zebirdsandzebats",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thinking he was just adding in a minority to his scenario.",
                                            "score": 12,
                                            "author": "snizzbone",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes, I too am curious.",
                            "score": 4,
                            "author": "DeathcampEnthusiast"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Wow, what a quote",
                    "score": 18,
                    "author": "Kowla1",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "I love Hitchens, but I honestly think it’s a little silly to call him the greatest philosopher of the 20th century. That was a hell of a century for philosophy, and I don’t think Hitch himself would claim to be primarily a philosopher—essayist and rhetorician sounds more on point, and on those points I know he wouldn’t place himself above Orwell in the former or the great politicians in the latter.",
                    "score": 15,
                    "author": "Containedmultitudes",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Damn it Kentucky.",
            "score": 8,
            "author": "nedviherd",
            "replies": []
        },
        {
            "level": 0,
            "comment": "More “Conservative Christian Family Values”.",
            "score": 12,
            "author": "Archer1949"
        },
        {
            "level": 0,
            "comment": "There were admittedly some red flags...",
            "score": 7,
            "author": "mx4evr"
        },
        {
            "level": 0,
            "comment": "And that's why you should be afraid of people who don't want others around them to be informed, especially when in a position of power",
            "score": 7,
            "author": "SeerPumpkin"
        },
        {
            "level": 0,
            "comment": "Of course he was. \n\nOf course. He was.",
            "score": 6,
            "author": "DJDarren"
        },
        {
            "level": 0,
            "comment": "Well that escalated quickly",
            "score": 6,
            "author": "FierySharknado"
        },
        {
            "level": 0,
            "comment": "fuck that reads like an onion article",
            "score": 6,
            "author": "FNC1A1"
        },
        {
            "level": 0,
            "comment": "How is it always like this?  Some fucked up dude with fucked up goals is secretly a fucked up dude with more fucked up goals... does this kind of shit surprise anyone anymore?",
            "score": 23,
            "author": "TheWeathermann17",
            "replies": [
                {
                    "level": 1,
                    "comment": "People.\n\nWe want to be unique, but all of us are just variations of each other.",
                    "score": 5,
                    "author": "FvHound"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Books make people smarter. People who ban them are not. I'm guessing he wasn't an avid reader, more of an internet guy...",
            "score": 6,
            "author": "SummerOfMayhem",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Stories like this arent even surprising any more lol. Fug",
            "score": 5,
            "author": "KnowsGooderThanYou"
        },
        {
            "level": 0,
            "comment": "Wow r/iamatotalpieceofshit",
            "score": 5,
            "author": "slightlysubversive",
            "replies": [
                {
                    "level": 1,
                    "comment": "Don't be so hard on yourself, dude. Compared to the pedophilic principal you must be a great person.",
                    "score": 11,
                    "author": "BorgClown"
                }
            ]
        },
        {
            "level": 0,
            "comment": "r/nottheonion",
            "score": 5,
            "author": "DeBomb123"
        },
        {
            "level": 0,
            "comment": "“Oh no, that is wholly unexpected.”\n\n- Nobody, Nowhere, Ever",
            "score": 5,
            "author": "DeathcampEnthusiast"
        },
        {
            "level": 0,
            "comment": "Why does it seem like people with these types of silly views are all pedos/rapists?",
            "score": 6,
            "author": "Rockor"
        },
        {
            "level": 0,
            "comment": "Straight people are insane.",
            "score": 4,
            "author": "throwawaydyingalone"
        },
        {
            "level": 0,
            "comment": "People who censor always have some shit.",
            "score": 8,
            "author": "squidmask"
        },
        {
            "level": 0,
            "comment": "It’s almost as though a lot of these hyper-moralistic people aren’t actually good people. \n\nShow me a politician or preacher ranting about gay marriages, and I’ll show you someone about to get caught with a male escort.",
            "score": 9,
            "author": "Nobody275"
        },
        {
            "level": 0,
            "comment": "Hey, I'm a librarian at a private elementary school (we have strict rules) and I have ALL of those books readily available to students of the right reading level. Its MY job to make sure the kids don't take something too intense for them at that moment in their life. That doesn't mean in two years, when they've grown, they STILL can't read it. Honestly, if we didn't have such literature, kids would not be able to learn and empathize with others who are suffering. That's more important than keeping them \"safe\".",
            "score": 8,
            "author": "caarlsbad",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Ironic",
            "score": 4,
            "author": "GrandmasterJanus",
            "replies": []
        },
        {
            "level": 0,
            "comment": "shockedpikachu.png",
            "score": 4,
            "author": "HopermanTheManOfFeel"
        },
        {
            "level": 0,
            "comment": "Isn't that book a lesson against bullying?\n\nWhy would a principal want it banned?",
            "score": 3,
            "author": "MithranArkanere",
            "replies": []
        },
        {
            "level": 0,
            "comment": "“Poisonous leaders use their power to protect their evil,” said Laurie Halse Anderson, upon the news of Wilson’s arrest.",
            "score": 4,
            "author": "marchillo"
        },
        {
            "level": 0,
            "comment": "Once again we find that the people who want to police everyone else are the ones who are the problem",
            "score": 4,
            "author": "coyo7e"
        },
        {
            "level": 0,
            "comment": "Another rousing game of Florida. Georgia. Or Alabama?",
            "score": 3,
            "author": "abelabelabel",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I will bet money I could guess how he votes.",
            "score": 3,
            "author": "Hubcapdiamond"
        }
    ]
}