{
    "id": "j2plau",
    "score": 52048,
    "title": "I hate when the back of a book is devoid of a synopsis and is replaced with critical acclaim",
    "author": "Von_Dorton",
    "date": 1601483801.0,
    "url": "https://www.reddit.com/r/books/comments/j2plau",
    "media_urls": [],
    "other_urls": [],
    "postText": "Just something that I find quite annoying when looking for a new book, especially when trying to pick up a classic. I don't mind if there's a few reviews or even an opening paragraph that talks about the novels success but please give me some idea of what its actually about.\n\nAn example: To Kill a Mockingbird. I've been trying to catch up on some classics and this book was not taught in my high school and surprisingly, I know very little about its plot. It's back cover and Goodreads synopsis is nothing but praise and I don't to ruin it by reading the Wikipedia plot. \n\nDoes this bother anyone else?",
    "comments": [
        {
            "level": 0,
            "comment": "“RIVETING!” - Hank McDowell or something\n\n“A heartfelt read from start to finish.” - Patricia Clements probably \n\nAnd dont forget the\n\n“New York Times #1 Best Seller”",
            "score": 548,
            "author": "The_Spicy_Memes_Chef",
            "replies": [
                {
                    "level": 1,
                    "comment": "Even movie trailers do the same thing. Beyond a point i would not want to know what someone thought of it. Just tell me what i am about to see/read, thank you very much. \n\nSmh.",
                    "score": 91,
                    "author": "alucardosa",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Movie trailers are even worse with this. I feel like half the movie trailers I see just have a critic star rating and a close up shot of the actors and I'm left with zero clue what the basic premise of the plot is",
                            "score": 39,
                            "author": "MllePerso",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Either that or I feel like I've watched the movie already because it shows every beat.",
                                    "score": 32,
                                    "author": "Cunt_Bag"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Even worse, when the back of the book has acclaim for a DIFFERENT BOOK the author also wrote (see Artemis by Andy Weir)",
            "score": 358,
            "author": "Wrathanet",
            "replies": [
                {
                    "level": 1,
                    "comment": "Maybe they couldn't find anyone to give praise to Artemis because it was an awful book.",
                    "score": 82,
                    "author": "vishuno",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean it wasn't awful. Just like, eh, pretty forgettable. Wasn't it a teen novel anyways? I think teens would definitely love it.",
                            "score": 21,
                            "author": "MarsupialKing",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Only somewhat acceptable if it a sequel and the praise is for earlier books in the series.",
                    "score": 25,
                    "author": "zeth4"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“The New York Times n. 1 bestseller!” Literally every book sold ever.",
            "score": 6662,
            "author": "Future1985",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"I loved it!\" -Famous author, who likely just skimmed the book and has nothing to say, because people probably send them a billion new books to write a blurb for these days.",
                    "score": 2637,
                    "author": "Tasseikan33",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"The most terrifying book I've read this year\" - Stephen King (on every horror novel published pre 2010)",
                            "score": 2142,
                            "author": "Rgeneb1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"I work so hard this was the only book I read this year.\" - Stephen King, probably",
                                    "score": 832,
                                    "author": "LinkandShiek",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I know this is a joke, but I believe Stephen King actually reads like 70-80 books a year",
                                            "score": 594,
                                            "author": "americany13",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Aside from pleasure, it's good research and inspiration. How does he stay awake without the cocaine?",
                                                    "score": 477,
                                                    "author": "LinkandShiek",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "He just reads or writes for 8 hours every day",
                                                            "score": 283,
                                                            "author": "americany13",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Living the good life and making bank. Work hard at what you love and you'll never work a day in your life.",
                                                                    "score": 210,
                                                                    "author": "thinkpadius",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I want to cross stich this and send it to George RR Martin",
                                                                            "score": 194,
                                                                            "author": "LucretiusCarus",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "There was an Onion article on how Stephen King just decided to finish ASOIAF, and it didn't even take him that long lol.",
                                                                                    "score": 191,
                                                                                    "author": "mahones403",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Don't worry. By the time he finishes his last book he too will finally know what it's like to never work a day in his life again.",
                                                                                    "score": 36,
                                                                                    "author": "LinkandShiek",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Get a job at what you love and you’ll hate doing it outside of work.",
                                                                            "score": 64,
                                                                            "author": "Gnomologist",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I think Stephen king is an unusual case where he would be reading and writing 8 hours a day regardless. He’s coincidentally also talented enough that he makes a lot of money",
                                                                                    "score": 34,
                                                                                    "author": "[deleted]"
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "'My uncle said if you do what you love you'll never work a day in your life. He did heroin.' - Frankie Boyle.",
                                                                            "score": 22,
                                                                            "author": "Suibian_ni"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Can't pay the bills with wanking and PS4 mate",
                                                                            "score": 51,
                                                                            "author": "BadAppleInc",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "All you need is an onlyfans account and you're set.",
                                                                                    "score": 30,
                                                                                    "author": "thinkpadius",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Not with that attitude!",
                                                                                    "score": 11,
                                                                                    "author": "RainbowSecrets"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "He's like Bradley Cooper giving that speech to Robert DeNiro at the end of *Limitless*. \n\n\"Did you think that much cocaine didn't have a permanent affect on my mind? Did you think it didn't change me?\"",
                                                            "score": 60,
                                                            "author": "TheBirminghamBear",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Read *On Writing* - it's my favorite Stephen King book. He lays everything out in immaculate detail but is inspirational, too. I highly recommend it for anyone who thinks King is \"just\" a horror/sci-fi/whatever writer",
                                                            "score": 45,
                                                            "author": "huxley75",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I listened to it on audiobook and honestly Stephen King yelling \"If you're good at something, why in heck wouldn't ya DO IT?\" in his weird Maine accent has motivated me to write more than basically anything else I've come across.",
                                                                    "score": 26,
                                                                    "author": "absolutpalm"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Helps that his day job is fairly flexible.",
                                                            "score": 56,
                                                            "author": "PointMaker4Jesus",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "You’re thinking of George RR Martin. Stephen King actually makes a point to write many hours a day as if he was going to an office job.",
                                                                    "score": 39,
                                                                    "author": "MrNickNifty"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Dude.. that's crazy. My goal last year was to read 25 books. I read 18",
                                                    "score": 52,
                                                    "author": "peeparonipupza",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Try jail. I read 23 in 45 days.",
                                                            "score": 94,
                                                            "author": "dragonsign",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "R/shittyprolifetips\n\nWhat kind of books did you read?",
                                                                    "score": 62,
                                                                    "author": "peeparonipupza",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I actually had to branch out of my comfort zone because we weren't allowed to physically go to the library.  I filled out a card with general information and hoped for the best. I ended up with the second Outlander book which I enjoyed. Another one I remember liking was a non-fiction book about an early expedition to Antarctica (I think it was 'Endurance'). The one that surprised me the most was around an 800 page fiction about the opium trade in India in the early 1800s. I really wish I could remember the name of that one. Worst experience was putting Harry Potter as a possible choice and receiving some evangelical fanatic's book about how Harry Potter was the devil (it even used the HP font which I thought was ballsy).",
                                                                            "score": 40,
                                                                            "author": "dragonsign",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Was there opium one Sea of Poppies?",
                                                                                    "score": 16,
                                                                                    "author": "binkymcphee",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Read, sleep, eat, repeat. Jail is mostly just boring, according to the (former) inmates I know",
                                                                    "score": 15,
                                                                    "author": "JustAKeith",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "The worst part are the dementors.",
                                                                            "score": 47,
                                                                            "author": "axonrecall",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "80 books a year averages to something like 8-9 hours of focused reading time per week. It is about time spent doing the activity more than anything else. To spend time on it requires enjoyment though, so that is the biggest part.\n\n(Assuming reading speed of 300 words a minute and 100k words per book.)\n\nHopefully you had a lot of fun in the other activities you spent the time on. I would highly recommend audio books if commutes takes up a lot of time. If 1h commute in one direction you can probably average a book a week from it.",
                                                            "score": 22,
                                                            "author": "Sosseres",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "good job mate",
                                                            "score": 17,
                                                            "author": "monsieurburritoroll",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Thank you 🥺 I was upset I didn't make goal, but still proud because that is something that needs time out of your day.",
                                                                    "score": 13,
                                                                    "author": "peeparonipupza",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "18 books is way more than most people! You did great 🙂",
                                                                            "score": 18,
                                                                            "author": "lkjw104"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Eighteen is likely more than you would have read if you weren't aiming for something in the first place.",
                                                                            "score": 13,
                                                                            "author": "IMadeAnAccountAgain",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "He's always maintained that he reads pretty much constantly. He even keeps audiobooks in his car. I think the dude is just a prodigy when it comes to output",
                                                    "score": 30,
                                                    "author": "OctopusPudding",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I believe King really does write those books that have his name on them...\n\nBut how the hell does anyone explain James Patterson? Wikipedia lists something like 300 titles, and his career got a later start than King's.",
                                                            "score": 24,
                                                            "author": "NoMoreNicksLeft",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Patterson uses a whole team of ghostwriters. It's not a secret or anything -- both him and his publishers admit it.\n\nHe runs a hell of a business, and comes up with some decent ideas, but he's not the same kind of author as Stephen King.",
                                                                    "score": 40,
                                                                    "author": "budshitman",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Georges Simenon (creator of Maigret) had a phenomenal output of over 500 books including 200 novels plus numerous novellas and short stories. He frequently wrote up to 80 pages a day. \n\nHe generally took 11 days to write a novel - 8 days for writing and 3 for editing.  His publisher, irritated by a rival advert for a reclusive author’s first book in decades, brought out a similar one for Simenon: ‘his first novel since last weekend’...",
                                                                    "score": 16,
                                                                    "author": "akiralx26",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I love good old King, but his book endorsements are a joke.",
                                    "score": 107,
                                    "author": "Future1985",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "For what he's probably paid for them, can't say I  blame him too much.",
                                            "score": 85,
                                            "author": "glitchedgamer",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "\"I'm Commander Shepherd and this is my favourite store on the Citadel\"",
                                                    "score": 92,
                                                    "author": "Vectorman1989",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "good lord that trilogy was so amazing",
                                                            "score": 15,
                                                            "author": "28GendersLater"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "He largely does it to support new writers, he's always tried to encourage and help other authors get established. He probably remembers his own rough beginnings as a writer. His book \"On Writing\" reflects both his own background *and* his  encouragement to new authors.",
                                            "score": 18,
                                            "author": "J662b486h"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "He called Catch-22 one of the 2 great American novels written in the past 50 years, and honestly I agreed with him on that one. Wonder what the other one is though.",
                                            "score": 15,
                                            "author": "DoofusYoofus",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "The secret is, he knows how scary each book is and he reads them in ascending order throughout the year.",
                                    "score": 10,
                                    "author": "meddlingbarista"
                                },
                                {
                                    "level": 3,
                                    "comment": "I think he actually reads some of the books he writes endorsements for maybe even all of them, but his comments might be a bit over the top sometimes.",
                                    "score": 17,
                                    "author": "Del3te-O",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Of course, the art of the blurb is in the cutting....\n\n “The most terrifying book I've read this year. The only thing preventing me from dying of boredom was the chill I felt with each new page, wondering what sort of insane doggerel the author could produce, what new depths of inanity, what new ways of mangling the English language into something that would embarrass even the lowest and most desperate alcoholic and disease-ridden hack. For the love of God, man, the universe, and all that is holy and unholy, *Do Not Read This Book!*” —Stephen King",
                                    "score": 41,
                                    "author": "snogglethorpe",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "~~The most terrifying book~~ **I** ~~'ve read this year. The only thing preventing me from dying of boredom was the chill I felt each with new page, wondering what sort of insane doggerel the author could produce, what new depths of inanity, what new ways of mangling the English language into something that would embarrass even the lowest and most desperate alcoholic and disease-ridden hack. For the~~ **love** ~~of God, man, the universe, and all that is holy and unholy, Do Not Read~~ **This Book!** —Stephen King",
                                            "score": 28,
                                            "author": "orrocos"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I just checked my copy of Dracula, it wasn't there.",
                                    "score": 29,
                                    "author": "Wuntoothrie",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Fair enough, he did write the [preface](https://imgur.com/CduhZ1S) for that one though. Or was it the [introduction](https://imgur.com/0H6LmCa)?\n\nI do like how in that second pic Kings name is bigger than Bram Stokers (and Shelley or Stevensons).",
                                            "score": 33,
                                            "author": "Rgeneb1"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "“You'll have whiplash until the very end. {Insert book name} will leave the most sure footed reader uneasy until the last word is read.” - (Insert Your name) *New York times bestselling author of* -\n\n“I couldn't put it down... Nail-biting, heart-clenchingly good from the start, with characters that you both root and cringe for. I loved every word. Six stars.” - (Insert Your name) *New York times bestselling author of* -\n\n&gt;!From: New York times bestselling author's fake reviews generator!&lt;",
                            "score": 124,
                            "author": "leonao22",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "One of my coworkers favorites - \"Gripping...\" (she had issues with her hands/wrists)",
                                    "score": 69,
                                    "author": "disneyfacts",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"A gripping Page-turner...\"\n\n\"A gripping tale of... that wonderfully illustrates the... of...\"\n\n\"A gripping story of... that describes the ups and downs of.... \"",
                                            "score": 20,
                                            "author": "leonao22",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Or he got paid by the publishing house for the endorsement.",
                            "score": 33,
                            "author": "Wuntoothrie",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yup. I wonder how much they get paid for that....",
                                    "score": 9,
                                    "author": "TeacherPatti",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Quote: \"If I said I loved it, that would be a lie\"\n\nBook cover: \"...I loved it...\"",
                            "score": 43,
                            "author": "_SmokeDeGrasseTyson_"
                        },
                        {
                            "level": 2,
                            "comment": "Even better is when it's about the first book in a series and they use it for the next 6 books.",
                            "score": 18,
                            "author": "SirFrancis_Bacon",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt;Famous author, who likely just skimmed the book and has nothing to say\n\nOne guy who never does this is George R.R. Martin. That man is constantly reading and prepping for Sci-Fi award votes, and really seems to take giving reviews seriously.",
                            "score": 37,
                            "author": "bobo377",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "His career was given a boost by Robert Jordan lavishing praise on Game of Thrones.  He knows what a difference stuff like that can make.",
                                    "score": 57,
                                    "author": "TreyWriter",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "What's he been up to lately? We already know he hasn't been working on ASOIAF.",
                                    "score": 12,
                                    "author": "atetuna",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Apparently just reading and reviewing books!",
                                            "score": 29,
                                            "author": "TheOneWhoMixes",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If only we could trick him into thinking he's still writing reviews, but actually finishing ASOIAF.",
                                                    "score": 14,
                                                    "author": "atetuna",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "\"Huh. The Winds of Winter started off great, but partway through the plot came to a standstill and the narrator started giving a glowing review of The Expanse series.\" \n\nIt would still probably be a better ending than what we got with the show",
                                                            "score": 12,
                                                            "author": "askyourmom469"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Which is meaningless because you only need to sell like 10,000 copies to be on the bestseller list, and publishers can manipulate it by pre-ordering copies",
                    "score": 312,
                    "author": "BlacknWhiteMoose",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You also have to be from a pre-approved publisher, too. So entire swaths of books that sell in titanic numbers, like *The Martian*, aren't even allowed on the list.",
                            "score": 269,
                            "author": "vikingzx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Random anecdote about The Martian, Weir has this story where he was talking about the moment he realized he'd made something serious. When you post a book into the Amazon Kindle store, you get access to an authors forum, and a frequent thing posted there is an author celebrating that their daily purchase count is now in the double digits, frequently like 10-15/day or so, with other authors congratulating them. One day relatively early on after seeing another of these posts, he figured he'd go and check his count, and it was a couple hundred a day.",
                                    "score": 198,
                                    "author": "Mazon_Del",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I love that book, it's one of the few that I'll often re-visit",
                                            "score": 51,
                                            "author": "yawya",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Agreed.\n\nAnd I quite love the movie, even though it left out some things (like the dust storm). Honestly though, I think if they DID go into showing more of the problems Watney experienced, they'd get into the territory of \"We get it already, his life sucks, move on!\" for a good portion of the audience.\n\nStill though....it would only have taken like an extra 2 minutes to add in the problems of Pathfinder. As the writer of XKCD put it \"Never have I seen so accurately depicted that moment of utter horror when you realize that you have accidentally just irretrievably bricked something that you absolutely cannot do without as in The Martian.\".",
                                                    "score": 68,
                                                    "author": "Mazon_Del",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;it would only have taken like an extra 2 minutes to add in the problems of Pathfinder. \n\n especially when they kept the thing about being a space pirate in",
                                                            "score": 21,
                                                            "author": "yawya",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "My dad was a bookstore manager and told me that part of why Scientology was able to take off in the '70s was that they purchased tons of copies of their own book, *Dianetics,* thus artificially inflating its popularity.\n\nYears later, when Tom Cruise and Katie Holmes appeared on the cover of *People,* the Scientologists did the same thing with that issue.",
                            "score": 78,
                            "author": "ugagradlady",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Honestly, that doesn’t surprise me at all, now that I think more about it. It seems like something that a lot of politically / religiously charged groups do with books and periodicals that align with their views.",
                                    "score": 28,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "They'd buy them, then ship them back to the factory to be sent out to be resold again.\n\nWaldenbooks would get copies of their crap with the price stickers already on the cover.",
                                    "score": 13,
                                    "author": "NoMoreNicksLeft",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I did this to help Mike Duncan become a best seller haha. Not really a publisher manipulating, but a bunch of fans who wanted to show support.",
                            "score": 30,
                            "author": "BigCoffeeEnergy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ahhh I can't wait for Citizen Lafayette! Mike Duncan is an absolute champ.",
                                    "score": 7,
                                    "author": "KingToasty"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The bar for bestseller is extremely low. I think the requirement is only like 5000 copies and it is restricted to publishing companies located in New York.\n\nAlso interesting, Ben Kissel of LPOTL said that when he worked for fox news it wasn't uncommon to see entire boxes of news anchors books stacked in offices.",
                    "score": 104,
                    "author": "BigCoffeeEnergy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yet another way e-books are great. You can stack literally billions in your office. \n\n/s",
                            "score": 24,
                            "author": "pain_in_the_dupa"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "A story from a years ago- my buddy had just started dating a girl, and we all went out to eat dinner. During dinner conversation, I asked what her interests were. She said she loved reading. I asked what her current book was. She said Twilight. I hadn’t heard of it (this was years ago, and it had just come out) so I asked what it was about. She said “it’s a New York Times Bestseller!” and nothing else. Nothing about sparkly vampire romance, just NYT Bestseller.",
                    "score": 55,
                    "author": "PrincessAstronaut",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Maybe that was the nicest thing she could think to say about it.",
                            "score": 19,
                            "author": "Rork310"
                        },
                        {
                            "level": 2,
                            "comment": "My sister told me about how in the book the dog guy is in love with the girl, but she is in love with the sparkly vampire. Then she gets pregnant and the dog guy visits her and falls in love with the baby in her belly and I think the baby does too. She later gives birth and her baby rapidly grows so dog guy and baby girl can be together without it being weird (sarcastic air-quotes).  \nI thought my sister was messing with me. She ensured me it was true. After a lot of convincing I believed her 51%. I later saw part of the movies on TV and got confirmation it was actually true. WTF.",
                            "score": 5,
                            "author": "dnepe"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\"Amazon top seller!\" Which is was for the one week the self published author put it up on kindle for free.",
                    "score": 12,
                    "author": "ayshasmysha"
                },
                {
                    "level": 1,
                    "comment": "I have a copy of Asymmetry (Lisa Halliday) and I'd recommend buying a copy just for the sheer number of quotes on the front, back and first two 'pages' (which is really just an extra cover. \n\nOh, I forgot to mention, theres more praise on the first page. \n\nAnybody want to guess how many quotes there are?? \n\n\nI'll spoil it. \n\nThirty... Thirty quotes of people/magazines praising the book.",
                    "score": 48,
                    "author": "fishermen013",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's the kind of thing I'd expect a comedian putting together a book of \"famous funny quotes\" to do.",
                            "score": 20,
                            "author": "garrett_k",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Or the book itself is the joke. It just has a generic forgettable title, then the whole thing is just pages and pages of made up quotes praising the book that get more and more extreme and absurd the deeper you go. Occasionally they include brief mentions of favorite events or characters from a plot the reader never gets to directly see, and we're left to try and reconstruct the plot of the greatest story ever written using only those.",
                                    "score": 22,
                                    "author": "Jetz72",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\"You'll have whiplash until the very end. {Insert book name} will leave the most sure footed reader uneasy until the last word is read.\" - (Insert Your name) *New York times bestselling author of* -\n\n\"I couldn't put it down... Nail-biting, heart-clenchingly good from the start, with characters that you both root and cringe for. I loved every word. Six stars.\" - (Insert Your name) *New York times bestselling author of* -\n\n&gt;!From: New York times bestselling author's fake reviews generator!&lt;",
                    "score": 25,
                    "author": "leonao22",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "It's a sham, I believe. Maybe I'll track down the info but I feel the marketing behind those is firmly in the camp of questionable practice. If I recall correctly they purposely allow each title a short frame where it will get on top of that list and kindly make way for the next. Like a revolving door.",
                    "score": 10,
                    "author": "eatrepeat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "i love [this tumblr text post](https://img.ifunny.co/images/666db2c024006605845582797e7ae95d58ccfe3dc4ae56a5a7c199ebdfe64d09_1.jpg) it perfectly encapsulates your feelings on it\n\n&gt;**me, begging, tears in my eyes:** please. please just tell me what the book is about. the plot. please  \n&gt;  \n&gt;**a book annotation on the cover, unfazed:** A Subversive Masterpiece. A Deep And Touching Story. The New York Times Bestseller. Go Fuck Yourself",
            "score": 217,
            "author": "rivaltor_",
            "replies": [
                {
                    "level": 1,
                    "comment": "But where else would you put a giant picture of the author, gazing judgmentally on your ignorance, if not over a “New York Times Bestseller!” quote?",
                    "score": 23,
                    "author": "thebirdisdead"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Absolutely agree. I don't mind a couple reviews, but dammit, tell me what the thing is about!",
            "score": 999,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just want to know if someone thinks it is a *tour de force*.  Any book anyone's ever called a *tour de force*, I'm reading that shit.",
                    "score": 458,
                    "author": "Kule7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "\"What genre do you read?\"\n\n\"Mostly just tour de force.\"",
                            "score": 376,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This book is a Tour de France",
                                    "score": 93,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I thought it was a Tour de Farce",
                                            "score": 37,
                                            "author": "outthawazoo"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You're expected to consume 6000 calories a day while reading it.",
                                            "score": 16,
                                            "author": "dragonard",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "That's true. Last book I read advertised as a *tour de force* was The Making of the Atomic Bomb by Richard Rhodes and... it actually was a *tour de force*.\n\nAbsolute freight train of a book",
                            "score": 41,
                            "author": "camwow13",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh god, that's sitting on my bookshelf right now, waiting to be read. On the one hand, I've heard it's an incredible book and I'm very interested in the topic; on the other, it looks so long and possibly overwhelming",
                                    "score": 9,
                                    "author": "rikkirikkiparmparm",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I only care for a review if it's from a relevant author. If you are writing a comedy fantasy novel and Neil Gaiman gives you a great review you absolutely deserve to rep that.",
                    "score": 85,
                    "author": "Isord",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This I can get behind. Reviews from credible, well-known authors can be interesting. But I still don't want 20 of those reviews.",
                            "score": 34,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "Ugh, I was at BookCon and picked up a galley that did not have a synopsis but had a raving review from Stephen King in the front so I figured why not.\n\nNot only was the book an absolute snoozer, but there was very explicit incest that made me want to hurl. Never trusting Stephen King again.",
                            "score": 17,
                            "author": "Fiveofwands",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "So true - one glowing review from a notable author in the genre is perfect... IN ADDITION TO a synopsis!",
                            "score": 29,
                            "author": "breakfastfordessert"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Personally I'm the exact opposite. The less I know about a book the better and I find that the stuff on the back often tells me far more than I want to know. I like to go into a book pretty much blind.\n\nBecause of that I find the quotes useful, not so much in what they say but who they choose to pick because that gives you a great idea of who they see the book's audience as and can often give you a good idea of the genre.",
                    "score": 37,
                    "author": "Percinho",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There needs to be a balance. Like a good trailer. It needs enough information to get you interested in the topic but also not spoil any highlights or plot reveals.\n\nMost people do only read the title of any given book tho. Which is why the “lightnovel and manga” community adapted by naming their stories in what are basically summaries. Which takes away any individuality the story beings to the genre, since it just says it’s generic with 1 twist.\n\nIt really annoys me.",
                            "score": 22,
                            "author": "Nerd-Hoovy",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yep, I also hate when the introduction completely spoils the book. It's so common with editions of classic books that I've taken to reading the introduction last a lot of the time, especially if I start to skip through it and it feels too spoilery.\n\nSo many of them are like:\n\"And the significance of this character's death is...\"\n:(",
            "score": 809,
            "author": "Tasseikan33",
            "replies": [
                {
                    "level": 1,
                    "comment": "Or blurbs themselves. One book, which I won't name, had the in the blub \"an ill-fated romance\", which neatly informed me of how that love affair would turn out. The word 'ill-fated' should surely be on an editor's list of what not to include in a blurb.",
                    "score": 319,
                    "author": "SkipToTheEnd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I just finished a book where the back cover synopsis described the entire plot, including a huge twist you don't find out about until the second to last chapter, hundreds of pages into the book.",
                            "score": 206,
                            "author": "sheffieldasslingdoux",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "they are becoming like movie trailers these days, spoils everything",
                                    "score": 92,
                                    "author": "CorrectMySwedish",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes! I will watch teasers but I rarely watch trailers anymore. I also hate when shows have \" on the next episode....blah blah every twist coming up spoiled\". I always skip them now and hate when I can't get to the remote in time.",
                                            "score": 50,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It's just as bad when a show has \"Previously on...\"  which then proceeds to show you characters or places that haven't been seen in a while, spoiling the fact that something is going to happen in this episode pertaining to that.",
                                                    "score": 33,
                                                    "author": "VisualBasic",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I bought a new print series of Dune. The backs are literally a one paragraph description of the whole plot, ending and all. I'm not even exaggerating. Who thought that was wise? Please tell me.",
                                    "score": 11,
                                    "author": "wildwestington"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Introductions are also terribly boring half the time. “Ah, a new book, and a classic too.  Time to jump into the magical world of ... how this book affected certain aspects of mid-century English-language novel writing.”",
                    "score": 221,
                    "author": "tr0ub4d0r",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Generally I get the sense that introductions and forwards are marketing tools to convince someone to buy a second edition of the book solely for reread purposes.",
                            "score": 56,
                            "author": "awfullotofocelots",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For these books, it's the only material in the book under copywrite protection, too.",
                                    "score": 31,
                                    "author": "garrett_k"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Don Quixote has the best intro of any classic I’ve ever read. It’s written by Cervantes himself and is basically several pages of him admitting he has no idea how to write a “proper” introduction and is killing time to make his publisher happy.\n\nThe second volume, published several years after the first, has a separate introduction that is also classic. After the first volume was published there was a cottage industry of unofficial sequels while Cervantes worked on the second. In the intro Cervantes says he will decline to comment on these plagiarists, and is “content to let their work be its own punishment”.",
                    "score": 106,
                    "author": "Rusty_Shakalford",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; cottage industry of unofficial sequels to the first volume\n\nOr as it's referred to now, fanfiction.",
                            "score": 59,
                            "author": "frogjg2003",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Except back then you could publish it and make money without having to change their names.",
                                    "score": 44,
                                    "author": "Rusty_Shakalford",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Don Quixote has the best intro\n\nSpecifically called a preface when it's written by the author. Found it here: https://www.gutenberg.org/files/5903/5903-h/5903-h.htm (search for The Author's Preface)",
                            "score": 20,
                            "author": "you-are-not-yourself"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "People writing the introductions assume everyone has read the book because it's a classic. If that were the case, why would I buy the book?",
                    "score": 111,
                    "author": "Freakears",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because it makes you look smarter when it's on the shelf behind your desk",
                            "score": 66,
                            "author": "kdt05b",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Make sure to cut the pages apart so it looks like you've actually read it.",
                                    "score": 14,
                                    "author": "Jechtael",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I always read the introduction after the book. What bothers me is when the footnotes/endnotes spoil a classic book. I forget what book I was reading, but for the first couple of chapters the endnotes were the usual clarifications of 19th century political references, biblical allusions, etc. Then a note said something like \"The association of the tulip with Character A will continue throughout the book up to her death.\"",
                    "score": 19,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Particularly awful with a lot of Amazon kindle books, putting a synopsis literally as the default page before the actual book. I bought the book because I want to read it, not because I want someone else to tell me about it.",
                    "score": 16,
                    "author": "soayherder"
                },
                {
                    "level": 1,
                    "comment": "My Foundation trilogy edition has a prologue with a guy just outright telling the plot of the first 800 pages (it has 900), then he says \"I won't say anything else, since I want you to discover for yourselves!\" It astounds me to this day. Thankfully I realized he was spoiling stuff before reading it for the first time",
                    "score": 13,
                    "author": "JaviVader9"
                },
                {
                    "level": 1,
                    "comment": "Oh man I see this all the time when comic books are collected in a trade. They'll usually have a super long introduction that has a spoiler. I feel like these would be better as an afterword. (I'm looking at you Swamp Thing)",
                    "score": 20,
                    "author": "trident_zx"
                },
                {
                    "level": 1,
                    "comment": "Right. But once the author of the introduction started by recommending that you read that part after finishing the book. I really appreciated it. I think it was \"David Copperfield\", the Penguin edition.",
                    "score": 9,
                    "author": "levenspiel_s"
                },
                {
                    "level": 1,
                    "comment": "Oh yea. The purpose of an intro or that little bit on the back cover or inner jacket *should* be to draw potential readers in with the first plot hooks they’d get in the first chapter, and summarize the setting/basic ideas so that readers know if they’re in for a love triangle or what. Revealing any more than the first major plot hook/twist is just ruining the book (think chosen one; revealing that the MC is a ‘chosen one’ in whatever way is usually presented as a bit of a twist/grand reveal at the beginning of the book, and can be included safely most of the time).\n\nMan, I just want to know if I’m in for some Unnecessary YA Romance^TM (looking at you, Glass Throne, I just want people to be friends and be much less dramatic about it) or what. I don’t want a map to the things that are supposed to surprise me.",
                    "score": 6,
                    "author": "enderflight"
                }
            ]
        },
        {
            "level": 0,
            "comment": "TL;DR:\n\nThis post is amazing. A definite should-read. If you read only one post in 2020, read this one.\n\n\"Startling.\" -- /u/justscottaustin\n\n\"Brave.\" -- /r/TwoXChromosomes\n\n\"You have been banned\" -- /r/politics\n\n\"He doesn't reference tacos or traffic.\" -- /r/Austin",
            "score": 2045,
            "author": "justscottaustin",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"Boring slog, don't understand the hype.\" r/books\n\n\"I'd repost it if I could\"  u/gallowboob",
                    "score": 137,
                    "author": "Doc_Dante",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Only on the back of the book\n“....understand the hype” r/books\n“I’d repost it if I could” u/gallowboob",
                            "score": 18,
                            "author": "rvolving529_"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Don't forget the excessive use of ellipses.\n\n\"Illuminatingly....startling...the best novel of year\" - Random newspaper that isn't really known for book reviews.",
                    "score": 480,
                    "author": "sheffieldasslingdoux",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ellipses in quotes mean parts of the sentence have been withheld, don’t they?",
                            "score": 177,
                            "author": "notmynamenotmyface",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep, so \"Illuminatingly....startling...the best novel of year\"\n\nCould have come from “Illuminatingly shows the lack of quality from today’s authors. It is absolutely startling how bad this book is; it is definitely not the best novel of the year”",
                                    "score": 337,
                                    "author": "Ihaveamodel3",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Do ellipses enclosed in square brackets mean something different?",
                                            "score": 43,
                                            "author": "Pony13",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I think the ellipses are supposed to be in brackets to indicate that they aren't part of the quote.  So if I said \"I never drink... wine.\" you would quote me using that exact text between the quotes, but if I said \"I never drink alcohol, especially wine\" you might quote \"I never drink [...] wine\"\n\nBut that's something like MLA formatting rules, and I don't think anyone would care about the distinction when printing a review in a newspaper or on a book jacket.  I don't think I've seen the bracketed use outside of academic papers.",
                                                    "score": 102,
                                                    "author": "hamakabi",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I don’t know. That is out of my depth of knowledge.",
                                                    "score": 13,
                                                    "author": "Ihaveamodel3",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I know you’re answering a question on your own comment. But this read like an amazon question being answered by a grandma",
                                                            "score": 33,
                                                            "author": "NotFromStateFarmJake",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "\"This is good I used it just last week.\" -- /r/SubredditSimulator",
                    "score": 18,
                    "author": "Pyitoechito"
                },
                {
                    "level": 1,
                    "comment": "Holy shit, I should read this post.  This is all the info I need.",
                    "score": 57,
                    "author": "tr0ub4d0r"
                },
                {
                    "level": 1,
                    "comment": "Nailed r/Austin and I say that as a loving Austinite",
                    "score": 17,
                    "author": "OctopusPudding"
                },
                {
                    "level": 1,
                    "comment": "&gt;\"He doesn't reference tacos or traffic.\" -- [/r/Austin](https://www.reddit.com/r/Austin)\n\nAccurate.",
                    "score": 13,
                    "author": "Mr_Wilcox"
                },
                {
                    "level": 1,
                    "comment": "actually LOL'd at work, thank you!",
                    "score": 16,
                    "author": "nozbanguela",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ya know what I hate? When in big bold letters it says “EDITED BY GEORGE R R MARTIN” so that it’s bigger than the actual title and then in small letters it has the actual author.\n\nEDITED BY GEORGE R R MARTIN",
            "score": 69,
            "author": "Legeto",
            "replies": [
                {
                    "level": 1,
                    "comment": "Ahh, I see you bought Wildcards.",
                    "score": 9,
                    "author": "mycatisamonsterbaby",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "READ BY GEORGE R R MARTIN WHEN HE DAMN WELL SHOULD HAVE BEEN DOING SOMETHING ELSE, HE KNOWS WHAT THAT IS",
                    "score": 7,
                    "author": "Berics_Privateer"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I came across this on Amazon the other day - a Stephen King novel that I hadn’t seen before, you scroll down in the description and it pretty much just has puff reviews, and a bit about who Stephen King is - as if anybody really needs to know that!  I eventually found a synopsis, in a manner that kind of defeats the original point, by finding a picture of the back cover which did actually have it, but it should really have been on the Amazon listing, too.",
            "score": 134,
            "author": "WotanMjolnir",
            "replies": [
                {
                    "level": 1,
                    "comment": "I bet it said stephen king's lives with his wife author tabitha king in Bangor maine",
                    "score": 99,
                    "author": "Mandelbrot360",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yep - exactly the kind of thing that gives you insight into whether you’ll like the book!",
                            "score": 44,
                            "author": "WotanMjolnir",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "“Tabitha is a really spooky name, I bet this King guy is a great horror writer!”",
                                    "score": 17,
                                    "author": "TreyWriter"
                                },
                                {
                                    "level": 3,
                                    "comment": "Excuse me I only read books by authors who live with their wives in Bangor, Maine.\n\nJust annoyed more books don’t list this critical\nInfo",
                                    "score": 12,
                                    "author": "BritishLibrary"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "also a picture where maybe he should've shaved between his eyes first",
                            "score": 14,
                            "author": "efn95",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I remember dean koontz's used to always say he lived with his golden retreiver trixie... then one day it said. It said trixie had passed. Made me a little sad knowing how much he loves golden retreivers",
                                    "score": 4,
                                    "author": "Mandelbrot360"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Amazon pages can be just as bad for this! Want to know what a books about? Who cares!! Just read a page full of comments, rave reviews and five star ratings from random people!!\n\nDrives me mad, and clearly if it ain't worth telling you what is about, it can't be worth reading",
                    "score": 20,
                    "author": "Scooby359"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I can give you a quick spoiler free summary of to kill a mocking bird. It's set in the south from the point of view of a child. Her dads a lawyer and it's all about a trial and how racism in the south may or may not affect the outcome of the trial. Its really good and has some good sub plots like the famous boo radley character. I agree with those back reviews very good book.",
            "score": 110,
            "author": "greenrosepdtl",
            "replies": [
                {
                    "level": 1,
                    "comment": "Came here looking for this, too. \n\nTo add: I used to teach high school history and my AP freshmen read this book in their ELA class. \n\nThey *hated* it. To be fair, the first few chapters are a bit “where the hell is this going?” (Quite a bit of character development and getting the reader fully into the mind of the child narrator.)\n\nI told my kids they could decide they hated it at page 100. They all happily agreed to wait until page 100 to throw the book at the wall. \n\nNone of them ever did. \n\nIt’s a great book.",
                    "score": 31,
                    "author": "TheMottster",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah it's a little more of a  slice of life type book at first while it establishes the characters but you need it all so you can understand the culture at the time",
                            "score": 9,
                            "author": "greenrosepdtl"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm much more bothered when I pick up a book and major plot points are spoiled in the jacket copy, tbh.",
            "score": 36,
            "author": "larowin",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same here. I actively avoid reading anything on the back cover of a book. Not worth the risk.",
                    "score": 8,
                    "author": "Hen_Teaser"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Yes!  Me too.  Also, when the front of the book has some celebrity book club \"sticker\".  Especially one that cannot be removed.  They are ugly, disrespectful to the cover design and are just annoying.",
            "score": 199,
            "author": "trueduchess",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh wow, this cover art looks amazin...**\"Soon to be a Major Motion Picture!\"**",
                    "score": 108,
                    "author": "ArethereWaffles",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And now, too, ones with the Hulu or Netflix logo on them.",
                            "score": 41,
                            "author": "JGDoll",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "for real I've been in Barnes &amp; Noble (with a gift card to use up) and had to ask an employee, \"Do you have any copies that don't have \"OPRAH'S BOOK CLUB\" plastered all over the front?\"\n\nbut apparently once a book has been featured by Oprah then every edition afterward will have that printed onto the cover so better find an old used copy somewhere",
                    "score": 61,
                    "author": "night_owl",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "For me, the most frustrating is when the cover uses stills from a film or TV adaptation. Multiply that by 10 if I bought the book prior to the adaptation being made, and the cover was updated on my kindle edition. \n\nUpdating the covers in general gets annoying. Recently I saw that all the covers for The Wheel of Time ebooks were updated. [They used to be the third row down, now they're the fourth](https://i.redd.it/n5444vp5wza31.jpg). These new ones are so damn boring. Who really decided to make each cover in a 15 book series almost identical?",
                    "score": 28,
                    "author": "Rhodie114",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Couldn’t agree more. When it comes to anything, classic or new book, I want to have a general idea of what I’m about to read. It’s not that I want to have a head start or ruin anything. More that it’s helpful to know if the book fits the general mood you are in at that point in your life",
            "score": 20,
            "author": "QuesaritoOutOfBed"
        },
        {
            "level": 0,
            "comment": "Does it not have the synopsis on the inside dust cover? It’s been a while since I’ve purchased a physical book at this point",
            "score": 153,
            "author": "DocWsky",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sometimes they don't even have the synopsis there. I never read books like that. I don't care how great it is; I'll just miss out. That's fine.",
                    "score": 118,
                    "author": "kungfu-redneck",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For most books I finish, I find I read it because the first sentence / paragraph is compelling enough to keep reading, not because someone else read it for me and skillfully summarized  the first few chapters down into a compelling enough “hook.”",
                            "score": 10,
                            "author": "awfullotofocelots"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Then you have paperbacks that still have acclaim on the back.",
                    "score": 19,
                    "author": "Freakears",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is one of my greatest pet peeves when it comes to buying books. It feels like a really lazy choice made only because they didn't want to pay for a second, more useful layout for the back cover.",
                            "score": 7,
                            "author": "NotWiddershins"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "At least here basically every hard cover book I've come across in a store was wrapped in a thin layer of plastic. That's also how books with those covers are sold.\n\nSo even if there's a synopsis there, it's useless as long as you haven't bought it",
                    "score": 25,
                    "author": "SlowRisingTurd",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In my city the venn diagram of shoplifting and book club don't overlap as much",
                            "score": 28,
                            "author": "koiven",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Plastic doesn't protect against thieves as far as i know .... at least not in my city.\n\nHard covers get wrapped because then you can't flip through the pages and possibly crease, tear or dirty them.. They're more expensive, so people can expect higher standards",
                                    "score": 14,
                                    "author": "SlowRisingTurd",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Every recent YA book:  \n\"Powerful\"  \n\"Riveting\"  \n\"A Must Read\"\n\n&amp;#x200B;\n\nUh, okay!",
            "score": 13,
            "author": "GenXLiz"
        },
        {
            "level": 0,
            "comment": "The way that [GENRE] is meant to be written.",
            "score": 10,
            "author": "1945BestYear"
        },
        {
            "level": 0,
            "comment": "Yep.. I rely on a flip through instead.\n\nEspecially annoying when the reviews include comparisons to other books and really it has no similarities beyond genre.",
            "score": 10,
            "author": "ensouls",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I don’t know if you still care, but be sure and read Mockingbird. You won’t regret it. It’s a great coming of age story but it also applies to today’s world. Don’t let it pass by. It’s my favorite of all time.",
            "score": 9,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "It not only bothers from a purely practical perspective, just because the thing I most want to know is what the book is actually *about* - it actually makes me doubt the quality of the book.  Fair or not, my impression is generally that if the book really was that good, they wouldn't have to go to such lengths to tell people how good it supposedly is.",
            "score": 9,
            "author": "BobCrosswise",
            "replies": []
        },
        {
            "level": 0,
            "comment": "As an author, this drives me nuts. It's the worst when I'm hanging out at a booth at a convention and someone walks up and picks up one of my books, clearly intrigued but not willing to engage a salesman (which they think I am), and then they get this irritated look on their face as they check the back, then check the inside of the front cover, then put it down and walk away because come on they just want to find out what it's about without talking to someone.",
            "score": 41,
            "author": "BrianMcClellan",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think if you're at a booth then this is very fixable. Put a big sign next to the pile of books that explains the plot a wee bit and wear a hat and/or tshirt that says \"I'm the author\".\n\nThough I'm questioning your writing skills if you lack the creativity to wear a hat that says \"author\". :P\n\n(And this is all tongue-in-cheek as I assume you have reasons for your actions :)",
                    "score": 18,
                    "author": "beka13",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "as an introverted reader, i think you underestimate how far some of us will go to avoid speaking to people!",
                    "score": 13,
                    "author": "no-name_silvertongue"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh, me too!  \n\nThat book looks like it might be enjoying reading but looking at the cover and inside cover and inside back cover, there is nothing to tell me what the book is actually about.  Just stupid bullshit praise.\n\nAt least with Amazon books and Amazon kindle books, you get to see a synopsis.  (This doesn't apply to some of the very old books that are free.)\n\nI've actually been in a bookstore and looked up the book on Amazon to see what it was about.",
            "score": 23,
            "author": "NoBSforGma"
        },
        {
            "level": 0,
            "comment": "I'm sort of the opposite. I like a very, very high level synopsis--but I'm talking like a sentence or two. I want to know the general setup but don't want to know *any* plot points, not even of the vague \"...but [hero] finds her plans thwarted by a powerful politician\" type.\n\nCritical reviews, on the other hand, let me orient my expectations usually without giving any of the story away.",
            "score": 75,
            "author": "The_God_of_Abraham",
            "replies": [
                {
                    "level": 1,
                    "comment": "Especially horror novels.  I don't need to know the synopsis of the first five chapters when I glance at the back of the book.",
                    "score": 11,
                    "author": "pirpirpir"
                },
                {
                    "level": 1,
                    "comment": "yeah I read The Way of Kings on ebook first, so when I saw the back cover on it spoiling half the plot points in the book I almost died.",
                    "score": 9,
                    "author": "Vipershark01",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Critical reviews as a general thing maybe. I’ve never seen a useful critic blurb on an actual book. They all pretty much say the same bunch of nothing no matter how good or bad the book is.",
                    "score": 51,
                    "author": "Muroid",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 10,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "The blurb on the back of my copy of At  Swim Two Birds is this quote\n\n'This is just the book to give your sister if she's a loud, dirty, boozy girl'\n\nSold",
                            "score": 24,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Goodreads is for reviews. \nWikipedia is for biographies.\nBack of the book cover is for the goddamned synopsis.\nIt seems pretty simple to me and I have no idea why the publishers have such a hard time trying to understand this.",
            "score": 15,
            "author": "98mk"
        },
        {
            "level": 0,
            "comment": "Yes, I agree! \n\nI get a lot of my reading from the library (so, no dust jackets and I'm just browsing until something catches my interest) and I just want to get a quick impression of the plot and themes. \n\nEven worse: when the reviews on the back are about a completely different book! Tends to happen when the previous book was a best seller.",
            "score": 5,
            "author": "flijn"
        },
        {
            "level": 0,
            "comment": "I don't like going into a story blind. Same for movies, I want to get an idea of the content before I start.\n\nAs a last resort I'll look at the page with the copyright and publisher info for subject/keywords to get at least some idea of what it's about. Not all of them have this either, but I have found it particularly useful for older, jacketless hardbacks.",
            "score": 8,
            "author": "YourClosetNinja",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Or it’s just a black and white headshot of the author",
            "score": 8,
            "author": "[deleted]",
            "replies": []
        }
    ]
}