{
    "id": "uscp6g",
    "score": 30908,
    "title": "Benjamin Franklin gave instructions on at-home abortions in a book in the 1700s",
    "author": "Sanlear",
    "date": 1652879786.0,
    "url": "https://www.reddit.com/r/books/comments/uscp6g",
    "media_urls": [
        "https://www.npr.org/2022/05/18/1099542962/abortion-ben-franklin-roe-wade-supreme-court-leak"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "More interestingly… the instructions are listed under “how to remedy a missed period” and at the end it suggests “to avoid further afflictions do not seek out pretty fellows or trash”",
            "score": 4854,
            "author": "CruisinJo214",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah. Before the quickening (when the mother could feel the baby move), abortions were pretty common, because it was literally just seen as missing a period. There were ads in the paper for it. \n\nI had a talk with a medical historian about a death cert, and the topic came up. Really interesting stuff",
                    "score": 1316,
                    "author": "EarorForofor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There can be only one  \n\n-baby Highlander",
                            "score": 293,
                            "author": "Nine_Inch_Nintendos"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yeah he means dudes like himself, who had his first son out of wedlock, and was apparently a bit of a hooer himself in his younger years...\n\n(His first son who was the British loyalist governor of New Jersey iirc and basically ran an anti-revolutionary terrorist cell during the Revolutionary war btw)",
                    "score": 436,
                    "author": "vengeful_yar",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A. Ben Franklin was a hooer.\nB. He hit me.\n\nAnd… that wasn’t my kite he was carryin.",
                            "score": 159,
                            "author": "[deleted]"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Dude had a good sense of humor",
                    "score": 88,
                    "author": "blackturtlesnake"
                },
                {
                    "level": 1,
                    "comment": "Historically there have been a lot of plants that were used to \"bring on the menses\" and \"expel menstrual flow\" that were understood to be causing abortion.\n\nSt. Hildegard of Bingen, 12th century Catholic nun, wrote a medical text that included many treatments for missed periods using rue, tansy, and other herbs. She prescribed similar treatments for abortions. Describing wild ginger she explains \"a pregnant woman will eat it, either on account she languishes or she aborts an infant which is a danger to her body, or if she has not had a menstrual period for a time period so that it hurts.\"\n\nIn the 1st century the Romans harvested silphium to extinction because they were using it as monthly birth control and to terminate pregnancies. They used lots of other plants to that purpose, as Dioscorides wrote of wild lentils being \"available for all cleansing for a woman, but the most wicked women (making a pessary of it) apply it and use it \r\nas an abortifacient.\"\r\n\nAbortion is healthcare and always has been.",
                    "score": 2039,
                    "author": "smallcoyfish",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "the Roman’s had the most effective form of birth control. It was a type of plant that they farmed to extinction.",
                            "score": 522,
                            "author": "jenh6"
                        },
                        {
                            "level": 2,
                            "comment": "There's no history in the history of history of abortions being a thing. /s obviously.",
                            "score": 187,
                            "author": "call_of_ktullu"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 372,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In the 1700s trash would have had a nearly identical meaning to today. It would have meant broken, unwanted or unusable things. Probably came from Scandinavian words meaning broken twigs or rags that had worn out beyond usability.",
                            "score": 526,
                            "author": "thumpas",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Your comment just reminded me of a translated Koren romance novel I was reading where they called guys that slept around \"rags.\" I don't know if that is a term used in the original Koren or if it was a translation choice of the translator, but I've never heard it before reading that novel.",
                                    "score": 115,
                                    "author": "sithkazar",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;rags\n\nBrutal",
                                            "score": 64,
                                            "author": "Sarahthelizard"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I was paraphrasing from when I heard the npr story but his direct words are “ so prevention for next time - don't long for pretty fellows or any other trash whatsoever.”",
                                    "score": 200,
                                    "author": "CruisinJo214",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "A bit of history, that may explain some of the etymology of Franklin's use of 'trash'; https://en.wikipedia.org/wiki/White_trash#History\n\nBeginning in the early 17th century, the City of London shipped their unwanted excess population, including vagrant children, to the American colonies – especially the Colony of Virginia, the Province of Maryland, and the Province of Pennsylvania – where they became not apprentices, as the children had been told, but indentured servants, especially working in the fields. Even before the beginning of the Atlantic slave trade brought Africans to the British colonies in 1619, this influx of \"transported\" English, Welsh, Scots, and Irish was a crucial part of the American workforce. The Virginia Company also imported boatloads of poor women to be sold as brides. The numbers of these all-but-slaves was significant: by the middle of the 17th century, at a time when the population of Virginia was 11,000, only 300 were Africans, who were outnumbered by English, Irish and Scots indentured servants. In New England, one-fifth of the Puritans were indentured servants. More indentured servants were sent to the colonies as a result of insurrections in Ireland. Oliver Cromwell sent hundreds of Irish Catholics to British North America during the Irish Confederate Wars (1641–1653).[31]\n\nIn 1717, the Parliament of Great Britain passed the Transportation Act 1717, which allowed for the penal transportation of tens of thousands of convicts to North America, in order to alleviate overcrowding in British prisons. By the time penal transportation ceased during the American Revolutionary War (1775–1783), some 50,000 people had been transported to the New World under the law. When the American market closed to them, the convicts were then sent to Australia. In total, 300,000 to 400,000 people were shipped to the North American colonies as unfree laborers, between 1/2 and 2/3 of all white immigrants.[31]\n\nThe British conceived of the American colonies as a \"wasteland\", and a place to dump their underclass.[32] The people they sent there were \"waste people\", the \"scum and dregs\" of society. The term \"waste people\" gave way to \"squatters\" and \"crackers\", used to describe the settlers who populated the Western frontier of the United States and the backcountry of some southern states, but who did not have title to the land they settled on, and had little or no access to education or religious training.[1][33] \"Cracker\" was especially used in the south.\n\nThe first use of \"white trash\" in print to describe this population occurred in 1821.",
                                            "score": 211,
                                            "author": "Youreahugeidiot"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "There is a book called \"white trash\" that talks about how we basically used that term the same way for \"type of person/group of people\" hundreds of years ago.\n\nIt's basically a history on class warfare/ stratification.\n\nSo he probably means you exactly what you'd expect him to mean: don't go after trashy/shitty men who will knock you up and not make an honest woman out of you or who will bail on you as soon as you're pregnant.",
                            "score": 199,
                            "author": "dachsj"
                        },
                        {
                            "level": 2,
                            "comment": "To me, it reads like a warning to not get involved with the kind of man again who'd get a woman into this jam outside wedlock. \n\nMy take on \"Pretty fellows or trash\" is thus:\n\nPretty fellows: charmers that win you over, promise the world, and drop you once they got what they wanted \n\nTrash: \"bad boy\" type, that you fall for despite knowing better, who promise nothing, and drop you once they got what they wanted.",
                            "score": 172,
                            "author": "WgXcQ",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It’s funny cuz Ben Franklin was a total whore.",
                                    "score": 151,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Do as I say, not as I do!",
                                            "score": 57,
                                            "author": "Fwiff0"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Let me be frank: don't start beef with the Frank who hangs with B. Franks, giving ladies beef franks!",
                                            "score": 42,
                                            "author": "glasswings"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "And the both of them wolves who pretty on pretty little things in red hoods",
                                    "score": 9,
                                    "author": "SobiTheRobot"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Modern slang for trash is  \"no scrubs\"",
                            "score": 36,
                            "author": "prw8201"
                        },
                        {
                            "level": 2,
                            "comment": "Maybe he means trash guys, like say guys that might sexually abuse or rape the woman, causing pregnancy. Pretty boys that might seduce her into being a willing participant, and trash that would force themselves on her against her will.",
                            "score": 71,
                            "author": "llamadramas",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 151,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Hanging out the passenger's side of his best friend's horse drawn carriage, trying to holler at me.",
                                            "score": 95,
                                            "author": "jawanda",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Well he didn’t mean literal trash I’m sure 😂",
                                    "score": 6,
                                    "author": "dogpoopandbees",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He probably meant low-quality ~~rouges~~ rogue.  Men who sleep with women without any intention of marrying her.",
                                            "score": 22,
                                            "author": "GeoffreyArnold",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yes, it's best to use a quality rouge, or it will wash off in a slight rain.",
                                                    "score": 20,
                                                    "author": "the_pinguin",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "LOL.  Rogue.  Good catch.",
                                                            "score": 5,
                                                            "author": "GeoffreyArnold"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Those skallywags",
                                                    "score": 15,
                                                    "author": "dogpoopandbees"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "One should seek to not get knocked up",
                            "score": 8,
                            "author": "gunluver"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; More interestingly… the instructions are listed under “how to remedy a missed period” and at the end it suggests “to avoid further afflictions do not seek out pretty fellows or trash”\n\nThis is extremely interesting.  And something the Average Redditor probably doesn't want to read.",
                    "score": 36,
                    "author": "GeoffreyArnold"
                }
            ]
        },
        {
            "level": 0,
            "comment": "“…a Virginia medical handbook from 1734 called *Every Man His Own Doctor: The Poor Planter’s Physician.*”\n\nThe original WebMD.",
            "score": 646,
            "author": "Insatiable_Pervert"
        },
        {
            "level": 0,
            "comment": "He famously gave advice to bed older ladies to reduce pregnancy risk.",
            "score": 1440,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 930,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You kid,but he's been quoted as saying, \"all cats are gray in the dark\"",
                            "score": 724,
                            "author": "HiE7q4mT",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 196,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The greyer the cat, the jimmy: no hat",
                                            "score": 105,
                                            "author": "CerealWithIceCream"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "\"spaghetti is straight, until it gets wet\"  \n\n - Benjamin Franklin",
                                    "score": 91,
                                    "author": "55855585"
                                },
                                {
                                    "level": 3,
                                    "comment": "Ben Franklin, the OG bi icon.\n\nEDIT: /s since people are taking this seriously.",
                                    "score": 60,
                                    "author": "Azuenz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Pretty sure this quote is not about being bi, unless you count sleeping with both young and old women as \"bi\" lol",
                                            "score": 109,
                                            "author": "2cp-lsd",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hmmmmmm.  Perhaps he was being \"bipartisan\"",
                                                    "score": 64,
                                                    "author": "Socksandcandy",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "\"Uh oh, he's reaching across my aisle again!\"",
                                                            "score": 80,
                                                            "author": "Nine_Inch_Nintendos"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "bimonscificon",
                                            "score": 10,
                                            "author": "CerealWithIceCream"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Wink wink, nudge nudge, say no more",
                            "score": 27,
                            "author": "Obi-wan_Jabroni"
                        },
                        {
                            "level": 2,
                            "comment": "He also joked around with his buddies after getting to new lands often saying \"It don't matter when it's arcturian, baby\"",
                            "score": 43,
                            "author": "Saneless",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Do I make you horny?  Yeah baby!",
                                    "score": 23,
                                    "author": "caydesramen"
                                },
                                {
                                    "level": 3,
                                    "comment": "And had a bunch of bodies buried in his basement. Just a quirky fella all around.",
                                    "score": 10,
                                    "author": "Eusocial_Snowman"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ben Franklin sitting in his grave thinking, damn Kendrick copping my rhymes without giving me credit damn.",
                            "score": 38,
                            "author": "Paratwa"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The letter: https://founders.archives.gov/documents/Franklin/01-03-02-0011\n\nIts all the same in the dark - Ben Franklin",
                    "score": 73,
                    "author": "walrusk"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Remedies in restoring your period were usually common knowledge back then, passed down from mother to daughter or otherwise taught by midwives (or done by midwives). While your average couple may not have a great idea on how ovulation or the science of getting pregnant worked, everyone was very familiar with how too many kids, more than you could afford, could be deadly without a social safety net.",
            "score": 966,
            "author": "SoundsSchmidty",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 237,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There was a great thread recently over on r/ask historians about this. Everybody agreed that having a delayed menstrual period was bad for the health of women, unless she was trying to have a baby. So there were all kinds of very common (and moderately effective) ways to start your period if it was late. All over the world. \n\nQuickening (feeling the baby move, typically around 18 to 20 weeks) was considered too late to remedy a late period.",
                            "score": 337,
                            "author": "sfcnmone"
                        },
                        {
                            "level": 2,
                            "comment": "I read somewhere else that because early pregnancy tests and sonograms weren’t available back then, the way to truly know you were pregnant was “the quickening,” or when you could feel the baby moving. So anything before that could be excused as “just a missed period.”",
                            "score": 371,
                            "author": "TheL95",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "\"back then\", LOL. \n\nEverybody I knew including me had occasional \"late heavy periods\". But there weren't early pregnancy tests so we didn't think of them as miscarriages.",
                                    "score": 253,
                                    "author": "sfcnmone",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Doctors don't even know how frequent miscarriages actually are when they occur before you know you're pregnant. It could be as high as 50%.",
                                            "score": 225,
                                            "author": "Razakel"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Basically every woman I know has had a miscarriage. Either trying to get pregnant and needing like 3 or 4 tries even after an zygotes already attached to the uturine lining.\n\nSome had no idea they'd been pregnant and were completly freaked out. It happens, it sickens me that they could be considered criminals because their bodies are acting involuntarily",
                                            "score": 174,
                                            "author": "itheraeld"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes and no. They wouldn't have thought of it as code, exactly. \n\nCertainly they knew there was a connection between \"stopped courses\" and what they eventually recognized, several months later, as pregnancy. The latter never happened without the former. But they didn't actually know what was going on inside someone with \"stopped courses.\" \n\nWhat they did know was that it often resolved itself with time or with the use of common herbal remedies, and that what came out looked just like normal menstrual flow: there wasn't anything in there that resembled a baby. That definitely was not the case in a definitive pregnancy proved by the quickening (when fetal movement could be felt).\n\nThey also knew that menstruation could stop without resulting in a pregnancy: older women eventually stopped menstruating permanently, younger women sometimes stopped as a result of ill health (malnutrition, illness, extreme stress), and affected women could not get pregnant if they wanted to. So there was a valid reason to connect menstrual regularity to health, especially reproductive health.\n\nThe exact meaning ascribed to \"stopped courses\" seems to have depended on whether or not the affected person wanted to be pregnant, and also on whether or not the treatment worked.",
                            "score": 154,
                            "author": "DevilsTrigonometry"
                        },
                        {
                            "level": 2,
                            "comment": "\"[Menstrual regulation](https://www.guttmacher.org/fact-sheet/menstrual-regulation-unsafe-abortion-bangladesh)\" AKA [menstrual extraction](https://en.wikipedia.org/wiki/Menstrual_extraction) is still used for \"late menses\" in some countries where abortion is illegal, such as Bangladesh. And maybe 2020s USA.",
                            "score": 90,
                            "author": "bookdrops"
                        },
                        {
                            "level": 2,
                            "comment": "They definitely understood. But people used to be even more prudish than they are now so they talked in all kinds of euphemisms. It used to be taboo to even say \"pregnant\" in public; they'd say shit like \"she's in the family way.\"",
                            "score": 146,
                            "author": "helgaofthenorth",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; they'd say shit like \"she's in the family way.\"\n\n\"Of course she is!  She's got six kids already!  Look at the poor woman!\"",
                                    "score": 69,
                                    "author": "Painting_Agency"
                                },
                                {
                                    "level": 3,
                                    "comment": "I Love Lucy is a perfect example. Pregnant was never used to describe her, o n the show.",
                                    "score": 56,
                                    "author": "Hahawney",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yup and they changed the bedroom after the pregnancy episodes. Lucy and Ricky ended up in separate beds instead of a single marital bed. \n\nDidn't want the audience to know married people might be having sex.",
                                            "score": 69,
                                            "author": "QuantomField"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes. If you read the article, it states that the remedies included many common abortifacients. It was very commonly the attitude that a pregnancy wasn't \"real\" until you could feel the baby kicking.",
                            "score": 54,
                            "author": "celticchrys"
                        },
                        {
                            "level": 2,
                            "comment": "Pregnancy wihout modern medicine was  a tricky thing since the sureproff diagnosis couldn't be given before a third person could feel the fetus momements. Early signs of pregnancy are often misleading and we have accounts of  women and their families either ignoring  or desperately clinging to  them- think of Mary I or Barbara Radziwiłłówna for whose missed periods and swollen bellies were publically announced as a sing of long awaited pregnancies only to reveal cancerous growths. \n\nAs a result, aboruion and contraception weren't sharply divided before late XIX century. People knew that missing period could be a pregnancy out also sign of weakness, starvation or disease. But if one could absolutely not afford a mounth to feed it was better to \"take the steps\" espeicially that later term abortions were both dangerous and taboo.",
                            "score": 42,
                            "author": "Eireika"
                        },
                        {
                            "level": 2,
                            "comment": "Yes, it was a “polite” way of saying “abortion.”",
                            "score": 37,
                            "author": "FiendishHawk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I feel like a lot of people want this to be the case, but other than people wishing it really hard, what knowledge do you have that this is actually the case?  As others have said, the quickening was the way to know you're pregnant back then, not just missed periods.",
                                    "score": -50,
                                    "author": "Speedking2281",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "As someone mentioned in another comment, he also advised avoiding pretty fellows and trash to prevent further affliction. Clearly they knew what it was, they were talking about pregnancy.",
                                            "score": 69,
                                            "author": "knittinghoney"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "You think ancient humans have good enough pattern recognition to track wild animals in herds for decades at a time while they migrated without modern tools. But they couldn't figure out that after millenia, if you fuck and then stop bleeding, you're about to shoot a child out your vag?\n\nIm pretty sure humans are smarter than that. Last time I checked.",
                                            "score": 57,
                                            "author": "itheraeld"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I can’t time travel, but it’s well-known as a popular euphemism. They knew what caused babies. They knew that stopped periods was the earliest sign of pregnancy.",
                                            "score": 35,
                                            "author": "FiendishHawk"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I knew I was pregnant looong before I felt some tiny flutters at 17 weeks, and it wasn’t because I took a test. Let’s give old-timey women a little credit here.",
                                            "score": 82,
                                            "author": "Socialbutterfinger",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yup, 1 missed period they probably dismissed it, but you're talking about 3 or 4 missed periods before feeling a baby move.  Also, let's not forget just the typical pregnancy symptoms that happens for many.",
                                                    "score": 35,
                                                    "author": "ShovelingSunshine"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Exactly.",
                                                    "score": 6,
                                                    "author": "rackfocus"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Common sense goes pretty far, unless you think women didn't realize back then sex + missed period = baby",
                                            "score": 39,
                                            "author": "Cautemoc"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; I feel like a lot of people want this to be the case, but other than people wishing it really hard, what knowledge do you have that this is actually the case? \n\nGee, how could anybody possibly know? If only we had some sort of method of communication that lasted, like pounding marks into stone or something, we could call it \"writing\"...we could even have people read this \"writing\" and let us know about \"history\"! Maybe we could have places of learning where we could be taught these things! That sure would prevent a lot of misunderstandings (and the ability for pro-abortion dickweeds to make up lies about the past).\n\nAlthough buddy, in this case, all you need is common sense to know what a missed period is referencing, especially when combined with a recipe for abortion. These comments are insane, and I know you are a human being with a rich internal life and feelings so I will leave it at that, but damn. That brain lottery at birth sure ain't fair.",
                                            "score": 34,
                                            "author": "grumpyfatguy"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So? What are the steps, OP?",
            "score": 90,
            "author": "AvocadoVoodoo",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; ...you must purge with Highland Fagg, (commonly call'd Belly-ach Root) a week before you expect to be out of order; and repeat the same 2 days after: The next Morning, drink a Quarter of a Pint of Pennyroyal Water, or Decoction, with 12 Drops of Spirits of Harts-horn, and as much again at Night, when you go to Bed. Continue this, 9 Days running; and after Resting 3 Days, go on with it for 9 more. Ride out every fair Day, stir nimbly about your Affairs, and breath as much as possible in the open Air.\n&gt; \n&gt; YOU must feed upon a warm and cordial Diet, enrich'd with a great deal of Mustard, Nutmeg, Horse-raddish, and Garden-Cresses; at the same time avoiding every thing that is astringent, flegmatick, and windy. And let your Drink be Beer, brew'd with Sorrel-Leaves, or else Ground-Ivy-Tea.\n&gt; \n&gt; TO prevent this Complaint, young Women must shake off Sloath, and make Use of their Legs, as well as their Hands They shou'd be cautious of taking Opiats too often, or Jesuits-Bark, except in Cases of great Necessity; nor must they long for pretty Fellows, or any other Trash, whatsoever.\n\nI think Highland Fagg is Ginger\n\nPennyroyal Water\nhttps://en.wikipedia.org/wiki/Mentha_pulegium#Ancient_to_modern_use\n\nSpirits of Harts-horn\nhttps://medical-dictionary.thefreedictionary.com/Spirit+of+hartshorn\n\n\"Shake off sloath\" means don't be lazy",
                    "score": 230,
                    "author": "Qwiggalo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wouldn’t expect anything less from Benjamin",
            "score": 149,
            "author": "Thismonday",
            "replies": [
                {
                    "level": 1,
                    "comment": "Probably wrote the book to give to his umm many female friends.",
                    "score": 62,
                    "author": "QuantomField"
                }
            ]
        },
        {
            "level": 0,
            "comment": "When you bang as many whores as he did, you learn a thing or two about unplanned pregnancies.",
            "score": 695,
            "author": "Trudzilllla",
            "replies": [
                {
                    "level": 1,
                    "comment": "I like to think in reality he looked and acted like Danny Devito in Always Sunny",
                    "score": 449,
                    "author": "open_perspective",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "“I’m gonna get real weird with it.”",
                            "score": 124,
                            "author": "Readonkulous",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He coined the phrase Dumpster Humps",
                                    "score": 48,
                                    "author": "CerealWithIceCream"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;One of the things I like doing most is banging whores. I uh, I go out and bang a lotta whores.\n\n~Benjamin Franklin",
                            "score": 248,
                            "author": "Kalibos"
                        },
                        {
                            "level": 2,
                            "comment": "\"So anyway I starting blasting...\"",
                            "score": 66,
                            "author": "curien",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;Benjamin Franklin recounting his trip to France to gain support for America.",
                                    "score": 38,
                                    "author": "[deleted]"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ooopss wooow! I dropped my monster sheepskin for my magnum dong!",
                            "score": 38,
                            "author": "RoyalOptima"
                        },
                        {
                            "level": 2,
                            "comment": "I enjoy boiling denim and banging hoo-ers",
                            "score": 11,
                            "author": "Obi-wan_Jabroni"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thanks for starting my morning with a laugh.",
                    "score": 14,
                    "author": "Crumpled_Up_Thoughts"
                },
                {
                    "level": 1,
                    "comment": "That makes him a whore too, right?",
                    "score": 92,
                    "author": "Hot_Potato_001",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "One might think so at first glance but it makes him a *banger* of whores. That's pure algebra.",
                            "score": 33,
                            "author": "Demonyx12"
                        },
                        {
                            "level": 2,
                            "comment": "He was a whore maker",
                            "score": 4,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "You just need a key, a kite, and some stormy weather.",
            "score": 52,
            "author": "jeonju"
        },
        {
            "level": 0,
            "comment": "In the UK you'll often find yew trees in the back of church yards. Yew trees are known as the tree of life and death and used long before Christianity arrived on these islands to induce abortions. A lot of the churches were built directly over pagan religious sites with Yew trees. There's one of them in England thats at least 2 or 3 thousand years old. There's also a line in the bible about taking your wife to the priest to drink a milky liquid to test if she has been unfaithful. If she has an abortion she was unfaithful. The bible and Christianity provide the instructions on abortion and they've got the poison out back. In my opinion one of the biggest reasons Christian leaders are mad about abortion nowadays is they can't use pregnancy to control women as much anymore.",
            "score": 175,
            "author": "Satansflamingfarts",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; the priest to drink a milky liquid to test if she has been unfaithful. \n\nActually says its a mixture of floor dirt from the tabernacle with holy water and a scroll dipped in it.\n\nbut yes the old testament says unfaithfulness is an excuse to force a miscarry (abortion)",
                    "score": 44,
                    "author": "hobbykitjr"
                },
                {
                    "level": 1,
                    "comment": "&gt; they can't use pregnancy to control women as much anymore.\n\nAlso not getting that sweet $$$.",
                    "score": 55,
                    "author": "WaywardDevice"
                }
            ]
        },
        {
            "level": 0,
            "comment": "In the US, opposition to abortion is largely a modern American Evangelical thing. The idea to punish the killing of an unborn child was common because if a man killed his pregnant wife, the courts had to decide whether he murdered one person or two. The same applied to executing woman. The courts had to decide if a pregnant woman could be legally executed if the unborn child was considered a person.\n\nThe common rule was that if the unborn child \"Quickened\" he/she was a living being, because quickening meant the child was moving inside the womb.\n\nLaws against abortions became a thing later largely because it became extremely dangerous and operations tended to kill woman. Courts then had to decide if the doctor could be held responsible for one death or two.\n\nAmericans, up until the late-1800's, were Protestant Christians who were totally fine with abortions. Even today, Protestant groups like Lutherans, Episcopal, Baptists, consider abortions necessary if the life of the mother is at risk. The dynamic changes with the mass immigration of Irish, Italians, and Spaniards who came from Catholic nations. By the 1900's, Anglo-Saxons began discouraging abortions because they feared they would be replaced by the Catholic immigrants who prohibited abortions.",
            "score": 138,
            "author": "adimwit",
            "replies": [
                {
                    "level": 1,
                    "comment": "Jerry Falwell and his racism play a significant role in the Evangelical obsession with abortion",
                    "score": 71,
                    "author": "ZRX1200R"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Step #1 Do not allow for a theocratic bipartisan state",
            "score": 275,
            "author": "australtwitt",
            "replies": [
                {
                    "level": 1,
                    "comment": "Instructions unclear. Put \"In God We Trust\" on all our money.",
                    "score": 162,
                    "author": "the_great_zyzogg",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Make it extra prominent on the [half dollar.](https://assets.goldeneaglecoin.com/resource/productimages/1963-Franklin-Proof.jpg)",
                            "score": 26,
                            "author": "Thirty_Helens_Agree"
                        },
                        {
                            "level": 2,
                            "comment": "And “under god” in the pledge\n\nA pledge that makes the US sound like indoctrination central akin to North Korea",
                            "score": 48,
                            "author": "Avenger616"
                        },
                        {
                            "level": 2,
                            "comment": "Yeah that will show those godless commie Russians that we are superior.\n\nWhat do you mean they got a probe in space before we did? How can that be. We have god and they don't?",
                            "score": 15,
                            "author": "QuantomField"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What, you mean originalism as a legal doctrine is just a guise to instill fundamentalist religious morals on the country through the back door. Wow, I am just shocked.",
            "score": 285,
            "author": "Perllitte",
            "replies": [
                {
                    "level": 1,
                    "comment": "You mean Catholic religion as it stood in the 1700-1800s doesn’t fit today? No way!",
                    "score": 54,
                    "author": "Lombard333",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Why Catholic? Protestantism has always been a much bigger presence in the States than Catholicism has ever been. In fact there have been periods of Anti-catholicism in the US.",
                            "score": 87,
                            "author": "MovingInStereoscope",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They're both trash and worthy of significant criticism and ridicule.",
                                    "score": 1,
                                    "author": "Bogan_Paul"
                                },
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That is fair",
                                            "score": 1,
                                            "author": "MovingInStereoscope"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not sure what you are saying but abortion was okay to catholic doctrine up to ~24 weeks at foundation of America. Wasn't until 1869 that life started at conception.\n\n https://www.irishtimes.com/news/social-affairs/religion-and-beliefs/catholic-church-teaching-on-abortion-dates-from-1869-1.1449517",
                            "score": 83,
                            "author": "rcumming557"
                        },
                        {
                            "level": 2,
                            "comment": "What’s your opinion on Islam?",
                            "score": -29,
                            "author": "morganrbvn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Odd segue, but I’ll bite. My opinion on any religion is that piety, while it can be misused, can be as good a quality as any in terms of living a life beneficial to yourself and those around you.",
                                    "score": 26,
                                    "author": "Lombard333",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Fair, I was curious since some people really hate Catholics but don’t notice many other religions share traits with them.",
                                            "score": -27,
                                            "author": "morganrbvn",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Probably because they live in countries where christians are in power, not muslims.",
                                                    "score": 30,
                                                    "author": "2cp-lsd",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I get that. It frustrates me when people point out flaws in their opponents that they themselves share. It speaks to a lack of nuance, which is one thing we desperately need more of these days.",
                                                    "score": 3,
                                                    "author": "Lombard333"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Any religious fundamental doctrine superseding rights of non-religious people is bad. How people think that only applies to other boogeymen religions is so hypocritical. \n\nIf you want to get a good lashing by your husband or die from a pregnancy complication or birth some flipper baby, go fucking nuts, but forcing others to do that horrific stuff is wrong.",
                                    "score": 18,
                                    "author": "Perllitte"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; the back door\n \nNothing like some good ol fashioned poophole loopholin",
                    "score": 8,
                    "author": "Obi-wan_Jabroni",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It would be the only form of birth control if the fundamentalists had their way, but still illegal, of course.",
                            "score": 11,
                            "author": "Perllitte"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "At the same time, trying to talk past what the constitution says is like trying to argue with your car about which pedal is the break and which is the gas, and originalism is just interpreting it in a way that doesn't allow for \"well I speak Russian so The Constitution is clearly just gibberish.\"",
                    "score": 0,
                    "author": "scolfin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 63,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 29,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 10,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": -4,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 2,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Well, that tracks - my mama says that \"Benjamin Franklin is the devil!\" Also, she says that alligators is angry cause they got all them teeth but no toothbrush!",
            "score": 33,
            "author": "CrabWoodsman"
        },
        {
            "level": 0,
            "comment": "The Bible, Numbers 5:11-31, has very similar instructions on how to cause an abortion.",
            "score": 77,
            "author": "Benadryl_Cucumber_Ba"
        },
        {
            "level": 0,
            "comment": "So not only does The Bible give instructions about abortion but one of The Founding Fathers did too? Is there anything pro-lifers are accurate about?",
            "score": 94,
            "author": "OhTheHueManatee"
        },
        {
            "level": 0,
            "comment": "Based Franklin, he's our guy",
            "score": 19,
            "author": "H__O__S__S"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 22,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": -6,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 13,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 8,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I expect nothing less from the man who invented electricity, currency, wine, diplomacy, cougars, discount retail, dayplanners, and friendly on-time plumbers - guaranteed.",
            "score": 82,
            "author": "pinniped1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Don't forget daylight saving time.",
                    "score": 11,
                    "author": "PeterAhlstrom"
                },
                {
                    "level": 1,
                    "comment": "He most certainly did not invent wine or currency",
                    "score": 50,
                    "author": "dragoono",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well at least you and I agree he invented cougars.  That's the most important part.",
                            "score": 71,
                            "author": "pinniped1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He most certainly did",
                                    "score": 16,
                                    "author": "dragoono"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He didn't invent any of that stuff, is the point. He was a character for sure.",
                            "score": 8,
                            "author": "NostalgicFrolicking"
                        },
                        {
                            "level": 2,
                            "comment": "r/woooosh",
                            "score": 15,
                            "author": "AcidEpicice"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So our founding fathers were pro-choice. Huh. America was founded on freedom of choice.",
            "score": 45,
            "author": "CommonConfusables"
        },
        {
            "level": 0,
            "comment": "My man",
            "score": 11,
            "author": "volkney"
        },
        {
            "level": 0,
            "comment": "TIL abortions are about as American as Benjamin Franklin",
            "score": 35,
            "author": "UncleCompton"
        },
        {
            "level": 0,
            "comment": "Posting for posterity",
            "score": 5,
            "author": "benfranklinthedevil"
        },
        {
            "level": 0,
            "comment": "What’s old is new again 😞",
            "score": 6,
            "author": "BLKMGK"
        },
        {
            "level": 0,
            "comment": "R/askhistorians had a whole thing on this. Because so many medical conditions preclude periods, the default position for a missed period back then was that it was due to illness (those of you outside of a certain BMI range may be somewhat familiar with this), sometimes thought to be caused by the stopped period. There were treatments for it that modern medicine has identified as abortificants, but the people prescribing them at the time only thought of them as period restoratives. You could only get an abortion after you were identified as pregnant, typically when the fetus started moving.",
            "score": 26,
            "author": "scolfin"
        },
        {
            "level": 0,
            "comment": "Checkmate, Americans who think the past was more \"Godly\".",
            "score": 24,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Based Franklin",
            "score": 26,
            "author": "hobbitdude13",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "As per justice Alito, american law is preceded by english law from the 1730s... so this is apparently irrelevant",
            "score": 9,
            "author": "cartms1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Old testament gave instructions too (but just drink a magic potion, nothing actually useful)",
                    "score": 14,
                    "author": "hobbykitjr",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Well, it was probably just an abortion elixir, and the god thing was a validation",
                            "score": 7,
                            "author": "cartms1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So, conservative originalists will interpret the Constitution accordingly now, right?",
            "score": 18,
            "author": "takatori"
        },
        {
            "level": 0,
            "comment": "This could be a moment when people actually crack history books and, you know, learn something?\n\nOr not.  Back to facebook....",
            "score": 9,
            "author": "BrownEggs93"
        },
        {
            "level": 0,
            "comment": "Shhhh, don't tell the republicans",
            "score": 13,
            "author": "CyberPatriot71489"
        },
        {
            "level": 0,
            "comment": "This gets brought up a lot and, while true, articles like this are really irresponsible when trying to get a good view of history.  \n\nThis was not thought of as abortion in the same way as we think of it now.  Pregnancy at this time in the colonies was divided into two stages, pre and post quickening.   The quickening was the moment the woman feels the movement of the baby.  Only at this time was it considered a viable pregnancy.  Historically there was very little attempt to intrude into pre quickening terminations in Europe and her colonies.   However post quickening terminations have been debated for a long long time, including considering it homicide.   Depending on a number of factors the quickening usually is at around 15-20 weeks.  \n\nAgain though, it's very very important to understand the declinations of pregnancy at this time to interpret historical works.",
            "score": 22,
            "author": "Twokindsofpeople",
            "replies": [
                {
                    "level": 1,
                    "comment": "What's your point? The vast majority of abortions occur by the 12th week.",
                    "score": 104,
                    "author": "dubbleplusgood",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -20,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 6,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": -9,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -6,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -117,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 51,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -55,
                            "author": "[deleted]"
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -47,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 7,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[removed]",
                                    "score": 5,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "And yet he still did not free his slaves although the passively spoke out against it… a true dumb ass",
            "score": -50,
            "author": "Tymental"
        }
    ]
}