{
    "id": "110agpz",
    "score": 7,
    "title": "[Dormitory Question] Can anyone please explain what triples and quads are?",
    "author": "Dry_Interaction_3426",
    "date": 1676188940.0,
    "url": "https://www.reddit.com/r/princeton/comments/110agpz",
    "media_urls": [],
    "other_urls": [
        "https://hres.princeton.edu/graduate-housing/current-graduate-students/room-and-meal-plans"
    ],
    "postText": "(Sorry if it is a dumb question, I never studied in the US before) I will be joining Princeton as a grad student this fall and was evaluating my dormitory options. Could anyone please explain why triples and quads are of the same price as single rooms? Shouldn't they be cheaper if a room is shared by 3 or 4 people? \nhttps://hres.princeton.edu/graduate-housing/current-graduate-students/room-and-meal-plans",
    "comments": [
        {
            "level": 0,
            "comment": "A lot of time triples and quads will have multiple rooms (so you’d have like your own bedroom, and a shared common room). I don’t know the exact setups but I imagine that is why!",
            "score": 10,
            "author": "cheese1234cheese",
            "replies": [
                {
                    "level": 1,
                    "comment": "With individual bathrooms?",
                    "score": 3,
                    "author": "Top_Instruction_8447",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No there are typically shared bathrooms for all, regardless of your room size, in each building. Sometimes you have to go up or down a floor to get to the one for your gender.",
                            "score": 3,
                            "author": "jackashe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Does one triple/quad share a kitchen too?",
                                    "score": 0,
                                    "author": "Dry_Interaction_3426",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No",
                                            "score": 2,
                                            "author": "PorkyTheChop"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Not sure - I don’t know the grad specific setup. Hopefully some else else is wiser!",
                            "score": 1,
                            "author": "cheese1234cheese",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Though if I had to guess I would say no shared bathrooms.",
                                    "score": 1,
                                    "author": "cheese1234cheese"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Butler College has one bathroom per dorm (ex. in a quad the four people would share that bathroom) but most colleges with have one bathroom per entire floor\n\nedit: this doesn’t apply to grad students tho so i’m not sure",
                            "score": 1,
                            "author": "Temporary_Biscotti94",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "How many people would there be in one floor? (im an undergrad). Also, are they unisex bathrooms (not that i mind, just curious)?",
                                    "score": 1,
                                    "author": "Top_Instruction_8447",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "My floor has a boys’, girls’, and gender neutral bathroom",
                                            "score": 1,
                                            "author": "OGkikiandlala",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I still dont know the difference between a guy's toilet and a girl's",
                                                    "score": 1,
                                                    "author": "Top_Instruction_8447",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "There is no difference. In fact, a student referendum recently passed to turn the majority of the restrooms into gender neutral restrooms",
                                                            "score": 2,
                                                            "author": "Temporary_Biscotti94"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Some people are more comfortable sharing a bathroom with just girls or guys, especially since students have to shower in there. Though some girls use the boys bathroom it’s not really that strict lol. And most prefer the gender neutral one because you can have a shower to yourself without people going in/and out of the bathroom since you can lock it.",
                                                            "score": 1,
                                                            "author": "OGkikiandlala",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Sorry for the intimacy... So can you shit while your roommate is showering or are the toilets and showers separate. Also you're making it sound as if there is more than one shower head in a given bathroom (is that the case?)",
                                                                    "score": 2,
                                                                    "author": "Top_Instruction_8447",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Lol yeah so the bathrooms have 2 showers and 2 toilet stalls in each (showers are separated by a wall and curtains so people can’t see in obviously lol). So anyone on the floor can go in and out at any time. The gender neutral stall has one shower and one toilet but can be locked so if one person is in there, no one else can go in. And I would share pics but I don’t want to give away what dorm I’m in. And keep in mind that every dorm is different. The newer residential colleges have some rooms with personal bathrooms. It all depends. I speak as an undergrad so idk anything about graduate housing. I hope my explanation gave u a visual but if u have any questions I can try and be more clear lol.",
                                                                            "score": 2,
                                                                            "author": "OGkikiandlala",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Just one more (dumb) question. No one can see you showering but do you poop in the mediaeval style facing each other is its exactly like a high school bathroom?",
                                                                                    "score": 1,
                                                                                    "author": "Top_Instruction_8447",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Can I instill upon you the mission of picturing the bathrooms?",
                                                                    "score": 1,
                                                                    "author": "Top_Instruction_8447"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Thank you so much! I get it now. I guess triples and quads would be nice environments to make friends at first.",
                    "score": 1,
                    "author": "Dry_Interaction_3426",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Pros and cons for sure. :)",
                            "score": 1,
                            "author": "cheese1234cheese"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "OGC rooms are set up with 1 or more separate bedrooms all sharing the same bathroom. So a triple is 3 bedrooms, 1 bathroom, and a quad is 4 bedrooms, 1 bathroom. You'll often see this style of dorm be called a \"suite\" in US colleges, though I haven't seen that term used here.\n\nThe pricing in OGC is honestly kind of nonsensical, with two rooms of drastically different sizes sometimes going for the same price. You might get lucky, you might not. (I've heard this is because OGC is so old that some of the rooms were meant for students' personal servants. No idea if that's historically accurate but it would explain the inconsistencies.)\n\nAs a first year, you're most likely going to end up in either OGC or NGC if you don't have a partner/family/medical exemption/etc. In NGC, there's just singles, which is a perk if you don't want suitemates, but the bathrooms are shared by \\~5-10 people on the same floor. Also, \"new\" is somewhat of a misnomer - it's newer than Old Graduate College, but it was built in like the '60s.",
            "score": 6,
            "author": "Twist-Gold",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you wholeheartedly for your clear explanations, I get it now.",
                    "score": 2,
                    "author": "Dry_Interaction_3426"
                },
                {
                    "level": 1,
                    "comment": "&gt;https://hres.princeton.edu/graduate-housing/current-graduate-students/room-and-meal-plans\n\nDo the 3 or 4 rooms also share a common room, or just a bathroom?",
                    "score": 1,
                    "author": "Short_Course2481",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Do you have your NetID? You can log in and see the layouts here (click the link on the side that says \"Floor Plans\"): [https://hres.princeton.edu/graduate-housing/explore/old-graduate-college](https://hres.princeton.edu/graduate-housing/explore/old-graduate-college) \n\nTriples and quads are uncommon, so I've never been in one, but there appears to be a shared hallway or small room in between the bedrooms. Doubles just have the bathroom, no common space",
                            "score": 1,
                            "author": "Twist-Gold"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Hi, you mentioned about the OGC rooms being inconsistent in size, but is that the case for NGC too? I just got assigned to NGC and the floor plan says that my room is consisted of S and B, each with the size 10'0'' x 11'6''.",
                    "score": 1,
                    "author": "Dry_Interaction_3426",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "AFAIK all the rooms in NGC are consistent sizing, the only difference being one room single vs two room single. Looks like you were assigned a two room single, which if you didn't want one does kinda suck, because they're more expensive.",
                            "score": 2,
                            "author": "Twist-Gold",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh well... okay thanks for the info!",
                                    "score": 1,
                                    "author": "Dry_Interaction_3426"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}