{
    "id": "12c32tt",
    "score": 8,
    "title": "Princeton or Georgia Tech",
    "author": "moomoomeadoos",
    "date": 1680656290.0,
    "url": "https://www.reddit.com/r/princeton/comments/12c32tt",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello everyone I’m having a really tough decision. So right now I got into Georgia Tech and Princeton for chemical engineering (might switch to electrical engineering but definitely will stay in the engineering field) \n\nThat being said, as far as rankings are concerned, Georgia tech is ranked pretty highly for my undergrad major and I kinda like the emphasis they place on stem-related stuff at Tech. Princeton, however, is Princeton lol\n\nIn the future, I’d love to work on engineering projects with government organizations (because I just love the Washington DC area) and maaaaaaybe want to pursue an mba or law school after college. I’ll probably minor in international affairs if I go to Georgia tech and something international or polisci at pton.\n\nNow to the big reason I ask this: cost\n\nTech will run be about $8k per year as an OOS student (most all merit) because I got a nice scholarship with the school before probably going up to $18k next year once my sibling graduates college. So about $70k over four years. These scholarships also come with like “networking” benefits so idk if that makes a difference.\n\nHowever, princeton will run me about $28k the first year and $38k the next years. So about $150k over four years. This would be tough on my family. Maybe I wouldn’t take on debt, but it sure would be hard for my parents to afford this (my parents assets and stuff with businesses makes ptons aid kinda weird and complicated for me. even if our financial situation were to worsen in the next years, I doubt princetons aid would change because much of the numbers on our tax forms would stay similar). \n\nMy question is, is Princeton worth this extra cost for connections and everything, or since I’m doing engineering is Georgia tech good enough for me and my career goals?",
    "comments": [
        {
            "level": 0,
            "comment": "Try to go to the accepted students event for both schools.  It might really clarify things.  The vibe can be pretty important for some people.  You'll also get a feel for the campus and facilities.  Again, these can be pretty important for some people.  And whichever you choose, don't look back:  move in emotionally to your school and make the most of it.",
            "score": 24,
            "author": "BayouAudubon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks so much. The “don’t look back” part about your comment makes me feel reassured that wherever I’ll end up, I’ll be fine. (I did visit both schools and honestly they’re just different. Love ‘em both)",
                    "score": 5,
                    "author": "moomoomeadoos"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I definitely agree that both will work out! \n\nI would also say that college is (frankly) about a lot more than career goals. I would think about where you feel more comfortable, more excited, more like you can be you. \n\nObviously, cost is a piece of that as well. Taking on loans (whether it is you or your family) is tough and a real consideration. Princeton does really open up doors, and if your might shift away from engineering or develop a new passion, being at Princeton vs Georgia Tech could be a real benefit. Folks change majors a lot and I would hate for you to feel locked in.\n\nI don’t think it hurts to reach out to Princeton Financial Aid - they are really great! - and see if there might be anything missed. I’m guessing this isn’t applicable, but in the past there have been folks whose parents were paying a substantial amount for day care but in cash, so it didn’t show up on the FAFSA and Princeton was able to adjust to accommodate for that. \n\nGood luck and enjoy!!",
            "score": 8,
            "author": "cheese1234cheese"
        },
        {
            "level": 0,
            "comment": "Similar story for me last year too. Got into Princeton and GT and I was considering aerospace engineering. Surprisingly, after my first year I've transitioned into majoring in math. This was what I considered when choosing:\n\nGT was a lot more expensive than Princeton for me since I was an out of state student. \n\nIf you are set on applied/engineering stuff GT is probably the better way to go. Princeton is also very very hard. I can't speak for GT's difficulty but for Princeton I can. You have to be ready for the work and if something like spending your weekends in a library for most of your first year doesn't sound very tolerable then you might want to go with something easier. \n\nFrom what I've heard Princeton's financial aid program is getting better next year and you can  read more about it on google. One of the other common caveats is that what you think you want to do will always most likely change. I thought I wanted to do engineering all my life but then I realized that math was more interesting because I was actually figuring out why things worked the way they did and why they looked the way they did. Anyways, that's my story you have to make your own.",
            "score": 5,
            "author": "Confident_Rope9562"
        },
        {
            "level": 0,
            "comment": "Tough decision.  I agree with the post that said talk to Princeton financial aid.  They are much more generous then previously. My son got in and they are covering everything but his mom is disabled so our income is lower and he has a full ride right now.  They are also committed to no loans for their aid packages. I have been to the campus and it is beautiful. We are going to preview next week. He also is going into engineering.  GT is a great school but another thing about Princeton is that they have a 98% graduation rate. That means despite being a heard school academically they commit to helping their students succeed non of this weed out crape some schools play. Not sure about GT as was not a school my son was interested in.  Good luck and go Tigers!",
            "score": 3,
            "author": "forrest1968"
        },
        {
            "level": 0,
            "comment": "My best friend's brother got a Chem Engineering degree from GT makes a ton of money. Princeton is awesome ivy league degree is a wow factor in industry. \n\nPrinceton and GT will give you the exact same education anyone who thinks differently is speaking nonsense. \n\nPrinceton 80k more is something to think about. You will end up in a great position after tech but the connections at Princeton wont just be given to you. You have to go and make those connections. Similarly, Atlanta is a booming city with every week tech holds a seminar for big companies to come recruit. \n\nUp to you I think you will be great either way.",
            "score": 6,
            "author": "bymirx",
            "replies": [
                {
                    "level": 1,
                    "comment": "I disagree that the educations are exactly the same. Your classes very much can be different in the topics covered.\n\nFor instance, Electrical and Computer Engineering at Princeton is very heavy in solid state physics. The same department at UCSD, for example, instead has more direct Computer Engineering focuses like Very Large Scale Integration (VLSI), GPU architecture and design, and hardware security, which Princeton either does not offer or have very, very few classes on.\n\nAnother example is in the math and physics departments. Princeton offers analysis courses (what the engrs over-generalize as \"math theory\") at the lower division level that can be concurrently taken with an introductory computational class like Linear Algebra. Princeton physics majors therefore are exposed to multiple math analysis courses and topics.\n\nThe similar physics progression at another R1, like Columbia, actually does not touch analysis at all. Columbia math overall has far fewer analysis courses than Princeton math. Instead, Columbia requires more semesters of partial differential equations that are far heavier on the computational than the analysis/proof-heavy math courses at Princeton.\n\nI unfortunately do not know the zeitgeist of Chemical Engineering, but it is a gross oversimplification to blanket claim that Princeton and Georgia Tech provide the \"exact same education and anyone who thinks differently is speaking nonsense,\" ESPECIALLY if you don't ACTUALLY know that for a fact for OP's intended field of study (ChemE).\n\nOP: Finances aside, on the education point-- you should actually, carefully look at the classes required and taught for ChemE at each school. Princeton is generally theory-heavy, whereas another institution can offer far more directly relevant industry topics and even co-op work experiences built into the curriculum. Think about where you want to be post-graduation and see if each school's requirements serve your goal.",
                    "score": 7,
                    "author": "DeltaMed910",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I just don't agree. I will concede 'exactly the same' was a overstatement. I think a degree in chemical engineering from top institutions will give you a base level of knowledge needed to do any industry job. I have friends from Princeton, and various other Ivy's and top Tech schools. When we meet up and talk we all understand the language and concepts. Yes specifically speaking courses can vary, but strictly speaking no education at these top schools is better than the other for undergraduate degrees.",
                            "score": 1,
                            "author": "bymirx"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Princeton and GT will not give you the exact same education.",
                    "score": 5,
                    "author": "rr90013"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Princeton. The undergrad focus is actually crazy here",
            "score": 2,
            "author": "apondy2004"
        },
        {
            "level": 0,
            "comment": "CBE is an especially unhappy major at Princeton - attrition from sophomore year to senior year is like 30%. I know 2 people who switched out, and like 5 people that wish they did (one said “I wish I’d done mechanical - it’d be so much easier and better run”). ECE at Princeton is much more pleasant and well-run from what I’ve heard.\n\nI’m not an engineer, but from what my friends say it sounds like across all engineering majors at Pton a common problem is the curriculum isn’t as career-oriented as elsewhere. It sounds like people are very prepared if they want to continue in academia/research, but people aren’t given much help preparing for the FE exam or whatever that’s called, and although people get good jobs, they’re much more on their own.\n\nPrinceton has the whole Ivy vibe - there’s a big emphasis on liberal arts (look at the distribution requirements) and research (senior thesis/independent work), even for engineering majors. I don’t know anything about Georgia tech, but I assume it has a pretty different vibe.\n\nI really like Princeton, but I would guess Georgia would be better for you, based on vibe, curriculum, and price. The only reason you seem to be hesitating is the prestige factor, but imo that’s not at all worth it - Georgia tech is a great, well-known school, and in engineering it’s probably better than Princeton.",
            "score": 2,
            "author": "DarthKnah"
        },
        {
            "level": 0,
            "comment": "Having gone to school at Princeton and now at a big state school as a prof (tho not GT), if they were the same price I'd say go to Princeton.  GT is going to have slightly fewer frills and slightly fewer opportunities, but I'd say take the \\~100K you'd be saving and splurge on study abroad or an awesome summer program or something else to upgrade your undergrad experience.\n\nAnd don't forget that there are some things that will be better: GT will have more diverse research opportunities, a bigger cohort, and Atlanta is more fun and diverse than Mercer county (and a lot closer than NYC or Philly).  \n\n\nEdit: I forgot the name of the darn county I lived in for three and a half years.",
            "score": 2,
            "author": "ezubaric",
            "replies": [
                {
                    "level": 1,
                    "comment": "Princeton is in Mercer County, not Nassau County.",
                    "score": 2,
                    "author": "Fluffy_Sea1628"
                }
            ]
        },
        {
            "level": 0,
            "comment": "specific rankings within the program don't matter for undergrad at all. those rankings that you see are generally considering the graduate student research, while your experience will mostly be taking classes and you want to go to the school that has the best teaching and student experience and better quality of classmates\n\nthat is princeton by far. i really suggest you try to make princeton work. its an incredible school and it will be life changing. living on campus in beautiful princeton for 4 years is an amazing experience only a tiny fraction of people on earth will ever experience\n\ngeorgia tech is a MASSIVE public school. you can only live on campus for 2 years. you have to walk so far to get anywhere. there are far fewer resources for u because those resources are distributed over a large student population. \n\nyou can try to ask princeton to give you more aid. say you really want to go but need money. ask if they will match the gtech offer or meet you halfway (also you may be calculating ur gtech aid wrong. most schools give you X dollars in aid, but you need to contribute a few thousand each year working some job as part of the \"student contribution\" so the real aid is X minus student contribution. princeton got rid of that this year so the aid they tell you is the true aid). \n\nchemE, EE, and COS are all high paying. If you were considering Meche, then ur salary might be low after graduating, but in chemE and EE it should be 100k if ur good and in CS it should be 160k if ur good. \n\nthe 70k difference is not much in the long term. if you don't wanna burden ur parents tell them to pay the amount they would have at gtech to princeton, and take the rest as a federal (not private) loan. you should be able to pay off the loans in 5 years working in chemE or EE and in less time if you decide to do COS. \n\none thing i didnt know in high school is that COS is not just programming (I took AP java in hs and thought COS was just like coding in java lol). but COS is so much more (machine learning, hardware, crypto, parallel computing, compilers, theory of computation, computational biology). Nowadays COS even includes control theory because of all the self driving cars and automated robotics (basically coding the automation algorithms on hardware). control theory used to be restricted to the MAE department. You can easily make 160k+ working as a computer scientist for some robotics/AI company doing control work or ML work. \n\nbro just imagine fucking living in whitman college chillin with geniuses from across the country and the rest of the new england establishment wearing old-ivy clothing, learning about engineering in the new engineering building their making, going to art shows, chilling on Nassau street and going to eating clubs to party. this is the life man",
            "score": 4,
            "author": "faithforever5",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah this comment is not it. Biggest boner for Princeton I’ve ever seen in my entire life. Princeton is amazing but so is GT lol",
                    "score": 5,
                    "author": "ggezre"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Princeton has way more resources for you in terms of housing and services and won't be subject to the current state level attacks on public universities. Not too familiar with how chemical engineering is at Georgia Tech vs Princeton but my guess is the name of the latter will help you much more in life and building connections with top experts in your field.\n\nNot sure how the cost for Princeton is so high compared to Georgia Tech, they just raised financial aid significantly so families up to $100,000/year pay nothing. Regardless, if it creates a burden on your family, you probably can make a good case to financial aid to improve your aid.",
            "score": 2,
            "author": "pezpeculiar"
        },
        {
            "level": 0,
            "comment": "My close friend got her undergrad degree at GA Tech, leading to a spectacular job at Exxon. After a few years, she left Exxon to get a graduate degree at Princeton, fully funded (tuition plus stipend). So, even Princeton knows how great GA Tech is.",
            "score": 0,
            "author": "Prestigious_Monk_976"
        },
        {
            "level": 0,
            "comment": "princeton's fin aid is changing to be way better i think. idk if it already happened but if its the future, your aid for the rest of your years there may be better. look it up and read about it",
            "score": 1,
            "author": "faithforever5"
        }
    ]
}