{
    "id": "12c69gc",
    "score": 6,
    "title": "Will Princeton revoke acceptance if I don’t get my ib diploma",
    "author": "Appropriate-Tear4783",
    "date": 1680663699.0,
    "url": "https://www.reddit.com/r/princeton/comments/12c69gc",
    "media_urls": [],
    "other_urls": [],
    "postText": "Good afternoon,\nI am in the ib program and am attempting to get the ib diploma. My worry is I won’t be able to do well enough on my French class to get it. I just got into Princeton and was wondering if anyone’s admissions have ever been revoked based on their ib test scores. There is nothing on my acceptance letter based upon getting admissions revoked by grades or my ib scores.",
    "comments": [
        {
            "level": 0,
            "comment": "they only revoke it if you start failing classes dude chill",
            "score": 7,
            "author": "nutshells1"
        },
        {
            "level": 0,
            "comment": "I have reread and it says that I need to continue my academic good standing but nothing about the ib diploma",
            "score": 2,
            "author": "Appropriate-Tear4783"
        },
        {
            "level": 0,
            "comment": "I would say if your final transcript will still look good, I wouldn’t worry! Revoking is v rare but it is possible. Is there a reason your French class will be so tough? That is a consideration too.",
            "score": 1,
            "author": "cheese1234cheese",
            "replies": [
                {
                    "level": 1,
                    "comment": "I have been struggling in the class all year and getting b’s in the class but that is on my transcript that is already submitted to Princeton so I’m not worried about my actual transcript \nBut I feel unprepared for my oral exam which doesn’t go in the grade book but instead just sent to IB\nMy class rank is #2 out of 500 though so French might lower that as well\nBut other than French I will prob get 100s in every other class",
                    "score": 1,
                    "author": "Appropriate-Tear4783",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Class rank and ib test scores won't matter post-admit. Usually it also has to be a significant downturn in performance across many classes, getting a b in a single class has no chance of getting admission revoked.",
                            "score": 1,
                            "author": "PlacatedPlatypus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Totally agree!! All good. :) just don’t fail core classes and you should be AOK",
                                    "score": 1,
                                    "author": "cheese1234cheese"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}