{
    "id": "13bzq9l",
    "score": 3,
    "title": "Has anyone taken the EGR physics sequence and the regular (not EGR) math sequence at the same time?",
    "author": "Rough-Monk-2911",
    "date": 1683569169.0,
    "url": "https://www.reddit.com/r/princeton/comments/13bzq9l",
    "media_urls": [],
    "other_urls": [],
    "postText": "For Princeton’s engineering prerequisites, does Princeton allow you to take the EGR physics sequence alongside the regular math sequence (the non-EGR sequence)? Also, if you’ve taken EGR physics, why did you not go through with the regular physics sequence + how do they compare?",
    "comments": [
        {
            "level": 0,
            "comment": "I personally have not done egr, but I know people who have done egr physics and normal math and vice versa. Even if your advisor says no, you can just ignore them and do it anyways or switch during add drop period",
            "score": 2,
            "author": "yellowfellow99"
        },
        {
            "level": 0,
            "comment": "I took the EGR physics sequence with the regular math sequence freshman year. My advisors didn't stop me from doing it, but they did tell me they thought it was weird I was able to since apparently most advise not to do that. \n\nI didn't do the regular physics sequence because, since I wanted to major in engineering, I thought the engineering physics sequence would be better. Also because I heard the physics sequence can be really difficult with not so good lectures and weekly quizzes. I don't know much about the regular physics sequence, but I would say egr physics is very engineering-based, with very hands-on labs.",
            "score": 1,
            "author": "ExTReMe_ACE_1707",
            "replies": [
                {
                    "level": 1,
                    "comment": "Could you elaborate on what you mean by engineering-based? Like in what ways does it incorporate more “engineering”?",
                    "score": 1,
                    "author": "Rough-Monk-2911",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The PSETS give real-world questions in terms of engineering that you have to solve, for example, calculating the image array of a microscope. When I took the sequence, the labs culminated in engineering projects like designing, 3d printing, and building a product.",
                            "score": 2,
                            "author": "ExTReMe_ACE_1707",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ooooo that actually sounds pretty interesting. Would you say it was a fun class? Because since you said designing, 3D printing, product building, etc that sounds genuinely interesting, since it’s more “applicable” or real-world rooted, which sounds super enjoyable",
                                    "score": 1,
                                    "author": "Rough-Monk-2911",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah, I really enjoyed the classes, especially the second class of the sequence (electricity, magnetism, etc). Although I will say that depending on the professor, the lectures can be boring or hard to follow. The professors are really sweet and passionate though so going to office hours helps that. Also, the PSETS can cause you to have to make a lot of assumptions that could be wrong, so going to office hours would also help that.",
                                            "score": 2,
                                            "author": "ExTReMe_ACE_1707",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If you don’t mind sharing, which professors do you recommend for EGR physics? And which do you think didn’t do as well of a job/made it harder to understand the content?",
                                                    "score": 1,
                                                    "author": "Rough-Monk-2911",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I looked at the course offerings, it looks like Gmachl and Sturm are doing the sequence still. They're both great. Sturm's lectures can be iffy and Gmachl's psets can be difficult to understand.",
                                                            "score": 1,
                                                            "author": "ExTReMe_ACE_1707"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}