{
    "id": "pwffwp",
    "score": 38,
    "title": "Looking for someone who eats breakfast at First first thing in the morning for recon.",
    "author": "PlacatedPlatypus",
    "date": 1632743651.0,
    "url": "https://www.reddit.com/r/princeton/comments/pwffwp",
    "media_urls": [],
    "other_urls": [],
    "postText": "I eat breakfast at either First or Whitman on my way to my lab every morning around 8. I prefer the food at Whitman *except* when there is warm strawberry topping at First, in which case I prefer it. Unfortunately the online menus don't tell me which specific topping First has (blueberry and apple are not worth forsaking Whitman's grill). If you know anyone who consistently eats at First before 8am, please DM me and I'll give them my contact info. Thanks.",
    "comments": [
        {
            "level": 0,
            "comment": "This sub always has the most amusing posts.",
            "score": 31,
            "author": "adamfrom1980s",
            "replies": [
                {
                    "level": 1,
                    "comment": "I know it seems like a shitpost but the quality of my morning yogurt is very important to me.",
                    "score": 20,
                    "author": "PlacatedPlatypus",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Absolutely. It’s the most important meal of the day. Roll on, king.",
                            "score": 15,
                            "author": "adamfrom1980s"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I love this post. Wish I could help but I live off campus",
            "score": 9,
            "author": "lizrael"
        },
        {
            "level": 0,
            "comment": "While you are 100% correct in your preference and your desire to know is understandable, this seems a bit much no? \n\nBuuuuut, if you really wanna know I’d suggest befriending a member of the dining hall staff (student or faculty). They tend to be super nice and im sure at least one wouldn’t mind helping you with your morning topping conundrum as long as you’re not weird about it.",
            "score": 4,
            "author": "nomo357",
            "replies": [
                {
                    "level": 1,
                    "comment": "I asked the staff but they said it was random (\"whatever we have in the back that day\").",
                    "score": 1,
                    "author": "PlacatedPlatypus"
                }
            ]
        }
    ]
}