{
    "id": "rc0u0o",
    "score": 9,
    "title": "Breaking into Quant Trading",
    "author": "dfas90",
    "date": 1638997149.0,
    "url": "https://www.reddit.com/r/princeton/comments/rc0u0o",
    "media_urls": [],
    "other_urls": [],
    "postText": "I imagine theres a lot of people here to go to quant roles, but unfortunately I don't know any of them, so I was hoping yall could help. I want to get into one of the quant trading roles (like Jane Street, HRT, etc.) and was wondering the best way to prep. I'm ORFE '25. Also, any insight into the natural intelligence I need, the chances of me getting in, and how life is at the firms (stress, turnover, etc.) would also be helpful. Thanks!",
    "comments": [
        {
            "level": 0,
            "comment": "&gt;Also, any insight into the natural intelligence I need\n\nThere's no use thinking like this.  Not only do we not know you, but there's no possible answer we could give here that would be useful. Probably if you got into Princeton you have the requisite intelligence with enough smart work, so just focus on that and let this kind of thinking go.\n\nAlso you're starting early which is a great advantage.  I'd recommending trying to find some recent graduates at these companies and reaching out to talk to them.  They could provide more specific advice and potentially refer you for internships down the line etc.",
            "score": 2,
            "author": "PostPostMinimalist"
        },
        {
            "level": 0,
            "comment": "Ignore the other response, ORFE is just fine for getting into quant. Just don't skimp on smart electives. You really want to shine, then do some self-teaching of something like algo trading with python. Not sure what your time horizon is like, but doing what you can to create a portfolio of example work is going to give you a good leg up.",
            "score": 3,
            "author": "bbqbot"
        },
        {
            "level": 0,
            "comment": "Cope. Go Wharton or go home",
            "score": 1,
            "author": "Double-Truth-3916"
        },
        {
            "level": 0,
            "comment": "Are you able to get a math or cs major instead? ORFE isn't really a target program for companies like that.",
            "score": -3,
            "author": "SharkSpider",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah, Im only one semester in I could easily switch. Just thought ORFE was a good mix of everything. While I do like math/cs, pure math really isn't my thing (which seems to be the focus of math here) which is why I was leaning towards ORFE (more stat/probability oriented). CS im cool with, but really only the theoretical side of it, and I dont want to get into a dev role. Honestly Im confused about how all this works so I dont know what I should do.",
                    "score": 1,
                    "author": "dfas90",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Everyone who wants to work in trading takes probability and stats, ORFE just lets you avoid the tougher pure math and computer science classes. Quant traders need to be able to program and understand high level math concepts. You can have a major that proves you're able to do at least one of those, or the major people who can't do either take to put \"finance\" on their resume. Had a bit of a rep for being full of legacy students, as well.",
                            "score": -2,
                            "author": "SharkSpider",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah that makes sense. I was under the impression, however, that getting to the interview stage is not particularly difficult, especially with the Princeton name, so regardless of my major as long as its somewhat relevant I should be getting an interview?",
                                    "score": 1,
                                    "author": "dfas90",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I've been involved in various stages in the hiring process for a while and pretty much never see ORFE majors, it's all math and CS. These are small companies and they're looking for the best people. If you're not doing something highly quantitative and getting good grades, you don't have much of a chance.",
                                            "score": 1,
                                            "author": "SharkSpider",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well I've seen on linkedin orfe quants",
                                                    "score": 1,
                                                    "author": "dfas90",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I second that math/cs/phys majors seem to have an edge at getting these types of jobs",
                                                            "score": 2,
                                                            "author": "cybersatellite",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "am a math major what states can we find this jobs?",
                                                                    "score": 1,
                                                                    "author": "Few-Airline3695"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}