{
    "id": "tt9zs7",
    "score": 26,
    "title": "anyone else feel this way?",
    "author": "International_Plum62",
    "date": 1648761424.0,
    "url": "https://www.reddit.com/r/princeton/comments/tt9zs7",
    "media_urls": [],
    "other_urls": [],
    "postText": "chronically depressed, easily irritated, tired all the time.... want to cry often and feel hopeless, lonely and no friends, varying degrees of instability, etc. \n\n&amp;#x200B;\n\nI drown myself in academics to suppress this, but at times it's overwhelming.",
    "comments": [
        {
            "level": 0,
            "comment": "I’m so sorry you are feeling this way. You definitely aren’t alone. Life in general is hard, especially being at a high stress college away from home. \n\nIs there someone you can talk to, maybe from home? \n\nAlso linking Princetons support resources, if helpful:  https://uhs.princeton.edu/counseling-psychological-services or the national line: https://www.nami.org/help",
            "score": 16,
            "author": "cheese1234cheese"
        },
        {
            "level": 0,
            "comment": "You are not alone. It is more common than you think in a high-pressure academic environment. I'd highly recommend getting professional counseling available from the university. They are very helpful.",
            "score": 9,
            "author": "Interesting-Wish8316"
        },
        {
            "level": 0,
            "comment": "That’s how I felt my entire first year and well into my second (25+ years ago). Much of the anxiety was about not knowing what “good” looked like. I don’t know what year you are but eventually I figured out how to make it work and my last two years the things that would have filled me with torturous fear were straightforward problems to solve. Though i definitely had lapses back to the bad stuff in junior and senior year. Difference was I had more confidence I could figure it out. But it sucks being in that place. I remember one time calling home as a sophomore and telling my mom how hard it was and her response was, “maybe you’re not cut out for Princeton.” Wasn’t what I was looking for at the time but it definitely made me want to prove her wrong. Be well, take care of yourself (including finding time for yourself), and good luck",
            "score": 7,
            "author": "messageinabubble"
        },
        {
            "level": 0,
            "comment": "Feeling this way at my institution too, feels especially overwhelming when my dormmates are partying  while I am locked in my room unable to make friends",
            "score": 2,
            "author": "iLordDeath"
        },
        {
            "level": 0,
            "comment": "yep you’ve described it perfectly. wishing you the best op",
            "score": 2,
            "author": "sickhundredsailors"
        },
        {
            "level": 0,
            "comment": "My friend, you are far from alone. You are suffering as millions upon million of your fellow humans suffer, often invisibly, but never, ever alone. Take it from a fellow human who has been in the darkness you describe. You cannot see the door, but it is there. Take it on faith that the door is there and let others help you find it. Drag yourself to see a University counselor and tell them what you’re experiencing. Let them guide you from there. There is a way out, I promise. https://uhs.princeton.edu/counseling-psychological-services",
            "score": 1,
            "author": "LazyCondition0"
        }
    ]
}