{
    "id": "tuzikt",
    "score": 29,
    "title": "Interviewer's remorse",
    "author": "Forgind1",
    "date": 1648955468.0,
    "url": "https://www.reddit.com/r/princeton/comments/tuzikt",
    "media_urls": [],
    "other_urls": [],
    "postText": "I interviewed six applicants this year for Princeton. I've seen statistics about what percent of students get accepted, so I'm generally not optimistic going into interviews. Still, it's heartbreaking after having spoken with fantastic candidates to see them rejected. I don't think everyone I interview should be accepted; my personal \"acceptance rate\" would be about 10-20%. That's clearly well above 4% but still fairly low. I wish I could occasionally choose a student I consider more qualified than people I met on campus and make Princeton accept them. Princeton is too biased towards NJ, especially.",
    "comments": [
        {
            "level": 0,
            "comment": "Hmm, I think I have to disagree! Though I do understand the frustration sometimes in how few get in!\n\n I love interviewing, but you only have so little time with them. What do you feel like you are able to tell about them in such little time? Without seeing their background information, application, etc. I love interviewing but it feels more biased and unfair each year…",
            "score": 12,
            "author": "cheese1234cheese",
            "replies": [
                {
                    "level": 1,
                    "comment": "I agree from a rational perspective; I know there's a lot I'm missing. On the other hand, it's easy to do things you don't care about just to help you get into college, and it's easy to get by in almost everything pre-college just by memorizing a lot of facts and regurgitating them. So I don't think I truly have enough information to make a correct judgment, but if I had access to transcripts, essays, etc., (and time to review them), and a few hours to carefully discuss any red flags I see, I do think I could do better than just looking at words with no flavor if that makes sense. I do recognize that would be asking far too much of our overburdened admissions system, but I'd love to be able to give every applicant the time he/she deserves.",
                    "score": 6,
                    "author": "Forgind1"
                }
            ]
        },
        {
            "level": 0,
            "comment": "My son just got accepted and the person who interviewed him reached out a few days later to congratulate him. That was a very classy move and very much appreciated. No idea who it was but thank you to all of you who volunteer your time to do these and who help new students feel welcome even before they start.",
            "score": 12,
            "author": "LazyCondition0"
        },
        {
            "level": 0,
            "comment": "I've been interviewing 5-6 high schoolers a year  for almost 25 years now, and I think I've had about 4 of them get in ever. Sad about it, but hoooooo boy have I had some comically bad interviews. \n\nI will never forget a girl who was the editor of her school's newspaper and I asked her \"what's the hardest thing about that\" and she said, I swear to God, \"a lot of the kids at my school are Asian and Asians are terrible at writing\". Had to manually pick my jaw up off the floor. \n\nHonestly was wondering if she had already decided to go somewhere else and was having a little fun with the interview.",
            "score": 9,
            "author": "Deflator_Mouse7"
        },
        {
            "level": 0,
            "comment": "Thank you for what you do! My interview was the best part of my college application experience. Having support from an established alumnus/alumna throughout the rollercoaster of the process is really a wonderful thing that I don't think gets the credit it deserves.",
            "score": 4,
            "author": "cynyx_"
        },
        {
            "level": 0,
            "comment": "I haven’t interviewed in several years because honestly it really bummed me out. I haven’t had a single interviewee get accepted despite interviewing some really terrific kids. It can be kind of demoralizing.",
            "score": 3,
            "author": "[deleted]"
        }
    ]
}