{
    "id": "ugakr9",
    "score": 0,
    "title": "What are some good study spots on campus that don't require a Princeton ID?",
    "author": "esketittratguccigang",
    "date": 1651442570.0,
    "url": "https://www.reddit.com/r/princeton/comments/ugakr9",
    "media_urls": [],
    "other_urls": [],
    "postText": "I don't attend Princeton but it would be nice to have somewhere to study :0",
    "comments": [
        {
            "level": 0,
            "comment": "All the academic buildings are locked since Covid but you may be able to get guest access to Firestone. There are meant patios bear Nassau that are really pretty that you could go to though.",
            "score": 9,
            "author": "benjiherbs"
        },
        {
            "level": 0,
            "comment": "I’m in a similar boat! My partner attends Princeton so we live in town, but I commute to Columbia two days a week for class. I highly recommend getting a Princeton library card! It’s only a stones throw from Nassau Hall. They have tons of space to study, a good wifi connection, a cafe on the first floor, and it’s free!",
            "score": 3,
            "author": "DrySprinkles1"
        },
        {
            "level": 0,
            "comment": "Prospect Garden is nice especially in spring, and while I can’t officially endorse this, you can probably follow someone into Frist during a crowded time (which is 90% of the time) and use the quiet study spaces on floor 3 or the loud ones on floor A",
            "score": 3,
            "author": "Clarinet_2002"
        },
        {
            "level": 0,
            "comment": "On weekdays during business hours you can get into New South from the A Level (at least during the school year).  I don’t think you’re ~supposed~ to if you’re a non-Princeton student but I doubt anyone cares lol, it’s a really cool building to study in.",
            "score": 2,
            "author": "TheMeowingPuppy"
        }
    ]
}