{
    "id": "uiaphc",
    "score": 3,
    "title": "astrophysics major please help. hi. I will be attending Princeton this year as an astrophysics major. is there any advice before starting?",
    "author": "Feisty_Car5951",
    "date": 1651682253.0,
    "url": "https://www.reddit.com/r/princeton/comments/uiaphc",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "1. Don’t be intimidated by the first two years of math/physics, the astrophysics classes come junior/senior year and are GREAT so stick it out for the cool stuff to come later!\n2. Try to find summer research work with one of the astrophysics professors after your freshman year\n3. The Astro department is full of odd personalities. Embrace it and get to know the professors and students. Go to the Friday afternoon department meetups even as a freshman and don’t be shy.",
            "score": 9,
            "author": "Diligent_Nerve_6922",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much for your time and response ❤️",
                    "score": 1,
                    "author": "Feisty_Car5951"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Freshman year will be hell but that’s okay, don’t be intimidated if you die in physics/math, if you’re starting in PHY105, I strongly encourage you to not drop to PHY103, even if you’re struggling in 105 and think that it would be better to drop down—I ended up staying in it despite struggling very badly, but I was able to pull through and did not regret taking a class that was above my skill level coming into freshman year. I fell in love with physics in that class even tho it killed my GPA. Also go to office hours and study sessions, as the class is impossible without them. Don’t be afraid to drop down in math if you must to survive in physics, math here is not taught great at all and the goal is mainly to survive until you’re finished than to actually learn anything. The hardest part is getting through freshman year, if you can do that, you can do anything! \n\nAlso, be aware that many Astro classes are only offered EVERY OTHER YEAR, so plan ahead! Unlike other majors, the requirements are plentiful for Astro, so make sure you have a decent idea of when you’re going to take stuff. Talk to other people in the department as much as you can, and ALWAYS have multiple sets of eyes see your schedule to make sure it’s good.\n\nOverall, the classes are overbearing and stressful but the community is full of the nicest, most supportive people you’ll ever meet. Use your resources, and you’ll be fine. Get in touch with Neta Bahcall and Polly Strauss, they would LOVE to talk to you about the department and all of the research and opportunities we have. They’re always happy to see people interested in Astro (our department is very small, so new people are always welcome)! Everyone I’ve talked to is so kind, supportive, and passionate about astrophysics, so get to know them ASAP!!!",
            "score": 5,
            "author": "Lixerouge",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much. I really appreciate your response. I have a question it is simple but weird and important. If you studied/ completed the assignments/ attended and also followed the professor's advices would you still have an A for example in such hard courses?",
                    "score": 1,
                    "author": "Feisty_Car5951",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "For reference, I was very unprepared as I went into PHY105 and MAT203 having self-studied both AP Physics C and Calc BC and I was NOT prepared at all. I could have taken PHY103 instead and probably have gotten an A-/B+ without a whole lot of extra effort, as I was very familiar with the content already. I came into PHY105 and struggled greatly in the first half, and got a class-low score on the midterm. I did much better in the second half, and got a C+ overall (I was probably near the bottom of the class with a C in the first half, but doing pretty well with a B-/B in the second half). Had I been using my resources consistently, I probably could have ended the course with a B-, but again I was vastly underprepared (this was my first physics class ever with a teacher that wasn’t the internet), and students who were more prepared than me coming in got grades in the A/A- range. I feel like many freshman STEM classes are just “How much did your high school prepare you?”, and the amount of effort you put in pushes your grade up/down a notch from that. You can only do so much catching up to get used to Princeton Physics’ pace, so be proud of yourself if you keep up quickly and get an A, but don’t knock yourself down if you are immensely struggling just to get a B. It all evens out by sophomore year for the most part. Plus, nearly everyone suffers in that class anyways, regardless of grade, so you won’t ever feel alone! \n\nI wouldn’t worry about grades too much in the first year. Focus on learning and understanding in physics, and you’ll be more prepared for getting a better grade in the next class! (Also just FYI Astro classes are generally easier than the physics classes, so far my Astro classes have been “oh yeah I should try extra hard to get that A-, I’m very close!” whereas some physics classes are just a lost cause, but it’s different for everybody and varies generally).\n\nKinda rambly but hope this helps lol, freshman year made me want to drop out and quit everything, so brace yourself!",
                            "score": 2,
                            "author": "Lixerouge",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Sorry for the late reply but thank you so much for this. I really appreciate it",
                                    "score": 1,
                                    "author": "Feisty_Car5951"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I know some of your classes early on are no joke, but see if you can learn some cs, either now or early on. It'll probably help with research.",
            "score": 2,
            "author": "Forgind1"
        },
        {
            "level": 0,
            "comment": "I’d just like to comment that PHY105 and MAT203 are NOT required or even necessary to be an astro major (coming from someone who took PHY103 and MAT201). There’s a lot of pressure to follow the higher track that’s offered, but as others have said, it all evens out in sophomore year. Yes, PHY105 will give you a bit of a leg up in part of PHY205 sophomore year, but by the time you get to PHY208 in the spring, it’s totally new material for everyone. Additionally, I’ve seen PHY105 turn several people away from physics/astro unfortunately, because of the sheer difficulty; if you can see that happening, just go with PHY103! It’s certainly not worth sacrificing your passion for a topic just for the sake of following a higher track that nobody outside of Princeton will care about.",
            "score": 2,
            "author": "Signal-Wasabi-1345"
        }
    ]
}