{
    "id": "v0rcnn",
    "score": 5,
    "title": "Cons of Princeton as a PhD Student vs an Undergraduate",
    "author": "TheChimeras",
    "date": 1653882026.0,
    "url": "https://www.reddit.com/r/princeton/comments/v0rcnn",
    "media_urls": [],
    "other_urls": [],
    "postText": "Princeton advertises itself as \"an undergraduate school\". What does this mean?\n\nHow, specifically, are graduate students not appreciate by admin or professors?",
    "comments": [
        {
            "level": 0,
            "comment": "graduate students are indeed regarded as subhuman /s\n\nnah but just look at the undergrad and grad population size here compared to ex. harvard",
            "score": 10,
            "author": "nutshells1",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why does population matter? Princeton being small seems like it would be better. Harvard is so big that no one gets attention besides the law, business, and undergrad schools",
                    "score": 1,
                    "author": "TheChimeras",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "proportionally to population; they focus on undergrad a lot more",
                            "score": 1,
                            "author": "nutshells1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What do you mean by “focus”? I think I’m dumb and can’t get what this means exactly. What do you grad students wish they had?",
                                    "score": 1,
                                    "author": "TheChimeras",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "as other comments have pointed out, undergrad is much bigger than grad so naturally more of the resources go to undergrad",
                                            "score": 1,
                                            "author": "nutshells1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "If 5 percent of Princeton is grad students and the grad students receive 5 percent of princetons resources, and 40 percent of Harvard is grad students and the grad students there get 40 percent of Harvard resources, the grad school experience at the two should be the same right? So is this not the case?",
                                                    "score": 2,
                                                    "author": "[deleted]"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "What resources…",
                                                    "score": 0,
                                                    "author": "TheChimeras"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Academically, grad students are appreciated by admin and professors.  No problem there.  There are also plenty of grad student events and you'll have opportunity to meet and make friends with other grad students.  The major issue is having social outlet beyond the grad students.  Depending on your personality, you may wish to expand your social circle.  No offense to grad students, but as a whole, they can be idiosyncratic.  \n\nPrinceton isn't a typical college town with restaurants and bars that cater to the students.  (The undergrads mainly stay on campus.)  You may find you have to go to Philadelphia, NY, or New Brunswick to get the experience of going to bars and concerts and being around other people in their 20's and 30's.",
            "score": 9,
            "author": "gyp_casino"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "that doesn't sound too bad... to my knowledge every other school in america is like this: the undergrad and the grads live in separate social atmospheres. when i was an undergrad i only ever interacted with grad students through my lab group\n\ndo you feel like you miss out on anything though? like maybe some events or opportunities that only undergrads have? in what way specifically does admin \"care\" about you less? sorry lol i just have trouble understanding how specifically any of this is instantiated in your daily life (besides that you're not going to be welcome in the eating clubs or chilling in the undergraduate residences)",
                    "score": 1,
                    "author": "TheChimeras",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's honestly not too bad, Princeton treats its grad students pretty well. However, it's important to note that this social scene I talk about is one of the major draws of Princeton as an institution. So though us not interfacing with it is to be expected, and isn't really a \"negative\" of the school, we miss out on the \"positive\" of it, if that makes any sense.\n\n&gt;Do you feel like you miss out on anything\n\nThe undergraduates have a world of events and clubs and stuff that I really, honestly, do not have time for. I think the general fact that the prestige of schools levels out more from undergrad to grad school means that grad school is less prestigious than undergrad. It's hard for me to quantify what opportunity you are particularly missing doing grad school here rather than undergrad because they're very different worlds, but both generally set you up pretty well for a good career path from what I've seen.\n\n&gt;In what way does admin \"care\" about you less\n\nAdmin keeps very close track of the undergraduates and the school manages them a lot more directly. They were locked down a lot more intensely during late covid while we were basically allowed to do whatever as long as we kept testing regularly.",
                            "score": 2,
                            "author": "PlacatedPlatypus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ah yea I see what you mean. I think you could probably go to the events like all the dance and music stuff they have going on if you found time. I noticed that grad students don’t really hang in frist or murray-dodge. I wonder why that is since it seems pretty fun. I feel like there’s always time for this kind of stuff, I was personally much more busy in undergrad taking so many classes. I’m not an experimentalist though, so it could be different for people not doing pure theory. \nPrinceton seems to have a bunch of cool clubs but yea it would probably weird if a grad student joined because you’d be the only one lol. Might be normal as a G1 but I’m sure undergrads would find a 27 year old G5 creepy. \nWhat do you do outside of research if I may ask? Just chill in the dbar and on Nassau? That seems like it could get boring fast.. maybe groups of grad students hit up the on campus events and frist and Murray-dodge and Firestone library?",
                                    "score": 1,
                                    "author": "TheChimeras",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Grad students already have a bunch of events, but our events mostly focus around academics (i.e. colloquiums, departmental events, etc). We don't tend to go to the undergrad events because we don't really want to socialize with the undergrads (I have very little to talk about with teenagers, no offense to them) so we don't go, even if we're technically allowed to. I eat lunch in Frist sometimes with other grad students but don't \n\nMany of us also have already have developed an identity and associated hobbies for ourselves outside of school that takes up a lot of our time. I personally spend my free time playing competitive pokemon (hence my reddit history...lol), working out, and just having casual hangouts with my friends online or in-person. I hope to get back into DnD and cooking in the future.",
                                            "score": 3,
                                            "author": "PlacatedPlatypus",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Nice I also play competitive Pokémon",
                                                    "score": 3,
                                                    "author": "TheChimeras",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Lol are you a current grad student here? There's quite a few of us who play pokemon regularly.",
                                                            "score": 2,
                                                            "author": "PlacatedPlatypus",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Nope lol.. I visit sometimes though and could join remotely if that’s a thing",
                                                                    "score": 1,
                                                                    "author": "TheChimeras"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Strongly disagree that the “prestige of graduate schools levels out from undergrad.” \n\nUnfortunately it becomes significantly more important. Academia is a caste system, not a meritocracy.\n\nMultiple [studies](https://larremorelab.github.io/us-faculty/hiring-flows/Academia/) have shown that there are incredibly rigid “prestige hierarchies,” in academia that just don’t exist in undergrad. Fortunately for the people in this sub, Princeton is one of the “upper caste” schools. I think it’s #3 for academia overall, if you’re going off of the methodology of the paper I showed above. \n\nWhat does happen though, is that your undergrad degree matters less. For example, if you went to Princeton undergrad, but Rutgers for your PhD you would fall “lower” in the academic prestige hierarchy than someone who did the opposite. It’s a really stupid system and needs reform, but it’s that way things currently work.\n\nThat means where you go to graduate school and it’s perceived prestige will have a much greater impact on your career than your undergrad—especially if you want to go into an academic career.\n\nBut yeah—sorry for reviving this dead thread.",
                                    "score": 1,
                                    "author": "jadedplutonomy"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}