{
    "id": "wk2j96",
    "score": 13,
    "title": "Student employment",
    "author": "Cloutlordcatto",
    "date": 1660049508.0,
    "url": "https://www.reddit.com/r/princeton/comments/wk2j96",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi! I’m an incoming freshman and I wanna ask which student jobs are considered the best and pay well. Also, is there a list of positions and schedules or do we get that later throughout the semester?\nThanks",
    "comments": [
        {
            "level": 0,
            "comment": "Best jobs are the library circulation desk attendance jobs, in my experience! Especially if you get a less frequented library … you basically get paid well to study 75% of the time",
            "score": 21,
            "author": "cheese1234cheese",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great, thanks for sharing!",
                    "score": 5,
                    "author": "Cloutlordcatto"
                },
                {
                    "level": 1,
                    "comment": "This is the job I’ve been looking for😂",
                    "score": 2,
                    "author": "Temporary_Biscotti94"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Maybe others could reply below to make this a thread, but a few notable jobs and my thoughts:\n\n1. Library worker: fine pay (i believe ~$13/hr), very easy/light work. Extra perk is you can do schoolwork during most of the shift since they’re pretty slow. Applications are not very selective\n2. Research assistant: ease of getting one varies widely across departments (from my experience, getting a paid research position in PHY, AST, and CHM is pretty tough), but it can be very nice to get paid to do something that you probably would want to do anyways. Pay is usually around $13-$14. These jobs are pretty selective, even in departments that offer them.\n3. Princeton Student Agencies executive/associate director: requires you to take on a lot more responsibility (you’re literally running a small business, including hiring staff, managing finances, marketing, building relationships with customers, etc.), but it can be very rewarding, both as a job and monetarily (pay is $16/hr). These jobs are only relatively selective, but they’re only offered up at the end of the school year since it’s a one year term.\n4. Princeton Student Agencies staff member: obviously this varies widely since there are so many different agencies (coffee club, direct to door, safeguards, onestudio, etc.), but these can be very good jobs to have since the directors are students (and try to be flexible since they understand that school is hard to juggle). Pay is usually around $13/hr, and agencies are almost always looking for more staff members so applications aren’t very selective.\n5. Dhall worker: I don’t know anything about this job but here it is\n\nHopefully this helps!",
            "score": 11,
            "author": "Signal-Wasabi-1345",
            "replies": [
                {
                    "level": 1,
                    "comment": "Dhall is great for independent upperclassmen. I would go in early for my shift without having to swipe and get a free meal.",
                    "score": 5,
                    "author": "Alternauts"
                },
                {
                    "level": 1,
                    "comment": "Thanks!!",
                    "score": 1,
                    "author": "Cloutlordcatto"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Also a rising freshman here. You can find job listings if you click the JobX link on your TigerHub homepage.",
            "score": 3,
            "author": "Temporary_Biscotti94",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks!",
                    "score": 1,
                    "author": "Cloutlordcatto",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Of course🤙🏽get that shmoney up",
                            "score": 3,
                            "author": "Temporary_Biscotti94"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Apply to a library job and apply early! Incredibly easy, pay was $14.50 last year. I watched TV and checked out maybe one or two books per shift. Sylvia is the head of Lewis Library and she’s an incredible supervisor.",
            "score": 5,
            "author": "bigsamosachaat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks! I will as soon as tiger hub is up again. It keeps crashing for some some reason lol",
                    "score": 1,
                    "author": "Cloutlordcatto"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No idea if they're hiring but a few years ago I got a job doing \"chapel watch\" - basically sat near the door doing psets for a few hours and then turned off lights and locked up when it closed. Got paid to do my homework in a cool building - hard to beat.",
            "score": 2,
            "author": "GeharginKhan"
        },
        {
            "level": 0,
            "comment": "I'm not familiar with the on-campus student jobs, but my friends and I do tutoring, which can pay 2-3 times as much per hour as on-campus jobs. I know a few companies that will take new tutors if you're interested.",
            "score": 1,
            "author": "yellowfellow99"
        }
    ]
}