{
    "id": "wsmlk9",
    "score": 6,
    "title": "ISC v. EGR v. PHY 103/MAT 201 v. PHY 105/MAT 201",
    "author": "Weak-Ad-1110",
    "date": 1660937219.0,
    "url": "https://www.reddit.com/r/princeton/comments/wsmlk9",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hey all! I am a BSE 2026 and have a few questions about the above mentioned options for fulfilling the PHY/MAT reqs. For background, I have a 5 on AP Calc BC with other math courses up to DiffEq, Discrete Mathematical Structures. And while I did not have Physics C available at my HS, I took University Physics all throughout my junior and senior year through a Comm. College. \n\nI would like to hear some input to help with this decision. I want something that is rigorous enough to challenge my problem-solving abilities and prepare me for the Engineering Physics certificate. However, I also appreciate that EGR focuses on application contexts. I am also trying to keep my GPA in mind since I will likely be applying for grad school. \n\nAlso, I heard that if I chose EGR, I would HAVE to start with Calc II. Is this true? \n\nThanks for the feedback.",
    "comments": [
        {
            "level": 0,
            "comment": "ISC is great if you don't have the physics/chem/cos credits from placement - it gets you them while teaching you a bit more past that. It's hard!\n\nEGR is a pretty good option but as you said you gotta start at Calc II, and I think you're gonna be kind of bored with your background.\n\nIf you have the experience, I'd recommend PHY 105 + MAT 203, then PHY 106 + MAT 204. That's the double advanced route and will give you lots of delicious stem experience before you go bury your skull in technical courses.",
            "score": 2,
            "author": "nutshells1"
        },
        {
            "level": 0,
            "comment": "Based on your stated background and interests, I would recommend phy 105 and Mat 201 or maybe 203",
            "score": 1,
            "author": "l33t357"
        },
        {
            "level": 0,
            "comment": "Unless you’re really unsure of what science you want to end up doing, I would advise against ISC. A couple of friends have told me it’s unnecessarily challenging for the same returns. \n\nEGR is definitely the “easiest” of the options but will give you more insight into the practical applications of physics and math concepts. While yes you technically do have to start with Calc II, I know at least 1 person from 2025 that has gotten around the University’s EGR “restrictions.” For example, he was able to switch to PHY from the EGR track while still taking EGR math. You just have to talk with your academic advisor and maybe residential college people.\n\nIf you are very sure you want a challenge in physics and math, MAT203 and PHY105 will definitely be challenging enough. As warning though, I’ve talked to a few BSE kids who tried them out and they ended up regretting it because of how hard they were and the fact that they didn’t need that kind of depth for BSE. The normal PHY103 and MAT201 track might be challenging enough, which most students agree on. \n\nYou can also always shop the classes the first two weeks of the semester and get a small taste of what the different classes might be like.",
            "score": 1,
            "author": "yellowfellow99"
        }
    ]
}