{
    "id": "y8oqqe",
    "score": 14,
    "title": "Does Princeton have a good community?",
    "author": "chatlie_cat",
    "date": 1666241559.0,
    "url": "https://www.reddit.com/r/princeton/comments/y8oqqe",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m applying to university and I’m very stuck as to whether to apply to Columbia or Princeton. One of the things that is important to me is community; does Princeton have a strong community and are people overall friendly?\nAdditionally, are there internship opportunities at Princeton; I want to major in international relations.\nAny insight is much appreciated as applications are due very soon haha!",
    "comments": [
        {
            "level": 0,
            "comment": "Yes, princeton has a great community. People usually stay on campus all 4 years, and the suburban setting really fosters a strong campus spirit. Anecdotally, when I visited Columbia, a student said that school spirit was lacking bc NYC has so much to offer, so students rarely hung out on campus. She also told me not to go to Columbia 😅 but I would recommend visiting both campuses if you can and seeing which one you like more.\n\nPrinceton has one of the best international affairs department (SPIA, School of Public and International Affairs). There are many internship opportunities, both domestic and abroad.",
            "score": 13,
            "author": "SimplyMe321"
        },
        {
            "level": 0,
            "comment": "If you’re focusing on intl relations and want a strong campus community, hard to find a better place than Princeton",
            "score": 9,
            "author": "AdministrativeHunt91"
        },
        {
            "level": 0,
            "comment": "From what I've heard, Columbia seriously lacks community because of the location and that everyone goes out in NYC rather than on campus clubs/bars/social events. Generally, they don't have any sort of campus or student body community because of that (which there are so many things to do in NYC, how can you blame them haha). \n\nPrinceton does have really solid community, but can become insular at times. The perk is that we are so close to NYC and Philadelphia that you can get out -- you just have to put effort into it. As for internships, not to drink the Princeton kool-aid, but we have some great internships and I do think, unless you want to do consulting or IB (in which case you'll have experiences like anyone else at any other school), there are lots of internship opportunities the school makes available for its undergrads. If you're interested in looking at that more rn, you can google Princeton Internships in Civic Service (PICS), International Internship Program (IIP), and general Princeton summer study abroad (I don't remember the name lol). \n\nAlso, Princeton doesn't have a specific IR major -- we have the School of Public and International Affairs (SPIA), which I'm majoring in. You'll have to take a lot of requirements that aren't international affairs oriented, but we have some amazing IR classes taught by some impressive people. Unfortunately, SPIA has surprisingly crappy study abroad opportunities for being a major with International Affairs in it compared to Economics, for instance. Regardless -- it's a good major to go into the workforce with. Your major might, and probably will change once you get to Princeton. \n\nAll that to say, based on your comments, Princeton seems like a better fit for you than Columbia lol.",
            "score": 5,
            "author": "zedem124",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is super helpful so thank you so much! I really appreciate it! Yeah, I’m leaning towards Princeton I think 😄",
                    "score": 3,
                    "author": "chatlie_cat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Given how hard it is to get into either, you may not want to take yourself out of the running at this stage and apply to both. Which you get into will determine your options. \n\nThat said, I agree with others' comments that Princeton has a good community and Columbia seems to suffer from NYC detracting from campus.",
            "score": 5,
            "author": "speedbumpee"
        },
        {
            "level": 0,
            "comment": "I grew up in Princeton (I am from a family of academics), attended Columbia, and still live in the area. I would say “community” depends on what type of community you want. Princeton has a strong community. Columbia is much more a reflection of NYC—which is another kind of community.\nA question you need to ask: Do you want to live in New York City? I wouldn’t go to Columbia for Columbia I would go to Columbia for New York City.",
            "score": 3,
            "author": "WoodsofNYC"
        }
    ]
}