{
    "id": "ztu87u",
    "score": 11,
    "title": "Help!",
    "author": "world_citizen_0",
    "date": 1671833734.0,
    "url": "https://www.reddit.com/r/princeton/comments/ztu87u",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hello, my name is Christopher, I’m a 19 years old Cuban who will probably travel to the US on February next year. Here in my country I got accepted to study Mathematics in the University of Havana but I won’t be able to follow my studies. I started researching on how to get into an American university and it’s being very frustrating to me because the process is so different from what I was used to. After a lot of search I found the Princeton program in Mathematics to be excellent for my intentions, but, the application process is giving me headaches. Basically, the admissions office asks for an official transcript sent directly from my high school and two letters of recommendation. The problem is that under any circumstances my school would collaborate with me to get the application done(politics). Plus, I don’t have any AP classes in my curriculum and the best I could do would be to shine through the SAT exams. Please every advice will be welcome. PS: Sorry for my English, I still have to improve a lot.",
    "comments": [
        {
            "level": 0,
            "comment": "no way to get in without having your transcript sent in...\n\nmaybe try to study in cuba for undergrad and come here for grad school. your university in cuba will send your transcripts\n\nits hard to get into an american school from cuba so you gotta apply to a lot of schools",
            "score": 6,
            "author": "faithforever5"
        },
        {
            "level": 0,
            "comment": "Call admission office!",
            "score": 3,
            "author": "etorii",
            "replies": [
                {
                    "level": 1,
                    "comment": "make sure to contact them immediately; they might be closed for the holidays",
                    "score": 1,
                    "author": "KingHeadlines23"
                }
            ]
        }
    ]
}