{
    "id": "zvxalm",
    "score": 7,
    "title": "Interview Tomorrow - any tips",
    "author": "[deleted]",
    "date": 1672089784.0,
    "url": "https://www.reddit.com/r/princeton/comments/zvxalm",
    "media_urls": [],
    "other_urls": [],
    "postText": "I think I’m already pretty prepared for the interview (applying undergrad) and I’ve done some decent research on my interviewer (he’s really cool actually and even has a few albums I listen to).\n\nI’m just looking for any additional tips or advice, perhaps any good questions I should ask him about the college, etc \n\nI’ve really fallen in love with Princeton the town and the school and I can’t wait for my dreams to be crushed :) but hey! Happy for all those who were accepted early!!",
    "comments": [
        {
            "level": 0,
            "comment": "Interviews are chill! Don’t stress. Be yourself, don’t say anything offensive or weird, and be able to talk about what your interested in and why. Goal is to sound like a real person with real interests and passions, like someone you’d want to get to know and be friends with... and why you’re interested in Princeton specifically, not just an Ivy League college. \n\nMy hot tip: Have a good number of questions! Interviewers love to chat about the good ol’ days in college. :)",
            "score": 12,
            "author": "cheese1234cheese",
            "replies": [
                {
                    "level": 1,
                    "comment": "How many is too many (I’m at 13 right now)",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That’s more than enough! I would say base it on time — interview at least for 25-30m probably not more than 45-50m, unless they keep on going haha",
                            "score": 4,
                            "author": "cheese1234cheese",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Cool, some of them are kinda filler in case he answers quickly and I have way too much time left. I think I’ll be good!\n\nThanks for helping, I do have another question: how do I talk to him about how cool he is without  it sounding like I’m trying to suck up to him? The dude has a lot of really impressive and cool things on his resume and he even has a few albums I’ve been listening to that are my latest fix. I plan on reading some essays he’s written as well as listening to a podcast or two he’s been on. He’s a fascinating guy and I want to share that I think he’s cool and inspiring without sounding like I’m tryna get on his good side?",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I don’t think there’s any obligation to know anything about your interviewer. It sounds like yours is famous (?) which is a little different but I wouldn’t talk too much about that, unless you’re relating it back to Princeton. Like… I saw you do  X and Y - did you do things related to that in college? How did what you studied at Princeton help you? etc. \n\nI am surprised when / if ever someone I interview has googled me lol so don’t go to hard (in my opinion!) it’s up to you of course. :)",
                                            "score": 2,
                                            "author": "cheese1234cheese",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Haha not famous, I just think he’s cool! Hell I’ve gone as far as to be one of his 12 YouTube subscribers because I’m going crazy over his music lol\n\nMaybe I’ll just note it briefly and move on or say something about how “it’s an inspiring person like you that makes me want to go to Princeton” etc etc",
                                                    "score": 1,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah I’d keep it brief haha — good luck !!!!!",
                                                            "score": 1,
                                                            "author": "cheese1234cheese",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It was the best interview of my life. :D I’m really proud of the questions I came up with because I think they’re creative but also show that I’m interested— I’m going to share!\n\n1) Did you ever feel bored at Princeton, and if so, what did you do about it?\n\n2) What did you love most about Princeton?\n\n3) What did you do for your 21st birthday at Princeton?\n\n4) Besides getting to interview applicants, what are some other opportunities that have come your way being a Princeton alum?\n\nIt wasn’t perfect but I think it was pretty close! Thanks for your guidance!",
                                                                    "score": 5,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Glad it went well! Best of luck :)",
                                                                            "score": 1,
                                                                            "author": "cheese1234cheese"
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Thanks, I’ll come back to let you know how it went o7\n\n!remind me 1 day",
                                                                    "score": 1,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I will be messaging you in 1 day on [**2022-12-27 23:14:07 UTC**](http://www.wolframalpha.com/input/?i=2022-12-27%2023:14:07%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/princeton/comments/zvxalm/interview_tomorrow_any_tips/j1s1950/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fprinceton%2Fcomments%2Fzvxalm%2Finterview_tomorrow_any_tips%2Fj1s1950%2F%5D%0A%0ARemindMe%21%202022-12-27%2023%3A14%3A07%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Delete%20Comment&amp;message=Delete%21%20zvxalm)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=Reminder&amp;message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&amp;subject=List%20Of%20Reminders&amp;message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&amp;subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                                                                            "score": 1,
                                                                            "author": "RemindMeBot"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Don’t wear your Harvard shirt",
            "score": 3,
            "author": "LazyCondition0",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha okay I’ll make sure to wear my Columbia sweatshirt instead",
                    "score": 3,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Funny enough, the Princeton store sells Princeton sweatshirts made by Columbia (the clothing company) that say both Princeton and Columbia on them! Sacrilege!",
                            "score": 3,
                            "author": "LazyCondition0",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Does Columbia sell Columbia sweatshirts made by Princeton??? 🤔",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That could be your interview question tomorrow. Better look it up.",
                                            "score": 2,
                                            "author": "LazyCondition0",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Haha play a game of stump the chump yeah",
                                                    "score": 3,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Also, maybe don’t tell the interviewer your username. Save that for the Cornell interview.",
                                                            "score": 2,
                                                            "author": "LazyCondition0"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Wait the RD deadline hasn't even arrived yet but still interviews have started? How come?",
            "score": 2,
            "author": "Beneficial_Gold8152",
            "replies": [
                {
                    "level": 1,
                    "comment": "If it helps, I am a QuestBridge Finalist RD applicant— idk if that changes anything",
                    "score": 1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When did you submit your application?",
                            "score": 1,
                            "author": "Beneficial_Gold8152",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Well, they officially received my QuestBridge application November 1st, and I wasn’t matched which is kinda like a deferral, so now I wait until RD comes out.",
                                    "score": 1,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}