{
    "id": "10fra25",
    "score": 10,
    "title": "Preparing for the Invitation to Excellence?",
    "author": "LingonberryNo5454",
    "date": 1674099117.0,
    "url": "https://www.reddit.com/r/baylor/comments/10fra25",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, I'm a high school senior and was invited to the Invitation to Excellence. They provided me with some articles to read and the scenario of the event (disease outbreak), but I am a little confused on what the actual event is. Do I need to prepare a speech or presentation for my solution to the issue ahead of time? Is it a debate/conference? Thank you in advance!",
    "comments": [
        {
            "level": 0,
            "comment": "The invitation to excellence is listening to a lecture and engaging with the other students there on the topic. It's a useful way to learn what the Honors program is like and, tbh, is a great selling point on living in the Honors Residential College. The HRC is probably the best thing about my specifically Baylor experience (ask me about Waco more generally and I have a better answer) and I would highly recommend it if you're the kind of person who is potentially looking forward to preparing a presentation for a conference.",
            "score": 3,
            "author": "wiseoldllamaman2",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you so much! Yes, I'm definitely very interested in the Honors College.",
                    "score": 1,
                    "author": "LingonberryNo5454"
                }
            ]
        },
        {
            "level": 0,
            "comment": "No, you don’t need to prepare anything, just read the material and get to know it pretty well. One of the things they look for is how well you are prepared. Basically they’ll put you in a small(ish) group of 7 or 8’people and you’ll just talk about the situation. I can’t exactly remember but I believe they give you a sheet with some main points to talk through. Someone will be in there with you listening and taking into account your participation in the conversation and your preparedness. Then they’ll take you to combine with another group and you’ll put together some sort of presentation (it was a very short PSA video for me). It’s not too serious and it’s pretty fun.",
            "score": 1,
            "author": "sierramistinmyveins",
            "replies": [
                {
                    "level": 1,
                    "comment": "Great, thanks so much for the info!",
                    "score": 1,
                    "author": "LingonberryNo5454"
                }
            ]
        },
        {
            "level": 0,
            "comment": "hi!! i’m also part of invitation to excellence. where did you find the articles?",
            "score": 1,
            "author": "CamsCakes",
            "replies": [
                {
                    "level": 1,
                    "comment": "[https://www.cdc.gov/eis/field-epi-manual/chapters/Field-Investigation.html](https://www.cdc.gov/eis/field-epi-manual/chapters/Field-Investigation.html)\n\n  \n[https://www.cdc.gov/csels/dsepd/ss1978/lesson6/section2.html](https://www.cdc.gov/csels/dsepd/ss1978/lesson6/section2.html)\n\n  \n[https://baylor.app.box.com/s/1cy4finbpgq79ld7j7lc43836s5fg8t4](https://baylor.app.box.com/s/1cy4finbpgq79ld7j7lc43836s5fg8t4)\n\neverything was in an email they sent us",
                    "score": 1,
                    "author": "OwnFisherman1",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "thank you!! is this for the honors college? i’m currently business. sorry i’m j really confused haha",
                            "score": 1,
                            "author": "CamsCakes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's for the invitation to excellence event. If you're going to the jan 20-21 event then you should read this before you go. I'm in the honors college but I'm basically an art major so I'm also hella lost.",
                                    "score": 1,
                                    "author": "OwnFisherman1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "ok thank you sm. sorry for all the questions but when did you get an email? i’ve been combing my inbox and i can’t find anything",
                                            "score": 1,
                                            "author": "CamsCakes",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I got it on Saturday\nThis is what it said:\n\nDear Student,\n \nWe look forward to welcoming you to the College of Arts &amp; Sciences, Invitation to Excellence: Code Red scholarship event on Saturday, January 21. We hope you enjoy this opportunity to work alongside Baylor professors, current students, and other prospective students from around the world.\n \nAs you prepare, we provide several resources to help expand your knowledge of infectious diseases. We invite you to spend approximately an hour reviewing these materials before our event.\nCDC Field Investigation: https://www.cdc.gov/eis/field-epi-manual/chapters/Field-Investigation.html\nCDC Investigating an Outbreak: https://www.cdc.gov/csels/dsepd/ss1978/lesson6/section2.html\nDr. Muehlenbein Video: https://baylor.box.com/s/1cy4finbpgq79ld7j7lc43836s5fg8t4\n \nWhile we expect your primary motivation in attending Invitation to Excellence is to determine if Baylor is a good fit for your undergraduate education, we also realize the opportunity to compete for scholarships is attractive. To that end, we wanted to address information about the scholarship competition. The scholarship committee will consider several factors, including your preparation for the event, your time with us on the day, and your essay. You will receive the essay prompt in a follow-up email after the event, and the essay is due by February 20, 2023, at 5:00 PM CST.\n \nYear after year, we hear great feedback regarding this event, and we look forward to thinking through the complexities of this scenario* with you. We are including (via BCC) your parent(s)/guardian(s) in this email exchange to ensure that you get this information. See you soon.\n \nSincerely,\nThe Code Red Faculty Leadership Team\nThe College of Arts &amp; Sciences\n \n(sent from the desk of Ms. Jaime Basher, Assistant to the Associate Deans and Directors in the Undergraduate Studies Office of the College of Arts &amp; Sciences)\n \n*Scenario:\nAs a professional, you are being assembled with others to mitigate the effects of an unfolding epidemic —a massive outbreak of several hundred reported cases of severe intestinal infection. Cases appear to be associated with recent attendance at a theme park in Orlando, Florida, following a large storm that may have affected the water treatment facilities in the region. Initial evaluation of specimens indicates a bacterial causative agent, possibly Vibrio cholerae.",
                                                    "score": 1,
                                                    "author": "OwnFisherman1",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "ok i def didn’t get anything like that, but i’ll be sure to ask tn:) thank you soooo much!",
                                                            "score": 1,
                                                            "author": "CamsCakes",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Ofc my parents got it too--maybe ask your's.",
                                                                    "score": 1,
                                                                    "author": "OwnFisherman1"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "sorry i haven’t been checking my notifications but yes i think these were the articles they sent everyone regardless of major",
                    "score": 1,
                    "author": "LingonberryNo5454",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "hi! it was actually dependent on major; only the business department did not have prep work. thanks for your help!",
                            "score": 1,
                            "author": "CamsCakes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "ah, good to know. hope it works out well for you!",
                                    "score": 1,
                                    "author": "LingonberryNo5454"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}