{
    "id": "10x7t85",
    "score": 3,
    "title": "Invitation To Excellence",
    "author": "bishplznah",
    "date": 1675883423.0,
    "url": "https://www.reddit.com/r/baylor/comments/10x7t85",
    "media_urls": [],
    "other_urls": [],
    "postText": "Hi, for the people who are already done with their Invitation to Excellence sessions, how did it go and what advice would you have for me? For people like me who have their session on 13th of February what are you expecting?",
    "comments": [
        {
            "level": 0,
            "comment": "I2E is an advertisement for what life in the Honors Residential College is like. It was unqualifiedly the best part of my rocky Baylor experience, so I highly recommend it.\n\nI don't know if I got the maximum, but I do remember that I2E both took Baylor from an expense I could never afford to suddenly being (from my high school senior perspective) economically feasible. The people who did better seem to be the people who genuinely engaged with the text rather than trying to show off as the smartest person in the room. Don't take yourself so seriously that you fail to enjoy the experience, which will basically be a lecture and then a conversation about that. If you find you don't enjoy I2E, the HRC community isn't the best fit for you culturally, which isn't a reflection on you so much as the fact that the HRC is nerdy as hell and that's why I loved it.",
            "score": 4,
            "author": "wiseoldllamaman2",
            "replies": [
                {
                    "level": 1,
                    "comment": "What exactly happened in that and is it a sort of competition with your peers or something? Also do you have any idea how they determine who receives the maximum award?",
                    "score": 1,
                    "author": "bishplznah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It has been almost a decade, so the information I have to offer is limited by memory and institutional change. \n\nYou listen to a lecture and engage with people on the topic. It's like a trial run of a college class and the kinds of conversations you'll have around the HRC. It is **not** a competition and seeing it as one will only hurt you. \n\nThe maximum award is given based on how much the people in charge of making that decision think you will make a good addition to the community. This scholarship is, in my mind, basically about how much fun you are to have in a discussion. Be aware of how much you're talking, make room to help others talk, and as long as you have something intelligent to add, you'll do great.",
                            "score": 3,
                            "author": "wiseoldllamaman2"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "The maximum is $20k",
            "score": 3,
            "author": "MyeReezy"
        },
        {
            "level": 0,
            "comment": "I went to I2E a few weekends ago. uhhh actually read the stuff for the case study you were given. be yourself and have fun. go to the meet and greet night thing the night before… it’s a lot of fun and you get to talk to professors and current students! It was a lot less stressful than I anticipated honestly.\n\npersonally my case study topic had nothing to do with my major and most of the people in my group didn’t know much about the actual topic at hand except for me. the most important part imo was being able to use your OWN perspective and your perspective from your life and your major and being able to translate it into your case study.",
            "score": 3,
            "author": "physicsnchlorine",
            "replies": [
                {
                    "level": 1,
                    "comment": "The thing is my session is the online one which most international students opt for. Also the session is on 13th Feb so when exactly can I expect to receive this case study?",
                    "score": 1,
                    "author": "bishplznah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh. Maybe you won’t get a case study since it’s online. Idrk. I got mine a week before.",
                            "score": 2,
                            "author": "physicsnchlorine"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Also what is the maximum award I can expect from Invitation to Excellence and how can I maximise my chances of getting it?",
            "score": 2,
            "author": "bishplznah"
        },
        {
            "level": 0,
            "comment": "Just go and have fun. I don't remember it being high pressure or anything. I went to I2E 20 years ago so I can't really tell you what to expect these days, lol.",
            "score": 1,
            "author": "0x68656c6c6f"
        }
    ]
}