{
    "id": "11w82eq",
    "score": 14,
    "title": "No one gonna talk about us losing to creighton? Pain bruh",
    "author": "leeeelihkvgbv",
    "date": 1679285310.0,
    "url": "https://www.reddit.com/r/baylor/comments/11w82eq",
    "media_urls": [],
    "other_urls": [],
    "postText": "Lost for words… The past two years we won the natty, two big 12 champ and now this year none of that with a second round exit and shitty play. Played worse than last years team who at least had a large comeback and went overtime with UNC. They also got the big 12 title too. \n\nNot sure how next season going to go with a couple of major people like Flagler and George going to the draft or graduating…",
    "comments": [
        {
            "level": 0,
            "comment": "This team was deeply flawed as nobody in the rotation was really a true two-way player, especially our guards.  We made the call to sacrifice defense for offense in that case, which works against inferior teams or when you play at home.  However, you saw time and time again that when the offensive faucet ran dry, we were incapable of stopping te game from getting away from us.  Virginia/Marquette games in the fall &amp; KU/KSU/ISU games in the spring were massive red flags.  Luckily, the team has a strong chance to be better next year with JTT fully healthy, Love developing, Cryer/Bridges back, and two athletic/lengthy freshman in Walker &amp; Little coming in.  Just add some solid transfers at wing and we should contend in the big 12.",
            "score": 19,
            "author": "dfox85",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also, don’t forget last seasons team easily could’ve made the final four if not for the Cryer injury.",
                    "score": 6,
                    "author": "dfox85"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This shouldn't surprise you. Look at our losses this year. Look at how we lost our last few games- including to Iowa State. Creighton was the type of team I dreaded. Plus, we weren't favored to beat them. \n\nAnd considering how they were shooting, we weren't going to win.",
            "score": 7,
            "author": "JaracRassen77"
        },
        {
            "level": 0,
            "comment": "It was a fun season in a very competitive conference. I'm sad it's over and a little disappointed we didn't do better in the tournament but I'm happy they kept things interesting all year long. Hopefully next year's team is a little stronger defensively so that the wheels don't fall off when our shooting gets cold.",
            "score": 3,
            "author": "tcwillis79"
        },
        {
            "level": 0,
            "comment": "Thank god I never have to see Thamba in a Baylor uniform ever again. \n\nAlso good riddance to Key, who was great for filling up the scoreboard with tough buckets, but a complete defensive liability. Will forgive but wont forget him for that absolute boneheaded deep three in Austin with 23 seconds left.",
            "score": 5,
            "author": "52isabeast"
        },
        {
            "level": 0,
            "comment": "I thought this team missed Mathew Meyer a lot….",
            "score": 2,
            "author": "mlgbt1985",
            "replies": [
                {
                    "level": 1,
                    "comment": "He scored 2 points in 22 minutes against Arkansas this week. I don’t we would have fared any better with him tbh",
                    "score": 2,
                    "author": "Amish-Lapdancer2001"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Plenty of missed shots. Saw this coming months ago.",
            "score": 1,
            "author": "thabakersman"
        },
        {
            "level": 0,
            "comment": "Honestly idk how anyone could watch our team all season and be surprised by the result from last night. We have one good defensive player (Bonner). Our offense is predicated on our guards winning their 1s with no lob threat to roll to the hoop when they draw help, and our guards aren’t good enough to consistently win their 1s anyways.",
            "score": 1,
            "author": "Vague_Intentions"
        }
    ]
}