{
    "id": "121pyv1",
    "score": 3,
    "title": "advice",
    "author": "swaggmeister420",
    "date": 1679759398.0,
    "url": "https://www.reddit.com/r/baylor/comments/121pyv1",
    "media_urls": [],
    "other_urls": [],
    "postText": "ok so i’m a senior in highschool got in to Baylor which is amazing as it’s my top choice and has been forever. unfortunately, money is an issue because my mom makes six figures so we don’t get too much help BUT i only have my mom as well as older siblings and one of which who is in college. I got about $31k in grants and scholarships (not including loans and fws) which is great but around $43k is not very attainable and i only recently found out i got in which i planned on finding out earlier but didn’t see the emails about the stuff till nov. 1st passed. anyways i know i can get a scholarship from church since i go to a baptist church and they’ll match it, but still it’s not very realistic. I knew it would be expensive but didn’t realize it was 75k and i have applied to A TON of scholarships but i’m not sure if i should go because of the burden since i know all of that will still be paid off for a while 😅. i know my mom would let me go but i know if i do it will definitely be a lot on her financially which i don’t want and so yeah i was just wondering y’alls input?",
    "comments": [
        {
            "level": 0,
            "comment": "Honestly, I don't think any school is worth 150k+ debt, and definitely not Baylor. I was in a similar position in high school, despite scholarships I definitely had some guilt for the financial strain that college would put on my family. However, I channeled that guilt and used it as motivation to graduate early, which helped lower overall cost of attendance. My parents were happy to see me thrive, but I understood that the impetus was on me to make the most of my undergrad experience. \n\nKeep applying to those church-affiliated scholarships: lots of them go unfilled each year. Consider transferring in from a community college. \n\nI don't know if any admin lurk on this subreddit but the decision to move away from merit/need based scholarships is so ridiculous and disingenuous to Baylor's proposed plans to grow the value and inclusivity of the student body. Baylor is one of the two private universities in the US to have GROWN their endowment through the COVID, yet so many great would-be matriculants are still priced out. Clearly our balance sheet isn't the problem, why are we still selecting based on financial means?",
            "score": 6,
            "author": "spyromain",
            "replies": [
                {
                    "level": 1,
                    "comment": "i actually go to a college prep school that graduates with our associates so i already have a ton of dc classes 😅👍 but yeah i totally get what you’re saying and i definitely don’t plan on going there more than 3 years especially since i’m getting my masters as well…thank you!!",
                    "score": 4,
                    "author": "swaggmeister420"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I was in the same spot as you. the best advice i can give you is to look at the baylor “estimate your bill” spreadsheet on the one stop website. I know Baylor tell you that tuition is 75k but that included non-billable costs. Tuition is 54,844 and add dorm (4-5k) and a meal plan. I know it is still high but the the 31k grant you got will apply to your billable only. You can always go to the One Stop office and they will tell you exactly how much you will end up paying without the added non-billable, It almost always ends up being less than what Baylor says on the financial aid offer. \nAnd if that’s still too much money then I recommend going to maybe Collin College for a year or so and then transferring to baylor as a sophomore or junior because you will qualify for a lot more scholarships.",
            "score": 2,
            "author": "Delicious-Jello-235",
            "replies": [
                {
                    "level": 1,
                    "comment": "the thing is i go to a college prep school that graduates with their associates degree so i can’t go to a cc but thank you i’ll definitely do the other stuff!!",
                    "score": 1,
                    "author": "swaggmeister420"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What are your other options?",
            "score": 1,
            "author": "OriginalOmagus",
            "replies": [
                {
                    "level": 1,
                    "comment": "unt which is a great school and their hr programs (what i’m majoring in) are pretty similar and i like unt but i really like baylor as a whole and i know i’ll be fine if i went to unt but idk…i got into to all the schools i applied to so i know i’ll be fine it’s just kind of hard i guess",
                    "score": 2,
                    "author": "swaggmeister420",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Generally speaking, Baylor probably has more highly ranked programs (other than in music). But rankings may not matter much unless you're planning on attending grad school afterwards.\n\nIf Baylor and UNT are the two schools you're interested in, I'm assuming that you're a Texas resident. That means UNT is probably going to be significantly cheaper, although I don't know what your financial aid situation is there. If you haven't already, try to visit both campuses (ideally during the week when students are around) to try and get a sense of the community at both. Denton and Waco aren't terribly dissimilar, although Denton's proximity to DFW might mean a different college experience than what you would get in Waco.\n\nBased on what you've said here, I would advise you to really consider UNT because I always recommend trying to graduate with the least amount of debt possible.",
                            "score": 1,
                            "author": "OriginalOmagus",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "yeah i plan on getting my masters and unt is WAY cheaper for my family…my mom said we’d be fine if i got like 20k more in scholarships so i’m hoping that will happen but if not by june 1st i’ll probably be at unt which i’m honestly ok with",
                                    "score": 1,
                                    "author": "swaggmeister420"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}