{
    "id": "dniqq5",
    "score": 89,
    "title": "Oklahoma falls to Kansas State - Baylor now first in the Big 12!!",
    "author": "DanaNotDonna",
    "date": 1572119159.0,
    "url": "https://www.reddit.com/r/baylor/comments/dniqq5",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "We won the bye week boyz",
            "score": 27,
            "author": "gir6543"
        },
        {
            "level": 0,
            "comment": "I loved seeing Oklahoma and Texas lose on the same day, but R.I.P. to our strength of schedule.",
            "score": 17,
            "author": "jonneygee"
        },
        {
            "level": 0,
            "comment": "Kinda sucks because we probably won’t get game day now :(",
            "score": 6,
            "author": "-WOWZ-",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oklahoma will still be top 10 and Baylor has a solid chance of still being unbeaten. I think we are still the favorites",
                    "score": 7,
                    "author": "luttkaleb",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't think Oklahoma will rank top 10 honestly. They lost to an unranked team is what is perceived to be a weak conference. The voters will not be merciful.",
                            "score": 10,
                            "author": "DanaNotDonna",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Top 5 team on the road losing at a tough place to play typically drops you down to 11 or 12. See Baylor 2014.",
                                    "score": 6,
                                    "author": "DannyBenavidez",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Add to that the obvious ranking bias towards big programs (looking at you Texas, Texas a&amp;m and Florida State)",
                                            "score": 8,
                                            "author": "gir6543"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Where do you see the voters ranking this week? Does Baylor over take Oklahoma in the AP poll since we have a better record and beat the team they lost to?",
                            "score": 2,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No way we overtake Oklahoma (and I'm not sure we should tbh)",
                                    "score": 8,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Idk that'd kinda be dumb if they ended up at like 10 and we went to 11 when we're undefeated and they lost to a team that we beat, also on the road.",
                                            "score": 1,
                                            "author": "goshin2568",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yea, but the rankings are often dumb...",
                                                    "score": 2,
                                                    "author": "Always_ssj"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Well it’s out now but I was gonna say Oklahoma t 9 or 10 and Baylor at 11 or 12 (depending on how much they like Auburn)",
                                    "score": 1,
                                    "author": "luttkaleb"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Assuming we win out against WVU and TCU, and OU doesn't lose again, we are still in prime contention for Gameday. At that point, we will be undefeated and sitting around #6-8. OU should be around #8 or 9. Two top 10 teams, one of which is undefeated, squaring off will definitely draw attention. Plus, the only other contender for Gameday on November 16 is UGA vs. Auburn, neither of which is undefeated (but it's an SEC game, so go figure). We are still definitely in the one or two slot for Gameday currently. But let's just take care of business Thursday and in Fort Worth first. I really don't want to get too far ahead of ourselves, especially after the cannibalization the conference suffered last Saturday. Sic 'em!",
                    "score": 1,
                    "author": "Legion213"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And Horns Down lose to Frogs, what a day to be alive....",
            "score": 8,
            "author": "TXWayne"
        },
        {
            "level": 0,
            "comment": "Kings of the hill!!!",
            "score": 6,
            "author": "FCDallasBurn"
        },
        {
            "level": 0,
            "comment": "Was hoping they would be undefeated when we played them.",
            "score": 5,
            "author": "bearguy82",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same. I really don’t know all the ramifications of this loss and how it benefits the Bears. But, I bought tickets to the Baylor OU game hoping to see both teams show up undefeated. Will still be a great game. Hope there is only one loss involved in the matchup now.",
                    "score": 8,
                    "author": "jwall4",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "From a playoff perspective, it’s not good I would think (SOS). \n\nHowever, from a big 12 championship, this should help us get to the title game. We can win out and drop the UT game to still get in. OU now looks beatable. If they drop another one against Iowa State or OSU, we can afford to lose that game but beat everyone else.",
                            "score": 4,
                            "author": "ttay24",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yep this. If we end up with 1 loss almost no chance we get in the playoffs, however I still think any undefeated P5 team gets in. Seeing as I didn’t expect us to compete for the conference championship this year, much less CFP,  I’ll gladly take the knock to playoff odds, and the bump in our conference champ odds.",
                                    "score": 7,
                                    "author": "Always_ssj",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I seriously doubt we get into the playoffs, even if we win out. I do think we have a valid shot at the Big 12 title game, though, which is pretty amazing. It would be a huge boost to use if we could win the conference in Rhule's third year.",
                                            "score": 1,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}