{
    "id": "r4oiag",
    "score": 17,
    "title": "In terms of college marching bands, how good of a band program is the Golden Wave Band?",
    "author": "DoopleDunkuslll",
    "date": 1638163823.0,
    "url": "https://www.reddit.com/r/baylor/comments/r4oiag",
    "media_urls": [],
    "other_urls": [],
    "postText": "(Asking as a High Schooler considering Baylor.)",
    "comments": [
        {
            "level": 0,
            "comment": "Current member here!\n\nIt is by far one of the best experiences you can possibly ask for from a marching band. We prioritize minimal rehearsal time with maximum results. We rehearse less than about 75% of bands out there, but still look and sound just as good, and any college band director would tell you that. We still do challenging shows, despite the limited rehearsal time, and our directors aren't afraid to try new things with us (see our Men's basketball national championship show from this year!)\n\nBeyond the music, the ensemble has an excellent atmosphere of excellence, support, energy, and family love. There's not a single section in the band that won't welcome you and treat you like family. The band directors really care about each member and care about us as people and not just musicians. \n\nBUGWB has been the most important part of my college career thus far. Marching band was my life in high school. I loved every moment of it, so I knew I wanted to go to a college that had a marching band, but I also wanted to go to a Christian school (I'm planning to go into ministry), so Baylor was really my only option in that regard. It has turned out to be the perfect fit for me though! It has fostered all of my favorite moments as a Bear, and has created a wonderful social group for me to be a part of. I honestly can't speak highly enough of it!\n\nBeing in BUGWB also opens to door to be apart of our other ensembles: Fall Ball Band (volleyball and soccer) as well as Courtside (basketball band), which are both tons of fun, and you can have the opportunity to travel with the volleyball and basketball teams in their respective NCAA tournaments!\n\nPlease ask any and all questions you might have. If I don't have an answer, I'll know where to direct you to find one!",
            "score": 21,
            "author": "Sir_Ninja_VII",
            "replies": [
                {
                    "level": 1,
                    "comment": "Is there somewhere online I would be able to find the BUGWB stand tunes, ore is that locked behind a wall for members?",
                    "score": 6,
                    "author": "DoopleDunkuslll",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Are you just wanting a list, or the actual sheet music? If you're looking for the sheet music that would be for members only because of copyright and such, but I could send you just a list.",
                            "score": 4,
                            "author": "Sir_Ninja_VII",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I was looking for the sheet music, so I guess I’ll get to see it when I join the BUGWB.",
                                    "score": 5,
                                    "author": "DoopleDunkuslll",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yeah so once you officially commit to joining the ensemble and register for the course, the first class that will be added to your Canvas page will be BUGWB. On that canvas page will be a link to a Dropbox with all of the music. That page usually opens up around late June/early July.\n\nExcited to hear you're looking to come to Baylor and join!",
                                            "score": 4,
                                            "author": "Sir_Ninja_VII"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Giving it another thought, I would be happy to see the list, just to know the songs I will play in the future.",
                                    "score": 2,
                                    "author": "DoopleDunkuslll"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Current member here. You nailed everything! Band here presents great opportunities for bonding and friendship like no other, and it’s great what we can achieve in such a little amount of time. I marched with other groups in the past, and no one has energy that they bring to rehearsal like the Golden Wave. I will forever cherish my time here",
                    "score": 5,
                    "author": "Pakman747"
                }
            ]
        },
        {
            "level": 0,
            "comment": "And another thing, is there some place online where I can find the stand tunes that Baylor Uses?",
            "score": 4,
            "author": "DoopleDunkuslll",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not sure what year you are in school, but there is a program called [Bear Bands](https://www.baylor.edu/gwb/index.php?id=868923) that allows HS juniors &amp; seniors to spend a day with the band to see what it's like to be a part of the program. I participated in Bear Bands before I went to Baylor, and it was great to see what it was going to be like. You'll also get some of the stand tunes so you can play along with the band.",
                    "score": 5,
                    "author": "Lokiofpigfarts",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We actually just did Bear Bands this past weekend at the Tech game, so if OP is a senior he would have already missed out on this opportunity unfortunately :( he'll be able to do it all for real next year though!\n\nAnyone else seeing this that's not a senior come on out in future years!",
                            "score": 3,
                            "author": "Sir_Ninja_VII"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Top tier",
            "score": 1,
            "author": "Qbertyy"
        }
    ]
}