{
    "id": "txhty4",
    "score": 9,
    "title": "computer science at Baylor",
    "author": "RanJ_735",
    "date": 1649235738.0,
    "url": "https://www.reddit.com/r/baylor/comments/txhty4",
    "media_urls": [],
    "other_urls": [],
    "postText": "I have received an acceptance from Baylor, and scholarship wise it might be the best offer i have received. Tho among other offers i have received, i can't decide on which university would be good for me. Can anyone share their experience in the campus, or maybe share their views on the cs program that Baylor offers.\nIt would be a great help, thanks.",
    "comments": [
        {
            "level": 0,
            "comment": "Cs is a really hard track here at baylor, but I’ve heard that it pays off when your looking for a job\n\nI am currently a freshman living in teal, if I did not live in teal I think I would be significantly more miserable because I feel like you need friends to pass CS with a good grade (keep in mind I have zero official cs experience until college)\n\nCampus is really nice, the people here are really nice it’s over all great and I love it. I the computer science buildings are nice and most of the cs teachers are really unique and fun to listen to.",
            "score": 3,
            "author": "TragicKill3r"
        },
        {
            "level": 0,
            "comment": "Here to say if you do CS, live in Teal. I do not think I could have survived the weed out if I didn’t have other teal kids struggling next to me. CS is hard. The professors are tough but you look back and laugh. The community is really small but that means we’re pretty close. Only thing is there is very few cs jobs hiring out of Baylor you have to go and get them they won’t come and get you. It sounds as if money will be coming soon to try and give us some better stuff but they’ve been saying that for a while. Cybersecurity is getting a revamp though so that might be worth looking into (still cs degree). Im just a freshman but I’ve gotten to meet a lot of upperclassmen cs majors and they share the same basic sentiment. I’ve enjoyed my time even though it is difficult. I bet you would too.",
            "score": 3,
            "author": "Bminor023",
            "replies": [
                {
                    "level": 1,
                    "comment": "hello brendon.",
                    "score": 1,
                    "author": "I-represent-america"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The CS program at Baylor is rigorous, but it prepares you well for jobs or Graduate programs.",
            "score": 1,
            "author": "atx_buffalos"
        }
    ]
}