{
    "id": "u1m2z3",
    "score": 6,
    "title": "Who’s got there classes almost filled up and haven’t registered yet?",
    "author": "leeeelihkvgbv",
    "date": 1649723527.0,
    "url": "https://www.reddit.com/r/baylor/comments/u1m2z3",
    "media_urls": [],
    "other_urls": [],
    "postText": "WTF is this shit? Bruh Baylor, I thought as a junior I’d get an increased chance of getting the classes I want, but looks like most of planned classes are about to be full and seniors haven’t even finished registering... are they gonna open up spots or what? Some classes only got like 25 max spots which is BS",
    "comments": [
        {
            "level": 0,
            "comment": "*their",
            "score": 4,
            "author": "fadedfizzle",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thanks I realized that after posting it.",
                    "score": -3,
                    "author": "leeeelihkvgbv",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "fake dyslexia at a doctor’s visit and they’ll let you register early",
                            "score": 4,
                            "author": "fadedfizzle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Lmao 😂",
                                    "score": 1,
                                    "author": "leeeelihkvgbv"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I recommend taking classes during the summer so you avoid this problem and get more hours to be considered a senior quicker",
            "score": 2,
            "author": "broi8yourmom",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not sure what is with the downvotes, but this is true",
                    "score": 2,
                    "author": "leeeelihkvgbv",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Idk man. Ppl be hating",
                            "score": 1,
                            "author": "broi8yourmom"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm an incoming senior and my minor classes (business admin) was half filled up as of last week... so I can't imagine registering today since my registration date is today. 😵‍💫",
            "score": 1,
            "author": "cccreme_brulee",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yea that’s crazy. Hope you got hold of those closes during your time. I feel like registration should exclude AP credits and only consider dual enrollment. Kids with AP credits are like juniors as freshman and it’s so annoying that they get priority over us",
                    "score": 1,
                    "author": "leeeelihkvgbv"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Thank God I'm retarded. I've always been the first to sign up for all my classes till the very end.",
            "score": 1,
            "author": "KingSurvived2012",
            "replies": [
                {
                    "level": 1,
                    "comment": "Haha",
                    "score": 1,
                    "author": "leeeelihkvgbv"
                }
            ]
        }
    ]
}