{
    "id": "v17wwe",
    "score": 6,
    "title": "How should I (incoming freshman male) go about picking a dorm?",
    "author": "AceHoops",
    "date": 1653939179.0,
    "url": "https://www.reddit.com/r/baylor/comments/v17wwe",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’ll be double majoring in Journalism and Religion, so any FYC close to those buildings (esp. Castellaw) would be preferable. Outside of that, though, I’m not really sure what to look for – my room selection time slot is super early, but I don’t have a roommate yet, so I’m really wide open.\n\nUpdate: Thank you all for your suggestions! I somehow found a roommate about half an hour before my room selection slot, and he felt strongly about Martin, so I’ll be going there.",
    "comments": [
        {
            "level": 0,
            "comment": "Maybe my knowledge is outdated, but when I went to Baylor about a decade ago, you got into the university, completed a ton of basic courses and then started your actual college specified courses for your specific major.\n\nI point this out to say that maybe you don't need to live near Castellaw. I suggest you look up what your actual freshman itinerary would probably look like regarding classes you are taking, and maybe reevaluate the  notion You should live close to that building freshman year. I suspect you find that almost every single course you are expected to take your freshman year will not be in Castellaw",
            "score": 9,
            "author": "gir6543",
            "replies": [
                {
                    "level": 1,
                    "comment": "While that is true for most people, I’ll likely have to frontload my major-specific prerequisite courses because of the double-major. But I won’t know for sure which classes I’m taking until my advising appointment, which is a week after I’m scheduled to pick my room.",
                    "score": 0,
                    "author": "AceHoops",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you haven't yet, apply to the Honors College and live in the residential college. It was the best part of being at Baylor.",
                            "score": -4,
                            "author": "wiseoldllamaman2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Idk why you are getting downvoted, maybe your comment out of topic, but nevertheless I agree the HRC was an amazing experience.",
                                    "score": 3,
                                    "author": "leeeelihkvgbv",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Meh, whatever. It's not far from Tidwell or Castellaw and it would allow OP more freedom to front load those classes. Anyone who intends to double major at Baylor should at least apply to the University Scholars program. I spent all my time at Baylor living in the HRC, something that didn't happen when I was there at almost any other dorm. It was a unique experience and the main reason I didn't transfer somewhere that wouldn't treat me the way Baylor is still treating me today.",
                                            "score": 4,
                                            "author": "wiseoldllamaman2"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Penland or Martin. That’s where a lot of the people/things you’ll want to be around will be happening. Both of those are very much the traditional freshman experience and will connect you with people in your class really well",
            "score": 7,
            "author": "intenselydecent"
        },
        {
            "level": 0,
            "comment": "Doesn’t matter, no one really gets where they want",
            "score": 7,
            "author": "EggSandwich12"
        },
        {
            "level": 0,
            "comment": "I’m in Heritage and I absolutely love it. I’ll be a sophomore and I’m planning on staying here all 4 years of college. It’s the fine arts dorm (journalism counts!) but it’s right next to Castellaw. The community is amazing, and no communal bathrooms!\nIf you’re looking for something cheaper, I recommend North/South Russell or Penland.",
            "score": 3,
            "author": "Acw_1213"
        },
        {
            "level": 0,
            "comment": "If you can, switch to a profitable major. One useful major is better than two useless ones.\n\nYou can still work for a church or write with any other major.\n\nComing from a religion major who worked for a church and then got tired of making what a teacher does. Went back for an MBA and now make well over six figures. I am also more valuable to a church if I ever get back into ministry. I can help with a lot of things operationally that a religion major wouldn’t be able to help with.\n\nPenland is the best place to meet a lot of people.",
            "score": 3,
            "author": "Ulysses808"
        },
        {
            "level": 0,
            "comment": "Look at North/South Russell. Pretty cheap rooms and communal bathrooms. (Several separate walled showers, toilets, etc) You have a mirror and sink in your room for basic hygiene stuff. \n\nThe environment is really communal and it helped me find friends when I arrived at Baylor. Like a 2 minute walk to Castellaw, which you will be at constantly (Check out the Lariat too if you need some extra cash when on campus), and a 3 minute walk to Penland Dining Hall, where you’ll eat almost every meal freshman year. \n\nPM me if you have any other questions, just graduated in the Fall.",
            "score": 2,
            "author": "PoetOfTheScythe"
        },
        {
            "level": 0,
            "comment": "closest to Castellaw is University House, Heritage House (that's fine arts btw), and Penland. All the dorms have been renovated except HRC, Allen, and Dawson. I think this summer Collins is getting renovated, but that doesn't matter for you. Honestly, most of your first two semesters will be gut courses and like maybe a few major-specific entry courses. Your possible religion courses may be anywhere around the campus, and the later courses for that will be in Tidwell. Also, Baylor is a small campus. You'll be surprised by how fast it takes to get from one place to the next. I lived in Allen, so I was far away from almost all of my classes. As of now, I'd pick your dorm based on the community it offers and if it's nice. University and Heritage are nice, Penland's aight but they have the strongest community on campus. Other nice halls include Brooks Flats, and Brooks Residential College.  You could also pick based on when you get to see which buildings your classes are in but I think that is much later. NORO, SORO, Martin, and Penland were all renovated so they are okay but their selling point is their community- it's really strong. All dorms mentioned have a good community so you can't go wrong with that, just others have different or stronger communities.",
            "score": 2,
            "author": "Hokkaido_Milk"
        },
        {
            "level": 0,
            "comment": "I’m in Teal still waiting for one more person to join my group. My room selection date is June 2 5:15 pm.",
            "score": 1,
            "author": "Shadoxas"
        }
    ]
}