{
    "id": "wladhk",
    "score": 12,
    "title": "Any recommendations for on-campus work study jobs?",
    "author": "padmeislife",
    "date": 1660169475.0,
    "url": "https://www.reddit.com/r/baylor/comments/wladhk",
    "media_urls": [],
    "other_urls": [],
    "postText": "I’m an incoming freshman looking for something that is either really easy to do and will allow me to do homework, or something really fun that makes time fly by.\n\nSo far I’ve applied for SACE Front Desk Monitor, SACE Class Checker, Learning Resources Center Student Assistant, Fitness Center Attendant (my top choice), and Student Worker Lab Attendant.",
    "comments": [
        {
            "level": 0,
            "comment": "Front desk positions are essentially free study periods with no oversight. Sorry to be the bearer of bad news but working the SLC gym is the worst choice by far: you will be required to incessantly wipe down equipment and yell at people for not bringing towels.",
            "score": 13,
            "author": "spyromain",
            "replies": [
                {
                    "level": 1,
                    "comment": "Welp looks like that’s not longer by top choice lol. \n\nI’ll look into more front desk positions, thank you.",
                    "score": 1,
                    "author": "padmeislife"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Law Library desk attendant is easily the best position on campus. Free study session and access to the best study spot on campus with access when you are not working late night. And among the easiest jobs I have ever had.",
            "score": 7,
            "author": "SicEm94",
            "replies": [
                {
                    "level": 1,
                    "comment": "this sounds rly nice",
                    "score": 1,
                    "author": "kalexandraa"
                }
            ]
        },
        {
            "level": 0,
            "comment": "The bowling alley in the sub is the easiest job you will ever have. Could study basically the entire time cause there’s so few responsibilities. During the summer I’d take one their spare TV’s out and watch Netflix/study my entire shift, only stopping to clean shoes or unjam a machine.",
            "score": 3,
            "author": "unounoseis",
            "replies": [
                {
                    "level": 1,
                    "comment": "Do you know what the actual job title is? I’m having trouble finding it.",
                    "score": 1,
                    "author": "padmeislife"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I worked in the Interlibrary loan dept in Moody, I liked it. Not necessarily a free study hall though, at least not when I was there.",
            "score": 2,
            "author": "HuMcK"
        },
        {
            "level": 0,
            "comment": "Not sure if the art gallery still has the position I had in 2015 but that was solid.",
            "score": 2,
            "author": "spcordy"
        },
        {
            "level": 0,
            "comment": "Not sure if the position still exists, but I was a data processor in the admissions office for a year. It's definitely not a free study period, but it was easy to work around my schedule and it didn't involve me having to interact with anyone for the most part. I just put headphones in and did my work.",
            "score": 2,
            "author": "thebreannashow"
        },
        {
            "level": 0,
            "comment": "I would say bowling alley or climbing wall staff at the SLC.",
            "score": 2,
            "author": "brycekunkel"
        },
        {
            "level": 0,
            "comment": "im a TA for a lab and i get to study the whole time! it’s great!",
            "score": 2,
            "author": "kalexandraa"
        },
        {
            "level": 0,
            "comment": "baylorvision lets you get into games for free and makes the time go by really fast. If you already have experience you can get paid straight away, but sometimes you’ll have to volunteer for a semester before you get paid. Usually the games are on weekends so you don’t really have to sacrifice any study time until midterms/finals.",
            "score": 2,
            "author": "commieman420"
        }
    ]
}