{
    "id": "wn3vj4",
    "score": 9,
    "title": "Moved into UParks yesterday, just noticed a dead roach on the ground (it was there when I moved in, just didn’t look closely enough)",
    "author": "[deleted]",
    "date": 1660360279.0,
    "url": "https://www.reddit.com/r/baylor/comments/wn3vj4",
    "media_urls": [],
    "other_urls": [],
    "postText": "Does baylor have pest control in UParks?? I’m so worried now. Roaches give me panic attacks",
    "comments": [
        {
            "level": 0,
            "comment": "Those apartments go empty for months during the summer. It’s likely the last one you’ll ever see. If it becomes an issue, put in a work order for it. They take pest control very seriously and will fix the issue if there is one. But again I doubt you’ll see another one.",
            "score": 25,
            "author": "dr_greasy_lips",
            "replies": [
                {
                    "level": 1,
                    "comment": "Okay. I looked at it closely and I think it’s just a palmetto bug, it’s small. I’ll say a prayer or two before bed and forget about it 😂",
                    "score": 8,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Most of the roaches around here are big and red/brown. They lay egg pouches that look like bits of injection-molded plastic.\n\nYou don’t have to worry about those roaches though… unlike the smaller black roaches that you often see in urban areas, the red roaches aren’t disease vectors.",
                            "score": 3,
                            "author": "RightBear"
                        },
                        {
                            "level": 2,
                            "comment": "Best of luck! Uparks is pretty clean so I wouldn’t stress too hard.",
                            "score": 2,
                            "author": "dr_greasy_lips",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Okay thanks! I didn’t see any other signs. Could’ve just been a water bug for all I know. I’ll take a chill pill 😅",
                                    "score": 3,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "lol bro it’s texas and an apartment.",
            "score": 12,
            "author": "mattisbear",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I know but still doesn’t make me less nervous lol",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If roaches become an issue buy some boric acid from Home Depot, put the powder down around and under your fridge and stove and anywhere you think roaches are getting in. It kills them after they walk through it and groom themselves and then it kills any other roaches that eat them. It will fix your problem within a week.",
            "score": 6,
            "author": "I_Poop_Sometimes"
        },
        {
            "level": 0,
            "comment": "You’ll see some bugs that’s just life",
            "score": 3,
            "author": "EggSandwich12",
            "replies": [
                {
                    "level": 1,
                    "comment": "Well yeah but I don’t wanna mess with roaches. I’d be scared of bringing them into my car (happened before) or to someone else’s house",
                    "score": -2,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Welcome to Texas lol. Even the nicest student apartment complexes in Waco will have a roach or two every once in a while. On top of that, this summer has been unseasonably hot, even for Texas. Giant heatwaves like that rile of the bugs because they're searching for food and water. I had problems with small roaches here and there in my apartment at the Domain. Called in the exterminator, also sprayed some RAID where I could. Problem seems to have fixed itself, especially with temperatures a tad lower than they were in July, which was like 100+ degrees constantly.",
            "score": 3,
            "author": "politicsofprudence"
        },
        {
            "level": 0,
            "comment": "I live at Park Place and found a live roach in my apartment the other day.  My cat was playing with it.  I think it’s pretty common down in Texas to have roaches here and there.  If I see another one, I’ll put in a work order for pest control.",
            "score": 2,
            "author": "ChanceChallenge9398",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hmm ok 😂",
                    "score": 1,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Call the front desk",
            "score": 1,
            "author": "clen254",
            "replies": [
                {
                    "level": 1,
                    "comment": "They’re closed now but I submitted a work order to come check it out lol",
                    "score": 2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm not sure how often pest control comes out, but letting them know should get then out faster.",
                            "score": 2,
                            "author": "clen254"
                        }
                    ]
                }
            ]
        }
    ]
}