{
    "id": "wqz9zr",
    "score": 20,
    "title": "BGCT considering change in relationship with Baylor",
    "author": "JaracRassen77",
    "date": 1660768224.0,
    "url": "https://www.reddit.com/r/baylor/comments/wqz9zr",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "The Baptist General Convention of Texas is seeking to review and consider changes to the \"special agreement\" that defines their relationship with the University. \n\nCurious that this is coming as the FBI announced their investigation of the Southern Baptist Convention. Some have speculated that Baylor leadership has wanted to make some gradual breaks with the SBC and BGCT. I know that granting the charter to the LGBT group on campus ruffled some feathers. I wonder if this is the start of that break. \n\nWill be interesting to see this develop.",
            "score": 30,
            "author": "JaracRassen77",
            "replies": [
                {
                    "level": 1,
                    "comment": "I am abso-fucking-lutely convinced that the administration wants out of this relationship, but didn’t anticipate the window opening up this soon.\n\nWe all knew the BGCT and their parent org, the SBC would have another big scandal in the 2020s, it’s an org that churns out scandals like clockwork, and that would provide cover for Baylor to make the break. At this point, it would probably be an acceleration of the schedule, but it would make sense due to how the BGCT already broached that topic in 2020 by clarifying that they don’t consider us to be an “affiliated institution”.\n\nI don’t think Baylor pulls the trigger on this now, unless the DOJ investigation into the SBC starts getting getting some nasty press, but I bet they start ramping up that timeline in the anticipation of some results from that investigation around late 2023 through 2024.",
                    "score": 15,
                    "author": "JamesEarlDavyJones2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly the guy I was thinking about when I posted this, lol. Yeah, I definitely think the administration sees this being the first step towards becoming more like TCU and SMU. Which is a bit of a shame, because the Christian Mission is a big part of Baylor's identity. Even if we must break from the BGCT, I hope we don't abandon that mission completely.",
                            "score": 9,
                            "author": "JaracRassen77",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Absolutely agreed. I think a model akin to what Duke and SMU have with the Methodist church is likely what the administration is eyeing; something with a continued relationship that doesn’t include any overt influence or BGCT/SBC hand in Baylor’s governance.",
                                    "score": 7,
                                    "author": "JamesEarlDavyJones2"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What are the benefits of a continued relationship for either party?",
            "score": 9,
            "author": "spyromain",
            "replies": [
                {
                    "level": 1,
                    "comment": "None for Baylor, but the BGCT’s entire significance in the Baptist global polity is built on their affiliation with Baylor. [For decades now, Baylor has been the training place of Baptist leadership both nationwide and globally](https://www.texasmonthly.com/articles/the-war-for-thee-university/amp/), and the BGCT is the Baptist conference that maintains an exclusive governance relationship with Baylor. This quote, from the 1991 article linked above, is gonna sound awfully familiar to anyone familiar with the modern Baptist polity:\n\n&gt;For the past twelve years, two antagonistic, irreconcilable groups of Baptists—popularly known as fundamentalists and moderates—have been at war over theology, politics, and culture. The fundamentalists believe that the Bible contains no errors and want to return to the old-time religion of past generations, while the moderates believe each individual is his own priest and can interpret the Bible for himself. It’s a lot more complicated than that, of course, as is everything about the Baptists, but one thing is clear. Fundamentalists are in power, and they want control of Baylor, the only Baptist treasure that has eluded them. Throughout the Southern Baptist domain, fundamentalists elect the important officials, control the seminaries, write the Sunday school books, and occupy the major pulpits. Baylor is all the moderates have left, and they are determined to keep it.\n\nAnd on Baylor’s importance to the Baptist world:\n\n&gt;Baylor is to Baptists what Notre Dame is to Catholics. Groups of Baptists make regular trips to Baylor’s 428-acre campus, built along the Brazos River, and proudly point to the Pat Neff Hall, Old Main, and Armstrong-Browning Library as sacred shrines. Moderates and fundamentalists can’t agree about what to call each other—they fight over who are the real conservatives—but they all refer to Baylor by the same nicknames: Thee University, Jerusalem on the Brazos, the Baylor Bubble, the Crown Jewel.\n\nThis was immediately in the aftermath of Baylor split with the more fundamentalist SBC, in favor the more moderate BGCT, after the SBC made repeated moves toward increasing their power over Baylor’s on-campus operations. In the decades since, the BGCT has followed a similar path toward fundamentalism and a pattern of encroaching attempts at influencing Baylor’s operations. For all of his many, many faults, Ken Starr did successfully pull Baylor farther from the BGCT’s clutches, and Dr. Linda has continued that trend while walking a narrow line between offending the increasingly fundamentalist Baptist world and the mainstream, largely secular, academic society that Baylor needs to earn respect from.\n\nBaylor gains functionally nothing by a formal relationship with the BGCT, while the BGCT’s gain is immense. As a former academic administrator (at another major institution here in Texas, not at Baylor), I would be very surprised if Baylor’s administration didn’t have their eye on an arrangement more like what Duke and SMU have with the Methodist church, where they’re still related, but the church has no influence or explicit hand in the schools’ governance structures.",
                    "score": 13,
                    "author": "JamesEarlDavyJones2"
                },
                {
                    "level": 1,
                    "comment": "None. \n\nThe BGCT has a pretty clear anti-LGBTQ+ stance and Baylor chartering an official LGBTQ+ organization was a step too far for them. \n\nFor Baylor recovering the autonomy of 25% of their board is substantially more beneficial than the 2 million in funding they receive by the BGCT.",
                    "score": 27,
                    "author": "TheMightyJD",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's been a long time coming too it seems.",
                            "score": 11,
                            "author": "Dr_Smoothrod_PhD"
                        },
                        {
                            "level": 2,
                            "comment": "What more autonomy would you be hoping for, beyond student groups?\n\nI came to Baylor over other schools because of the Baptist affiliation. I hope there can be some amount of status quo preserved.",
                            "score": -6,
                            "author": "RightBear",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;I hope there can be some amount of status quo preserved. \n\nIt's not like this is going to make Baylor deny Christianity... It's hopefully going to separate Baylor from militant fundamentalists. Anything that keeps us from becoming like Liberty is a good thing.",
                                    "score": 19,
                                    "author": "FriskyHippoSlayer",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Amen.\n\nThe BGCT's increasingly belligerent stance on LGBTQIA+ inclusion has only damaged real human lives on both sides of the equation. Regardless of your stance on LGBTQIA+ folks, we worship a savior who welcomed all people to the table. A Christian university ought to as well, and arguments to the contrary prioritize a particular set of politics over our faith.",
                                            "score": 6,
                                            "author": "wiseoldllamaman2",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; increasingly belligerent stance\n\nIn other news, a boat drifting northward reports that the shoreline seems to be drifting southward.",
                                                    "score": 2,
                                                    "author": "RightBear",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "There was once a time when being a Baptist meant following one's own conscience.",
                                                            "score": 3,
                                                            "author": "wiseoldllamaman2"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I think it’s pretty clear that Baylor has to maintain its Christian mission while also not discriminate against LGBTQ+ faculty and students plus increasing diversity. \n\nThat seems to be a dealbreaker for the BGCT.",
                                    "score": 12,
                                    "author": "TheMightyJD",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Diversity in everything but purpose and thought it would seem.\n\nBaylor has one mission. Pro Ecclesia. Pro Texana. How are we to maintain the faith of the institution and espouse the fundamental and core values it has long stood for while simultaneously making decisions that put it at odds with both itself and its religious peers?\n\nYou can have the entire world filled with secular “formerly affiliated” universities. Baylor was supposed to be different and special. Without that mission, Baylor is nothing, has nothing, and will be nothing.",
                                            "score": 6,
                                            "author": "metzoforte1"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt; has to maintain its Christian mission\n\nThat’s the part that concerns me, because dang-near 100% of Christian colleges that de-affiliate migrate farther and farther from any semblance of a Christian campus environment.\n\nI’d hope for some preservation of affiliation, even if BGCT withdraws their $2m over LGBT inclusion.",
                                            "score": 6,
                                            "author": "RightBear",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Baylor has already split from a Baptist organization to re-affiliate with another one time; I’d be happy to see Baylor disaffiliate from the BGCT in favor of something like the [Alliance of Baptists](https://en.m.wikipedia.org/wiki/Alliance_of_Baptists), which is another SBC splinter group that has stayed true to their more moderate foundations than the BGCT has.\n\nBaylor’s problem is that the global academic landscape is trending in a bad way for Baylor’s mode of operation. Baylor was historically *very* focused on undergraduate pedagogical excellence, and passed on the opportunity to build a major research wing in the post-WWII university research funding boom. Nowadays, universities cover a substantial portion of their costs with the standard administrative cut from grants earned by faculty, and schools without major research wings are left to attempt to make up the difference on their increasing operational costs by increasing tuition and soliciting donations. As a former higher ed administrator myself, that donor pool isn’t bottomless, and the relationship between tuition cost and enrollment is an inverted parabola. There’s a maximum tuition ar any point in time that can be charged before you start losing students and your net revenue decreases.\n\nBaylor *needs* to be viable in the modern research space. Having worked very closely with TCU’s IR people during my time with UNT, I can promise you that their lack of a research wing is *tremendously* concerning to the institutional leadership. That’s why they just bought UNTHSC out of the UNT-TCU joint medical school, they want to fire up a clinical research wing and all of the boku research grant bucks that come with clinical research activity. If TCU can’t get that research activity wing up to a point that it’s helping to mitigate their operational costs within the decade, it’s hardly excessive to say that the university’s going to be at least approaching insolvent by 2040. Baylor, on the other hand, has made considerably more headway than TCU in developing a research wing that generates adequate revenues and helps build the institutional reputation, which itself attracts more students.\n\nWe’re at the point now where Baylor’s close ties to a socially regressive organization are making Baylor’s forward progress as a research institution increasingly difficult, and they’re a turnoff to the vast majority of researchers of the caliber that Baylor both wants and needs to attract to continue this progress.\n\nI’s be surprised if Baylor’s administration weren’t eying a relationship like what the Methodist Church has with Duke and SMU: an association that doesn’t include any hand in university operations or governance beyond the church’s approval in the school’s seminary.\n\nEdit: Got the long end of the autocorrect stick. Whoops.",
                                                    "score": 10,
                                                    "author": "JamesEarlDavyJones2",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You've gotta stop making me give you golds, sir.",
                                                            "score": 2,
                                                            "author": "JaracRassen77",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Aw, man, don’t do that! I appreciate it, but go buy yourself a Reese’s or something!",
                                                                    "score": 2,
                                                                    "author": "JamesEarlDavyJones2"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Wow. Thanks for this write-up.",
                                                            "score": 1,
                                                            "author": "spyromain"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "I have to think most of these formerly Christian universities de-affiliated with the intention of becoming secular while Baylor does not have that intention (I think everyone in the Baylor community recognizes the importance and uniqueness of Baylor’s Christian Mission). \n\nHowever this is also a case where remaining affiliated with the BGCT will continue to create problems. I don’t think Baylor wants to be investigated by the FBI for discrimination against LGBTQ+ people like it is rn. This is a case where if Baylor was affiliated with a more “progressive” church like the Disciples of Christ they wouldn’t have to do this. \n\nI understand it is part of the history of the university and at times it has been beneficial for the university but I fail to see how they reach a common ground when both parties would benefit from splitting. I also have been wanting this de-affiliation to happen.",
                                                    "score": 4,
                                                    "author": "TheMightyJD",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah, to be clear: my ideal scenario would involve the implementation of basic non-negotiable non-discrimination policies (including allowing non-Baptist student groups), but would keep BGCT representation on the board to add input on other aspects of university life.\n\n*ETA*: I’m not as optimistic as you that Baylor would keep its “Distinctive Christian Mission” for more than about 10 years. I’ve become convinced that people tend to underestimate (not overestimate) the slipperiness of slopes.",
                                                            "score": 3,
                                                            "author": "RightBear"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "BGCT: CHINO … Christian in name only.",
            "score": 2,
            "author": "WCBrann",
            "replies": [
                {
                    "level": 1,
                    "comment": "Would you look at that, all of the words in your comment are in alphabetical order.\n\nI have checked 981,575,776 comments, and only 195,851 of them were in alphabetical order.",
                    "score": 4,
                    "author": "alphabet_order_bot",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Good bot",
                            "score": 3,
                            "author": "Greatmooze",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Thank you, Greatmooze, for voting on alphabet_order_bot.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)",
                                    "score": 2,
                                    "author": "B0tRank"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "So when do we expect a big donation from the LGBT folks? I mean, I've got no problem with them starting a group, but I figure they'll demand political representation next, seats on the board, etc.",
            "score": 1,
            "author": "ElCidTx",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think we’re gonna need to get a little bit less harsh on LGBT rights before any members of the community start donating to Baylor. The university still maintains an official position that’s overtly contrarian to any non-heterosexual marriage possibilities.\n\nWhy do you think the LGBT community at Baylor will be demanding seats on the board? There’s been no indication of goals like that.\n\nRecognizing that LGBT student group was the bare minimum to start with, and that bar was so low it was a tripping hazard.",
                    "score": 15,
                    "author": "JamesEarlDavyJones2",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We both know there have been gay/lesbian people at baylor for a long time.  I'm ok with that, I'm ok with them starting an organization where they can socialize freely.  What I'm not ok with is giving political power or recognition to people or groups for things that are simply...innate.    So it's all a matter of how this is handled.",
                            "score": 1,
                            "author": "ElCidTx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I agree with you on every single step of that, and the thing is that *nobody’s* indicating any desire for the situation that you’re against. It’s just a scarecrow.",
                                    "score": 5,
                                    "author": "JamesEarlDavyJones2",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "For now.  But remember we are moving and removing statues to appease people who offer us nothing in return but threats and promises of appeasement.   When does it end?",
                                            "score": 1,
                                            "author": "ElCidTx",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I mean, I’m content to see most of those statues removed just for the sake of not continuing to pretend that degenerates were historically contributive. That said, people are complex and their historical regard is best judged individually rather than being lumped into the aggregate, so that’s probably addressed on a state-by-statue basis. Is a particular statue on your mind?\n\nYour false dichotomy here really fell apart when you conflated something with widespread public support and no practical effect on continuing operations, like removing statues of Confederates and the like, with the hypothetical of a small group demanding an oversized hand in operational governance just based on their identity.\n\nAlso, do you really think that the ongoing removal of statues across the country is driven by threats, rather than a practical re-evaluation of those statues’ subjects’ place in history? If so, then I’m not sure we’re going to be able to come to an understanding, because we fundamentally see this situation differently.",
                                                    "score": 4,
                                                    "author": "JamesEarlDavyJones2",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Fascinating response.  I don't remember being asked whether I wanted a group on campus or whether I thought a statue should be kept or torn down.  In fact, I don't any alumni from my era that was asked at all.\n\nif you think  history is 'practical re evaluation of statues subjects place in history' and that you and  you alone are entitled to make that decision, well, you didn't learn anything about history.  And you certainly didn't learn anything about the Cold War, communism or Fascism, because you're engaging in the same behavior that the Russians used against their subjects .\n\nHistory isn't there to make you feel good.\n\nYou may not LIKE the Burleson statue but that doesn't mean we give power to a Marxist group to tear it down.\n\nGet that through your head.",
                                                            "score": 2,
                                                            "author": "ElCidTx",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt;Your false dichotomy here really fell apart when you conflated something with widespread public support and no practical effect on continuing operations, like removing statues of Confederates and the like, with the hypothetical of a small group demanding an oversized hand in operational governance just based on their identity.\n\n&amp;#x200B;\n\nAnd please elaborate here.  i'm giving courtesy and respect to people who built the institution.  Right or wrong, they sacrificed years of commitment, money and resources to build a university and they did so against forces that would have gladly torn it down.\n\n  Your only cause is some whining children that think their feelings entitle them to power. \n\nI find it unconvincing.",
                                                                    "score": 2,
                                                                    "author": "ElCidTx"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Hello VP for Gamma Alpha Upsilon here, the unofficial LGBT group at Baylor. As of right now we don't have any plans on trying to petition for LGBT individuals to be on the board or any other positions of power in administration, although such a prospect in the future sounds amazing. Right now we are prioritizing queer students on campus and helping the new group PRISM in it's first full semester as a campus org.",
                                    "score": 9,
                                    "author": "NotAlexGonzalez"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I’d love for Baylor to stray away from the “Christian university” label. It’s so diverse and the university isn’t very Christian anymore. More and more non-Christians are coming here!",
            "score": -11,
            "author": "Acw_1213",
            "replies": [
                {
                    "level": 1,
                    "comment": "While Baylor does welcome students of all religions, the institution is most definitely Christian and will remain that way long term. All faculty and staff must be Christian to work there and it’s a huge part of the brand identity.",
                    "score": 4,
                    "author": "drakewouldloveme",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yeah I just think it’s unnecessary. I came here for academics and their scholarships, not because of the religion",
                            "score": 2,
                            "author": "Acw_1213"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "So you basically want Baylor to stop being... Baylor? Baylor is defined by its Christian (particularly Baptist) identity. If it loses that... what separates it from any other private university? A lot of people go there *because* of its strong, unapologetic Christian identity. You don't hear Notre Dame getting much flak for its strong Catholic identity.\n\nYou were an athlete. Your experience/reasoning for coming here will be different from the average student who chooses to go there.\n\nEdit: misread academics as athletics. Been a long week.",
                    "score": 1,
                    "author": "JaracRassen77",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’m not an athlete? I said I came here for the academics and the scholarships they gave me. I just think that the school itself has already strayed away from the Christian faith it was founded on. I thought I would be pushed closer towards being a Christian, but the interactions I’ve had over the past year have kind of pushed me farther away. I’ve met some really good friends who are Christian so I’d like to give it another shot, but I just don’t think the school as a whole truly embodies its Christian upbringing.",
                            "score": 2,
                            "author": "Acw_1213",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And honestly, my point was proven with the number of downvotes on this comment. Can’t even have a different opinion on campus or you’re ostracized…",
                                    "score": 2,
                                    "author": "Acw_1213",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "First: I misread academics for athletics. My bad. \n\nSecond: You're likely getting downvoted because you support an extreme position: Baylor chucking its Christian identity out the window altogether. There is another heavily downvoted comment in this thread who supports the opposite approach you do: no compromises with the \"leftists\". \n\nI think most want to keep Baylor's Christian identity (which is what defined it - \"Pro Ecclesia, Pro Texana\"), but to become more tolerant - more moderate. It's why most want a break from the increasingly fundamentalist BGCT.",
                                            "score": 3,
                                            "author": "JaracRassen77",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah that’s pretty much what I meant lol. I’m just overly passionate about this issue because I thought I would be able to devote myself to religion in the past year, but had a horrible experience in Christian Heritage, so now I am very frustrated with the religion department here.",
                                                    "score": 5,
                                                    "author": "Acw_1213",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm sorry you've experienced that. Christian Heritage can be very hit it miss depending on who you have as a professor. Ours was basically like a History Class, so I loved it. But not everyone will.",
                                                            "score": 1,
                                                            "author": "JaracRassen77",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah. I made the mistake of taking an honors section. We had to discuss everyday in a seminar format. I was very open about my views and anxieties about the course. My teacher clearly treated me differently because of it (long story, but the 13 other students all grew up in Christian schools, I didn’t) and the head of the religion department was never willing to help with some of my issues. That’s why I kind of feel that Baylor’s “Christian identity” just isn’t there anymore",
                                                                    "score": 1,
                                                                    "author": "Acw_1213"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -9,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Baylor is not renouncing Christianity...",
                    "score": 5,
                    "author": "FriskyHippoSlayer",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Give it time. Lol this school turning its back on its bread and butter is a mistake.",
                            "score": 0,
                            "author": "Advanced_Ratio_6555"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Proud Baylor Bear and also a proud supporter of worker rights. There’s plenty like me at Baylor, they’ve graduated from there, they educate there, they attend there. \n\nIndeed I got to those positions through the same religion that fundamentalists want to take to a very dark place. Christianity has a long history, and there has always been incredible diversity in the church. It will continue to be so, regardless of how leaders want to define what a “Christian” is. \n\nBaylor was the first community of Christians I found where there was that incredible diversity. I spoke with Baptists, Catholics, Anglicans, Eastern Orthodox, and Eastern Rite Catholics during my time at Baylor. \n\nIt is not that Baylor ought to lose its Christian identity, which I think is harder to lose than you think, but in what ways WILL Baylor be Christian? \n\nAfter Baylor’s scandals, a reckoning with our past will only empower our university to take serious its obligation as a Christian institution.",
                    "score": 1,
                    "author": "PoetOfTheScythe"
                }
            ]
        }
    ]
}