{
    "id": "xkp9sp",
    "score": 26,
    "title": "Governor candidate Beto O’Rourke to host student rally on campus (Wed. Sept. 28th). RSVP here",
    "author": "audiomuse1",
    "date": 1663815021.0,
    "url": "https://www.reddit.com/r/baylor/comments/xkp9sp",
    "media_urls": [],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "This is great...but what is the current political vibe on campus?  Is it still fairly conservative?",
            "score": 12,
            "author": "hulashakes",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I’d definitely say it’s 50/50, especially among younger groups at Baylor",
                    "score": 12,
                    "author": "Acw_1213"
                },
                {
                    "level": 1,
                    "comment": "Baylor students are a lot more liberal-minded than in the past.. especially on social issues.  A LOT more Democratic students than you’d think at Baylor too\n\nhttps://baylor.campuslabs.com/engage/organization/collegedemocratsofbaylor",
                    "score": 9,
                    "author": "audiomuse1"
                },
                {
                    "level": 1,
                    "comment": "Still conservative at least more vocally. But there’s a good amount of liberal students as well. I’d say it varies by major",
                    "score": 3,
                    "author": "EggSandwich12"
                },
                {
                    "level": 1,
                    "comment": "I’d say BU kids are more Libertarian than conservatives. The liberals are still a minority",
                    "score": 1,
                    "author": "Publius_Enigma7796",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Former YAL founding member here. It's easy to say but definitely not true.",
                            "score": -1,
                            "author": "DannyBenavidez"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 15,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "yeah I remember going to that too when he first ran, hopefully my man gets some A/C this time around",
                    "score": 4,
                    "author": "RedSoxfanrrb07"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I appreciate how he’s really going everywhere in the state",
            "score": 6,
            "author": "dandier-chart"
        },
        {
            "level": 0,
            "comment": "His Beers with Beto events always amuse me. Drive drunk, hit another car, run, get arrested for 2nd time in your life, have Judge father help out, have alcohol themed meet ups a few years later.. SMH",
            "score": 4,
            "author": "BaylorJedi"
        },
        {
            "level": 0,
            "comment": "\"On campus\" is a bit of a stretch.  Freight is close but not on campus.",
            "score": 3,
            "author": "TXWayne"
        },
        {
            "level": 0,
            "comment": "This just in, entitled, married-rich, white boy arrives on campus. Film at eleven.",
            "score": 2,
            "author": "jcrue",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, we're all aware Baylor has fraternities...\n\nBut, it is actually a good thing he's going. Baylor is a conservative school. If he wants to lead Texas, he has to do more than talk to progressives and liberals. He must also talk to, listen to, and lead conservatives... You know, the normal kind. Not the \"hates women, gays, and POCs, coup de'tempt, Jesus was American\" crazy sect. They can fuck right off.",
                    "score": 8,
                    "author": "DemSumBigAssRidges",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "so simple minded is what passes here today? beto's a f'ing cowardly fraud. like Kerry, he'd be nothing without his wife's money....\n\nI could be wrong, please post his CV or resume. \n\nConvince me Beto isn't anything more than....",
                            "score": -2,
                            "author": "jcrue",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No.",
                                    "score": 4,
                                    "author": "DemSumBigAssRidges"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Man the time is horrible! I have a lab from 2:30-3:45. Wish it was later in the evening so more could attend",
            "score": 2,
            "author": "Acw_1213"
        },
        {
            "level": 0,
            "comment": "🤣😭 trash",
            "score": 0,
            "author": "Publius_Enigma7796"
        }
    ]
}