{
    "id": "1075tty",
    "score": 68649,
    "title": "US Farmers win right to repair John Deere equipment",
    "author": "For_All_Humanity",
    "date": 1673242160.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/1075tty",
    "media_urls": [
        "https://www.bbc.com/news/business-64206913"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "I'll believe it when we see it. They just gutted the bill in New  York.  Allowing the oem to sell full assemblies not the broken part and writing an apple sized loop hole by labeling anything \"safety\"",
            "score": 2635,
            "author": "CmdrSelfEvident",
            "replies": [
                {
                    "level": 1,
                    "comment": "Also, what about the OEM parts price? IE If you buy only the engine of something like a 2013 motorcycle at OEM, it costs the same as the whole bike.",
                    "score": 465,
                    "author": "evillman",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Price wasn't an issue when it was about original parts. The real issue was companies like Apple e forced suppliers into exclusive contacts. So a supplier couldn't sell the $25 replacement screen. The New York law was just about breaking that exclusive contracts so suppliers could sell to anyone. The trade group gutted the law by allowing them to sell assemblies not the parts. So now the repair shop needs to buy the $300 assembly not the $25 dollar part. Thus making the repair useless as at that point it's better just to replace the device.",
                            "score": 313,
                            "author": "CmdrSelfEvident",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In the John Deere case, it was about timing. Cost as well, but especially timing. When equipment breaks down, it usually happens in a field far from anything. The repair has to come to the equipment, not the other way around. If the farmer could just fix it himself, the equipment can be back up and running shortly - minutes or hours. If the farmer can’t, they have to wait for a repairman to come out. During planting and harvest season, the repairmen can’t be everywhere all the time, so you wind up with wait times.\n\nWhen you’ve got 2-3 weeks of running around the clock to get crops in or out, “I’ll pencil you in for next Friday, say…between 8 am and 5 pm” just won’t work. They literally can’t afford the downtime.",
                                    "score": 298,
                                    "author": "Nwcray",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "This is all very true. I would add that it costs farmers thousands of dollars to move their equipment to a dealership so even when they can move it, it’s extremely time consuming and expensive. It all depends on how big the repair needs to be.",
                                            "score": 45,
                                            "author": "can_of-soup"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Your tiny chip got burnt? Here have a whole motherboard that is 80% of the computer's price.",
                    "score": 67,
                    "author": "Joseluki",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I want the deal you're getting on GPUs lol",
                            "score": 10,
                            "author": "onlypositivity",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I mean, we don't know that yet. Could end up being a big win for techs, because if a bunch of places haphazardly label all their shit as \"unsafe to repair\" it could end up with techs getting a bump in pay for working under hazardous conditions if they play their cards right.\n\nThis is in no way I'm defence of the bill. It sucks ass. They screwed it over big time. I would love to see laborers and unions find a way to use their shitty loophole against them though. It would at least be *some* redemption.",
                    "score": 85,
                    "author": "Guffawker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;\tif they play their cards right.\n\nThe house is dealing the cards. If you win too many hands they kick you out of the casino.",
                            "score": 82,
                            "author": "toopid",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Fuck casinos. I got kicked out of my local casino twice for winning too many hands of blackjack\n\nWell that's fine, I just convinced the majority of people at the old folks home I drive the bus for that it might be more fun to go to the theater and then bingo every week rather than going to play slots or blackjack at the casino, so that's like 60 people a week worth of income I'm depriving the casino of. Makes me feel better about it it's a good couple grand a week",
                                    "score": 16,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You're a solid person.",
                                            "score": 3,
                                            "author": "fuzzyraven"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I got a bridge to sell you if you think that money is going to trickle down. Only helps one party, and it ain't the little guy",
                            "score": 77,
                            "author": "LeBobert",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't....that's why I said it was a shit bill. I just would like to see it happen. It won't. But it sure would be nice to see it.",
                                    "score": 13,
                                    "author": "Guffawker"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "We do know that, because some of us have been on this rock for a few decades...",
                            "score": 10,
                            "author": "redditsdeadcanary"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is huge. As a precedent as well.",
            "score": 2316,
            "author": "drquaithe",
            "replies": [
                {
                    "level": 1,
                    "comment": "Let's keep corporations from dictating ownership",
                    "score": 886,
                    "author": "PandaCasserole",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; \"Tractor maker John Deere has agreed to give its US customers the right to fix their own equipment.\"\n\nI've rarely heard a more disgusting sentence.\n\nThe right to repair should be an enforced fact in the law, dictated from the people, to the government, who dictate it back to the corporations and the public.\n\n**John Deere shouldn't be in a position to \"agree\" to this.**\n\n**John Deere should be in a position where them disagreeing with it has no legal ramification, because they should have no power to affect it.**\n\nThey should be clearly and obviously and unequivocally stripped of the legal power to disallow or punish repair in any way.",
                            "score": 719,
                            "author": "Comment104",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I whole heartedly agree. On top of that is say that 'agree ' is a very mild word. It's more like 'ran out of ways to block this, had to finally cave and very reluctantly accept'.",
                                    "score": 156,
                                    "author": "ObfuscatedAnswers",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You whole heartedly ran out of ways to block this, had to finally cave and very reluctantly accept?",
                                            "score": 10,
                                            "author": "KKlear",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Hah! I guess I should read what I write en extra time. Have an upvote.",
                                                    "score": 11,
                                                    "author": "ObfuscatedAnswers",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Username checks",
                                                            "score": 3,
                                                            "author": "PlacentaOnOnionGravy"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "John Deere did something tricky a while ago. If you buy a John Deere tractor you’re not actually buying the tractor, you’re buying a lifetime implied lease. So they claim that because JD “owns” the equipment they get to dictate who repairs it.\n\nAlso, the JD and CAT business model isn’t about selling equipment anymore. All the money is in the service and replacement parts.",
                                    "score": 19,
                                    "author": "Sometimes_Stutters",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;\tI’ve rarely heard a more disgusting sentence.\n\nI agree. It’s everything that’s wrong with this country. As if we peasants are merely lucky slaves to tolerant masters (corporations). Sickening to even think like this.",
                                    "score": 16,
                                    "author": "yoyoJ"
                                },
                                {
                                    "level": 3,
                                    "comment": "They dont have any legal power to disallow anything. I feel like you don't understand how they \"disallow\" it to begin with and confuse it with something else.\n\nIn a nutshell. Repairs require you to connect your equipment to a computer with special software. This is generally true for all motor vehicles in traffic as well.\n\nFarm equipment can be very complicated, especially modern tractors. \n\nThe way John Deere has \"disallowed\" it is by gatekeeping this software. Only their own mechanics are supposed to have access to it. Farmers have got their hands on pirated, cracked versions. But John deere keeps making it more and more difficult. \n\nThing is. This is something pretty much every single car manufacturer does as well. It's not just John Deere. The reason this gets headlines though, Is because farmers are used to being able to repair their own stuff. They don't have the time to take it to an offsite mechanic every time something goes wrong. \n\nHopefully, this can be used to fight other manufacturers that also gatekeep software used to repair products, including phone manufacturers.",
                                    "score": 48,
                                    "author": "AnakinSkydiver",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "John Deere should have as many rights to protect their software from copying as Apple should have had to protect their special anti-repair screwdriver bits from copying. None.\n\nIt's a repair tool. It's bad enough it's not already part of the package when you buy a vehicle with software. A copy of it should be just as legal as printing a copy of the cupholder as a replacement. Or making a flathead yourself. Or scanning a physical manual to keep a digital copy.\n\nWe gain nothing from letting them control this new generation of tools. We only lose.",
                                            "score": 37,
                                            "author": "Comment104",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My brother is a JD tech. He tells me some of their equipment has a microchip in the headlight bulb. They need to plug plug the equipment in to this software to get the replacement bulbs to work.\n\nHow much extra engineering did it take to add this money making feature to a headlight bulb.",
                                                    "score": 11,
                                                    "author": "Diesel_Bash",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Jesus so you literally cannot change a lightbulb without JD being involved. That’s absolutely bananas.",
                                                            "score": 6,
                                                            "author": "juicyfizz"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Engineering and technology is no longer used to innovate the end user experience. It's just being used as another form of toxic capitalism.",
                                                            "score": 7,
                                                            "author": "[deleted]"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "There's also the case for car manufacturers limiting access of diagnostic software from smaller mechanics, forcing you to have to go to the manufacturers mechanic instead of Kev down the road who does it for a bit cheaper",
                                            "score": 13,
                                            "author": "monsteramyc"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Car manufacturers don't do it. That's literally why we have an OBDII standard.",
                                            "score": 3,
                                            "author": "YodelingTortoise",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They do still do it, OBD2 will report check engine codes, the proprietary software the manufacturers make (look up VAG-COM for Volkswagen, that's the 'pirated' version) gives you a literal fuck load of details and data that a mechanic can use to actually troubleshoot actively, test the actual readings various sensors are reporting, and is an invaluable tool when fixing a car.",
                                                    "score": 4,
                                                    "author": "enolja",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "this movement's natural conclusion is when corporations can no longer own most things. workers should be owners of their company and the intellectual property they create there. \n\nI'm sick of doing all the work and watching the owner drive up in a new Porsche after his fourth vacation overseas this year.",
                                    "score": 31,
                                    "author": "Wow00woW",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;  workers should be owners of their company and the intellectual property they create there.\n\n... This is literally irrelevant to the right to repair. If the 'workers' of the company owned the IP, they could *still claim you can't repair the items*. That's not a 'natural conclusion' at all.",
                                            "score": 34,
                                            "author": "Z0MBIE2"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I mean it's cool you're a socialist, but don't push people away with these kind of statements.\n\nNatural conclusion to right to repair isn't about corporate, it's about the customer and his relationship with the product creator - \"what is the customer really buying\"\n\nThe line between \"product\" and \"service\" was blurred on purpose and to the benefit of John Deere.\n\n\nWhen you buy a product, you should legally be it's owner, the whole \"you buy our Tractor but you don't REALLY own it, you can't do your own upgrades, modifications or repairs\" is insanity, and the slow descent down that path should've been stopped years ago.\n\nLooking at you Tesla with your stupid \"upgrade the car to more power even though the motor is already there\" and BMWs \"pay to unlock heating seats\" bullshit",
                                            "score": 22,
                                            "author": "MTBDEM",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I completely agree with you, but this is such a Reddit comment. \n\n*A good thing happens*\n\nCommenter: \"this is great!\"\n\nCommenter 2: \"well akshually this is a hair that fell out the asscrack of the bare minimum\"\n\nYou're right of course, but can we please be happy about a good thing, even if it is a tiny step in the right direction?",
                                    "score": 2,
                                    "author": "Ketjapanus_2"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "As I just saw a post earlier today/yesterday that said how car companies are selling subscription services now to things that used to come standard. We gotta continue to tell the corporations to fuck off and vote with our dollar",
                            "score": 202,
                            "author": "puddyspud",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Zero motorcycles had a setup where the bikes would have the 'option' to unlock better range and faster charging if you paid them a fee. You didn't need to bring your bike in, it just would update the software. Turns out that this meant that every bike was hauling around an extra battery and charging equipment that they just remotely disabled until you paid up. \n\nSo you'd buy the thing but then be told you can't use the thing you bought unless you pay more fees. \n\nJust insane.",
                                    "score": 41,
                                    "author": "Wind_Yer_Neck_In",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "We need to tell billionaires to fuck off with our guillotines",
                                    "score": 116,
                                    "author": "Fooberdoober97420",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The thing is, I don't think any billionaires were part of that decision. Companies make anti-social decisions even though they are usually run by plain old millionaires. It's the way capitalism works that is the problem. It's the way the profit incentive corrupts.",
                                            "score": 33,
                                            "author": "heuristic_al",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; The thing is, I don't think any billionaires were part of that decision.\n\nTesla was one of the first companies to introduce subscription models. Porsche was the other company. So yes, a billionaire was the driving force behind this.",
                                                    "score": 34,
                                                    "author": "Lutscher_22",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "We still need them gone. A billionaire, even a well meaning one, is simply too powerful to be permitted to exist. \n\nThere is a precedent: the Fugger bank was dissolved by the Emperor Charles V, because they had become too powerful and were funding wars of succession.",
                                                    "score": 13,
                                                    "author": "widdrjb"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Subscription-based services are some of the highest profit generators for a company. Any company. Flip a switch and get $100 a month. Any publicly traded company is focused on increasing their services - those that do it well are rewarded with higher stock multiples. Disney, for example, is trying to increase revenue from streaming services. Tesla want you to pay $8000 to “activate” autonomous driving in your car. Amazon makes most of its profits from AWS and very little from the merchandise operations. So expect services to be incorporated into as many things as possible in the future, including heated seats.",
                                    "score": 12,
                                    "author": "firasrabi",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I read BMW in Korea was doing a subscription service for heated seats.",
                                    "score": 3,
                                    "author": "Busch0404"
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah I remember reading a post about a guy paying 15 bucks a month to turn on his car from his phone. Absolutely ducking ridiculous",
                                    "score": 2,
                                    "author": "Arra13375"
                                },
                                {
                                    "level": 3,
                                    "comment": "Problem is average people don’t seem to care much.",
                                    "score": 2,
                                    "author": "queenringlets",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I'm thanking Cory Doctorow for telling me to care about this for years.\n\nFuck yeah, fight for your rights, people!",
                    "score": 68,
                    "author": "spiralmojo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Highly recommend anyone interested in this stuff read [Unauthorized Bread](https://arstechnica.com/gaming/2020/01/unauthorized-bread-a-near-future-tale-of-refugees-and-sinister-iot-appliances/). It's free, short enough to read in one sitting, and will definitely get you thinking about the ways technology can control us when misused.",
                            "score": 2,
                            "author": "ryecurious",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I can’t believe this comment didn’t have a single upvote. Unauthorized Bread is a must-read.",
                                    "score": 2,
                                    "author": "SophiaofPrussia",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I am actually impressed that this happened in the US. This is usually something you read from EU.\n\nAlso, it pisses me off how insincere companies are when they defend their position for this stuff. I.e. \"we want to repair the equipment we made since we have the proper tools and knowhow to prevent additional damages and breach of warranty, which would be bad for the customer\" as if it is somehow in the customer's best interest and that they are helping.\n\nIf this was true, they would offer to repair it for free, not do everything in their power to block customers to repair their own equipment and to force them to pay premium at a \"licensed\" or \"approved\" service. \n\nSuch a bullshit argument if I've ever heard one. This is the shit we've heard from Apple for years and years and one of the reasons I stay far, far away from their products.",
                    "score": 54,
                    "author": "mekwall",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; This is usually something you read from EU.\n\nAren't the subscriptions for heated seats and auto dim headlights coming from the EU? Sure, it's not the same thing, but yet it's similar.",
                            "score": 5,
                            "author": "gt_ap",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Precedent? Isn't that the thing we're supposed to adhere to unless it's inconvenient to our cause?\n\nReally though, hope this snowballs.",
                    "score": 18,
                    "author": "Hobomanchild"
                },
                {
                    "level": 1,
                    "comment": "No precedent was set, a Memorandum of understanding is not a court settled thing.",
                    "score": 6,
                    "author": "EightB1ts"
                },
                {
                    "level": 1,
                    "comment": "What precedent. Supreme Court doesn't do precedent anymore.",
                    "score": 6,
                    "author": "calmwhiteguy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They do, but it's more like a choose your own adventure precedent vs cataloged historical reference",
                            "score": 2,
                            "author": "DemonVice",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Almost as huge as the previous precedent\n\nHe did have tiny hands tho",
                    "score": 20,
                    "author": "AwpticBarney",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Everyone is saying, \"they're the tiniest\", all the best people",
                            "score": 4,
                            "author": "OkSmoke9195"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "About damn time.",
            "score": 1088,
            "author": "KinseysMythicalZero",
            "replies": [
                {
                    "level": 1,
                    "comment": "In a minute\nIma need a\nSentimental\nTractor mechanic\nTo pump me up",
                    "score": 330,
                    "author": "Bluestripedshirt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Feelin’ fussy, sitting my John Deerussy",
                            "score": 33,
                            "author": "G0shdarn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Trying my best to fix. It. Up.",
                                    "score": 14,
                                    "author": "pancakemonkey21"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Weeds tilled up, seeds put down, ooooooh growin crops right now",
                            "score": 9,
                            "author": "RenaissanceBear"
                        },
                        {
                            "level": 2,
                            "comment": "Fix my truck*",
                            "score": 59,
                            "author": "ScallionJealous",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They saw the writing on the wall and conceded very quickly once the State of New York passed their Right to Repair law concerning Apple products.\n\nJohn Deere has been fighting this for ages. They gave in quickly once it went into law in New York, because they knew it would set a precedent and they'd be better off setting their own repair guidelines than having to follow a court order which could force them to surrender certain software and other products they want to retain control of.\n\nThis allows the consumer to fix Deere products to a certain extent while Deere can still retain involvement in the process. If you install a new part, you're required to enter the part identification number and serial number into the software to allow the machine to continue functioning.\n\nThey'll likely come up with a part specific and expensive software patch with the purchased parts, whereas the courts could have forced them to release the software for the entire machine as a consumer service to owners.",
                    "score": 115,
                    "author": "they_are_out_there",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Right to repair law was gutted in New York though, basically changed nothing and all it showed companies is that lobbying the shit out of government still works.   \n\n\nThey state that it is for \"safety\" that they can only sell full assemblies for repairs. An example is say you only need to repair a cable that goes to the phone screen, that cable normally would cost $20 from the manufacturer but as they can only sell the full assembly then the repair shop must buy an entire screen assembly totaling $200.",
                            "score": 13,
                            "author": "Turse1"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; State of New York passed their Right to Repair law\n\nIt's gimped https://www.youtube.com/watch?v=k9kXnm9uW5k",
                            "score": 32,
                            "author": "Dodara87"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "if it plays out like apple's program (which the article references) it's not going to a very good program.  hopefully it's the real deal.",
                    "score": 10,
                    "author": "iamintheforest"
                },
                {
                    "level": 1,
                    "comment": "Apple when?",
                    "score": 2,
                    "author": "Dave10301"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I wish this was settled in the courts and a precedent was set",
            "score": 828,
            "author": "bbcomment",
            "replies": [
                {
                    "level": 1,
                    "comment": "In US courts? Right now, with the current attitude higher courts have taken towards corporate rights over the past decade or two?",
                    "score": 391,
                    "author": "jwill602",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Some say it was 1976 when it became evident that banks run the country as opposed to the government: https://www.nytimes.com/1977/02/18/archives/us-banks-raised-foreign-lending-to-a-record-206-billion-for-1976-us.html",
                            "score": 139,
                            "author": "r_Yellow01",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not in 1954 when the CIA overthrew a government for a banana company?",
                                    "score": 80,
                                    "author": "windy906",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Capitalism 🌈✨",
                                            "score": 19,
                                            "author": "Shaved_Wookie",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt;over the past decade or two?\n\nlol",
                            "score": 28,
                            "author": "Wow00woW",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same as it ever was",
                                    "score": 9,
                                    "author": "TerribleNameAmirite"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Especially with how well our current admin (usa) is working with corporations to promote themselves and ban dissent. Our government represents corporations, not us.",
                            "score": 36,
                            "author": "Razzlecake",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Totally. Definitely not the previous admin giving corporations $2trillion in tax cuts. That’s got nothing to do with how powerful corporations are in this country, right??",
                                    "score": 7,
                                    "author": "bwheelin01",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Courts?  Apparently, court rulings are as easy to overrule as executive orders.",
                    "score": 3,
                    "author": "Jimmy_Twotone"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 7,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "‘will not be allowed to \"divulge trade secrets\" or \"override safety features or emissions controls or to adjust Agricultural Equipment power levels’\n\nThis makes me think that it’s some massively watered down agreement that will ease the pressure and make it seem like they’re doing something, like Apple’s pointless repair program.",
            "score": 684,
            "author": "CucumberError",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah I read this as: 'Of course farmers are welcome to fix the equipment.  All they need is the crypto keys to unlock the firmware, and if they pay a huge fee and sign an NDA we'll grant them temporary access to it!'",
                    "score": 86,
                    "author": "Nemoder"
                },
                {
                    "level": 1,
                    "comment": "Exactly.  I’m not gonna get too excited until the dust settles.  The devil is in the details.",
                    "score": 170,
                    "author": "Kedosto",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Really.  If you can't get rid of safety features then is it even a farm?",
                            "score": 56,
                            "author": "Murderyoga",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Darn-tootin'!",
                                    "score": 11,
                                    "author": "rearended"
                                },
                                {
                                    "level": 3,
                                    "comment": "\"That's ok power take-off I wasn't really using those arms anyway. You keep em\"",
                                    "score": 3,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yep, like they changed the bill after it was passed, and completely destroyed and made useless right to repair for phones and mac's. Go corrupt policymakers!",
                    "score": 61,
                    "author": "Old_Zogwort"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 19,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The emissions shite is half of what goes wrong, it’s great for the environment but terrible for reliability",
                            "score": 9,
                            "author": "JordonLeedell",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;but terrible for reliability\n\nWhich is crazy as this means that it's terrible for the environment too (more landfill of goods that are too expensive/impossible to repair).",
                                    "score": 11,
                                    "author": "BeerPoweredNonsense",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Unfortunately, a lot of the people making choices for all of us are incapable of thinking more than 1 step ahead. Either that, or it's by design to sell more replacement parts and tractors down the line. Actually, I think it's the latter option. It's always about money.",
                                            "score": 2,
                                            "author": "CreativeCamp",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "As a tractor mechanic the majority of emissions issues are farmers not storing the ad blue correctly or not letting the system purge after running.",
                                    "score": 4,
                                    "author": "thecheapseatz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "As someone who grew up on a farm: probably 90% of faults arise from abusive use and storage conditions and a lack of the bare minimum of preventative maintenance.\n\nRocks, trees, dirt, moisture, salts, cold, heat, mice, and no grease kill everything.",
                                            "score": 4,
                                            "author": "Odd_nonposter",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes, we nudged forward, by the length of our pinky toe.\n\nTo me, this further highlights how broken the US government is right now. Lobbying must be regulated, only people can get an audience with congressmen, not corporations or industry.",
                    "score": 13,
                    "author": "GoneFishing36"
                },
                {
                    "level": 1,
                    "comment": "I suppose there has to be some limit to how they’re serviced by 3rd party. These machines can kill. Sure overclocking your cpu will be a lot of fun, worst that can happen is it burns our before its intended lifespan. But if there’s to be any risk of liability on John Deere’s part, they will insist certain safety standards are met. \n\nIt’s common in europe to regulate modified cars. They have to meet minimum safety and roadworthy standards. (And the EU protect the rights and interests of its citizens over corporate greed, see GDPR, right to be forgotten, labour laws, health and safety standards for industry, there’s no corporate free reign like there is in the US). \n\nThese modified cars also carry a significant insurance price hike (insurance is mandatory to drive on roads at least in my country, criminal offence to drive without). Insurance premiums are often multiples of an unmodified car and sometimes are considered uninsurable by certain insurance companies because  standards of modification are so variable. Plus, at least in my country, the type of driver who drives modified cars is mainly using it for street racing, so not an attractive customer in terms of risk. No reason an average road user needs to do 0-60 in 3.4 seconds. \n\nHow this translates to farming, I’m not sure which modifications they’ve seen but I presume they’ve seen unsafe mods, possibly to increase driving speed, increase load bearing potential, speed up a specialised process for work efficiency, waterproofing of vented machinery, or addition of untested or improvised parts for an unforeseen task that the machine was never designed to do. For more reading see /r/RedneckEngineering it will give you a flavour of what I’m talking about. \n\nBottom line it all sounds par for the course that farmers can repair and replace parts themselves to a specified safety standard without voiding warranty and without JD taking a huge incalculable litigation risk from potentially dangerous modifications",
                    "score": 2,
                    "author": "hungry4nuns",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Excellent. Let's keep this momentum moving for Apple products.",
            "score": 2796,
            "author": "whatta_maroon",
            "replies": [
                {
                    "level": 1,
                    "comment": "Hopefully good news on that front this year! It’s ridiculous that it’s even taken this long, but there’s been some progress at least.",
                    "score": 711,
                    "author": "For_All_Humanity",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "For ALL products",
                    "score": 20,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "If you change an apple screen you don’t get locked out of your phone. \n\nIf you change a John Deere part you can and do. Requires special software, security, unlocks etc just to force someone to use a dealer.\n\nSame with many cars - some require calibrations after a simple battery change that forces a dealer to connect to the and “ok” the system to go \n\nThis is good for all industries, but these farmers have had it bad",
                    "score": 547,
                    "author": "Shane0Mak",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When I worked for a home center retailer the John Deer riding mowers could only be unboxed by 2 people in the store who the company paid $300 each to go to an 8 hour course on how to open the crate and attach the bag. IF anyone else did the task they would refuse to honor claims from the store.",
                            "score": 20,
                            "author": "JimmyKillsAlot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Wow, just get a kubota.",
                                    "score": 2,
                                    "author": "Graywulff",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Well to be fair, BMW uses 2 Types of batteries.\n\nIts still bullshit that you need a OBD programmer to do this.",
                            "score": 116,
                            "author": "Jean_Lua_Picard",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "For BMW owners here’s some information that’s saved me thousands of dollars since purchasing my 2018 M3. \nBuy a VeePeak Bluetooth OBD2 sensor from Amazon. Download BOTH BimmerCode app on your phone and also download BimmerLink app. (There is a one time fee for BimmerCode) Plug the VeePeak OBD sensor under your steering column. First make sure Bluetooth setting is turned ON on your phone. Open the BimmerCode app and pair it to the VeePeak. \n\nBimmerCode app will allow you to edit options on your BMW like for example automatically folding the side view mirrors when the door is locked. \n\nBimmerLink app you can diagnose your own BMW issues and update maintenance repairs like new battery install, oil change &amp; new brake pad changes.",
                                    "score": 28,
                                    "author": "TMJ848",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Better get a scandoc. Has broader manufacturing dates covered.",
                                            "score": 2,
                                            "author": "Jean_Lua_Picard"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "BMW also paywalls heated seats in a vehicle you own.",
                                    "score": 126,
                                    "author": "--redacted--",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The whole car paywall shit is by far the worst trend that Tesla has managed to make popular... Other manufacturers had tried once or twice for software features (e.g BMW for AirPlay). But there was always enough pushback that it never went through.\n\nThen Tesla comes around and limits battery capacity, and their customer base just goes with it. So they add more paywalls to more features, [including the mentioned rear seat heating](https://electrek.co/2020/02/15/tesla-rear-heated-seats-model-3-ota-upgrades/). And now every single manufacturer wants a piece of that software lock cake...",
                                            "score": 37,
                                            "author": "johsko",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Probably the one thing I’m most thankful for is that I was able to choose to go to engineering school. I’m sick of these added costs to technology that I have bought and owned. I am in possession of the the seat and I am in possession of the device inside the seat that heats up my ass. So why should I pay someone else to use it when I have paid to be in possession of it? If I can get the materials I’ll just pay less and upgrade myself if I can.",
                                                    "score": 5,
                                                    "author": "scheisse_grubs"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Well yes, its important because some have hot and some have cold asses. This isn't about money but customer demands.\n\n/s wasn't obvious apparently.",
                                            "score": 51,
                                            "author": "danielv123",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "\"we want to give our drivers a sense of pride and accomplishment...\"",
                                                    "score": 7,
                                                    "author": "A_spiny_meercat"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "/s is never obvious on internet\n\nPoe's Law",
                                                    "score": 22,
                                                    "author": "beast_boy99"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "r/lies\n\napparently my /s wasn't either",
                                                    "score": 9,
                                                    "author": "--redacted--",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "If I purchase a BMW seat heater license will it give me a hot ass? 🥺",
                                                    "score": 2,
                                                    "author": "IAmAPaidActor"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 81,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "&gt;If you change an apple screen you don’t get locked out of your phone.\n\nApple tries to detect it and at different times have done various shady things to discourage 3rd party repairs/parts.",
                            "score": 36,
                            "author": "ESGPandepic",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is exactly right, even with their \"self repair\" program you need to jump through hoops to authenticate the replaced parts with the phone, Louis Rossman has covered it quite well.",
                                    "score": 16,
                                    "author": "The_Dung_Beetle",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I thought if you change the screen you can get locked out? Wasn't there someone doing a video series every year which included getting 2 iPhones and swapping the screens between them just to see if it would work (closest you can get to legit Apple components). I remember some models having issues if you tried this and others just not working at all. Has Apple fixed this in new iOS updates?",
                            "score": 19,
                            "author": "plunged_ewe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Newer phones must be paired to the replacement screen for the biometric or faceID to work. Only Apple can do this, or some very specialized repair shops IIRC. You can still access it with a passcode though.",
                                    "score": 35,
                                    "author": "PheonixManrod",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm glad somebody mentioned this little fact. I am all for reparability and I often choose some products over others due to their ability to be repaired.\n\nHowever in the case of the iPhone replacing the hardware required for biometric auth and blocking the repair by unauthorized repair shops is primarily a security feature that just so happens to have the side effect of limiting repairs. If just anyone could replace the fingerprint or face scan hardware with no other safeguards they could be replaced with parts that allow for bypassing those authorization methods. I am not fond of that but at least there is a reason for it other than \"we can charge more for repairs\".",
                                            "score": 26,
                                            "author": "imaginativePlayTime",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I repair phones for a living and some of what you said is false. As long as you do the repair correctly the face ID will work with any type of screen replacement. The true tone has to be programmed into the new screen using an inexpensive copy device.",
                                            "score": 2,
                                            "author": "nownowthethetalktalk"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Hugh Jeffreys!",
                                    "score": 5,
                                    "author": "Saccharomycelium",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "you don't get locked out of your phone. a bunch of shit just stops working\n\nthe car battery thing isn't just to \"OK\" it. it's to reset the battery capacity, otherwise it won't fully charge the new one",
                            "score": 2,
                            "author": "Optimal-Growth-5741"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I don't want to be \"the guy\" but how is that remotely even possible that some makers say X/Y are not to be allowed to be repaired by yourself?\n\nLike: oh the Toaster is broken? You can't fix it. Just apple can fix the iToast(Patent pending)",
                    "score": 9,
                    "author": "MedonSirius",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because it hasn't been illegal to do so, so they did it. If you're asking literally how then it's with circuitry that detects when a part changes and then locks up the device/machine/whatever until a \"qualified\" person unlocks it. In this case with the tractors only dealers can do the unlocking and they simply will not help you if you change your own parts and lock it yourself. Happens with newer cars too. Needless to say, this is thankfully being outlawed.",
                            "score": 13,
                            "author": "RedDawn172"
                        },
                        {
                            "level": 2,
                            "comment": "JD has been doing this for 15+ years already. Business practices almost always outpace laws. If there isn't a law against it and it will make money then businesses will do it until they get sued enough or a new law comes out.\n\nJD execs/managers were always outright laughing about farmers \"fucking themselves over\" trying to fix their own stuff. They were super pissed when someone leaked a bunch of info for one of their more popular tractor lines and some company overseas started selling compatible parts for a few big things that always broke.\n\nsource: Worked there a few years in 2005",
                            "score": 4,
                            "author": "joleme",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt;\tExcellent. Let’s keep this momentum moving for ~~Apple~~ ALL products.\n\nfixed.",
                    "score": 3,
                    "author": "Coffeebiscuit"
                },
                {
                    "level": 1,
                    "comment": "Could maybe not buy Apple products...",
                    "score": 48,
                    "author": "FastWalkingShortGuy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They make great products with great software. Right to repair isn’t an issue that makes me not want to use Apple at all, it’s an issue that I want resolved to make the experience better.",
                            "score": 3,
                            "author": "TypicalGamer88"
                        },
                        {
                            "level": 2,
                            "comment": "Android phones aren’t much better and then you have Google tracking everything you do. Can’t wait for a good Linux phone.",
                            "score": 77,
                            "author": "DextersQuest",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I feel you on that. I'm waiting to see how PinePhone goes",
                                    "score": 13,
                                    "author": "mrtrollingtin"
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;you have Google tracking everything you do\n\nIf you believe Apple isn't tracking the absolute fucking shit out of you the exact same way google is doing I have a bridge to sell you.",
                                    "score": 9,
                                    "author": "MazeMouse",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "You can use a custom ROM to disable a lot of Google's tracking",
                                    "score": 15,
                                    "author": "1minatur",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Umm ackshually Android is Linux-based 🤓",
                                    "score": 7,
                                    "author": "off-and-on",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm with you, for some reason the word Linux when referring to an OS has come to mean exclusively GNU/Linux, not just any OS with the Linux kernel such as Android or Chrome OS.",
                                            "score": 7,
                                            "author": "itskdog"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Android is an OS. Surely the repairability varies between the various brands that use it.",
                                    "score": 27,
                                    "author": "Drops-of-Q",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Android is the OS but most suffer from similar issues. Ironically the Pixel is probably the best, but using android without Google Play Services is harder than 99.9% would be willing to handle.",
                                            "score": 17,
                                            "author": "Aral_Fayle",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 7,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah, because Apple sure isn’t tracking you…..",
                                    "score": 56,
                                    "author": "thatguy425",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not defending apple. Saying that there’s no place to go.",
                                            "score": 29,
                                            "author": "DextersQuest",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Symbian!!!  jk",
                                                    "score": 2,
                                                    "author": "the_last_carfighter",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Apple makes money from their hardware and their ecosystem. Google makes money by tracking you for more effective advertising. There are many problems with Apple as a company but from a tracking and privacy perspective, Google is far worse.",
                                            "score": 22,
                                            "author": "skendax",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Apple tracks you, your headphones, your spouse. And they make you pay for it.",
                                            "score": 25,
                                            "author": "baselganglia",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Pay with money instead of paying with your personal data, correct.",
                                                    "score": 19,
                                                    "author": "randomgamesarerandom",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 2,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "And for the Mc Donald's Ice Cream Machine.",
                    "score": 2,
                    "author": "iibergazz_94",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Someone tried to and [was sued for 900 million dollars](https://www.cnet.com/culture/mcdonalds-faces-900m-lawsuit-from-ice-cream-machine-repair-startup/).",
                            "score": 5,
                            "author": "growingolder"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's not the first time I heard about this sort of restrictions in farm equipment. However, it seems to always be about Deere. Are other manufacturers not as restrictive? And if so, how did Deere still sell anything after farmers noticed those restrictions?",
            "score": 49,
            "author": "drlongtrl",
            "replies": [
                {
                    "level": 1,
                    "comment": "Other manufacturers? Lol, Deere is a veritable monopoly on large farming equipment.",
                    "score": 13,
                    "author": "Pirwzy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This guys never played farming simulator am I right? But in all seriousness there’s a few decent sized competitors",
                            "score": 8,
                            "author": "codydog125"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Now we need CAN bus communications fully disclosed, both to repair vehicles, as well as to repurpose vehicle modules - this makes them sustainable vs disposable.",
            "score": 45,
            "author": "GeniusEE",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a software engineer in the industry, I can't see full disclosure ever happening or being practical. The controllers are almost always designed for a specific application with software tools which are \"trade secrets\". I totally support unlocked smartphones, but a customer modifying the CAN network of potentially deadly machine is my worst nightmare.\n\nI think it makes much more sense to push the industry to standardize around how specific things are done like using standard protocols (J1939 or CANOpen) consistently and making diagnostics readily available for the purpose of customer serviceability rather than locking those things behind service tools only the OEMs have.",
                    "score": 6,
                    "author": "dev5994",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "As another software engineer in the industry, I think it's silly to worry about CAN network demystifying when they can already drive the tractor.",
                            "score": 6,
                            "author": "simjanes2k"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Dream on. The more disposable the better, as far as corporations are concerned. But seriously, CAN bus regulation would be a game changer for those of us who enjoy modifying our vehicles.",
                    "score": 2,
                    "author": "rob64"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Fuck yeah, boys! \n\nI will never be able to understand the logic in screwing the people over that produce our food. \n\nThey should be kings among men.",
            "score": 80,
            "author": "alabasterwilliams",
            "replies": [
                {
                    "level": 1,
                    "comment": "Most of our food come from cooperate owned farms who are in Kahoots with JD, they want the small time farmer out or at least stuck more as a renter than owner.",
                    "score": 60,
                    "author": "lilblu399",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is this where their fear of a great reset comes from? The cabal wants everyone renting etc etc?",
                            "score": 11,
                            "author": "ihwip",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "that's a fine fear to have. Blackwater is straight up trying to be America's Landlord.",
                                    "score": 4,
                                    "author": "Wow00woW",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You mean Blackrock. Blackwater is an extinct (technically) \"military contractor\" mercenary outfit.",
                                            "score": 5,
                                            "author": "MarshallStack666",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;Under the agreement, equipment owners and independent technicians will not be allowed to \"divulge trade secrets\" or \"override safety features or emissions controls or to adjust Agricultural Equipment power levels.\"\n\nThere it is, the loophole big enough to fit the whole damn tractor through, not really surprising. \n\nThis is nothing more than trying to look like they're doing something so that lawmakers and the ignorant majority think this is a win and don't push for real right to repair laws.",
            "score": 4,
            "author": "LowEffortOutlaw"
        },
        {
            "level": 0,
            "comment": "Anyone have actual details? This explained nothing.",
            "score": 17,
            "author": "drgngd",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yeah after all the bills that have only made it through after being gutted into near uselessness, I won't believe anything I hear about right to repair laws until Louis Rossman corroborates it.",
                    "score": 10,
                    "author": "The-Sofa-King"
                },
                {
                    "level": 1,
                    "comment": "Exactly! Is everyone here just reading the headline? \n\nThe article mentions what farmers and independent technicians are _not_ allowed to do but it doesn't say anything about anything what supposedly was accomplished here.",
                    "score": 7,
                    "author": "The_Egg_came_first",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "There's a link in the article to the actual agreement, read it.",
                    "score": 3,
                    "author": "HeroSword"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Why am I being told about this from the BBC? This is fucking huge news and I haven't heard a peep about it from US news.",
            "score": 10,
            "author": "b0nGj00k",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Now give McDonald’s employees the right to repair their soft-serve ice cream machine!",
            "score": 18,
            "author": "souji5okita",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Good to hear the corpos are actually heeding [the FTC.](https://en.wikipedia.org/wiki/Right_to_repair#Legislative_moves_towards_right_to_repair)  Thanks Biden for Executive Order 14036.  \"instructions to the FTC to craft rules to prevent manufacturers from preventing repairs performed by owners or independent repair shops.\"   \n\nHow many farmers are actually going to thank old Joe?",
            "score": 6,
            "author": "noonemustknowmysecre",
            "replies": []
        },
        {
            "level": 0,
            "comment": "We're breaking the conditioning!",
            "score": 3,
            "author": "downonthesecond"
        },
        {
            "level": 0,
            "comment": "\"Manufacturer will ensure that Farmers and Independent Repair Facilities\r  \nwill be able to access and obtain, per subscription or sale, Manufacturer's Tools, Specialty Tools,\r  \nSoftware, and Documentation, as set forth above, from Manufacturer or from Authorized Repair\r  \nFacilities on Fair and Reasonable terms. \"\n\n\"subscription\"",
            "score": 3,
            "author": "demarr",
            "replies": []
        },
        {
            "level": 0,
            "comment": "It's fucked up that they had to \"win the right to repair\" in the first place.",
            "score": 3,
            "author": "snafu607"
        },
        {
            "level": 0,
            "comment": "##Fuck yeah! FUCK john deere \n\nAnd if they kill it, machine shops I work at will *still* fix their shit behind john deere’s stupid back",
            "score": 3,
            "author": "galaxy_van"
        },
        {
            "level": 0,
            "comment": "Fuck John Deere. The fact the farmers had to fight for it shows you that this is a bad company.",
            "score": 3,
            "author": "Einaris"
        },
        {
            "level": 0,
            "comment": "I like my JD equipment but things never should have gotten as far as they did in regards to this in the first place.",
            "score": 3,
            "author": "NvidiatrollXB1"
        },
        {
            "level": 0,
            "comment": "This is good, I was watching Louis Rossmann discuss this last year in his fight towards \"Right to Repair\" across the sectors and its positive news for sure. Hopefully this works across all states.",
            "score": 3,
            "author": "JimmyEDI",
            "replies": []
        },
        {
            "level": 0,
            "comment": "What is even the logical argument against this?!",
            "score": 3,
            "author": "tiktock34"
        },
        {
            "level": 0,
            "comment": "They did this to avoid actual law being passed. That means they have some plans to make it impossible to repair by third party.",
            "score": 3,
            "author": "iunctus5"
        },
        {
            "level": 0,
            "comment": "This could be bigger than it sounds.",
            "score": 9,
            "author": "nocloudno",
            "replies": [
                {
                    "level": 1,
                    "comment": "It almost certainly much MUCH smaller than it sounds.\n\nNone of these \"agreements\" happen without massive loopholes allowing the corporations to keep doing exactly what they were doing before.",
                    "score": 15,
                    "author": "Bonesnapcall"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Imagine that you are the only one authorized to repair your own product since you built in vulnerabilities due to technology obsolescence. In a free market economy, this perverted monopolistic motive has no place.",
            "score": 5,
            "author": "zimejin",
            "replies": [
                {
                    "level": 1,
                    "comment": "We don’t live in a free market economy.  Those are nonsense words that don’t apply to anything in real life.  Every individual economy around the world is regulated in some fashion.  Through taxes, interest rates, subsidies, etc…. No one alive today even knows what a true free market looks like.",
                    "score": 2,
                    "author": "Supermite",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; No one alive today even knows what a true free market looks like.\n\n\nSure we do, the economy and commerce usually ends up in the hands of a few incredibly wealthy individuals who, if they decide to have a fight, can throw the entire nation into depression for a decade causing starvation and mass unemployment.  It doesn't historically work out well for working folks who end up being murdered by private armies for striking to get things like free time, non-life threatening conditions and just compensation. Many of them end up in company housing where their pay is returned to the aforementioned individuals through \"company stores\" which are the only source of basic necessities. Entire industries, indeed \"competing\" ones,  can be owned by one individual in some cases and government, too weak and feeble to do anything, is puppeted openly by unelected, profit driven overlords who decide national and geopolitical policy based on personal interest and gain. \n\nWe've done that, it doesn't work out well. It's more.of a Eutopian pipe dream than communism. It actually led to the idea of communism, that's where it comes from. \n\nPower, especially economic power, always consolidates, always corrupts and always abuses. It's not a matter of eliminating it , it's a matter of choosing where it goes and how much it can do. There is no ideal, it's going to happen in any system, so pick your poison and don't pick the one where there's zero recourse against it.",
                            "score": 3,
                            "author": "IamFrom2145"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm happy for them",
            "score": 2,
            "author": "red-cell12300"
        },
        {
            "level": 0,
            "comment": "Wow.  Honestly never thought I'd see this happen.",
            "score": 2,
            "author": "CustosEcheveria",
            "replies": []
        },
        {
            "level": 0,
            "comment": "POAH",
            "score": 2,
            "author": "3747",
            "replies": [
                {
                    "level": 1,
                    "comment": "Das mien merk",
                    "score": 3,
                    "author": "G0shdarn"
                }
            ]
        },
        {
            "level": 0,
            "comment": "thats the spirit! now do Apple and the others",
            "score": 2,
            "author": "buenisimo-travel"
        },
        {
            "level": 0,
            "comment": "I don't even own a farm but now I feel like buying a tractor.",
            "score": 2,
            "author": "AsianGoldFarmer"
        },
        {
            "level": 0,
            "comment": "I'm so happy! Congratulations to every farmer!",
            "score": 2,
            "author": "lost_survivalist"
        },
        {
            "level": 0,
            "comment": "Its like a dear john to john deere",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "they gave John Deere a Dear John",
            "score": 2,
            "author": "Kniphe"
        },
        {
            "level": 0,
            "comment": "Oooh do Apple next do apple next.",
            "score": 2,
            "author": "Tronkfool"
        },
        {
            "level": 0,
            "comment": "McDonalds milkshake machine……. your next!",
            "score": 2,
            "author": "Soggy_Motor9280"
        },
        {
            "level": 0,
            "comment": "Uplifting news?",
            "score": 2,
            "author": "d34dp1x3l"
        },
        {
            "level": 0,
            "comment": "Now let's see the FTC actually enforce any law on the books.",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "I hate the precedent that JD has made for other automotive companies. Sell a product feature complete, but lock the features behind a paywall subscription? Fuck that, im not buying a car that has that",
            "score": 2,
            "author": "The_Roadkill"
        },
        {
            "level": 0,
            "comment": "How awful, how will John Deere survive now? Won't anyone think of the executives?\n\n/s",
            "score": 2,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Poor multi national corporations when will they ever catch a break lol",
            "score": 2,
            "author": "vader62"
        },
        {
            "level": 0,
            "comment": "Just apple left then",
            "score": 2,
            "author": "Intarhorn"
        },
        {
            "level": 0,
            "comment": "Good! Next step would be right to pick up/save excess seed. That policy is pure bullshit.",
            "score": 2,
            "author": "t3khole"
        },
        {
            "level": 0,
            "comment": "Not actually that great.\n\nI'm reading the [MOU linked in the article](https://www.fb.org/files/AFBF_John_Deere_MOU.pdf). It's saying they'll make sure you have the schematic and the codes about what's happening with your equipment for diagnostics. That's good. It's also saying \"go ahead and jailbreak your tractor, bro, but it's still against the law to distribute an alternate OS or software component to get around our deliberate malfeasance\" (§II.B.8). \n\nThe worst is this bit:\n\nOh, here it is:\n\n&gt;Section III — AFBF Commitment to Manufacturer \n\n&gt;A. AFBF agrees to encourage state Farm Bureau organizations to recognize the commitments made in this MOU and refrain from introducing, promoting, or supporting federal or state \"Right to Repair\" legislation that imposes obligations beyond the commitments in this MOU. **In the event any state or federal legislation or regulation relating to issues covered by this MOU and/or \"Right to Repair\" is enacted**, each of AFBF and Manufacturer reserve the right, upon fifteen (15) days written notice, to withdraw from this MOU.\n\nNot trying to be relentlessly cynical, just point out that this headline is not supported by the facts. Please keep fighting, this is showing that public action is having positive consequences but we haven't crossed the finish line.",
            "score": 2,
            "author": "Beard_of_Valor"
        }
    ]
}