{
    "id": "12hb4g6",
    "score": 570,
    "title": "On this day 25 years ago the Good Friday Agreement was signed, ending decades of violence in Northern Ireland",
    "author": "PixelNotPolygon",
    "date": 1681112662.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/12hb4g6",
    "media_urls": [
        "https://www.rte.ie/news/ulster/2023/0410/1375929-gfa-negotiating-anniversary/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "So many have forgotten this, even those of us who lived through some or part of it. Car bombs are my biggest memory, for years they seemed to go off in random places for no reason.",
            "score": 16,
            "author": "Firewalker1969x",
            "replies": [
                {
                    "level": 1,
                    "comment": "Being suddenly evacuated from an Irish town centre was a common thing of my childhood",
                    "score": 12,
                    "author": "PixelNotPolygon"
                },
                {
                    "level": 1,
                    "comment": "Being told to be careful of bins because of their use by the IRA for bombings was the one that stuck in my mind.\n\nNow this probably wouldn't matter for most people outside of cities in the UK but my MP when growing up was Mo Mowlam (Northern Ireland secretary during this) and it was common to see her security, especially when on the sea front where her house was, which was covered in CCTV cameras.",
                    "score": 10,
                    "author": "MIBlackburn",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "When I was in London only about 5 years ago I was told that the flimsy bins in public spaces which consisted of a bin bag hanging from a loop had been installed because it would be harder for the IRA to hide bombs in them. I'm not sure if that is true but that's what some locals told me. Were bins modified in your area? And are the modified bins still in place?",
                            "score": 4,
                            "author": "Stiurthoir",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They weren't modified where I was but after the IRA bombing multiple places in London and Warrington using litter bins, we were told to be careful. I know that they were removed in the City of London because of the Bishopsgate bombing (not actually involving any bins) and they only put a few back years later so trying to find a bin in the square mile is a bit of a pain in the arse.\n\nThose bins that you saw are common, especially in railway stations and moreso after the 7/7 bombings. Some bins were put back after botht he IRA and 7/7, but after that, it became just the bag with maybe a lid to signify standard waste or recycling. \n\nThe people that told you are correct, you could easily spot anything untoward in them, some bombs had anti-tamper devices which would be harder to spot and solve in solid bin and a solid bin would become shrapnel unless if they used bomb-resistant bins.",
                                    "score": 3,
                                    "author": "MIBlackburn"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm proud of them. Some people have chosen violence for hundreds of years. People who can cast it aside are rare and noble.",
            "score": 48,
            "author": "FierceContinent",
            "replies": [
                {
                    "level": 1,
                    "comment": "I wonder if any of the local politicians in NI today would have the ability to deliver something like that today",
                    "score": 12,
                    "author": "PixelNotPolygon",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm happy about the growth of the alliance party.",
                            "score": 9,
                            "author": "FierceContinent"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Is this possible for Palestine &amp; Israel?",
            "score": 5,
            "author": "beeucancallmepickle",
            "replies": [
                {
                    "level": 1,
                    "comment": "Possible but I think it's sadly doubtful. The grievances on both sides are deeply culturally engrained and go back millennia. It would require a huge effort of political will to (literally) draw a line in the sand and say \"this is here we are now, let's forget the past and move forward in peace\".\n\nI can't help thinking that there would be new,  violent factions founded within minutes of anything peaceful being signed.",
                    "score": 7,
                    "author": "SuperJetShoes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think it's a bit misleading to argue that the Israel/Palestine conflict goes back millennia. There are some religious aspects which have old roots yes, but the primary cause of the conflict is the colonisation of Palestine, which only began in the 20th century. In fact it happened much more recently than the colonisation of Ireland.",
                            "score": 13,
                            "author": "Stiurthoir",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yes, that's true. But could you envisage a lasting peace being formed? I can't help thinking that any political agreement might not convince armed extremists on either side.",
                                    "score": 2,
                                    "author": "SuperJetShoes"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Not until there is religious reform. Not all Palestinians subscribe to this extreme view, but many believe that Israel should no longer exist or even support genocide against the Jews. You can't have peace when a portion of the population thinks they have a religious obligation to fight the others.\n\nHopefully something will eventually change, but if over a thousand years of conflict have shown anything, it's unlikely.",
                    "score": 1,
                    "author": "VP007clips",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "...... [bleep]. That's devastating. Regardless of one or many versions of justification, genocide is genocide, and should be stopped on all accounts.",
                            "score": 0,
                            "author": "beeucancallmepickle"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "And the tories launched brexit, knowing full well that it would damage the agreement and set the troubles off again.",
            "score": 5,
            "author": "THEBIGREDAPE",
            "replies": [
                {
                    "level": 1,
                    "comment": "No, I think they just forgot that Ireland (both parts) existed, and forgot about their own international treaty obligations under the Good Friday Agreement. And when they were finally reminded, long after the referendum, that Brexit would harm Ireland and the peace process, they just took it for granted that the Republic of Ireland would abolish itself and allow itself to be re-absorbed into Britain, and give up its sovereignty for Britain's convenience.",
                    "score": 3,
                    "author": "outhouse_steakhouse"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I've been meaning to look into this history, I really have no idea what all the fighting was about?",
            "score": 8,
            "author": "danceinstarlight",
            "replies": [
                {
                    "level": 1,
                    "comment": "[This](https://en.wikipedia.org/wiki/The_Troubles) is probably the best place to start.",
                    "score": 8,
                    "author": "ukexpat"
                },
                {
                    "level": 1,
                    "comment": "Here is a brief simplified version of a history which is very long and complex. I have only included the main points but it's still quite long, sorry about that:\n\nIn the 17th century (and in other periods), the British government invaded and colonised Ireland with loyal British colonists. Under British rule, British colonists comprised the elite ruling class in Ireland, with Irish natives stripped of rights, property and often starved or slaughtered en masse. Many native Irish rebellions against British rule occur, in which British colonists are often killed. Each community fears the other. In particular the British colonists have an existential fear of losing the colonial society they have built. \n\nThe two cultures are quite different. The Irish natives and the British settlers do not share the same religion and they don't even share the same language until the Irish language is largely eliminated by British policy.\n\nIn the 20th century a volunteer army is formed to fight for Irish independence. It is called the Irish Republican Army - the IRA. In the 1920s the IRA forces the British Army to retreat out of most of Ireland, which becomes mostly independent by treaty between Ireland and Britain. \n\nThe British continue to occupy only 6 counties in the North of Ireland. Colonisation had been most intense in the North, so there are many people there descended from British colonists who are still loyal to Britain. The descendants of colonists are almost all Protestants because their ancestors are from Protestant Britain. The descendants of Irish natives are mostly Catholics because Ireland never had a protestant reformation. Obviously, because of occasional inter-marriage, a person could be descended from both natives and colonists. A person's religion generally decided their status.\n\nUnder the British administration of the North of Ireland the Irish Catholics are second class citizens. Local government is entirely dominated by loyal protestants. Catholics are not allowed equal access to housing or employment and their votes are worth less than protestant votes. They have virtually no political representation and are often under attack by the police. The IRA still exists clandestinely in the North but is much weaker after the fighting in the 1920s. The IRA sometimes intervenes to defend Catholics against pogroms but is mostly inactive for decades.\n\nConditions under British rule in the North are in many ways similar to segregation in the American south. Inspired by the American Civil Rights movement, the Irish organise a civil rights movement in the North. Their peaceful protests are often violently attacked by the British police and military. Infamously one peaceful protest was fired on by the British Army which shot 26 people and killed 14. \n\nThe protestant public are told by their leaders that Catholics are their enemies, and that the civil rights movement is a criminal attempt to ruin their way of life. This is easy to believe because the two communities are quite separated. Schools, for example, are segregated. \n\nExtremist anti-Catholic protestants organise paramilitary groups to attack Catholics and drive them out of the British-occupied North. They call themselves Loyalists. Similar in ways to the KKK in America, but more militarised. Huge numbers of Catholics are bombed and burned out of their homes and thousands flee to the independent south where the Irish government establishes refugee camps. \n\nAfter internal disagreements over strategy, the IRA decides to rapidly re-arm, expand recruitment, and intervene to defend Catholics. It is also decided that British rule in the North of Ireland must finally end, and this can only be achieved by defeating the occupying British army. The IRA emphasises that their goal is equality for all groups in Ireland, but that violence and killing is necessary to achieve this goal.\n\nThe conflict lasts for roughly 30 years. It consists mostly of fighting between the IRA and British-aligned forces. British aligned forces consist of the British army and police, as well as Loyalist paramilitaries, which are technically illegal but are not-so-secretly armed, supplied with intel, and assisted in other ways by the British state. Many civilians are killed. Loyalist paramilitaries in particular kill many civilians, as they mostly attack Catholic civilians rather than the IRA. IRA attacks against \"economic targets\" - banks, businesses etc. - also result in civilian casualties despite attempts to warn civilians away from targets before an attack.  \n\nAfter decades of fighting the IRA accept that they can't fully defeat one of the most powerful military forces on earth. The IRA in comparison is a tiny guerilla force of mostly unpaid and poorly equipped volunteers. However, the British military also accept that they cannot fully defeat the IRA. A stalemate exists.\n\nA peace treaty is agreed by representatives of both sides in 1998. The terms are that everyone in the North will have civil rights and an equal say. The British police force in the North is disbanded and replaced with a less anti-Catholic force. The North stays under British jurisdiction but it is promised that at some future date a referendum will be held and a majority may vote to end British rule if they choose. The fighting almost entirely ends. Most British troops withdraw. The IRA disarm and cease operations. \n\nThe IRA's political organisation, Sinn Féin, had been censored and banned under British law but after the peace deal they are allowed to operate normally. They are now the most popular party in the North of Ireland and in the independent Irish state. They lead the North's regional government alongside the other political parties from the region. (Although the local government of the North is currently not operating properly due to Brexit-related disagreement)\n\nThat's the basic history behind the war known as 'The Troubles' 1969-1998.",
                    "score": 6,
                    "author": "Stiurthoir"
                },
                {
                    "level": 1,
                    "comment": "Try reading Say Nothing by Patrick Radden Keefe. I just finished reading it and he does a good job of being as fair-minded as possible about a very complicated issue. And PRK is just an awesome author in general so it's written very well.",
                    "score": 3,
                    "author": "rightshoe1116"
                },
                {
                    "level": 1,
                    "comment": "Read Understanding the Troubles by David McKitterick",
                    "score": 3,
                    "author": "PanNationalistFront"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": -1,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Common misconception by foreigners. Ethno-religion would be more accurate but realistically it’s a classic case of colonialism. Coloniser vs Native.",
                            "score": 20,
                            "author": "bee_ghoul",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 1,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You kinda left out the centuries of violence the English had perpetrated on Ireland in the few hundred preceding years",
                                            "score": 20,
                                            "author": "hammyhamm"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I’m Irish, thanks for the copy and paste. I’ll return my citizenship now. Once I forward this to the department of education of course.\n\nEdit: wow so I’m a “loyalist bootlicker” because I believe that the history of Ireland is a little more complicated than you made it out to be.",
                                            "score": 15,
                                            "author": "bee_ghoul",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 0,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The Protestant perspective is of course much more complicated, and doubtlessly plenty of awful things were done, but I think your representation of the history is a little one-sided. Did you live in northern Ireland during the troubles?",
                                                            "score": 7,
                                                            "author": "wheeb85"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Did they really just stop fighting when the document was signed?",
            "score": 1,
            "author": "Phosphorus44",
            "replies": [
                {
                    "level": 1,
                    "comment": "I think violence de escalated over the period it was being negotiated but I wasn’t really old enough to remember.",
                    "score": 2,
                    "author": "PixelNotPolygon"
                }
            ]
        },
        {
            "level": 0,
            "comment": "That sounds... [awesome?](https://socialist.net/the-good-friday-agreement-a-quarter-century-of-dashed-hopes/)",
            "score": 0,
            "author": "editilly"
        }
    ]
}