{
    "id": "12nhq9t",
    "score": 623,
    "title": "DNA traces of ancient viruses may help fight cancer, study finds",
    "author": "Lakerlion",
    "date": 1681590968.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/12nhq9t",
    "media_urls": [
        "https://www.theguardian.com/science/2023/apr/15/dna-traces-of-ancient-viruses-may-help-fight-cancer-study-finds"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "fyi—the article is talking about retroviral genes being activated in certain cancer cells, therefore becoming potential warning flags for the presence of cancer, as well as possible sequences that could be recognized as a target by anti-cancer therapeutics to deliver them to cancer cells of those specific types of cancer — it is not talking about infecting people with ancient retroviruses in order to cure cancer",
            "score": 41,
            "author": "benchcoat",
            "replies": [
                {
                    "level": 1,
                    "comment": "Having lost several family members to cancer, and knowing how much that hurts,  along with the risk to myself... I kinda don't think it needs to be cured. People need to die. It's tragic when it's a child or young adult,  but in a way I think it's just nature's built-in population control, cold as that sounds. Increased therapy and comfort measures,  absolutely,  and I'm not saying not to test something that's treatable,  but we're destroying our environment pretty efficiently without being immortal.",
                    "score": -24,
                    "author": "joshylow",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Joshy.  \n\n\nNature's in-built population control is long gone, and on its way out.  \nIt's no longer surival of the fittest. Technology changed that.",
                            "score": 3,
                            "author": "AwareStrategy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah,  it has. I guess my point was that medical advances come with their own issues. We're alive far longer than we should be,  you know? I'll die when it's my time.",
                                    "score": 0,
                                    "author": "joshylow",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Who and what decides how long \"we should\" be alive for?  \nNature has long lost it's say.  \n\n\nAnd you can prolong your time, and die way past it, if your circumstances allow for it.  \nDon't limit your life due to a flimsy thing such as \"nature\".",
                                            "score": 2,
                                            "author": "AwareStrategy"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Very bizarre. First bee venom has similar effects to fighting cancer, now ancient viruses. That's pretty bizarre, but I ain't got a complaint of any of this really.",
            "score": 26,
            "author": "VannaThiccness"
        },
        {
            "level": 0,
            "comment": "As the conditions to our environment change, so must we change with them. In earlier times this would be considered a sign from God. Now we are able to rationalize and explain everything scientifically. As times progress, it would be a good idea if humanity would pay closer attention to these signs.",
            "score": 12,
            "author": "sedativumxnx"
        },
        {
            "level": 0,
            "comment": "Viruses have been around longer than us. They hodl the secrets.",
            "score": 1,
            "author": "testnetmainnet"
        },
        {
            "level": 0,
            "comment": "This is a very good news. I hope it makes it to the next level soon enough.",
            "score": 1,
            "author": "CryptoYaar"
        },
        {
            "level": 0,
            "comment": "Anything has the *potential...*",
            "score": -5,
            "author": "Fortyplusfour"
        },
        {
            "level": 0,
            "comment": "     Yeah. Fuck my pollution and use of resources. There needs to be more of me for longer. I want to get really old and shit in a diaper so I have time to buy more plastic things so they get into the water and cause more cancer. Hospital execs will love it!\n    Really,  I'm not meaning nature in a philosophical way. I just mean that actual nature,  like our planet,  requires us to die in a timely fashion. If what you're saying is that we're already past that tipping point,  yeah,  probably. If you're saying that technology will catch up and fix it all,  I just don't have enough faith in that happening quickly enough. \n    To be fair, my view on death is pretty lax. Doesn't scare me. I don't really mourn people, just miss them. I think it's all part of the cycle. Now I'm getting philosophical. Bah!",
            "score": 1,
            "author": "joshylow"
        },
        {
            "level": 0,
            "comment": "polio recently discovered it could cure cancer",
            "score": -5,
            "author": "salmandaw"
        },
        {
            "level": 0,
            "comment": "As long as it doesn’t get out of the bio lab🤔🤔",
            "score": -7,
            "author": "beechcraftmusketeer"
        },
        {
            "level": 0,
            "comment": "im sure we already have a cure",
            "score": -9,
            "author": "couchperson137"
        }
    ]
}