{
    "id": "12ondn0",
    "score": 2188,
    "title": "More States Nix Nonconsensual Pelvic Exams by Med Students",
    "author": "Sandstorm400",
    "date": 1681676150.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/12ondn0",
    "media_urls": [
        "https://www.medscape.com/viewarticle/990723"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Sad that there has to be a rule against this to begin with (would hope it would just be human decency to get consent first) but glad it’s happening",
            "score": 87,
            "author": "Alias72018",
            "replies": [
                {
                    "level": 1,
                    "comment": "Some people may feel uncomfortable with the idea of doctors getting more training, perhaps because they are worried about the risks associated with surgery. However, it's important to recognize that the more training and education that doctors receive, the better they will be at their job and the more successful surgeries will be.\n\nMistakes can happen in any profession, but the stakes are particularly high in the medical field. That's why it's crucial for doctors to have access to ongoing training and professional development opportunities, to help them stay up to date with the latest techniques and procedures, and to ensure that they are providing the best possible care to their patients. Ultimately, this can help to reduce the risks associated with surgery and improve patient outcomes.",
                    "score": -11,
                    "author": "Pane502",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm uncomfortable because they do it without my knowledge. I don't speak for everyone, but if I could have someone in the room when they do this, I absolutely wouldn't mind. I'm knocked out and someone I trust will be there to make sure nothing inappropriate happens, so go off.\n\nHonestly, it's more scary than uncomfortable. I don't know these people. I find it to be a huge violation when I haven't given consent. Even when I'm dead to the world, I'm still a person. I have the right to decide who sees my vagina while I'm in a vulnerable state.\n\nAlso, \"they're professionals\" isn't a good enough reason. \"They need to learn somehow\" isn't a good enough reason. They can learn with a patient's consent and someone they trust to be in the room.\n\nMy body, my choice. End of discussion.",
                            "score": 18,
                            "author": "goatofglee",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My body, my choice...except when it comes to medical care, then it's our body, our choice!\n This thinking is the exact reason we don’t have a public health care option in the U.S.\n\nI understand why you might feel uncomfortable with medical exams or procedures being done without your consent. It's important to feel in control of your own body and to have a say in what happens to it.\n\nHowever, it's also important to recognize the expertise of medical professionals and to trust that they have your best interests at heart. It's like when you're learning to ride a bike - your parents might hold onto the back of your seat to help you balance and keep you safe.\n\nWhile patients should always have a say in what happens to their own bodies, we also need to consider that medical professionals are trained to provide the best care possible. It's like how you might not always get what you want for dinner, but your parents try to make sure you're eating healthy and nutritious food.\n \n\nThere is a reason they do this..  Have you ever had surgery before?",
                                    "score": -12,
                                    "author": "Pane502",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Then they can do it with my consent.\n\nThe only time I've been under was for my wisdom teeth at 21, and thankfully I didn't have to worry about this. I've had my uterine wall hole punched, and IUD inserted/removed, which is considered a small surgical procedure, but they make you stay awake for it...which is an entirely different topic.\n\nYou're not going to convince me here, friend. I already understand why they do it, but in the examples you've provided where I'm supposed to see all medical professionals in a caring and nurturing light...I'm awake and I could still refuse the food, or I could still end the bike learning experience.\n\nAs a person with a vagina, it's already a fraught experience with doctors (I've had my share of wonderful doctors, though). I do not need my body to be viewed in such a manner without a trusted person to stand in the room and with my consent. That is not a lot to ask for. It's literally the bare minimum of respect.\n\nI do not care how clinical and sterile it is. I need to have agency over my body and who sees and touches it.",
                                            "score": 11,
                                            "author": "goatofglee",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Me.. Me Me… My…I don’t think you will  understand this until you been put under come out and realize your doctors and nurses don’t know as much as you thought.. And this is with those examination…\n\nAlso not sure if you are aware but the  second leading cause of death in the U.S. is mal medical practice…",
                                                    "score": -10,
                                                    "author": "Pane502",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "And your solution is to perform invasive or intimate procedures on patients without their consent? When they go under for completely unrelated reasons? \n\nPeople shouldn’t worry that their privacy will be violated against their will when they get their wisdom teeth removed. If the hospitals care about their patients they can get consenting participants. This is beyond ridiculous.",
                                                            "score": 9,
                                                            "author": "PurpleKraken16",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Again if you have ever been under surgery privacy is the least of your concerns.. I feel this a topic many people here are speaking about but have no idea.",
                                                                    "score": -5,
                                                                    "author": "Pane502",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Privacy isn’t the issue consent is. Without consent it is fucking assault. It doesn’t matter that the patient didn’t know that it was happening or the the person preformed it did it for educational reasons. Without consent it is assault.\n\nAnd your reasoning that it helps the doctor learn if fucking bs. Student doctors can and do learn the same skills be shadowing other doctors and asking patient permission (consent) to perform these same procedures.",
                                                                            "score": 7,
                                                                            "author": "Ok-Pizza-996",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Just because they are performing surgery on you and doing their job doesn’t give them a free pass to rape you.",
                                                                            "score": 4,
                                                                            "author": "PurpleKraken16",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I have had lots of surgery - I’ve been chronically ill and disabled for 33 years. I’m 53 years old, so any ‘young people today’ complaint is equally moot.\n\nNow that bit of gatekeeping is out of the way, in my country doctors ask for consent on these kind of issues, although when in surgery there is a proviso that emergencies may change the situation.\n\nI always say yes to allow my case to be allowed for study and education.\n\nAsking for consent is not a problem all.",
                                                                            "score": 1,
                                                                            "author": "Niallism",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "That’s great for you! What country? I don’t know how health care works in your  world. Only in the US. Cause I recently when through surgery of my own.",
                                                                                    "score": 1,
                                                                                    "author": "Pane502"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yup so we should give consent and be clearly informed.",
                            "score": 2,
                            "author": "Niallism"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I'm sorry, more states do *what now*?",
            "score": 25,
            "author": "ProfStupidFace",
            "replies": [
                {
                    "level": 1,
                    "comment": "[Nix](https://dictionary.cambridge.org/dictionary/english/nix). \n\nNever heard about that word either myself.",
                    "score": 2,
                    "author": "Xinq_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No, not the word nix, the fact that nonconsensual pelvic exams are a thing is insane to me.",
                            "score": 14,
                            "author": "ProfStupidFace",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ahhh. Yes indeed. If you didn't have enough fear for a procedure already... Now they add rape to the mix.\n\nThat said, a prostate exam sounds better when under than awake xD",
                                    "score": 6,
                                    "author": "Xinq_"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "On my desktop browser I had no problem with reading the article.  I tried it on my cellphone and I had to tap \"close\" on the pop up window to view the article.",
            "score": 135,
            "author": "Sandstorm400",
            "replies": [
                {
                    "level": 1,
                    "comment": "Login or sign up to read on desktop",
                    "score": 0,
                    "author": "CHANROBI",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Okay, thanks for letting me know.  I'm not exactly sure why some people are getting that message.  If anyone wants to read a similar article about the subject that requires no login for anyone, this link should work: [https://www.kshb.com/news/local-news/investigations/conversation-surrounding-non-consensual-pelvic-exams-continues-in-kansas-city](https://www.kshb.com/news/local-news/investigations/conversation-surrounding-non-consensual-pelvic-exams-continues-in-kansas-city)",
                            "score": 2,
                            "author": "Sandstorm400"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can anyone tell me what nonconsensual pelvic exams are being done? It sounds like something no medical practice or school would ever consider doing. Maybe I'm wrong?",
            "score": 230,
            "author": "WhyNotChoose",
            "replies": [
                {
                    "level": 1,
                    "comment": "https://www.healthywomen.org/your-care/pelvic-exams-unconscious-women",
                    "score": 211,
                    "author": "SignDeLaTimes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "hfs wtaf how is this even a thing??",
                            "score": 140,
                            "author": "theelljar",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You might not wanna dive deeper into how medical staff is treating women in general :D It's kinda brutal.",
                                    "score": 238,
                                    "author": "Elelith"
                                },
                                {
                                    "level": 3,
                                    "comment": "Because women aren’t people!",
                                    "score": 72,
                                    "author": "harbinger06",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "We're made to deal with pain! 🙄",
                                            "score": 9,
                                            "author": "goatofglee"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "In my country you would rightly lose your license and maybe go to prison for that kind of thing. At least if everything works correctly, which is a whole other thing …",
                            "score": 81,
                            "author": "Reisevi3ber"
                        },
                        {
                            "level": 2,
                            "comment": "&gt;\tApproximately 45 minutes later, she woke up horrified to discover that her feet were in stirrups, her underwear had been removed, and the doctor was performing an invasive vaginal exam.\n\nDamn. I remember the last time I woke up after a general anesthetic… It was already annoying. But to wake up to that… when I get back my strength someone is getting murdered.",
                            "score": 12,
                            "author": "Divinicus1st"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[Here ya go](https://www.pbs.org/newshour/show/why-more-states-are-requiring-consent-for-pelvic-exams-on-unconscious-patients)",
                    "score": 89,
                    "author": "Pandora_Palen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Ok thanks. I didn't know this was a thing. Wow.",
                            "score": 73,
                            "author": "WhyNotChoose",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It's completely understandable why people are like, \"aw, come the hell on. That doesn't happen!\" because it really is that wild and really *shouldn't* be a thing.",
                                    "score": 165,
                                    "author": "Pandora_Palen",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Like you said, it’s so fucked up that it doesn’t pass the “sniff test,” which makes it even more fucked up that it’s true lol.",
                                            "score": 13,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&lt;facepalm&gt;",
                            "score": 10,
                            "author": "gregorydgraham"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It's getting less common now as the general public has become more aware of it, but you'd be surprised at just how recently this was just the accepted norm.\n\nBasically if you're out under anesthesia for a surgery or procedure or whatever, they might have med students come and practice pelvic exams on you without asking for your consent. So going in for surgery to have your appendix out? They might have had med students practicing pelvic exams on you while you were out.",
                    "score": 61,
                    "author": "Evil_Weevill",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's seriously fucked up.",
                            "score": 33,
                            "author": "unposted"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They used to be commonly done when a woman was having a gynecologic procedure. To be honest, an exam under anesthesia prior to starting a procedure can influence the approach to the surgery because the doctor can get a better exam than when the patient is awake. I find this a completely acceptable part of the procedure since it helps direct the surgery. However, it should probably be listed on the consent. The real  issue becomes if a medical student or resident is present and also does an exam under anesthesia without prior consent or if an exam is done when it does not pertain to the procedure being performed.",
                    "score": 104,
                    "author": "oneislandgirl",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 251,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Exactly. That is just plain creepy.",
                                    "score": 93,
                                    "author": "oneislandgirl",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I mean, surely in any other context, someone poking around an unconscious vagina is sexual assault. How is this not assault!?",
                                            "score": 48,
                                            "author": "itsstillmagic",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "They're doctors 🤷‍♀️ \nPeople with money can touch you funny.",
                                                    "score": 18,
                                                    "author": "ringothefuckindingo1",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Well, medical students, so, people with massive debt. But the white coat sure does help I guess.",
                                                            "score": 16,
                                                            "author": "itsstillmagic"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Man, these nursery rhymes are getting dark.",
                                                            "score": 6,
                                                            "author": "slamdamnsplits"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Even your username rhymes!",
                                                            "score": 3,
                                                            "author": "AgentChris101"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It is assault many people are just unaware that it happened to them.",
                                                    "score": 1,
                                                    "author": "Ok-Pizza-996"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Especially because everything has a risk, including infection...so not being informed is insanity",
                                            "score": 31,
                                            "author": "jejcicodjntbyifid3"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Generally speaking (at least in the UK anyway, where consent is gained prior to examination) the examination would be relevant to the condition I.e. vaginal examinations would only be done on gynaecology patients so that the med student would have experience the pathology the patient was being treated for",
                                    "score": 7,
                                    "author": "AliquidLatine",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There's other links in this thread if youd like more info because the whole point is that's not what is happening in the US",
                                            "score": 15,
                                            "author": "diligentditz",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I know, I can't believe it! Sorry, was just trying to reassure any Brits that wandered by. Love for doctors/the NHS is at an all-time low over here. I didn't want this making things worse 😰",
                                                    "score": 4,
                                                    "author": "AliquidLatine",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Ah that makes sense! I'm sorry for assuming it was dismissive",
                                                            "score": 8,
                                                            "author": "diligentditz",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "No, you're right, in retrospect it does look dismissive. Thanks for the civil reply offering more info. A lot of people on Reddit would have just sworn at me and down voted 😄",
                                                                    "score": 6,
                                                                    "author": "AliquidLatine"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I find your first scenario acceptable, too. It's related to the procedure and for the patient's benefit. What I take issue with is when it's *not* for the patient's benefit, but for the student's. Consent would be nice for the former, but to not gain it for the latter is morally reprehensible and a betrayal of trust between patient and doc and teacher and student.",
                            "score": 84,
                            "author": "Pandora_Palen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Consent needs to be required for any medical procedure, if it is possible to obtain.",
                                    "score": 24,
                                    "author": "Lallo-the-Long"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "\"probably\"",
                            "score": 2,
                            "author": "Vault-Born"
                        },
                        {
                            "level": 2,
                            "comment": "If a patient is consented for a PEUA, whether the attending, the resident, or any med student present does the exam is inconsequential. The consent covers all of them.",
                            "score": 1,
                            "author": "AULock1"
                        },
                        {
                            "level": 2,
                            "comment": "I know here (Belgium) they do the same for men so med students can train on prostate exams. There's no consent asked either. And tbh, couldn't care less.",
                            "score": -61,
                            "author": "Translationerr0r",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "imagine waking up from something simple and your butthole feels like someone jammed something in it...\n\nI completely agree it makes sense, and if explained to me, I'd probably be OK with it, free prostate exam while I'm out, nice. But what a fucked up idea to do it without consent.",
                                    "score": 13,
                                    "author": "Genie-Us"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Usually prior to a surgery for a gynecological issue (hysterectomy, tubal ligation, etc) the surgeon does a pelvic exam prior so they know what the individual anatomy is like.   This pelvic exam is a routine part of the surgery and part of the surgical consent typically although might not be explicitly discussed.  Often times there are multiple surgeons (resident surgeons typically) who although they are in training are integral parts of the surgical team. \n\nAt teaching institutions patients often consent generally to medical student involvement.  This usually means the medical student can do anything the surgeon can do under the supervision of the surgeon/physician. However their involement isn't typically crucial (but typically they're just holding retractors, cutting sutures and observing.)\n\nCombining the two consents above can be taken to allow for medical students to perform a pelvic exam prior to the surgery (because this is what the surgeon does), but there is not explicit consent for that.  This is what happened when I went through medical school and I think is the majority of what will be changed.  An explicit consent for pelvic exams will probably be added to preop consents.  \n\nNow notably many of these patients often have ovarian cancer or uterine cancer or other abnormality. It is important for doctors to be able to diagnose gyn cancers on exam, but you could have 200 standardize patients (healthy people paid to teach exams) and you wouldn't teach exactly what an ovarian cancer feels like.  \n\nWhat has probably happened before but much more rarely is people going in for a knee surgery and having a pelvic exam without consent, but I think that's what people mostly think is/was happening when they hear about this.",
                    "score": 4,
                    "author": "pkvh",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Could you please expand upon (since you seem knowledgeable) how a pelvic exam prior to a tubal ligation/removal would be helpful for the surgeon? It was not discussed with me before my surgery, but I got to read in the post-surgery notes that it was done to me, and I noticed the iodine- colored discharge afterwards as a clear indicator as well. I specifically asked my doctor what role(s) the med students would be playing during, mainly due to this fear, and she assured me they'd only be holding the instruments/camera and observing. I just wish they told me beforehand that this was part of the \"norm\" so I knew what to expect. Thanks.",
                            "score": 4,
                            "author": "mollyyes",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The iodine was probably from a Foley catheter placement to keep the bladder empty. Iodine is used prior to inserting the catheter into the urethra to reduce uti risks.  Iodine isn't used as part of the pelvic exam, clear lubricant is. \n\nThere's been discussion that Foley catheter placement should be explicitly discussed with patients as well.  It's typically thought of as an associated procedure and the nurses do it so a doctor probably wouldn't mention it, but it can be unexpected to find iodine there when not expecting it. \n\nAs far as the utility to the surgeon, the pelvic exam can let you know if the uterus is antiverted or retroverted (which direction it flops).  You can get an idea of the size of the uterus.  If the person isn't obese you can feel the ovaries and associated tissues (adenexa).  This is helpful in knowing if there are any masses or adhesions that might complicate the surgery.\n\nFor a tubal ligation it's typically not as useful if everything is normal. It's just bad form to get the laparascopic instruments in and discover the uterus has a tumor that you could have easily felt on a pelvic exam and they perhaps needed a different surgery.   If the ovaries are coming out then it's a bit more important to get an idea of the size of things (usually the ovary is coming out for a cyst or something).\n\nCertain procedures also involve a vaginal manipulator that goes in and holds the cervix and uterus and allows you to move the uterus around which is helpful for positioning things during certain surgeries.",
                                    "score": 2,
                                    "author": "pkvh",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Thank you! This helps a lot! They definitely put in a catheter, so that makes sense. I do wish they talked about that beforehand, though.",
                                            "score": 1,
                                            "author": "mollyyes"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Anyone actually IN THE HEALTHCARE FIELD int he U.S. will tell you this shit doesn't happen. 40 years ago, maybe, but not anywhere near recently.",
                    "score": -134,
                    "author": "night-shark",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Here's a study from 2019. [check it out](https://www.elle.com/life-love/a28125604/nonconsensual-pelvic-exams-teaching-hospitals/)\n\nOf course you'd *prefer* to believe it doesn't happen, but for all you know, it happened to you if you've ever been under anesthesia. Your preferences are irrelevant.",
                            "score": 111,
                            "author": "Pandora_Palen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's not a study. It was a poll of 100 med students. Polls are subject to biased reporting and misinformation. They only tell you what people THINK. They do nothing to account for these biases. Formal studies do try to account for this.\n\nIf you \"poll\" a random sample of people in this country, a not insignificant number of them would report that vaccines do not provide health benefits. That doesn't make that fact true",
                                    "score": -81,
                                    "author": "night-shark",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;Anyone actually IN THE HEALTHCARE FIELD int he U.S. will tell you this shit doesn't happen.\n\nYou said to ask anyone in the healthcare field. \n\nSomeone asked 101 of them. \n\nDidn't come up with the answer you claimed they would.",
                                            "score": 17,
                                            "author": "RequirementQuirky468"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Ah. I see. So those med students just *thought* they performed the exams...totally open to interpretation. You are arguing in bad faith, and it's tiresome.\n\nETA- for the sake of clarity, my take away was not that \"the students hadn't gained that consent personally\" as the person below (whom I can't reply to 🤔) insinuates, but that the consent was either not gained at all by anyone or it was phrased in such a way as to allow med student involvement without specifying how invasive that involvement may be, thus using a loophole to gain access to a patient's body beyond what the patient may have agreed to had the forms clearly stated that \"while under anesthesia, students may use your vagina/anus to practice procedures irrelevant to the procedure you've been admitted for.\" That's a run-on sentence and I'm tired. Forms that do not lay that out do not grant consent for those students to perform invasive procedures simply as a learning tool. I assume that the 61% of students who stated they didn't have consent meant that they were familiar with the wording and knew they didn't have consent to use the patient in this manner, not that they didn't deliver the clipboard themselves.",
                                            "score": 74,
                                            "author": "Pandora_Palen",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "You’re looking the wrong way at the questions asked in the poll. Most medical schools do not have the med student obtain official consent forms. Those are often done weeks before surgery by an attending or resident when the med student isn’t even on rotation yet. \n\n61% of med students didn’t explicitly obtain consents because it wasn’t their job. That doesn’t mean the majority of pelvic exams are done without consent.",
                                                    "score": -33,
                                                    "author": "StreetcarHammock",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "No one is saying that a majority of pelvic exams are done without consent. However, ***any number of pelvic exams being done without consent is a problem***. Get it?",
                                                            "score": 10,
                                                            "author": "Lallo-the-Long"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "So if it doesn’t happen, so you say, then making it illegal doesn’t matter then does it. I don’t see your point, even once is to many, Jesus man",
                                                            "score": 21,
                                                            "author": "thefrostmakesaflower"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "This is correct. No one wants to hear it when they already pulled out their pitch forks. If you don't want medical students and residents touching your body, don't go to a teaching hospital. A patient once told my attending they refused to have residents participating in their care. My attending told them they can go to a different hospital.\n\nLet me say that there are stories of absolutely atrocious things happening in medicine while patients are under anesthesia. But people in these comments act like non consensual pelvic exams are happening everywhere and it's a huge issue we need to address when it's not.",
                                                            "score": 1,
                                                            "author": "THEGREATBAMBY"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Do we have a better source than Elle magazine? A link to an actual study would be preferable.",
                                    "score": 1,
                                    "author": "grammar_fixer_2"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Regardless. Seems like a pretty unanimous vote, no?",
                            "score": 9,
                            "author": "Super_Exaggerated"
                        },
                        {
                            "level": 2,
                            "comment": "Go to r/twoxchromosome and do a search for posts on this topic. I've seen more than a few from people talking about this happening to them recently.",
                            "score": 38,
                            "author": "Misabi",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, and the really heart wrenching part is that they get laughed out of every room by hospital admin if they try to complain. There's absolutely no way to get justice or accountability. So many people confidently say, \"That isn't happening, that never happens\" etc.",
                                    "score": 39,
                                    "author": "KiloJools",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Read one where the nurse scoffed and asked, “Well how else are they supposed to learn?” It’s like, I dunno lady, maybe volunteer yourself if it’s so important.",
                                            "score": 30,
                                            "author": "KaimeiJay"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "You have any links? I’m curious how someone who goes in for surgery and is anesthetized knows anything about what happened after they went out.",
                                    "score": 1,
                                    "author": "AULock1",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's a question for Google. Chuck \"non-consensual pelvic exam\" in and go for gold.\nOr do as I suggested above and go to r/twoxchromosome and search for the same to read first hand accounts.",
                                            "score": 1,
                                            "author": "Misabi"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "“Actually anyone on the healthcare field”\nSomeone posts a source with data given by healthcare students \n“Ughh! This must be fake because I’ve never personally knew about it!!” I hope you aren’t a doctor",
                            "score": 39,
                            "author": "BeingPrior7081"
                        },
                        {
                            "level": 2,
                            "comment": "No, they'll confirm it happens. You're just speaking impulsively.",
                            "score": 5,
                            "author": "Javamac8"
                        },
                        {
                            "level": 2,
                            "comment": "As a physician who went to med school 10+ years ago, I will say you are correct, and all this outrage is misguided as best, a manufactured feminist circlejerk to score clicks at worst. I distinctly recall at my institution these exams were *only* done for gynecologic procedures and only after the time out in which the circulator nurse verified the consent for \"exam under anesthesia.\" Yeah, it felt weird pushing my hand into an unconscious stranger's vagina. But it's standard practice for good reason, so you get over that.\n\nThe \"study\" surveying med students on whether they \"explicitly\" obtained consent is flawed because, as others have pointed out, *medical students don't obtain informed consent for anything, period.*\n\nEdit: Yes, there are awful anecdotal stories of someone waking up in stirrups after being sedated and not having consented to a pelvic exam, or worse. But anecdotes don't constitute a systemic problem.",
                            "score": -18,
                            "author": "HarbingerKing",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Why was it important to do the exam while the woman was unconscious? Why wouldn’t you have been trained to do the exam on a woman who was awake and aware?",
                                    "score": 11,
                                    "author": "BeckyLemmeSmashPlz",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Anesthesia doesn’t only make you go to sleep, it relaxes the muscles. Pelvic exams aren’t comfortable, and when you need to feel for structures, having a patient unconscious helps make the exam easier for you and less painful for the patient.",
                                            "score": 0,
                                            "author": "AULock1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I can agree with that for one pelvic exam, but if there’s 10 students practicing, it’s probably not going to be painless after the fact.",
                                                    "score": 7,
                                                    "author": "BeckyLemmeSmashPlz",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "10 students wouldn’t be allowed to be in the room, let alone scrubbed for the case. Most hospitals allow 1 scrubbed and 1 observing",
                                                            "score": 0,
                                                            "author": "AULock1",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "“Most hospitals” indicates it varies from institution to institution. Can you guarantee that there are no hospitals allowing multiple med students to perform a pelvic exam on the same patient dying a single encounter?",
                                                                    "score": 5,
                                                                    "author": "BeckyLemmeSmashPlz",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Of course not, this is a standard of practice not a hard and fast rule.",
                                                                            "score": 1,
                                                                            "author": "AULock1",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Why can’t there be both hard rules and standards of practice? Shouldn’t they inherently go together, especially when it comes to medical procedures on unconscious humans?",
                                                                                    "score": 4,
                                                                                    "author": "BeckyLemmeSmashPlz",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Great question! It's a different exam with a different purpose. We had paid instructors on whom we practiced speculum exams in the clinic setting to observe the internal and external anatomy, practice collecting swabs/brushing/scrapings for STD testing and pap smear, etc. They are awesome women who can give students real-time feedback on their technique. The bimanual exam under anesthesia in an OR before, say, a hysterectomy is part of surgical planning. You get a higher quality, more useful exam under anesthesia when everything is relaxed. An ob/gyn could give you a better explanation of why. But please be assured that medical students aren't just \"practicing\" on unconscious patients because it's more convenient than getting consent from awake patients.",
                                            "score": -3,
                                            "author": "HarbingerKing",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I think my main concern is that I’m more than happy for medical students to learn and observe, and I’ll gladly consent to that, however, I would not consent to multiple consecutive exams when not awake to give feedback. The last thing I need is excessive soreness or even tearing/damage compounding whatever treatment I was already requiring.\n\nFrom what I’ve seen, it’s not always specifically explained that multiple people will be repetitively performing a highly invasive examination. This, compounded with women generally not having their pain respected in medicine, leaves me very wary of consenting to a lot of things that are probably in good faith. I don’t know when I can trust that I will truly be heard and respected in medicine.\n\nI have had doctors dismiss my concerns, I’ve had doctors belittle the pain I was feeling, tell me that there’s nothing wrong and that the pain is normal, even when it severely compromised my ability to live and work normally. I would not trust those doctors to perform these highly invasive exams - since they do not consider my pain worthy of account.",
                                                    "score": 9,
                                                    "author": "BeckyLemmeSmashPlz",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Beautifully written explanation of a very common sentiment! Too bad it's wasted on the ___ who suggested the \"outrage\" may be nothing more than a \"feminist circlejerk to get clicks.\" Pretty much exemplifies the dismissive mentality that leads to and perpetuates these problems in the field.",
                                                            "score": 3,
                                                            "author": "Pandora_Palen"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Well I'm sure all those women who got pelvic exams without their consent were just mistaken, then. They must have accidentally asked for it.",
                                    "score": 15,
                                    "author": "Lallo-the-Long",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I'm not saying it never happens, but I haven't seen any compelling evidence that it's a systemic problem. The only real data I've seen is this [survey](https://onlinelibrary.wiley.com/doi/10.1002/hast.1349) in which 16 out of 1169 people reported an unconsented exam. But surveys are subject to response bias. My professional experience suggests this is not a widespread issue and rather the media, politicians, and reddit don't understand EUA or the informed consent process.",
                                            "score": -8,
                                            "author": "HarbingerKing",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "So i notice you edited your previous post to cast shade on anecdotal evidence... But you do realize that the only evidence you've given in support of your claim is... anecdotal, right?\n\nThe paper you linked is behind a paywall, so basically useless to the discussion.",
                                                    "score": 9,
                                                    "author": "Lallo-the-Long",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;manufactured feminist circlejerk\n\nI weep for the female patients of this blinkered misogynist shitheel",
                                    "score": 4,
                                    "author": "ImOnlyHereForTheCoC"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "How far backwards can US politics push back medicine due completely misguided understanding of medical ethics. All procedures need to be consented or you get sued.",
            "score": 107,
            "author": "Larry56NZ",
            "replies": [
                {
                    "level": 1,
                    "comment": "All the way back to when they had forced experimental treatments some time around 1930's and 1940's History repeats itself",
                    "score": 8,
                    "author": "Deltaloop4"
                },
                {
                    "level": 1,
                    "comment": "&gt; All procedures need to be consented or you get sued.\n\nThey are consented to, just not explicitly.\n\n*lmao at downvoting objective facts because it doesn't agree with your narrative or emotional response and upvoting idiotic replies that are total red herrings that misconstrue what was said. \n\nI need to remember to check what sub I am replying in just in case it's one like this that composed of members who mostly have a total of 3 brain cells.",
                    "score": -12,
                    "author": "Uhgfda",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The idea that lack of a refusal is the same as consent is baffling in this context, especially when so many people don’t even know about this policy",
                            "score": 38,
                            "author": "FlyingSpacefrog",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; The idea that lack of a refusal is the same as consent\n\nIt's not lack of refusal, the teaching hospitals admission paperwork that you sign contains the consent for the exam. What part of this do you not understand? \n\nIt does not say \"we are going to do a pelvic exam on you\" it says effectively \"you authorize students to be present and preform procedures and authorize examinations not medically necessary\"\n\nAKA\n\n&gt;They are consented to, just not explicitly.",
                                    "score": -8,
                                    "author": "Uhgfda",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There is no standard wording.",
                                            "score": 2,
                                            "author": "Pandora_Palen",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This exactly.",
                                            "score": -3,
                                            "author": "AULock1"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If the patients don’t know in advance it’s happening and it’s not for the patient’s benefit, there can be no consent and this is a violation of the Hippocratic oath, whether the doctors involved want to admit it or not.",
                            "score": 21,
                            "author": "deadliestcrotch",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt; there can be no consent \n\nWhen you go to a teaching hospital, you absolutely 100% do sign a consent for this. Again, the difference is it was not *explicitly* consented to.",
                                    "score": -10,
                                    "author": "Uhgfda",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "And the point of this argument is *what* exactly?",
                                            "score": 1,
                                            "author": "ArcticCircleSystem",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Even then not always. I definitely withdrew consent during my 40 week cervical check and the midwife just kept going and told me that if I thought that was bad I should wait for childbirth.",
                            "score": 2,
                            "author": "autisticprincess"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;Nonconsensual pelvic exams\n\nYou mean rape. It’s called rape.",
            "score": 10,
            "author": "Enlightened-Beaver",
            "replies": [
                {
                    "level": 1,
                    "comment": "That’s not how that works",
                    "score": -5,
                    "author": "Voice_of_Reason92",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Penetrating someone without their consent is literally how it works.",
                            "score": 4,
                            "author": "Enlightened-Beaver",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "They had consent though. The penetration would have to be in a sexual nature.",
                                    "score": -2,
                                    "author": "Voice_of_Reason92",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Did you even read the title of the post or read the article? It says NONCONSENSUAL in giant letters. The whole point of this is that they are raping women while they are unconscious **WITHOUT THEIR CONSENT**\n\nBoy you’re thicker than a bowl of oatmeal",
                                            "score": 3,
                                            "author": "Enlightened-Beaver",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Here in Belgium the same happens with males: when men are under sedation med students may practice prostate examination. They don't even ask the patient. \nBut as far as I know, nobody cares and the practice continues.",
            "score": 27,
            "author": "Translationerr0r",
            "replies": [
                {
                    "level": 1,
                    "comment": "Incredibly fucked",
                    "score": 14,
                    "author": "Dorocche",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Can you provide a source for information? Regardless of the language, I'll translate it myself",
                    "score": 2,
                    "author": "Elipetvi"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Seems like if these exams are so crucial to learning, the person providing the material for the \"lesson\" should be compensated at a rate commensurate with typical hospital pricing. If that's not agreeable, perhaps the students should be required to volunteer their own bodies for study.",
            "score": 221,
            "author": "Pandora_Palen",
            "replies": [
                {
                    "level": 1,
                    "comment": "There’s literally an entire group of people that get paid to allow medical students to examine their genitalia",
                    "score": 39,
                    "author": "echtav",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They make pretty decent money, too! But maybe that's the problem...why pay $40/hr for something that you can help yourself to for free?",
                            "score": 20,
                            "author": "Pandora_Palen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Because as a student paying $200k+ tuition, it’s the LEAST their university can shell out some money for",
                                    "score": 17,
                                    "author": "echtav",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Absolutely. And I didn't mean to detract from the moral and ethical dilemma the students are in when they know they don't have consent. I mean, what do you do? Say, \"hey, uh, isn't this betraying patient trust here, though?\" Great way to draw attention to yourself as a problem child just to get a shoulder shrug and a \"nah. It's legal and it's not like they'll know. It's how you learn *meaningful stare*\"",
                                            "score": 8,
                                            "author": "Pandora_Palen"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "In the early 1960s my grandma and all other women in her class were required to submit to a \"physical exam\" at Fort Collins Hospital in order to be a nurse studying there. She and all her other classmates were given pelvic exams from the brand new doctors without forewarning. The kid inserted the speculum so roughly she bled, and then he needed encouragement from the senior doctor because he looked like he wanted to faint or quit. \n\n\nRequiring students to volunteer their bodies so they can be a student is a special flavor of fucked-up and I don't think you wanna go there.",
                    "score": 56,
                    "author": "ilovemybrownies",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And that's yet another disgusting example of societal norms we need to move away from. \n\nAll these people raging about the suggestion that if the medical field is going to push for the continuation of this practice, it should keep it in house rather than subject the unwitting public to it. SMH. \n\nNo, it's NOT a special flavor of fucked up. It's exactly the SAME flavor of fucked up. My point was that if it's abhorrent to pony up your own people for this \"learning experience\", it's *no less* abhorrent to take advantage of your patients.",
                            "score": 4,
                            "author": "Pandora_Palen"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No. Do not make prospective doctors have to get pelvic exams from their peers. This is an awful, humiliating idea. \n\nThere's no reason this can't be a consensual thing, or done on a prosthetic.",
                    "score": 288,
                    "author": "Stock_Rush2555",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It could be done with consent and the doctors training them could also be able to volunteer, but I suspect there would be few willing to step up, which calls into question whether it's appropriate to ask that of patients. And, particularly, to not ask and just do it when they're unconscious.",
                            "score": 149,
                            "author": "Spire_Citron"
                        },
                        {
                            "level": 2,
                            "comment": "Why is it awful and humiliating? Are you insinuating there's something inherently shameful involved in pelvic exams? Something sexual? Should doctors feel there is something shameful or sexual in it? Why would their own bodies and emotional comfort *and rights* be sacrosanct while patients' bodies and rights are open for violation? IDGAF about the comfort of those in the med field who dgaf about me. \n\nYou're right- there is no reason it can't be consensual. Yet last I heard even Yale Med was fighting laws requiring that consent. And according to those in the field, prosthetics don't do the trick. \n\nI'd sign off on it if they paid me for the use of my body- hell, offer to write off my patient responsibility amt on the bill for whatever procedure I'm in for. But hospitals RARELY do any favors, so expecting they can *take* a freebie from me without my knowledge or consent? That's assault, and they choose that path every day.\n\nETA- if this sounds harsh, it's because it pisses me off. And it should piss off everybody- not just women, but men because they're victims of invasive exams as well. \n\nSince the article is paywalled..\n\n[here](https://www.pbs.org/newshour/show/why-more-states-are-requiring-consent-for-pelvic-exams-on-unconscious-patients)\n\n[here](https://www.nytimes.com/2020/02/17/health/pelvic-medical-exam-unconscious.html)\n\n[here](https://www.kshb.com/news/local-news/investigations/without-consent-pelvic-exams-under-anesthesia-still-happen-without-patient-knowledge)",
                            "score": 108,
                            "author": "Pandora_Palen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Does this need to be explained to you? Would you want your coworkers and classmates in your vagina? People you need to work alongside everyday?\n\nIt’s a lopsided arrangement. Only female students would receive pelvic exams from their peers, both male and female. It would be difficult to be certain of consent—what if women feel pressured to accept exams from their colleagues because their academics are at stake? What if they think they can’t say no without risking their studies? You’re trading one avenue through which women are taken advantage of for another. “IDGAF if they do it to other women, as long as they don’t do it to me!” The goal should be to ensure no women are put in that position. The easiest way to do that is to find willing volunteers.",
                                    "score": 67,
                                    "author": "zumera",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think that's what they're saying. A lot of the issues with doing it on medical students also exist when using patients, so they should instead pay people who have decided they're comfortable with having their bodies examined for learning purposes.",
                                            "score": 170,
                                            "author": "Spire_Citron",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thank you. If I go in for surgery, I don't want to upset my surgeon or their team. I've had so much medical trauma I'd be absolutely terrified to say no to them. I've gotten mistreated just for declining to consent to far less important procedures or treatment. There's no way I would feel safe enough to say no to the people I'm about to entrust my unconscious body to.\n\nEnormous power imbalance there.",
                                                    "score": 60,
                                                    "author": "KiloJools",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Yeah. For whatever reason, some people just aren't good at saying no to things, and when they're a virtual stranger to you that's not going to be something you know about them. I know that there have been occasions when I've had doctors and psychiatrists appointments and I've been asked if I was okay with a student sitting in, I've always said yes even though honestly I would have preferred they didn't and it made me feel less comfortable. Asking at all is the bare minimum, but ideally for something as intimate as that it just shouldn't be something requested of random patients at all.",
                                                            "score": 23,
                                                            "author": "Spire_Citron"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I get we all agree consent is best. But it almost sounds like you would defend the practice of using women’s bodies like that to protect the med students dignity? (Assuming no other volunteers could be found)\n\nIs that right interpretation?",
                                            "score": 49,
                                            "author": "MoistManagement4655",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I can't see anywhere that's implied by their messages\n\n&gt; You’re trading one avenue through which women are taken advantage of for another. “IDGAF if they do it to other women, as long as they don’t do it to me!” The goal should be to ensure no women are put in that position. The easiest way to do that is to find willing volunteers.",
                                                    "score": 8,
                                                    "author": "Raxsah"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "The point is that if they wouldn't volunteer for it, they shouldn't assault their patients either.",
                                            "score": 9,
                                            "author": "itsstillmagic"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "&gt;Does this need to be explained to you?\n\nOof, the snark and condescension. Climb off the high horse. \n\nNo, I wouldn't want my classmates in my vagina any more than I'd want 5 students shoving their hands in there without my knowledge nor my consent. No, wait. Actually, were I a med student, the expectation would be that my classmates are able to separate sex from medicine. So maybe I wouldn't have such a huge issue with it. Still wouldn't think it was right, though...\n\n*UNLESS IT'S WITH CONSENT AND FREE FROM UNDUE PRESSURE* \n\nand if patients aren't granted that, why should those in the field who are forcing this on people be immune to the same treatment? Am I actually suggesting that making them volunteer (like they make patients volunteer) is an actual defensible position? No, of course not. I'm saying that if the shoe were on the other foot, it wouldn't be so comfortable. The patients are the victims here, as well as the students put in the position of doing something they know is clearly a violation of ethics. When I say \"how would you like it if you had to volunteer your vagina or asshole for study\" I stand by my point. You do realize it's not just women, right? It happens to men, too. Any male med students want their classmates probing them? Bet not. \n\nRegardless, this change needs to come from within. Why is progress so slow banning this everywhere? Because those in the medical field push back. You seem to think that all it takes is soliciting volunteers for medical professionals to stop violating patient rights, yet here we are having to fight *the medical field* to merely get them to *ask for consent*. Please explain to me why that is. Why aren't they using volunteers or providing patients with the option to opt out already? \"The easiest thing to do ...\" Yeah. Easy for us to say, apparently too inconvenient for them to do. \n\n&gt;The goal should be to ensure no women are put in that position. The easiest way to do that is to find willing volunteers.\n\nAdd men to that, and I have not said anything but this in any comment.",
                                            "score": 48,
                                            "author": "Pandora_Palen",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt; UNLESS IT'S WITH CONSENT AND FREE FROM UNDUE PRESSURE\n\nWhich isn't possible as a student when you're part of the course.\n\nAs a patient, you're free to grant or revoke consent, since you are not depending on the course to succeed.\n\ndoing it without consent is never acceptable.",
                                                    "score": 18,
                                                    "author": "alexanderpas",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The thing is, many people have a fawn trauma response so WHEN you get consent is incredibly important too. I hate there \"get btw, can this random dude who is right here and needs this for his schooling, look up your junk right now? It's just that if nobody lets him do it, he can't be a doctor... You wouldn't want to run his life would you?\" Add yes, I know that's not exactly how they ask but it feels like that sometimes and doctors need to understand the power dynamic they have in the exam room.",
                                                            "score": 7,
                                                            "author": "itsstillmagic"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Totally agree with this, but it's based on a hypothetical (and I never meant for it to be taken as \"good practice\"- I was being facetious... mostly). This *hypothetical* situation is unfair. In the *actual* situation that the hypothetical is based on, the issue is that the patient is *not* \"free to grant or revoke consent.\" Neither patients nor students should be subjected to this.",
                                                            "score": 17,
                                                            "author": "Pandora_Palen"
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Exchange for the prostate exam, win-win.",
                                            "score": 2,
                                            "author": "garagos30"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Last I checked, only males have a prostate, so that evens out.\n\nAnd if you think it’s too weird to do it between students, that’s only your belief. In other fields students practice on each other, like physiotherapists, art studies… and that require seeing people nude and/or touching them.\n\nAlso, if you think about it for a second, you can be sure that a fellow student would be extra careful touching you, because you will be touching them later. And I doubt anyone involved would find it funny or arousing, med students are adults, not little kids.",
                                            "score": 1,
                                            "author": "Divinicus1st"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "obviously giving each other pelvic exams makes the most sense, absent patients volunteering.",
                    "score": -14,
                    "author": "mirddes",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "No. Do not make prospective women doctors have to get pelvic exams from their peers. This is an awful, humiliating idea. Post secondary already has enough sexual harassment as is.",
                            "score": 47,
                            "author": "Stock_Rush2555",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But it’s okay to expose patients to? \nFuck off.",
                                    "score": 12,
                                    "author": "madsd12",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "In no way was that implied",
                                            "score": 7,
                                            "author": "Land_Squid_1234"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "i typed this with women giving women pelvic exams in mind.\n\nthen again, at no point did i advocate mandating it.\n\nplenty of volunteers waiting to be asked.",
                                    "score": 2,
                                    "author": "mirddes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt;plenty of volunteers waiting to be asked.\n\nThis is it exactly. I'd want to be paid, but if they asked nicely I'd probably say, \"oh, fine. Go ahead.\" And I'm sure lots of women would agree if asked. Unbelievable they so willingly ignore basic ethics.",
                                            "score": 28,
                                            "author": "Pandora_Palen"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "First idea, okay. Second idea absolutely awful. I bet hospitals would love that though. They'll subject their students and staff to any variety of humiliating conditions if it means they can save some cash.",
                    "score": 1,
                    "author": "secrets9876",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It wasn't meant as a serious suggestion, though. It was meant as a point to be taken into consideration, along the lines of \"do unto others as you'd have done unto you.\" I'm not a religious person, but I do believe this is a pretty good tenet to live by. And I think it's especially good when talking about medical care.",
                            "score": 2,
                            "author": "Pandora_Palen"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just watching episode 4 or 5 of fleischman is in trouble where [the doctor intentionally ruptures Rachel's membrane without her consent](/spoiler) which was appauling",
            "score": 6,
            "author": "Chasedabigbase"
        },
        {
            "level": 0,
            "comment": " I' know of when a whole team of med students (~9) ran a pelvix exam train on a patient under anesthesia. I really really got awful feelings in my belly when I heard about this.",
            "score": 4,
            "author": "averkill"
        },
        {
            "level": 0,
            "comment": "4 years of medical school and I’ve literally never heard of a single person doing this. Seems like a problem of the past.\n\nEDIT: After reading follow up articles in the comments, it seems people are simply understanding how medicine works. Let’s start with the facts:\n\n1: if you come in for an appendectomy or heart surgery, literally no one will be going near your vagina. Not the doctor, not the med student, no one. It’s not only a breach of medical ethics, it’s literally battery and everyone in the room would be liable. \n\n2: if you come in for a gynecological procedure, you will be given a consent form. Somewhere on that form will be a list of procedures to be performed, and somewhere on that list will be “pelvic exam under anesthesia or …. And all other medically indicated procedures”. \n\nWhen you sign that, you have now consented to the pelvic exam. You don’t explicitly consent to WHO performs the pelvic exam. You are entitled to ensure that only the attending performs it, but the doctor does not need to obtain consent for each and every person in the room. \n\nMost of these articles are written from the perspective of either a medical student who doesn’t understand how surgical consent works (not surprising, most medical students are not allowed to consent patients) or from a patient who doesn’t understand what is and isn’t medically indicated.",
            "score": -11,
            "author": "AULock1",
            "replies": [
                {
                    "level": 1,
                    "comment": "I would add an asterisk saying “no one goes near your vagina (or penis)” because placing a foley is common for longer procedures. It’s totally appropriate though.",
                    "score": 2,
                    "author": "greatbrono7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Sorry, you’re correct, nurses place foley’s and I forgot about that",
                            "score": 2,
                            "author": "AULock1"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Could someone please link to some sources or evidence to support the premise that this practice still occurs with any regularity in the U.S.?\n\nAll I've ever heard of this issue, as far as data goes, is rumor. Even the ethics professor quoted in the article has no data. She merely says people \"tell her at conferences\" that it still happens.\n\nI'm not arguing that there aren't isolated cases. There are isolated cases of everything. But the idea that physicians, med students, and nurses would regularly risk their careers and even criminal prosecution just for the convenience of performing a mundane exam that they could easily get consent for is a pretty extraordinary claim that requires strong evidence.",
            "score": -27,
            "author": "night-shark",
            "replies": [
                {
                    "level": 1,
                    "comment": "[I've already posted a bunch of links, but here](https://www.vice.com/en/article/43j59n/medical-students-allowed-to-do-pelvic-exams-on-unconscious-patients-without-consent)\n\n[why so many bills if it's \"urban legend\"?](https://www.boston.com/news/local-news/2019/05/12/bills-seek-special-consent-for-pelvic-exams-under-anesthesia/)\n\n[some more legislation proposed by pa reps](https://www.penncapital-star.com/commentary/its-time-to-end-pas-end-outrageous-practice-of-non-consensual-unnecessary-pelvic-exams-opinion/)\n\nScroll up, there are more links.\n\n\nETA- quit being so damn lazy. There are links all over the thread and you're already online- do your own research before spouting off opinions.",
                    "score": 36,
                    "author": "Pandora_Palen"
                },
                {
                    "level": 1,
                    "comment": "Were you able to read the article without signing up? I'm just curious because another user said the website wanted people to create an account which is not what happened to me.",
                    "score": 8,
                    "author": "Sandstorm400",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It requires registration for me",
                            "score": 1,
                            "author": "HopliteOracle"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6882529/",
                    "score": 12,
                    "author": "alexanderpas"
                },
                {
                    "level": 1,
                    "comment": "&gt; prosecution \n\n\nThis is the issue; there needs to be legislation to make non-consensual pelvic exams illegal/prosecutable.",
                    "score": 3,
                    "author": "aloudkiwi"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Can someone explain exactly what's going on here? (The article is behind a \"paywall.\")\n\nLike, how are these exams nonconsensual? People obviously knew they were going under. They obviously knew they were going to have an exam, likely one around the pelvic area?\n\nI'm just really confused as to how these are nonconsensual?\n\nEDIT: And obviously the answer is not to have \"students do it on each other.\" Yeah, no. Absolutely not. Many people are only ok with pelvic exams because they otherwise never see that doctor in public. Imagine having to see someone every single day who has given you a pelvic exam. This would be hard for any person, let alone young adults. And obviously there is the whole thing of \"do I have to do this to pass?\"",
            "score": -42,
            "author": "corrado33",
            "replies": [
                {
                    "level": 1,
                    "comment": "The thing is that no, they didn't know. They were using unconscious women to train medical students to do pelvic exams when the women were under for operations that had nothing to do with that area of their body and they weren't asking for consent first or even informing them afterwards. This was legal in many states.",
                    "score": 106,
                    "author": "Spire_Citron",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That seems like rape to me.",
                            "score": 71,
                            "author": "thisisjanedoe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That would require raping",
                                    "score": -2,
                                    "author": "Voice_of_Reason92",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Putting foreign objects into a woman’s vagina without her consent is rape.",
                                            "score": 5,
                                            "author": "thisisjanedoe",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Still is legal in many states. 😞",
                            "score": 31,
                            "author": "Pandora_Palen"
                        },
                        {
                            "level": 2,
                            "comment": "They had consent, not explicit consent",
                            "score": 1,
                            "author": "Voice_of_Reason92"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "You could go for an operation to have a cyst removed from your neck and while you're under anesthesia, 5 med students could be poking around giving you an invasive pelvic exam as a learning activity. You would never know this happened and they didn't need your consent. \n\n[this](https://www.healthywomen.org/your-care/pelvic-exams-unconscious-women)\n\n[or here ](https://www.pbs.org/newshour/show/why-more-states-are-requiring-consent-for-pelvic-exams-on-unconscious-patients)\n\n[or here](https://www.nytimes.com/2020/02/17/health/pelvic-medical-exam-unconscious.html)",
                    "score": 87,
                    "author": "Pandora_Palen"
                },
                {
                    "level": 1,
                    "comment": "The article is behind a paywall???  It wasn't doing that to me.  Is anyone else getting a paywall?",
                    "score": 7,
                    "author": "Sandstorm400",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It requires a free registration. Maybe you're already registered and logged in?",
                            "score": 3,
                            "author": "Gas_Station_Cheese",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Weird!  I have never registered but I am logged into Google.  I wonder if it is somehow using my Google login.  I am sorry about this. I wish I could find another link to this story.  Here is similar recent article on the subject if you want to read it: [https://www.kshb.com/news/local-news/investigations/conversation-surrounding-non-consensual-pelvic-exams-continues-in-kansas-city](https://www.kshb.com/news/local-news/investigations/conversation-surrounding-non-consensual-pelvic-exams-continues-in-kansas-city)",
                                    "score": 8,
                                    "author": "Sandstorm400",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No need to apologize. You provided enough info in the title and subsequent posts that if people don't want to register (and I can understand that), they have enough info to Google the issue on their own. This is a horrifying practice that I had never heard of before. Thank you for bringing it up.",
                                            "score": 1,
                                            "author": "Gas_Station_Cheese",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thanks for the kind post!",
                                                    "score": 2,
                                                    "author": "Sandstorm400"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It doesn’t have to be weird. We went to church with my wife’s gynecologist. Our daughters were friends and we occasionally went out with them socially. \n\nMaybe that makes us odd, but I know other women were his patients and went to the same church and saw him at all the same school functions. \n\nNot that anyone should feel coerced to do it, either. I don’t have a social connection to my urologist or his NP, but wouldn’t feel weird seeing them regularly.\n\nLike I said, we might be outliers.",
                    "score": -9,
                    "author": "phantomoftherodeo"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I will add  after going through my surgery recently I’m not sure if this is a good thing.. \n\nYou want your Dr.s To be MORE trained not less… Cause they fuck up a lot!\n\nAlso just from my reading of the article it seems like surgeons do this to everyone not just women.",
            "score": -8,
            "author": "Pane502"
        },
        {
            "level": 0,
            "comment": "Well, TIL this is a thing ![gif](emote|free_emotes_pack|disapproval)",
            "score": 1,
            "author": "Fritzo2162"
        },
        {
            "level": 0,
            "comment": "I wonder if anesthetized male patients are used practice prostate exams or are used to train medical personnel how to catheterize a penis?  How would they feel about that without consent?",
            "score": 1,
            "author": "Saloau"
        },
        {
            "level": 0,
            "comment": "???? I have never had any med student not ask for my consent to take a gander at me. They're sometimes a little shy about it for some reason lol\n\nHow does that happen? Are you just legs out and *then suddenly-* med student? Is that what happens? How do people not go \"ap-ap-ap! Who tf is that??? Get them *out*!\" Or is the issue that they're not allowed to tell them to get out?",
            "score": -53,
            "author": "Donequis",
            "replies": [
                {
                    "level": 1,
                    "comment": "The women are unconscious from anesthesia when it happens. A woman could be going in for jaw surgery and the doc gives her a pelvic exam while she's under.",
                    "score": 78,
                    "author": "walking_on_the_sun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "*eeeeewwwwww* omfg okay, yeah, no, disgusting doesn't even begin to describe that!! How is a med student at all comfortable with that???? Do the students not know how they got their \"volunteer\"?",
                            "score": 34,
                            "author": "Donequis",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The students generally are not comfortable with it, from what I've read.",
                                    "score": 20,
                                    "author": "Pandora_Palen",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Good, thank you for being willing to pass that information along for me, I really appreciate it ❤️",
                                            "score": 4,
                                            "author": "Donequis"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It's mostly urban legend. No doubt there are isolated cases but this isn't happening with any kind of regularity in the U.S. Performing this without consent would be CAREER ENDING for anyone involved, if it were found out. All for what? A routine procedure that they EASILY could have done with a consenting patient?\n\nAsk your friends or family who work in healthcare whether this happens.  \n\n\nEDIT: Downvote all you want but if I'm so wrong, you should be able to present some evidence that this is in fact happening with regularity.",
                                    "score": -42,
                                    "author": "night-shark",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[You’ve already been given evidence.](https://www.reddit.com/r/UpliftingNews/comments/12ondn0/more_states_nix_nonconsensual_pelvic_exams_by_med/jgkkmsj/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=ioscss&amp;utm_content=1&amp;utm_term=1&amp;context=3)",
                                            "score": 23,
                                            "author": "ChickenInASuit"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6882529/",
                                            "score": 23,
                                            "author": "alexanderpas"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Edit: got more time, did more research. It is a thing and deplorable. Some philosophers were debating if it's assault, there's no debate. You can't examine someone if they don't consent to that exact procedure/exam. I don't know why that is even a question. Walking back my previous comment as I only found people discussion the consent related to students performing a consenting exam that did specify the person doing it was a student, which I also disagree with.",
                                    "score": -22,
                                    "author": "Publick2008",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's not the issue. If you haven't seen documentation of what's being discussed here, feel free to do some research.",
                                            "score": 16,
                                            "author": "Pandora_Palen",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Sorry to have been so cranky with you earlier. I kept posting links yet people kept asking me for a link and I got to that \"oh, ffs! No more!\" stage and kinda took it out on you. Apologies. Thanks for taking the time rather than letting my curmudgeonliness put you off it entirely. \n\nI'm glad you were able to flesh it out, unexpected and ugly as the truth is. At the very least, the knowledge gives us the power to very clearly and explicitly *reject* any extraneous procedures.",
                                            "score": 1,
                                            "author": "Pandora_Palen",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Totally. I am so shocked there is a debate about this among the medical philosophy field. It's very clearly sexual assault.",
                                                    "score": 1,
                                                    "author": "Publick2008"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Could but doesn't. Ask anyone who is actually in healthcare about this and they will tell you not only does it not happen but that no one would hesitate one fraction of a second before reporting it.\n\nNo doubt there are on-offs. There are doctors who sexually assault their patients. But as a \"practice\", this shit doesn't happen anymore in U.S. hospitals.",
                            "score": -21,
                            "author": "night-shark",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Can and does. 90% of students have been involved, 60% knew they didn't have consent.",
                                    "score": 17,
                                    "author": "Pandora_Palen",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So, share your source. Show us the evidence.  \n\n\nEDIT: Are you fucking listening to yourself?! NINETY PERCENT of med students have been involved? LOL. Do you find making up wild and unbelievable figures works for you in other contexts?",
                                            "score": -10,
                                            "author": "night-shark",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[A recent survey of 101 medical students from seven American medical schools found that 92% had performed a pelvic exam on anesthetized female patients, 61% of whom reported not having explicit consent from the patients.](https://www.healthywomen.org/your-care/pelvic-exams-unconscious-women)\n\nI've submitted a mass of links. What have you got, other than disbelief based on uneducated opinion? Did you somehow miss the post itself? Or do you feel it was from a source that's not credible? Just fear-mongering? 🤡",
                                                    "score": 27,
                                                    "author": "Pandora_Palen",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "That means 60% were involved, not 90%. The lack of consent is the issue, not the anaesthetic, unless you're saying no woman is *ever* asked for consent. \n\nNot trying to downplay it, that's obviously fucked. It's still a majority, and it's mass sexual assault.\n\nEdit: Is that wrong or misleading?",
                                                            "score": -4,
                                                            "author": "Dorocche"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Pandora Palen shared her source of those numbers in another response to you. [I'll relink it here](https://www.elle.com/life-love/a28125604/nonconsensual-pelvic-exams-teaching-hospitals/) in case you've missed it. Here's the direct quote:\n\n&gt; Ninety-two percent reported performing a pelvic exam on an anesthetized female patient. Of that group, 61 percent reported performing this procedure without explicit patient consent.\n\nThat's one isolated survey of 101 medical students from various schools. PBS stated it was [\"the non-consensual exams are still allowed in 29 states\"](https://www.pbs.org/newshour/show/why-more-states-are-requiring-consent-for-pelvic-exams-on-unconscious-patients) in February of this year.\n\nAccording to [NY Times](https://www.nytimes.com/2020/02/17/health/pelvic-medical-exam-unconscious.html), a doctor \"surveyed 401 students at five Pennsylvania medical schools and found that 90 percent had performed pelvic exams on anesthetized patients.\" In the same article is this quote: \"Ryan O’Keefe, a fourth-year medical student in Pennsylvania, [said] they were told to check the consent forms that patients signed before the operation, although he said he 'would not be surprised if now and then people didn’t check.'\"",
                                                    "score": 13,
                                                    "author": "Evan_the_Canadian"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The option to say \n\n&gt;ap-ap-ap! Who tf is that??? Get them out!\"\n\n*should* exist, but in many states it's perfectly ok to drag 5 med students in for a lesson in pelvic or prostate exams while you're unconscious. 5 pairs of hands all up in there while you're unconscious, without a please nor thank you. Just a secret rendezvous with your bits. 90+% of med students have been there, 60+% knew they did not have consent.",
                    "score": 15,
                    "author": "Pandora_Palen",
                    "replies": []
                }
            ]
        }
    ]
}