{
    "id": "131uj3k",
    "score": 6013,
    "title": "Washington passes law requiring consent before companies collect health data",
    "author": "Lootcifer-",
    "date": 1682692935.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/131uj3k",
    "media_urls": [
        "https://www.theverge.com/2023/4/28/23702246/washington-health-data-law-consent-collect-sell"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Washington STATE, just in case anyone doesn’t read the article and assumes this was a federal thing. I’m curious if other states have similar laws in the works.",
            "score": 437,
            "author": "AZ1476",
            "replies": [
                {
                    "level": 1,
                    "comment": "As a Washingtonian, I just want to remind folks that there was debate in Congress when the time came to name the northern section of the former Oregon Territory.\n\nCongressman [Joseph Lane](https://en.wikipedia.org/wiki/Joseph_Lane), who actually represented Oregon Territory, proposed the name \"**Columbia\"** but the super-smart Kentucky Representative [Richard Stanton](https://en.wikipedia.org/wiki/Richard_H._Stanton), argued that people would confuse it with **District of Columbia.**\n\nWe are the only state in the country that has to write \"state\" after our name so people don't get confused - all because **Richard Stanton was a fucking idiot.**",
                    "score": 205,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Richard Stanton: \"let's not name the state Columbia. People will confuse that with the Washington District of Columbia.\n\nCongress: \"What should we name it then?\"\n\nRichard Stanton: \"How about Washington? Surely nobody will get that mixed up with the Washington District of Columbia\"",
                            "score": 116,
                            "author": "rockingmonkey",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If they’d named it “Columbia”, it would also be mistaken for the Province of British Columbia just across the border.",
                                    "score": 35,
                                    "author": "wolfie379",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No it wouldn't lol, everyone calls British Columbia \"B.C.\"",
                                            "score": 22,
                                            "author": "gregdrunk",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And ours could have been A.C.!",
                                                    "score": 13,
                                                    "author": "i_sigh_less"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Too bad one of the Washingtons in this country didn't have an easy to use and popular acronym people could just take up! Lol",
                                                    "score": 2,
                                                    "author": "spartaxwarrior"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I suspect we'd have been confused with Columbia, the country. Ever tried talking about the country of Georgia? Yeah... that problem.",
                                            "score": 2,
                                            "author": "keplar"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I mean, New York usually has a clarifier of whether its the city or state because the city is so absurdly famous.",
                            "score": 16,
                            "author": "Flames99Fuse"
                        },
                        {
                            "level": 2,
                            "comment": "I’d be up for a name change. (And a flag that doesn’t look like a dollar bill.) It is confusing as heck. \n\nNot “Columbia” though. Theres already a Colombia and we don’t need to immediately switch to another confusing name situation.",
                            "score": 49,
                            "author": "PrincessNakeyDance",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Cascadia 🌲",
                                    "score": 79,
                                    "author": "animatroniczombie",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Its the only name we could change it to and have most of us agree with it.",
                                            "score": 3,
                                            "author": "impulsiveclick"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "How about John Smith? That sounds unique.",
                                    "score": 10,
                                    "author": "Theletterkay",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "State fruit:  the pear",
                                            "score": 7,
                                            "author": "Talon6230"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Plus George Washington--on the state flag--has never set foot in the state from what I can find. We also have a town called Des Moines which is literally named after Des Moines Iowa because the guy who founded it was from there.",
                            "score": 7,
                            "author": "Erilis000",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Considering that the first European didn't set foot in the area until 1775, President Washington definitely never was out here.\n\nGeorge W. Bush did though.. just not that *one*. \n\n**George Washington Bush**, a free Black man from Missouri, led the first group of settlers to the territory in 1844 intending originally on settling in Oregon. However Oregon barred African-Americans from settling there so his party instead when north to Puget Sound.\n\nHe would go on to found the first permanent American settlement of the future state at Tumwater in 1845.",
                                    "score": 14,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Sounds like it should have been his face on the flag!",
                                            "score": 7,
                                            "author": "Erilis000"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "In Oregon there are several areas named after places on the East coast for this reason",
                                    "score": 2,
                                    "author": "empathyisdying"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "God politicians have always been dumb as fuck, huh.",
                            "score": 6,
                            "author": "ImaFrakkinNinja"
                        },
                        {
                            "level": 2,
                            "comment": "Meanwhile, directly above you.....British Columbia ;-)",
                            "score": 5,
                            "author": "SilverNicktail"
                        },
                        {
                            "level": 2,
                            "comment": "Georgia does too, lest it be confused with the country",
                            "score": 4,
                            "author": "IHateNumbers234",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "My bio-dad and several siblings live in Georgia. Have literally never heard them say \"Georgia state\" or \"state of Georgia\" in normal conversation. \n\nAnd to make the point, you didn't either. lol. But sure, i am sure it occurs occasionally.",
                                    "score": 8,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Well if they're talking to you, there's no reason to specify. But if you introduce yourself to someone from Europe, especially online, there is a big chance of confusion if you don't specify Georgia, US.",
                                            "score": 5,
                                            "author": "IHateNumbers234",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "WA also has that problem with western Australia using the WA abbreviation too. I typically use WA instead of Washington to make it clear its not DC so I don't need to type out Washington State all of the time.",
                                                    "score": 3,
                                                    "author": "WomenAreFemaleWhat"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Was born there, Western Washington feels super progress and inclusive.\n\nLived in the bay area and was surprised to find Seattle felt more liberal than SF. \n\nIn Sac area now and it's a bummer to see so much maga and hate in a west coast state",
                    "score": 21,
                    "author": "Imkindaalrightiguess",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Don’t cross the cascades to the east side of Washington lmao",
                            "score": 14,
                            "author": "ImaFrakkinNinja",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I don't think Moses really parted that lake",
                                    "score": 5,
                                    "author": "Imkindaalrightiguess",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "*thinks of that school shooting*",
                                            "score": 3,
                                            "author": "impulsiveclick"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Washington should have been named something else entirely like Chinookland",
                    "score": 6,
                    "author": "SnooDonuts7510"
                },
                {
                    "level": 1,
                    "comment": "I would assume all do but i’m sure i’ll be dissapointed by the actual answer 🏥🩺🏥🩺🏥🩺",
                    "score": 2,
                    "author": "Porkchopp33"
                },
                {
                    "level": 1,
                    "comment": "the question is, will companies even follow that rule. I mean the government has been trying to get facebook to change how it collects data and facebook is like: \"yeah, no worries I'll get to it, it's on the the 'to-do' list, just gotta scratch off control the world first.\"",
                    "score": 2,
                    "author": "dgj212"
                },
                {
                    "level": 1,
                    "comment": "Why can't we say DC and Washington?",
                    "score": 1,
                    "author": "MissMouthy1"
                },
                {
                    "level": 1,
                    "comment": "If you would all call it DC like you should, it wouldn't even come up. Theres an easy way to distinguish them but the rest of the country can't be bothered.",
                    "score": 1,
                    "author": "WomenAreFemaleWhat"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Sigh, this highlights the issues with these types of things being \"states rights\" issues.\n\nFacebook: can we have all your data and sell it to third parties without informing you?\n\nEU: Fuck You, GDPR!\n\nStates: Well that depends, what county do you live in? What subdivision?",
            "score": 108,
            "author": "SneeKeeFahk",
            "replies": [
                {
                    "level": 1,
                    "comment": "On the other hand, our federal government has shown no desire to give us those protections. Rather have something than nothing at all",
                    "score": 48,
                    "author": "scrappybasket",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Fair enough but now the company _needs_ to know where you live in order to effectively follow the law. So while this helps those living in the area, it has much more significant implications and causes many more problems than it solves. I'm in favor of the ruling just not the limited scope.",
                            "score": 14,
                            "author": "SneeKeeFahk",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not quite, because a website can be accessed from anywhere and the person accessing has no obligation to give their location. It's why people in the US get cookie popups that were enforced by the EU.",
                                    "score": 12,
                                    "author": "Urgettingfat",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What I mean is they will ask everyone and collect that data. \n\nSure, not everyone will provide it but a lot will just close the stupid popup. Then the site/app only does the \"responsible\" thing with the data of residents in Washington that opted out and do what they please with all the other users data. \n\nI'll admit this is a bit of a strawman argument but I don't think it's very far fetched.",
                                            "score": 4,
                                            "author": "SneeKeeFahk",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Everybody says everything is far-fetched until it actually happens. Have we noticed that? Please don’t ask for examples just think about them think about what’s happening in the world right now all of the fun things that are happening.",
                                                    "score": 2,
                                                    "author": "moonraven33",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "gotta feed it fake data, most people don't care about the data collection because they are not aware of what tech is capable of.",
                                                            "score": 1,
                                                            "author": "Urgettingfat"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Washington went after Facebook for their advertising",
                    "score": 1,
                    "author": "impulsiveclick",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I love our AG. Hes probably my favorite politician in general. Hes always tackling some bs and often wins. Sometimes the awards are less than ideal but I like that he draws attention to problems. He sued trump a shitton and won almost every case.",
                            "score": 2,
                            "author": "WomenAreFemaleWhat"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "EU: but you can still ask everytime the page opens and make a hugh list you need to check over\n\nTIFIFU",
                    "score": 0,
                    "author": "imadethisaccountso"
                }
            ]
        },
        {
            "level": 0,
            "comment": "*we've updated our terms and conditions*",
            "score": 35,
            "author": "pistcow"
        },
        {
            "level": 0,
            "comment": "Honestly, I just think requiring consent on all data collecting should be the norm/requirement. I don't mind data collecting as long as I can opt out, as I consider it the price I pay to use the service. Not too much different then a grocery store using security cam data to track shopping patterns, except with digital data collection I'm actually getting something for the price of my data.\n\nI have no expectation of privacy when I'm at the grocery store, and going to a public website really isn't much different. I'm leaving my \"private,\" computer, and going out onto the \"public,\" web.\n\nProblem is, even with things you can opt out of, most people these days never even open their settings and/or know their data is being collected in the first place. It *needs* to be the requirement that I need to specifically opt-in, up front, before the app even runs.",
            "score": 27,
            "author": "zachtheperson",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Honestly, I just think requiring consent on all data collecting should be the norm/requirement. \n\nI agree but unfortunately all this means is that companies will deny service to you if you don't consent to it (which is their right, to be fair). \n\nCompanies started doing this when places like the EU passed their anti-data collecting stuff; they just stopped providing the service to the EU. \n\nSo you'd be SOL getting anything done online",
                    "score": 10,
                    "author": "Gh0stMan0nThird",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "But at least they'd be forced to tell me, and more importantly less techy people who don't ever think about it. I can't think of anything I do online that I would really care about a company finding out about anyways, but knowing what's being collected would allow me to modify my behavior (or not use the app) if it was important to me.\n\nSame thing with the grocery store. I can't deny them the right to record me once I walk through the door, and they likely wouldn't be OK with me if I went in there trying to hide from security cameras, but if it bothered me I can at least make decisions based on how the fact I'm being recorded effects me.",
                            "score": 7,
                            "author": "zachtheperson"
                        },
                        {
                            "level": 2,
                            "comment": "&gt; Companies started doing this when places like the EU passed their anti-data collecting stuff; they just stopped providing the service to the EU.\n\nAnd others have stepped in to sell to the underserved market, no?",
                            "score": 2,
                            "author": "sorator"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No request ban it. Every website i spend more time denying requests then the fucking website.",
                    "score": 2,
                    "author": "imadethisaccountso"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Protection against geofencing, eh? Looks like Washington state is getting out ahead of all of the Republican's fascist anti-abortion tactics.",
            "score": 45,
            "author": "Ohhellnowhatsupdawg",
            "replies": [
                {
                    "level": 1,
                    "comment": "Inslee and the legislature are killing it this session.",
                    "score": 14,
                    "author": "kevnmartin"
                }
            ]
        },
        {
            "level": 0,
            "comment": "What about companies blatantly sharing payroll data to equifax?",
            "score": 6,
            "author": "misc0007"
        },
        {
            "level": 0,
            "comment": "Okay they're just going to refuse care until you agree.",
            "score": 5,
            "author": "DenikaMae",
            "replies": [
                {
                    "level": 1,
                    "comment": "My thoughts exactly",
                    "score": 3,
                    "author": "Ronbergs"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Washington state has been on fire recently.",
            "score": 4,
            "author": "Papa_Skittles"
        },
        {
            "level": 0,
            "comment": "This will just be another button you have to press or consent to on paper or they will deny you service. \n\nI live in Washington state, we have plenty of greenery, however there are so many bigger issues in this state like housing inflation getting out of hand because no one will restrict how many properties landlords can buy. \n\nGentrification and the crushing of the working class is a real problem in Washington. Not to mention the gun laws being passed recently do nothing to restrict law enforcement firearms only working class people.",
            "score": 13,
            "author": "Victor_Delacroix",
            "replies": [
                {
                    "level": 1,
                    "comment": "The only way to stop companies collecting data is to make them completely liable for any and all damage caused by abuse, regardless of if they did it, or someone they sold it to, or someone that collected the same data. 5 companies got your data and it gets abused, you get your loss covered 5 times, no guilt sharing for them. No option to get out of it, companies that split or merger will assume complete responsibility, 0 ways to ever get rid of responsibility once collected, forever liable.",
                    "score": 9,
                    "author": "vrenak",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That sounds like an amazing idea.",
                            "score": 6,
                            "author": "Victor_Delacroix"
                        },
                        {
                            "level": 2,
                            "comment": "Good luck proving any of that.",
                            "score": 1,
                            "author": "mad_science",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You misunderstand, companies will be the ones having to prove things.",
                                    "score": 3,
                                    "author": "vrenak"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The entire special education system collapsed do to rampant abuse and a lot of not qualified people working in jobs they don’t have certs for in Washington state. That too. Spokane got thwacked by the DoJ\n\n\nOur mental institutions also getting a thwacking so minors can not use any of them now cause they were never up to snuff to care for them under federal rules.",
                    "score": 2,
                    "author": "impulsiveclick",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Exactly, these are also very good points.",
                            "score": 1,
                            "author": "Victor_Delacroix",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "We are still investigating sadly. So other than the thing just passed so people who work at schools have wages that rise with inflation… it will be a while. I want to believe Washington will fix its systems to help disabled people.",
                                    "score": 2,
                                    "author": "impulsiveclick"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They made their point clear when they called AR-15 “weapons of war” meanwhile cops get exemption, so are you saying cops are a standing military? Gotcha",
                    "score": 3,
                    "author": "Fun-Worry-6378",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So my opinion is that the working class should never have restrictions that law enforcement does not have. If a police officer is allowed to have a bump stock rifle with a pistol grip then so should I. \n\nWith how heavily funded and lack of restrictions police have, yes I consider them a standing military which they like to flex on the working class every day in America. I hope this helps clear the air on my leftist views.",
                            "score": 2,
                            "author": "Victor_Delacroix"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Europe passes law requiring consent before companies collect any personal data... My bad that was years ago with GDPR.",
            "score": 6,
            "author": "cyrosd"
        },
        {
            "level": 0,
            "comment": "Like consent ever stopped any company from harvesting data",
            "score": 2,
            "author": "Gunslinger_11"
        },
        {
            "level": 0,
            "comment": "Fuck requesting. Jusy ban it. In the EU every website request permission for cookies. Fuck just ban it. Imagin goin to a brick and morter shop and gaving to give up this info. Fucking ban this money laundering data trade",
            "score": 2,
            "author": "imadethisaccountso"
        },
        {
            "level": 0,
            "comment": "In other words - doctors add a line to the several pages that they already have you sign without giving you much time to actually read. \n\nWhen my mom went in for surgery, they handed her a a blank electronic pen tablet to sign on, without even showing her what she's signing.",
            "score": 2,
            "author": "aminy23"
        },
        {
            "level": 0,
            "comment": "This should be a federal law but nooooo 🙄 Damn Republicans",
            "score": 4,
            "author": "Tiger37211",
            "replies": [
                {
                    "level": 1,
                    "comment": "Profits for corporate overlords above everything else.",
                    "score": 4,
                    "author": "Lootcifer-"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Between this and the gun law passed lately, Washington looking like a great state to move to!",
            "score": 3,
            "author": "Amagoi",
            "replies": [
                {
                    "level": 1,
                    "comment": "There's still some improvements that can be made. It has the same problem as LA, or San Francisco where the progressive population that own houses keep voting against city zoning laws that would build more houses, thus decreasing housing prices. This way their house/rent values keep increasing and poorer folks become homeless since they can't afford to buy nor rent.",
                    "score": 9,
                    "author": "zqfmgb123"
                },
                {
                    "level": 1,
                    "comment": "I've lived here almost my whole life. It's the greatest place in America.",
                    "score": 6,
                    "author": "kevnmartin",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If you’re from the west coast. The eastern half of the state is basically Idaho. *shudders*",
                            "score": 5,
                            "author": "Fun-Worry-6378",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Oh I know. Once my husband wanted to show me where he used to fish or something. He took me to a place called Liberty. It was just a dirt road, lined with tar paper shacks and dilapidated trailers with falling down front porches. There were a lot of idle men and filthy children sitting on those porches. And of course, the Confederate flag was proudly on display. Needless to say, I didn't want to stay more than two seconds.",
                                    "score": 3,
                                    "author": "kevnmartin"
                                },
                                {
                                    "level": 3,
                                    "comment": "Been working around Spokane for the past four months. I expected liberals when I got here. I learned my lesson.",
                                    "score": 2,
                                    "author": "JamCliche",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "So many people think that. Its extra funny when Republicans see something stupid eastern WA has done and start blaming \"liberals\". Not even the entire west coast is safe. Much of the south is also full of rural assholes and same thing if you go too far north. The peninsula has the same problem.The liberal part is mostly right around the puget sound.",
                                            "score": 1,
                                            "author": "WomenAreFemaleWhat"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've lived on every coast of this country, from Alaska to New York and a lot in between. Washington is the worst place I've ever lived. It looks good on paper, but this state is terrible at praxis.",
                    "score": 0,
                    "author": "mad_science_puppy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Agreed in full",
                            "score": -1,
                            "author": "Victor_Delacroix"
                        },
                        {
                            "level": 2,
                            "comment": "Speak for yourself. Glad you left. The states better without you.",
                            "score": 1,
                            "author": "WomenAreFemaleWhat"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Washington used to be a great state for civil rights and generally to be free from nonsense laws.\n\nNow it is just California with shitty weather.",
                    "score": 0,
                    "author": "abcalt"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Aaaand que all the gun humpers pissing about my state. It's far from perfect, but if guns is what you're about go somewhere else.",
            "score": 2,
            "author": "brutalistsnowflake"
        },
        {
            "level": 0,
            "comment": "Interesting.  Does Oscar (read google) operate there?",
            "score": 1,
            "author": "cheetahbear"
        },
        {
            "level": 0,
            "comment": "I should read the article but: isn’t this already required under hipaa?",
            "score": 1,
            "author": "dont_shoot_jr"
        },
        {
            "level": 0,
            "comment": "AI companies buy imaging data deidentify patient health information and train cancer detecting algorithms for cancer detecting software. Lunit is advertising one right now (not publicly) that has a 96% accuracy detecting breast cancer. It also brings the accuracy of general radiologists up to the same accuracy as breast specialists which was really impressive to me",
            "score": 1,
            "author": "tallcan710"
        },
        {
            "level": 0,
            "comment": "Isn't this covered under hippa?",
            "score": 1,
            "author": "dmtbobby"
        },
        {
            "level": 0,
            "comment": "How will this be any different than the dozens of other check boxes we click consenting to various terms and policies?",
            "score": 1,
            "author": "mad_science"
        },
        {
            "level": 0,
            "comment": "Great, 1 more think to bury in the ToS.",
            "score": 1,
            "author": "Johnyryal3"
        }
    ]
}