{
    "id": "136jnvk",
    "score": 434,
    "title": "South end of Great Salt Lake up nearly 4 feet since berm raised in February",
    "author": "Careless_Bat2543",
    "date": 1683118276.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/136jnvk",
    "media_urls": [
        "https://www.ksl.com/article/50632945/south-end-of-great-salt-lake-up-nearly-4-feet-since-berm-raised-in-february"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Due to drought, the south end of the great salt lake was increasing in salinity and threatening the unique wildlife that relies on it. In February, the Union Pacific railroad (at the governors request) constructed a berm on their causeway across the lake to prevent water from flowing from the south end to the north end (where salinity is not a concern) to try and raise water levels in the south end. It appears to have worked and now water has raised enough in the south end of the lake that it is overtopping the berm and flowing north. This is great news for wildlife.",
            "score": 136,
            "author": "Careless_Bat2543",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's good for now... but due to the incredible snow year politicians denied the bill that would've set a \"target depth\" for the lake. So it's probably just short term...\n\nAlso some our city roads have also gone up in average water depth!\n\nBut very uplifting for now! Hopefully the berm provides long term benefits. SLC is as green as I've ever seen it right now.",
                    "score": 43,
                    "author": "BytesBite"
                },
                {
                    "level": 1,
                    "comment": "Isn’t the north end not a concern because the salinity is so high everything is dead anyway? It’s just like sacrificing the north end basically.",
                    "score": 7,
                    "author": "ObjectiveBike8"
                }
            ]
        },
        {
            "level": 0,
            "comment": "You know what would help even more? Not growing water intensive crops in the desert. The Soviet Aral sea disaster was caused by the same thing. Guess it isn't just a communist thing. Capitalist economies make the same mistakes.",
            "score": 65,
            "author": "ChemsAndCutthroats",
            "replies": [
                {
                    "level": 1,
                    "comment": "You’re not wrong. Alfalfa crops use 68% of the total amount of diverted water in Utah, and only produce 0.2% of our states gdp. \nhttps://www.sltrib.com/news/environment/2022/11/24/one-crop-uses-more-than-half/",
                    "score": 56,
                    "author": "DefinitionMission144",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The governor of Utah, Spencer Cox, is an alfalfa farmer.",
                            "score": 22,
                            "author": "500owls"
                        },
                        {
                            "level": 2,
                            "comment": "Holy FUCK we don’t deserve the planet",
                            "score": 20,
                            "author": "GoreMeister982"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We need to feed the cattle we eat something. If we ate less beef then we’d need to grow a lot less alfalfa to feed them. \n\nThis is a world problem, we export billions of dollars of alfalfa to China and Japan to feed their cattle.",
                    "score": 5,
                    "author": "adkayaker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think it's time the government ends subsidies for the agri cartel. Let them compete on the free market as intended. If people were to see the true cost of meat they would be eating less of it.",
                            "score": 14,
                            "author": "ChemsAndCutthroats",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "As much as I enjoy meat, I'll do what I can for this planet. Do it.",
                                    "score": 3,
                                    "author": "Altruistic-Bad228"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; We need to feed the cattle we eat something\n\nBut maybe we can stop feeding the cattle they eat in Saudi Arabia",
                            "score": 4,
                            "author": "taptapper"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Now comes the scary part",
            "score": 2,
            "author": "supagirl277"
        },
        {
            "level": 0,
            "comment": "How is this uplifting?",
            "score": -10,
            "author": "Lopsided_Flamingo_27",
            "replies": [
                {
                    "level": 1,
                    "comment": "Read OPs comment",
                    "score": 11,
                    "author": "PublicRule3659"
                },
                {
                    "level": 1,
                    "comment": "Because the water was getting too low causing salinity issues for wildlife. The berm is working as intended raising the water level this lowering the salinity",
                    "score": 3,
                    "author": "Careless_Bat2543",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This is uplifting for now (quite literally), but the long term health of the lake is still in serious danger, unfortunately.",
                            "score": 1,
                            "author": "500owls"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They punted the problem for another year or two again.  I guess environmentally that qualifies.",
                    "score": 8,
                    "author": "MrSnarf26"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Kinda sad, tho.  Only saving one small part of the lake",
            "score": 1,
            "author": "taptapper",
            "replies": [
                {
                    "level": 1,
                    "comment": "It’s like 2/3 of the lake",
                    "score": 2,
                    "author": "Careless_Bat2543"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Tysm for sharing this.",
            "score": 1,
            "author": "HypotheticallySpkng"
        }
    ]
}