{
    "id": "13hoagr",
    "score": 399,
    "title": "Critically endangered red wolf pups born at North Carolina Zoo",
    "author": "Typical-Plantain256",
    "date": 1684100533.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/13hoagr",
    "media_urls": [
        "https://www.kltv.com/video/2023/05/14/critically-endangered-red-wolf-pups-born-north-carolina-zoo/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "How precious. So many nose boops to give.",
            "score": 9,
            "author": "MercyForNone"
        },
        {
            "level": 0,
            "comment": "Is this the Museum of Life and Science in Durham? Beautiful facility and the wolf and other animal habitats were huge and very open",
            "score": 3,
            "author": "RobotDowneyJr",
            "replies": [
                {
                    "level": 1,
                    "comment": "I believe this is the North Carolina Zoo in Asheboro, which has very large habitats as well. In fact, it's the world's largest natural habitat zoo by acreage. Can't wait for Asia and Australia to open!",
                    "score": 3,
                    "author": "stevie1der328"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Critically endangered? Aren't they extinct in the wild?",
            "score": 2,
            "author": "Cetun",
            "replies": [
                {
                    "level": 1,
                    "comment": "There are about twelve radio collared/captured red wolves in the wild.",
                    "score": 3,
                    "author": "Ok_Atyourword",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean that still seems like \"near extinction\" rather than \"critically endangered\"",
                            "score": 1,
                            "author": "Cetun",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, unfortunately :( Edit, it’s even lower now with the population of wild wolves 8 now due to three having died from vehicular accidents . It’s heartbreaking.",
                                    "score": 2,
                                    "author": "Ok_Atyourword"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "There are about twelve radio collared/captured red wolves in the wild.",
                    "score": 2,
                    "author": "Ok_Atyourword"
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;This video is geo-restricted.\n\nWhat's the point of all these local US news sites to have their content geo-restricted? I see this time and time again.",
            "score": 1,
            "author": "pookeyblow",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's frustrating for sure, but unfortunately it's often due to licensing and copyright agreements. The news sites may have exclusive deals with certain broadcasters or advertisers in specific geographic regions, and thus restrict access to protect those agreements. It's a shame that important news like this about the red wolf pups is being limited in its reach, but hopefully in the future we'll see more open access to information like this.",
                    "score": 3,
                    "author": "Elena_Edie"
                }
            ]
        },
        {
            "level": 0,
            "comment": "So the moderator doesn't want any comments about the cruelty of zoos? Is that considered a negative comment that will get me banned? Give me a break.  Let people voice their opinion negative or positive.  Seems like the mod  wants \"awesome cute\" comments only.",
            "score": -3,
            "author": "irol444",
            "replies": [
                {
                    "level": 1,
                    "comment": "The whole point of this sub is to be uplifting. There are plenty of other spaces to share negative opinions.",
                    "score": 2,
                    "author": "needsexyboots",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "You can have a so called uplifting story ( zoos are not really in that category)  but don't restrict comments from people who don't think it's an uplifting story.",
                            "score": 0,
                            "author": "irol444"
                        }
                    ]
                }
            ]
        }
    ]
}