{
    "id": "13j9stk",
    "score": 734,
    "title": "Only woman entry in solo, around the world, non- stop, sail boat race wins.",
    "author": "davster39",
    "date": 1684254114.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/13j9stk",
    "media_urls": [
        "https://www.washingtonpost.com/sports/2023/05/16/kirsten-neuschafer-golden-globe-sailing-race/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "&gt; As she neared the end, she hit windless doldrums near the equator and sat for almost two weeks. She was distraught, certain the others had passed her. To cope, she took long swims away from Minnehaha until the boat was a speck in the distance, before turning back.\n\nShe swam away from her boat while alone?  That’s a whole bunch of fuck that…",
            "score": 151,
            "author": "seamus_mc",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt;That’s a whole bunch of fuck that…\n\nBlue water sailor here, actually it's not.  I've gone over the side and so have my crew members when becalmed.  Didn't swim till the boat was a speck but it is not uncommon to go for a swim offshore in the doldrums.  The ocean gets like glass and you can not see a ripple for as far as the eye can see, that tells you there is no wind anywhere near you nor will there likely be anytime soon.  When the wind goes flat like that visibility in the ocean increases dramatically so you can also easily see if there are any fish in the area, also the lack of sea birds can be an indicator.   While it sounds dangerously crazy in actuality it is not uncommon among blue water sailors at all.",
                    "score": 76,
                    "author": "jest4fun",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I’ve done it too, but there is always somebody left onboard or i am attached with a tether.",
                            "score": 38,
                            "author": "seamus_mc"
                        },
                        {
                            "level": 2,
                            "comment": "I think you missed the key part of that. She went swimming while alone, there was no other crew members to help if crap goes down.",
                            "score": 19,
                            "author": "Tokenvoice"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "“Only one completed the circuit, and another was declared dead by suicide”. In addition to Donald Crowhurst, they don’t mention that another, Bernard Moitessier, was in the lead 10 days out and decided to …just keep sailing? \n\nBasically every single contestant in the 1968 race has an absurd story worth googling, I encourage you to do so. There’s been a few documentaries I think too.",
            "score": 23,
            "author": "not_dropping_cameras",
            "replies": [
                {
                    "level": 1,
                    "comment": "Was wondering if this was the Golden Globe (can't read cause paywall). The '68 race was crazy. I really enjoyed the documentary [Deep Water](https://en.m.wikipedia.org/wiki/Deep_Water_(2006_film))",
                    "score": 4,
                    "author": "Arisayne",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "One of my favorite documentaries of all time, yet the two people I recommended it to called it boring.",
                            "score": 4,
                            "author": "-killertofu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Philistines.",
                                    "score": 1,
                                    "author": "Arisayne"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "What a badass!",
            "score": 15,
            "author": "Fresh-Rub830"
        },
        {
            "level": 0,
            "comment": "Reading this article has left me with an overwhelming sense of loss almost. I don't seek adventure because I'm scared of everything that can go wrong all the time. Yet there are people like her who will swim away from her boat while alone in theiddle of the ocean during a round-the-world race. I need to do SOMETHING before I die. She has inspired me.",
            "score": 13,
            "author": "igiveonefuck"
        },
        {
            "level": 0,
            "comment": "Disclaimer: I am unable to read the article before posting.\n\nI'm guessing the key to her victory is that her competitors REFUSED to ask for directions.",
            "score": 38,
            "author": "TitanBrews",
            "replies": [
                {
                    "level": 1,
                    "comment": "Refuse?! They didn't NEED directions because they are -&gt;not lost&lt;-",
                    "score": 5,
                    "author": "MrMadrona",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "/s",
                            "score": 1,
                            "author": "MrMadrona"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I think I had at least three aneurisms trying to read that title.",
            "score": 16,
            "author": "hellcat_uk",
            "replies": [
                {
                    "level": 1,
                    "comment": "Yes, the race had a lot of rules",
                    "score": 0,
                    "author": "davster39"
                }
            ]
        },
        {
            "level": 0,
            "comment": "She was the only one to stop and ask for directions. The rest got lost and lost time for it!",
            "score": 5,
            "author": "Digital_loop"
        },
        {
            "level": 0,
            "comment": "Yup, that's going to be a movie in a few years",
            "score": 2,
            "author": "Al3jandr0"
        },
        {
            "level": 0,
            "comment": "Great story, thanks",
            "score": 2,
            "author": "0belvedere"
        },
        {
            "level": 0,
            "comment": "Why is this more uplifting than any other year? Just because she’s a woman? There’s no bonus points for that. Shouldn’t the headline be “Solo around the world race won by best competitor”?",
            "score": -2,
            "author": "ScissorNightRam",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's just a cool thing that happened. Things like that can be uplifting!",
                    "score": 2,
                    "author": "Saradoesntsleep",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It is a cool thing for sure, agreed. Solo adventurers are pretty cool people.",
                            "score": 1,
                            "author": "ScissorNightRam"
                        }
                    ]
                }
            ]
        }
    ]
}