{
    "id": "13k7ern",
    "score": 6144,
    "title": "74-year-old musician Otis Taylor gets Denver high school diploma decades after being expelled for hair",
    "author": "Khaleeasi24",
    "date": 1684342518.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/13k7ern",
    "media_urls": [
        "https://www.cbsnews.com/colorado/news/otis-taylor-high-school-diploma-denver-decades-after-being-expelled-hair/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "\"Taylor has been nothing short of impressive since. He's had over a dozen blues albums and the awards to match.\"\n\nAnd that's the only reason they did it.",
            "score": 199,
            "author": "NotAlwaysATroll",
            "replies": [
                {
                    "level": 1,
                    "comment": "\"now that you're famous we are sorry\"",
                    "score": 97,
                    "author": "ReallyNeedNewShoes"
                },
                {
                    "level": 1,
                    "comment": "Plus it looks like he finally cut his hair. So problem solved, I guess.",
                    "score": 15,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"A musician who was expelled from a Denver high school over 50 years ago received his diploma. Otis Taylor was kicked out of Manual High School in 1966 because of his hair. This was decades before laws ending racial hair discrimination. Denver Public Schools wanted to right a wrong\n\n\"I remember that day thinking, 'Oh, I'm out of school!'\" Taylor told CBS Colorado's Tori Mason.\n\nTaylor was 17 years old at the time.\n\nHe went to high school in the 1960s - and Taylor had style.\n\n\"You had to have that James Brown haircut. You can have all you want on the top, but you had to be clean on the sides,\" said Taylor. \"The whole school district was coming down on people who didn't look how they wanted you to look.\"\n\nTaylor's administrators gave him an ultimatum.\n\n\"Cut your hair or leave.\"\n\nTaylor left.\n\n\"I wasn't thinking about me going into the janitorial business or something. I was trying to figure out how to do my music,\" said Taylor, about a moment 57 years ago.\n\nHe remembers how his parents felt. He says his mom was upset, and his dad was livid. After he was expelled, he went to California where his dad lived. He tried to get into a bar, showed his underage ID and went to jail briefly.\n\n\"My father let me sit there for three days. When I came out, he took me straight to a barber. I got my haircut!\" laughed Taylor.\n\nTaylor has been nothing short of impressive since. He's had over a dozen blues albums and the awards to match. But this week, eyes were on Taylor for a different tune.\"",
            "score": 527,
            "author": "Khaleeasi24"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 64,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "I saw this post and thought “THAT Otis Taylor??”\n\nIt’s excruciating to read this story about anyone, let alone one of my favorite musicians. \n\nThis is my favorite of his, it always wrecks me. \n\nhttps://youtu.be/kLGXlHJ7F4c",
                    "score": 27,
                    "author": "Interesting_Proof852"
                },
                {
                    "level": 1,
                    "comment": "Justified fans will recognize this song\n\n[10 Million Slaves](https://m.youtube.com/watch?v=3sQOOZv_CYM)",
                    "score": 5,
                    "author": "DervishSkater",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "**Song Found!**\n\n**Ten Million Slaves** by Otis Taylor (00:11; matched: `100%`)\n\n**Album**: Otis Taylor Collection. **Released on** 2014-11-17.",
                            "score": 2,
                            "author": "auddbot",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Apple Music, Spotify, YouTube, etc.:\n\n[**Ten Million Slaves** by Otis Taylor](https://lis.tn/TenMillionSlaves?t=11)\n\n*I am a bot and this action was performed automatically* | [GitHub](https://github.com/AudDMusic/RedditBot) [^(new issue)](https://github.com/AudDMusic/RedditBot/issues/new) | [Donate](https://github.com/AudDMusic/RedditBot/wiki/Please-consider-donating) ^(Please consider supporting me on Patreon. Music recognition costs a lot)",
                                    "score": 2,
                                    "author": "auddbot"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Otis is an absolutely brilliant musician and while he has enjoyed critical success, his work should be more popular. One of my absolute favorites.",
                    "score": 6,
                    "author": "Troutalope"
                }
            ]
        },
        {
            "level": 0,
            "comment": "*He tried to get into a bar, showed his underage ID and went to jail briefly.*\n\n*\"My father let me sit there for three days. When I came out, he took me straight to a barber. I got my haircut!\" laughed Taylor.*\n\nThree days for a fake ID... Wow.",
            "score": 288,
            "author": "CallitCalli",
            "replies": [
                {
                    "level": 1,
                    "comment": "Not fake. Just underage",
                    "score": 199,
                    "author": "Heliosvector",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 160,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He's black. That's all that mattered back then.",
                                    "score": 264,
                                    "author": "R4TTY",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"back then\" would lead someone to believe that those times are completely over",
                                            "score": 122,
                                            "author": "Biengineerd",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Oh please. Can we please not pretend as though there is a fervent white nationalist around every corner? Things now are literally incomparable to how they were then. That's how far we've come. Are we perfect? No. Are we better and more tolerant than most nations around the world? Yes. The US falls in the 10-15 range on the least racist countries list, depending on which list you're talking about. This is better than Spain, Italy, and France, for example. And those are pretty damn nice countries.\n\nAll I'm saying is let's not be so at odds with reality here. We need to stay vigilant. We need to work on educating and reducing the number of dingalings around here with tiki torches. We need to work on systemic injustices that are indeed largely leftovers of another time (drug laws targeting black people, redlining, as easy examples).\n\nBut we AREN'T in some weird racist dystopia. We are in one of the most racially enlightened places in the world.",
                                                    "score": -57,
                                                    "author": "watduhdamhell",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'll grant you that things have improved and could be worse. But didn't a [sheriff in Oklahoma](https://www.dailymail.co.uk/news/article-11984655/Oklahoma-sheriff-officials-allegedly-heard-recording-talking-lynching-black-people.html) get recorded lamenting the good ole days of lynching LAST MONTH? \n\nFervent white nationalists aren't lurking around every corner, but it seems premature to celebrate our enlightenment. \nMaybe if we get below 100 different [white nationalist groups](https://abcnews.go.com/amp/US/number-hate-groups-us-hits-time-high-report/story?id=61186850#amp_ct=1684369734253&amp;amp_tf=From%20%251%24s&amp;aoh=16843697122064&amp;referrer=https%3A%2F%2Fwww.google.com). \n\nI think the important thing to remember is that not everywhere enjoys the same level of tolerance. \n\nAnyone feel like compiling a list of instances where someone shoots an unarmed black man and the police won't investigate or the district attorney won't file any charges without *enormous* outside pressure? I'm not up for it.",
                                                            "score": 71,
                                                            "author": "Biengineerd",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The issue is that there are fervent white nationalists all up in the highest positions of powers. And 100 is a lot. \n\nPeople forget that pre 9/11 yallqueda was the most dangerous terror group to America. I mean they BLEW UP A FEDERAL BUILDING (killing 400+) They have been taking pot shots at our infrastructure and have been caught in coup attempts. \n\nAny one who doesn’t believe that white nationalism is one of if not the biggest threat to American democracy/stability, is likely aligned with them.",
                                                                    "score": 2,
                                                                    "author": "UnfortunateJones"
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "America has more black men enslaved in prison than they ever did during chattel slavery and the median wealth a black household holds has dropped theough the floor since integration happened. \n\nWhites love to go on these rants of \"we don't hang them from trees anymore\" as if the past is any metric to base today on and it's tiring. We literally watch lynchings from police every other week online and we're *just starting* to see a semblance of justice. That's not good. We're not in a good place and even the white folks are figuring it out.",
                                                            "score": 22,
                                                            "author": "BamBamBigaleux"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "No need to pretend when systemic racism is a reality. It's not like a three letter agency reported white nationalist groups as the leading culprit for domestic terrorism in the US. Oh wait...they did. We literally have elected politicians attempting to enact christian sharia law. The amount of racist shit stains that would gladly own a human being tomorrow if it were legal is disgusting. Don't you dare downplay the white nationalist problem currently festering in our society.",
                                                            "score": 3,
                                                            "author": "Soul_Chickenz"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 2,
                                                            "author": "[deleted]"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I appreciate you saying the truth, despite the downvotes. People love hyperbole nowadays and don't want to recognize any nuance in their reality.",
                                                            "score": 1,
                                                            "author": "OTTER887"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Lol",
                                                            "score": -8,
                                                            "author": "pinetrees23"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "*\"some really nice countries are more racist!\"*\n\nWhat a trip hahaha, you should do this shit on stage",
                                                            "score": 0,
                                                            "author": "gee_gra",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The main idea was that people often associate Europe and Europeans with enlightenment. Many people on Reddit would assume immediately that they are less racist than we are, since europe = good, USA = bad.\n\nI demonstrated that this is not necessarily true.\n\nI would suggest this [book](https://www.amazon.com/Practice-Perfect-Advanced-English-Comprehension/dp/0071798862/ref=asc_df_0071798862/?tag=hyprod-20&amp;linkCode=df0&amp;hvadid=312095945984&amp;hvpos=&amp;hvnetw=g&amp;hvrand=4976736436110729640&amp;hvpone=&amp;hvptwo=&amp;hvqmt=&amp;hvdev=m&amp;hvdvcmdl=&amp;hvlocint=&amp;hvlocphy=9027811&amp;hvtargid=pla-451280189738&amp;psc=1&amp;tag=&amp;ref=&amp;adgrpid=60223809257&amp;hvpone=&amp;hvptwo=&amp;hvadid=312095945984&amp;hvpos=&amp;hvnetw=g&amp;hvrand=4976736436110729640&amp;hvqmt=&amp;hvdev=m&amp;hvdvcmdl=&amp;hvlocint=&amp;hvlocphy=9027811&amp;hvtargid=pla-451280189738) by Diane Engelhardt. It would really bring things into focus for you.",
                                                                    "score": 1,
                                                                    "author": "watduhdamhell",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I understood what you wrote, I just thought it was a daft point to bring up – racism can be worse in some *\"really damn nice countries\"* (😂) and still be a problem in a presumably shittier country lol",
                                                                            "score": 1,
                                                                            "author": "gee_gra"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Those were the days.",
                                            "score": -10,
                                            "author": "Icedoverblues"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That should be a fine and citation for the institution, not him",
                                    "score": 8,
                                    "author": "DragonSlayerC"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Jesus - that's worse.",
                            "score": 27,
                            "author": "CallitCalli",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The worst part is, the real reason is because of his skin. Being underage isn't illegal, and neither is state issued identification. The only thing he did \"wrong\" was being born black\n\nEdit: addition of quotes",
                                    "score": 28,
                                    "author": "Criticalhit_jk",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He titled one of his albums, \"White African\".\n\nGreat stuff.",
                                            "score": 1,
                                            "author": "Old_timey_brain"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "And black",
                            "score": 3,
                            "author": "-_Odd_-"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Ten million slaves… such a good song.",
            "score": 15,
            "author": "DxAH",
            "replies": [
                {
                    "level": 1,
                    "comment": "People listen to this song",
                    "score": -7,
                    "author": "xBADJOEx"
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"The wrong happened a long time ago. So being a Black man in America, I'm going to deal with wrongs,\" said Taylor. \"My kids went to college. My wife loves me and we've been married for 37 years. How can I regret?\"\n  \nWhat a country. It’s not happy unless it has people to pick on.\n  \n\n&gt;&gt;The only thing can be is an inherent determination that the people who were formerly in slavery, regardless of anything else, shall be kept as near that stage as is possible, and now is the time, we submit, that this Court should make it clear that that is not what our Constitution stands for.\n  \n—Thurgood Marshall, Brown v. Board of Education",
            "score": 48,
            "author": "adam_demamps_wingman"
        },
        {
            "level": 0,
            "comment": "People still gt expelled for it nowadays in the states",
            "score": 27,
            "author": "iampuh",
            "replies": [
                {
                    "level": 1,
                    "comment": "The difference, however, is that you can sue today when you do.",
                    "score": 14,
                    "author": "robexib"
                }
            ]
        },
        {
            "level": 0,
            "comment": "System is broken, it's always been broken.",
            "score": 8,
            "author": "Colliehond"
        },
        {
            "level": 0,
            "comment": "Hold on now.. he spent three days in the slammer for being underage. Wow 🤯🤯",
            "score": 8,
            "author": "TruthandPeace",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nah homie, I never went to jail for being underage.\n\nHe went to jail because he’s black.",
                    "score": 8,
                    "author": "alabasterwilliams"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Not the most uplifting to me. Better than nothing I guess, but what is he suppose to use that diploma for now? Put it on the wall as a testament to 50 years of racism?",
            "score": 5,
            "author": "Dragonpuncha"
        },
        {
            "level": 0,
            "comment": "That's one bad mf on a banjo",
            "score": 3,
            "author": "xBADJOEx"
        },
        {
            "level": 0,
            "comment": "Taylor! I thought I told you to trim those sideburns. Go go home! You’re expelled from the school for good!",
            "score": 3,
            "author": "Juub1990"
        },
        {
            "level": 0,
            "comment": "Yay, Otis! If you play an instrument and want to groove, check out his trance blues festival. https://trancebluesfestival.com/trance-blues-festival/",
            "score": 3,
            "author": "[deleted]"
        },
        {
            "level": 0,
            "comment": "Please also post this in r/blues",
            "score": 3,
            "author": "bluesqueen23"
        },
        {
            "level": 0,
            "comment": "He should have told them to shove it up their assess.",
            "score": 2,
            "author": "-The-Moon-Presence-"
        },
        {
            "level": 0,
            "comment": "I saw him on the streets of Chicago one time when I had a long train layover there. I was drunk as hell, just walking around, when I saw him with some group walking him around like some kind of tour. I love his music, but I brain farted his name and had to look it up. Eventually I asked \"excuse me, are you Otis Taylor?\" He turned around and said yeah, so I told him I'm a fan and asked for a quick picture. He agreed, and I handed my disposable camera to one of the people he was with to take the picture.\n\n  \n\n\nI now have, in my collection, a picture of myself drunk with a pissed-off looking Otis Taylor on the streets of Chicago. Literally the only time I've met a famous person.\n\nQuick edit: I just saw the picture of him in the article, and I'm realizing that I might actually just be how he looks in pictures.",
            "score": 2,
            "author": "Former-Lack-7117"
        },
        {
            "level": 0,
            "comment": "Somebody wrote me a nasty letter 🎵",
            "score": 2,
            "author": "throwCharley"
        },
        {
            "level": 0,
            "comment": "Big fan. I have several of his albums in my collection.",
            "score": 2,
            "author": "devnullb4dishoner"
        },
        {
            "level": 0,
            "comment": "you Young bucks don't even Know... we used to get kicked out, friday mornings for a 3 day weekend.  oh Gawd, did the Beatles cause a Problem! hahaha",
            "score": 1,
            "author": "redw000d"
        },
        {
            "level": 0,
            "comment": "Anne Harris needs a mention here too I believe? Incredible violinist. \n\nJust generally cracking music.",
            "score": 1,
            "author": "Mogwair"
        },
        {
            "level": 0,
            "comment": "Sometimes you eat the steak, sometimes the steak eats you.",
            "score": 1,
            "author": "prylosec"
        },
        {
            "level": 0,
            "comment": "I'll never forget working as front desk staff and a black man comes in asks \"Are you hiring? Can I leave my resume?\"\nHe had super neat cornrows. \nAs soon as the man left, my manager says \"uuggh his hair, and threw his resume away.",
            "score": 1,
            "author": "Icedcoffeeee"
        },
        {
            "level": 0,
            "comment": "His pops looks like he tired of everyone’s shit.",
            "score": 1,
            "author": "SexandCinnamonbuns"
        },
        {
            "level": 0,
            "comment": "According to the CBS article, they gave him an \"Honorary\" diploma.  Why not give him a standard real diploma, he earned it, didn't he?",
            "score": 1,
            "author": "mcraigweaver"
        },
        {
            "level": 0,
            "comment": "Great that they try to correct past wrongdoings but are they fighting the current ones?",
            "score": 1,
            "author": "Mackie_Macheath"
        }
    ]
}