{
    "id": "13l7l7g",
    "score": 509,
    "title": "North Carolina COVID lab finds new purpose in helping police clear decades-old backlog of rape kits",
    "author": "rehtulx",
    "date": 1684436367.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/13l7l7g",
    "media_urls": [
        "https://www.foxnews.com/us/north-carolina-covid-lab-finds-new-purpose-helping-police-clear-decades-old-backlog-rape-kits"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "How tf do you just ignore the rape kits for decades",
            "score": 52,
            "author": "moonsnotreal",
            "replies": [
                {
                    "level": 1,
                    "comment": "Usually a combination of several reasons from the mundanely beaurocratic to maliciously misogynistic. Including but not limited to:\n\nLack of funding for crime labs (personnel, training, materials, buildings)\n\nOutdated rules on what kits can be submitted (e.g. only if you have a named subject)\n\nLow priority to law enforcement\n\nInvestigators not believing victim's report or deciding victim consented (was asking for it)",
                    "score": 52,
                    "author": "havartifunk",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Just curious about the named-suspect part of it. What if you name someone you know isn’t the guy, just to get the kit submitted and tested? I’m not advocating naming innocent randos, but like what if you had a friend who offered to be the name just so the kit could go through?",
                            "score": 2,
                            "author": "IndigoRanger",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "False reporting is a class C felony",
                                    "score": 5,
                                    "author": "m1gl3s",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yikes so that’s out. I am fortunate to not be in this situation, I was just curious if there was a loophole to force the kit to be tested if you don’t know who the guy was.",
                                            "score": 2,
                                            "author": "IndigoRanger"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "That would significantly hurt your case, not to mention the accusation alone is going to ruin your friend's life. (And be a felony.)",
                                    "score": 3,
                                    "author": "havartifunk"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\"decades-old backlog of rape kits\"",
            "score": 65,
            "author": "wormyg",
            "replies": [
                {
                    "level": 1,
                    "comment": "So uplifting.",
                    "score": 7,
                    "author": "WCGWjoiningReddit"
                },
                {
                    "level": 1,
                    "comment": "You mean surprise motherhood , rape is so negative /s",
                    "score": 20,
                    "author": "FawksyBoxes"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's giving /r/orphancrushingmachine",
            "score": 27,
            "author": "thejennadaisy"
        },
        {
            "level": 0,
            "comment": "Obviously justice for women is not a priority in this state governed by white men. Vote them out!",
            "score": 20,
            "author": "InterestingCloud5748"
        },
        {
            "level": 0,
            "comment": "the only reason to have that many back logged is cause you never intended to deal with them from the start. despicable, there should be criminal charges here.",
            "score": 14,
            "author": "Son_of_Plato"
        },
        {
            "level": 0,
            "comment": "Is it a backlog if just no one wanted it looked into because it's women and who cares and anyway it'll make our published crime rate go up?",
            "score": 11,
            "author": "TheSleepingChimera"
        },
        {
            "level": 0,
            "comment": "*...multiple decades of police backlog is uplifting?*",
            "score": 1,
            "author": "pyr0kid"
        },
        {
            "level": 0,
            "comment": "Sorry, did I read properly? There have been cases opened for decades because they did not care to do a DNA analysis? Just woah. The USA is an undeveloped country.\n\nAs usual, I think uplifting news should merge with boring dystopia.",
            "score": 1,
            "author": "Joseluki"
        }
    ]
}