{
    "id": "13nfsqv",
    "score": 3389,
    "title": "Compton unveils city's new indoor vertical farm designed to grow up to 4.5 million pounds of produce annually",
    "author": "Tuckerbomb",
    "date": 1684634547.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/13nfsqv",
    "media_urls": [
        "https://abc7.com/compton-indoor-farm-plenty-fresh-produce-food/13270380/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "We currently produce more than enough food to feed everyone on earth. The problem is it costs so much to move food to places that need it. Indoor grow facilities like that could help mitigate world hunger",
            "score": 514,
            "author": "nowhereman136",
            "replies": [
                {
                    "level": 1,
                    "comment": "I work for an AgriTech company and I really believe in this. It helps eliminate a lot of the transport costs/co2, you still need some local labour, we're working on improving water usage etc.\n\nIt's still priced to a premium at the super market, but I hope this will change eventually. Either way, lots of positives here.",
                    "score": 240,
                    "author": "farox",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "We need to get to work on creating technology to harvest food.  Picking produce is backbreaking horrible work.  There has to be someone who can create a machine that can pick berries and tomatoes..",
                            "score": 30,
                            "author": "meatball77",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "https://www.cnbc.com/video/2019/05/10/root-ai-unveils-a-ripeness-detecting-tomato-picking-robot.html",
                                    "score": 23,
                                    "author": "iluniuhai",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": -17,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm pretty sure human pickers don't smell every tomato they pick. In fact, I'm pretty sure they're picked green and transported while they ripen.",
                                                    "score": 24,
                                                    "author": "bebe_bird",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "No..  but one can offer evidence for the surrounding plants.  And smell changes not only with ripeness, but also with mineral balance",
                                                            "score": -9,
                                                            "author": "peter-doubt"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Are you going to do it/are you currently doing it?\n\nIt’s also still possible for machines to mass pick things and then for a quality control such as a person to sift through as they move along a conveyor.\n\nIf you’re up to hit the fields though more power to you, but if you’re just complaining that you may buy a pack of tomatoes and one tastes more bland then the rest…well then idk what to say other then “come on, man…”",
                                                    "score": 12,
                                                    "author": "Baconation4"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Lol. Have you ever seen humans harvesting tomatoes? At one cent per pound, people are not out there, bent over in the field sniffing, squeezing, carefully evaluating each tomato. There is a color that has been asked for, generally not that red, because they're going to be shipped for thousands of miles, and that's that. In the bucket it goes.",
                                                    "score": 2,
                                                    "author": "iluniuhai"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "We will. I expect a big driver for this will be the mess of immigration workers that the US and UK are currently seeing.\n\nThe blocker for this tech is cheap labor, fix that and the automation will come.",
                                    "score": 14,
                                    "author": "Matshelge",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "California has been having a agricultural labor shortage since 2016. I don't know if the shortage has eased, but Californian ag companies are certainly working on automation.",
                                            "score": 6,
                                            "author": "WhimsicalWyvern"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "If you don't *need* automation, it's not an answer.",
                                            "score": -8,
                                            "author": "peter-doubt",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "We need automation in this space.",
                                                    "score": 8,
                                                    "author": "firearrow5235"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "AppHarvest is the company!",
                                    "score": 1,
                                    "author": "SlumPugMillionaire"
                                },
                                {
                                    "level": 3,
                                    "comment": "Get inmates from prison to do it.  They can serve a useful purpose instead of being locked up all day",
                                    "score": -14,
                                    "author": "ElevatorIcy3033",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "\"Just use slavery, duh.\" - ElevatorIcy3033",
                                            "score": 15,
                                            "author": "That-Maintenance1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No just use criminals. Slavery is immoral and shame on u for suggesting it",
                                                    "score": -9,
                                                    "author": "ElevatorIcy3033"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Ah yes, let's give cops and judges and politicians even more incentive to increase our prison population. \n\nWe already have private prisons, which get paid by the government based on how full they are, lobbying politicians to make harsher laws and increased minimum prison sentences. On top of this, the private prisons are lobbying against mental health subsidies and other things like housing initiatives and food stamps, which all are shown to reduce crime, because they want more crime in the world so they can get paid more to hold the criminals. \n\nLet's not make that worse.........",
                                            "score": 10,
                                            "author": "thefifeman"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "This is a horrible idea with terrible consequences. Just look into prison labour issues.\n\nQuick google gave this result: [‘Slavery by any name is wrong’: the push to end forced labor in prisons\n](https://www.theguardian.com/us-news/2022/sep/27/slavery-loophole-unpaid-labor-in-prisons)",
                                            "score": 5,
                                            "author": "crows_n_octopus"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yet somehow fresh produce can be shipped around the world and still be relatively affordable. Economies of scale and the incredibly cheap cost of moving goods via container ships makes that possible. Before we say it's too expensive to get excess food to hungry people, we should make sure there's actually the will to do it.",
                            "score": 49,
                            "author": "cutelyaware",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not lettuce to Canada!",
                                    "score": 21,
                                    "author": "howard416",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You'll just put maple syrup on it. We're doing you a favor.",
                                            "score": 31,
                                            "author": "cutelyaware",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Don't say it like you're not jealous.",
                                                    "score": 15,
                                                    "author": "PorkRindSalad",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I can hold my syrup as well as the next man",
                                                            "score": 10,
                                                            "author": "cutelyaware"
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "What the fuck else would we put on it",
                                                    "score": 6,
                                                    "author": "FracturedEel"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It's cheap partly because we externalize costs to the environment and to slave like poverty wages. Other people and animals pay the difference in cost for us.",
                                    "score": 7,
                                    "author": "DrWilliamHorriblePhD",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "No question, but that's off-topic",
                                            "score": 1,
                                            "author": "cutelyaware",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "It is directly on topic. If we enforced that companies actually pay those costs instead of pushing them into nature and human slavery, then locally grown food would be substantially more cost competitive.",
                                                    "score": 1,
                                                    "author": "DrWilliamHorriblePhD",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I'm sorry, but that's wishful thinking. Locally grown food is a luxury for rich people and doesn't scale. Same for organic, non GOM, free range, etc.",
                                                            "score": 1,
                                                            "author": "cutelyaware"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Fresh lettuce and greens are not shipped around the world. They are highly perishable shipped as short a distance as possible.",
                                    "score": 16,
                                    "author": "Finagles_Law",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Top result from Google says:\n&gt;Lettuce is currently the world's 620th most traded product. In that year, the US imported $398M in lettuce. **Worldwide, nearly $3 Billion USD is spent on lettuce shipping.** The top 5 International lettuce shippers fulfill more than 75% of the world lettuce trade.",
                                            "score": -4,
                                            "author": "cutelyaware",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That's nearly all between the U.S. and Mexico or equivalent.  People aren't shipping lettuce across the oceans.  \n\nCome on now. This is silly.",
                                                    "score": 15,
                                                    "author": "Finagles_Law",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Clicking the first link gives this:\n\n&gt;Top Lettuce Exporters\n \n\n&gt;* Spain | $864.1 million (29.5%)\n* United States | $538.4 million (18.4%)\n* Mexico | $335.2 million (11.5%)\n* Netherlands | $282.3 million (9.7%)\n* Italy | $218.8 million (7.5%)\n\n&gt; Top Importers\n\n&gt;* Germany | $443M\n* Canada | $436M\n* United States | $398M\n* France | $199M\n* China | $166M\n\n\nYou should really just stop guessing and search for yourself",
                                                            "score": -23,
                                                            "author": "cutelyaware",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "And again, none of that implies ocean transit. The majority of those nations get their lettuce trucked in from the nearest warm country such as Turkey. The Italians export and the Germans import because they're next to each other.  Thats the point I was making.  The Germans are not importing Chinese lettuce by shipping container.\n\nI swear to God, you are trying to be as deliberately obtuse as possible.  Nothing you have posted, nothing, supports the idea that greens are shipped *worldwide* in the same manner as oranges or potatoes.  Just stop. \n\nLearn how to actually interpret the stuff you claim to cite as evidence.",
                                                                    "score": 31,
                                                                    "author": "Finagles_Law",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I'm only reporting what Google reports. I haven't modified it to be obtuse. Again, do your own search if you don't believe me. In fact you've now moved the goalposts twice, so I think it's your turn to cite evidence of your claim that most international lettuce transport doesn't involve container ships.",
                                                                            "score": -26,
                                                                            "author": "cutelyaware",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "This is unreal.  My original comment:\n\n&gt; Fresh lettuce and greens are not shipped around the world. They are highly perishable shipped as short a distance as possible.\n\n\"Around the world\" implies ocean transit. You only cited statistics for lettuce crossing national borders, not realizing that the *shortest point between two places* may cross a national boundary. \n\nI haven't moved any goalposts. I'm taking the time to explain your mistake to you in order to help other Redditors reason better, but you're really trying my patience, and unless you're super neurospicy and just literally unable to let it go, you really need to learn not to do this. \n\nI'm being kind still, so you really should stop now. You are over your head and using terms you don't fully understand like they are Harry Potter spells to win an argument.\n\nFinally, you really need to learn the principle of Occam's Razor, or at least Hanlon's Razor. You are so stuck on the notion of trying to prove capitalism does things in the most cartoon evil way possible that you're reading into your statistics.  The effective shelf life of greens is less than a week.  Container ships take four to six weeks to transit the Pacific. They won't survive the journey.  The person making the more extreme argument has the burden of proof if Occam's Razor cuts against you, friend. So nice try attempting to pull the Uno Reverse.",
                                                                                    "score": 22,
                                                                                    "author": "Finagles_Law",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "The point he's trying to make is that all the top importers and exporters are all still relatively close to each other. Practically all the lettuce in Canada is being shipped from the much relatively closer U.S. and Mexico as opposed to Spain or Italy. Nobody is putting lettuce in boats and sending around the world. They are putting it on trucks or trains and sending it much shorter distances. All of that still counts as international trade",
                                                                    "score": 4,
                                                                    "author": "TheFullTomato",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "&gt; Nobody is putting lettuce in boats and sending around the world\n\nThe US ships lettuce to Chinese Taipei ($21.3M), Japan ($7.98M), and South Korea ($5.22M). Does that count?",
                                                                            "score": 0,
                                                                            "author": "cutelyaware"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It's also about costs: the famines last century in Ethiopia were in the same year as bumper harvests in the other side of the same country but storage and logistics were not developed.",
                                    "score": 6,
                                    "author": "vincyf",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "What year was that?",
                                            "score": 4,
                                            "author": "cutelyaware"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "So? If this is better, shouldn't we still do it?",
                                    "score": 1,
                                    "author": "findingmike",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The question is what to do about starvation",
                                            "score": 1,
                                            "author": "cutelyaware",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I would think indoor farming near populations would have a high upfront cost but lower ongoing costs for water, storage, pesticides and food transport.\n\nUnfortunately much of the problem of starvation has to do with corruption and war and less to do with resources.",
                                                    "score": 2,
                                                    "author": "findingmike",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "This is indeed it.  We're already producing enough food for literally every man woman and child to be fed and to be fed reasonably well.  \n\nWorld hunger has little to do with lack of resources and has way more to do with politics and greed.",
                                                            "score": 2,
                                                            "author": "Ok_Star_4136"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "It might be very useful in places like [Canada](https://www.reddit.com/r/collapse/comments/13ndirz/is_this_the_end_of_lettuce_why_canadas_food/)",
                            "score": 2,
                            "author": "rp_whybother",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's where I am",
                                    "score": 4,
                                    "author": "farox",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I hope you can save your lettuce supply!",
                                            "score": 2,
                                            "author": "rp_whybother",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Working on it!",
                                                    "score": 1,
                                                    "author": "farox"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I am super interested to join the Agritech industry. Where are you working?",
                            "score": 6,
                            "author": "Qptimised"
                        },
                        {
                            "level": 2,
                            "comment": "Could you name a few companies to look into for investment purposes?",
                            "score": 3,
                            "author": "Captain_Waffle",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Not more than a google search. Ours is on track for Series A, but that  is still a few months down the line.",
                                    "score": 3,
                                    "author": "farox"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Vertical farming is a scam.",
                            "score": 1,
                            "author": "Taitaiy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Ok",
                                    "score": 1,
                                    "author": "farox"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "You see these vertical farms also in Japan, mainly because real estate would be way more expensive than the electricity bill or the water bill to maintain such a company.  You'll never see such farms outside of cities, but yes, I agree that it is a good thing overall.",
                            "score": 1,
                            "author": "Ok_Star_4136",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Actually right outside cities. Within driving distance, but where land isn't at such a premium.",
                                    "score": 1,
                                    "author": "farox"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've always heard of vertical farming as a sci-fi concept, but I guess it hasn't been practical so far for reasons that are unclear to me. Hopefully that's changing.",
                    "score": 21,
                    "author": "Generalitary",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In lighting alone with the most efficient LEDs on the market you need about 35 watts per square foot minimum for any full sun crops. So for 1 acre of land that is 1.5 million watts for 12-16 hours a day. The energy requirements are insane. That is why almost all demos for indoor farming are growing herbs and leafy greens with very few calories, they require the least amount of energy to grow.\n\nAnd then you still gotta deal with heating, cooling, and dehumidification.",
                            "score": 12,
                            "author": "IEatBabies"
                        },
                        {
                            "level": 2,
                            "comment": "The single advancement that has made this possible is lighting. LED technology. Indoor &amp; vertical farming has been around for many decades (hydroponics), but the costs of traditional lighting was prohibitive. Now that LED technology has advanced far enough, it is financially viable.",
                            "score": 22,
                            "author": "Chowdmouse",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I would add that monitoring and automation has also made quite an impact.  The amount of small controllers like Arduinos that go into large scale hydroponics operations is enormous.  Hardly any of these operations would be possible if the product needed to be hand farmed much at all, at least not without massive labor exploitation.  Air temp, lighting, nutrient balance and air circulation all have to be measured and monitored at scale.  \n\nThis isn't a reason NOT to do it, but it does lessen the green impact somewhat due to the extensive need for semiconductors and rare earths to manufacture all the necessary chips.  Technology can help a lot here by making all these processes more efficient and the products less disposable and more fixable.",
                                    "score": 10,
                                    "author": "Finagles_Law",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Totally agree that monitoring &amp; automation makes it possible, but did not include that as those have also been used in agriculture/ horticulture for decades. I am no expert at all, just from my limited experience in the field it is the advances in LED lighting that has made farming without sunlight in non-traditional environments (old abandoned walmarts, unused shipping containers for a couple of examples) on a large enough scale to make it financially possible :)",
                                            "score": 1,
                                            "author": "Chowdmouse"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Disney has been vertical farming for years to grow produce for their restaurants. They even have a ride that showcases sort of how they do it. It's pretty interesting.",
                            "score": 8,
                            "author": "bdhw"
                        },
                        {
                            "level": 2,
                            "comment": "Vertical farming is used in Amsterdam also.",
                            "score": 2,
                            "author": "vincyf"
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 5,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The appeal comes from the fact that you can grow whatever produce you want at any time of year. Vertical farms are indoors, so you can control everything about the environment.",
                                    "score": 18,
                                    "author": "BigDoinks710"
                                },
                                {
                                    "level": 3,
                                    "comment": "Currently around 38% of the world's land surface is used for agriculture. It displaces and destroys natural environments and continues to do so.\n\nBeing able to produce large quantities of food in a much smaller area reduces that. It also uses less water and pesticides.",
                                    "score": 23,
                                    "author": "the_other_irrevenant",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "&gt; Currently around 38% of the world's land surface is used for agriculture\n\nI'm assuming you mean of the surface that can viably be farmed, because otherwise that number is off by a magnitude of at least 10.",
                                            "score": 6,
                                            "author": "razpotim",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "This was my source: https://ourworldindata.org/land-use#:~:text=The%20Land%20Area%20of%20the,%25%20of%20the%20Land%20Area).\n\nHappy to be corrected if that's not right.\n\nEDIT: Googling a bit more, https://www.onegreenplanet.org/news/chart-shows-worlds-land-used/ says the same: 71% of Earth's land is habitable, and 50% of the habitable land is used for agriculture. Which equals ~38% of the Earth's **total** land is used for agriculture.\n\nWhy do you think it's incorrect?",
                                                    "score": 4,
                                                    "author": "the_other_irrevenant",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt; The Land Area of the World is 13,003 million ha. 4,889 million ha are classified as ‘agricultural area’ by the FAO (this is 37.6% of the Land Area).\n\nI see, this is much more than other numbers I have read, but it also consists of around 70% of land used for pasture. Regardless, the number was closer to correct than I thought, thanks for providing a source.",
                                                            "score": 9,
                                                            "author": "razpotim",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "&gt;I see, this is much more than other numbers I have read, but it also consists of around 70% of land used for pasture. \n\nThat [same site](https://ourworldindata.org/land-use#:~:text=Definitions%20of%20agricultural%20land%20use,-The%20Land%20Area&amp;text=The%20agricultural%20area%20use%20is,of%20the%20world's%20agricultural%20area) says that 70% is \"permanent meadows and pastures\" and is based on the UN Food and Agricultural Organization (FAO) definition of that term: *‘land used permanently (five years or more) to grow herbaceous forage crops, either cultivated or growing wild (wild prairie or grazing land).’*\n\nIt's land dedicated to feeding livestock so it seems reasonable to include that under agricultural land. \n\n&gt;Regardless, the number was closer to correct than I thought, thanks for providing a source.\n\nGlad I could help. You had me worried there! :D",
                                                                    "score": 3,
                                                                    "author": "the_other_irrevenant"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Same thing as electric cars, centralizing emissions and energy usage. Normal farming is low production emissions/energy, high transport emissions/energy, vertical centralizes it and allows for eventual reduction at a single large point rather than loads of smaller ones.\n\nBig solar farm is easier than solar trucks.\n\nApproximately 18% of emissions from food is transport",
                                    "score": 8,
                                    "author": "graygray97"
                                },
                                {
                                    "level": 3,
                                    "comment": "The video states they can grow 350 times more here than the on the same area of land.",
                                    "score": 4,
                                    "author": "maxirabbit"
                                },
                                {
                                    "level": 3,
                                    "comment": "Not being limited to relying on free energy, but able to take advantage of it where possible, is a large advantage to agriculture. The Midwest only has one effective growing season when using free energy, but large-scale greenhouses can easily operation from mainly solar and wind energy while providing year round output of seasonal product that would otherwise need to be trucked or shipped in.\n\nI will say that lack of horizontal surface area may be an impediment to a perfect green design in vertical farms.  Large, spread out greenhouses are easier to design to take advantage of free energy.",
                                    "score": 4,
                                    "author": "Finagles_Law"
                                },
                                {
                                    "level": 3,
                                    "comment": "I think the main benefit is logistics, it allows you to have a food source near to the consumers in a population-dense area.",
                                    "score": 3,
                                    "author": "Generalitary",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes, this is the answer!\n\nVeg that is grown in rural areas has to be trucked to the cities, this reduces that a LOT. Also, with reduced distance, comes freshness.",
                                            "score": 1,
                                            "author": "ProtoplanetaryNebula",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "And we can further ease the burden by normalizing the use of roof space for farming or solar paneling.",
                                                    "score": 1,
                                                    "author": "Generalitary"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Taste and freshness.  I buy this stuff for about 25-35 percent markup over a regular lettuce head.",
                                    "score": 2,
                                    "author": "Guiac"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It’s almost as if prioritizing profits over literally everything else isn’t exactly the best way to make sure everyone’s needs are met.",
                    "score": 11,
                    "author": "System0verlord"
                },
                {
                    "level": 1,
                    "comment": "Yes. World hunger is a distribution problem, not an amount-of-food problem",
                    "score": 5,
                    "author": "WhatAGoodDoggy"
                },
                {
                    "level": 1,
                    "comment": "It's also because we grow a ton of food to feed the things we like to eat.",
                    "score": 18,
                    "author": "CaravelClerihew",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Someone was trying to tell me we need the meat industry to help feed the growing population. Which is crazy. Cows require 100lb of animal feed for every single pound of beef produced. We can cut out the middle man (or cow) and just give the 100lb of feed to the people. Well, not literally give them cow food, but you get what I'm saying. I enjoy eating meat as much as the next guy, and I'm not suggesting everyone go vegan, but the meat industry is undeniably wasteful and a massive contributor to climate change. We would all benefit a lot by cutting down the amount of meat we consume.",
                            "score": 11,
                            "author": "nowhereman136",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People don’t eat sileage, you don’t just “cut out the middleman” when it comes to animal feed vs what people eat.",
                                    "score": -3,
                                    "author": "AlmostAThrow",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "As I said, not literally give people cow food. However, 40% of corn grown in the US goes to feeding live stock. We get 1lb of beef for every 100lb of corn given to a cow. Wouldn't it just be easier to give the person 100lb of corn? How much land does it take to grow 100lb of corn? Can we use that land and resources to grow other crops for a more rounded diet that just corn? How much fruit, vegetables, and nuts can we grow with the land, water, and other resources we currently use just to feed cows?",
                                            "score": 11,
                                            "author": "nowhereman136",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "also. the land that is currently being used to grow 100lbs of corn per cow, can be used to grow different things that we actually do eat. I hope with the increasing normalcy of lab grown meat we can make a pivot as a species.  for many they won't make the sacrifice of not eating meat despite knowing its usually unethical.  but when that sacrifice doesn't need to be made to no longer participate in the unethical treatment of other species? the change can be made with no feeling of loss or sacrifice to even the most self minded consumer",
                                                    "score": 3,
                                                    "author": "occulusriftx"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "There's undoubtedly some land that can't be farmed so it's best to use animals to convert that to calories. However, it's also equally true that our appetite for meat has meant that otherwise good farm land or rain forest land has been used to feed cattle.",
                                            "score": 3,
                                            "author": "CaravelClerihew"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Please don't try to feed a population on just grains..Meat converts basic stuff into very nutritious food for people. Malnutrition is something worth fighting.",
                                    "score": -7,
                                    "author": "ZDTreefur",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Not just grains but also fruits, vegetables, and nuts. The amount of land, water, and resources used to farm cattle could be much more efficiently used farming other crops. We aren't cavement anymore that need meat to maintain a healthy diet. We can live perfectly healthy lives getting our protein and other nutrients from specifically grown crops. \n\nAnd again, I'm not suggesting anyone give up their meat completely (I'm not gonna stop), just to be conscious of the impact their consumption has and maybe cut back. Most people already have a higher protein diet than their body requires and can benefit from cutting back.",
                                            "score": 4,
                                            "author": "nowhereman136"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The problem is that nobody pays for moving food to places that need it. No matter how cheap, if there's no profit, it isn't done. \nFor the same reason, we won't see vertical farming in places like Somalia: you need huge investments to build and run such a farm. Who is going to pay for that?",
                    "score": 12,
                    "author": "fip-0-matic",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "The idea is that these facilities would cost less in the long run than constantly shipping food. It's easy enough to find people willing to donate some money to have food shipped in, but those people aren't gonna constantly be donating. Instead, they can donate to one of these facilities, which has a much clearer operating cost and benefit the community over a longer period of time. \n\nAlso, I recognize that as of right now these facilities are fairly expensive for the the amount of food they produce. However, like any technology, the price will go down as the product improves.",
                            "score": 4,
                            "author": "nowhereman136",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "If it needs complex maintenance, then that's not going to happen in places that don't have enough engineers",
                                    "score": 6,
                                    "author": "vincyf"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I always found the \"it's logistics\" issue non-trivial. We literally design and build rockets that send payloads into orbit. Costing tens of billions each launch.\n\nWe have the money and can design the infrastructure. We purposely do not.",
                    "score": 13,
                    "author": "RagingD3m0n",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "There has never been a ten billion dollar launch.  The fact that you think every launch is multiple tens of billions shows that you don't really understand much.  Which is probably why you think the logistics of a worldwide food delivery system are non-trivial.",
                            "score": 29,
                            "author": "trumpet575",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "how much does an average launch cost realistically?",
                                    "score": 6,
                                    "author": "happyducksandclowns",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "There isn't really a good answer to that question because there is no \"average launch\" but a quick Google search says 10,000-25,000 USD per kg.  Using 6,500 kg for a very large satellite and the top end of that launch cost, that comes out to $162,500,000, or 123x smaller than the tens of billions the previous comment mentioned.  Of course this doesn't include the cost of the satellite itself, but you're not going to find a 19.8 billion dollar satellite to cover that ground (James Webb is the most expensive satellite ever launched at around $10 billion and that is an extreme outlier).",
                                            "score": 18,
                                            "author": "trumpet575"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "\"NASA spent $10.6 billion to develop the Space Shuttle and its related components\"\n\nhttps://www.planetary.org/space-policy/sts-program-development-cost\n\nSorry not per launch, it only cost a hundreds of millions per launch.",
                                    "score": 1,
                                    "author": "RagingD3m0n"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "In many locations we have tried to build the infrastructure 2-3 times over in living memory.\n\nBuilding the infrastructure is easy.  Defending it and keeping it operational in a location where a large segment of the population is actively trying to steal our destroy it is not.  At least not in the political climate of the last 60 years or so.",
                            "score": 2,
                            "author": "shitposts_over_9000",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People steal infrastructure? I know of copper thieves but with fibre optics that hopefully should get phased out. I can't think of other stuff worth stealing?",
                                    "score": 2,
                                    "author": "SauronSauroff",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Ag and food infrastructure is vehicles, tools and equipment mostly.  Maybe nobody is going to steal the road itself, but they will steal your plough or the truck that gets the goods to market, that shit even happens is the states.  It is mostly metal and it has high power demands so fiber optic is never going to fix that as fiber is a terrible way to transmit power.\n\nThe larger problem in most places with a serious long term food issue is the political instability.\n\nWhen you have groups that are controlling the population by being the only source of goods they will destroy your infrastructure just to eliminate competition.\n\nWhen you have a civil war they will destroy your infrastructure to prevent you from supplying the enemy.\n\nWhen you have communism in a poor country you both have the risk that your property, tools &amp; supplies brought in to create infrastructure will be stolen by the government combined with the eventual destruction if whatever you built by time combined with the locals inability to maintain it.\n\nWhen you have organized crime like cartels you often have all of those things + the motivation to destroy other sources of employment + a significant risk of the foreign aid workers being killed or held for ransom.\n\nIt doesn't require much destruction at all to completely break down most of these efforts.  Usually you just have to break one link in the supply chain, particularly when you are trying to introduce a completely foreign methodology.  Ambush enough delivery drivers or scare off the labor and it is done for, the equipment will be abandoned or minimally guarded and eventually someone will walk off with it.\n\nEven religious charities and nonprofit NGOs eventually cut their losses and spend their resources elsewhere on a population that is less impossible to help.\n\nThe most recent widely reported example was when the Al Shabaab militants effectively stopped all aid into a big chunk of Somali. \n\nWhile you could create a system that not only brings food aid, but also brings enough military firepower to force it through, but such a group is understandably viewed as a greater risk to local sovereignty and would have even fewer opportunities where they are permitted to get involved and would have to turn down some of those opportunities when it is clear the host government is not interested in their military capabilities than their aid.\n\nThis example in Compton is much simpler to explain.  Produce is one of the first things to go when local crime starts to create a food dessert.  This produce will be well above market rates to begin with and at least initially have no significant local demand, but it will be low enough volume that it can still be sold as a novelty item in more affluent areas.\n\nIf it ever scales up to the point of being significant that will go one of three ways: increased labor and transportation demand will attract more people wanting a  blue collar job in a dense urban environment and the area will be gentrified naturally and large vertically-integrated grocery chains will take interest in the area again bringing in much lower cost produce.  The project achieves it's goal in a roundabout manner.\n\nThey scale without drawing a significant local workforce and have to force some very local gentrification through private security and dealing with the government to get some very targeted law enforcement (several of my suppliers are in this boat right now)\n\nThe third option is that they find that outside the local high end markets there isn't enough political lean for people to pay many times more for commodity products as a moral issue and that their growth is much more limited than they expect.  This leaves them without the ability to reach a critical mass that would naturally affect the area and also without the political and financial resources to force it.",
                                            "score": 5,
                                            "author": "shitposts_over_9000"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "We? Plenty of countries manage to feed themselves. The countries with the problems are independent and won't let Western corporations come in sort out logistics.",
                            "score": -1,
                            "author": "Thestilence"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Isn't a big part of the problem that we use a TON of the plants we grow to feed to incredibly inefficient meat animals?",
                    "score": 6,
                    "author": "StinkMartini"
                },
                {
                    "level": 1,
                    "comment": "The first part is certainly true, the second part not so much.\n\nBuilding vertically for any purpose is 60% more expensive.  Building anything is almost infinitely more expensive than the nearly nothing you have to build to grow plants in the dirt.\n\nBy the time we area would be economically stable enough to support such a construction project they would be many times over stable enough to import food from a much cheaper location.",
                    "score": 2,
                    "author": "shitposts_over_9000",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "With current technology, that can definitely be reduced. There's no inherent reason it can't be cheaper if we get costs down enough - it has a lot of inherent advantages over normal farming.",
                            "score": 0,
                            "author": "LucyFerAdvocate",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "it is difficult with any amount of technology for a process that only requires cheap land where the values are low not to beat a process where you require much more expensive land, a significant additional expense in improvements and then a long term commitment to far greater costs of upkeep.\n\nIf the world population was growing to infinity this might be a realistic approach.  Current predictions have the population peaking in the next 50 years and then declining after another 10.",
                                    "score": 1,
                                    "author": "shitposts_over_9000",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's far more reliable, more consistent, less susceptible to drought, more harvests per year, less labour intensive, basically immune to pests, etc. Why is it hard to imagine it being better then traditional farming if the technology reduces the cost barriers?",
                                            "score": 0,
                                            "author": "LucyFerAdvocate",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "because of the scales involved &amp; because most of the theoretical future cost reductions would apply just as much to traditional farming as they do to farming inside of a hollowed out building.\n\nthe constant is the difference in price of the land and the cost of building something vs building nothing.\n\npest control is only 1-2% of the costs in farming and while this approach would require less for things like insects, it would require far more for other diseases.\n\n\"less labor intensive\" is offset by the increased labor rates and the additional systems overhead.\n\nyou get an extra harvest or two potentially, but at the cost of year-round climate and lighting costs.\n\nthere are advantages, but also nearly as many disadvantages &amp; most of the advantages can be beat by the rates on imported products from another area doing traditional farming at a much lower infrastructure cost.\n\nthis is one of those things that has been touted as \"right around the corner\" for almost half a century and it always fails in the end because whatever develops ends up pushing the field farmer's price or output to a point where it still overwhelms creating an entire artificial environment.",
                                                    "score": 1,
                                                    "author": "shitposts_over_9000",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's certainly not right around the corner, but it seems pretty much inevitable. An extra few harvests is a very big deal and as the world (hopefully) develops and gets richer, it will no longer be as easy to outsource to poor countries. It also seems far easier to automate a hydroponic/vertical farm. I'm not expecting the world to switch to it this decade, but it certainly seems like a worthwhile technology to invest in.",
                                                            "score": 0,
                                                            "author": "LucyFerAdvocate",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Im not even talking about outsourcing to a poor country, vertical farming in California isn't even competitive with farming a few states away.\n\nYou may be correct that after the population begins to shrink we might end up with a more globally equal wealth distribution, but that will not help vertical farming take off either.  That would result in an almost 5x reduction in value in land in the USA.  Even more in the EU,  while it would only about double prices in Russia and Eastern Europe.\n\nIf that were to happen you would not only not need vertical farming because the demand isn't high enough but also because the land prices would make building vs using the land that is already there an even more expensive proposition.",
                                                                    "score": 1,
                                                                    "author": "shitposts_over_9000",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "You seem to be assuming that the only advantage of vertical farming is less land use, which, as I have already said, isn't true.",
                                                                            "score": 0,
                                                                            "author": "LucyFerAdvocate"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "It also can save huge amount of space which can be returned to natural uncultivated Land, protecting biodiversity and the climate. (If the energy used is greenhouse gas free ofc)",
                    "score": 3,
                    "author": "SteakHausMann"
                },
                {
                    "level": 1,
                    "comment": "This is partly correct, but blame also lies at a broken economic system that is not movitated to ensure the equivtable distribution of resources.",
                    "score": 1,
                    "author": "Unitedite"
                },
                {
                    "level": 1,
                    "comment": "Countries that can't figure out roads, refrigeration, supermarkets etc aren't going to get vertical farming working",
                    "score": 1,
                    "author": "Thestilence"
                },
                {
                    "level": 1,
                    "comment": "Exactly. Why are we building indoor farms in California, a place with year round growing season and tons of farmland?  Do this in Alaska and for the cost of heating you can still undercut prices on imported produce.",
                    "score": 1,
                    "author": "BaylisAscaris",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Because the tech is still too new. Build it in a place that can afford for it to fail so they can work out all the kinks. If it succeeds in California, then investors are going to be willing to build one in Alaska or wherever",
                            "score": 1,
                            "author": "nowhereman136"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Taking the subreddits name literally I see",
            "score": 35,
            "author": "Jos3ph"
        },
        {
            "level": 0,
            "comment": "Straight out of Compton!",
            "score": 31,
            "author": "IPeedOnTrumpAMA",
            "replies": [
                {
                    "level": 1,
                    "comment": "And onto my dinner plate!",
                    "score": 11,
                    "author": "kfunkapotamus"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Straight outta Cropton.",
            "score": 25,
            "author": "ItsTomorrowNow"
        },
        {
            "level": 0,
            "comment": "Not what I was expecting to come straight outta Compton",
            "score": 8,
            "author": "Noveetus"
        },
        {
            "level": 0,
            "comment": "Amazing. Surely a glimpse of the future. Pair this with renewable energy and this could solve a lot of problems.",
            "score": 58,
            "author": "sasquatch606",
            "replies": [
                {
                    "level": 1,
                    "comment": "You know it’s bad when Compton starts prepping for the apocalypse",
                    "score": 6,
                    "author": "businesskitteh"
                },
                {
                    "level": 1,
                    "comment": "Add cheap desalinization and we're (insert superlative here)",
                    "score": 23,
                    "author": "paracog",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Say that desalinization is affordable (because I guess more energy efficient or we find some extraordinary cheap energy source), what do we do with the produced brine (1.5L of brine for every liter of fresh water) ? \n\nRe injecting the brine into the ocean is not a major issue for the ocean at large but it is likely very bad for the local environment and species next to the plant. \n\nDon’t think we could pile it up.  \n\nWe could probably extract some component minerals from it but I doubt it’s worth anything to companies at the moment when you can still mine most of the stuff found in there for much cheaper. \n\nDesalinization sounds like it’s only worth it if your country has actually no water source. If you do have some, it’s likely better to invest money into not wasting water we already have. \n\nWriting this comment, I actually looked up how much water is wasted by bad pipes, it was something ridiculous like 2 or 3 trillions gallons of water in the US alone. Consider the equivalent resource produced by desalinization, the brine output would be 3 to 4.5 trillions gallons, that’s roughly 25 trillions pounds of salt, just for the water that leaks out of shitty pipes, not even for the one we actually consume.",
                            "score": 3,
                            "author": "m3xm"
                        },
                        {
                            "level": 2,
                            "comment": "You can reduce desalinization back to power. So 1 stone two birds there.",
                            "score": 8,
                            "author": "farox",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "RO equipment isn’t that cheap.",
                                    "score": 3,
                                    "author": "howard416"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Black Jesus getting it done in Compton.",
            "score": 3,
            "author": "NomadJones",
            "replies": [
                {
                    "level": 1,
                    "comment": "![gif](giphy|g5qEgeTM20nnO|downsized)",
                    "score": 3,
                    "author": "Njacks64"
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is SO cool.  I've always imagined having a few skyscrapers in big cities that were growing all types of produce. Just make the bottom floor the market, next up a food bank, all the middle floors growing areas, top floor a fancy restaurant.  I can't wait to see more of this in the future.  It just makes sense in terms of transportation and cost.  Helps to learn what we'll need to do in space and other planets as well.",
            "score": 3,
            "author": "YakiVegas"
        },
        {
            "level": 0,
            "comment": "Straight outta Compton, a crazy botanist named Ice Green,\n\nFrom the group called Farmers With Attitude.\n\nWhen I'm called off, I got a sprout off,\n\nSqueeze the trigger, and bodies of plants get hauled off.\n\nYou too, boy, if you mess with me,\n\nThe pests are gonna have to come and get me.\n\nOff your crops, that's how I'm going out,\n\nFor the punk insects that's showing out.\n\nFarmers start to mumble, they wanna rumble.\n\nMix 'em and cook 'em in a pot like gumbo.\n\nGoing off on a farmer like that,\n\nWith a gat that's pointed at your rat.\n\nSo give it up smooth,\n\nAin't no telling when I'm down for a jack move.\n\nHere's a planting rap to keep y'all dancing,\n\nWith a crime record like Charles Manson.\n\nLED lights are the tool,\n\nDon't make me act the hydro-fool.\n\nMe you can go toe to toe, no maybe,\n\nI'm knocking pests out the box, daily.\n\nYo, weekly, monthly and yearly,\n\nUntil them dumb bugs see clearly,\n\nI ain't down with the capital D-D-T.\n\nBut still, you can't mess with me.\n\nSo when I'm in your neighborhood, you better duck,\n\n'Cause Ice Green is crazy as...\n\nAs I leave, believe I'm stomping,\n\nBut when I come back, boy, I'm coming straight outta Compton.\n\nStraight outta Compton,\n\nAnother crazy farmer bro,\n\nMore crops I grow, yo, my rep gets bigger.\n\nI'm a bad botanist and you know this.\n\nBut the ones that don't, I show this.\n\nHydroponics is the scene I'm from,\n\nYou want the crops, boy, you're gonna get some.\n\nJust like Burgess, the definition is jacking,\n\nOr when legally armed it's called packing.\n\nShoot a pest in a minute,\n\nI find a good piece o' land, I go up in it.\n\nSo if you're at a show in the front row,\n\nI'm gonna call you out if you're not in the know.",
            "score": 5,
            "author": "MrWeirdoFace"
        },
        {
            "level": 0,
            "comment": "It's a shame they don't make use of sunlight too, but maybe that makes it more difficult to automate.",
            "score": 3,
            "author": "cutelyaware",
            "replies": [
                {
                    "level": 1,
                    "comment": "Some of that is due to the controlled environment, which means they are super strict about keeping out insects and other nasties.",
                    "score": 13,
                    "author": "marcred5",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "If only there was a material both transparent and a barrier to pests",
                            "score": -6,
                            "author": "cutelyaware",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The sun has 3 major problems in this system. 1. It’s neither guaranteed nor constant. Some indoor systems are lit 24/7 to maximize growth at a steady rate. 2. It’s hot as fuck AND, as per point 1, that heat fluctuates. These systems are designed around total control. 3. The sun comes from one direction. This is a huge hindrance in vertical systems. Either the stacks need to spin or you’ll get uneven and less predictable growth.",
                                    "score": 17,
                                    "author": "AlmostAThrow",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Genuine question- could using mirrors help alleviate the issue of rotation? I agree with your other points, but I feel like long reflective tubes could \"pipe\" sunlight in. Is that actually feasible or am I doing sci fi logic?",
                                            "score": 2,
                                            "author": "MajorMandrake",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Something like that is absolutely feasible, but quite likely not economical to do when compared to the abundant, easily controllable, cheap and slim LEDs available nowadays.",
                                                    "score": 3,
                                                    "author": "ScottieRobots"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Like I already said: \"difficult to automate\". There's no problem with it in principle. To your points:\n\n1) The intensity of the lighting can be adjusted automatically. When the sun shines, it will simply use less energy to light the place. \n\n2) Generated light also ends up as heat.\n\n3) See issue 1",
                                            "score": -8,
                                            "author": "cutelyaware",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Number 2 is more a problem than a benefit. Most leafy greens like it on the cooler side. They're spring time crops for the most part. In the warmer months it would be a lot of work to mitigate.",
                                                    "score": 2,
                                                    "author": "TheFullTomato",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You're missing the point. I'm saying that augmenting the artificial light with natural light doesn't make the heat problem better or worse. You have to deal with it either way, and to the same degree. Or to put it another way, the problem is with the light demands of the plants, not the type of light used to provide it.",
                                                            "score": 1,
                                                            "author": "cutelyaware"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Greenhouses exist but in a vertical farm only the top layer can see sunlight. The other layers are in the shade of the top. And the LED light that shines on tomatoes is blue, while the LED light that shines on the leaves is red.",
                                    "score": 2,
                                    "author": "vincyf"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "A bit more than 2000 tonnes. Neat.",
            "score": 2,
            "author": "Baggytrousers27"
        },
        {
            "level": 0,
            "comment": "This could be the future of farming, 68% of the world will live in cities by 2050",
            "score": 2,
            "author": "Captainirishy"
        },
        {
            "level": 0,
            "comment": "Time to repurpose skyscrapers.",
            "score": 2,
            "author": "daaave33"
        },
        {
            "level": 0,
            "comment": "Straight outta Compton, crazy motherfucker motherfuckers growing Iceberg.",
            "score": 2,
            "author": "ShankThatSnitch"
        },
        {
            "level": 0,
            "comment": "That's a lot of weed",
            "score": 3,
            "author": "Lwmasa"
        },
        {
            "level": 0,
            "comment": "- Compton\n\n- designed to grow up to 4.5 million pounds of **leafy greens** annually\n\nHmmm. 🚬🤔",
            "score": -1,
            "author": "Heerrnn"
        },
        {
            "level": 0,
            "comment": "Lol sure bro not a grow house at all.  Dr. Dre presets The Chronic (Problem of Sustainable Produce) 2023",
            "score": -8,
            "author": "booksmctrappin"
        },
        {
            "level": 0,
            "comment": "Chat GPT says that's enough to feed 8224 adults per year: \n\n*The amount of produce required to feed a certain number of adults yearly can vary depending on several factors, including the types of produce, the dietary needs of the individuals, and their consumption patterns. Additionally, the weight of produce can vary depending on the moisture content and density of different fruits and vegetables.\n\nTo provide a rough estimate, let’s assume an average adult consumes around 1.5 pounds (0.68 kg) of produce per day, which includes fruits and vegetables. Multiplying this by 365 days in a year, it comes to approximately 547.5 pounds (248 kg) of produce per adult per year.\n\nDividing 4.5 million pounds by 547.5 pounds, we get an estimate of around 8,224 adults who could be fed for a year with that amount of produce.\n\nPlease note that this is a general estimate and may not accurately reflect individual dietary needs or consumption patterns. Additionally, factors such as storage, distribution, and waste should also be considered when evaluating the practicality of using a specific amount of produce to feed a certain number of individuals.*",
            "score": 0,
            "author": "myballstaste"
        },
        {
            "level": 0,
            "comment": "how is this news, the Dutch have been doing this for decades...",
            "score": -6,
            "author": "darkshifty",
            "replies": [
                {
                    "level": 1,
                    "comment": "Now it's in Compton.",
                    "score": 3,
                    "author": "Researchgrant"
                }
            ]
        },
        {
            "level": 0,
            "comment": "It's what I've been thinking ever since weed was legalized in my state. Only so many billions of dollars can flow into the market before greenhouses (aka money making rooms) get kicked up to the next level.",
            "score": 1,
            "author": "charyoshi"
        },
        {
            "level": 0,
            "comment": "The United States has the biggest prison population, per capita, of any country in the world.   That's more than enough inmates to be used for good.  I agree private prisons should be abolished  because u are right it gives an incentive to keep people imprisoned, longer than they should.",
            "score": 1,
            "author": "ElevatorIcy3033"
        },
        {
            "level": 0,
            "comment": "How about investing in infrastructure and education and community programs that actually work rather than pretending some private test pilot will save the poor's.",
            "score": 1,
            "author": "Whoretron8000"
        },
        {
            "level": 0,
            "comment": "Is anyone else in AppHarvest? I honestly believe this company will be an industry leader in the AgTech sector. AgTech is here to stay",
            "score": 1,
            "author": "SlumPugMillionaire"
        },
        {
            "level": 0,
            "comment": "Now if only there was a seriously depressed and run down city in the mid west that had thousands of square miles of auto factories sitting empty.... a city that needs jobs and new economies and new industries to take over what left.  \n\n\nIt would be like a fukcing miracle.  \n\n\nThat I've been talking about for 15 years and never had the money or resources to put together.  \n\n\nLOVE that this is happening in Compton.... love this so much!",
            "score": 1,
            "author": "Wwwweeeeeeee"
        },
        {
            "level": 0,
            "comment": "I've always heard of vertical farming as a sci-fi concept, but I guess it hasn't been practical so far for reasons that are unclear to me. Hopefully that's changing.",
            "score": 1,
            "author": "EffectiveAlert9006"
        },
        {
            "level": 0,
            "comment": "Could you name a few companies to look into for investment purposes?",
            "score": 1,
            "author": "Tricky_Artichoke2215"
        },
        {
            "level": 0,
            "comment": "So? If this is better, shouldn't we still do it?",
            "score": 1,
            "author": "Away_County_4606"
        },
        {
            "level": 0,
            "comment": "Could you name a few companies to look into for investment purposes?",
            "score": 1,
            "author": "scr_e1wballuns_mil"
        },
        {
            "level": 0,
            "comment": "So? If this is better, shouldn't we still do it?",
            "score": 1,
            "author": "Weird_Philosopher121"
        },
        {
            "level": 0,
            "comment": "So? If this is better, shouldn't we still do it?",
            "score": 1,
            "author": "Environmental_Try539"
        },
        {
            "level": 0,
            "comment": "If this is any sort of effective Compton will be gentrified in the next 10 years.",
            "score": -3,
            "author": "TyDogon",
            "replies": [
                {
                    "level": 1,
                    "comment": "I don't know why your are being downvoted.  For it to be successful in the long term the area would have to improve just to keep labor and transportation costs reasonable.",
                    "score": 2,
                    "author": "shitposts_over_9000"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Weed time yay",
            "score": -4,
            "author": "Fecal-Wafer"
        },
        {
            "level": 0,
            "comment": "“produce”",
            "score": -7,
            "author": "redx1105"
        },
        {
            "level": 0,
            "comment": "Find me an indoor vertical farm that grows potatoes, carrots, onions, turnips, beets, cabbage and other brassicas, garlic, tomatoes, cucumbers, Eggplants, rice, cassava,  maize, plantains, sorghum, soybeans, sweet potatoes, wheat, rye, barley, or yams. Until then I will remain underwhelmed with futuristic indoor, high-rise gardening.",
            "score": -2,
            "author": "Med_sized_Lebowski"
        }
    ]
}