{
    "id": "13nj60i",
    "score": 323,
    "title": "'The love that's in the atmosphere is just palpable': Drag Story Hour dazzles its audience",
    "author": "viovetf",
    "date": 1684644411.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/13nj60i",
    "media_urls": [
        "https://www.usatoday.com/story/news/nation/2023/05/17/drag-story-hour-nyc-pride/11697032002/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "To all kids this is just super fun dress up\n\nTo me this is also super fun dress up\n\nMy brother bought us tickets to a show in LA this month as a bit of a joke. He had more fun there than at the Lakers game 😂❤️",
            "score": 34,
            "author": "ThiccThighSurprise"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -65,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "These days of almost constant domestic terrorist attacks being brave enough to be yourself, even if the right wing wants to kill you for it, makes you a role model in my eyes.",
                    "score": 49,
                    "author": "Meta_Professor"
                },
                {
                    "level": 1,
                    "comment": "They were put on a pedestal for taking time out of their days to read to children at a public library. Then they were denigrated and attacked for providing a community service. They were again put on a pedestal for continuing to perform this community service after being threatened by hate groups.",
                    "score": 3,
                    "author": "ReflectionEterna"
                },
                {
                    "level": 1,
                    "comment": "So uhh, Rosa Parks just sat on a bus.\n\nThat's it.\n\nGuess she was no role model either, right?",
                    "score": 37,
                    "author": "Haiku_Time_Again",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;So uhh, Rosa Parks just sat on a bus.\n\n&gt;That's it\n\nI mean Gov. Culture war down in Florida has forced textbooks to remove the fact that Rosa Parks was Black so at least in Florida the answer is yes.\n\n[A publisher removed references to Rosa Parks' race in a draft of its textbook to comply with Florida's laws,](https://www.businessinsider.com/florida-textbook-removed-rosa-parks-race-comply-state-desantis-rules-2023-3?op=1)",
                            "score": 11,
                            "author": "Sariel007"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This has the same energy as all the comments by cishet dudes claiming they have it worse than trans people.",
                    "score": 15,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "Reading a story to kids isn’t a pedestal.",
                    "score": 22,
                    "author": "inmatenumberseven"
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": -3,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Because they want to. That's it.",
                    "score": 31,
                    "author": "MudraStalker",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": -55,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The most cruel and selfish people in the world think they're the ones with the moral high ground more often than not.",
                                    "score": 46,
                                    "author": "ShadowDurza",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": -55,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Just trying to put things in perspective. I personally think one of the heights of human arrogance is a willingness to judge and assign labels. A lot of people have suffered and died over what a small amount of people decided what is or isn't moral.",
                                                    "score": 29,
                                                    "author": "ShadowDurza",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": -39,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I'm just another human with my own, slightly different, perspective. Perspective is more than just everything, it is the one thing that decides all things. We all live in the worlds of our own making, and yet all of those worlds move as one whether we see it or not.\n\nBut at the end of the day, I won’t claim I'm more enlightened than the next guy.",
                                                                    "score": 7,
                                                                    "author": "ShadowDurza",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Everything wiggles, and that wigglyness is complicated.",
                                                                            "score": 4,
                                                                            "author": "Oatcake47"
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I will. Forget the next guy, lol. Mostly kidding.",
                                                                            "score": 0,
                                                                            "author": "treethirtythree",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "If it wasn't obvious, I believe in the power of the mind. That's why I believe trans people are every bit as valid as anyone else.\n\nWas it ever really about the children? It can't be any worse than children learning swear words or watching violent or suggestive TV.",
                                                                                    "score": 4,
                                                                                    "author": "ShadowDurza",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Just to add on, they aren't saying judgements and labels are bad, but the arrogance of humans to easily/willingly assign them to groups without thinking of the reality. For example there are those who assign people to \"gender dysphoria\" and there's also \"trans\" and it might be easy to say those are the same thing and lump them under one label or the other, but the reality is that it's not a complete overlap. Too often people jump to conclusions, that's their arrogance.",
                                                                    "score": 10,
                                                                    "author": "bogglingsnog",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": -2,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I think [gender dysphoria diagnosis](https://www.mayoclinic.org/diseases-conditions/gender-dysphoria/symptoms-causes/syc-20475255) has several key requirements that not all trans people will meet. There are trans who simply wish they had another body type or genetics, while still accepting the body they were born with. Hell I think anyone who likes the idea of gene therapy wishes for some kind of genetic improvement, in which case who has the right to say looking like another sex is any worse than wanting huge muscles or demon horns or whatever.\n\nI guess that could be a problematic example overall, so maybe another example is that scientists definition of \"fruits\" and culinary definitions of \"fruits\" are different - scientists found empirical categories while culinary classifies them by historical precedent and usage/purpose in cooking. Both groupings are useful and valid but it would take a certain kind of \"arrogance\" to say one is better than the other.",
                                                                                    "score": 8,
                                                                                    "author": "bogglingsnog",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Explain how any of this is immoral.",
                                    "score": 9,
                                    "author": "Haiku_Time_Again",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[removed]",
                                            "score": -1,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "&gt;Dressing in drag is a sexual thing. \n\nUmm, no it isn't.",
                                                    "score": 15,
                                                    "author": "Haiku_Time_Again",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "If it were a sexual thing, I would expect less dressing in the first place. These people who think drag shows mean waving genitalia around are purely ignorant.",
                                                            "score": 5,
                                                            "author": "Zakluor"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "[removed]",
                                                            "score": -1,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Drag and crossdressing aren't the same things.\n\nThe Rockettes don't put on shows wearing sweaters and jeans, either.  They must be a sexual performance, right?\n\nYour ignorance is palpable.",
                                                                    "score": 8,
                                                                    "author": "Haiku_Time_Again",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[removed]",
                                                                            "score": 0,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "It’s just plain old theatre. Saying all drag is sexual is like saying all movies are sexual because some are.",
                                                                                    "score": 7,
                                                                                    "author": "inmatenumberseven"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}