{
    "id": "13t5zbi",
    "score": 16775,
    "title": "Rwanda’s life expectancy has increased by 20 years in the last 20 years and healthcare insurance coverage is at 90%",
    "author": "icelandichorsey",
    "date": 1685189988.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/13t5zbi",
    "media_urls": [
        "https://www.thinkglobalhealth.org/article/rwandas-health-care-success-holds-lessons-others"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "They will be immortal soon!",
            "score": 543,
            "author": "NothingGlad1024",
            "replies": [
                {
                    "level": 1,
                    "comment": "They might already be, if their life expectancy increases by one year each year.",
                    "score": 231,
                    "author": "not_old_redditor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In Africa, every 365 days a year passes.",
                            "score": 135,
                            "author": "bargu",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You can't prove that.",
                                    "score": 29,
                                    "author": "noteverrelevant",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I can actually prove it’s not true. There’s this thing called leap year.",
                                            "score": 26,
                                            "author": "poop-dolla",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "In Africa, a leap year is also a leap year.",
                                                    "score": 14,
                                                    "author": "bargu",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "In Africa, a leap year is 366 days.",
                                                            "score": 10,
                                                            "author": "poop-dolla",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "In Africa, at the end of the day, it’s night",
                                                                    "score": 11,
                                                                    "author": "Least-March7906",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "In Africa, I bless the rains.",
                                                                            "score": 6,
                                                                            "author": "poop-dolla"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "In Africa, it doesn't matter if you're gay, straight or bisexual, at the end of the day, it's night.",
                                    "score": 23,
                                    "author": "lEatSand"
                                },
                                {
                                    "level": 3,
                                    "comment": "Well stop clapping then",
                                    "score": 7,
                                    "author": "cortez0498"
                                },
                                {
                                    "level": 3,
                                    "comment": "How does that convert to a New York minute?",
                                    "score": 2,
                                    "author": "GenericUsername_1234"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They're getting like a year every year!",
                    "score": 8,
                    "author": "RGB3x3"
                }
            ]
        },
        {
            "level": 0,
            "comment": "For q country that suffered such horrific traumas in the 90s with the war they have really recovered well and are really on the ball. It's really, really impressive.\n\nIn particular I really love how they hate non-reusable plastics and will happily screw over anyone who tries to violate the law in that regard.",
            "score": 134,
            "author": "TheSameButBetter",
            "replies": []
        },
        {
            "level": 0,
            "comment": "God people here are so ignorant. Rwanda has transformed itself into one of the leading countries in Africa. And women have played a leading role. Great health care, education &amp; innovation. I’d love to visit someday!",
            "score": 1006,
            "author": "aria606",
            "replies": [
                {
                    "level": 1,
                    "comment": "Isn't it called the Singapore of Africa?",
                    "score": 238,
                    "author": "Xavercrapulous",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yes, it is usually compared to Singapore for how well it has jumped back from the horrific genocide of 94.",
                            "score": 295,
                            "author": "AveryLazyCovfefe",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": -6,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's why it's uplifting news. It shows that they came back from the worst place to be on Earth to utilizing good governance to better themselves. What could be more uplifting than such an unexpected but good turnaround? Could anyone have predicted this 20 years ago? I don't think so.",
                                            "score": 22,
                                            "author": "Garrotxa"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Why not? Americans do it all the time after essentially wiping out the Native Americans.",
                                            "score": 14,
                                            "author": "StebeJubs2000",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "9-15% of Rwandans are estimated to be Tutsi, and not all Tutsis live in Rwanda. You don’t have to make the Rwandan genocide worse than it was, it was already really bad.",
                                            "score": 22,
                                            "author": "jumpindryos",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": -5,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Ah yes, imply that the rest of us aren't mortified enough by the horror of what occurred in response to someone merely pointing out a factual inaccuracy.",
                                                            "score": 13,
                                                            "author": "HunterWindmill"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Talking about genocide as it actually happened isn't \"toning it down,\" but yes thank you for not acting like Tutsis no longer exist.",
                                                            "score": 11,
                                                            "author": "jumpindryos",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yep! Rwanda has one of the fastest-growing economies in the world. Rwanda also has low crime, low corruption, high literacy, clean cities etc. All this didn’t just happen. It took incredible hard work &amp; investment by all Rwandans. In particular, Rwanda’s women. Rwanda is largely run by women &amp; women form the majority of legislators, Supreme Court justices, governors etc. Rwanda is an example of just how much a country can change and improve with good governance. It’s a great success story &amp; it IS uplifting news.",
                            "score": 256,
                            "author": "aria606",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I think it was mostly attributed to Paul Kagame, a strong benevolent Lee Kuan yew like figure. Of course, women’s contributions are massive. But it needs a competent government to build such a strong framework to put the country together.",
                                    "score": 15,
                                    "author": "moiwantkwason",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes and he used Singapore as a model. I visited both countries in the last year and although they are very different on the surface, the comparison makes sense, for better (massive investment in infrastructure and well-being) and worse (authoritarianism lite though the many people in both countries I talked to were very happy with the government’s role—that said they were not the ones in jail).\n\nI was fortunate enough to visit a rural hospital and the university mentioned in the article. Very impressive and the relationship with PIH and the late Paul Farmer has been transformative.",
                                            "score": 17,
                                            "author": "sweetpotatopietime"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Kagame hires Western PR firms but he's not all that benevolent. He's extremely authoritarian.\n\nRwanda has a terrible human rights record and is one of the worst rankings for press freedom in Africa.\n\nTorture is still a thing there and a couple of years ago they kidnapped a dissident on foreign soil.",
                                            "score": 3,
                                            "author": "NoHandBananaNo"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 72,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Worth noting, an accusation without evidence is not proof. Considering there's been an ongoing investigation for 19 years and no evidence that Rwanda has anything to do with the Tutsi rebels, I'd say it's bold to claim that their economy is benefiting from them.",
                                            "score": 22,
                                            "author": "Hanspiel",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "There’s heaps of evidence.  \n[interesting read about it](https://apnews.com/article/rwanda-united-nations-genocide-2bafa78733edc678d53fdb3b9dc52403)",
                                                    "score": 10,
                                                    "author": "Pandelein"
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "But *women* are in charge, sweaty \n\nThat makes it progressive 💅",
                                            "score": 44,
                                            "author": "fatdaddyray",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm assuming from the tone that you meant \"sweety\", and not \"sweaty\".",
                                                    "score": 8,
                                                    "author": "thedarkonespr0npicks",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "It's an intentional misspelling. Not really sure how it started but it's somewhat common online to mockingly say, \"that's not how it works, sweaty\" instead of, \"that's not how it works, sweety/sweetie\".",
                                                            "score": 38,
                                                            "author": "SaltyBrotatoChip",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "There was a popular post several years ago about a church organizer asking for a free shuttle bus ride for her church trip on Facebook. Multiple people offered their SUVs/minivans and she kept responding \"sorry sweaty, needs to be a shuttle bus that will fit us all! Next!\" Someone pointed out that if she had them all help, they could all go in one trip just in different cars.",
                                                                    "score": 11,
                                                                    "author": "deadline54"
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Makes me think sometimes... Good times have caused kingdoms to rot from the inside out. Does that mean atrocities are indispensable to strong, healthy progress?",
                                    "score": 2,
                                    "author": "AiryGr8",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 3,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I was there recently and did not see one scrap of trash on any main roadway. Zero. Cleanest country I've ever been to.\n\nAnd so green! Absolutely amazing place.",
                            "score": 3,
                            "author": "Shoot_from_the_Quip",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 4,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "If you come to the UK in a small boat uninvited, the government will try and ship you there for free!",
                    "score": 25,
                    "author": "spaceyjase",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Sure but its also worth noting that Rwanda is an authoritarian state under Paul Kagame, and has [pillaged a huge amount of resources](https://www.ft.com/content/ecf89818-949b-4de7-9e8a-89f119c23a69) from the Democratic Republic of Congo, as part of the most violent war since WW2. \n\n&gt;Nicolas Kazadi, the DRC’s finance minister, said that Rwanda last year exported close to $1bn in gold, tin, tantalum and tungsten, even though the country has few mineral deposits of its own. “It’s all coming from DRC — that’s obvious,” he told the FT’s Commodities Global Summit in Lausanne. “It’s not only allegations, it’s evidence.”\n\n&gt;Kinshasa has long accused Rwanda of plundering its natural resources by supporting M23, an armed group that resumed fighting in late 2021. DRC president Félix Tshisekedi recently urged visiting French leader Emmanuel Macron to take economic measures against Rwanda for its alleged backing of M23, which has waged a brutal insurgency across eastern DRC.",
                    "score": 90,
                    "author": "RKU69",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt;DRC president Félix Tshisekedi recently urged visiting French leader Emmanuel Macron to take economic measures against Rwanda for its alleged backing of M23,\n\nI'd say it's a bit like a kid calling their mom when their sibling takes one of their toy, but in this case it's more like calling the abusive father. The relationship between France and Rwanda is a bit strained, and as a Frenchman, I really cannot blame Kagame for being wary. France never had interested in helping Africa. Not now, not ever. Africa told France colonialism is over, France answered \"yeah, yeah sure *wink wink*\". Rwanda is one of the countries who gave clear conditions: \"we don't need charity. We don't need you to build our infrastructure so that we are chained to your companies for their maintenance. If you want to help, train our engineers.\" And of course, France never did.",
                            "score": 27,
                            "author": "Asshai",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah agreed with that - and in fact from what I remember reading, France was a big backer of the Hutu paramilitaries that carried out the genocide in '94. So not exactly an \"objective\" foreign power when it comes to matters in Rwanda and Congo",
                                    "score": 11,
                                    "author": "RKU69",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Yes but no: France supported Habyarimana's Hutu-led government, but he was moderate and was doing all he could to steer the country toward a reconciliation between Hutu and Tutsi. However, when his plane was shot down, France pointed their finger at Kagame, while Kagame accused France. This assassination is the spark that started the genocide and AFAIK there's no clear consensus on who shot down the plane. There's an amazing documentary called Inkotanyi by a French journalist who spent years in Rwanda to earn Kagame's trust. He doesn't bring a definite answer as to who shot down the plane, but leans toward the French government. \n\nSo it's not true that France directly backed the genocidal government, they openly backed the previous moderate government, but may have killed the president of that government and paved the way for more extremist Hutus to take power.",
                                            "score": 6,
                                            "author": "Asshai",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Ruthless and brutal dictatorship, indeed.",
                            "score": 5,
                            "author": "fidjudisomada"
                        },
                        {
                            "level": 2,
                            "comment": "In addition it's worth noting that a 19 year investigation so far has not provided actionable evidence that Rwanda is backing the Tutsi rebels, just the DRCs allegations.",
                            "score": 5,
                            "author": "Hanspiel"
                        },
                        {
                            "level": 2,
                            "comment": "I’m not saying Rwanda is perfect, &amp; I’m not a expert on its dispute w/DRC, but given some of the comments here I thought I’d chime in. Most Americans just know absolutely nothing at all about Africa. Rwanda is a much better country than it was 30 years ago &amp; that achievement should be recognized IMO.",
                            "score": 13,
                            "author": "aria606",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That’s not a hallmark of Americans, it’s Reddit.\n\nYou could say “Jimmy gives to charity every single year” and Reddit would say “it should be noted that Jimmy forgot to turn off the water in the sink in 1999”",
                                    "score": 18,
                                    "author": "bgarza18",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "what a dumb analogy, we're not talking about the geopolitical equivalent of forgetting to turn off a sink here.",
                                            "score": 5,
                                            "author": "RKU69",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Rwanda has overcome a lot, but I think Botswana is still much more impressive",
                    "score": 16,
                    "author": "LadiesAndMentlegen",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Botswana and many other countries are more impressive.\nRwanda's GDP is [one of the lowest in the world](https://en.m.wikipedia.org/wiki/List_of_countries_by_GDP_(nominal)_per_capita). It's low even by African standards. I'm not sure how OP can call it \"a leading country in Africa\".",
                            "score": 27,
                            "author": "Tifoso89",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The govt engineers a good pr in western countries. Heavily over hyped authoritarian state. Also continuously messing with the Congo. They help rebel groups there and even invade sometimes.  \n\n\nFor those who don't know, Rwandan dissidents regularly \"disappear\" and their opposition politicians \"mysteriously\" get murdered. But hey they sponsor the premier league lmfao",
                                    "score": 25,
                                    "author": "Kind-Shopping-2727"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Met a guy from Rwanda who works at my local head shop. It was really cool talking to him learning more about how the country is doing lately",
                    "score": 5,
                    "author": "immei",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "How many heads do they sell a day?",
                            "score": 2,
                            "author": "twd1",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Their economy is based on subsistence agriculture, they have few natural resources and their GDP is still incredibly low ($900 per capita) which is [the 173th in the world](https://en.m.wikipedia.org/wiki/List_of_countries_by_GDP_(nominal)_per_capita). It's low even by African standards! There are about 30 African countries with a higher nominal GDP than Rwanda.\n\nI have no idea how you can call it \"one of the leading countries in Africa\". I think you got a bit overly enthusiastic and simply pulled that out of your ass. \n\nMaybe Botswana could be called that.",
                    "score": 25,
                    "author": "Tifoso89"
                },
                {
                    "level": 1,
                    "comment": "You sure are fast to call people ignorant. Isn't this stat much more related to the fact that they are not slaughtering each other like cockroaches?\n\nAnd what's women's role been that's particularly leading? Women have been contributing to progress around the world since the beginning",
                    "score": 3,
                    "author": "hunnathounmore"
                },
                {
                    "level": 1,
                    "comment": "My friend is there now, she’s a coffee importer, she says it’s great there! She loves it",
                    "score": 3,
                    "author": "pineappledumdum"
                },
                {
                    "level": 1,
                    "comment": "“Visit Rwanda” -Arsenals sleeve",
                    "score": 2,
                    "author": "rick_rolled_you"
                },
                {
                    "level": 1,
                    "comment": "Yeah, it’s come a long ways. It’s really beautiful to hear all the improvement!",
                    "score": 2,
                    "author": "InfiniteEverythang"
                },
                {
                    "level": 1,
                    "comment": "Lots of good things to celebrate about Rwanda, but political repression is real and well evidenced, as is the exclusion of smaller ethnic groups such as the Batwa (who are labelled as \"backwards\" in official docs, e.g. [https://www.parliament.gov.rw/news-detail?tx\\_news\\_pi1%5Baction%5D=detail&amp;tx\\_news\\_pi1%5Bcontroller%5D=News&amp;tx\\_news\\_pi1%5Bnews%5D=7785&amp;cHash=607e6ee0f5de372d96c5c10f9cfbefac](https://www.parliament.gov.rw/news-detail?tx_news_pi1%5Baction%5D=detail&amp;tx_news_pi1%5Bcontroller%5D=News&amp;tx_news_pi1%5Bnews%5D=7785&amp;cHash=607e6ee0f5de372d96c5c10f9cfbefac)). \n\nSomebody mentioned Botswana in this thread, which also has a much milder hint of authoritarianism and does not cater well to smaller ethnic groups. \n\nRwanda has done well in many ways, but if you believe critique of the State and greater transparency for information is important, there is work to be done.",
                    "score": 2,
                    "author": "iamgenet"
                },
                {
                    "level": 1,
                    "comment": "It's been said that Rwanda heavily influenced the design and culture of Wakanda.",
                    "score": 1,
                    "author": "my_wife_is_a_slut"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hold on! Rwanda can afford it but the US can't?",
            "score": 241,
            "author": "Huckleberry-Solid",
            "replies": [
                {
                    "level": 1,
                    "comment": "Nearly every country besides the US has some kind of universal healthcare on the books. It's cheaper and better than private healthcare. The decision of the US to not pursue universal coverage is a statement of values and not an economic choice.",
                    "score": 382,
                    "author": "Isord",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It's a moral choice. Enough Americans believe that other Americans don't \"deserve\" good healthcare unless they can \"prove\" it by being \"successful\" to keep universal healthcare from being made law. It's bonkers.",
                            "score": 189,
                            "author": "BloosCorn",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "It fascinates me that politicians tell people that affordable healthcare is not good for them and they believe it.",
                                    "score": 66,
                                    "author": "Huckleberry-Solid",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Worse than that, I don't think they usually say universal healthcare wouldn't be good for them (though there is often a topping of \"you can't trust the government to do it correctly\", for good measure), they play off people's selfishness and hate and say \"you don't want your hard earned money going towards helping lazy minorities do you?!\" And morons will gladly cut off their nose to spite their face.",
                                            "score": 55,
                                            "author": "MJOLNIRdragoon",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Bureaucracy is slow and inefficient. Just look how bad various institutions are after we defund them?\n\nThey don't ever turn a profit anyway. How are we supposed to help you without hurting you first?\n\nBesides, that money will just go to middle men and paper pushers. You know? The infrastructure that facilitates getting people X resource, not the people themselves.",
                                                    "score": 13,
                                                    "author": "InsertCocktails"
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "As a corollary to that, many Americans don't believe their tax dollars should pay for someone else's healthcare. Even if it meant they saved money.",
                                    "score": 17,
                                    "author": "Corgi_Koala"
                                },
                                {
                                    "level": 3,
                                    "comment": "It’s ok for americans to deserve good healthcare at 65+ though because that’s how it’s always been…",
                                    "score": 34,
                                    "author": "ReggieEvansTheKing",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I will never understand this country.",
                                            "score": 13,
                                            "author": "Lallo-the-Long"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Ya, they have this weird thing where socialism sucks. But they believe and support socialist benefits for government workers and people older than 65.",
                                            "score": 11,
                                            "author": "james1234cb"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I don't think most conservatives think \"other Americans don't deserve good health care.\"  They are just afraid of things like government spending getting too high and they have been fed a narative thier whole lives that government is corrupt to the core and incompent while private businesses persuing their self interest inherently bring virtue and value into the world.\n\nThey genuinely think the quality of care for the vast majority of Americans would be worse under universal healthcare.  The abundance of evidence suggesting universal health care is cheaper and better quality than the American healthcare never enters their reality tunnel.  Though if some small country or municipality has a small amount of healthcare fraud under their universal system, then you bet your ass it will be covered in depth as an example of why \"government doesn't work\"",
                                    "score": 8,
                                    "author": "M0sesx"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Probably getting downvoted but universal has nothing to do with it being private or not. Just means that the state pays for the ones that can't afford it at least.",
                            "score": 6,
                            "author": "GoncaloTR",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "No you're right, many countries with universal health care also allow private options.",
                                    "score": 2,
                                    "author": "blacksun9"
                                },
                                {
                                    "level": 3,
                                    "comment": "Why do you comment factual information on reddit? this is a crime",
                                    "score": 2,
                                    "author": "Pezotecom"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "The US spends enough money already to pay for two universal healthcare systems. \n\nNever mind any government spending. Forget about the defense budget. Ignore everything you think is wasteful. \n\nPeople in the US already spend **more than double** what is required to implement universal single-payer healthcare. \n\nThe problem is that people of a certain political persuasion, funded by the people siphoning off all of the money as it travels from the patients paying the bills and the staff and facilities getting paid for, have convinced a large portion of the country that paying less for better healthcare is baby-killing communist socialism that will kill your baby.\n\nEvery time someone says “well we can’t afford it because of x” they are lying. We can already afford it. \n\nInsurance executes can’t afford to lose their yachts.\n\nEvery time someone says “well xyz gubmint department is taking all of the money” they’re repeating the talking points of the industries that want the blame to be deflected away from them.\n\nWe could take any civilized nation’s healthcare laws, change every instance of that country’s name to “the US” and implement that set of laws and people would pay less and there’d be enough money left over to pay down the debt and/or buy more bombers for the air force.",
                    "score": 26,
                    "author": "globular_fluster"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 136,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Best description of the US government I’ve ever heard. Perfectly frames the policies of the country for the last 60 years.",
                            "score": 8,
                            "author": "Ebowmango"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yes, the US can afford it, but it’s also worth pointing out Rwanda is getting a lot of outside assistance from charities and NGOs, they aren’t funding all this entirely by themselves.\n\nEdit:\n\nThe US alone has been giving over [$100 million every year since 2007, peaking at $269 million in 2016. Since 2001, Rwanda has received nearly $3 billion from the US,](https://www.foreignassistance.gov/cd/rwanda/2018/obligations/0) about a fourth of their current GDP. An equivalent donation to the US would be about $6 trillion.",
                    "score": 67,
                    "author": "Tommyblockhead20",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 12,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "What’s the goal with this comparison? Both countries have issues, and both countries need to work towards resolving these issues. That’s what matters. This isn’t some competition to see what country is “better”.",
                                    "score": -1,
                                    "author": "Tommyblockhead20",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "We can definitely afford it!! And should IMO. One of our politicians (leading republican, mitch McConnell) called himself the grim reaper of Medicare for all. Clearly no empathy for poor people with no health care. He’s never been  in that position after all",
                    "score": 10,
                    "author": "jeanborrero"
                },
                {
                    "level": 1,
                    "comment": "What? Health insurance coverage in the US is 92%.",
                    "score": 3,
                    "author": "alc4pwned",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The US can afford it, we’d just rather privatize it so someone can make money off it. Capitalism! America!",
                    "score": 13,
                    "author": "sp_40"
                },
                {
                    "level": 1,
                    "comment": "[92% of Americans also have health care coverage](https://www.statista.com/topics/7807/health-insurance-in-the-us/#:~:text=The%20number%20of%20people%20with,coverage%20among%20the%20U.S.%20population.)\n\nThe debate about single payer or Medicare for all is about how to make that coverage cheaper and how to get that last 8% covered.",
                    "score": 6,
                    "author": "psychicsword"
                },
                {
                    "level": 1,
                    "comment": "To be fair, their life expectancy is still much lower than the US.\n\nYou can do wonders with life expectancy by just having access for child birth.",
                    "score": 6,
                    "author": "lostharbor",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Mississippi and Loiusana life expectancy is lower than Kelopcratic states in Latin America and Eastern Europe.",
                            "score": 2,
                            "author": "angrybirdseller",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "92% of Americans have health insurance.",
                    "score": 3,
                    "author": "Astatine_209",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Having health insurance is not.the same thing as universal coverage. Most Americans still pay thousands of dollars out of pocket despite having insurance. Legally the yearly limit is something like $14,000. The idea that anybody could defend this system is hilarious.",
                            "score": 29,
                            "author": "Isord",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I can't even afford to use my insurance that I pay for.",
                                    "score": 21,
                                    "author": "Insanitydividedby0"
                                },
                                {
                                    "level": 3,
                                    "comment": "Does rwanda’s system count as universal if it has a higher percentage people without insurance than the US?",
                                    "score": 7,
                                    "author": "Protection-Working"
                                },
                                {
                                    "level": 3,
                                    "comment": "There are no yearly or lifetime limits on health insurance in the US. They've been banned since like 2010. Dental/Vision insurance (and other types possibly) still can have yearly limits.\n\nAn HDHP's highest legal MOOP is 14100 for a family, but that functions differently.",
                                    "score": 5,
                                    "author": "mradamkidding",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I meant the limit on what you pay, not the limit on what pays out.",
                                            "score": 3,
                                            "author": "Isord",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I think they meant deductible. Like they have to pay $14k before their insurance kicks in, which hardly anyone can afford.",
                                            "score": 4,
                                            "author": "theprozacfairy",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "They're younger, thinner and probably fitter.\n\nOld obese people live for a relatively long time with poor health that costs a fortune to care for.",
                    "score": -2,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "People would be less obese in the states if people stopped driving everywhere they go",
                            "score": -1,
                            "author": "nebo8",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People in the states might stop driving everywhere they go if there were safe ways to get where they needed to go, including safe sidewalks and reliable public transportation.",
                                    "score": 40,
                                    "author": "AinsiSera",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It would also help if we stopped doing euclidean single-use zoning, which has the effect of artifically increasing the distance between the places we need to go in life. You know, work, homes, schools, grocery stores, etc. What we call 'mixed use' is just normal in many parts of the globe and makes walking, biking, etc far more viable just because instead of being segregated, stuff naturally gets built closer to where people live and vice versa. Euclidean single-use zoning is effect an indirect subsidy for cars, like an indirect mandate, because it makes any alternative much less practical.\n\n[I can only dream](http://urbankchoze.blogspot.com/2014/04/japanese-zoning.html).",
                                            "score": 2,
                                            "author": "statinsinwatersupply"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Sure, let me just walk along this eight lane highway with zero shoulder so I can die by getting hit instead of being slightly overweight. That math checks out.",
                                    "score": 8,
                                    "author": "TorchIt",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "When people talk about how awful it is that we drive everywhere, they’re including the corruptly designed, car-centric cities without adequate public transportation. Ever been to a city with good public transportation? It’s amazing! I love everything else about where I live, but car dependency sucks. You want to be able to safely cross that highway? You need a raised crossing that goes over it. Talk to your neighbors, go to town hall meetings, etc. try to organize and make it happen.\n\nI used to think it was personal, too, but they weren’t insulting you, just commenting on the awful system you and I live in, but they managed to keep out of their cities.",
                                            "score": 5,
                                            "author": "theprozacfairy"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt; if people stopped driving everywhere they go\n\nYou might wanna go check out [Not Just Bikes](https://www.youtube.com/channel/UC0intLFzLaudFG-xAvUEO-A).   He has lots of videos that will give you a glimpse of why that is.  And I'm not being a dick either, he has a lot of good points.",
                                    "score": 2,
                                    "author": "HomoFlaccidus",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I know Not Just Bikes, I did this comment fully aware of that",
                                            "score": 2,
                                            "author": "nebo8"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah let me walk to the grocery store when it's 120f with high humidity, -15f, ice storms, tornados, crazy winds, or hail.\n\nI'll just load the 50lbs of dog food, 10lbs cat food, 20lbs of litter, and food for a family of four for on my cargo bike and enjoy the giant hills while I die in the heat.\n\nAnd with ice or snow you are going headfirst into the ditch on those hills.",
                                    "score": -1,
                                    "author": "OuidOuigi",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Who tf does groceries shopping when there is a tornado outside lmaooo",
                                            "score": 3,
                                            "author": "nebo8"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What are you talking about? The US is health coverage [is at 91.5%](https://www.census.gov/library/publications/2021/demo/p60-274.html). Stop with the negativity, there's other subs for that.",
                    "score": -14,
                    "author": "space_force_majeure",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Believe it or not, it's actually impossible to be happy for Rwanda unless you shit on America.  🙄",
                            "score": 8,
                            "author": "mhkwar56"
                        },
                        {
                            "level": 2,
                            "comment": "\\- How much are they paying for it compared to other countries?\n\n\\- How much are premiums and deductibles?\n\n\\- How many people are trapped in awful jobs because they only get coverage through their employer?\n\n\\- How many of those people are actually already receiving government-run health assistance through medicare or medicaid?\n\n\\- What kinds of conditions and care aren't covered?\n\n\\- How many millions of people comprise that remaining 8.5%?\n\n\\- How much money does the average health insurance executive make by denying claims?\n\nThe US healthcare system has been broken for a long time, it's not \"negativity\" to acknowledge that.  Your one statistic about \"coverage\" was deliberately crafted to obscure everything else that's awful, wasteful, and predatory about healthcare in this country.  It's incredibly obvious to people everywhere else on Earth how backwards our system is.  It's run totally for profit and we pay far more for worse health outcomes across the board.  It's a moral stain on this country and it doesn't need you to defend it, there's millions of dollars invested in keeping its indefensible practices obscured from the public.",
                            "score": 2,
                            "author": "blkirishbastard",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "This is r/upliftingnews, not \"bitch about the United States\". Like I said, there's other subs for that. Be happy for Rwanda without bringing negativity here.",
                                    "score": 2,
                                    "author": "space_force_majeure"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Largely based on the work being done by Zipline to transport medicine and blood quickly to hospitals by unmanned fixed wing vehicles.\n\nhttps://time.com/rwanda-drones-zipline/",
            "score": 6,
            "author": "XanDarnold"
        },
        {
            "level": 0,
            "comment": "Rwanda has a full on autonomous blood delivery drone airline..I imagine it's helping a lot with the life expectancy.",
            "score": 6,
            "author": "chooseayellowfruit"
        },
        {
            "level": 0,
            "comment": "A lot of people smugly say \"that's what not having genocides will do\" but fail to comprehend the progress here.\nRemember we have had a global pandemic the last coupple of years? Africa wasn't the first continent to get  vaccine supply.\nAnd yet they got such a huge improvement and covered the majority of the population with healthcare. Cudos to them.",
            "score": 60,
            "author": "Fry_super_fly",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sadly my cynical mind immediately jumped to \"so genociding your minorities really helps, eh?\"",
                    "score": -4,
                    "author": "NorwegianCollusion",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "In the case of Rwanda, the Tutsi minority that was the genocide’s target actually ended up in charge. Armed Tutsi rebels and militias from across the border invaded and overthrew the Hutu-led government regime that was perpetrating the genocide. This was after the UN and the West completely abandoned the country to its fate. \n\nIf you don’t know much about the Rwandan genocide there are some well made films that can give you a basic rundown. \n\n*Hotel Rwanda* is probably the most famous and it gives a good basic summary, but parts of it are fictionalized (Nick Nolte’s character is a pastiche of UNAMIR commander Romeo Dallaire and a few other western military figures, for example) and oversimplified for the usual Hollywood reasons. I’d also recommend *Sometimes in April* and the documentaries *When Good Men Do Nothing* and *Ghosts of Rwanda*",
                            "score": 6,
                            "author": "quesoandcats"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 166,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Sure. But we can also just be happy when other countries do well, without necessarily ragging on others.",
                    "score": 110,
                    "author": "icelandichorsey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I'm ragging on my own country not others.",
                            "score": 54,
                            "author": "Th3TruthIs0utTh3r3",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Still makes it all about you",
                                    "score": 38,
                                    "author": "TootsNYC"
                                },
                                {
                                    "level": 3,
                                    "comment": "You’re the king? Well I didn’t vote for you",
                                    "score": -6,
                                    "author": "MasterWee",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You don't vote for kings!",
                                            "score": 16,
                                            "author": "okidokes",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well how did you become king, then?",
                                                    "score": 1,
                                                    "author": "keenoo55",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Listen. Strange women lying in ponds distributing swords is no basis for a system of government. Supreme executive power derives from a mandate from the masses, not from some farcical aquatic ceremony.",
                                                            "score": 15,
                                                            "author": "badpeaches",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Ni.",
                                                                    "score": 2,
                                                                    "author": "jmd_akbar",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "I don't have any Shrubbery",
                                                                            "score": 3,
                                                                            "author": "badpeaches",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I fart in your general direction, sir...",
                                                                                    "score": 2,
                                                                                    "author": "jmd_akbar",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "So now you have to be King to care for your country?",
                                            "score": 12,
                                            "author": "CatAvailable3953",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "https://en.m.wikipedia.org/wiki/Popular_sovereignty",
                                            "score": 2,
                                            "author": "justneurostuff"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; War torn impoverish African country has more citizens with health insurance that the United States does \n\nBy what metric? If it’s the metric used in the article, percent with some healthcare, this is false. It is around 90% in Rwanda, while it is [around 91.4% in US](https://sgp.fas.org/crs/misc/IF10830.pdf) (it fluctuates year by year). \n\nThere’s also a lot more nuisance here. Rwanda is receiving a lot of outside assistance from charities and NGOs because of just how bad it is there. Rwandan healthcare is still lacking in access to many of the surgeries and procedures available in the west. Right now they are focusing on tackling preventable diseases like malaria. This has significantly raised their life expectancy, but it still isn’t great, being over a decade less than the US still.\n\nYes, US healthcare is flawed, but no, Rwandan healthcare is not better.",
                    "score": 30,
                    "author": "Tommyblockhead20",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Rwanda has some of the lowest amounts of NGO and is one of the strongest growing economy in all of Africa.  Their president believes in growing they country themselves and not relying on aid.",
                            "score": 1,
                            "author": "orange_lazarus1",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "The US alone has been giving over [$100 million every year since 2007, peaking at $269 million in 2016. Since 2001, Rwanda has received nearly $3 billion from the US,](https://www.foreignassistance.gov/cd/rwanda/2018/obligations/0) about a fourth of their current GDP. Imagine if the US has given an equivalent $6 trillion for it’s healthcare. I’d imagine it would also improve a lot.\n\nGreat to hear they are less reliant on NGOs than other African nations and that are growing, but they are absolutely still receiving a lot of aid.",
                                    "score": 9,
                                    "author": "Tommyblockhead20",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "The US literally does this all over the world it's foreign policy strategy and account for less than 1% of their gdp. Rwanda's growth is a Rwanda story and not because of foreign intervention.",
                                            "score": 8,
                                            "author": "orange_lazarus1",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "I'm not saying that Rwanda doesn't deserve any credit for this. They obviously deserve a lot. But I’m skeptical of the claim that billions of dollars in aid didn’t have an effect.\n\n&gt; and account for less than 1% of their gdp.\n\nAre you talking about Rwanda? The US aid alone is 1.5-3% of GDP. And there are plenty of global/European organizations also helping there.\n\nAlso probably a better metric I should’ve been using is government income,[ of which as much as a third comes from external sources.](https://www.reuters.com/article/africa-economy-budget-idUSL8N190156) That aid is also mostly allocated for healthcare, or which it is over half of their healthcare spending.",
                                                    "score": 9,
                                                    "author": "Tommyblockhead20",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Being insured means jack shit in the US, what's the point of having insurance that covers nothing. Sorry not wanting to start an argument,this kind of conversation just hits a nerve.",
                            "score": -2,
                            "author": "Fartoholicanon",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People keep saying this, as if everywhere else it means you have top tier levels of care. That’s often not the case. While Rwanda has immensely improved, it is still behind in many ways with the care available. \n\nAnd the simple fact is that even if the insurance quality is poor, more in the US are in fact insured, so their headline shouldn’t be claiming otherwise as that is misinformation. \n\nWhat this discussion seems to have proved is we shouldn’t be using percent insured as a primary metric, as quality of insurance can vary. Unfortunately for Rwanda, that is probably one of the few metrics Rwanda is close to the US in, and why it was featured so prominently. It’s still a good first step though.",
                                    "score": 6,
                                    "author": "Tommyblockhead20",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Agree 100% with what your saying.",
                                            "score": 1,
                                            "author": "Fartoholicanon"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "This isn't about the US.",
                    "score": 9,
                    "author": "JestersHat"
                },
                {
                    "level": 1,
                    "comment": "I mean, Minnesota takes care of us.  Y'all need to catch up.",
                    "score": 6,
                    "author": "dookieshoes88"
                },
                {
                    "level": 1,
                    "comment": "Rwanda is not war torn.",
                    "score": 10,
                    "author": "globocide",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't know if he meant that it would be misreported by US news but yeah, there's no war in Rwanda. I went there in 2019 and it was very safe and calm. A lot of people still think of the genocide whenever the country is mentioned, but it's come a long way since then",
                            "score": 12,
                            "author": "SquidInSpace",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;\tIn 2022, heavy tensions broke out between the Democratic Republic of the Congo and Rwanda, which have led to several alleged attacks by Congolese and Rwandan forces on each other's territory. Rwandan forces have been caught crossing into the DRC multiple times, usually fighting alongside Congolese rebels.\n\nMight be referring to the border regions with DRC",
                                    "score": 8,
                                    "author": "Billy1121",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Oh, I'll admit I wasn't aware of this new conflict. I'll go read up on it",
                                            "score": 3,
                                            "author": "SquidInSpace"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Nah, we all know that they'll just provide the absolute best healthcare to a single individual, costs be damned, and then report it as \"America is the leading country worldwide in the field of healthcare\" as if the same treatment was readily available to every citizen.",
                    "score": 3,
                    "author": "Weenaru"
                },
                {
                    "level": 1,
                    "comment": "im all for a good US bashing but neither of those statements are true. Health Insurance coverage - US 91%, Rwanda 85%",
                    "score": 2,
                    "author": "lostharbor",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The USA is third world",
                    "score": -4,
                    "author": "_hotpotofcoffee"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Damn that is some good news.\n\nAnd not the fake us schmaltzy headlines of kids fundraising away starvation, this is genuinely good news.",
            "score": 17,
            "author": "demarcoa"
        },
        {
            "level": 0,
            "comment": "Life expectancy tends to increase when people stop hacking 300,000 of their people to death with machetes.",
            "score": 78,
            "author": "Armand28",
            "replies": [
                {
                    "level": 1,
                    "comment": "Peak life expectancy before the genocide was 51. It dropped to 14 during the genocide. So not really a big factor.",
                    "score": 25,
                    "author": "Maguncia",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Any time life expectancy increases dramatically somewhere the single biggest factor is almost always improvements in successful pregnancies and infant/child survival. This is almost certainly better care for expectant mothers and their newborns.",
                            "score": 11,
                            "author": "btribble"
                        },
                        {
                            "level": 2,
                            "comment": "The life expectancy dropping from 51 to 14 isn’t a big factor?",
                            "score": 7,
                            "author": "YouMeanOURusername",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "&gt;The life expectancy dropping from 51 to 14 isn’t a big factor?\n\nNo, because for starters, by 1993 the life expectancy had already fallen to 40, and by 1995 it rose back to 40. The genocides most profound impact was really only during the year it occurred. \n\nToday the life expectancy is 70, which is higher than it ever was pre-genocide.",
                                    "score": 6,
                                    "author": "infamous-spaceman"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "While 20 years increase may be clickbatey, the figure of 69 is very high for Africa and os on par with Russia. 90% health coverage is probably similar to the US.\n\nhttps://en.wikipedia.org/wiki/List_of_African_countries_by_life_expectancy\n\nYour whataboutism is not appreciated.",
                    "score": -2,
                    "author": "icelandichorsey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I don't think it's whataboutism to point out they had a civil war 30 years ago my dude.",
                            "score": 44,
                            "author": "didntgettheruns",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "It's not whataboutism, it's relevant to Rwanda.  \n  \nThey've done great but they had a lot of space for improvement after a massive chunk of the population was murdered, leaving countless orphans and homeless.",
                            "score": 7,
                            "author": "Astatine_209",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Rawhanda should send a healthcare humanitarian mission to the united states. Maybe they can have a fundraiser, have a music festival. Commercial: [American redneck child with fly on eyeball] Voiceover: for only 2 Rwandan Francs you can help this child get the healthcare they deserve..",
            "score": 8,
            "author": "Ren_Hoek"
        },
        {
            "level": 0,
            "comment": "Nice to see a country succeed even though it’s not how wealthy countries would choose for it.",
            "score": 3,
            "author": "sandwichesss"
        },
        {
            "level": 0,
            "comment": "You all should travel there. You cross the border next to burning piles of trash and broken infrastructure, get into Rwanda and everything is clean and in order and well maintained. \nInternet is super fast, people are nice, traffic is safe and you can walk around at night without being harassed. \n\nAnd then you just drive into a smooth running national park and check out Chimpanzee, Gorillas, Lions and Elefants. \n\nRwanda is pretty amazing.",
            "score": 3,
            "author": "Keksdosendieb"
        },
        {
            "level": 0,
            "comment": "This is called putting in work! Great strides. Unheard of here in the US.",
            "score": 54,
            "author": "Gromflomite_KM",
            "replies": [
                {
                    "level": 1,
                    "comment": "Why do we paint it all so black and white though. The US is a big place, each state has its own way of dealing with things like healthcare. In NYC for example healthcare is free for those who cant afford it. So yes it is heard of in the states.",
                    "score": 9,
                    "author": "BCmutt",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I am from NY. I am currently in Mass and they have a similar program, outside of mandating coverage. The fact is that this is one country and coverage should be free and universal. Decisions should be made by medical professionals and not insurance companies. Health insurance should not be tied to employment. \n\nInstead federal and state governments are looking to gut the already struggling Medicare and Medicaid. They’re working to cut veteran medical services. Every day people are denied life saving surgeries or have to face insurmountable debt. \n\nAnd low-cost/free does not mean any and everything will be covered. It also means that if you make even $1 over the poverty limits said programs use, you’re basically ass out of luck.",
                            "score": 6,
                            "author": "Gromflomite_KM"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What are you talking about? The US is health coverage [is at 91.5%](https://www.census.gov/library/publications/2021/demo/p60-274.html). Stop with the negativity, there's other subs for that.",
                    "score": -2,
                    "author": "space_force_majeure",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Big 'Ol asterix on that buddy. Just because some one is covered doesn't make it affordable or accessible. Many people have insurance but still have co-pays, deductibles, premiums, etc. That's not including the copius amount of red tape. \n\nSpeaking of red tape: medicare and medicaid. Those patients are truelly treated like second class citizens. Government has all sorts of ways to skip out on payment which doesn't screw over the patient but the provider (hence the poor treatment)\n\nSource: my whole family including myself have worked medical for either their entire career or part.",
                            "score": 10,
                            "author": "Big_Subject_1746",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "And why do you bring that up in reference to the US number and not Rwanda?",
                                    "score": 5,
                                    "author": "sprazcrumbler"
                                },
                                {
                                    "level": 3,
                                    "comment": "I mean, there’s also an asterisk for Rwanda. 90% having some healthcare doesn’t mean 90% have amazing healthcare. \n\nThe article mentions issues like shortages of basic equipment, specialized infrastructure, and trained health-care providers. For individuals, very few Rwandans have cars so they may have to walk many miles for medical care. Many don’t even have access to many of the surgeries and procedures putting people in debt in the US. \n\nThe healthcare is also more important as many more Rwandas are dying from easily preventable diseases like malaria. Despite the 20 year jump in life expectancy from these changes, it is still more than a decade less than US life expectancy. Goes to show just how bad it was there.\n\nIt’s also worth noting that they are receiving a lot of outside help from charities and NGOs. \n\nIs the US healthcare system flawed? Yes. Is it sad it is even remotely comparable to Rwandas’s? Yes. Is healthcare in the US worse than in Rwanda? Absolutely not.",
                                    "score": 18,
                                    "author": "Tommyblockhead20",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "&gt;Big 'Ol asterix on that buddy. Just because some one is covered doesn't make it affordable or accessible.\n  \nYou think there aren't any asterisks* on the Rwanda number?  Rwanda has 5 physicians per 100,000 people. The US has 278.",
                                    "score": 7,
                                    "author": "Astatine_209",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Bingo!",
                                    "score": 5,
                                    "author": "Gromflomite_KM"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Only 1.5% better than Rwanda? Like Hotel Rwanda Rwanda? Hutus and Tutsis murdering one another in broad daylight with machetes Rwanda?",
                            "score": 7,
                            "author": "actuatedarbalest",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I see someone else already responded. Our coverage here varies A LOT. Full coverage is a myth. The majority of people in debt have insurance.",
                            "score": 2,
                            "author": "Gromflomite_KM",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You think coverage in Rwanda is all amazing? The country with 60x fewer doctors per capita than the US?",
                                    "score": 2,
                                    "author": "Astatine_209",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I was gonna say lol killing the US",
                    "score": -1,
                    "author": "Tirwanderr"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Due to better healthcare services, expanded insurance coverage, and public health initiatives implemented by the government.\n\nThrough the Mutuelles de Santé, individuals contribute to a health insurance fund, which allows them to receive medical care at reduced costs or even free of charge. Also, Rwanda has prioritized public health initiatives, such as vaccination campaigns, disease prevention and health education.  Kigali doing things right!",
            "score": 2,
            "author": "Dialectic11"
        },
        {
            "level": 0,
            "comment": "They also are an incredibly safe country comparative to its neighbours. I remember about ten years ago seeing a random documentary on daily life there a few uni students made, it came across as such a pleasant country and somewhere very safe to grow up. Not sure if it's the same now. I also remember seeing a grocery store fully stocked, which they said was a blessing (comparative to the past).",
            "score": 2,
            "author": "TwoFingersWhiskey"
        },
        {
            "level": 0,
            "comment": "TFW Rwanda has a better percentage of people covered by insurance than your country does.",
            "score": 2,
            "author": "jbsgc99"
        },
        {
            "level": 0,
            "comment": "So that's how it's done. America take note.",
            "score": 2,
            "author": "dgblarge"
        },
        {
            "level": 0,
            "comment": "Fantastic",
            "score": 2,
            "author": "FooFighter0234"
        },
        {
            "level": 0,
            "comment": "To be fair, as the genocide gets farther and farther away, the average that is life expectancy is bound to rebound somewhat.",
            "score": 2,
            "author": "GetsTrimAPlenty3"
        },
        {
            "level": 0,
            "comment": "More Women in charge!!",
            "score": 3,
            "author": "AIcookies"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 2,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Meanwhile the life expectancy in the US is going down.",
            "score": 2,
            "author": "rejectallgoats"
        },
        {
            "level": 0,
            "comment": "Sound like a great place to travel to. If you can't afford to get to Rwanda, come to England and we'll give you a free flight there.",
            "score": 1,
            "author": "ImmortalLemur"
        },
        {
            "level": 0,
            "comment": "The percentage of people with health insurance should never be a metric for how well cared for a population is. Many people in the US, for example, are insured but are crushed by the premiums and the deductible is so high that the insurance never really kicks in unless something extremely expensive happens, so they don’t seek health care.\n\nMeasure disease rates, percent of people who have visited a doctor in the past year, or something better.",
            "score": 1,
            "author": "maowai"
        },
        {
            "level": 0,
            "comment": "Not having a genocide'll do that",
            "score": 1,
            "author": "TheOnlyBliebervik"
        },
        {
            "level": 0,
            "comment": "Isn’t that what happens when genocide stops?!?",
            "score": 0,
            "author": "ItsokImtheDr",
            "replies": [
                {
                    "level": 1,
                    "comment": "It can, but also it doesn't have to. All of this requires a lot of work which should be celebrated and not.. Whatever your reaction is",
                    "score": 2,
                    "author": "icelandichorsey"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Gee, I wonder if the lack of genocides has anything to do with it?  Nah, let's reference healthcare coverage instead.\n\nFTR NHS is an obvious good.  I just hate arguments with obvious manipulation in it.  I have no doubt widespread healthcare and clean water initiatives have helped get life expectancy up to the listed 69.7y.  But the 20 year increase itself owes almost entirely to the lack of genociding going on in the last 30.",
            "score": -16,
            "author": "Burstar1",
            "replies": [
                {
                    "level": 1,
                    "comment": "The Rwandan genocide occurred in 1994.\n\n20 years ago is 2003.\n\nLife expectancy is calculated EACH YEAR based on a statistical calculation of the ages of people who died during THAT ONE YEAR.  So life expectancy in 2003 had nothing to do with the genocide that happened 9 years earlier.",
                    "score": 32,
                    "author": "TAU_equals_2PI",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Millions of people were displaced, the economy ruined, healthcare infrastructure destroyed, and there was widespread famine afterwards.  It is not unreasonable to assume there were effects on life expectancy for a decade+ after the genocide.",
                            "score": 8,
                            "author": "mjbaker474",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Nope.\n\n[www.google.com/search?q=rwanda+life+expectancy](http://www.google.com/search?q=rwanda+life+expectancy)\n\nAs you can see on the graph, life expectancy rebounded to almost the same level the year after the genocide.  And the +20 year increase in life expectancy was starting from a (2001) level that was even higher than that.",
                                    "score": 5,
                                    "author": "TAU_equals_2PI"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "TIL u/burstar1 doesn't know that the genocides happened 30 years ago and that 20 years go isn't the same as 30 years ago.",
                    "score": 14,
                    "author": "Th3TruthIs0utTh3r3"
                },
                {
                    "level": 1,
                    "comment": "It's not just an improvement in the sense of \"no genocide\", Rwanda is really getting its shit together.",
                    "score": 6,
                    "author": "sErgEantaEgis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Oh, absolutely.  The title of the article is what's lousy is what I'm saying.",
                            "score": 4,
                            "author": "Burstar1"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "While 20 years increase may be clickbatey, the figure of 69 is very high for Africa and os on par with Russia. 90% health coverage is probably similar to the US.\n\n[https://en.wikipedia.org/wiki/List\\_of\\_African\\_countries\\_by\\_life\\_expectancy](https://en.wikipedia.org/wiki/List_of_African_countries_by_life_expectancy)\n\nYour whataboutism is not appreciated.",
                    "score": 8,
                    "author": "icelandichorsey",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "That's not how \"whataboutism\" is used.",
                            "score": 13,
                            "author": "dbvbtm"
                        },
                        {
                            "level": 2,
                            "comment": "NOICE",
                            "score": 3,
                            "author": "Tirwanderr"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Rwanda has a high fertility rate and its population has grown by 50% over the past 20 years.\n\nThe 1990s genocide was a relatively small blip in the country's population growth.  All the countries in the region are growing like mad with humans multiplying like rabbits.",
            "score": 0,
            "author": "jack-o-licious",
            "replies": [
                {
                    "level": 1,
                    "comment": "Oh hey, thanks for this. So you're totally right, there's nothing to celebrate here. No hard work was done. /s",
                    "score": 5,
                    "author": "icelandichorsey"
                }
            ]
        },
        {
            "level": 0,
            "comment": "They had a genocide in 1994, no wonder their life expectancy had increased since then.",
            "score": -8,
            "author": "Exodus111",
            "replies": [
                {
                    "level": 1,
                    "comment": "Last time I checked 1994 was more than 20 years ago... Could be wrong though.",
                    "score": 0,
                    "author": "International-Elk986",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lies! Damnable Lies!!",
                            "score": 3,
                            "author": "Exodus111"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Curious how much of that is due to foreign aid dollars?",
            "score": 1,
            "author": "an1ma119"
        }
    ]
}