{
    "id": "13wvaid",
    "score": 20,
    "title": "Sewing Team Member Maureen Banda — Nsefu Wildlife Conservation Foundation",
    "author": "BigDaddySodaPop",
    "date": 1685560769.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/13wvaid",
    "media_urls": [
        "https://nsefu.org/community-profiles-1/2023/4/30/sewing-team-member-maureen-banda"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "We are a conservation group based in San Diego and working in Zambia. We are solely funded by donations to support our programs. Our website is Nsefu.org.",
            "score": 1,
            "author": "BigDaddySodaPop"
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 1,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Thank you for the comment.\n\nCurrently, our sewing team has 5 team members ( 5 treadle machines), local ladies from the area, Maureen is one. The sewing program helps to provide an income to a really poor area.  We just got a donation from one of our board members of five sewing machines in honor of Tommy Raskin, the son of Congressman Jamie Raskin.\n\n[https://nsefu.org/news/2023/5/22/a-song-of-thanks-from-the-sewing-team](https://nsefu.org/news/2023/5/22/a-song-of-thanks-from-the-sewing-team)\n\nWe're always looking for volunteers, but don't have the \"infrastructure\" set up to bring volunteers to Zambia. But if interested, there are ways to do this, please email me at bill@nsefu.org. \n\nThanks, Bill.",
                    "score": 1,
                    "author": "BigDaddySodaPop"
                }
            ]
        }
    ]
}