{
    "id": "142hwxk",
    "score": 71,
    "title": "Astronomers Detect Oldest Complex Organic Molecules in Early Universe, Challenging Assumptions",
    "author": "theprofitablec",
    "date": 1686061843.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/142hwxk",
    "media_urls": [
        "https://skyheadlines.com/webb-discover-oldest-complex-organic-molecules-of-universe/"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "Someone plz break this down so my tiny brain can comprehend",
            "score": 11,
            "author": "jmcgil4684",
            "replies": [
                {
                    "level": 1,
                    "comment": "[In summary](https://skyheadlines.com/webb-discover-oldest-complex-organic-molecules-of-universe/), the discovery of complex organic molecules in the early universe is a remarkable achievement. It provides valuable insights into the chemistry of early galaxies and challenges previous assumptions about the association of these molecules with star formation. Astronomers eagerly anticipate future advancements that will enable them to explore even more distant galaxies and unravel the mysteries surrounding the formation of large molecules in the cosmos.",
                    "score": 10,
                    "author": "theprofitablec"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Are we sure that's not just a blurry picture of the red ring of death on an Xbox 360?",
            "score": 7,
            "author": "OfficialGarwood",
            "replies": [
                {
                    "level": 1,
                    "comment": "A very valid question! It was described more square-ish like the Sony Square of Mortality!",
                    "score": 2,
                    "author": "OfUnknownOrigin"
                }
            ]
        }
    ]
}