{
    "id": "145xjl0",
    "score": 129,
    "title": "Indian, Korean researchers develop light-powered supercapacitors",
    "author": "Frequent-Draft-2477",
    "date": 1686395563.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/145xjl0",
    "media_urls": [
        "https://www.thehindu.com/sci-tech/science/indian-korean-researchers-develop-light-powered-supercapacitors/article66950924.ece"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*",
            "score": 1,
            "author": "AutoModerator"
        },
        {
            "level": 0,
            "comment": "A group of researchers has developed a portable supercapacitor that can be charged using light in a collaborative project involving institutions in India and South Korea.\r  \n\r  \nThe invention holds promise for replacing the conventional lithion-ion batteries in portable and wearable devices such as smartphones, tablets, laptops and smartwatches.\r  \n\r  \nThe study, which has been published in peer-reviewed journal Journal of Power Sources, was undertaken by researchers from University College, Thiruvananthapuram; IIT Guwahati; Gwangju Institute of Science and Technology; Korea Institute of Energy Technology; and Chonnam National University in South Korea.\r  \n\r  \nThe lead author Rani J.R., an Assistant Professor of Physics at Government Women’s Polytechnic at Kaimanam, points out that supercapacitors are an alternative charge storage device which can store electric charge similar to traditional batteries.\r  \n\r  \nHowever, supercapacitors’ capability of getting charged and discharged quickly makes them ideal for applications requiring short power bursts such as wearable devices and electric vehicles. Besides, they exhibit long life since they are not subject to chemical degradation as in conventional batteries.\r  \n\r  \nA supercapacitor device consists of an electrode, electrolyte and a current collector. The researchers developed a design involving a stainless steel electrode with a quartz transparent window in order to harvest visible light. A specially prepared ‘down-conversion’ phosphor is introduced before the quartz window to facilitate light-induced charging.\r  \n\r  \nThis tech would vastly improve the wearables sustainability. Given the sub-par battery life of wearables , these super capacitors can help provided much needed longevity.\r  \n\r  \nRest of the claims in the post are to be tested in real-life situation.",
            "score": 15,
            "author": "photo-manipulation"
        },
        {
            "level": 0,
            "comment": "Hey OP, do you have another link to this, this one's behind a subscription wall, cheers my dude.",
            "score": 4,
            "author": "tbeslian",
            "replies": [
                {
                    "level": 1,
                    "comment": "It didn't paywall for me, but this Internet Archive  will be ready in a moment: https://archive.ph/wip/Swy0D",
                    "score": 3,
                    "author": "Buck_Thorn"
                },
                {
                    "level": 1,
                    "comment": "Non-Paywall Link: [http://web.archive.org/web/20230610023825/https://www.thehindu.com/sci-tech/science/indian-korean-researchers-develop-light-powered-supercapacitors/article66950924.ece](http://web.archive.org/web/20230610023825/https://www.thehindu.com/sci-tech/science/indian-korean-researchers-develop-light-powered-supercapacitors/article66950924.ece)",
                    "score": 2,
                    "author": "Frequent-Draft-2477",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Thank you.☻",
                            "score": 2,
                            "author": "tbeslian"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "bro you are from which country?",
                    "score": 1,
                    "author": "Frequent-Draft-2477",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "UK, it just had a splash screen demanding I subscribe and I couldn't get rid of it, so again thank you for this, I only asked because it looks mighty interesting.",
                            "score": 3,
                            "author": "tbeslian"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Non-Paywall Link: http://web.archive.org/web/20230610023825/https://www.thehindu.com/sci-tech/science/indian-korean-researchers-develop-light-powered-supercapacitors/article66950924.ece",
            "score": 2,
            "author": "Frequent-Draft-2477",
            "replies": [
                {
                    "level": 1,
                    "comment": "This is interesting as I thought it would be, the development of this should get some cool tech in the future.",
                    "score": 3,
                    "author": "tbeslian"
                }
            ]
        }
    ]
}