{
    "id": "766ons",
    "score": 88942,
    "title": "Man finds $24 million lottery ticket in an old shirt -- just two days before it expires",
    "author": "[deleted]",
    "date": 1507918780.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/766ons",
    "media_urls": [
        "http://www.cnn.com/2017/10/13/us/lottery-winner-shirt-ticket-trnd/index.html"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "Friday the 13th is malfunctioning ",
            "score": 403,
            "author": "MistagregS2k",
            "replies": [
                {
                    "level": 1,
                    "comment": "Agreed, I went to the gym today and instead of the one hot girl I always see there, there were two!",
                    "score": 93,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I had six! Usually theres like none :D",
                            "score": 7,
                            "author": "Raikunen",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You may have entered the wrong locker room..",
                                    "score": 9,
                                    "author": "Obowler",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Can confirm. The car in front of me paid for my Starbucks order today - no explanation given to the window girl.",
                    "score": 14,
                    "author": "jramsi20",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "You've been visited by Jason the good luck boye upstab for good luck",
                    "score": 25,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Once I took my battery in to be replaced to find out it happened to be the last day it was under warranty, so I've got that going for me.",
            "score": 240,
            "author": "LegendOfDylan",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Basically the same thing as the $10 bill you find in your winter coat that you haven't worn since last February ",
            "score": 5473,
            "author": "arthritictongue",
            "replies": [
                {
                    "level": 1,
                    "comment": "Basically.",
                    "score": 1963,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Basically",
                            "score": 574,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "more or less",
                    "score": 257,
                    "author": "BuryAnut",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "more",
                            "score": 17,
                            "author": "TheVitoCorleone"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "[removed]",
            "score": 7981,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 4960,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think he’s very aware of the potential negative implications, and that’s why he chose to receive his payments over the course of 26 years. Even though he’s 68. ",
                            "score": 2872,
                            "author": "gummy_bear_time",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "That's still a lot of money per year.\n\n$24M, broadly assuming half of that is taxed, so $12M over 26 years, that's about $460k per year.\n\nHe's still going to be torn to shreds by his own family, especially since they know if he runs out in any given year, they can just wait till the next year for another $460k.",
                                    "score": 1533,
                                    "author": "well___duh",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Honestly if I came into that kind of money, I'd drop contact with my family the second they ask for more money (I'd give them a piece since they're gonna feel they deserve it). ",
                                            "score": 1119,
                                            "author": "kultureisrandy",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Or just don't tell your family (or anyone) you won in the first place. Hire a lawyer to handle everything for you since legally they're not allowed to tell anyone else either (client-attorney privilege).",
                                                    "score": 1066,
                                                    "author": "well___duh",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "In america you have to publically claim the lottery winnings. It keeps the lottery people from giving the winning tickets to their friends/family and not tell anyone.",
                                                            "score": 707,
                                                            "author": "FuckingProper",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "No, it's on a state-by-state basis. [Delaware, Kansas, Maryland, N Dakota, Ohio, and S Carolina](http://denver.cbslocal.com/2016/01/15/in-colorado-and-other-states-lottery-winners-can-keep-names-secret/) allow you to claim anonymously, and other states like Colorado, Connecticut, Massachusetts, and Vermont allow you to claim it via a trust. A couple other states like Illinois and Oregon allow you to claim anonymously if there's a high risk of harm to the winner.",
                                                                    "score": 660,
                                                                    "author": "well___duh",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 474,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Especially if they have 12 grandkids!",
                                                                                    "score": 200,
                                                                                    "author": "Rasiah",
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Well like on my case there is a person who can't really find me now, and doesn't have a good reason to for the time being.  However, there is extremely good reason to believe that would change if I had to be publicly outed as a winner. So I could be anonymous.\n\nBut also if you have more than two days to prepare before claiming the ticket, you can win under an assumed identity or certain types of trust, even in Illinois. Most people just don't.",
                                                                                    "score": 30,
                                                                                    "author": "mallad"
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "In America you can hire an entity collect the winnings for you.",
                                                                    "score": 98,
                                                                    "author": "OMGitsTista",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Hey it’s me, your entity!",
                                                                            "score": 338,
                                                                            "author": "rieoskddgka",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "I was looking for you! Unfortunately I still haven't won the lottery so keep in touch. ",
                                                                                    "score": 147,
                                                                                    "author": "OMGitsTista",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 253,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "My friend got like 30k from his mom's life insurance and the vultures came from everywhere. I kept telling him to tell them to do what they would do for their financial woes if he didn't have that money but he always caved. I'm uh.. not sure how much he had left when he died from cancer like 2 years later :/ life is stupid sometimes.",
                                                            "score": 151,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[deleted]",
                                                                    "score": 30,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Thing is I know he would gladly give up the money to have his mom back but that's typically how it goes. It was just sad to see his family hit him up for money so much afterward. Not just a hundred or so, thousands at a time. Color me self righteous but I felt like the only person not hitting him up for money. I think it became a burden for him, I just wanted to hang out and have good times as much as possible.",
                                                                            "score": 22,
                                                                            "author": "[deleted]",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "I encourage you to read up on winners of large lotteries. The statistics alone are horrifying.",
                                                            "score": 104,
                                                            "author": "h0nest_Bender",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "It is bad, for sure.  I think a large majority of those heart break stories could have been avoided if the winners had just done a few weeks of research on reputable financial advisors. \n\nLike if I won, I'd be hitting the internet to find out who is the best financial planner in NYC, Chicago and LA and then meet with each and go from there.  \n\nMy parents are upper middle class and in their 60s, I'd give them a bit but they are cool. No problems there.  I'm an only child so no siblings bullshit.  I have no first cousins, no uncles and no aunts.  I live across the country from where I grew up in the USA.  I'd move to Cambodia with my wife whom is a citizen there. We lived there before and I love the people and country.  Travel around and honestly, it'd be hard to even contact me.  I have 1 really good friend whom I'd hook up with enough money to sit him up for life.  We are in our early 30s.  Honestly, I'd just let him travel around with us, he's cool and wouldn't ask for any money in the first place.  We have no kids. \n\n",
                                                                    "score": 49,
                                                                    "author": "Zero_Ghost24",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "In france when someone wins the lottery they can choose to be anonymous,  tax are on tickets only,  so you dont have that 50℅ cut.   And they then do courses for winners on finance and how to learn the various instruments and who to call,  then they get called from time to time to see how they are psychologically  doing.  They will give you the contact informations of other winners if they both want,  so they organize dinners together,  its very useful for those that were very poor to be around people like them.  \n\nEdit: https://youtu.be/RQ2Sp-oZTnI\n\nThis is a documentary on the lady that gives you the money and does the follow up and organizes the lessons for winners.  It's in french tho. ",
                                                                            "score": 105,
                                                                            "author": "jsisbxiabxksnzjx",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "In the US, winning the lottery counts as income, so we have to pay income tax on it.",
                                                                                    "score": 32,
                                                                                    "author": "Gestrid",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "There was a post somewhere where a dude won millions in the lottery and literally told **no one** except like his wife. His family doesn't know, his friends don't know. He hired a money manager or whatever and just invested all of it and didn't change his lifestyle at all.\n\nIt's really inspiring and I wish, if I ever get lucky enough to come into money like that, that I'd do the same.",
                                                    "score": 8,
                                                    "author": "jerdub1993",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "How does he look homeless? He's a 68 year old grandpa. What do older men you know dress like?",
                            "score": 39,
                            "author": "not_ratty",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "My old millionaire boss looked homeless half the time, he wanted to see people's true colors shine when interacting with them. \n\nHim looking homeless says nothing about how his family interacts. Maybe he had their futures in mind",
                            "score": 268,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "You can always tell a homeless person by how they smell, not necessarily by how they look.",
                                    "score": 69,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Related: from my brief time homeless, my tip would be, \"you can always tell a homeless person by their feet\".  Reasoning being: a homeless person can scrub the hell out of themselves and put on clean clothes, but feet get so fucking fucked up (dirt ground into them semi-permanently, taking weeks to erode from surface epidermal layers.  It was a big enough deal that at that time, in those few homeless months, I nailed down feet/toes as the inescapable signs of homelessness, harder to erase quickly than smell or clothes.",
                                            "score": 61,
                                            "author": "KennyFulgencio",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "So what you're saying is, in order to make sure the homeless person I'm buying a meal for actually is homeless, I just have to look at their feet?\n\nAlso, something something LPT something something comments.",
                                                    "score": 28,
                                                    "author": "Gestrid",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 273,
                            "author": "[deleted]",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "How does he look bordeline homeless ?",
                            "score": 89,
                            "author": "AwHellNaw",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He doesn’t. People are just judgmental and shallow",
                                    "score": 103,
                                    "author": "idk56177",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Exactly what I was going to say... because he's black? He's got a clean pressed button up on with a jacket...",
                                    "score": 31,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I once was getting calls from someone who sounded like a telemarketer/scammer who I screened (\"Call back at blah blah...\").  I finally picked it up just to see why they were so insistent and the woman said I'd entered an online contest for a vacation and I had won.  This was her last attempt to contact me.  It was totally legit, a rafting trip for 2 in Colorado for a week, car included (I think we had to pay airfare).  We ended up having a great time.",
            "score": 276,
            "author": "_AlreadyTaken_",
            "replies": [
                {
                    "level": 1,
                    "comment": "[Relevant xkcd](https://xkcd.com/570/)",
                    "score": 115,
                    "author": "NealCruco",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This makes a really good point. \n\nI'll bet all of those Internet scammers have also made it really difficult for legitimate Nigerian princes who are trying to move large sums of inheritance money to the US and need assistance. ",
                            "score": 37,
                            "author": "SantosMcGarry2016",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "[Image](https://imgs.xkcd.com/comics/new_car.png)\n\n[Mobile](https://m.xkcd.com/570/)\n\n**Title:** New Car\n\n**Title-text:** Somewhere out there is a company that has actually figured out how to enlarge penises, and it's helpless to reach potential customers\\.\n\n[Comic Explanation](https://www.explainxkcd.com/wiki/index.php/570#Explanation)\n\n**Stats:** This comic has been referenced 158 times, representing 0.0927% of referenced xkcds.\n\n---\n^[xkcd.com](https://www.xkcd.com) ^| ^[xkcd sub](https://www.reddit.com/r/xkcd/) ^| ^[Problems/Bugs?](https://www.reddit.com/r/xkcd_transcriber/) ^| ^[Statistics](http://xkcdref.info/statistics/) ^| ^[Stop Replying](https://reddit.com/message/compose/?to=xkcd_transcriber&amp;subject=ignore%20me&amp;message=ignore%20me) ^| ^[Delete](https://reddit.com/message/compose/?to=xkcd_transcriber&amp;subject=delete&amp;message=delete%20t1_dobwt8c)",
                            "score": 38,
                            "author": "xkcd_transcriber",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Same thing happened to my sister. She entered some drawing at the register of a Jamba Juice one morning. Forgot all about it. Got a couple calls around 8 months later telling her she won $10k but she needed to call back right away. Ignored the first two calls, finally she called back to tell them to stop calling her, it was 100% legit. ",
                    "score": 25,
                    "author": "whatmeworkquestion",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Imagine finding it the day after it expired...\n\nEdit: Thank you for gold!! :)",
            "score": 15301,
            "author": "agamemnons",
            "replies": [
                {
                    "level": 1,
                    "comment": "No joke- I used to work with a guy that won $1.1M. He could never find the ticket. 2 weeks after it expired, he found it in his heavy winter coat. (It's Texas- you use them like once a year) I felt terrible for him. His wife divorced him within a month afterwards. I have always wondered- how did he NOT find that? If I had a ticket like that laying around, you better believe I woudl have looked in/on everything I own. That would BE my full time job until I found it......",
                    "score": 710,
                    "author": "Stair_Car_Hop_On",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Damn this thread is giving me anxiety just thinking about these situations",
                            "score": 460,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Just don't buy lottery tickets and you're golden. ",
                                    "score": 207,
                                    "author": "metamet",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Also, cant get divorced if you dont get married.",
                                            "score": 54,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Heyy can't die if you don't live amirite",
                                                    "score": 46,
                                                    "author": "ADIRTYHOBO59",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I once lost my wallet on vacation. No big deal. Only about $50 in it and cards I could replace. Fast forward a year. I had lost my job and in that depressing mode where you feel like every dollar you spend could be your last. I look in my vacation toiletry bag. There was the wallet. At the time, going out on a $50 date felt like a million. ",
                            "score": 167,
                            "author": "JohnGillnitz",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "How did he know he won if he cant find the ticket?",
                            "score": 75,
                            "author": "wrxwrx",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He was one of those people that picked the same numbers all the time.",
                                    "score": 217,
                                    "author": "Stair_Car_Hop_On",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Never do this. It forces you to buy a ticket every week because if you miss just once, your numbers are gonna hit and you'll wanna die.",
                                            "score": 88,
                                            "author": "orangeblood",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "No....they will never hit and you've wasted thousands playing the lotto",
                                                    "score": 60,
                                                    "author": "clutchy3",
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That makes it even worse.\n\nThose were his \"lucky\" numbers, and he lose the only chance he got with them. The odds are that they won't prolly win never again in his life.",
                                            "score": 84,
                                            "author": "MadKian",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 180,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Which is unlikely",
                                                            "score": 100,
                                                            "author": "CleverName4",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "If that was the reason she divorced him, his wife is an awful person.",
                            "score": 93,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Unfortunately, it cost him $1.1M to find that out.",
                                    "score": 44,
                                    "author": "idlephase",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Beyond awful wtf is that.",
                                    "score": 38,
                                    "author": "icatsouki"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I would have torn my house apart piece by piece literally until I found it. Rip a shutter off and check it over and move it into the checked pile in the neighbors yard.",
                            "score": 20,
                            "author": "whatonearth012",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've had a lot of very small regrets in life.  I can only imagine how much sleep I would lose over that.",
                    "score": 5148,
                    "author": "funnyredditnam3",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I read a story about some guy who bought bitcoin back in like 2010 that’s worth 7.1 million today. He trashed his laptop with the Bitcoin and he lost a lot of sleep",
                            "score": 3198,
                            "author": "agamemnons",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I also read that story. The guy bought a bunch to buy mp3s, used a few and never got round to using the others.\n\nAt least, that's what he said. If I've learnt anything about Reddit, it's not to believe anything you read on here.",
                                    "score": 1404,
                                    "author": "oppai_suika",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "If you can't trust random, anonymous people on the internet, who *can* you trust?",
                                            "score": 1052,
                                            "author": "norsurfit",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "We can't bust heads like we used to. But we have our ways. Like the time I caught the ferry to Shelbyville. I needed a new heel for m'shoe. So I decided to go to Morganville, which is what they called Shelbyville in those days. So I tied an onion to my belt, which was the style at the time. Now, to take the ferry cost a nickel, and in those days, nickels had pictures of bumblebees on 'em. \"Gimme five bees for a quarter,\" you'd say. Now where were we... oh yeah. The important thing was that I had an onion on my belt, which was the style at the time. I didn't have any white onions, because of the war. The only thing you could get was those big yellow ones...",
                                                    "score": 467,
                                                    "author": "Captain_Quinn",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "\"The trick is to tell them stories that don't go anywhere.\"",
                                                            "score": 80,
                                                            "author": "Venusupreme",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I dunno about that, as I'm reminded of when he was in an outhouse and said: \n\n\"This elevator only goes to the basement!......\n\n....and someone made an awful big mess down there.\"",
                                                                    "score": 36,
                                                                    "author": "chuckaway9",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Lol thanks Abe!",
                                                            "score": 51,
                                                            "author": "digitalray34",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "The internet is like a worldwide lightspeed bathroom wall. Would you trust anything you saw scrawled on the inside of a toilet stall?",
                                                    "score": 71,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You mean Alice isn't a good time?",
                                                            "score": 74,
                                                            "author": "VulshockChef",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Well, for one, you can trust me as I'm actually a priest and thus cannot lie",
                                                    "score": 24,
                                                    "author": "oppai_suika",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "*takes a look around and grins*\n\nYou other brothers can't deny?",
                                                            "score": 59,
                                                            "author": "xAekov",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "When a girl walks in \nWith an itty bitty waist",
                                                                    "score": 22,
                                                                    "author": "Cragsi",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You can trust me, I'm the President of the Virgin Islands. ",
                                                    "score": 86,
                                                    "author": "moonman1603",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I am Nigerian prince and you can trust me too.In fact,I will buy your trust.I want to give you 20,000,000 dollars,just PM me your routing number and bank account number.",
                                                            "score": 69,
                                                            "author": "dontworryskro",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I too am Nigerian prince and trust you enough to pay you 34728191047r6 dollars to help get my money back that count Olaf tricked me into giving him under false pensentations",
                                                                    "score": 37,
                                                                    "author": "supremeusername",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "not u",
                                                    "score": 39,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Yeah, that's not how it works.  Who is to say they wouldn't have sold at $100, or $500?",
                                    "score": 127,
                                    "author": "StPaulGuy_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "That's how I think about it.  I remember when the initial post about what would become Bitcoin was made on Slashdot way back when.  I even mined a few back when it was much much easier to do so, but I thought it was pointless and stopped.  So, I was in a position where I could have been a millionaire, but I know enough about myself to know that even if I had mined a bunch, I would have spent them all way before they got that valuable, so I don't lose any sleep over it.",
                                            "score": 47,
                                            "author": "[deleted]"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "That’s what I always think. If you really have them it’s the hardest thing not to sell at that magic $100 when they’re about to drop back to zero. Or $200, $500, $1.000, etc... ",
                                            "score": 73,
                                            "author": "pauledowa",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I sold 14,000 bitcoins mined off 40 or so chassis (read: breadboards) of GPU's for $28,000\n\nAt the time the price had bottomed out and Bitcoin looked like it was dying. Made the best decision I could with the info I had at the time and recouped the cost of the gear we had purchased. I kept 10 just on the off chance something crazy would happen like them going to 10k each. \n\nThat account is worth $55,000 as of this morning.\n\nWhat I'm trying to say is, regret is for chumps! Look forward and be at peace with the decisions you've made knowing that hindsight is always 20/20 and a new opportunity is always around the corner\n\nproof: [https://i.imgur.com/3Byexs7.png](https://i.imgur.com/3Byexs7.png)\n\nedit: I should also mention that pretty much every bitcoin user who traded in any \"large\" amounts of coins back then could claim this kinda story (if they stopped mining/hoarding like we did at any point). It's like saying, \"if I had only purchased a shitload of Apple stock back when Microsoft owned the world!\" or \"if I had only bet everything I own on black 26 that time it came up on roulette\"\n\nedit2: just to recap, from my point of view I woke up this morning with $55,000 I never expected to get. hell of a good morning :)",
                                    "score": 179,
                                    "author": "GizmoSlice",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "“Life is simple. You make choices and you don’t look back.” -Han\n\nI’m glad you don’t let it get to you, though I’d still like to bathe in millions of dollars. :) ",
                                            "score": 73,
                                            "author": "agamemnons",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It was 7,800 coins which is like 42 million USD today.\n\n",
                                    "score": 34,
                                    "author": "Decyde",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Biggest regret of my life was in early 2009 I got an email offer to buy bit coin, thought it over and my wife talked me out of buy virtual currency said it wouldnt be good for anything now I'm pretty sure the 100 bucks I was gunna buy would be worth at least a million now.",
                                    "score": 74,
                                    "author": "jporter459",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It’s at 5.5k right now, but dude that sucks! ",
                                            "score": 62,
                                            "author": "agamemnons",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Well that's not as bad as I thought only 5.5 k but it would make for one hell of a 100 dollar vacation ",
                                                    "score": 39,
                                                    "author": "jporter459",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You misunderstand. One bitcoin is worth 5.5k right now. In 2009 you could have purchased several thousand bitcoins for $100.",
                                                            "score": 141,
                                                            "author": "TheCandelabra",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "And I just got a bit more sad lol ",
                                                                    "score": 130,
                                                                    "author": "jporter459",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Don't worry, you would have sold them a long time ago, trust me. You never know when that turning point comes and you lose everything. So eventually you probably would've cashed in long before it started to take off.\n\nI always get nervous and cash in early, better make 10% than lose 50% right?",
                                                                            "score": 50,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Yep. I sold my bitcoin when they were around 800$ a piece, I had bought them at 100$. I said to myself, \"anyday now its going to crash\".\n\nWelp, oh well. Won't mean shit when I'm dead. ",
                                                                                    "score": 27,
                                                                                    "author": "Alabugin",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Sorry man",
                                                                            "score": 28,
                                                                            "author": "TheCandelabra",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "No problem at all man we all make mistakes I can't wait to get home and explain to my wife how life could be soooooo much different lol",
                                                                                    "score": 38,
                                                                                    "author": "jporter459",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Well I just quickly googled and learned someone bought 5000 bitcoin for 27$ in 2009.  That’s 27 million now",
                                                            "score": 45,
                                                            "author": "agamemnons",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "That's a steal I don't remember how much it was at the moment when I got the offer but if I remember correctly it was more than 1 bit coin per $1 that's why she thought it was odd. Tbh I thought it was a bit of a scam as well but ya live and ya learn. Invested money in tons of bum shit.",
                                                                    "score": 19,
                                                                    "author": "jporter459",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "In 2009 bitcoin was fractions of a penny. 100 dollars worth in 2009 would be worth hundreds of millions of dollar. ",
                                                                            "score": 24,
                                                                            "author": "1phil2phil3phil"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "My gf at the time prevented me from buying a 60$ banksy painting in Central Park a few years back. It’s apperently worth 500k today.",
                                    "score": 39,
                                    "author": "thats-inappropriate",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Maybe he lost his private keys because they were stored on his laptop but he didn't lose his bitcoin because his laptop got trashed. The coins are still stored on the blockchain.\n\nA worse one is the guy who bought 2 pizzas using 10,000 BTC in 2010.\n\nI really hope those pizzas were worth the $55 million that BTC would fetch now!",
                                    "score": 106,
                                    "author": "_soundshapes",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Early purchases like that famous pizza helped legitimize BTC though. If it weren't for people actually *using* the currency it never would have taken off.",
                                            "score": 61,
                                            "author": "oneinchterror",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 42,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 66,
                                                    "author": "[deleted]",
                                                    "replies": []
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "You could've bought at 850 dollars *this year*. That's over 600% return.\n\nWho fucking knows where it'll be in 2020 lol.",
                                                    "score": 24,
                                                    "author": "Vaztes",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 24,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah that's how these things work. It's always easy to see what you *should* have done in hindsight, but at the time you had no way of knowing it would go up. If you had done a similar thing on 10 other risky business ventures maybe only 1 of them would have worked, and you wouldn't have made money overall. Most of this is just luck; don't beat yourself up about it.",
                                                    "score": 51,
                                                    "author": "Mjolnir12",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "With this bitcoin deal, if you have $7.1 million dollars of it, can you just cash all of that out at any given moment and get the cash?  If so, how does that even work with such a large transaction like that?",
                                    "score": 14,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "I wouldn't lose a wink, because I'd be taking a forever nap. ",
                            "score": 83,
                            "author": "MyHeartLikeAKickdrum",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I'd literally kill myself from agony",
                            "score": 44,
                            "author": "XFX_Samsung",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "I wouldn't lose much cause I'd be sleeping eternally if that happened to me.",
                            "score": 23,
                            "author": "shane727"
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "An old man turned 98. He won the lottery and died the next day.",
                    "score": 145,
                    "author": "Zoelings",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Isn’t  it ironic? Don’t you think?\n\n",
                            "score": 81,
                            "author": "Whonucknuck",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "This is one of the things that saddens me. Most lottery winners seem to be old people and most don't look like they had an easy life. They slaved away their entire lives and now when they are old and no longer have the power to truly enjoy life and live their dreams, they get the means to do it. That shit would break me as a man.",
                            "score": 46,
                            "author": "HerrXRDS",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I'd hire pretty women to tend to my house all day every day and call me papi while I silently weep for my erectile dysfunction",
                                    "score": 65,
                                    "author": "LordPadre",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Man with a PLAN!",
                                            "score": 30,
                                            "author": "shitposter1000"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Knowing you had it but it's gone would be crushing. \n\nThere was a guy who used 10k bitcoin to buy two pizzas in 2010. In today's value that's worth 58 million dollars. ",
                    "score": 115,
                    "author": "Ungreat",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Yea that's straight to the noose for me",
                            "score": 97,
                            "author": "Deivv",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Life is a gamble. I would enjoy the fact that I ate 58 million dollars of pizza.  ",
                                    "score": 103,
                                    "author": "SquanchytheSquancher",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "You’re the light we need in this world ",
                                            "score": 47,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; There was a guy who used 10k bitcoin to buy two pizzas in 2010. In today's value that's worth 58 million dollars. \n\nhe help legitimize bitcoin for purchases. If he havnt did that, bitcoin would not been valued as much",
                            "score": 49,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "People don't seem to understand that when the pizza story gets mentioned. If everyone who had bitcoin in the early 2010's just hoarded it, it wouldn't be worth the crazy amount it is now",
                                    "score": 21,
                                    "author": "Camsy34",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "No! The very thought makes my heart hurt. ",
                    "score": 10,
                    "author": "_madnessthemagnet"
                }
            ]
        },
        {
            "level": 0,
            "comment": "I once found a meatball in my old shirt that was only two days expired. Still ate it",
            "score": 1477,
            "author": "UglyChild",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 378,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Assuming he ate one bit every year for the next 24 years. You get more meatball that way. ",
                            "score": 164,
                            "author": "i__love__lamp__",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Yeah, but you have to eat it before the added meat hatches into flies. ",
                                    "score": 40,
                                    "author": "HerrXRDS",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "more flies = more meat",
                                            "score": 62,
                                            "author": "NipplesInAJar",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "more flies = meat that flies away ",
                                                    "score": 30,
                                                    "author": "HerrXRDS",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Once, there was an OP with a meatball.  One day, one of the flies on the meatball flew away.  That night, all the other redditors commented, \"that's too bad.\"  OP said, \"maybe.\"  The next day, the fly returned, and brought four new flies with it.  That night, all the other redditors commented, \"that's great,\" and OP said, \"maybe.\"  The next day, OP tried to eat one of the added-meat-flies, and became deathly ill.  All of the other redditors commented, \"that's too bad.\"  And OP replied, \"maybe.\"  The next day, Those Chinese Sons of a Bitches Conscription Officers came by to draft OP into the army, but seeing how sick he was, decided he was ineligible and rejected him.  All the redditors commented, \"that's great!\"  And OP replied, \"maybe.\"\n\nThe whole process of nature is an integrated process of immense complexity.  And it is really impossible to tell whether anything that happens in it is good or bad, because you never know what will be the consequences of a misfortune - or, you never know what will be the consequences of good fortune.",
                                                            "score": 29,
                                                            "author": "purkle_burgularom",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Man I found five bucks in a pair of jeans the other day and thaught I was the shit, I can't even fathom how'd I feel if I found 24 million dollars while making out with my ex. ",
            "score": 491,
            "author": "MyGymEatsBad",
            "replies": [
                {
                    "level": 1,
                    "comment": "I see what you did there",
                    "score": 98,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 65,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He took the five dollars from his ex's jeans while they were making out",
                                    "score": 196,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "that's such a weird and random joke",
                                            "score": 118,
                                            "author": "adhi-"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Lucky guy! He should play the... oh. ",
            "score": 646,
            "author": "pm_me_your_kindwords",
            "replies": [
                {
                    "level": 1,
                    "comment": "¯\\\\_(ツ)_/¯",
                    "score": 135,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 66,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "But it is.  Both biceps.",
                                    "score": 18,
                                    "author": "StopTop"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Gave me anxiety just reading this. ",
            "score": 208,
            "author": "IKn0wKnothingAMA",
            "replies": [
                {
                    "level": 1,
                    "comment": "*shiver*",
                    "score": 21,
                    "author": "[deleted]"
                }
            ]
        },
        {
            "level": 0,
            "comment": "If it was my shirt itt would have been washed and the numbers barely descernable and it would have expired two days prior. My world of woe.\nI wish him well and urge him to see the you tube video of \"10 things to do when you win the lottery.\"",
            "score": 136,
            "author": "bern1228",
            "replies": [
                {
                    "level": 1,
                    "comment": "You wont believe number 6",
                    "score": 82,
                    "author": "JARS2001",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lottery owners hate this one simple trick. ",
                            "score": 36,
                            "author": "shaun_of_the_south"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "If reddit has taught me anything it's that he's screwed now that everyone knows ",
            "score": 66,
            "author": "emaciated_pecan",
            "replies": [
                {
                    "level": 1,
                    "comment": "It's a good thing then that he's not taking the $24 million all at once. ",
                    "score": 32,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I wouldn't either, I don't trust myself or the people in my life\n\n",
                            "score": 13,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Great!  Can I have it back please?\n\n(i'm a nice guy,  I'll split it 50/50)",
            "score": 180,
            "author": "NiceSasquatch",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 84,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "$24 million sounds like such a fantasy to me. I'm down to eating ramen and peanut butter straight from the jar. ",
            "score": 137,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "With $24M, you can afford to go to Whole Foods and freshly grind your own peanut butter.",
                    "score": 95,
                    "author": "idlephase",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "At least a few times ",
                            "score": 66,
                            "author": "rieoskddgka",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I've seen peanut butter and jelly in the same jar but where do you get jars of peanut butter and ramen?",
                    "score": 27,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Must be nice! I'm eating peanuts off the bar floor",
                    "score": 29,
                    "author": "RedHorseStrong",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt;68-year old Jimmie Smith... chose to receive his payments over the course of 26 years.\n\nWHYYYYYYYYYY!?!?!?!?!",
            "score": 1671,
            "author": "Mr_Stirfry",
            "replies": [
                {
                    "level": 1,
                    "comment": "He has 12 grandchildren. He's most likely thinking about securing their futures in a more sensible way",
                    "score": 1559,
                    "author": "frehdeee",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "&gt; He's most likely thinking about securing their futures in a more sensible way\n\nWHYYYYYYYYYY!?!?!?!?!",
                            "score": 1196,
                            "author": "Mr_Stirfry",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 687,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Why",
                                            "score": 368,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Speak up I can't hear you.\n",
                                                    "score": 275,
                                                    "author": "DrambleReddit",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 89,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Thank you for subscribing to Cat Facts",
                                                                    "score": 70,
                                                                    "author": "oppai_suika",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Did you know that a group of cats is known as a clowder?",
                                                                            "score": 38,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Is that a group of 10 cats specifically?",
                                                                                    "score": 16,
                                                                                    "author": "oppai_suika",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Bc fuck you that’s why. Jk maybe he endured extreme poverty growing up and missed out on a lot of opportunities bc of a lack of resources. Maybe he couldn’t provide for his kids. He’s making up for it. Maybe he thinks it’s worth his grandkids having a comfortable life vs him living extravagantly for the next 10 of his. ",
                                                    "score": 20,
                                                    "author": "w0nderbrad"
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "No but taking the lump sum and investing it over 26 years would be a lot smarter",
                                                    "score": 47,
                                                    "author": "SpellsThatWrong",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "Very first thing you learn in any basic level finance/accounting/money management course, is always to take the lump sum. \n\nNow that money stays the same and has to weather inflation, whereas, he could've put it into trust funds for his grand kids or kids. People keep using that as an argument for doing the 26 years, but it's still a stupid idea. It would be so much more valuable in a trust fund. What happens if the state goes bankrupt, like my state Illinois, and refuses to pay out lottery winnings? You're fucked. \n\nAlways take the lump sum. If you want it for your kids/grandkids. Put it in a trust, in their names. Invest the rest in things that you cannot directly touch, except the dividends. Do your research, make sure they are the safest bets. Nothing is 100% but there are investments funds that are pretty close to that with pretty damn good ROI's. Don't invest in friends, and don't give loans to family.",
                                                            "score": 60,
                                                            "author": "Middle_Ground_Man",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I mean, my biggest question would be whether I'm getting a $24 million dollar hooker or 24 million dollar-hookers.",
                                            "score": 14,
                                            "author": "spacemoses",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I remember a post saying that you lose more money receiving lottery prize in  increments  rather than collecting the full amount and investing.",
                                            "score": 41,
                                            "author": "Giancarboltz",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "That is exactly the case. Just think the flat amount you'll get in 25 years would have had 25 years of interest in the bank!",
                                                    "score": 35,
                                                    "author": "baerton",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Trust the lottery to still have the money 26 years later to pay you or your family? Thats a lot of faith. ",
                            "score": 172,
                            "author": "NobleSixSir",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Better take the lump sum and buy google  stock",
                                    "score": 95,
                                    "author": "SpellsThatWrong",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Right. Otherwise they hold and invest it and make some money back, all while paying you less every year as currency becomes less valuable. ",
                                            "score": 51,
                                            "author": "03Titanium"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Yup. Always better to take the lump sum and invest it. Invest right and you'll have a sizeable ROI. \n\nHaving it paid out over 26 years effectively gives you less bang for your buck as the value of the dollar decreases year over year.",
                                            "score": 31,
                                            "author": "well___duh",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "I have literally never heard of a major lottery corporation (in an industrialized nation) going bankrupt. Do you think people are just going to stop gambling one day?",
                                    "score": 28,
                                    "author": "burf",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Didn't Illinois stop payments for lottery winners at one point?",
                                            "score": 14,
                                            "author": "Arcland"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Illinois has to shut down their draws recently while they worked out a state budget.",
                                            "score": 12,
                                            "author": "ModdedMayhem"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Perhaps he’s lying so the scummy part of his family doesn’t crawl out of the woodwork demanding his money. Or killing him for it.",
                    "score": 32,
                    "author": "Gibbothemediocre",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "maybe he is smart enough to know the statistic that nearly all lottery winners go bankrupt within 10 years and taking the annuity will help him to curb his spending? ",
                    "score": 250,
                    "author": "kjhgsdflkjajdysgflab",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "selfless. 68 years old. what is he going to do with 24 million? He'll collect nice payments periodically that will have him living comfortably until his final days and then the remaining amounts will be inherited likely by someone else.\n\nEDIT: someone poked a huge hole in this theory. Even if he took the lump sum that is still able to be inherited. So I have no idea why someone would do this.",
                    "score": 90,
                    "author": "jbourne0129",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Is it even possible to inherit an annuity from a lottery win?",
                            "score": 18,
                            "author": "Stepoo",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Very similar thing happened to me recently.  I found a $2 scratcher in a jacket only a few days after it expired.",
            "score": 43,
            "author": "[deleted]",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Reminds me of the time I found one that was about a week expired.\n\nI did myself the considerable favor of not looking up the ticket's winning numbers.",
            "score": 78,
            "author": "Fredasa",
            "replies": [
                {
                    "level": 1,
                    "comment": "Where's the ticket now?",
                    "score": 22,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 20,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Probably better than if he found out he had the winning numbers, as low as that chance may be",
                            "score": 24,
                            "author": "DisingenuouslyGenius",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I found $50 in my pants this morning 20 minutes before doing laundry. I thought my life had turned around",
            "score": 24,
            "author": "dissapointing_poetry",
            "replies": []
        },
        {
            "level": 0,
            "comment": "When I was 12 I bought a scratch off with my parents permission. We went home and I was scratching as I was walking in my house. Turns out it was a winning ticket. Told my parents and they just ignored me and said \" we'll redeem it next time we go to the store\". Next time never came and I still wonder how much money I won that day ): ",
            "score": 26,
            "author": "PepsiLEGEND",
            "replies": [
                {
                    "level": 1,
                    "comment": "Lmao they jacked you and went to redeem it themselves without you. ",
                    "score": 38,
                    "author": "sjchoking",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is my worst fear everytime I find an old lottery ticket in a jacket or tucked into my wallet.",
            "score": 22,
            "author": "Mr_Potamus",
            "replies": []
        },
        {
            "level": 0,
            "comment": "He has two daughters and TWELVE grandkids!",
            "score": 20,
            "author": "59424",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I don't understand why the lottery would advertise the existence of the ticket, surely they want it to expire so they can keep the money?",
            "score": 38,
            "author": "FkingMeh",
            "replies": [
                {
                    "level": 1,
                    "comment": "Unclaimed money doesn't become profit. Different places do different things with it but usually it goes towards a future jackpot prize. Some states choose to use it to help offset tax burdens or put it towards the community.\n\nClaiming money and making headlines is great PR towards future purchases.",
                    "score": 64,
                    "author": "egnards",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I found 1300 in twenty dollar bills in the snow out front of my old apartment.\n\nI only found 80 at first and was pumped, walked literally 50 feet to the Cumbies and bought a pack of smokes. On the way back, I saw more, so the hunt began. Last one I found was in the wallet of my bud living in the apartment next to me. \n\nGave it back. He was stoked, gave me 300 of it so I guess that's like winning the lottery.    ",
            "score": 15,
            "author": "GimmeDatThroat",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Hey it's me, your brother.",
            "score": 14,
            "author": "MR_HODGE"
        },
        {
            "level": 0,
            "comment": "Idk why I thought the shirt wasn't his and I kept thinking some dude lost his winning ticket.",
            "score": 29,
            "author": "KamikazeSurge",
            "replies": []
        },
        {
            "level": 0,
            "comment": "The fact that it would expire at all is bs. ",
            "score": 13,
            "author": "go_ask_your_father"
        }
    ]
}