{
    "id": "7q3g2x",
    "score": 64354,
    "title": "Florida 20-year-old wins $451 million Mega Millions jackpot: \"I'm only 20, but I hope to use it to pursue a variety of passions, help my family and do some good for humanity.\"",
    "author": "madazzahatter",
    "date": 1515833296.0,
    "url": "https://www.reddit.com/r/UpliftingNews/comments/7q3g2x",
    "media_urls": [
        "https://www.nbcnews.com/news/us-news/florida-20-year-old-wins-451-million-mega-millions-jackpot-n837386"
    ],
    "other_urls": [],
    "postText": "",
    "comments": [
        {
            "level": 0,
            "comment": "&gt; take care of my family\n\nHe has no idea how big his 'family' is about to get.  ",
            "score": 26355,
            "author": "JMJ05",
            "replies": [
                {
                    "level": 1,
                    "comment": "I hope the guy actually lives a good life.",
                    "score": 9519,
                    "author": "i_make_song",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hey it's me your brother",
                            "score": 4720,
                            "author": "numun_",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Hey it's me your another mother.",
                                    "score": 2115,
                                    "author": "poopellar",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 1192,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Is it possible to share an image of this page without violating his privacy? \n\nTo the winner: care to indulge our curiosity over your new-found family?",
                                                    "score": 379,
                                                    "author": "tayterbrah",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "I've seen his wall. Lol, pretty crazy how his post likes were around 10 - 30 per post, and then after his win they jump up to 400 - 500. \n",
                                                            "score": 235,
                                                            "author": "Alundra828",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Man and here I am thinking how fun it would be to give all those fuckers the middle finger",
                                                                    "score": 164,
                                                                    "author": "greengiant89",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "[deleted]",
                                                            "score": 268,
                                                            "author": "[deleted]",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Iirc lotto wins are required to go public to claim the money in part to help demonstrate to others the lotto is not a scam. I could be wrong though...or it may depend on the state. \n\nEdit: lotto not loot, though I guess that kinda worked. ",
                                                                    "score": 138,
                                                                    "author": "Yonefi",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "Depends on state. Some place you can set up a llc and the \"company\" can pick up the money\n",
                                                                            "score": 31,
                                                                            "author": "Lustful_Llama",
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "[deleted]",
                                                                            "score": 91,
                                                                            "author": "[deleted]",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "Here in the Philippines, letting the public know you won is like jaywalking into a highway",
                                                                                    "score": 49,
                                                                                    "author": "ganjiraiya",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "If you win the lotto, you want to immediately contact a lawyer and create an llc and deed the ticket over to the company. Then have your lawyer accept the winnings on behalf of the company publicly. This way you are completely separated from the winnings.\n\nThere is a guy on here who posted a massive how to on what to do when you win the lottery, basically how to minimize the likelihood that your life is ruined.",
                                                                    "score": 17,
                                                                    "author": "Aurum555",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "His name's already public.\n\nI actually grew up with Shane, he's not going to do anything stupid with the money.",
                                                            "score": 179,
                                                            "author": "Dallagen",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "He's not going to have a choice. His best bet is to go hide for a long time. From everyone. \n\nThere's a Reddit post about what to do if you win the lotto. I recommend he reads it. \n\nThe already rich guy in WV got sued by people he didn't even know because their wives left them because they were inferior due to his massive wealth. He ended up settling out of court (paying these people off!) rather than go through court, even though it was a BS claim.\n\nShane is about to wish he was never a millionaire. ",
                                                                    "score": 119,
                                                                    "author": "calmor15014",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "https://www.reddit.com/r/AskReddit/comments/24vo34/whats_the_happiest_5word_sentence_you_could_hear/chb4v05?context=3\n\nThis is the post you're talking about and if I knew the guy I would send it him, even though he's too late to do half the advice which is supposed to happen BEFORE going public.\n\nAt least any future potential lottery winners in here can read it and know what to do. ",
                                                                            "score": 105,
                                                                            "author": "Smash678",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "It's his own fault for revealing his identity. 101 mega winners rule is stay anonymous. ",
                                                    "score": 384,
                                                    "author": "Nihilisticky",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "You generally can't stay anonymous, the contest uses winners for promotional purposes, it's in the fine print.",
                                                            "score": 308,
                                                            "author": "andrewbadera",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "[removed]",
                                                                    "score": 489,
                                                                    "author": "[deleted]",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "That's freakin' hilarious.  I guess it doesn't help *too* much if they publish their names, but if it makes them even a little harder to trace...",
                                                                            "score": 129,
                                                                            "author": "OneGeekTravelling",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "There are ways around that. Like claiming the winnings through a trust or LLC. That's why step one is ALWAYS tell nobody and get a lawyer.\n \nWinning the lottery is a lot like getting pulled over: keep your mouth shut and lawyer up.",
                                                                    "score": 254,
                                                                    "author": "chrisbrl88",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "He did claim through LLC.  Setup two days before he claimed prize. ",
                                                                            "score": 94,
                                                                            "author": "Cer0reZ",
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "This is why you can a lawyer to set up a trust. The lawyer claims the winning in the name of the trust. \n\nI think New York has a lawyer that advertises himself as the lottery lawyer. Dozens of pictures of him holding the big check for his anonymous clients. ",
                                                                    "score": 97,
                                                                    "author": "[deleted]",
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "This is true in most states, including ~~Facebook~~Florida, yeah.\n\nThough he should've locked his Facebook account down.",
                                                                    "score": 58,
                                                                    "author": "rabidstoat",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "&gt; including Facebook\n\nTIL Facebook is a state",
                                                                            "score": 116,
                                                                            "author": "LooksAtMeeSeeks",
                                                                            "replies": [
                                                                                {
                                                                                    "level": 9,
                                                                                    "comment": "[deleted]",
                                                                                    "score": 43,
                                                                                    "author": "[deleted]",
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "level": 7,
                                                                    "comment": "I would wait to claim it, grow my hair and a big beard then claim it in another state. After the photos I'd immediately shave my head and beard, change my name, split it into $20m chunks and put them in different investments that are inaccessible to me for a variety of times. Some within a year, some 3 or 5 then one in 10 years, one 15, etc. THEN, sure I'd come home and pay off my parents mortgage, buy Rolexes for my friends with the understanding it's a 1 time gift and that drinks or whatever will always be on me and that if they ever ask again it will be probably be the last time they speak to me.\n\nAs exciting as it would be to try to turn it into a billion dollars or help save the world I figure at least this way if you screw up you get some do-overs. ",
                                                                    "score": 133,
                                                                    "author": "TeH_MasterDebater",
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Only 6 states allow anonymity.",
                                                            "score": 44,
                                                            "author": "pleasetrimyourpubes",
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Hey it’s me your father who went out to get cigarettes a few years back.",
                                            "score": 131,
                                            "author": "[deleted]"
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Let's go bowling.",
                                    "score": 40,
                                    "author": "Deadsuooo"
                                },
                                {
                                    "level": 3,
                                    "comment": "Hey cousin! Wanna go bowling?",
                                    "score": 31,
                                    "author": "i_only_eat_nachos",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He will be targeted by bad characters. Drug people, con men, gangs, etc.  It would be best not to advertise that you won the lottery. ",
                            "score": 82,
                            "author": "Nightowl2018",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "He’ll live a good life in that almost all of his needs will be met, a bunch of people will be serving him to make his life easier, and he doesn’t have to work ever again or do anything he doesn’t want to.\n\nBut when it comes to the important factor of love and relationships, he will always wonder if people like him for him or for his money. He will have trouble finding a fulfilling relationship because the ones who are genuinely attracted to him for him will be lost in the sea of hot gold diggers and sugar babies. After getting burnt by these girls, each time he meets someone new who he’s really attracted to, he’ll always have a suspicion that they are just after the lifestyle that he can provide for them.\n\nSoon he’ll be in his thirties and spiraling down into depression as he’s stuck in this limbo of dating and still playing the field, just because the turnover rate of girls is about one or two new ones per week. No long lasting meaningful relationship is ever formed. There probably were people who like him for him, but he mistakenly thought that she was another gold digger, or he pushed her away with his “gold digger tests”, or he didn’t find her as attractive as some of the models/gold diggers he slept with before.\n\nAnd this is an ongoing problem with everything, because the money has made him jaded. Things that were acceptable once before like a small TV or small house aren’t adequate anymore. Everything will taste worse than the seven-course meals he ate at those three Michelin-starred restaurants. Every experience will feel lame compared to the crazy things he’s done when he traveled the world and splurged. Every car he drives will feel slow and cheap compared to his Lamborghini’s and Tesla’s. He has done it all already in his 20s. He has spoiled himself.\n\nHe wishes he could tell people about his depression. But nobody can relate. Some tell him that he has no right to complain because others are struggling to pay their bills. They all just tell him to appreciate what he has or to give his money to them. He makes a strong effort to do that, but it still doesn’t help his loneliness. And talking about it only backfires. Nobody has any sympathy for him, and it isolates him more from the world.\n\nHe sometimes wonders if the money is a curse. He constantly worries about people robbing him or stealing from him. He has frequent nightmares of people breaking into his house. So now he sleeps with an assault rifle and pistol next to his pillow. It didn’t help. The nightmares still haunt him. He just had one this morning and it woke him up. And now he’s on his phone, sitting in his bed, and typing some long reddit comment with no satisfying ending. Because that’s the curse of the hedonic treadmill; he will never be satisfied.",
                            "score": 807,
                            "author": "regoapps",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 549,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 48,
                                    "author": "[deleted]",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I mean..... or not....\nHe could have a girlfriend already and they stay together? Not everything goes the worst way possible.",
                                    "score": 175,
                                    "author": "Mr_Mack",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Oh yeah. Everyone is gong to be milking him. He should splurge a little bit and then invest it and not tell his future partner about it. They should be set for generations to come ",
                    "score": 824,
                    "author": "instenzHD",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I met a guy a few times who won quite a few million here in Canada, nothing like powerball, but enough to take care of you and a few generations. He said the saving grace was that they got his city wrong, so he was John from Niagara Falls, instead of John from Ottawa, for example. \n\nBut, he said the number of people who were \"long lost cousins\" or sob stories from people who needed money for their kid's life-saving surgery (to my knowledge, we have free healthcare in Canada) were the worst part about winning. He took care of his immediate family, and proceeded to waste the rest of the money.\n\nI truly hope this kid has a good head on his shoulders, and a good family behind him. History is against him, but I'll root for him to do some good as he says he wants to.",
                            "score": 697,
                            "author": "quarter-water",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "In America you can hire a law firm to essentially claim the ticket for you and transfer the funds to you.  Officially in the paper and everywhere else it'll say something like the money was paid out to \"Spiderman Incorporated\" or whatever.  Obviously the government is still going to want it's tax cut, but as far as I know there's no legal way anyone could find out who won.\n",
                                    "score": 378,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "I think that might vary based on state. I've been told that some require a picture and they post it online and in the paper etc. Some states have the whole \"anonymous winner\" thing. Not sure if any of what I just said is true but I've always believed it.",
                                            "score": 258,
                                            "author": "phaiz55",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "In the UK I think you have to claim it in person, but you can wear a costume, morphsuit etc. I remember at least one guy picking his up while wearing something like a morphsuit.\n\nOr you can be like the UK couple who won £181m in the Euromillions, talked about it and got front page on all the newspapers - and described their new house - who then a year or so later got robbed in their new house because they'd been blabbing to all the newspapers about their money.\n\nIf I won that sort of money, I'd spend a lot of it protecting my identity. Or hiding in plain sight. ",
                                                    "score": 195,
                                                    "author": "IlliterateNonsense",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "No, in the UK you have the right to remain anonymous. Most people do not agree to their name being released despite substantial pressure from Camelot.\n\n&lt;15% of winners in the UK go public.",
                                                            "score": 141,
                                                            "author": "How2999",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "[removed]",
                                                    "score": 303,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;hookers and blow are not\n\nThis is where you lost me. ",
                                                            "score": 149,
                                                            "author": "[deleted]",
                                                            "replies": []
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "&gt;(bodybuilding and travel are hobbies, hookers and blow are not).   \n  \nI'd rather say that bodybuilding and travel are *good* hobbies, hookers and blow are not.",
                                                            "score": 17,
                                                            "author": "TerryNL"
                                                        },
                                                        {
                                                            "level": 6,
                                                            "comment": "Hookers and blow aren’t hobbies? I may have filled out a dating profile wrong then....",
                                                            "score": 14,
                                                            "author": "TheBetaTurkey18",
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "level": 5,
                                                    "comment": "Correct - some don’t allow anonymous winners so people know the games aren’t rigged.",
                                                    "score": 11,
                                                    "author": "DeezNeezuts"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "&gt; not tell his future partner about it\n\nThey will just google him and find out. Might be worth it to change your name to \"John Smith\" before you accept the prize, then change it back afterwards so it's buried away on the internet.",
                            "score": 47,
                            "author": "diemunkiesdie",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "He also has no idea how resentful, greedy and downright evil his family is about to get. The data on lottery winners is clear. They are usually torn apart by some kind of mix of sob stories, family feuds and lawsuits. ",
                    "score": 256,
                    "author": "barsknos",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "From the article, he's already got a good step past that.\n\n&gt; he turned in his ticket Friday at Florida Lottery headquarters in Tallahassee. His father and his lawyer came with him.\n\n\nThey set up a trust, with the kid as the only managing member.\n\nI'd like to think Dad is helping to do it he right way as possible.",
                            "score": 205,
                            "author": "AFuddyDuddy",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "He’s both trustee and beneficiary...?",
                                    "score": 13,
                                    "author": "Death_Star_"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "&gt; le bit and then invest it and not tell his future partner about it. They should be set for generations to come\n\nI have a formula ready to use if I ever win this big.. Multiply how much they want by 0 and then add 5 cents.\n\n",
                    "score": 82,
                    "author": "UnwashedPenis",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 43,
                            "author": "[deleted]",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Here in Switzerland if you win a lot of money they send a psychologist and a finance guy to prepare you for the new rich life.",
            "score": 4653,
            "author": "Thokkerius",
            "replies": [
                {
                    "level": 1,
                    "comment": "Same in the UK. \nDespite the assistance, people still blow it in a year, in some cases.",
                    "score": 510,
                    "author": "6foot8",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[deleted]",
                            "score": 286,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Here in America, some states don't even give you the option of anonymity. ",
                                    "score": 189,
                                    "author": "Shijin83",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I’d much rather remain anonymous. I feel like being public about it just puts a giant target on your back. ",
                                    "score": 72,
                                    "author": "[deleted]"
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Switzerland is great.",
                    "score": 1003,
                    "author": "Sirotto",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "the psychologist is really for the finance guy. they take your money and you may be lucky to get a Toblerone",
                            "score": 451,
                            "author": "Yaroze",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Guide on winning lottery.\n\nhttps://www.reddit.com/r/AskReddit/comments/24vzgl/you_just_won_a_656_million_dollar_lottery_what_do/chba4bf?utm_source=reddit-android",
            "score": 5834,
            "author": "wasting2muchtime",
            "replies": [
                {
                    "level": 1,
                    "comment": "I remember saving that a while back just in case",
                    "score": 1879,
                    "author": "Slntrob",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "So did I, even though I never buy lottery tickets. lol",
                            "score": 546,
                            "author": "crazyisthenewnormal",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Same lol",
                                    "score": 57,
                                    "author": "Xogmaster",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I've spent $20 in the last 3 years on lottery tickets. And this was all just last week. I didn't win. So it looks like I'm taking another 3 year hiatus.",
                                    "score": 23,
                                    "author": "Opset",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Love your optimism, Fry. ",
                            "score": 578,
                            "author": "ChewyGums",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Gonna invest in anchovies. ",
                                    "score": 167,
                                    "author": "Slntrob",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "I wish I could give you gold ",
                                    "score": 16,
                                    "author": "colormechristy",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I thought that was a guide on how to win the lottery. Was disappointed. ",
                    "score": 238,
                    "author": "SeaTwertle",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s pretty much the rules as tinder. \n\n1. Be lucky\n2. Don’t be unlucky ",
                            "score": 205,
                            "author": "pantyboyXXX",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Someone get this link to the guy who won. ",
                    "score": 109,
                    "author": "vipros42",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I mean we could, but it would get lost in the flood of gold diggers",
                            "score": 70,
                            "author": "Sciencetor2",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Especially when redditors ask him for a $1m tip for providing the link",
                                    "score": 16,
                                    "author": "DirdCS"
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Unfortunately, the guy already broke the first rule.",
                            "score": 53,
                            "author": "chasmccl",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 64,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I think someone said rightly that that was the most informative post that he'll never use. Kind of puts things in perspective.\n\nIts not really money that solves your problems as much as not being poor.",
                    "score": 64,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 92,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "They don't want people to think its fake or that only lottery employees win or something.",
                            "score": 95,
                            "author": "Satirei",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Hopefully he doesnt get killed by idiots looking to rob him. A lottery winner was recently murdered by a group of thugs in his home that thought he had the winnings on him\n\nhttps://www.google.com/amp/www.nydailynews.com/amp/news/crime/georgia-lottery-winner-murdered-home-invasion-article-1.2505105",
            "score": 1492,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Jesus, that's so sad. ",
                    "score": 536,
                    "author": "hey__its__me__",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "And extremely fucking stupid to think he just had millions of dollars stashed away in his house.",
                            "score": 413,
                            "author": "kopecs",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "it wasnt even 500k. Fucking murderous idiots, you could mug someone in times square and probably get more cash than this dude had with him.",
                                    "score": 246,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "After taxes it wasn't even 300k. The house they broke into was probably worth more then the winnings.",
                                            "score": 10,
                                            "author": "azhillbilly",
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "Criminals of that sort are a particular subset of poor people. They have never even tried to live as anything other than a criminal so they assume that everyone goes around either wearing their paltry wealth as grotesque jewellery or having a sock somewhere full of cash. That the money might be invested never occurs to them.",
                                    "score": 66,
                                    "author": "Privateer781",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "What a bunch of idiots, so sorry for that guy. \"He probably has a room we can just go in and bag up money and jewels.\"\n\nWas their planning for this watching Scrooge McDuck?",
                    "score": 217,
                    "author": "[deleted]"
                },
                {
                    "level": 1,
                    "comment": "[removed]",
                    "score": 57,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Unbelievably stupid fucks. Did they really think he would just have half a million dollars in cash on him? So sad that they ended his life for nothing. I hope they rot in prison. ",
                    "score": 18,
                    "author": "derpington_the_fifth"
                }
            ]
        },
        {
            "level": 0,
            "comment": "2 years later \n\n\"My sincerest apologies. It was not my intention to sniff coke off of a midget's ass on a 10 million dollar cruise and having it broadcasted to the world through facebook live\"",
            "score": 5902,
            "author": "Ensirius",
            "replies": [
                {
                    "level": 1,
                    "comment": "With that kind of money, he doesn't have to apologize to anyone for that sort of thing.",
                    "score": 951,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "quite the opposite: brag about it, then run for president",
                            "score": 651,
                            "author": "Hutzbutz",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "I like his credentials. self made multimillionaire by age 20. I'd At least hear him out before I counted him out of the election. ",
                                    "score": 169,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "He's got fuck you money.",
                            "score": 106,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "“You know how much money you have to have to tell a girl to shut the fuck up?”\n\n",
                                    "score": 39,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Sounds like something Florida Man would do.",
                    "score": 71,
                    "author": "That_Dude_Lebowski",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The goal of my content is always to entertain ",
                    "score": 53,
                    "author": "thejoej",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "coke*",
                    "score": 107,
                    "author": "Bluedemon777",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What was the typo? Cole? Cork? Cum? I need to know. ",
                            "score": 113,
                            "author": "RugBurnDogDick",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Pepsi ",
                                    "score": 409,
                                    "author": "Professor_pranks",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Cock",
                                    "score": 58,
                                    "author": "Shwinstet",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "[deleted]",
                                            "score": 47,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Yeah imma have to just take your word on that one.",
                                                    "score": 34,
                                                    "author": "Ninganah"
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "&gt; choosing to get $282 million at once instead of more in annual installments.\n\nBeer in hand worth two in fridge.",
            "score": 3107,
            "author": "LegendaryFalcon",
            "replies": [
                {
                    "level": 1,
                    "comment": "I thought it’s commonly said to take the lump sum? ",
                    "score": 373,
                    "author": "Goodrichguy",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It basically amounts to whether or not you think you can get a better rate of return over x number of years compared to what the lottery pays. Most financial analysts will suggest you take the lump sum, because if you invest the lump sum in a basic S&amp;P 500 index fund you are going to do better over 20 or 30 years than the lotto payout.",
                            "score": 302,
                            "author": "ZodiacMan423",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Take the lump sum *if you know what to do with it*.\n\nBig difference. ",
                            "score": 350,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 179,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "I guess he did it for tax purposes. He will probably be in the highest tax bracket when he files his 2018 taxes but could move to the lowest bracket in 2019 due to the fact that he's probably not going to work ever again lol. ",
                    "score": 1263,
                    "author": "McIntyre2K7",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It’s better to get it in a lump sum in general due to inflation and opportunity cost of using that money to invest, regardless of tax implications.",
                            "score": 1442,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 139,
                                    "author": "[deleted]",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Yes but he will still have passive income from his investments, hopefully. ",
                            "score": 26,
                            "author": "Bkben84",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Oh... please tell me that's not his actual name plastered on the news\n\nF",
            "score": 1602,
            "author": "JMJ05",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 937,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "This rule needs to be abolished in those states since the advancement if technology makes it so easy to find people nowadays.\n\nI understand people want to know that a person actually won it instead of a lottery official scamming someone but I'm sure something could be thought of to verify the lottery wasn't rigged.",
                            "score": 910,
                            "author": "XXMAVR1KXX",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 378,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "It's amazing what happens sometimes. In California i believe some local in an area like Compton won a measly 100k and the next day his house was robbed and he was murdered. Fucking morons thought people just got a suitcase of cash or something immediately ",
                                            "score": 287,
                                            "author": "[deleted]",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "My neighbor won a 10k from a scratcher and he posted it on Facebook (stupid, I know). His comment section was filled with threats, thirsty people, and friends/family he's never seen or heard from in years. \n\nI couldn't imagine winning 200+ million and the type of people that would come out the wood work. \n\nIt would be entertaining at first, but after a while it would come down to questioning every friendships/relationship thereafter. ",
                                                    "score": 152,
                                                    "author": "bxncwzz",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "As crazy as the strangers might be, your family, friends and acquaintances will be crazier always.  The more money you win the crazier they'll be.  The people close to you will actually believe they deserve the money and that you are the bad guy for keeping it from them.  These thoughts will consume their every waking hour.  They will come up with investment schemes that are totally worth it bro.",
                                                            "score": 90,
                                                            "author": "MoeSauce",
                                                            "replies": [
                                                                {
                                                                    "level": 7,
                                                                    "comment": "Yeah I'm really happy this young guy won it, but also feel really bad for him at the same time. Just looking at all the comments he is getting now on Facebook, from all these greedy ass people. There are only a handful of people who would get anything from me, the rest could fuck right off. Would honestly probably delete all social media.",
                                                                    "score": 42,
                                                                    "author": "x_______________",
                                                                    "replies": [
                                                                        {
                                                                            "level": 8,
                                                                            "comment": "It's not so bad, just move to live in a wealthy neighborhood in a new state/country, get a P.O. box, hire an off duty detective to go through your mail once a week, delete your social media or set it private and delete all your friends then add them back on a case by case basis.  Most important I think would be a month long (at least) vacation right after you win.  Get the ball rolling on your new life, stay in contact with as few people as possible and enjoy the money.  Let the initial fever die down and never share your plans with anyone.  Learn to politely decline offers.  You can't afford to rile anyone up.  You can't even really afford to get riled up yourself.  You have more to lose than 99% of the nation, always remember that.",
                                                                            "score": 34,
                                                                            "author": "MoeSauce"
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "level": 4,
                                            "comment": "I always dreamed of winning lottery (like seriously, I have been day dreaming about since I was 18, and I'm 33 now) but this always scared me. Having my name plastered everywhere and also reading the horror stories of past winners. I agree, this kid needs to bail, or change names or something.",
                                            "score": 94,
                                            "author": "XXMAVR1KXX",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "Thankfully my name is awfully common and I mean there are at least 100000 more people with my same name. Soooo... I would'nt really mind my name being known, just give me the money! ",
                                                    "score": 15,
                                                    "author": "Ramanash_",
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "level": 2,
                            "comment": "Florida is indeed one of those states, which is interesting considering a Florida lottery winner [was murdered](https://en.m.wikipedia.org/wiki/Abraham_Shakespeare) so the woman could take his money.",
                            "score": 43,
                            "author": "vanessss4",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Yep it is, it’s required for lottery winners to be publicly identified in a large majority of states; 44 to be exact.  Only 6 states ( Delaware, Kansas, Maryland, North Dakota, Ohio, and South Carolina) allow you to claim your winnings anonymously.\n\nEdit: F ",
                    "score": 92,
                    "author": "Regansmash33",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Can you not hire an agency to collect winnings on your behalf so you remain unidentified? Because that just sounds so unsafe haha. ",
                            "score": 62,
                            "author": "TrueJacksonVP",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "family and friends are gonna rip em to shreds.",
            "score": 1022,
            "author": "tinder_trash",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; family and friends are gonna rip em to shreds.\n\nIf only people actually had brains and balls to say no and fuck off. ",
                    "score": 367,
                    "author": "BLlZER",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "It sucks either way because they still lose friends and family. ",
                            "score": 227,
                            "author": "damontoo",
                            "replies": []
                        },
                        {
                            "level": 2,
                            "comment": "Some people do. It still doesn't go well. ",
                            "score": 52,
                            "author": "Unoriginal_Man",
                            "replies": []
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 79,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "To shreds you say?",
                            "score": 131,
                            "author": "Smurfaloid",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Between the lawyer, trust and well-crafted statement, I think this kid has it more together than most lottery winners.",
            "score": 748,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Absolutely. It's just odd to me that he's making his name known even after accepting through his trust. ",
                    "score": 174,
                    "author": "bamboo_boogie_boots_",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "I think Florida publishes names. Accepting prize requires consent for release. Even if he has a trust. ",
                            "score": 258,
                            "author": "spikus93",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "OK makes way more sense then. Still think his immediate actions show that it may be the rare case of responsibility. Well see",
                                    "score": 42,
                                    "author": "bamboo_boogie_boots_",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He should've locked his Facebook account down.",
                                            "score": 13,
                                            "author": "rabidstoat",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This is how you end up in a plane crash lost on an island.",
            "score": 73,
            "author": "mathiasd",
            "replies": []
        },
        {
            "level": 0,
            "comment": "That's a strange way to spell hookers and blow.",
            "score": 1620,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 381,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "[removed]",
                            "score": 312,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "His dead pan delivery is what makes it ",
                                    "score": 178,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Masterful delivery. ",
                                            "score": 61,
                                            "author": "IMayBeSpongeWorthy"
                                        },
                                        {
                                            "level": 4,
                                            "comment": "[That look at the end... He knows exactly what he's doing.](https://i.imgur.com/kP76gWJ.png)",
                                            "score": 38,
                                            "author": "Dodgiestyle",
                                            "replies": []
                                        },
                                        {
                                            "level": 4,
                                            "comment": "Chill as fuck",
                                            "score": 38,
                                            "author": "[deleted]"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Annnnnnnd it's gone.",
            "score": 68,
            "author": "BaeSeanHamilton"
        },
        {
            "level": 0,
            "comment": "Fortunately in my country you wouldn't be forced to go public with your winnings... (not that it would matter to me anyway).\n\nIf he's smart he'll hide for the next five years, maybe go to Uni in Europe or something so he can keep this quiet until this is forgotten locally.\n\nThat kind of money must ruin relationships around you.",
            "score": 283,
            "author": "raph_84",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; If he's smart he'll hide for the next five years, maybe go to Uni in Europe or something so he can keep this quiet until this is forgotten locally.\n\nIf he's really smart he'll withdraw it all as cash and have a boating accident.",
                    "score": 132,
                    "author": "b734e851dfa70ae64c7f",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "What is this, the plot of some Adam Sandler movie?",
                            "score": 39,
                            "author": "DrZiggyBowie",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "This should go well.",
            "score": 541,
            "author": "its_a_metaphor_morty",
            "replies": [
                {
                    "level": 1,
                    "comment": "He's a Florida man what could possibly go wrong?",
                    "score": 303,
                    "author": "xbungalo",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Hookers, drugs, guns, I hear Bad Boys 3 is in the making already.",
                            "score": 55,
                            "author": "[deleted]"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "Just read that reddit post about how most people who win the lottery end up bankrupt and bitter. ",
            "score": 124,
            "author": "PokemonTrainerJib",
            "replies": [
                {
                    "level": 1,
                    "comment": "Basically, once you've actually sorted out what you're doing with the money, change your name and disappear.",
                    "score": 74,
                    "author": "AussieITE",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "This news is only uplifting for 1 person",
            "score": 489,
            "author": "TheWildRedDog",
            "replies": [
                {
                    "level": 1,
                    "comment": "Don't forget all of his \"friends\" and \"family\" that will benefit from this!",
                    "score": 131,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good luck dude! Having so much money that young can go horribly wrong.",
            "score": 346,
            "author": "BenderDeLorean",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm gonna live poor, die poor, and I'll probably be reincarnated as a tape worm in a cow's intestine.",
            "score": 155,
            "author": "DarkKitarist",
            "replies": []
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 89,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "if i won the lottery i would take a surprise vacation and not tell anyone. maybe even a road trip and just stay moving for a week or two until peoples attentions spans focus something else.",
                    "score": 49,
                    "author": "Quadip",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 276,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "[deleted]",
                    "score": 68,
                    "author": "[deleted]",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Good on the chap.",
            "score": 29,
            "author": "EpicRob420"
        },
        {
            "level": 0,
            "comment": "He's already screwing up. I hope everything turns out good for him but he should have kept his mouth shut and deleted that damn FB page.",
            "score": 24,
            "author": "Ba_B_Boomer",
            "replies": [
                {
                    "level": 1,
                    "comment": "I just took a peek and he's still posting to it as of 2 hours and the begging is insane.  He needs to delete all social media and lay low till it blows over.  Travel the world and hope people forget you.   \n\nPolice always tell us to hide the expensive Xmas item boxes at trash day so thieves won't know what you got can you imagine his life now? ",
                    "score": 12,
                    "author": "Redshoe9"
                }
            ]
        },
        {
            "level": 0,
            "comment": "God dam. Lucky ass 20 year old. I’m 22 and if i had 451 million dollars I would buy as many huskies as I could and open the worlds largest husky farm! ",
            "score": 24,
            "author": "MasterLgod",
            "replies": []
        },
        {
            "level": 0,
            "comment": "Ya know when I first saw this, I thought \"there is a life that is about to get fucked up\". But after reading this; maybe not. I am now curious about where this guy will be in 5 years; If he will actually become a positive force in the world. That would be nice...  ",
            "score": 20,
            "author": "yobagoa",
            "replies": []
        },
        {
            "level": 0,
            "comment": "I'm taking bets on this one. \n\n5 years from now:\n\nDead? \nor\nBroke?",
            "score": 290,
            "author": "free_candy_4_real",
            "replies": [
                {
                    "level": 1,
                    "comment": "I say he's going to be broke then dead. 20 years old and people know his name now. ",
                    "score": 159,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "A friend tagged me on this kid's FB page so I could see the insanity he was seeing. It's insane how many people are commenting on his public posts. I even saw a few people sharing sob stories about needing some money for college.",
                            "score": 165,
                            "author": "[deleted]",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "Please exploit their exploitation for karma. Screenshot that shit and chuck it on r/SadCringe or something.",
                                    "score": 204,
                                    "author": "Ninganah",
                                    "replies": []
                                },
                                {
                                    "level": 3,
                                    "comment": "Why does he even HAVE a Fb still ? ??",
                                    "score": 51,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "He likes it?  [Fb](https://i.imgur.com/S3z0bqg.png)",
                                            "score": 11,
                                            "author": "[deleted]",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "level": 1,
                    "comment": "Even at a conservative return of 5%, he'll make around a million a month just on the interest.  And if he waits a year before taking any returns, he can pay a very low long term capital gains tax rate, not close to 40% like income rates.  Just shave few million off the top to get through that first year.  Or fuck it, pay the higher rate if you want your freedom.\n\nEither way, it is insanely difficult for an individual to spend a million dollars a month.  And he still has the principal.\n\nThat's almost impossible to fuck up.\n\nTrue fuck you money.",
                    "score": 56,
                    "author": "Foxivondembergen",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "That's what I love about this sub, the uplifting comments 😊",
                    "score": 23,
                    "author": "RalphiesBoogers"
                }
            ]
        },
        {
            "level": 0,
            "comment": "Buy a house, your folks a house, a sweet ride and invest the rest or put it in something that isn't taxed to death every year...     or buy gold..   \n\nGood luck!",
            "score": 151,
            "author": "Mud_Landry",
            "replies": [
                {
                    "level": 1,
                    "comment": "That makes sense if you win a 20 or 30 million dollar lottery. This is 451, which is fuck you money. Apparently he took the lump sum of 282 million and idk what the taxes are like but lets say he ends up with 170-200 million dollars. He could spend 150 million dollars on lavish stuff, and then still have 20-30 million left over that would make him enough on interest to survive a pretty luxurious lifestyle. ",
                    "score": 133,
                    "author": "[deleted]",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "20 or 30 million isn't fuck you money?",
                            "score": 82,
                            "author": "BenjiBoo420",
                            "replies": [
                                {
                                    "level": 3,
                                    "comment": "[deleted]",
                                    "score": 141,
                                    "author": "[deleted]",
                                    "replies": [
                                        {
                                            "level": 4,
                                            "comment": "Do you get paid in Zimbabwe Dollars?",
                                            "score": 87,
                                            "author": "goalmeister",
                                            "replies": [
                                                {
                                                    "level": 5,
                                                    "comment": "[deleted]",
                                                    "score": 35,
                                                    "author": "[deleted]",
                                                    "replies": [
                                                        {
                                                            "level": 6,
                                                            "comment": "The same as Venezuelan Petro coin to TomatoCoin.",
                                                            "score": 15,
                                                            "author": "goalmeister"
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "level": 3,
                                    "comment": "It’s a lot of money, but it’s not “buy a star island house and still have fuck you money” money",
                                    "score": 42,
                                    "author": "glemnar",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "\n\"If there is one thing I have learned thus far in my short time on this earth it is that those who maintain a positive mindset and stay true to themselves get rewarded,\"\n\nTotally agree,\n\nBut, Mother fucker, you bought a lottery ticket...\n\nYou could have walked in and face fucked the clerk and called him a bitch ass whore and still won...",
            "score": 36,
            "author": "thejaypalmershow"
        },
        {
            "level": 0,
            "comment": "I'll tell you what I'd do. Two chicks at the same time. ",
            "score": 16,
            "author": "NealR2000"
        },
        {
            "level": 0,
            "comment": "[deleted]",
            "score": 79,
            "author": "[deleted]",
            "replies": [
                {
                    "level": 1,
                    "comment": "Except that he does have it easy and didn't build shit, so yeah of course his friend and family will feel jealously and think he has it easy so they'll want a few handouts. ",
                    "score": 28,
                    "author": "nanoH2O",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "Please guy - I used to work for the lottery.\n\nGive each of your close family members a million.\n\nThrow your Phone in the toilet and book a room on the QE2 (or a cruise ship that’s in actually in service) with no end date. Don’t worry about the cost, you’ll struggle to spend the interest on the trip.\n\nJust float for a year or five while things settle down. You’ll be collecting 30 mill a year in interest.\n\nGo have some crazy experiences for a decade and get accustomed to the fact that anything you want you can have. Except your health and happiness. Cash won’t sort them out so you need the ten years to do that yourself.\n\nGood luck.",
            "score": 107,
            "author": "beefstockcube",
            "replies": [
                {
                    "level": 1,
                    "comment": "&gt; Throw your Phone in the toilet and book a room on the QE2 with no end date.\n\nBut first go back in time 10 years when that ship was last in service.",
                    "score": 60,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "The QE2 has been retired now for nearly a decade, maybe with that much money he could just buy the ship for himself.",
                    "score": 20,
                    "author": "Triggerh1ppy420",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "Best advice in my opinion. Don’t try to fix all of humanity, it’s already broke AF. Sort out those closest to you for the last few years, bin your social media, your phone and anything else that connects you your current life. It doesn’t exist anymore. ",
                    "score": 18,
                    "author": "RollingTrojan",
                    "replies": []
                }
            ]
        },
        {
            "level": 0,
            "comment": "I guess in America you can't be anonymous winner but in the UK it baffles me why people go public, like the lotto lout for example people would threaten and even try to kidnap his kid, not a chance would I go public!\n\n",
            "score": 56,
            "author": "fishinbuttersauce",
            "replies": []
        },
        {
            "level": 0,
            "comment": "So many people putting this dude in the dirt before anything has happened. My man instantly took a course in financial management and walked in the store with his lawyer. The way he addressed himself and spoke to the press tells me that the money will be used responsibly. ",
            "score": 187,
            "author": "MartYnnnn",
            "replies": [
                {
                    "level": 1,
                    "comment": "And yet still has his Facebook page public with his picture plastered all over it. I hope the best for him but he seriously needs to disappear for a few years, he’s instantly become a target to some not so nice people. Extortion, kidnapping/ransom, blackmail, etc. are no fun. ",
                    "score": 36,
                    "author": "[deleted]",
                    "replies": []
                },
                {
                    "level": 1,
                    "comment": "So now he's \"your man\" all of a sudden? Whatchu want?",
                    "score": 265,
                    "author": "Ninganah",
                    "replies": [
                        {
                            "level": 2,
                            "comment": "Lmao",
                            "score": 58,
                            "author": "esteflo"
                        }
                    ]
                }
            ]
        },
        {
            "level": 0,
            "comment": "I would be a total dickhead and say something a long the lines of \"I hope this is enough to pay for college.\" ",
            "score": 23,
            "author": "Asshole_from_Texas",
            "replies": []
        },
        {
            "level": 0,
            "comment": "His high school crushes that rejected him years ago suddenly want him...\"heeeyyyyyy 🙂...\"",
            "score": 12,
            "author": "Vikent"
        }
    ]
}